{
    "news": [
        {
            "title": "Labour Court overturns Immigration Officer’s dismissal over sexual harassment allegations",
            "url": "https://www.newzimbabwe.com/labour-court-overturns-immigration-officers-dismissal-over-sexual-harassment-allegations/",
            "content": "By Mary Taruvinga\n\nThe Labour Court has overturned the dismissal of former Immigration Department officer Herbert Admire Makani, ruling that the Civil Service Commission (CSC) bungled the disciplinary process and misdirected itself in law.\n\nMakani was fired in August 2021 after being found guilty of sexually harassing a former colleague, Fortune Nyamuremba, through alleged calls and text messages between 2011 and 2014, as well as for alleged indecorous conduct.\n\nBut Justice Bridget Chivizhe, in a judgment delivered recently said the CSCs case was riddled with procedural flaws and a lack of evidence.\n\nThe Disciplinary Committee merely pronounced the appellant guilty and recited the alleged facts, Justice Chivizhe said.\n\nIt failed to clearly link those facts to the specific charges or to distinguish which conduct constituted a contravention of paragraph 4 and which fell under paragraph 7 of the Public Service Regulations, 2000.\n\nThe court found that the Commission misrepresented Makanis testimony by claiming he had not denied contacting Nyamuremba,a statement contradicted by the official record.\n\nAt page 6 of the minutes the appellant categorically denied the allegations.\n\nFurther when specifically asked whether he had ever called Ms Nyamuremba, the appellant responded unequivocally that he had never phoned her, the court noted.\n\nChivizhe also ruled that the CSC failed to provide key evidence, such as the alleged messages or phone numbers involved.\n\nIn the absence of such evidence, the Disciplinary Authority could not reasonably or lawfully conclude that the elements of the offence were satisfied, she said.\n\nA finding of guilt in such circumstances is unsupported by the evidentiary record and cannot stand.\n\nThe judge stressed that the CSC wrongly shifted the burden of proof onto Makani.\n\nIt is a cardinal principle of the law of procedure that he who alleges must prove Where he fails to prove, his case will not stick, Justice Chivizhe wrote.\n\nThe onus was on the respondent to establish the appellants guilt. The appellant did not carry the burden of proof.\n\nCiting theKazingiingizi v Dzinorumaprecedent, the court warned that decisions without clear reasoning are susceptible to being perceived as arbitrary or capricious.\n\nThe court allowed the appeal with costs and ordered that Makani be reinstated without loss of salary or benefits from the date of dismissal. If reinstatement is impossible, the CSC must pay damages to be agreed upon within 30 days.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The Labour Court has overturned the dismissal of former Immigration Department officer Herbert Admire Makani, ruling that the Civil Service Commission (CSC) bungled the disciplinary process and misdirected itself in law. Makani was fired in August 2021 after being found guilty of sexually harassing a former colleague, Fortune Nyamuremba, through alleged calls</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-court-overturns-immigration-officers-dismissal-over-sexual-harassment-allegations/\">Labour Court overturns Immigration Officer’s dismissal over sexual harassment allegations   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        },
        {
            "title": "President Mnangagwa urges national development support on Heroes Day",
            "url": "https://www.newzimbabwe.com/president-mnangagwa-urges-national-development-support-on-heroes-day/",
            "content": "Xinhua\n\nZimbabwean President Emmerson Mnangagwa on Monday urged citizens to support national development in honor of the fallen heroes during the liberation struggle while addressing the 45th Heroes Day celebration in Harare, the countrys capital.\n\nMnangagwa noted that to immortalize the sacrifices made by war heroes and heroines who lost their lives during the liberation struggle against colonial rule, the government is spearheading various economic development projects nationwide to enhance the quality of life for citizens.\n\nIndependence in 1980 brought about political independence, while the struggle for the economy remains ongoing, said Mnangagwa, adding that in honor of those who sacrificed their lives for the liberation of the country, all Zimbabweans should equally play a leading role in spurring economic growth.\n\nDespite challenges characterized by the effects of illegal sanctions, fluctuating international mineral commodity prices, and a fluid global trade environment, our economy is demonstrating remarkable resilience, said Mnangagwa.\n\nThe countrys bumper harvest in wheat, maize, and traditional grains, record levels in tobacco production, along with the rebound growth of the national herd and increased milk production, are testament to the hard work and perseverance of Zimbabweans, he said.\n\nWe, thus, celebrate farmers and stakeholders in the agriculture sector, who continue to be worthy custodians of the land which our heroes and heroines paid for with their precious blood, he added.\n\nHe said notable growth has also been recorded in the iron and steel sector, cement production, and food processing, among others.\n\nAs a nation richly endowed with mineral resources, we are determined to ensure that these translate into economic benefits for all citizens and empowerment of host communities, Mnangagwa added.\n\nHeroes Day is a public holiday in Zimbabwe, annually observed on the second Monday of August to pay tribute to fallen heroes.\n\nSenior government officials, diplomats, and families of fallen heroes also took part in the activity at a gathering at the National Heroes Acre, where honors and awards were conferred on living and departed heroes for their outstanding accomplishments in Zimbabwe.\n\nZimbabwean President Emmerson Mnangagwa addresses the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\nZimbabwean President Emmerson Mnangagwa (C) bows to a monument during the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\nPeople take part in the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12052650/ED-heroes.jpeg",
            "description": "<p> Xinhua Zimbabwean President Emmerson Mnangagwa on Monday urged citizens to support national development in honor of the fallen heroes during the liberation struggle while addressing the 45th Heroes Day celebration in Harare, the country’s capital. Mnangagwa noted that to immortalize the sacrifices made by war heroes and heroines who lost their lives during the liberation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-mnangagwa-urges-national-development-support-on-heroes-day/\">President Mnangagwa urges national development support on Heroes Day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        },
        {
            "title": "CAF approves National Sports Stadium for category two matches",
            "url": "https://www.newzimbabwe.com/caf-approves-national-sports-stadium-for-category-two-matches/",
            "content": "By Sports Reporter\n\nThe Confederation of African Football (CAF) has approved Zimbabwes National Sports Stadium to host category two international games.\n\nThis was revealed on Monday by the African football mother board, provided an update on homologated and non-homologated stadia around the continent.\n\nAlthough the National Sports Stadium is not yet in category one to host the Warriors international games, the ground qualified under category two, where it can host under-23, 20 and 17 AFCON qualifiers\n\nThe giant stadium is currently having a facelift so that it can host category one games. Bucket seats were fully furnished and new electronic turnstiles fitted.\n\nHowever, a few areas still need to tick the boxes when it comes to required standards, such as ablution facilities, changing rooms, among others.\n\nZimbabwe last hosted an international game on home ground in 2021 before it was banned by FIFA in 2022. Since its re-admission, the Warriors are yet to play a match on home soil.\n\nMeanwhile, the approval of the National Sports Stadium to host category two games means that CAF Champions League representatives Simba Bhora can play their home games at the National Sports Stadium.\n\nThe Shamva-based side is set to play Nsingizi Hotspurs from Eswatini in the first round of the preliminary stages next month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12045621/national-sports-stadium.jpg",
            "description": "<p>By Sports Reporter The Confederation of African Football (CAF) has approved Zimbabwe’s National Sports Stadium to host category two international games. This was revealed on Monday by the African football mother board, provided an update on homologated and non-homologated stadia around the continent. Although the National Sports Stadium is not yet in category one to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caf-approves-national-sports-stadium-for-category-two-matches/\">CAF approves National Sports Stadium for category two matches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        },
        {
            "title": "Woman killed for turning down love proposal",
            "url": "https://www.newzimbabwe.com/woman-killed-for-turning-down-love-proposal/",
            "content": "By Staff Reporter\n\nTWO youths from Redcliff in Kwekwe have been arrested for fatally assaulting a 40-year-old woman for turning down advances from one of them.\n\nThe now deceased was identified as Rosemary Diana.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Kwekwe arrested Thembinkosi Ndlovu (22) and Nkosinomusa Moyo (24) in connection with a case of murder which occurred on August 10, 2025, at a bar at Mutegude Shops, Redcliff where Rosemary Diana (40) died, said Nyathi.\n\nThe suspects attacked the victim after she had rejected Moyos romantic advances.\n\nNdlovu struck the victim with a cooking stick allover the body while Moyo stabbed her with a knife on the back, added Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter TWO youths from Redcliff in Kwekwe have been arrested for fatally assaulting a 40-year-old woman for turning down advances from one of them. The now deceased was identified as Rosemary Diana. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in Kwekwe arrested Thembinkosi Ndlovu (22) and Nkosinomusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-killed-for-turning-down-love-proposal/\">Woman killed for turning down love proposal </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        },
        {
            "title": "ZimUK Business Chamber to host inaugural Diaspora Trade and Investment Indaba in Harare",
            "url": "https://www.newzimbabwe.com/zimuk-business-chamber-to-host-inaugural-diaspora-trade-and-investment-indaba-in-harare/",
            "content": "By Own Correspondent\n\nThe ZimUK Business Chamber (ZimUKBC), a UK-based business network with strong connections across the United Kingdom, Zimbabwe, Southern Africa, and internationally, will host its inaugural Diaspora Trade and Investment Indaba in Harare, Zimbabwe, on 21 and 22 August 2025 at the Hyatt Regency Harare, The Meikles.\n\nThis landmark gathering will bring together UK-based investors, Zimbabwean business leaders, government officials, trade partners, and industry experts to explore and strengthen trade and investment relations between Zimbabwe and the United Kingdom. The event will mark the launch of an annual initiative designed to foster long-term partnerships that promote sustainable economic growth and development.\n\nZimUKBCs primary mission is to connect people in business, facilitate peer networking, support enterprise growth, and empower small and medium-sized businesses to reach their full potential. With members drawn largely from Zimbabwe and Southern Africa, the organisation supports businesses across diverse sectors including health and social care, retail, agro-business, manufacturing, finance, services, and technology.\n\nIt also serves as a powerful voice in policy discussions, ensuring that the interests of its members are heard at the highest levels. The Trade and Investment Indaba will serve as a platform to promote Zimbabwes untapped potential, encourage joint ventures between UK investors and Zimbabwean SMEs, and showcase opportunities across industries such as agriculture, mining, manufacturing, tourism, infrastructure, finance, technology, and logistics.\n\nIn convening this event, ZimUKBC will work closely with key national agencies and institutions, including the Zimbabwe Investment and Development Agency (ZIDA), ZimTrade, the Zimbabwe National Chamber of Commerce (ZNCC), and the Confederation of Zimbabwe Industries (CZI), all of which share the vision of expanding exports, attracting foreign investment, and fostering bilateral trade.\n\nThe Indaba will feature high-level business-to-business networking sessions, thought-provoking presentations, and a celebratory gala dinner to mark the launch of this new tradition. Distinguished guests will include a senior trade and investment official from the British Embassy in Zimbabwe, adding to the significance of the occasion.\n\nKennedy Mwedziwendira, Chairman and Founder of ZimUKBC, expressed his excitement about the event, describing it as a pivotal moment for diaspora-driven investment and trade.\n\nThis Indaba will be a pivotal platform to build meaningful partnerships between UK investors and Zimbabwean businesses, particularly within the diaspora community. We are excited to establish it as an annual event that accelerates investment, trade, and sustainable economic growth, he said. The ZimUK Business Chamber sees this first gathering as the foundation for stronger economic bridges between Zimbabwe and the United Kingdom, with the potential to contribute significantly to the countrys development while opening new opportunities for UK investors in one of Africas most promising markets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/11205916/zimbabwe-connecting-people.jpg",
            "description": "<p>By Own Correspondent The ZimUK Business Chamber (ZimUKBC), a UK-based business network with strong connections across the United Kingdom, Zimbabwe, Southern Africa, and internationally, will host its inaugural Diaspora Trade and Investment Indaba in Harare, Zimbabwe, on 21 and 22 August 2025 at the Hyatt Regency Harare, The Meikles. This landmark gathering will bring together</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimuk-business-chamber-to-host-inaugural-diaspora-trade-and-investment-indaba-in-harare/\">ZimUK Business Chamber to host inaugural Diaspora Trade and Investment Indaba in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        },
        {
            "title": "UN experts urge Zimbabwe to make gender equality ‘lived reality’",
            "url": "https://www.newzimbabwe.com/un-experts-urge-zimbabwe-to-make-gender-equality-lived-reality/",
            "content": "APA News\n\nUnited Nations experts have called on Zimbabwe to take urgent action against child marriage and teenage pregnancy, warning that entrenched patriarchal norms continue to undermine the rights and futures of millions of girls.\n\nConcluding a formal visit, the UN Working Group on discrimination against women and girls urged the government to invest in girls education, safety and rights, stating that gender equality must become a lived reality rather than a constitutional aspiration.\n\nGender equality must be more than a promise on paper  it must become a lived reality for every woman and girl in Zimbabwe, the group said.\n\nThe experts noted that despite the governments efforts, persistent discrimination and entrenched patriarchal norms continue to deny girls their fundamental rights and limit their future opportunities.\n\nZimbabwe must actively confront and eradicate patriarchal attitudes that undervalue girls, creating a society which nurtures their potential as future leaders, innovators and changemakers.\n\nDespite the enactment of the Marriages Act (2022), which criminalises child marriage and sets 18 as the legal minimum age, no prosecutions have been recorded.\n\nThe experts revealed that 1.4 million women in Zimbabwe were married before age 18 and 241,000 before 15.\n\nTeenage pregnancy remains high at 23 percent, with 43 percent of adolescents becoming sexually active before 18.\n\nThe experts noted that girls face stigma, misinformation and limited access to youth-friendly reproductive health services, while many are forced to leave school, undermining their long-term well-being and independence.\n\nThey also raised alarm over child sexual abuse and gender-based violence, particularly affecting girls left behind by migrant parents, those with disabilities and members of religious sects.\n\nCalling for stronger enforcement and public awareness, the working group urged the Harare authorities to expand trauma-informed training for law enforcement and the judiciary, and to adequately fund shelters and one-stop centres, which they described as essential services and a core state responsibility.\n\nThe experts stressed the need to ensure that gender equality is embraced as a societal value that benefits all.\n\nGender equality is not a zero-sum goal  men and boys also stand to benefit significantly from a more just and equal society, they said.\n\nThe final report of the visit will be presented to the UN Human Rights Council in June 2026.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04025833/Teenage-Pregnancy.png",
            "description": "<p>APA News United Nations experts have called on Zimbabwe to take urgent action against child marriage and teenage pregnancy, warning that entrenched patriarchal norms continue to undermine the rights and futures of millions of girls. Concluding a formal visit, the UN Working Group on discrimination against women and girls urged the government to invest in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-experts-urge-zimbabwe-to-make-gender-equality-lived-reality/\">UN experts urge Zimbabwe to make gender equality ‘lived reality’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        },
        {
            "title": "Mozambique receives donation from Zimbabwe to support victims of Cyclone Chido",
            "url": "https://www.newzimbabwe.com/mozambique-receives-donation-from-zimbabwe-to-support-victims-of-cyclone-chido/",
            "content": "MZ News\n\nOver the weekend, the Zimbabwean government handed over a donation of food, seeds and building materials to support the victims of Cyclone Chido, which hit Mozambique last December.\n\nThe ceremony, held in Chimoio, the capital of the central province of Manica, was attended by the Presidents of Mozambique, Daniel Chapo, and Zimbabwe, Emmerson Mnangagwa.\n\nAccording to aAIM the donation includes 41 tons of sugar, 60 tons of wheat, 30 tons of maize flour, 11 tons of maize seeds and 1,740 sheets of IBR roofing. According to the authorities, the material will be distributed primarily in the provinces of Niassa and Cabo Delgado, which were severely affected by the cyclone.\n\nThe cyclone, which also affected other southern African countries, caused human losses, destruction of infrastructure and swept away extensive agricultural areas in central and northern Mozambique.\n\nDuring the 2024/2025 rainy season, the country was hit by three tropical cyclones  Chido, Dikeledi and Jude, which caused more than 300 deaths and affected around 2 million people.\n\nAt the reception of the donation, President Daniel Chapo, praised Zimbabwes gesture of solidarity, saying that the support will serve to improve the living conditions of the population that is still suffering the impacts of these natural disasters.\n\nChapo stressed that the relationship between Mozambique and Zimbabwe transcends diplomatic contact and is rooted in the brotherhood forged during the liberation struggles. He also recalled that, in 2022, Zimbabwe provided support to the victims of terrorism in Cabo Delgado with 1,000 tons of corn, 45 tons of soybeans and other goods.\n\nFor his part, Zimbabwean President Emmerson Mnangagwa said he was extremely happy to return to Chimoio, in the center of the country, a place he considers symbolic in the history of his countrys liberation struggle.\n\nAs peoples with similar cultures, when one is suffering, it must support the other, said Mnangagwa, stressing that natural disasters have no borders and require constant solidarity.\n\nThe statesman assured that the friendship between Mozambique and Zimbabwe will last forever and reaffirmed the commitment to continue cooperating in various areas, including the economy, security and social development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/11193946/moza-donation.jpg",
            "description": "<p>MZ News Over the weekend, the Zimbabwean government handed over a donation of food, seeds and building materials to support the victims of Cyclone Chido, which hit Mozambique last December. The ceremony, held in Chimoio, the capital of the central province of Manica, was attended by the Presidents of Mozambique, Daniel Chapo, and Zimbabwe, Emmerson</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambique-receives-donation-from-zimbabwe-to-support-victims-of-cyclone-chido/\">Mozambique receives donation from Zimbabwe to support victims of Cyclone Chido</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        },
        {
            "title": "The controversy surrounding Gayton McKenzie: Racial slurs and political accountability",
            "url": "https://www.newzimbabwe.com/the-controversy-surrounding-gayton-mckenzie-racial-slurs-and-political-accountability/",
            "content": "IOL\n\nSouth Africas Sports, Arts and Culture MinisterGayton McKenziehas come under intense scrutiny following his use of a racial slur during a live video, which has reignited longstanding debates about race, language, and accountability in South Africas political landscape.\n\nMcKenzie sparked outrage during a live video when he used the K-word,a racial slur, while responding to racist remarks made by the hosts of theOpen Chats Podcast. His comments were made as he discussed actions taken by the Patriotic Alliance against the podcast hosts.\n\nFollowing the backlash over the live video, McKenzies posts dating back from 2011 and 2013 were uncovered. These tweets contained apartheid-era racial slurs directed at black South Africans, and he criticised the term Black Diamond while using racially charged language widely considered reprehensible in South Africa.\n\nThe ATMfiled formal complaints with the Presidency, Parliament, and the Parliamentary Joint Committee on Ethics and Members Interests. ATM Parliamentary leader Vuyo Zungula described the tweets as racially derogatory slurs that undermine democratic principles.\n\nZungula added that the language employs language steeped in historical racism, the same kind of degrading rhetoric used to strip black people of their humanity during apartheid and colonial eras.\n\nThe party demanded an urgent investigation and called for McKenzies removal, arguing that an unrepentant Minister cannot credibly lead a department tasked with building cultural bridges and fostering unity.\n\nActionSA also lodged a complaint with the SAHRC over McKenzies live video remarks andthe resurfaced tweets.\n\nActionSA Member of Parliament Alan Beesley emphasised the partys commitment to combating racism, stating: We are confronting racism in all its forms by holding a sitting Cabinet Minister accountable for comments that no reasonable person can defend as anything other than racist and demeaning.\n\nHe warned that if necessary, the matter would be escalated to the Equality Court under the Promotion of Equality and Prevention of Unfair Discrimination Act.\n\nMcKenzie denied being racist, claiming the controversy was a politically motivated campaign orchestrated by the Economic Freedom Fighters (EFF)and social media influencers. He admitted to the offensive posts but said they were written in response to racist remarks from others and expressed embarrassment over them.\n\nHe said, This whole campaign to find something racist I ever said is hilarious because you have now gone 13 years back and cant bring out one racist thing I ever said.\n\nThe Economic Freedom Fighters added their voice to calls from ATM and ActionSA, demanding McKenzies immediate removal from his ministerial position.\n\nMcKenzieannounced he would submit himself to an investigation.He said, I can never be guilty of racism, try some other take down but never racism.\n\nHe acknowledged tweeting some insensitive, stupid and hurtful things a decade or two ago, adding, I was a troll [and] stupid.I cringe when seeing them and I am truly sorry for that.\n\nHe denied any racist intent, citing his background: My mother was black and I have children with a black woman. I fought my whole life for the same treatment between black and Coloured people because we fought the same struggle.\n\nWhile McKenzie said he is truly sorry for the comments made years ago, a formal apology has not yet been issued.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181937/Patriotic-Alliance-PA-leader-Gayton-McKenzie-emphasizes-his-stance-on-illegal-immigration-in-South-Africa-ahead-of-the-2026-elections.webp",
            "description": "<p>IOL South Africa’s Sports, Arts and Culture Minister Gayton McKenzie has come under intense scrutiny following his use of a racial slur during a live video, which has reignited longstanding debates about race, language, and accountability in South Africa’s political landscape. McKenzie sparked outrage during a live video when he used the K-word,a racial slur, while</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-controversy-surrounding-gayton-mckenzie-racial-slurs-and-political-accountability/\">The controversy surrounding Gayton McKenzie: Racial slurs and political accountability</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "12 Aug 2025"
        }
    ]
}