{
    "news": [
        {
            "title": "Two killed in dynamites explosion at Kwekwe mine",
            "url": "https://www.newzimbabwe.com/two-killed-in-dynamites-explosion-at-kwekwe-mine/",
            "content": "By Staff Reporter\n\nTWO miners were killed in a devastating explosion at a Kwekwe mine Saturday after one of them unknowingly placed a hot object above hidden explosives, which detonated.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms a tragic incident in which Loveson Nkiwane (41) and Albert Mulima (36) died after an explosion believed to have been caused by heated mine dynamites on March 15, 2025, at Donzic 6 Mine, Kwekwe, said Nyathi.\n\nPreliminary investigations reveal that one of the victims had unknowingly placed a hot iron pick head underground, directly onto a hidden cache of the explosives.\n\nSubsequently, the heat from the pick head ignited the dynamites, causing a devastating explosion which claimed the lives of the victims.\n\nThe ZRP said it is conducting a probe into circumstances surrounding the tragic incident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/12/03195329/Gas-explosion.jpg",
            "description": "<p>By Staff Reporter  TWO miners were killed in a devastating explosion at a Kwekwe mine Saturday after one of them unknowingly placed a hot object above hidden explosives, which detonated. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms a tragic incident in which Loveson Nkiwane (41) and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-killed-in-dynamites-explosion-at-kwekwe-mine/\">Two killed in dynamites explosion at Kwekwe mine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase USA-Canada",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-usa-canada/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. We understand you will be part of the team that will be presenting at theZim Diaspora Property Showcase USA-Canadain Dallas, United States of America, on legal issues affecting diasporansin America and Canada when investing in Zimbabwe. What are we to expect?\n\nVM: Firstly, allow me to thank Seeff Zimbabwe for coming up with the idea of this event and executing it. The exchange of ideas at such events is invaluable.\n\nOur experience in Birmingham, United Kingdom, at the Zim Diaspora Property Showcase UK in July last year taught us that the diaspora property market is hungry for one-on-one interactions with the potential Zimbabwe service provider, specifically those in the real estate sector where most of their investments are housed. This allows for a better understanding of each others operating models.\n\nI am sure my colleagues in the real estate sector of Zimbabwe are preparing something special for the USA and Canada markets at this particular showcase. The attendees will be able to access special deals prepared specifically for the showcase, including structured payment options that the diaspora market normally fails to get access to.\n\nReporter:Are you suggesting that they will be specific deals prepared only for the USA-Canada diaspora market?\n\nVM: Yes.The property showcase is not just to showcase our real estate to the diaspora, it is also to expose the diaspora market to our Zimbabwean businesses. It will be negligent as a business person to use a one size fits all approach in all dealings with the local and various markets in the diaspora.\n\nThe attendees from Zimbabwe will also be using it as a fact  finding conference, to understand the market from that part of the world, their interests, considerations and concerns when investing with the aim to tailor make products that are attractive to that market, taking into consideration their specific needs for a mutually beneficial relationship going forward.\n\nMy understanding is that the organizers of the event will also be intentionally exposing the Zimbabwean real estate businesses to the Dallas real estate sector. It is anticipated that sufficient synergies and networks will be created from that exchange.\n\nREAD MORE: The Premier Zimbabwe Diaspora Property Showcase is coming to the USA!\n\nReporter: What can we expect from your presentation on legal issues affecting property investments?\n\nVM: My mandate at the conference is to educate potential investors on the Zimbabwean legal framework, specifically when it comes to investing in the real estate sector. My presentation will cover a variety of issues, example, the property titles that are in Zimbabwe, how to conduct a due diligence on the various property titles, other legal issues that affect your investment in Zimbabwe, if a member of the diaspora, issues to do with Zimbabwe registered marriages, death et cetera.\n\nIf the investors are foreign, we will also discuss the property investment regulatory framework with the aim of ensuring that the investments are safe and protected and also that the investor is able to repatriate capital and profits on disinvestment.\n\nReporter: Will that include how to avoid being duped when investing in property from the diaspora?\n\nVM: That will be one of the topics in the presentation. The overarching aim of the presentation is to safeguard potential buyers against fraudsters. Our economy is in transition, with a lot of real estate developments mushrooming across our cities. There are notable and significant gains in value on existing real estate as a result of this real estate development boom. This creates a lot of opportunities for investors and also fraudsters.\n\nOur local property developers have also been creative in their fundraising initiatives to complete developments when access to mainstream finance is limited. This, however, motivates for thorough due diligence by professionals to ensure that the development financial and legal structures are sound and also that the investor is sufficiently protected.\n\nReporter: How do you engage a lawyer from the diaspora and track your property transaction?\n\nVM: Most of our lawyers across Zimbabwe can be found online if the investor cannot get a lawyer by reference. If in doubt of the lawyers track record, our Law Society of Zimbabwe is available to assist people with various enquiries on the legal practitioners in Zimbabwe.\n\nReporter: Thank you, Mr. Madzima we have to end here because of our time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor www.mcmlegal.co.zw\n\nFor those looking to attend the Zim Diaspora Property Showcase USA-Canada, please sign up by connecting with the event organizers atwww.zimpropertyshowcaseusa.com.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23072005/SEEFFUK-24145of205-scaled.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. We understand you</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-usa-canada/\">Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase USA-Canada</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Ngezi Platinum coach Chiragwi preaches consistency following victory over Scottland",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-coach-chiragwi-preaches-consistency-following-victory-over-scottland/",
            "content": "By Sports Reporter\n\nAFTER recording its first victory of the season Friday against newboys Scottland at Rufaro Stadium, Ngezi Platinum coach Takesure Chiragwi is hoping his team will be consistent in picking positive results going forward.\n\nFridays 1-0 win over the Mabvuku-based side came as a relief for Chiragwi, who had picked two draws in the leagues first two games against Kwekwe United and Green Fuel.\n\nWith a title contenders tag on their back, the Mhondoro-based sides slow start had written them off to pick maximum points at Rufaro but alas, super substitute Tinashe Mavhudzi won them a penalty which was converted by captain Kudzai Chigwida to earn themselves three points.\n\nAlthough a win over Scottland was important, Chiragwi believes its already water under the bridge rather they have to look forward and be consistent.\n\nI just hope that this win is going to give us confidence going forward.\n\nWhat is important is to have the consistency in performance, consistency in our tactical approach and consistency in winning.\n\nAs of now, we just need to celebrate and shift our focus to our next game, said Chiragwi.\n\nNgezi Platinum lost two of its key players, goalkeeper Nelson Chadya who had been with the club since its promotion in 2016 and industrious defender Gareth Madhake.\n\nOther than these two, the team also lost promising youngster Walter Vhuwa to Chicken Inn and others.\n\nHowever, Chiragwi seems to have done justice to fill in all void positions as he brought on board Canadian developed Zimbabwean goalkeeper Darlington Murasiranwa and hardworking defender Nyasha Gurende from ZPC Kariba.\n\nThe 2023 league Coach of The Year has also promoted a number of youngsters from the clubs development side, amongst those is Tinaashe Mavhudzi and Tinotenda Ditima, who changed the game for him from the bench.\n\nMadamburo are set to play Triangle next when the league resumes after the FIFA international break.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/02223444/Takesure-Chiragwi.jpg",
            "description": "<p>By Sports Reporter AFTER recording its first victory of the season Friday against newboys Scottland at Rufaro Stadium, Ngezi Platinum coach Takesure Chiragwi is hoping his team will be consistent in picking positive results going forward. Friday’s 1-0 win over the Mabvuku-based side came as a relief for Chiragwi, who had picked two draws in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-coach-chiragwi-preaches-consistency-following-victory-over-scottland/\">Ngezi Platinum coach Chiragwi preaches consistency following victory over Scottland</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Transport ministry announces road closure to pave way for Dema Toll Plaza construction",
            "url": "https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-pave-way-for-dema-toll-plaza-construction/",
            "content": "By Staff Reporter\n\nTHE Ministry of Transport and Infrastructural Development (MTID) has issued a notice informing the public of the temporary closure of the road at the 60km peg from Harare CBD to facilitate the construction of Dema Toll Plaza.\n\nIn a public notice, the ministry said the closure will last approximately five months, effective March 17, 2025, until August 31, 2025.\n\nThis project is being carried out in accordance with Statutory Instrument 47 of 2021 (Declaration of State of Disaster, Road Infrastructure Network), with CMED Contracting serving as the contractor.\n\nTo ensure the safety of all road users and facilitate the safe execution of construction works, the following section of the road will be temporarily closed: Chitungwiza-Hwedza Highway at the 60km peg from Harare CBD. Closure Period: 17th March 2025 to 31st August 2025, reads the notice.\n\nRoad users have been instructed to use the available detour, in order to minimise disruptions during the road rehabilitation works.\n\nDuring this period, all road users are advised to utilise the constructed detour as an alternative access point.\n\nThe Ministry sincerely regrets any inconvenience caused and appreciates the publics cooperation and understanding during this period, reads the notice.\n\nThe state of roads in Zimbabwe has become a major concern for motorists, who have reported severe deterioration in highway conditions.\n\nMany have shared videos and images online showcasing the numerous potholes and uneven surfaces. Government has been jerked into action following a viral picture of three people posing in a huge pothole, believed to be along the Bulawayo-Victoria Falls highway, which is in a deplorable state.\n\nWhile the government has initiated a road rehabilitation programme, the slow progress of these repairs does not meet the urgent need for improvements, leaving many roads in a perilous state.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/04044532/zimbabwe_tollgate.jpg",
            "description": "<p>By Staff Reporter  THE Ministry of Transport and Infrastructural Development (MTID) has issued a notice informing the public of the temporary closure of the road at the 60km peg from Harare CBD to facilitate the construction of Dema Toll Plaza. In a public notice, the ministry said the closure will last approximately five months, effective</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-pave-way-for-dema-toll-plaza-construction/\">Transport ministry announces road closure to pave way for Dema Toll Plaza construction </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "I won’t stop asking until I know the fate and whereabouts of my husband’— says wife of missing Itai Dzamara 10 years after disappearance",
            "url": "https://www.newzimbabwe.com/i-wont-stop-asking-until-i-know-the-fate-and-whereabouts-of-my-husband-says-wife-of-missing-itai-dzamara-10-years-after-disappearance/",
            "content": "By Thandiwe Garusa\n\nTEN years after the mysterious disappearance of human rights activist-cum-journalist Itai Dzamara, his wife is still searching for answers.\n\nDzamara disappeared on March 9, 2015, after openly criticizing the Zimbabwean government, then led by President Robert Mugabe, over the countrys worsening economic conditions.\n\nA decade later, there has been no trace of him, and his fate remains unknown.\n\nDzamaras wife Sheffra told human rights watchdog Amnesty International Zimbabwe that she longs for his return, emphasising the past 10 years have been painful without closure to the matter.\n\nI will not stop asking until I know the fate and whereabouts of my husband, Sheffra said.\n\nI wish for Itai to one day walk through the front door and hug me and the kids or to wake up to find that this was all a bad dream. If I must live without him, then I need answers, I need to know where he is.\n\nLife has not been the same since Itai was abducted. The last 10 years have been hard. I am reminded of him every time I look at my kids because both look like their dad.\n\nIt hurts not to have Itai in my life and to see my kids missing him and growing up without a father who loved them so dearly. I do not have any answers, but I feel blessed to have my two kids. When I look at them l feel Gods grace, she said.\n\nSheffra also said the police never investigated Dzamaras disappearance or provided any updates, ignoring even a High Court of Zimbabwe order to take action.\n\nShe also accused the government of ignoring the familys requests for answers, dismissing demands from friends, activists, and the international community.\n\nThe police never came back to give any update. As far as I know, they never even investigated the case. They were not interested in finding Itai. Even the High Court of Zimbabwe order could not get the police to find my husband or tell us what happened to him.\n\nAs a family we did everything to get answers. For the past 10 years the government of Zimbabwe has ignored my requests and turned a blind eye to the demand for answers by everyone including friends, activists, civil society organisations, media and the international community.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/24113545/Itai-Dzamara.jpg",
            "description": "<p>By Thandiwe Garusa TEN years after the mysterious disappearance of human rights activist-cum-journalist Itai Dzamara, his wife is still searching for answers. Dzamara disappeared on March 9, 2015, after openly criticizing the Zimbabwean government, then led by President Robert Mugabe, over the country’s worsening economic conditions. A decade later, there has been no trace of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-wont-stop-asking-until-i-know-the-fate-and-whereabouts-of-my-husband-says-wife-of-missing-itai-dzamara-10-years-after-disappearance/\">I won’t stop asking until I know the fate and whereabouts of my husband’— says wife of missing Itai Dzamara 10 years after disappearance </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zimbabwe records 124 cholera cases amid latest outbreak",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-124-cholera-cases-amid-latest-outbreak/",
            "content": "By Xinhua\n\nZIMBABWE has recorded 124 confirmed cases of cholera since the latest outbreak started in November last year, Minister of Health and Child Care Douglas Mombeshora said on Friday.\n\nAddressing a press conference in the national capital of Harare, Mombeshora said Zimbabwe has registered 15 confirmed deaths, 608 suspected cases, and 566 recoveries.\n\nSix out of the countrys 10 provinces have been affected, with the bulk of recent cases reported in Mashonaland Central Province, the minister noted.\n\nAccording to Mombeshora, most cases were identified among artisanal miners along the Mazowe River and the small farming town of Glendale in Mashonaland Central Province.\n\nArtisanal miners move from place to place and as they move, they also spread cholera. As a result, we have seen the persistence of cases coming up from Mashonaland Central Province, especially along the Mazowe River where a lot of gold panning is taking place, he said.\n\nWe are looking at the possibility of getting more vaccines because our stocks have run out. We now have about 4,000 doses only left, which are not enough to deal with the affected areas, the health minister added.\n\nMombeshora also revealed that recurring cholera outbreaks continued to hit Zimbabwe, primarily driven by a lack of sustainable water and sanitation infrastructure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/24110127/cholera.webp",
            "description": "<p>By Xinhua ZIMBABWE has recorded 124 confirmed cases of cholera since the latest outbreak started in November last year, Minister of Health and Child Care Douglas Mombeshora said on Friday. Addressing a press conference in the national capital of Harare, Mombeshora said Zimbabwe has registered 15 confirmed deaths, 608 suspected cases, and 566 recoveries. Six</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-124-cholera-cases-amid-latest-outbreak/\">Zimbabwe records 124 cholera cases amid latest outbreak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Juan Mutudza inspires CAPS United to register first victory of the season",
            "url": "https://www.newzimbabwe.com/juan-mutudza-inspires-caps-united-to-register-first-victory-of-the-season/",
            "content": "By Sports Reporter\n\nJUAN Mutudzas first half brace was enough to earn CAPS United three points against Triangle in a match that ended 2-0 at Green Fuel Arena in Chisumbanje Sunday afternoon.\n\nMarking his first league start at Makepeke, Mutudza did not disappoint as he opened the matchs scoring account in the 15th minute before completing his double 11 minutes later.\n\nThe victory was a relief for the Harare giants, who started the season with a 1-1 draw against Green Fuel before losing to Scottland 2-0 last week.\n\nSo happy was CAPS United coach Lloyd Chitembwe after the match that he applauded his boys for a brave show.\n\nIm happy we have gone about our business today, the first two games we faltered and at some point, we needed to win.\n\nIm extremely happy with the way we played especially the first half, of course our second half was not the best, but we knew they were going to come at us, said Chitembwe during post-match interview.\n\nSundays victory saw Makepekepe recording its first clean sheet of the season, at the same time propelling themselves up on the log table to position nine with four points.\n\nOn the other end, the outcome stretched Triangles winless run to three games without a point.\n\nThe Sugar Boys are the only team that have lost all the three games in the league, and they remain bottom on the standing.\n\nMatchday 3 Castle Lager Premier Soccer League Results\n\nScottland 0-1 Ngezi PlatinumDynamos 1-1 Tel OneManica Diamonds 1-0 ZPC KaribaSimba Bhora 1-0 HerentalsGreen Fuel 2-2 HighlandersMWOS 2  0 YadahTriangle 0- 2 CAPS UnitedChicken Inn 1 -1 FC PlatinumKwekwe United 1  0 Bikita Minerals.\n\nScottland 0-1 Ngezi Platinum\n\nDynamos 1-1 Tel One\n\nManica Diamonds 1-0 ZPC Kariba\n\nSimba Bhora 1-0 Herentals\n\nGreen Fuel 2-2 Highlanders\n\nMWOS 2  0 Yadah\n\nTriangle 0- 2 CAPS United\n\nChicken Inn 1 -1 FC Platinum\n\nKwekwe United 1  0 Bikita Minerals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/07190603/thumbnail_William-Manondo-right-celebrating-after-opening-the-scoring-for-Caps-United-at-the-National-Sports-Stadium-on-Friday.jpeg",
            "description": "<p>By Sports Reporter JUAN Mutudza’s first half brace was enough to earn CAPS United three points against Triangle in a match that ended 2-0 at Green Fuel Arena in Chisumbanje  Sunday afternoon. Marking his first league start at Makepeke, Mutudza did not disappoint as he opened the match’s scoring account in the 15th minute before</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/juan-mutudza-inspires-caps-united-to-register-first-victory-of-the-season/\">Juan Mutudza inspires CAPS United to register first victory of the season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "‘I was duped into leaving London for school in Ghana – but it saved me’",
            "url": "https://www.newzimbabwe.com/i-was-duped-into-leaving-london-for-school-in-ghana-but-it-saved-me/",
            "content": "By Mark Wilberforce l BBC\n\nWHEN my mother told me at the age of 16 that we were going from the UK to Ghana for the summer holidays, I had no reason to doubt her.\n\nIt was just a quick trip, a temporary break  nothing to worry about. Or so I thought.\n\nOne month in, she dropped the bombshell  I was not coming back to London until I had reformed and had earned enough GCSEs to continue my education.\n\nI was hoodwinked in a similar way to the British-Ghanaian teenager who recently took his parents to the High Court in London for sending him to school in Ghana.\n\nIn their defence, they told the judge they did not want to see their 14-year-old son become yet another black teenager stabbed to death in the streets of London.\n\nBack in the mid-1990s, my mother, a primary school teacher, was motivated by similar concerns.\n\nI had been excluded from two high schools in the London Borough of Brent, hanging out with the wrong crowd (becoming the wrong crowd)  and heading down a dangerous path.\n\nMy closest friends at the time ended up in prison for armed robbery. Had I stayed in London, I would have almost certainly been convicted with them.\n\nBut being sent to Ghana also felt like a prison sentence.\n\nI can empathise to a degree with the teenager, who said in his court statement that he feels like he is living in hell.\n\nYet, speaking for myself, by the time I turned 21 I realised what my mother had done had been a blessing.\n\nUnlike the boy at the centre of the London court case  which he lost  I did not go to boarding school in Ghana.\n\nMy mother placed me in the care of her two closest brothers, they wanted to keep an eye on me, and it was felt that being around boarders could prove too much of a distraction.\n\nI first stayed with my Uncle Fiifi, a former UN environmentalist, in a town called Dansoman, near the capital, Accra.\n\nThe lifestyle change hit hard. In London, I had my own bedroom, access to washing machines and a sense of independence  even if I was using it recklessly.\n\nIn Ghana, I was waking up at 05:00 to sweep the courtyard and wash my uncles often muddy pick-up truck and my aunts car.\n\nIt was her vehicle that I would later steal  something of a watershed moment.\n\nI did not even know how to drive properly, treating a manual like an automatic and I crashed it into a high-ranking soldiers Mercedes.\n\nI tried to flee the scene. But that soldier caught me and threatened to take me to Burma Camp, the notorious military base where people had disappeared in the past.\n\nThat was the last truly reckless thing I did. It was not just discipline that I learnt in Ghana  it was perspective. Life in Ghana showed me how much I had taken for granted.\n\nWashing clothes by hand and preparing meals with my aunt made me appreciate the effort needed.\n\nFood, like everything in Ghana, required patience. There were no microwaves, no fast-food runs.\n\nMaking the traditional dough-like dish fufu, for example, is laborious and involves pounding cooked yams or cassava into a paste with a mortar.\n\nAt the time, it felt like punishment. Looking back, it was building resilience.\n\nInitially, my uncles considered placing me in high-end schools like the Ghana International School or SOS-Hermann Gmeiner International College.\n\nBut they were smart. They knew I might just form a new crew to cause chaos and mischief.\n\nInstead, I received private tuition at Accra Academy, a state secondary school that my late father had attended. It meant I was often taught on my own or in small groups.\n\nLessons were in English, but out of school those around me were often speaking local languages and I found it easy to pick them up perhaps because it was such an immersive experience.\n\nBack home in London, I used to love to learn swear words in my mothers Fante language  but was far from fluent.\n\nWhen I later moved to the city of Tema to stay with my favourite uncle, Uncle Jojo  an agricultural expert, I continued private tuition at Tema Secondary School.\n\nIn contrast to the boy making the headlines in the UK, who claimed Ghanas education system was not up to standard, I found it to be exacting.\n\nI was considered academically gifted in the UK, despite my troublesome ways, but actually found it tough going in Ghana. Students my age were far ahead in subjects like maths and science.\n\nThe rigour of the Ghanaian system pushed me to study harder than I ever had in London.\n\nThe result? I earned five GCSEs with grades C and above  something that once seemed impossible.\n\nBeyond academic achievements, Ghanaian society instilled values that have stayed with me for life.\n\nRespect for elders was non-negotiable. Throughout the neighbourhoods I lived in, you greeted those older than you, regardless of whether or not you knew them.\n\nGhana did not just make me more disciplined and respectful  it made me fearless.\n\nFootball played a huge part in that transformation. I played in the parks, which were often hard red clay with loose pebbles and stones, with two square goalposts fashioned out of wood and string.\n\nIt was a far cry from the neatly maintained pitches in England, but it toughened me up in ways I could not have imagined  and it is no wonder some of the greatest footballers seen in the English Premier League have come from West Africa.\n\nOn Sundays children and teenagers flock to Ghanas beaches to play football\n\nThe aggressive style played in Ghana was not just about skill  it was about resilience and endurance. Getting tackled on rough ground meant picking yourself up, dusting yourself off and carrying on.\n\nEvery Sunday, I played football on the beach  though I would often be late because there was absolutely no way either of my uncles would allow me to stay home instead of attending church.\n\nThose services felt like they lasted forever. But it was also a testament to Ghana as a God-fearing nation, where faith is deeply embedded in everyday life.\n\nThe first 18 months were the hardest. I resented the restrictions, the chores, the discipline.\n\nI even tried stealing my passport to fly back to London, but my mother was ahead of me and had hidden it well. There was no escape.\n\nMy only choice was to adapt. Somewhere along the way, I stopped seeing Ghana as a prison and started seeing it as happy home.\n\nI know of a few others like me who were sent back to Ghana by their parents living in London.\n\nMichael Adom was 17 when he arrived in Accra for school in the 1990s, describing his experience as bittersweet. He stayed until he was 23 and now lives back in London working as a probation officer.\n\nHis main complaint was the loneliness  he missed his family and friends. There were times of anger about his situation and the complications of feeling misunderstood.\n\nThis largely stemmed from the fact that his parents had not taught him or his siblings any of the local languages when growing up in London.\n\nI didnt understand Ga. I didnt understand Twi. I didnt understand Pidgin, the 49-year-old tells me.\n\nThis made him feel vulnerable for his first two-and-a-half years  and, he says, liable to being fleeced, for example, by those increasing prices because he seemed foreign.\n\nAnywhere I went, I had to make sure I went with somebody else, he says.\n\nBut he ended up becoming fluent in Twi and, overall, he believes the positives outweighed the negatives: It made me a man.\n\nMy Ghana experience matured me and changed me for the better, by helping me to identify with who I am, as a Ghanaian, and cemented my understanding of my culture, background and family history.\n\nPatience Wilberforce, a primary school teacher, was determined her son should leave school with qualifications\n\nI can concur with this. By my third year, I had fallen in love with the culture and even stayed on for nearly two more years after passing my GCSEs.\n\nI developed a deep appreciation of the local food. Back in London, I never thought twice about what I was eating. But in Ghana, food was not just sustenance  each dish had its own story.\n\nI became obsessed with waakye  a dish made from rice and black-eyed peas, often cooked with millet leaves, giving it a distinctive purple-brown colour. It was usually served with fried plantain, the spicy black pepper sauce shito, boiled eggs, and sometimes even spaghetti or fried fish. It was the ultimate comfort food.\n\nI enjoyed the music, the warmth of the people and the sense of community. I was not just stuck in Ghana any more  I was thriving.\n\nMy mother, Patience Wilberforce, passed away recently, and with her loss I have reflected deeply on the decision she made all those years ago.\n\nShe saved me. Had she not tricked me into staying in Ghana, the chances of me having a criminal record or even serving time in prison would have been extremely high.\n\nI went on to enrol at the College of North West London aged 20 to study media production and communications, before joining BBC Radio 1Xtra via a mentoring scheme.\n\nThe guys I used to hang out with in north-west London did not get the second chance that I did.\n\nGhana reshaped my mindset, my values and my future. It turned a misguided menace into a responsible man.\n\nWhile such an experience might not work for everyone, it gave me the education, discipline and respect I needed to reintegrate into society when I returned to England.\n\nAnd for that, I am forever indebted to my mother, to my uncles and to the country that saved me.\n\nMark Wilberforce is a freelance journalist based in London and Accra.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16171901/c0204490-0071-11f0-a8b1-950887ddc6e5.jpg.webp",
            "description": "<p>By Mark Wilberforce l BBC  WHEN my mother told me at the age of 16 that we were going from the UK to Ghana for the summer holidays, I had no reason to doubt her. It was just a quick trip, a temporary break – nothing to worry about. Or so I thought. One month</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-was-duped-into-leaving-london-for-school-in-ghana-but-it-saved-me/\">‘I was duped into leaving London for school in Ghana – but it saved me’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Musician Nyasha David loses laptop with unreleased music in burglary",
            "url": "https://www.newzimbabwe.com/musician-nyasha-david-loses-laptop-with-unreleased-music-in-burglary/",
            "content": "By Staff Reporter\n\nTHIEVES broke into the home of musician Nyasha David, stealing a laptop with unreleased music along with other valuable items.\n\nThe Ta Ta Ta hit-maker said the break-in happened Saturday, while he was away performing at a concert.\n\nThe artist posted on all his social media platforms pleading with the thieves to return his laptop and hard drives, offering a cash reward.\n\nThieves broke into my house while I was at a show and stole the following. Please direct message me or contact Martin : 0773395000 if they try to sell these things to you\n\nHP Probook G7, Soundcore Rav Neo Speaker, Playstation 4 with 4 Controllers and four games (Tekken 7, FC25, Mortal Kombat 11, God of War), Timberland 79 Boots, black power bank, iPad 5th Gen White locked with Nyasha David I cloud, iPad 2nd Gen Locked with Nyasha David iCloud and two Toshiba 500GB hard drives.\n\nTo the person who stole my stuff, I will pay if you return my laptop and hard drives. The laptop has all my unreleased music, he said.\n\nMeanwhile, the artist released a hit song last month currently holding the second spot on YouTube trending with close to two million views.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16171228/nyasha-david.jpg",
            "description": "<p>By Staff Reporter THIEVES broke into the home of musician Nyasha David, stealing a laptop with unreleased music along with other valuable items. The Ta Ta Ta hit-maker said the break-in happened Saturday, while he was away performing at a concert. The artist posted on all his social media platforms pleading with the thieves to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musician-nyasha-david-loses-laptop-with-unreleased-music-in-burglary/\">Musician Nyasha David loses laptop with unreleased music in burglary </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Marvellous Nakamba ruled out of Warriors World Cup Qualifiers, replaced by Ngezi Platinum’s Hachiro",
            "url": "https://www.newzimbabwe.com/marvellous-nakamba-ruled-out-of-warriors-world-cup-qualifiers-replaced-by-ngezi-platinums-hachiro/",
            "content": "By Sports Reporter\n\nAFTER a fine performance Friday against Scottland, Ngezi Platinum Stars midfielder Richard Hachiro has been called up in the Warriors squad to play the upcoming 2026 World Cup Qualifiers.\n\nHe replaces injured captain Marvellous Nakamba.\n\nHachiro is no stranger in the Warriors team as he received more than three call ups last year.\n\nZimbabwe is set to host Benin on Thursday at Moses Mabhidha Stadium in Durban, South Africa before travelling to Nigeria for a clash against the Super Eagles five days later.\n\nAccording to ZIFA, the Warriors captain suffered a recurrence of his calf injury over the weekend and is ruled out for the coming two fixtures.\n\nMeanwhile, the Warriors left the country Sunday afternoon for South Africa ahead of their match against Benin.\n\nThe team is expected to conduct its first training Monday morning although it will have locally-based players only.\n\nForeign players are expected to join camp starting Monday afternoon and the coach is expected to conduct his first training with a full squad Tuesday morning.\n\nZimbabwe is currently bottom of Group C with two points and Michael Nees will be hoping to give the side its first win in the campaign.\n\nThe Warriors started with two draws against Rwanda and Nigeria before losing to Lesotho and South Africa.\n\nGroup C World Cup Qualifiers Standings\n\n1. Rwanda = 7points\n\n2. South Africa = 7 points\n\n3. Benin = 7 points\n\n4. Lesotho = 5 points\n\n5. Nigeria = 3 points\n\n6. Zimbabwe = 2 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/08072353/Marvelous-Nakamba.jpg",
            "description": "<p>By Sports Reporter  AFTER a fine performance Friday against Scottland, Ngezi Platinum Stars midfielder Richard Hachiro has been called up in the Warriors squad to play the upcoming 2026 World Cup Qualifiers. He replaces injured captain Marvellous Nakamba. Hachiro is no stranger in the Warriors team as he received more than three call ups last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marvellous-nakamba-ruled-out-of-warriors-world-cup-qualifiers-replaced-by-ngezi-platinums-hachiro/\">Marvellous Nakamba ruled out of Warriors World Cup Qualifiers, replaced by Ngezi Platinum’s Hachiro </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "17 Mar 2025"
        }
    ]
}