{
    "news": [
        {
            "title": "No Water From the Tap. They’re Asked to Pay a Tax Anyway.",
            "url": "https://www.newzimbabwe.com/no-water-from-the-tap-theyre-asked-to-pay-a-tax-anyway/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  The cholera outbreak that swept through Zimbabwe in 2008-2009 killed more than 4,000 people and sickened nearly 100,000. Parts of Harare and its surrounding suburbs were especially hard hit, and in the aftermath, attention fell on the unreliability of the capital citys aging infrastructure. The government ultimately secured a US$144 million loan from China Exim Bank to overhaul the citys water treatment network.\n\nThe promised upgrades never came, but now, the city wants ratepayers to foot the bill with a water levy introduced in March.\n\nThe loaned funds were supposed to upgrade water treatment plants, and pump stations, and roll out prepaid meters for 500,000 households.\n\nNow, almost two decades later, citizens are being asked to repay a loan they say brought them no benefit.\n\nIf the water situation had improved, maybe it would make sense, says Prudence Hanyani, who was born and raised in Mabvuku, a suburb of the capital city that falls in its service area. We never saw infrastructure development or better services. So what exactly are we paying for?\n\nHarares daily water production has steadily declined over the years due to a mix of deferred maintenance, contamination, and leaky pipes and valves in the distribution network, according to a 2015 World Bank report. In 2005, the city produced approximately 600 megaliters each day  thats 600 million liters, or 158.5 million gallons, enough to fill 240 Olympic-size swimming pools. By 2008, daily output dropped to around 400 megaliters, then fluctuated between 400 and 600 megaliters over the next few years. However, by February this year, the supply had fallen further to just 350 megaliters per day.\n\nHarare needs more than three times that amount, some 1,200 megaliters per day (317 million gallons), to meet the needs of residents and businesses, says Hardlife Mudzingwa, director of the advocacy group Community Water Alliance.\n\nWhat was a government responsibility is now being offloaded onto ordinary households already grappling with economic hardship, says Mudzingwa, who has petitioned the government to account for how the money was used.\n\nTaps in Mabvuku ran dry around the year 2000, Hanyani says, and residents havent had running water since. With six children to care for, she now spends up to US$3 a day to buy water for drinking, cooking, cleaning and sanitation, an added burden in a country where the average monthly household income fell to just US$88 in 2024. Now an additional water levy of US$1 is expected from her each month.\n\nPrudence Hanyani collects water from a disused chicken brooder where she stores her household supply. Hanyani, who has lived without running water for over two decades, now faces a new government-imposed water levy tied to a failed Chinese loan project that promised but never delivered improved infrastructure. Credit: Linda Mujuru, GPJ Zimbabwe\n\nZimbabwes infrastructure funding gap is huge.\n\nThe country needs an estimated US$2 billion annually until 2032, of which the government can only fund about 20%. Key projects, such as the Harare water and sewer upgrade and major dam developments, have been financed through loans, particularly from China Exim Bank. But many of these projects, including the Harare upgrade, stalled after loan disbursements were suspended due to contract breaches.\n\nZimbabwe turned to China for loans in the early 2000s primarily due to limited access to more established financing sources, following years of economic sanctions, political isolation and a deteriorating credit rating. China emerged as a willing lender, offering infrastructure loans and investments under its Belt and Road initiative and Zimbabwes Look East policy. However, the country has faced challenges in repaying these loans, leading to significant arrears.\n\nIn 2018, China Exim Bank provided a US$153 million government concessional loan for the expansion of the Robert Gabriel Mugabe International Airport. While the project aimed to increase the airports capacity from 2.5 million to 6 million passengers annually, it was hampered by delays and financial mismanagement. By the end of 2021, Zimbabwe had accumulated $3 million in arrears on the loan.\n\nSimilarly, the Victoria Falls Airport Renovation and Expansion Project relied on a US$149.9 million loan, issued in 2012. The project was completed in 2016, but Zimbabwes arrears still ballooned to US$54 million by the end of 2021.\n\nThe Chinese water and sewer loan came at a time when various partners were funding infrastructure upgrades in the sector, Mudzingwa says. Following the 2008 cholera outbreak, international development partners including the United Nations Childrens Fund, the African Development Bank and the World Bank stepped in with additional support. In Harare, much of that funding was frittered away as the city failed to consult with residents in project planning or install systems to track revenue, manage budgets and detect fraud and waste. As a result, there has never been clarity on how exactly the money was used, even as millions of Zimbabweans have been left without access to safe, reliable water.\n\nThe China Exim Bank water loan had an 11-year repayment term with a four-year grace period and variable interest set at roughly 3.5%.\n\nAlthough the project officially began in 2013, progress quickly stalled when Zimbabwes failure to repay an earlier loan prompted the bank to freeze disbursements. The earlier loan was for planned renovations to the dormant state-owned steel enterprise Ziscosteel, which were never completed. Harare City Council spent US$8 million from the water treatment loan on 25 luxury vehicles. The council claimed the cars were necessary for service delivery, but the lender disagreed. By 2017, only half the loan had been released, and disbursements remained frozen through 2020.\n\nAs of 2021, the Harare water project alone accounted for nearly US$67 million in unpaid debt. Across its portfolio, Zimbabwe owed China Exim Bank more than US$260 million in arrears spanning numerous sectors, from telecommunications to airports to defense.\n\nWe are the ones drinking water, says Harare Mayor Jacob Mafume. Surely if Harare residents are drinking the water, they should pay for it themselves instead of asking the tax dollar of some Chipinge resident busy chasing a big frog.\n\nWard 16 councillor Denford Ngadziore is calling for an audit. If there are people who misused the money, they should be prosecuted. I presented this solution in the full council meeting, but other councilors disagreed with me, he says. We cannot make residents pay the loan without a clear report on how the loan was used.\n\nViolet Razau carries a bucket of water to her home in Mabvuku. Like many residents in this suburb of Harare, she has relied on makeshift sources for years. Despite having received no benefit from a long-stalled water project funded by a Chinese loan, residents are now expected to repay it through monthly levies. Credit: Linda Mujuru, GPJ Zimbabwe\n\nMafume insists that everything was done above board, arguing that the Land Rover Defenders and Amarok pickup trucks purchased for the project were not, in fact, luxury vehicles and that the utility has been hampered by its inability to purchasewater treatment chemicals, which cost some US$3 million a month, according to the mayors office. By and large, the equipment that was bought is there for anyone to go and see. And the good thing is that the new pumps and the old pumps, you can see the difference in performance, he says. Look at the old pumps, they look like they can explode at any time. So the work that the Chinese did on the plant speaks for itself.\n\nMudzingwa argues that the loan acquisition process itself was flawed because a section of Zimbabwes 2013 Constitution says that any international treaty signed or carried out by the president or on the presidents behalf is not legally binding unless it is first approved by Parliament.\n\nHe says the provision reinforces the principle of legislative oversight in the treaty-making process. The agreement was ratified by council in December 2013, but by then, the money had already been spent. Ratification should have come first, he says.\n\nMudzingwa also disputes the mayors contention that promised equipment upgrades were made. Theres no visible infrastructure to justify the cost. Now, residents are being asked to pay for a loan they didnt benefit from. Thats unfair, he says.\n\nMudzingwa worries the levy sets a precedent for ordinary citizens to foot the bill for loan projects characterized by improper procedure, opaque spending and unaccountable leadership.\n\nZimbabwes experience mirrors similar challenges seen in other countries reliant on Chinese infrastructure financing. Zambia canceled US$1.6 billion in undisbursed Chinese loans in 2022 amid a mounting debt crisis, while Sri Lanka was forced to award a Chinese company a 99-year lease on a newly-built port after defaulting on construction loans China had provided.\n\nBack in Mabvuku, the water struggle remains deeply personal.\n\nViolet Razau, a hairdresser and mother of two, has lived in the area since 1998. As a child, I watered our garden with a hose. My 13-year-old son has never seen that. Now, I dont even get a drop from council taps, so why should I pay?\n\nFor Hanyanis 70-year-old mother, Precious Mudimu, age has made the crisis harder. I cant carry water buckets. I rely on others, but theyre not always around. Im old, I cant work to pay levies, she says. This place feels like a desert.\n\nLinda Mujuruis a Reporter-in-Residence based in Harare, Zimbabwe. A renowned international reporter and public speaker, she has spent nearly a decade covering human rights, the mining sector, the economy and public health. She holds an MBA from Midlands State University and both masters and bachelors degrees in Journalism and Media Studies from the National University of Science and Technology in Zimbabwe. Linda is one of Global Press most widely read and syndicated journalists. In 2023, she won the Community Champion Award from the Institute for Nonprofit News for her story Push for Gold Leaves a Toxic Legacy.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02185902/01_GPJNews_Zimbabwe_LM_ChineseLoan_141_L.JPG_web.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — The cholera outbreak that swept through Zimbabwe in 2008-2009 killed more than 4,000 people and sickened nearly 100,000. Parts of Harare and its surrounding suburbs were especially hard hit, and in the aftermath, attention fell on the unreliability</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-water-from-the-tap-theyre-asked-to-pay-a-tax-anyway/\">No Water From the Tap. They’re Asked to Pay a Tax Anyway.</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jul 2025"
        },
        {
            "title": "Media lobby groups demand release of detained Zimbabwe Independent editor, condemn attack on press freedom",
            "url": "https://www.newzimbabwe.com/media-lobby-groups-demand-release-of-detained-zimbabwe-independent-editor-condemn-attack-on-press-freedom/",
            "content": "By Thandiwe Garusa\n\nWOMEN journalists rights advocacy group Gender and Media Connect (GMC) has called on authorities to release jailed news editor Faith Zaba.\n\nZaba, who is an editor at the privately owned weekly newspaper Zimbabwe Independent, was arrested on Tuesday on charges of undermining the authority of the President.\n\nThe charges stem from a satirical article published by her newspaper last week, which questioned Zimbabwes leadership role within the Southern African Development Community (SADC).\n\nShe appeared at the Harare Magistrates court on Wednesday, where she was remanded in custody after her bail application was postponed to Thursday.\n\nGMC National Director Patience Zirima said Zabas arrest sends a chilling message to journalists, especially women and threatens press freedom and gender equality in media leadership.\n\nGMC calls for the immediate and unconditional release of Faith Zaba.\n\nHer arrest is particularly significant given her status as one of the few women editors in the country.\n\nWomen journalists already face unique challenges and risks in their professional work, and the targeting of a prominent female editor for exercising her professional duties represents a serious setback for womens rights and media freedom, Zirima said.\n\nThe GMC also called for all charges against Zaba to be dropped and urged the government of Zimbabwe and its agencies to commit to respecting constitutional rights to freedom of expression and freedom of the media.\n\nMeanwhile, Media Alliance of Zimbabwe National Coordinator Nigel Nyamutumbu also expressed disappointment at the ongoing disregard for media freedom, warning of a shrinking democratic space.\n\nThis represents a shrinking democratic space. It reflects how press freedom is increasingly being disrespected, which is deeply concerning.\n\nEven with the repeal of repressive legislation, journalists continue to be arrested and their safety compromised.\n\nInstead of making progress, we are taking steps backwards in respecting free expression and democracy in Zimbabwe.\n\nPress freedom is under attack, and we need as much solidarity as possible, Nyamutumbu said.\n\nZabas arrest comes soon after another journalist from Alpha Media Holdings, Blessed Mhlanga, was arrested and spent three months in pre-trial detention for interviewing a war veteran, Blessed Geza, who had called for President Emmerson Mnangagwas immediate ouster.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02115828/ZABA-FAITH.png",
            "description": "<p>By Thandiwe Garusa WOMEN journalists’ rights advocacy group Gender and Media Connect (GMC) has called on authorities to release jailed news editor Faith Zaba. Zaba, who is an editor at the privately owned weekly newspaper Zimbabwe Independent, was arrested on Tuesday on charges of undermining the authority of the President. The charges stem from a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/media-lobby-groups-demand-release-of-detained-zimbabwe-independent-editor-condemn-attack-on-press-freedom/\">Media lobby groups demand release of detained Zimbabwe Independent editor, condemn attack on press freedom</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jul 2025"
        },
        {
            "title": "Local millers decry invasion of reserved sector by foreigners",
            "url": "https://www.newzimbabwe.com/local-millers-decry-invasion-of-reserved-sector-by-foreigners/",
            "content": "By Staff Reporter\n\nLocal grainmilling companies have raised concerns over the invasion of stipulated reserved sectors by foreign nationals.\n\nSpeaking on the sidelines of an engagement with the Grain Millers Association of Zimbabwe(GMAZ), small millers from Bulawayo said the milling sector reserved for locals under the law is now being invaded by foreigners, particularly Pakistanis.\n\nOne local miller, James Kamono, who owns Marula Milling Company, said the foreigners were trading mealie meals at questionable prices.\n\nThe Indigenisation and Economic Empowerment Act in Zimbabwe reserves certain sectors, including grain milling, for ownership by Zimbabwean citizens. This means that, in principle, only businesses owned by locals are permitted to operate in these sectors.\n\nOne of the challenges we are having as small millers is the invasion of this reserved sector by foreign nationals, Kamono said.\n\nThese foreign nationals, particularly the Pakistanis, are selling mealie meals at low and questionable prices. This has lowered our production and sales, he lamented.\n\nKamono called on the government to put stiffer policies and penalties to safeguard the reserved sector for locals.\n\nWe spoke about indigenisation and the reserved sector, but I think we need to push more on that issue of indigenisation and the reserved sector because we have so many foreigners opening their milling companies and that is affecting our operations, he added.\n\nAnother Southern Region milling company owner, Mthandazo Moyoof Shakata Investments, said the invasion of the sector by the Pakistanis was worsening the burden of the already struggling milling businesses.\n\nThe big problem that we are facing is financial muscle. As a small miller we do not have the capital to buy many tonnes of maize and the situation is worsened by foreigners who are taking over the sectors reserved for locals, said Moyo.\n\nMeanwhile, milling companies welcomed the efforts by Grain Millers Association of Zimbabwe (GMAZ), which is set to facilitate the movement of maize from the Northern to the Southern Region of the country as part of government efforts to ensure food security.\n\nSpeaking on the sidelines of a meeting, GMAZ Southern Region Vice Chair, Mthokozisi Sibanda said movement of maize will permit farmers to access more markets while allowing small millers to access raw materials at a better cost.\n\nWe want to appreciate the Government in ensuring there is food security in the Southern Region. As we speak right now most millers are seized with buying local maize as you know for the past few years we have been importing from abroad and currently we have been asked by the Government to assist our local farmers in selling and exploring the local market, Sibanda said.\n\nHe added that localtrade will allow a quick turnover in the movement of maize.\n\nMost millers are seized with that opportunity and we want to appreciate that because that comes in handy.\n\nLocal purchases of grain are key over the turnover of the movement of maize we want to bring it from the northern Region into the Southern Region which might take a day or so which is an advantage and is key to our milling plants as we bring that necessary raw material, said the GMAZ vice Chairperson.\n\nAccording to Sibanda, the movement of maize from the Northern Region will allow the country to fully utilize the local milling capacity.\n\nNot only that, the export of labour has stopped, particularly over our milling plants. We are now buying locally, promoting the local farmers and improving our capacity utilisation of our milling plants.\n\nThis is key in our industrial development, national development, as well as our GDP.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02191426/miller.jpg",
            "description": "<p>By Staff Reporter Local grain milling companies have raised concerns over the invasion of stipulated reserved sectors by foreign nationals. Speaking on the sidelines of an engagement with the Grain Millers Association of Zimbabwe (GMAZ), small millers from Bulawayo said the milling sector reserved for locals under the law is now being invaded by foreigners, particularly Pakistanis.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-millers-decry-invasion-of-reserved-sector-by-foreigners/\">Local millers decry invasion of reserved sector by foreigners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jul 2025"
        },
        {
            "title": "Over 9,000 illegal transport operators arrested in six months",
            "url": "https://www.newzimbabwe.com/over-9000-illegal-transport-operators-arrested-in-six-months/",
            "content": "By Anna Chibamu\n\nOVER 9000 illegal transport operators, popularly known as mushika-shika, have been arrested and fined since the beginning of the year, a government official has reported.\n\nHome Affairs Permanent Secretary Ambassador Tayerera Faranisi told a Transport Parliamentary Portfolio committee last week that since January this year, 9,289 mushika-shika operators were arrested and fined.\n\nThere is an ongoing operation targeting mushika-shika operators.\n\nAs of the latest update, 9,289 mushika-shika operators have been nabbed and fined since January 01, 2025, Faranisi said.\n\nResponding to questions relating to the chaos being caused by these illegal transport operators and finding solutions to end road carnage, Committee members touched on challenges resulting from the mushika-shika presence on the countrys roads.\n\nPolice Deputy Commissioner General (DCG) Operations Leny Ncube accused the public vehicle operators of being corrupt.\n\nThere is the issue where it appears people are now budgeting to deal with our police officers.\n\nWithout trying to defend our members, we have better police officers. We also have corrupt members of the community.\n\nWe cannot run away from that as the bus crew people are making money from the bus operators using the system to pay the police, Ncube told this committee.\n\nIt is just a corrupt system. Unless you are talking of a vehicle owner who is coming forth and saying, I was a victim of this, corruption is all over.\n\nEveryone is surviving through this corruption. Bus crews, you name them, they are surviving through the money. They report they were paid police officers.\n\nNcube explained that there was a need for the whole country to vigorously campaign against corruption.\n\nCorruption is running in our nerves because police cannot corrupt themselves alone. Someone is giving them money.\n\nSomeone is enticing them because the person doesnt want to pay the necessary dues to the government. Maybe you define it as $20, but the person is not willing to pay that $20. And its enticing the police officer to pay $30.\n\nSo its corruption across the world. We cannot run away from that because we are guilty of charging our members sometimes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04193446/Mushikashika.png",
            "description": "<p>By Anna Chibamu OVER 9000 illegal transport operators, popularly known as “mushika-shika”, have been arrested and fined since the beginning of the year, a government official has reported. Home Affairs Permanent Secretary Ambassador Tayerera Faranisi told a Transport Parliamentary Portfolio committee last week that since January this year, 9,289 mushika-shika operators were arrested and fined.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-9000-illegal-transport-operators-arrested-in-six-months/\">Over 9,000 illegal transport operators arrested in six months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jul 2025"
        },
        {
            "title": "The industry deserves leaders with integrity – musicians call for reforms at ZIMURA following director’s fraud conviction",
            "url": "https://www.newzimbabwe.com/the-industry-deserves-leaders-with-integrity-musicians-call-for-reforms-at-zimura-following-directors-fraud-conviction/",
            "content": "By Tapiwa Svondo\n\nZimbabwe Music Rights Association (ZIMURA) Executive Director Polisile Ncube Chimhinis recent fraud conviction has fuelled demands for reforms at the music rights body.\n\nChimhini was facing forgery and fraud charges. She was acquitted of forgery and convicted of fraud, which she plans to appeal.\n\nChimhini had presented falsified CR6 company registration documents to the High Court in July 2023 during a case initiated by musician Phillip Chipfumbu, who sought a forensic audit of ZIMURA.\n\nIn a statement, the Zimbabwe Musicians Union (ZIMU) President Edith Katiji said the case followed heightened tension, including ZIMURAs widely opposed US$150 licensing fee for cover bands, which was ultimately suspended by the National Arts Council of Zimbabwe and the Ministry of Justice, Legal and Parliamentary Affairs.\n\nIn light of this conviction, ZIMU reiterates our previous calls for comprehensive reform within ZIMURA. The organisation has been integral to Zimbabwes music industry for over four decades, but recent leadership decisions have eroded trust among stakeholders.\n\nZIMU maintains our position that significant changes are necessary to restore ZIMURAs credibility and effectiveness as a collective management organization.\n\nWe specifically call for: Immediate review of ZIMURAs governance structures; Enhanced transparency in financial operations and decision-making processes; Meaningful engagement with all music industry stakeholders before implementing policy changes; Establishment of clear accountability mechanisms to prevent future misconduct, said Katiji.\n\nZimbabwes music industry deserves leadership that operates with integrity, transparency, and genuine commitment to artist welfare. ZIMU stands ready to work with all stakeholders, including a reformed ZIMURA leadership, to build a music ecosystem that truly serves the interests of creators, performers, and the broader creative community.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/19161852/Edith-Weutonga.jpg",
            "description": "<p>By Tapiwa Svondo Zimbabwe Music Rights Association (ZIMURA) Executive Director Polisile Ncube Chimhini’s recent fraud conviction has fuelled demands for reforms at the music rights body. Chimhini was facing forgery and fraud charges. She was acquitted of forgery and convicted of fraud, which she plans to appeal. Chimhini had presented falsified CR6 company registration documents</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-industry-deserves-leaders-with-integrity-musicians-call-for-reforms-at-zimura-following-directors-fraud-conviction/\">The industry deserves leaders with integrity – musicians call for reforms at ZIMURA following director’s fraud conviction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jul 2025"
        },
        {
            "title": "Can Trump strip Musk and Mamdani of their US citizenship?",
            "url": "https://www.newzimbabwe.com/can-trump-strip-musk-and-mamdani-of-their-us-citizenship/",
            "content": "Al Jazeera\n\nUS President Donald Trump and officials from his administration have hinted that they might consider revoking the US citizenship ofZohran Mamdani, New York Citys Democratic mayoral candidate.\n\nSeparately, Trump said former aideElon Muskwould have to close up shop and head back home to South Africa amid a row over histax breaks and Trumps narrowly passed spending bill.\n\nBut would the Trump administration have the power to revoke the citizenship of Mamdani and Musk, both foreign-born, naturalised citizens of the US?\n\nMamdani, 33, was born in the Ugandan capital, Kampala, to ethnically Indian parents. He moved to New York at the age of seven and became a naturalised US citizen in 2018.\n\nMusk was born in 1971 in Pretoria, South Africa to a Canadian mother and South African father. At the age of 17, he moved to Canada of where he is also a citizen. In 1992, he moved to the US to study at the University of Pennsylvania. He became a naturalised US citizen in 2002, according to a biography of him written in 2023 by journalist Walter Isaacson.\n\nIn October 2024, the Washington Post reported that Musk began his career in the US without the proper work authorisation, but Musk has denied this. I was in fact allowed to work in the US, Musk wrote in an X post on the same day the report was published. I was on a J-1 visa that transitioned to an H1-B, Musk wrote in another post. A J-1 visa is a temporary visa for foreign students, while an H-1B is a temporary work visa.\n\nTo become naturalised as a US citizen, an individual needs to be above the age of 18 and to have lived continuously in the US as a green card holder for five years, or three years if they are married to a US citizen.\n\nAndy Ogles, a Republican Tennessee representative, wrote to Attorney General Pam Bondi on June 26, asking for the Department of Justice to probe whether Mamdani, who identifies as ademocratic socialist, should be subject to denaturalisation proceedings.\n\nPosting a copy of the letter to Bondi on his X page, Ogles wrote: Zohran little muhammad Mamdani is an antisemitic, socialist, communist who will destroy the great City of New York. He needs to be DEPORTED. Which is why I am calling for him to be subject to denaturalization proceedings.\n\nOgles said that the investigation should be conducted on the grounds that Mamdani may have procured US citizenship through willful misrepresentation or concealment of material support for terrorism.\n\nThe Tennessee Republican cited reports, including an article published in the New York Post, stating that Mamdani expressed solidarity with individuals convicted of terrorism-related offenses prior to becoming a US citizen. Ogles said that Mamdani rapped Free the Holy Land Five / My guys.\n\nThe Holy Land Foundation was convicted in 2008 for providing material support to Hamas, a designated foreign terrorist organization. Publicly praising the Foundations convicted leadership as my guys raises serious concerns about whether Mr. Mamdani held affiliations or sympathies he failed to disclose during the naturalization process, Ogles wrote in his letter to Bondi.\n\nMoreover, Mr. Mamdani has recently refused opportunities to reject the pro-terrorist rallying cry to globalize the intifada a call to expand violent attacks on civilians to the United States and around the world, Ogles wrote.\n\nMamdani has also pledged to stop masked Immigration and Customs Enforcement (ICE) agents from deporting our neighbours. When Trump was asked about this on Tuesday at a news conference, he said that if Mamdani prevents ICE agents from conducting deportation operations, Well, then, well have to arrest him.\n\nWe dont need a communist in this country, but if we have one, Im going to be watching over him very carefully on behalf of the nation, Trump said, adding, well send him money, well send him all the things he needs to run the government.\n\nTrump continued, citing claims that Mamdani is in the US illegally, saying, Were going to look at everything. The president also voiced support for the current New York mayor, Eric Adams, who is also a member of the Democratic Party.\n\nMamdani posted a statement on his X account in response to Trumps comments on Tuesday.\n\nThe President of the United States just threatened to have me arrested, stripped of my citizenship, put in a detention camp and deported. Not because I have broken any law but because I will refuse to let ICE terrorize our city, Mamdani wrote in his statement.\n\nMamdani also called Trumps praise of Adams unsurprising, adding: At the very moment when MAGA Republicans are attempting to destroy the social safety net, kick millions of New Yorkers off of healthcare and enrich their billionaire donors at the expense of working families, it is a scandal that Eric Adams echoes this Presidents division, distraction and hate. Voters will resoundingly reject it in November.\n\nWhile the billionaire owner of Tesla and SpaceX was once a key aide to Trump and a major donor to his presidential campaign last year, Trumps Big Beautiful Bill has created a public rift between Trump and Musk.\n\nMusk has repeatedly decried the bill online and has threatened to forma new political partyas a response to the bill passing.\n\nMusk stands to be affected by the finance bill that the Senate narrowly passed on Tuesday, as it ends tax credits worth up to $7,500 for purchases of electric vehicles (EVs) from September 30. This could significantly reduce consumer demand for EVs in the US.\n\nIn a Truth Social post on Monday, Trump wrote, Without subsidies, Elon would probably have to close up shop and head back home to South Africa. No more Rocket launches, Satellites, or Electric Car Production, and our Country would save a FORTUNE.\n\nPerhaps we should have DOGE take a good, hard, look at this? BIG MONEY TO BE SAVED!!! Trump added, in reference to theDepartment of Government Efficiency, an advisory body aimed at boosting government efficiency and upgrading information technology, that Musk formed and led at the start of Trumps second administration, before leaving on May 30.\n\nOn Tuesday, when reporters asked Trump if he was going to deport Musk, he said, Well have to take a look. We might have to put DOGE on Elon.\n\nUnder certain circumstances, US citizens by naturalisation can lose their status as citizens. This process is also called denaturalisation.\n\nThis can happen if naturalised citizens commit certain crimes, including terrorism, war crimes, human rights violations, sex crimes or naturalisation fraud, meaning they obtained their citizenship through fraud, misrepresentation or illegal procurement.\n\nOn June 11, the Justice Department issued a memo stating that it would prioritise denaturalisation by instituting civil proceedings for people if they either illegally procured naturalization or procured naturalization by concealment of a material fact or by willful misrepresentation.\n\nThe memo added: The Civil Division shall prioritize and maximally pursue denaturalization proceedings in all cases permitted by law and supported by the evidence.\n\nA naturalised citizen can also lose their citizenship if they commit an act of treason against the US, or run for public office or join the military of a foreign country.\n\nMost recently, the Justice Department announced on June 13 that UK citizen Elliott Duke, a convicted collector and distributor of child sexual abuse material, had been denaturalised. In a news release, the Justice Department said Duke enlisted in the US Army in 2012 and began receiving and sending child sex abuse material online while serving in Germany. Duke did not list this crime in his naturalisation application in 2013. He was convicted of receipt and possession of child pornography in 2014.\n\nIt is not likely, according to experts.\n\nDenaturalisation is limited to cases where the government can prove material fraud in their original applications, said Michael Kagan, professor of law at University of Nevada, Las Vegas.\n\nIt is rare and unlikely for either Musk or Mamdani. This appears to be irresponsible rhetoric designed to intimidate political opponents.\n\nThe US has revoked the citizenship of naturalised citizens on different occasions over the past few decades.\n\nCases of denaturalisation were more frequent during the first half of the 20th century while the two world wars and, later, the Cold War with the Soviet Union were ongoing. Between 1926 and the mid-1940s, hundreds of people were denaturalised every year, according to political scientist Patrick Weil, author of The Sovereign Citizen, published in 2017.\n\nThe US government frequently tried to denaturalise citizens during the two Red Scare periods of 1917 to 1920 and 1947 to 1957, when the fear of communism was particularly high in the US. During this time, it was also very hard to obtain US citizenship by naturalisation.\n\nPeople who were denaturalised at the time included communists and Nazi sympathisers. Two famous cases were:\n\nIn 1967, the trend for denaturalisation slowed down when the US Supreme Court ruled that a US citizen could not be involuntarily deprived of their citizenship unless they met the specific criteria of having obtained naturalisation by fraud or of having committed serious offences.\n\nThe ruling came at the end of a case involving Beys Afroyim, who was born in Poland and became a naturalised US citizen in 1926. The US government tried to revoke his citizenship because Afroyim had voted in an Israeli legislative election in 1951.\n\nIn ruling this, the Supreme Court repealed a US federal law which said that US citizens could lose their citizenship if they vote in a foreign election.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05210734/musk-trump.webp",
            "description": "<p>Al Jazeera US President Donald Trump and officials from his administration have hinted that they might consider revoking the US citizenship of Zohran Mamdani, New York City’s Democratic mayoral candidate. Separately, Trump said former aide Elon Musk would have to “close up shop and head back home to South Africa” amid a row over his tax breaks and Trump’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/can-trump-strip-musk-and-mamdani-of-their-us-citizenship/\">Can Trump strip Musk and Mamdani of their US citizenship?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "03 Jul 2025"
        }
    ]
}