{
    "news": [
        {
            "title": "Fishing activities suspended at Lake Chivero following contamination exposè",
            "url": "https://www.newzimbabwe.com/fishing-activities-suspended-at-lake-chivero-following-contamination-expose/",
            "content": "By Staff Reporter\n\nFishing activities have been suspended with immediate effect in Lake Chivero following a shocking expos by NewZimbabwe.coms Investigative Journalist Mary Taruvinga that the lake has become infested with cyanobacteria which is killing thousands of fish, wildlife and livestock.\n\nThe Harare City Council was blamed for discharging raw effluents into the lake.\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) said preliminary investigations indicated that sewage runoff from the Marimba area has forced contaminated water into multiple bays, creating hazardous conditions for aquatic life.\n\nZimParks spokesperson Tinashe Farawo said the suspension is aimed at protecting the public while mapping the way forward.\n\nThe suspension serves as a precautionary measure and will pave the way for relevant government departments and our Research and Scientific Services team to investigate more and determine whether the consumption of the fish poses a risk to humans.\n\nDuring this time, we are increasing anti-poaching patrols and law enforcement in areas around the lake to prevent any fish from reaching the market, he said in a statement.\n\nFour white rhinos and other wildlife died after consuming the contaminated water.\n\nThousands of fish are also dying from the contamination.\n\nOn Monday ZimParks said 1,000 fish had died.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17055042/chivero-2.png",
            "description": "<p>By Staff Reporter Fishing activities have been suspended with immediate effect in Lake Chivero following a shocking exposè by NewZimbabwe.com’s Investigative Journalist Mary Taruvinga that the lake has become infested with cyanobacteria which is killing thousands of fish, wildlife and livestock. The Harare City Council was blamed for discharging raw effluents into the lake. Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fishing-activities-suspended-at-lake-chivero-following-contamination-expose/\">Fishing activities suspended at Lake Chivero following contamination exposè</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "WATCH: Harare mayor claims ‘sewer-smelling’ tap water is safe for drinking, meets WHO standards",
            "url": "https://www.newzimbabwe.com/watch-harare-mayor-claims-sewer-smelling-tap-water-is-safe-for-drinking-meets-who-standards/",
            "content": "By Thandiwe Garusa\n\nHARARE mayor Jacob Mafume has claimed that the city councils tap water is clean and safe to drink saying it meets World Health Organisation(WHO)standardsdespite most suburbs in the capital receivingdirty, smellyand often pitch-black coloured water.\n\nResponding to questions from journalists Tuesday after being asked why the tap water comes out smelling like sewage if it is clean and safe for consumption, Mafume said Harare City Council gives clean, treated water to residents every day.\n\nLet us not be dramatic, we give hundreds and thousands of people water every day and they use it. I know that because when normal water schedules in different areas drop, I receive phone calls and WhatsApp messages that today we do not have water.\n\nSo we know that our water is coming outclean and safe and whenthequalitychanges,we knowthere has been a compromised pipe and that affects the quality of water.\n\nWe give treated water to residents so our water is tested on a daily basis using World Health Organisation standards. The water coming from our taps is safe for human consumption and we treat the water that comes fromLake Chivero and Manyame thoroughly to ensure that we do not put water that is harmful to the residents, Mafume said.\n\nMeanwhile, thousands of fish, and four white rhinos, along with other wildlife and livestock, have perished after consuming water from the same Lake Chivero that was contaminated with cyanobacteria.\n\nHarare City Council has on numerous occasions bemoaned the lack of funds to purchase water purification chemicals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17160152/Water-from-city-council-Pic-Shepherd-Tozvireva-e1515403344649.jpg",
            "description": "<p>By Thandiwe Garusa HARARE mayor Jacob Mafume has claimed that the city council’s tap water is clean and safe to drink saying it meets World Health Organisation (WHO) standards despite most suburbs in the capital receiving dirty, smelly and often pitch-black coloured water. Responding to questions from journalists Tuesday after being asked why the tap water comes out smelling like</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-harare-mayor-claims-sewer-smelling-tap-water-is-safe-for-drinking-meets-who-standards/\">WATCH: Harare mayor claims ‘sewer-smelling’ tap water is safe for drinking, meets WHO standards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Police officers arrested for beating up ZACC investigators",
            "url": "https://www.newzimbabwe.com/police-officers-arrested-for-beating-up-zacc-investigators/",
            "content": "By Staff Reporter\n\nTWO Zimbabwe Republic Police (ZRP) officers stationed at Sakubva in Mutare have been arrested for allegedlyassaultingZimbabwe Anti-Corruption Commission (ZACC) investigators on duty.\n\nSergeant Mduduzi Makina (39) and Constable Elliot Gava (42) now face criminal charges of obstruction of justice and resisting a peace officer.\n\nMakina and Gava appearedat Mutare Magistrate Court today.\n\nThe pair allegedly obstructed justice by manhandling and injuring ZACC investigators, who had arrested a police officeron allegations of bribery at a roadblock.\n\nCircumstances are that on December 11, 2024, a ZACC investigations team was probing reports of bribery at a roadblock near Mutare Teachers College.\n\nDuring the operation, ZACC investigators descended on the checkpoint and seized a declaration book as evidence but Makina and Gava manhandled ZACC officers and grabbed the roadblock declaration book.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/07053229/Mutare-Court.jpg",
            "description": "<p>By Staff Reporter TWO Zimbabwe Republic Police (ZRP) officers stationed at Sakubva in Mutare have been arrested for allegedly assaulting Zimbabwe Anti-Corruption Commission (ZACC) investigators on duty. Sergeant Mduduzi Makina (39) and Constable Elliot Gava (42) now face criminal charges of obstruction of justice and resisting a peace officer. Makina and Gava appeared at Mutare Magistrate Court today.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officers-arrested-for-beating-up-zacc-investigators/\">Police officers arrested for beating up ZACC investigators </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Legal Discussions With Vengai Madzima: Diaspora Investment in Micro Finance",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-diaspora-investment-in-micro-finance/",
            "content": "NewZimbabwe.cominvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, this week we want to return to our series for investment opportunities for the diaspora in Zimbabwe. Is investing in microfinance institutions ideal in Zimbabwe?\n\nVM: The question can only be answered by dispassionately analyzing the historical and prevailing climate from an access to finance background. Historically, the economy was under sanctions for over 20 years, limiting general access to international and consequently local finance for the majority of the population.\n\nThe changes in currency and financial policies over the same period as a reaction to these sanctions decimated formal companies and employment and naturally grew the unbanked population, entrepreneurs and sole traders.\n\nThe result is that there is a large population hungry to finance their small enterprises and general living expenses, like school fees, through credit. The upside is that a significant percentage of the population owns the potential collateral outright as the positive effect of having no access to credit and the downside is that a significant percentage of the potential market has no recorded history or training in repaying debts, making them risky debtors.\n\nAs the saying goes, high-risk high returns, that being said, it is lucrative to invest in microfinance to the extent that the systems are sufficiently buffered against default.\n\nReporter:What are the regulations or licensing requirements for microfinance institutions in Zimbabwe?\n\nVM: Our laws have specific statutes regulating microfinance institutions, however, their establishment, supervision and regulation are carried out by the Reserve Bank of Zimbabwe. In considering an application to register microfinance, the Reserve Bank of Zimbabwe, among other things, is concerned with the financial stability of the proposed institution, the competence of its management and the adequacy of its risk management strategies.\n\nThere are minimum capital requirements depending on whether the microfinance institution will be credit-only or will be deposit-taking. Long and short, the application is evaluated on the basis of the institutions ability to comply with legal and regulatory requirements.\n\nReporter: Are there any restrictions on diaspora, non-resident or foreign investors investing in microfinance institutions?\n\nVM: The potential advantage they all have is that they have access to cheaper finance in their host or foreign country.\n\nIn terms of restrictions, the diaspora, non-resident or foreign investors are not necessarily the same person and from a procedural perspective, may be required to undertake different routes in starting out the process of establishing a micro-finance company depending on their residence status in Zimbabwe.\n\nThe foreign investor will have to start by acquiring the necessary approvals from the Zimbabwe Investment and Development Agency and all are required to adhere to foreign exchange control regulations on investing and repatriation of profits and dividendset cetera.\n\nReporter: What measures or steps should an investor take if they want to invest in an existing microfinance company?\n\nVM: The first step will be a due diligence of the legal, financial, operational, commercial, environmental and social structure of the microfinance company before one can invest. Key to this due diligence is the microfinance institutions regulatory and tax compliance, risk management processes and responsiveness to regulatory changes.\n\nThe process will have to include thorough due diligence on its governance structure, business plan, financial reports and projections, internal policies to combat money laundering and terrorism financinget cetera.\n\nReporter: What steps would I take when I want to close down the microfinance company?\n\nVM: Once the necessary board resolutions for closure are in place, the company will have to notify the regulatory authorities of its intention to close down. They may then be informed of what they are required to do before closing down. Generally, there is a need to settle obligations, notify stakeholders, cancel licenses and permits, liquidate assets and so on and so forth.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima atvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17084216/WhatsApp-Image-2024-12-17-at-08.58.23.jpeg",
            "description": "<p>NewZimbabwe.com invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, this week we want to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-diaspora-investment-in-micro-finance/\">Legal Discussions With Vengai Madzima: Diaspora Investment in Micro Finance   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "The entertaining Rugby Six Nations",
            "url": "https://www.newzimbabwe.com/the-entertaining-rugby-six-nations/",
            "content": "The Six Nations Championship is one of the most exciting and historic rugby tournaments in the world. Thetop betting sites in Zambia1xBet also feature this competition.\n\nIt takes place annually and involves 6 European countries:\n\nThe competition was initially the Home Nations Championship in 1883, featuring only England, Scotland, Ireland, and Wales. It expanded to the Five Nations in 1910 with France joining and eventually became the Six Nations when Italy was added in 2000. The 1xBet Zambia platform are top betting sites in which those teams are featured too.\n\nThe format of the tournament is a round-robin, where each team plays five matches, hosting some and visiting others. The winner is awarded the Six Nations Trophy, and teams also compete for several other trophies based on individual matchups. They are the Calcutta Cup (England vs. Scotland) and the Triple Crown (if one of the Home Nations defeats the others). The tournament typically takes place over seven weeks, starting in February and concluding in March. It is also possible tobet on football with 1xbet.com.zm/en/line/footballon great football matches while waiting for this tournament too.\n\nThe Six Nations Championship has seen some outstanding performances over the years. England is the most successful team in the tournaments history, with 29 titles, including 13 Grand Slams, where they win all their matches. Wales comes next with 28 titles and 12 Grand Slams. Ireland has also been dominant in recent years, claiming their 15th title in 2023, while France has 18 titles and is known for their flair in attack. Now, with 1xBet, you can also bet onthe national football teams of those teams in addition to their rugby squads too.\n\nScotland has won the tournament outright 14 times but hasnt done so since the Five Nations era. Italy, the newest addition, has struggled to keep up with the more established teams, yet they continue to improve and grow in the sport.\n\nThe Six Nations Championship has created some unforgettable moments in rugby history. If you visit1xbet.com.zm/en/lineyou can also wager on great moments of this championship.\n\nFrances Le Crunch victory over England in 2022 was a highlight, as it secured their Grand Slam. Irelands 2023 title win also showcased their dominance in European rugby, especially their key victories over England (29-16) and Scotland (22-7). Despite Italys underdog status, they pulled off a shocking victory against Wales in 2022, their first Six Nations win in seven years. The Italian team is a squad that can also be wagered if you go to the 1xBet platform.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17115239/Screenshot-2024-12-17-at-13.52.04.png",
            "description": "<p>The Six Nations Championship is one of the most exciting and historic rugby tournaments in the world. The top betting sites in Zambia 1xBet also feature this competition. It takes place annually and involves 6 European countries: England; France; Ireland; Italy; Scotland; and Wales. The competition was initially the Home Nations Championship in 1883, featuring only</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-entertaining-rugby-six-nations/\">The entertaining Rugby Six Nations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabwe fails to pay white farmers who had land expropriated, reimburses others not part of deal",
            "url": "https://www.newzimbabwe.com/zimbabwe-fails-to-pay-white-farmers-who-had-land-expropriated-reimburses-others-not-part-of-deal/",
            "content": "Bloomberg\n\nWhite commercial growers in Zimbabwe said that the government has failed to pay part of $331 million in compensation to farmers for expropriating their land but reimbursed others who werent part of the deal.\n\nIn a joint letter to the finance ministry dated December 10, the Commercial Farmers Union and the Southern African Commercial Alliance asked for urgent talks with the government. The letter said many of their members are now destitute and have had their dignity taken away as a result of failure to get reimbursed through the so-called Global Compensation Deal.\n\nUnder an accord signed in 2020, the government agreed to compensate about 4,000 White farmers whose land was seized by state-backed militants, but it has repeatedly missed payment deadlines. The government expects the deal to cost $3.5 billion over as many as 10 years.\n\nThe Harare-based government has defended the land seizures, saying they were meant to address colonial imbalances.\n\nThe current approach risks eroding trust and undermining the structured dialogue platforms objectives, the unions said in the letter seen by Bloomberg and confirmed by the Finance Ministry. We urge your ministry to prioritise dialogue with the GCD signatories to develop a cohesive, homegrown solution that balance compensation with agricultural recovery.\n\nSo far 1 300 former white commercial farmers have signed up to receive compensation, according to official data.\n\nZimbabwe set aside $35 million in the budget for the year that ended March 31 to begin payments. It set aside $10 million for the current fiscal year.\n\nThe country has identified at least 439 former landowners as beneficiaries for the financial settlement of $331 million, according to the African Development Bank.\n\nThe government will continue to make payments to farmers who want to be compensated, said Andrew Bvumbe, the head of debt management in the finance ministry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17083942/white-farmer.jpg",
            "description": "<p>Bloomberg White commercial growers in Zimbabwe said that the government has failed to pay part of $331 million in compensation to farmers for expropriating their land but reimbursed others who weren’t part of the deal. In a joint letter to the finance ministry dated December 10, the Commercial Farmers Union and the Southern African Commercial</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-fails-to-pay-white-farmers-who-had-land-expropriated-reimburses-others-not-part-of-deal/\">Zimbabwe fails to pay white farmers who had land expropriated, reimburses others not part of deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "‘It’s as if an atomic bomb fell on Mayotte’: Widespread destruction after 100-year cyclone pummels French territory",
            "url": "https://www.newzimbabwe.com/its-as-if-an-atomic-bomb-fell-on-mayotte-widespread-destruction-after-100-year-cyclone-pummels-french-territory/",
            "content": "Thousands are feared dead after a devastating 100-year cyclone ripped across the French archipelago of Mayotte on Saturday, inflicting destruction that one resident likened to an atomic bomb.\n\nThe situation is catastrophic, apocalyptic, Bruno Garcia, owner of Hotel Caribou in Mamoudzou, Mayottes capital, told CNN-affiliate BFMTV.\n\nWe lost everything. The entire hotel is completely destroyed, Garcia said. There is nothing left. Its as if an atomic bomb fell on Mayotte.\n\nMayotte lies in the Indian Ocean off the east coast of Africa, just west of Madagascar. Made up of two main islands, its land area is about twice the size of Washington DC.\n\nCyclone Chido, a category 4 storm, tore through the southwestern Indian Ocean over the weekend, impacting northern Madagascar before rapidly intensifying and slamming Mayotte with winds above 220 kilometers per hour (136 miles per hour), according to Frances weather service. It was the strongest storm to hit the islands in more than 90 years, Meteo-France said.\n\nChido then continued into northern Mozambique where it continued to cause damage, though the storm has now weakened.\n\nThe cyclone  the worst to hit the territory of just over 300,000 in at least 90 years  flattened neighborhoods, knocked out electrical grids, crushed hospitals and schools and damaged the airports control tower.\n\nHonestly, what we are experiencing is a tragedy, you feel like you are in the aftermath of a nuclear war I saw an entire neighborhood disappear, Mohamed Ishmael, a Mamoudzou resident, told Reuters.\n\nAt least 14 people have been confirmed dead by the French health minister, but the true death toll is expected to be much higher, with local officials predicting the number of victims could be in the hundreds or even thousands, the Associated Press reported.\n\nI think there are some several hundred dead, maybe well get close to a thousand. Even thousands  given the violence of this event, Mayotte Prefect Franois-Xavier Bieuville told TV station Mayotte la 1re.\n\nFrench President Emmanuel Macron said late Monday on X that he planned to travel to Mayotte in the coming days to support our fellow citizens, civil servants and the emergency services that have been mobilized. He added that he would declare a national mourning period.\n\nThe worst damage was to the informal settlements and shacks that are found across Mayotte, both Bieuville and Retailleau said. There is nothing left, Retailleau said.\n\nOf the official death toll, Bieuville said: This figure is not plausible when you see the images of the slums. Aerial footage from Frances military showed villages reduced to rubble.\n\nThese neighborhoods are home to many of the roughly 100,000 undocumented migrants who live in Mayotte, according to Frances interior ministry.\n\nLocated about 5,000 miles from Paris, Mayotte is the poorest place in the European Union and has struggled with unemployment, violence and a deepening migration crisis.\n\nIn recent decades, tens of thousands of people from neighboring Comoros and Madagascar have come to Mayotte seeking better economic conditions and access to the French welfare system.\n\nThe extent of the damage from the storm, which wrecked roads and communications networks, and the prevalence of undocumented migrants living in informal dwellings have hindered search and rescue efforts and made it difficult to ascertain the true death toll.\n\nAbout two thirds of the island is currently unreachable, Estelle Youssouffa, member of parliament for the first constituency of Mayotte told BMFTV.\n\nWe must not confuse the villages that are cut off from communication () and the shanty towns, where there is very little chance of there being survivors. Everything has been razed, Yousouffa said.\n\nAntoine Piacenza, who works in a middle school in Mamoudzou, told BFMTV that many of his students, who are undocumented, chose not to evacuate ahead of the storm out of fear of being caught by the police.\n\nIn recent years, France has flooded the island with thousands of police, tasked with deporting undocumented migrants and dismantling their settlements.\n\nDesperate family members took to social media to search for news of their loved ones after the storm.\n\nAs of Monday morning, Mayotte had been almost entirely offline for over 36 hours, according to the website NetBlocks.\n\nWe have no electricity, no water, weve been in the dark for three days. Its been three days and we havent seen any rescuers, Fahar, a Mamoudzou resident, told BFMTV.\n\nFrances minister for everyday security, Nicolas Daragon, said on social media late Sunday the first military planes providing emergency aid to the cyclone-battered island had landed.\n\nRetailleau said that France had mobilized two naval ships and that they were hopeful that more flights would be able to enter the territory soon, noting that flights cannot land at night yet given how badly the airport was affected by the cyclone.\n\nFrance is standing by their side with a helping hand, Retailleau said of the Mayotte people.\n\nMeanwhile, hundreds of rescuers, firefighters and police have been sent to the territory from France and Reunion, the Associated Press reported.\n\nCyclones, also known as typhoons and called hurricanes in North America, are enormous heat engines of wind and rain that feed on warm ocean water and moist air. Cyclone season in the southwest Indian Ocean typically runs from mid-November to the end of April, according to Frances weather agency.\n\nScientists say climate change, driven by humans burning fossil fuels, is making tropical cyclones more destructive as hotter oceans fuel them with more energy and warmer air can hold more moisture, which is wrung out in the form of torrential rain.\n\nIn 2019, two powerful cyclones,Idai and Kenneth, pummeled Mozambique over a period of two months, killing hundreds and leaving millions in need of humanitarian assistance.\n\nChad Youyou, a resident in Hamjago in the north of Mayotte, posted videos to Facebook showing flattened trees and extensive damage to his village, the Associated Press reported.\n\nMayotte is destroyed  we are destroyed, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17063214/gettyimages-2189400303.webp",
            "description": "<p>CNN Thousands are feared dead after a devastating 100-year cyclone ripped across the French archipelago of Mayotte on Saturday, inflicting destruction that one resident likened to an atomic bomb. “The situation is catastrophic, apocalyptic,” Bruno Garcia, owner of Hotel Caribou in Mamoudzou, Mayotte’s capital, told CNN-affiliate BFMTV. “We lost everything. The entire hotel is completely</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-as-if-an-atomic-bomb-fell-on-mayotte-widespread-destruction-after-100-year-cyclone-pummels-french-territory/\">‘It’s as if an atomic bomb fell on Mayotte’: Widespread destruction after 100-year cyclone pummels French territory</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "ZimParks initiates broad investigations as Lake Chivero becomes deadly for surrounding wildlife and aqua-life; suspects sewage runoff from Marimba area contaminating the water",
            "url": "https://www.newzimbabwe.com/zimparks-initiates-broad-investigations-as-lake-chivero-becomes-deadly-for-surrounding-wildlife-and-aqua-life-suspects-sewage-runoff-from-marimba-area-contaminating-the-water/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced that it has dispatched a team to conduct broader investigations at Lake Chivero after fish and wildlife succumbed to contaminated water over the past week.\n\nFour white rhinos, three zebras, birds and livestock died after drinking cyanobacteria-contaminated water from the lake.\n\nNewZimbabwe.com witnessed thousands of fish dead and dying over the weekend.\n\nZimParks spokesperson Tinashe Farawo in a statement said their first investigations have established that 1,000 fish died adding that sewage runoff from Marimba could be a trigger.\n\nFarawo said even more fish might die.\n\nPreliminary investigations indicate that sewage runoff from the Marimba area has forced contaminated water into multiple bays, creating hazardous conditions for aquatic life.\n\nHigh pollution results in a boom in algae growth, this increases oxygen demand on the water body resulting in high mortality for the fish.\n\nAs wind patterns continue to shift, we anticipate that this issue may further impact fish populations across the lake.\n\nIn response, our team is currently on the ground carrying out further investigations on a broader scale, he said.\n\nThe authority recently blamed Harare City Council for discharging raw sewage into the lake which is a primary source of water and a popular recreational spot for Harare residents and other surrounding communities.\n\nHowever, in an interview withNewZimbabwe.com, Harare Mayor Jacob Mafume said this is not a good time to play the blame game.\n\nMafume however acknowledged that Harare City Council is not solely responsiblefor the sewer which finds its way to the lake.\n\nWe as the city Yes, we have work to do in terms of raw sewage issues.\n\nHowever industry and other informal settlements and other poachers around the area are contributing to the degradation of the quality of water at Lake Chivero.\n\nIt needs all stakeholders approach to look at the number of activities that are happening around that area.\n\nAt this point, we need to stop finger-pointing, we need to find a solution.\n\nThe lake has been polluted over time and therefore it is very critical for us to quickly find a solution and find resources to deal with the contaminants that are affecting the lake, he said.\n\nResponding to questions on X, Mafume seemed not convinced that cyanobacteria caused the deaths of white rhinos.\n\nAs someone who has worked in the criminal justice system. The story is about a bacteria that targets four white rhinos and fish? Do we really need a Sherlock Holmes on this one? Gentlemen four rhinos have died, who killed them? Lake chivero! Really! Yes water is green and some fish died, he wrote.\n\nMafume said they are currently treating their sewer through the waterworks department and also sourcing funds from the government to deal with these issues.\n\nIn a statement issued Monday, Harare City Council said teams are already on the ground to take samples from the particular part of the lake the rhinos drink from.\n\nLake Chivero is abundant in various fish species, including tilapia and catfish.\n\nA number of registered fishing cooperatives and unregistered individual fishermen operate at the lake with their market largely being Harare residents.\n\nLake Chivero Recreational Park accommodates about 400 species.\n\nMeanwhile, according to the World Health Organisation (WHO), Cyanobacterial toxins occur naturally, but human activity influences the extent to which toxic cyanobacteria proliferate.\n\nWHO recommends management of lakes, reservoirs and rivers to prevent cyanobacterial blooms is critical to protect human health.\n\nThe specialised agency of the United Nations responsible for global public health also says marine cyanobacteria can cause severe skin lesions, for which, however, there is still a lack of dose-response information as a basis for estimating tolerable exposure levels.\n\nSome people may experience allergic reactions to cyanobacteria, whereas others may be unaffected.\n\nPeople may be exposed to cyanotoxins through oral, respiratory and dermal routes.\n\nIngestion may occur through drinking water or accidental uptake during water sports, recreational or occupational activities.\n\nIn some settings, contaminated food can be a source of dietary exposure.\n\nThis includes fish collected from bloom-ridden water bodies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17043723/WhatsApp-Image-2024-12-16-at-15.58.17.jpeg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced that it has dispatched a team to conduct “broader” investigations at Lake Chivero after fish and wildlife succumbed to contaminated water over the past week. Four white rhinos, three zebras, birds and livestock died after drinking cyanobacteria-contaminated water from the lake. NewZimbabwe.com</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-initiates-broad-investigations-as-lake-chivero-becomes-deadly-for-surrounding-wildlife-and-aqua-life-suspects-sewage-runoff-from-marimba-area-contaminating-the-water/\">ZimParks initiates broad investigations as Lake Chivero becomes deadly for surrounding wildlife and aqua-life; suspects sewage runoff from Marimba area contaminating the water </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabweans infuriated by proposal to not insure, licence vehicles without radio licences: says it targets motorists",
            "url": "https://www.newzimbabwe.com/zimbabweans-infuriated-by-proposal-to-not-insure-licence-vehicles-without-radio-licences-says-it-targets-motorists/",
            "content": "By Anna Chibamu\n\nZIMBABWEANS have poked holes into the proposed law which will see motorists without radio licences being denied the Zimbabwe National Road Administration (ZINARA) motor vehicle licenses and motor insurance policies.\n\nThe Portfolio Committee on Media, Information and Broadcasting Services held public hearings on the Broadcasting Services Amendment Bill this Monday.\n\nSome citizens who spoke on the proposed clause (15) of the amendment bill said it was improper for the government to push for a law that discriminates against motorists yet even people with phones have access to the radio.\n\nAccording to the amendment of Section 38B (Licencing of Listeners) Clause 15 of the Amendment Bill of the Principle Act is amended by the insertion of a new subsection (3) as follows (4)The Zimbabwe National Road Administration ZINARA and every motor insurance company shall only issue a motor vehicle licence and motor insurance policy respectively to individuals who either hold a current radio licence issued by the Zimbabwe Broadcasting Corporation ZBC or a valid exemption certificate from ZBC unless the vehicle to be insured is not equipped with a radio receiver; provided the licence applicant shall sign a declaration as specified in the Eighth Schedule.\n\nDuring the Public hearings this Monday, many said it was unfair for motorists not to be licenced by ZINARA if they do not own a radio licence.\n\nMost felt motorists were not the only people who listen to the radio because even those who own phones can now listen to the radio so they should not be left out.\n\nNowadays, even my grandmother can access the radio on the phone so why are you targeting motorists only? There must be a re-look on that aspect that mandates motorists. Some people have radios in their homes so they must also be made to pay licences for the radio like any other motorists, Costa Nkomo said.\n\nOne, Pastor Shadhaya asked; But who sponsors ZBC? I want to simplify things here. Let us take for example We have 15 million people, in the population of Zimbabwe. If 12 million own radios, TVs and phones. If we get just a dollar from those 12 million. How much will we raise? If we are honest enough and work together, we stop corruption, we move forward.\n\nHatitye added: On the licencing of motorists, I doubt the move will yield positive results. Ephraim Katiyo said; the fine of not having a licence must be high and not the licencing. Licencing must be as little as possible and be affordable, so I say licencing of radio fees must be very low.\n\nSome of the speakers called for improvement of the national broadcasters poor quality content.\n\nOur broadcaster is not pleasing. Why are people running away from watching ZBC.\n\nAnother contributor said, Focusing on motorists is very discriminatory. Fund the national broadcaster from the fiscus or look for resources from somewhere. Find sustainable and diversified ways to fund the broadcaster.\n\nFormer ZBC employee and Zanu PF representative Robson Mhandu raised issues including that the national broadcaster be governed by just one act.\n\nOn the licencing part, Mhandu told the committee: Zimbabwean citizens who are paying licenses, radio, television, they are paying for ownership of the gadget, it doesnt talk about the services provided, it doesnt talk about other critical issues.\n\nCan we consider changing that to not just ownership of a gadget, you may own a gadget that is not functional, that is not working, and you get harassed for ownership of that gadget.\n\nCan we do something about that? I believe its an old law, passed several years, I believe even before independence.\n\nMedia Monitors representative Green Kunyeda told the committee that, the approach of concentrating on motorists only, is a violation of the rights of those motorists.\n\nIt is my humble submission that the committee and all those behind the crafting of the bill actually find ways to fund the public broadcaster and, by consequence, other broadcasting players to the broadcasting fund. But what has to be done, is we need a more diverse and inclusive model of taping into the sources of, potential sources of revenue identified.\n\nFocusing on motorists alone is discriminating and narrows the net. Why cant we find other models, where, for example, as we import a television station, a television set, people can view the license at the border, they import, there is the television set is sold, another way is found how to generate that money.\n\nHe added that in other countries like Mozambique, they use a system where they view it on the electricity tariff.\n\nHowever, others felt it was justified to licence motorists to reduce time spent on the roads by the ZBC, police and ZINARA officials searching for defaulters who do not have radio licences thereby inconveniencing others.\n\nA member of the Global Alliance for Sustainable Development said, This view is a crucial step towards empowering us in our way of broadcasting cooperation services, to combat these effective global propositions and promote our national interest. By introducing a military license, we will be able to support our national protesters and safeguard our national security.\n\nAs a nation, we have been subjected to many great struggles that distinguished our image on a scale of migration. This bill presents an opportunity for us to take control of our airwaves and promote a narrative that reflects our true history and values.\n\nThe Committee is holding public hearings in all provinces this week and hopes to finalise the bill early next year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17051029/radio.webp",
            "description": "<p>By Anna Chibamu ZIMBABWEANS have poked holes into the proposed law which will see motorists without radio licences being denied the Zimbabwe National Road Administration (ZINARA) motor vehicle licenses and motor insurance policies. The Portfolio Committee on Media, Information and Broadcasting Services held public hearings on the Broadcasting Services Amendment Bill this Monday. Some citizens</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-infuriated-by-proposal-to-not-insure-licence-vehicles-without-radio-licences-says-it-targets-motorists/\">Zimbabweans infuriated by proposal to not insure, licence vehicles without radio licences: says it targets motorists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        },
        {
            "title": "Harare Wetlands Trust issues 2-day ultimatum for council to resolve Lake Chivero Sewage crisis",
            "url": "https://www.newzimbabwe.com/harare-wetlands-trust-issues-2-day-ultimatum-for-council-to-resolve-lake-chivero-sewage-crisis/",
            "content": "By Thandiwe Garusa\n\nHARARE Wetlands Trust has given Harare City Council (HCC) a 48-hour ultimatum to address raw sewage contaminating Lake Chiveros water.\n\nThousands of fish, and four white rhinos, along with other wildlife and livestock, have perished after consuming water from the lake that was contaminated with cyanobacteria.\n\nIn a letter to the city council, Harare Wetlands Trust called for urgent measures to decontaminate the lake and take other necessary actions.\n\nIf the local authority fails to comply and address the situation, the Wetlands Trust through the Zimbabwe Lawyers for Human Rights (ZLHR) vowed to sue.\n\nFrom our clients professional experience and expertise, our client reasonably believes that the pollution by cyanobacteria in Lake Chivero is caused by the City of Harares conduct of constantly dumping raw sewage effluent in Lake Chivero over the years.\n\nOur client, being a not-for-profit organisation whose main objective, inter alia, is the environmental protection of all water bodies and aqua biodiversity and aqua deeply concerned that this dire situation can lead to the loss of animal life, aqua 1 aqua bio-diversity.\n\nOur client also understands that people carry out fishing activities in Lake Chivero in which they obtain fish for resale and consumption. This has a ripple effect on people consuming contaminated fish,the letter reads.\n\nAccording to the Zimbabwe Parks and Wildlife Management Authority (ZimParks), the water pollution was largely caused by raw sewage, particularly from the Marimba area in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17043748/WhatsApp-Image-2024-12-16-at-15.58.17-1.jpeg",
            "description": "<p>By Thandiwe Garusa HARARE Wetlands Trust has given Harare City Council (HCC) a 48-hour ultimatum to address raw sewage contaminating Lake Chivero’s water. Thousands of fish, and four white rhinos, along with other wildlife and livestock, have perished after consuming water from the lake that was contaminated with cyanobacteria. In a letter to the city</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-wetlands-trust-issues-2-day-ultimatum-for-council-to-resolve-lake-chivero-sewage-crisis/\">Harare Wetlands Trust issues 2-day ultimatum for council to resolve Lake Chivero Sewage crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Dec 2024"
        }
    ]
}