{
    "news": [
        {
            "title": "Shahidi, Bennett star as Afghanistan draw Zimbabwe Test",
            "url": "https://www.newzimbabwe.com/shahidi-bennett-star-as-afghanistan-draw-zimbabwe-test/",
            "content": "AFP\n\nAfghanistanveteran Hashmatullah Shahidi andZimbabwerookie Brian Bennett starred as the first Test was drawn after a rain-shortened final day in Bulawayo on Monday.\n\nShahidi claimed an Afghan record 246 runs at the end of a marathon innings while spinner Bennett took five wickets.\n\nZimbabwe made 586 and 142-4 to lead Afghanistan by 29 runs at stumps after the tourists posted 699. Both first innings scores were national records.\n\nWith Zimbabwe 88-4 in their second innings and 25 runs behind, batting stability was required and the unbeaten partnership of veterans Sean Williams (35) and Craig Ervine (22) provided it.\n\nShahidi departed after being trapped leg before by Bennett, whose 5-95 were the best figures among the six-man Zimbabwe attack.\n\nThe 30-year-old left-hand batter faced 474 balls in 694 minutes, and struck 21 fours at Queens Sports Club in the southwestern city.\n\nHis partnerships with Rahmat Shah (364 runs) and Afsar Zazai (211) ensured Afghanistan took a 113-run first innings lead.\n\nThe previous highest Test score of Shahidi was 200 not out, also against Zimbabwe, in Abu Dhabi three years ago.\n\nBefore the exit of Shahidi, wicketkeeper Zazai claimed a maiden Test century, hitting 113 before being caught at backward point by substitute Johnathan Campbell.\n\nThe fall of Shahidi triggered a collapse with the final six Afghanistan wickets going for just 20 runs in four overs as the off spin of Bennett wreaked havoc.\n\nBennett, a 21-year-old appearing in only his second Test, twice took wickets from successive balls only to be deprived of hat-tricks on both occasions.\n\nHe also shone with the bat, making 110 not out in the first innings after Zimbabwe captain Ervine won the toss.\n\nBatting a second time, Zimbabwe put on 73 runs before an outside edge from Joylord Gumbie (24) allowed Shahidi to make a simple catch in the slips.\n\nThe fall of the wicket was followed almost immediately by mid-afternoon rain that led to a one hour delay.\n\nTest debutant Ben Curran, a son of deceased former Zimbabwe coach Kevin Curran and brother of England internationals Tom and Sam, made 41 before being run out.\n\nGumbie, Curran and Takudzwanashe Kaitano (5) fell in the space of 14 balls, with spinner Zahir Khan taking two wickets, and Dion Myers(4) was bowled by teenage spinner Allah Ghazanfar.\n\nBrief scores\n\nZimbabwe 586 in 135.2 overs and 142-4 in 34 overs (Ben Curran 41, Sean Williams 35 not out, Craig Ervine 22 not out; Zahir Khan 2-43) v Afghanistan 699 in 197 overs (Hashmatullah Shahidi 246, Rahmat Shah 234, Afsar Zazai 113; Brian Bennett 5-95)\n\nResult: Match drawn\n\nToss: Zimbabwe\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31040652/FILE-Zimbabwe-made-586-and-142-4-to-lead-Afghanistan-by-29-runs-at-stumps-after-the-tourists-posted-699-Both-first-innings-scores-were-national-records-Picture-AFP-Jekesai-Njikizana.webp",
            "description": "<p>AFP Afghanistan veteran  Hashmatullah Shahidi and Zimbabwe rookie Brian Bennett starred as the first Test was drawn after a rain-shortened final day in Bulawayo on Monday. Shahidi claimed an Afghan record 246 runs at the end of a marathon innings while spinner Bennett took five wickets. Zimbabwe made 586 and 142-4 to lead Afghanistan by 29 runs at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shahidi-bennett-star-as-afghanistan-draw-zimbabwe-test/\">Shahidi, Bennett star as Afghanistan draw Zimbabwe Test</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe extends retirement age for civil servants, uniformed forces",
            "url": "https://www.newzimbabwe.com/zimbabwe-extends-retirement-age-for-civil-servants-uniformed-forces/",
            "content": "By Thandiwe Garusa\n\nThe government has increased the retirement age for civil servants and uniformed forces by an additional five years, effective 1 January 2025.\n\nAccording to Statutory Instrument (SI) 197 of 2024, dated 30 December 2024, the retirement age for civil servants has been raised from 65 to 70.\n\nHowever, at the age of 60, they still have the choice to retire early, provided they submit a three-month notice.\n\nbefore the effective date, may have a pensionable age of sixty-five years with option to retire at seventy-years on full pension: Provided that any retirement after the year of sixty-fifth anniversary and before the seventieth anniversary shall be deemed to be early retirement; or on or after the effective date, shall have a pensionable age of seventy years.\n\nA member may, on giving three months notice of retirement be permitted by the commission to retire before pensionable age at any time after attaining the age of sixty, part of the SI reads.\n\nAgain in SI 198 of 2024 cited as the Defence (Regular Force) (Non-Commissioned Members) (Amendment) Regulations, 2024 (No. 8), the retirement age for regular soldiers is now 55, up from 50.\n\nA member can extend to 60 and 65 years if they are a war vet.\n\nA permanent member shall, whatever the length of his or her pensionable service, retire on attaining the age of fifty-five years: Provided that if the minister, on the recommendation of the commander, considers that it is desirable in the public interest, he or she may allow that member to continue to serve for a period of five years until he or she attains the age of sixty years; or if that member is allowed to continue to serve in terms of paragraph (a), the commander may, on giving twelve months written notice to the member of his or her intention to do so, require him or her to retire before he or she has served that period, part of the SI reads.\n\nMeanwhile, the President in a Statutory Instrument 201 of 2024 has also increased pensionable service for police from 20 to 30 years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051503/zdf-3.jpeg",
            "description": "<p>By Thandiwe Garusa The government has increased the retirement age for civil servants and uniformed forces by an additional five years, effective 1 January 2025. According to Statutory Instrument (SI) 197 of 2024, dated 30 December 2024,  the retirement age for civil servants has been raised from 65 to 70. However, at the age of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-extends-retirement-age-for-civil-servants-uniformed-forces/\">Zimbabwe extends retirement age for civil servants, uniformed forces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe invites power-storage bids to ease supply crisis",
            "url": "https://www.newzimbabwe.com/zimbabwe-invites-power-storage-bids-to-ease-supply-crisis/",
            "content": "Bloomberg\n\nZimbabwes power-transmission company has invited bids for companies to install energy-storage units as part of measures to ease crippling energy shortages.\n\nZimbabwe Electricity Transmission & Distribution Co. wants battery-storage units installed on four sites that will provide at least three hours of 600 megawatts each in peak hours, it said in a statement in a government notice.\n\nThe southern African nation faces an energy shortfall that often triggers rolling blackouts to balance supply and demand. The worst drought in four decades has compounded the crisis, cutting supplies from hydropower plants. Several miners rely on imported power from neighboring Mozambique to operate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/13202907/power-plant.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s power-transmission company has invited bids for companies to install energy-storage units as part of measures to ease crippling energy shortages. Zimbabwe Electricity Transmission & Distribution Co. wants battery-storage units installed on four sites that will provide at least three hours of 600 megawatts each in peak hours, it said in a statement in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-invites-power-storage-bids-to-ease-supply-crisis/\">Zimbabwe invites power-storage bids to ease supply crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zim farmers urged to tap into China’s fruit import market",
            "url": "https://www.newzimbabwe.com/zim-farmers-urged-to-tap-into-chinas-fruit-import-market/",
            "content": "By Alois Vinga\n\nTRADE promotion agency, ZimTrade has implored local farmers to tap into Chinas fruit import market which presents an opportunity to earn the country much-needed foreign currency.\n\nIn 2023, China emerged as Zimbabwes third-largest export market, accounting for approximately 23% of our export destination market, with exports valued at an impressive $1.7 billion, according to Trade Map 2024.\n\nThis significant figure underscores the potential for fresh produce farmers to not only grow their businesses but also diversify their product offerings to meet the demands of this expansive market.\n\nThe data from Trade Map reveals a significant gap and an opportunity for Zimbabwean farmers to diversify their fruit offerings.\n\nNotably, the most imported fresh produce in China includes durians ($6.7 billion), cherries ($2.6 billion), and bananas ($1 billion), mangosteens ($730 million), grapes ($518 million), citrus ($446 million), kiwifruit ($493 million), longan ($454 million), dragon fruit ($320 million), plums ($280 million), cranberries ($260 million), macadamia ($222 million), among others.\n\nWith Zimbabwes favourable climatic conditions, there is ample room for farmers to introduce new products that could appeal to Chinese consumers. For instance, durians and mangosteens are tropical fruits that could thrive in Zimbabwes environment. Additionally, kiwifruit and dragon fruit have already begun to be cultivated in Matabeleland South, where the sunny conditions are ideal for their growth, said ZIMTRADE.\n\nThe agency said South Africa, the leading African exporter to China, has successfully captured a considerable market share, exporting nuts worth $246 million and citrus fruits worth $190 million.\n\nThis success story serves as a powerful reminder that Zimbabwean farmers can also stake their claim in this lucrative market by enhancing their capacities as individual growers, forming cooperatives, and collaborating as a nation to strengthen our export capabilities,  said ZIMTRADE.\n\nTo successfully penetrate the Chinese market, the agency said Zimbabwean farmers must navigate a complex landscape of regulations and standards.\n\nFirst and foremost, obtaining market access approval from the General Administration of Customs of the Peoples Republic of China (GACC) is essential.\n\nThis process requires adherence to Chinas stringent food safety and phytosanitary standards, which include meeting maximum residue limits (MRLs) for pesticides, complying with labelling requirements, and ensuring product traceability.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/28015833/Allan-Majuru-Zimtrade.jpg",
            "description": "<p>By Alois Vinga TRADE promotion agency, ZimTrade has implored local farmers to tap into China’s fruit import market which presents an opportunity to earn the country much-needed foreign currency. In 2023, China emerged as Zimbabwe’s third-largest export market, accounting for approximately 23% of our export destination market, with exports valued at an impressive $1.7 billion,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-farmers-urged-to-tap-into-chinas-fruit-import-market/\">Zim farmers urged to tap into China’s fruit import market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "From fame to fortune: The 14 celebrities who made the billionaires list in 2024",
            "url": "https://www.newzimbabwe.com/from-fame-to-fortune-the-14-celebrities-who-made-the-billionaires-list-in-2024/",
            "content": "IOL\n\nThe 2024 Forbes World Billionaires List features 14 celebrities who have transformed their fame into astounding fortunes, collectively amassing $31 billion.\n\nFromsports legends to media moguls, these stars have used their talents, investments, and business acumen to join the exclusive three-comma club.\n\nHeres a closer look at these individuals, ranked by their net worth as of March 2024:\n\n14:Taylor Swift\n\nNet Worth: $1.1 billion\n\nAge: 34\n\nSwifts landmark year saw her earning $190 million post-tax from her record-breaking Eras Tour. As the first person to achieve billionaire status from songwriting and performing, she remains a cultural phenomenon.\n\n13: Dick Wolf\n\nNet Worth: $1.2 billion\n\nAge:77\n\nCreator of crime show giants like Law & Order and FBI, Wolf has earned nearly $2 billion pretax over a 30-year TV career.\n\n12: Magic Johnson\n\nNet Worth: $1.2 billion\n\nAge: 64\n\nThis basketball icon built his fortune through business ventures, including stakes in sports teams like the Los Angeles Dodgers and life insurance provider EquiTrust.\n\n11: LeBron James\n\nNet Worth: $1.2 billion\n\nAge: 39\n\nWith over $1 billion earned both on and off the court, James invests in real estate, Blaze Pizza, and sports ownership stakes, including Fenway Sports Group.\n\n10: Tiger Woods\n\nNet Worth: $1.3 billion\n\nAge:48\n\nStill active in golf, Woods owes much of his wealth to endorsements, particularly a long-standing deal with Nike. Hes now launched his own clothing line, Sun Day Red.\n\n9: Rihanna\n\nNet Worth: $1.4 billion\n\nAge:36\n\nThepop starscosmetics company Fenty Beauty and lingerie brand Savage X Fenty have made her a billionaire, showcasing her entrepreneurial prowess.\n\n8: Tyler Perry\n\nNet Worth: $1.4 billion\n\nAge: 54\n\nThe actor and filmmaker has earned billions through TV, movies, and stage productions, cementing his place as a self-made entertainment tycoon.\n\n7: Peter Jackson\n\nNet Worth: $1.5 billion\n\nAge: 62\n\nThe Lord of the Rings director gained much of his wealth from selling assets of his visual effects company, Weta Digital, for nearly $1 billion.\n\n6: Kim Kardashian\n\nNet Worth: $1.7 billion\n\nAge: 43\n\nKardashiansshapewear brand, Skims, and former makeup line KKW Beauty have solidified her position as a billionaire businesswoman.\n\n5: Jay-Z\n\nNet Worth: $2.5 billion\n\nAge: 54\n\nThe rapper-turned-mogul has stakes in luxury alcohol brands like Armand de Brignac and DUsse, alongside investments in tech giants like Uber.\n\n4: Oprah Winfrey\n\nNet Worth: $2.8 billion\n\nAge: 70\n\nAmericas beloved talk show host has built a vast empire spanning media, real estate, and production, making her a household name and a billionaire icon.\n\n3: Michael Jordan\n\nNet Worth: $3.2 billion\n\nAge: 61\n\nJordans legendary brand deals, especially with Nike, and his investment in the Charlotte Hornets, which he sold for $3 billion, make him a sports and business legend.\n\n2: Steven Spielberg\n\nNet Worth: $4.8 billion\n\nAge: 77\n\nThe legendary director continues to earn from hits like Jurassic Park and Indiana Jones, and even receives profits from Universal theme parks.\n\n1: George Lucas\n\nNet Worth: $5.5 billion\n\nAge: 79\n\nThe richest celebrity billionaire owes much of his fortune to the $4 billion sale of Lucasfilm to Disney in 2012, ensuring his legacy in Hollywood history.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/13211106/rihanna-celebrates-fenty-hair-brand-83617183.webp",
            "description": "<p>IOL The 2024 Forbes World Billionaires List features 14 celebrities who have transformed their fame into astounding fortunes, collectively amassing $31 billion. From sports legends to media moguls, these stars have used their talents, investments, and business acumen to join the exclusive three-comma club. Here’s a closer look at these individuals, ranked by their net worth</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-fame-to-fortune-the-14-celebrities-who-made-the-billionaires-list-in-2024/\">From fame to fortune: The 14 celebrities who made the billionaires list in 2024</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Police launch manhunt for ‘fraudster’ branch manager who vanished with US$35,000",
            "url": "https://www.newzimbabwe.com/police-launch-manhunt-for-fraudster-branch-manager-who-vanished-with-us35000/",
            "content": "By Staff Reporter\n\nA branch manager is wanted by police for fraud after disappearing with more than US$35,000 he received from a cash-in-transit crew for depositing.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed authorities had launched a manhunt for the suspect, Mthulisi Cecil Ronald Moyo aged 23.\n\nThe ZRP is appealing for information which may lead to the arrest of Mthulisi Cecil Ronald Moyo (23) who is being sought in connection with a case of fraud.\n\nThe suspect was employed as a branch manager at a wholesaler in Victoria Falls. On October 22, 2024 he reported for duty at the shop and allegedly received US$ 35 390 from a cash-in-transit crew, which he was supposed to deposit into the wholesalers bank account.\n\nHowever, the suspect took the money and fled to an unknown destination, said Nyathi.\n\nZRP is appealing to anyone with information to contact the National Complaints Desk on (0242) 703631 or WhatsApp on 0712 800197 or report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/30121623/WhatsApp-Image-2024-12-30-at-13.40.16.jpeg",
            "description": "<p>By Staff Reporter A branch manager is wanted by police for fraud after disappearing with more than US$35,000 he received from a cash-in-transit crew for depositing. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed authorities had launched a manhunt for the suspect, Mthulisi Cecil Ronald Moyo aged 23. “The ZRP is appealing for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-launch-manhunt-for-fraudster-branch-manager-who-vanished-with-us35000/\">Police launch manhunt for ‘fraudster’ branch manager who vanished with US$35,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Sean ‘Diddy’ Combs ‘had meltdown in prison over Christmas’",
            "url": "https://www.newzimbabwe.com/sean-diddy-combs-had-meltdown-in-prison-over-christmas/",
            "content": "IOL\n\nSean Diddy Combsis said to have had a meltdown in prison over Christmas.\n\nThe rapper and music mogul, 55, has been locked up at the notoriously tough Metropolitan Detention Center in Brooklyn, New York, since September and is awaiting trial in 2025 on charges including sex trafficking and racketeering  all of which he strongly denies.\n\nA source has now told The Sun he had to be taken for observation over the festive period as he allegedly couldnt believe he was still behind bars for Christmas.\n\nThe insider said: With his high-powered legal teamDiddythought hed be out on bail by now.\n\nSpending the holidays behind bars was a nightmare for him. He eventually managed to calm himself down with the meditation technique hes been using while hes been behind bars.\n\nIt took him a few hours of deep breathing and focusing to get out of the bad space he was in, but he finally managed it.\n\nAnother source close to the disgraced rapper denied the claims he suffered a meltdown.\n\nThey told the Daily Mail the rapper is continuing to stay strong in prison.\n\nThe reports come after a legal expert said Combs bleak Christmas behind bars was a reminder of the seriousness of the allegations against him.\n\nJames Pipe, from freegrantsforfelons.org, told the Daily Star: The stark contrast between Diddys past life of indulgence and his current circumstances highlights the profound consequences of legal and personal accountability.\n\nWhile the festive season might offer moments of muted cheer for some inmates, for Combs, it serves as a reminder of the seriousness of the allegations against him and the impact of his actions on others.\n\nIts been widely reported Combs and his fellow inmates ate a Christmas Day meal of baked Cornish hen, macaroni and cheese, cranberry sauce and dinner rolls, followed by a holiday dessert.\n\nMr Pipe added inmates might get a hot chocolate or a pastry if the facilitys budget allows.\n\nHe said the jail runs a no frills and no luxury regime.\n\nThe comments on Combs grim Christmas come after it was reported he has lost a huge amount of weight behind bars, according to a journalist who attended his last court proceeding.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>IOL Sean ‘Diddy’ Combs is said to have had a “meltdown” in prison over Christmas. The rapper and music mogul, 55, has been locked up at the notoriously tough Metropolitan Detention Center in Brooklyn, New York, since September and is awaiting trial in 2025 on charges including sex trafficking and racketeering – all of which he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-diddy-combs-had-meltdown-in-prison-over-christmas/\">Sean ‘Diddy’ Combs ‘had meltdown in prison over Christmas’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Jeju Air shares plummet to record low after deadly plane crash",
            "url": "https://www.newzimbabwe.com/jeju-air-shares-plummet-to-record-low-after-deadly-plane-crash/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29061022/241229-jeju-air-crash-cc-1214a-f75953.webp",
            "description": "<p>Reuters Shares of South Korean budget carrier Jeju Air (089590.KS), hit their lowest on record on Monday, after the deadliest air crash in the country killed 179 people. Jeju Air shares traded down 8.5% as of 0312 GMT, after falling as much as 15.7% earlier in the session to 6,920 won, the lowest since they were listed in 2015.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jeju-air-shares-plummet-to-record-low-after-deadly-plane-crash/\">Jeju Air shares plummet to record low after deadly plane crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Govt pats itself on the back for effective response to ‘worst drought since Independence’",
            "url": "https://www.newzimbabwe.com/govt-pats-itself-on-the-back-for-effective-response-to-worst-drought-since-independence/",
            "content": "By Thandiwe Garusa\n\nThe government had an effective response to the ongoing devastating El Nino-induced drought, Zimbabwes worst in four decades, Agriculture Minister Anxious Masuka has said.\n\nSpeaking during the National Thanksgiving and Dedication Service in Bulawayo Sunday, Masuka said there were no queues or rising food prices as had been experienced in other drought years.\n\nThe El Nino drought has been the worst in 43 years since 1980. Wecould go and queue for groceries without even knowing what was being sold there.\n\nThis has been the worst drought since independence and this is the most normal drought, no queues, no escalation in food prices, mealie meal is available and this does not just happen.\n\nThis is leadership and that is the leadership of President Emmerson Mnangagwa. Just to put that into context, the President is currently directly feeding 12.47 million people, 83% of Zimbabweans are dependent directly on what the President is doing, he said.\n\nHowever, food prices have been rising since the introduction of a new currency, the Zimbabwe Gold (ZiG) in April this year. The currency has devalued, now trading at $1:ZWG40 to 60 on the black market.\n\nMost rural areas in Zimbabwe have been experiencing severe hunger and relying on food aid from humanitarian organizations such as the World Food Program, USAID, and Care International.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/01030702/Anxious-Masuka.png",
            "description": "<p>By Thandiwe Garusa The government had an effective response to the ongoing devastating El Nino-induced drought, Zimbabwe’s worst in four decades, Agriculture Minister Anxious Masuka has said. Speaking during the National Thanksgiving and Dedication Service in Bulawayo Sunday, Masuka said there were no queues or rising food prices as had been experienced in other drought</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-pats-itself-on-the-back-for-effective-response-to-worst-drought-since-independence/\">Govt pats itself on the back for effective response to ‘worst drought since Independence’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Jimmy Carter, former US president, dies aged 100",
            "url": "https://www.newzimbabwe.com/jimmy-carter-former-us-president-dies-aged-100/",
            "content": "BBC\n\nFormer US President Jimmy Carter has died aged 100, the centre he founded has confirmed.\n\nThe former peanut farmer lived longer than any president in history and celebrated his 100th birthday in October.\n\nThe Carter Center, which advocates for democracy and human rights around the world, said he died on Sunday afternoon at his home in Plains, Georgia.\n\nThe Democrat served as president from 1977 to 1981, a period beset by economic and diplomatic crises.\n\nAfter leaving the White House with low approval ratings, his reputation was restored through humanitarian work which earned him the Nobel Peace Prize.\n\nMy father was a hero, not only to me but to everyone who believes in peace, human rights, and unselfish love, his son, Chip Carter, said in a statement.\n\nThe world is our family because of the way he brought people together, and we thank you for honouring his memory by continuing to live these shared beliefs.\n\nCarter  who prior to becoming president was governor of Georgia, a lieutenant in the US navy and a farmer  is survived by his four children, 11 grandchildren and 14 great-grandchildren.\n\nHis wife, Rosalynn, who he was married to for 77 years, died in November 2023.\n\nSince 2018 and the death of George HW Bush, he was the oldest surviving US president.\n\nCarter stopped medical treatment for an undisclosed illness last year and instead began receiving hospice care at his home.\n\nPresident Joe Biden and First Lady Jill Biden said the world had lost an extraordinary leader, statesman and humanitarian.\n\nDescribing him as a dear friend and a man of principle, faith and humility, they added: He showed that we are a great nation because we are a good people  decent and honorable, courageous and compassionate, humble and strong.\n\nThe challenges Jimmy faced as president came at a pivotal time for our country and he did everything in his power to improve the lives of all Americans, President-elect Donald Trump wrote on social media.\n\nFor that, we all owe him a debt of gratitude.\n\nCarters presidency will be remembered for his struggles in dealing with acute economic problems and several foreign policy challenges, including the Iran hostage crisis, which ended with the deaths of eight Americans.\n\nThere was, however, a notable foreign policy triumph in the Middle East when he helped broker an accord between Egypt and Israel, signed at Camp David in the US in 1978.\n\nBut that seemed a distant memory two years later, when voters overwhelmingly chose Republican Ronald Reagan, who had portrayed the president as a weak leader unable to deal with inflation and interest rates at near record highs.\n\nCarter lost the 1980 election by a landslide, winning only six US states plus Washington DC.\n\nIn the aftermath of such a heavy defeat, Carter was frequently held up by Republicans as an example of liberal ineptitude.\n\nMeanwhile, many in his own party either ignored him or viewed his presidential shortcomings as evidence their brand of Democratic politics or policy was a better way.\n\nToday many on the right still deride the Carter years but as the decades passed, his humanitarian efforts and simple lifestyle began to shape a new legacy for many Americans.\n\nAfter leaving the White House, he became the first and only president to return full-time to the house he lived in before politics  a humble, two-bedroom ranch-style home.\n\nHe chose not to pursue the lucrative after-dinner speeches and publishing deals awaiting most former presidents,telling the Washington Post in 2018that he never really wanted to be rich.\n\nInstead, he spent his remaining years trying to address global problems of inequality and disease.\n\nHe also teamed up with Nelson Mandela to found The Elders, a group of global leaders who committed themselves to work on peace and human rights.\n\nIn accepting his Nobel prize in 2002  only the third US president to receive it  he said: The most serious and universal problem is the growing chasm between the richest and the poorest people on Earth.\n\nIn a statement, former President Bill Clinton and wife Hillary Clinton said he worked tirelessly for a better, fairer world, noting his humanitarian, environmental and diplomatic efforts.\n\nGuided by faith, President Carter lived to serve others  until the very end, they added.\n\nFormer President Barack Obama paid tribute to Carters decency and said he taught all of us what it means to live a life of grace, dignity, justice, and service.\n\nRepublican former President George W Bush, meanwhile, said Carter dignified the office and that his efforts to leave behind a better world didnt end with the presidency.\n\nPresident Biden said a state funeral would be held in Washington DC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/30042552/jimmy-carter-scaled.jpg",
            "description": "<p>BBC Former US President Jimmy Carter has died aged 100, the centre he founded has confirmed. The former peanut farmer lived longer than any president in history and celebrated his 100th birthday in October. The Carter Center, which advocates for democracy and human rights around the world, said he died on Sunday afternoon at his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jimmy-carter-former-us-president-dies-aged-100/\">Jimmy Carter, former US president, dies aged 100</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "31 Dec 2024"
        }
    ]
}