{
    "news": [
        {
            "title": "Spur looks for growth beyond SA borders with new restaurant in Zimbabwe",
            "url": "https://www.newzimbabwe.com/spur-looks-for-growth-beyond-sa-borders-with-new-restaurant-in-zimbabwe/",
            "content": "TimesLive\n\nSpur Corporation will open a new Doppio Zero restaurant in Zimbabwe, making it the brands second outlet outside South Africa, as the company eyes a total of about 50 restaurants across a number of countries in the coming years.\n\nSpur also wants to add more small-format restaurants for its other brands, including Rocco Mamas, following the success of Panarottis, which breached the R1bn mark in full-year turnover.\n\nDuring the financial year to June, Spur Corporation opened the first Doppio Zero restaurant outside South African borders in Gaborone, Botswana, and now has plans to add more outlets, but mainly in South Africa. Doppio ended the financial year with 32 restaurants after opening four more.\n\nSpur bought the Doppio group, which includes Modern Tailors and Pizza e Vino, about two years ago. The company was fully included in the 2025 financial year, and contributed R709.9m to total group restaurant sales.\n\nRentals are expensive, so if you go into these smaller markets, you cant afford to build a very big store. The most important thing is that it becomes a lovely entry-level investment for new, and young, franchisees. So a lot of new companies might not have R7m to invest in a full restaurant, but maybe theyve got R4m to invest in a smaller footprint format.\n\nSpur Corporation CEO Val Nichas said the new Doppio restaurant will open in Harare in November.We visualise it being a small specialty chain. I would say it probably wont go over 50/60, but you know, it depends on how the market evolves. Might expand, you never know. But I dont think it will be big.\n\nSpur is also extending Doppio to new locations like hospitals, hotels, and shopping malls through a new, smaller format Doppio Caffe to attract different customers.We are opening a Doppio Caffe in a lovely new nursery lifestyle centre in Rosebank, Johannesburg. Thats an unusual site. Its not your traditional shopping mall or strip mall.\n\nFollowing the success of small-format Panarottis and Spur outlets in small towns, Nichas said the format would be extended to other brands like Rocco Mamas. Panarottis small-town strategy has contributed to double-digit growth over the past 18 months, and there are plans to add 13 smaller-format/smaller town locations.Were looking at areas where we dont have to build a big store. Its easier to get a smaller footprint into a smaller community and make it a better return on investment for franchisees, and also for space, she said.\n\nRentals are expensive, so if you go into these smaller markets, you cant afford to build a very big store. The most important thing is that it becomes a lovely entry-level investment for new, and young, franchisees. So a lot of new companies might not have R7m to invest in a full restaurant, but maybe theyve got R4m to invest in a smaller footprint format.\n\nSpur restaurants are also opening at non-traditional locations like petrol stations.\n\nIn the year to June, Spur brand increased restaurant sales by 4.8% to R6.4bn, accounting for 64% of total South African sales. Panarottis increased restaurant sales by 13.6% to R1.04bn, and RocoMamas by 5% to R979m, with these brands representing 10% and 9% of local sales, respectively.\n\nSpurs total restaurant sales, including international outlets, were up 8.3% to R11.4bn. Takeaways account for 13% of total local restaurant sales. Of those, orders collected by customers comprise more than 50% of takeaway sales, with the balance delivered by Mr D and Uber Eats.\n\nNichas said takeaways have grown significantly from 7% pre-Covid, but will likely remain a small segment of the group given that its restaurants are casual dining, in which most customers prefer to sit.\n\nSpur Corporation has 724 outlets in 14 countries, including Australia, Zambia, and Mauritius. It exited the Middle East and India but will open 42 new restaurants in South Africa and 14 internationally.\n\nNichas said Spur Corporations brands have not reached saturation levels in South Africa or beyond, adding: Restaurant set-up costs and refinement to business models continue to be key priority areas. Secondary channels are also expected to grow.\n\nWe will focus on expanding our presence on the African continent, where we have seen good traction this year. We are optimistic about the future of Africa as the casual dining restaurant becomes appealing to consumers who want to enjoy a seated meal experience and celebration.\n\nShe said interest rate cuts in South Africa have bolstered consumer spending, providing a favourable climate for restaurants. This optimism resulted in a notable surge in restaurant sales, especially in urban centres like Johannesburg and Cape Town, she said.\n\nThe quick-service restaurant and casual dining segments have been primary beneficiaries, capitalising on consumers demand for convenience and value-seeking to suit their wallets. However, the cost of living and economic constraints continue to affect household spend. Despite reductions in borrowing costs and food inflation, disposable income and discretionary spending have not yet seen significant increases.\n\nThe country still faces challenges, including high unemployment and fiscal constraints. The competitive landscape continues to evolve with a broader range of players vying for market share. Beyond traditional competitors, the group now faces challenges from supermarket retailers product offerings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/26182030/spur.jpg",
            "description": "<p>TimesLive Spur Corporation will open a new Doppio Zero restaurant in Zimbabwe, making it the brand’s second outlet outside South Africa, as the company eyes a total of about 50 restaurants across a number of countries in the coming years. Spur also wants to add more small-format restaurants for its other brands, including Rocco Mamas,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/spur-looks-for-growth-beyond-sa-borders-with-new-restaurant-in-zimbabwe/\">Spur looks for growth beyond SA borders with new restaurant in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "27 Aug 2025"
        },
        {
            "title": "Court halts RioZim’s asset sales amid corporate rescue proceedings",
            "url": "https://www.newzimbabwe.com/court-halts-riozims-asset-sales-amid-corporate-rescue-proceedings/",
            "content": "By Mary Taruvinga\n\nThe High Court of Zimbabwe granted an urgent interdict to the Zimbabwe Diamond & Allied Minerals Workers Union (ZDAMWU), effectively blocking RioZim Limited from disposing of its mining assets while pending corporate rescue proceedings.\n\nThe judgment, delivered by Justice Maxwell Dembure, encapsulated the precarious intersection of corporate governance and worker rights.\n\nThe case arose after RioZim, a publicly listed company, issued a cautionary statement on July 21, 2025, initiating discussions regarding the potential sale of its mining and non-core assets. This announcement followed ZDAMWUs filing of a court application on April 28, seeking to place the company under supervision due to financial distress.\n\nDembure noted, The mere filing of the application for corporate rescue triggers an immediate moratorium on the disposal of a companys assets, emphasising the protective nature of the law intended to shield creditors and employees from the adverse effects of asset stripping.\n\nHe further highlighted that any attempt at asset disposal during this phase could render the corporate rescue application academic, fundamentally undermining the purpose of such proceedings.\n\nIn lambasting RioZims move, the judge said, If the applicants rights are not preserved, the purpose of the ongoing litigation will be defeated, which is against the interests of all affected, including the workers. The court affirmed that allowing the asset disposals would suit a strategy that frustrates and defeats the pending corporate rescue proceedings, further noting that the company must not be allowed to operate as if it were free from legal encumbrances.\n\nZDAMWUs counsel, R. Mabwe, characterised the urgency of the application as essential, asserting that should the court fail to act swiftly, irreparable harm would result, reflecting the unions commitment to safeguarding employee interests linked to the companys asset base.\n\nRioZims response, led by attorney E. Donzvambeva, contended that the company should be allowed to explore transactions to alleviate financial duress without impediment.\n\nHe argued, The proposed disposals are necessary for the companys survival, pointing out that asset sales could provide much-needed liquidity during corporate rescue discussions.\n\nHowever, Dembure countered, highlighting the lack of clarity in RioZims intentions about which specific assets might be sold, noting that such details could impact any ruling on the matter.\n\nThe court granted two key orders: prohibiting any asset sales contemplated in RioZims cautionary statement and mandating the company to bear the costs of the proceedings.\n\nThe balance of convenience strongly lies in favouring the applicants request for an interim interdict to prevent potential asset dissipation until a determination is made on the main application.\n\nAs a result of this significant ruling, RioZims shareholders and stakeholders will need to navigate the complexities of corporate restructuring under the courts oversight, while the future of the companys asset management remains uncertain.\n\nThe outcome of the wider corporate rescue proceedings now looms large, with potential implications for the mining sector and employee security within the industry at stake.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court of Zimbabwe granted an urgent interdict to the Zimbabwe Diamond & Allied Minerals Workers’ Union (ZDAMWU), effectively blocking RioZim Limited from disposing of its mining assets while pending corporate rescue proceedings. The judgment, delivered by Justice Maxwell Dembure, encapsulated the precarious intersection of corporate governance and worker rights. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-halts-riozims-asset-sales-amid-corporate-rescue-proceedings/\">Court halts RioZim’s asset sales amid corporate rescue proceedings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "27 Aug 2025"
        },
        {
            "title": "I have always been a ZANU PF person – prodigal son Tsenengamu seeks readmission into ruling party",
            "url": "https://www.newzimbabwe.com/i-have-always-been-zanu-pf-person-prodigal-son-tsenengamu-seeks-readmission-into-ruling-party/",
            "content": "By Darlington Gatsi\n\nFormer youth leader Godfrey Tsenengamu is retracing his footsteps to ZANU-PF, applying for readmission into the ruling party five years after his expulsion.\n\nTsenengamu was expelled from ZANU-PF in 2020 for his wayward behaviour after he called out senior party leaders involved in corruption.\n\nThe outspoken politician, together with Lewis Matutu, named controversial businessman Kudakwashe Tagwirei as part of a corrupt cartel that was sabotaging the economy at the time.\n\nInterestingly, Tagwirei, who was at the centre of Tsenengamus criticism, has risen within the ZANU PF ranks, securing a seat in the influential Central Committee.\n\nTsenengamu said he never willingly left ZANU PF.\n\nRemember, I have always been a ZANU PF person except for the moments I was expelled from the Party. I have never volunteered to come out of ZANU PF of my own will, and that must tell everyone concerned why I am seeking to go back to ZANU PF.\n\nI have always believed in this party, its ideology and its aims and objectives, Tsenengamu told NewZimbabwe.com.\n\nOutside ZANU-PF, Tsenengamu formed his own party, the Front for Economic Emancipation in Zimbabwe (FEEZ), as he sought to challenge the ruling party.\n\nAhead of the 2023 election, Tsenengamu and his party backed former ZANU-PF Commissar Saviour Kasukuwere, with the latter being subsequently ejected from the presidential race.\n\nThe firebrand politician has never held back in his criticism of ZANU PF officials who have been implicated in corruption.\n\nTsenengamu says his seeking readmission is not a stamp of approval for certain operations within ZANU PF.\n\nBy seeking to rejoin ZANU PF, that does not mean that I agree to everything everyone does within the party, but there is no point in giving up on the organisation you also worked to grow. Differences will always be there even in institutions like families and churches, and ZANU PF is no exception, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/11160418/Tsenengamu-.png",
            "description": "<p>By Darlington Gatsi Former youth leader Godfrey Tsenengamu is retracing his footsteps to ZANU-PF, applying for readmission into the ruling party five years after his expulsion. Tsenengamu was expelled from ZANU-PF in 2020 for his “wayward behaviour” after he called out senior party leaders involved in corruption. The outspoken politician, together with Lewis Matutu, named</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-have-always-been-zanu-pf-person-prodigal-son-tsenengamu-seeks-readmission-into-ruling-party/\">I have always been a ZANU PF person – prodigal son Tsenengamu seeks readmission into ruling party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "27 Aug 2025"
        },
        {
            "title": "ConCourt denies Edgar Lungu’s family leave to appeal ruling on his burial site",
            "url": "https://www.newzimbabwe.com/concourt-denies-edgar-lungus-family-leave-to-appeal-ruling-on-his-burial-site/",
            "content": "EWN\n\nJOHANNESBURG  The Constitutional Court has denied the family of former Zambian president Edgar Lungu leave to appeal in the battle to determine where his remains should be buried.\n\nThe family approached the apex court after the high court ruled in the Zambian governments favour, ordering that Lungus remains be repatriated to Lusaka.\n\nThe family is adamant on having him laid to rest in South Africa to avoid the involvement of the current president, Hakainde Hichilema, in the funeral.\n\nLungu died in June while receiving medical attention in Johannesburg.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25163954/lungu-burial.webp",
            "description": "<p>EWN JOHANNESBURG – The Constitutional Court has denied the family of former Zambian president Edgar Lungu leave to appeal in the battle to determine where his remains should be buried. The family approached the apex court after the high court ruled in the Zambian government’s favour, ordering that Lungu’s remains be repatriated to Lusaka. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/concourt-denies-edgar-lungus-family-leave-to-appeal-ruling-on-his-burial-site/\">ConCourt denies Edgar Lungu’s family leave to appeal ruling on his burial site</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "27 Aug 2025"
        },
        {
            "title": "Botswana declares public health emergency over medicine shortage",
            "url": "https://www.newzimbabwe.com/botswana-declares-public-health-emergency-over-medicine-shortage/",
            "content": "Botswana has declared a public health emergency, with President Duma Boko saying the national medical supply chain collapsed due to depleted government coffers and steep cuts in aid from the United States.\n\nThe announcement came on Monday after the Ministry of Health and Wellness warned earlier this month that the system was severely strained with $75m owed to private health facilities and suppliers.\n\nIt cited shortages of medicines for a range of illnesses, including hypertension, cancer, diabetes, tuberculosis, asthma, mental and sexual health, and stated that elective surgeries were postponed.\n\nThe Health Ministry also said there were shortages of dressings and sutures.\n\nThe medical supply chain, as run by central medical stores, has failed, President Boko said in a televised address on Monday. This failure has led to a severe disruption to health supplies countrywide.\n\nThe Ministry of Finance had earlier approved 250 million pula ($18.7m) in emergency funding for procurement, said Boko, adding that the military would oversee the distribution of emergency medicines, with the first shipments dispatching immediately from the capital, Gaborone, with priority given to deprived rural areas.\n\nThe current prices [for medicine] often are inflated five to 10 times. Under the current economic conditions, this scenario is not sustainable, Boko added.\n\nThe crisis is also linked to a shrinking national budget caused by the ongoing downturn in the global diamond market.\n\nBotswana, with a population of 2.5 million, is one of the worlds largest diamond producers. Its vast diamond reserves, discovered just after independence from Britain in 1966, make up about 80 percent of the countrys foreign earnings.\n\nBut sales have weakened in recent years, pushing a cash-strapped government to suspend certain ministerial purchases last month.\n\nSweeping cuts in aid from the US under President Donald Trump have further strained the economy. Before the cuts, the US funded a third of BotswanasHIV response, according to UNAIDS, and provided $12m through The Global Fund to fight malaria and tuberculosis.\n\nThe United Nations agency for children (UNICEF) said urgent action was needed to address the deepening medical crisis in the country, adding that one in five children was underweight in a western district near the Namibian border.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/03054357/Duma-Boko-announced-Botswana-6th-president-1536x1024-1.jpeg",
            "description": "<p>Botswana has declared a public health emergency, with President Duma Boko saying the national medical supply chain collapsed due to depleted government coffers and steep cuts in aid from the United States. The announcement came on Monday after the Ministry of Health and Wellness warned earlier this month that the system was “severely strained” with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/botswana-declares-public-health-emergency-over-medicine-shortage/\">Botswana declares public health emergency over medicine shortage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "27 Aug 2025"
        }
    ]
}