{
    "news": [
        {
            "title": "Jimmy Kimmel show to return after suspension over Charlie Kirk comments",
            "url": "https://www.newzimbabwe.com/jimmy-kimmel-show-to-return-after-suspension-over-charlie-kirk-comments/",
            "content": "BBC\n\nUS comedian Jimmy Kimmel will return to his late-night talk show on Tuesday after he was suspended for making jokes relating to the death of conservative influencer Charlie Kirk.\n\nDisney, which owns the US broadcast network that airs Jimmy Kimmel Live, said on Monday that it suspended the show because it felt some of the comments were ill-timed and thus insensitive.\n\nWe have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday, Disney said.\n\nThe comics abrupt suspension came after threats by the federal tv regulator to revoke ABCs broadcast licence, sparking nationwide debates over free speech.\n\nUS President Donald Trump had welcomed Kimmels suspension and suggested that some TV networks should havetheir licences taken awayfor negative coverage of the president.\n\nTrump did not address Kimmels reinstatement when a reporter asked about it during a White House event on Monday.\n\nSinclair, the largest ABC affiliate group in the US, said on Monday it will replace Jimmy Kimmel Live! with news programming across its ABC affiliate stations from Tuesday.\n\nDiscussions with ABC are ongoing as we evaluate the shows potential return, it added.\n\nSinclair previously called Kimmels remarks inappropriate and deeply insensitive at a critical moment for our country and said it would not lift the suspension before having formal discussions with ABC.\n\nNexstar Media, one of the biggest owners of TV stations in the US, also said last week it would not air Kimmels show for the foreseeable future. It has not yet commented on Kimmels reinstatement.\n\nCritics and First Amendment advocates railed against ABCs decision last week as censorship and a violation of free speech.\n\nKimmel, who has hosted the late-night programme since 2003 and hosted four Oscars ceremonies, has not yet publicly addressed the suspension or the fallout.\n\nThe row started after Kimmel said in his monologue on 15 September that the Maga gang were desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and trying to score political points from it.\n\nHe also made fun of Trumps reaction to the influencers murder, showing a clip of the president responding to a question about how he was mourning the death by changing the subject to construction of a new White House ballroom.\n\nKimmel compared the response to how a four-year-old mourns a goldfish.\n\nBrendan Carr, the Trump-appointed chair of broadcast regulator theFederal Communications Commission (FCC), threatened to act against ABC and its parent company Disney over Kimmels remarks.\n\nThe spat comes as Vice President JD Vance and other White House allies have been pushing a national campaign to punish anyone who has criticised Kirk in the wake of his death.\n\nHours after Mr Carr made his initial remarks about Kimmels monologue, Nexstar said it would not air Kimmels show for the foreseeable future.\n\nSinclair followed suit and ABC announced that it would indefinitely suspend the programme and demanded an apology from Kimmel, as well as a donation to Kirks non-profit organization Turning Point USA.\n\nMr Carr thanked Nexstar for doing the right thing and said he hoped other broadcasters would follow its lead. Nexstar is currently seeking FCC approval for its planned $6.2bn (4.5bn) merger with Tegna.\n\nAnna Gomez, the sole Democrat on the FCC, said on Monday that she was glad to see Disney find its courage in the face of clear government intimidation.\n\nMs Gomez also thanked Americans across the ideological spectrum who protested this blatant attempt to silence free speech and vowed to combat these efforts to stifle free expression.\n\nABCs decisionto suspend Kimmelwas met with protests in California and lambasted by the writers and actors guilds, lawmakers and the American Civil Liberties Union (ACLU) alike, who argued that the suspension violates free speech rights and spurs a chilling effect.\n\nKimmels late-night colleagues, including Jon Stewart, John Oliver and outgoing CBS host Stephen Colbert, rallied behind him and hundreds of celebrities and Hollywood creativessigned on to a letterbacking Kimmel.\n\nBen Stiller, Jennifer Aniston, Meryl Streep and Robert DeNiro are among those who called Kimmels suspension a dark moment for freedom of speech in our nation.\n\nCritics have also called for the cancellation of Disney+, Hulu and other Disney-owned subscription services to cut into the entertainment conglomerates bottom line over it decision to suspend Kimmel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/23065414/kimmel.webp",
            "description": "<p>BBC US comedian Jimmy Kimmel will return to his late-night talk show on Tuesday after he was suspended for making jokes relating to the death of conservative influencer Charlie Kirk. Disney, which owns the US broadcast network that airs Jimmy Kimmel Live, said on Monday that it suspended the show because it “felt some of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jimmy-kimmel-show-to-return-after-suspension-over-charlie-kirk-comments/\">Jimmy Kimmel show to return after suspension over Charlie Kirk comments</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "23 Sep 2025"
        },
        {
            "title": "High Court rules in favour of Chinese-owned Chengbao Mining in bitter Mberengwa mine dispute",
            "url": "https://www.newzimbabwe.com/high-court-rules-in-favour-of-chinese-owned-chengbao-mining-in-bitter-mberengwa-mine-dispute/",
            "content": "By Mary Taruvinga\n\nThe Bulawayo High Court has handed a decisive victory to Chinese-owned Chengbao Mining (Pvt) Ltd, declaring its tribute agreement over C-Mine in Mberengwa valid and binding, while ordering rival parties to vacate the disputed site and account for minerals already extracted.\n\nIn a recent judgment, Justice Bongani Ndlovu ruled that Chengbaos October 2024 agreement with Anesu Gold (Pvt) Ltd remained in force, despite claims by Anesu Gold and miner Allen Sibanda that the deal had been cancelled.\n\nIt is declared that the Tribute Agreement  is still valid and effective, and binding on the 1st Respondent and the Applicant, Justice Ndlovu said, stressing that the contract could not be unilaterally cancelled outside its agreed procedures.\n\nThe dispute erupted in November 2024 when Anesu Gold, which had already signed a tribute agreement with Chengbao Mining, went on to enter a separate arrangement with Sibanda, giving him control of the same mining claims. Chengbao accused Anesu Gold of double-dealing, while Sibanda claimed the first deal had been cancelled.\n\nThe wrangle quickly escalated on the ground, with both parties moving equipment and workers onto the site. Chengbao maintained that it had invested heavily in infrastructure and environmental certification under the original contract, while Anesu Gold and Sibanda insisted the agreement was no longer binding.\n\nThe court found that Anesu Gold had improperly attempted to replace Chengbao with Sibanda under a rival tribute arrangement, despite the existing deal.\n\nI find no basis to accept the 1st respondents version that the 2nd agreement was entered into only for the purpose of obtaining an EIA certificate. This court will not rewrite the agreement for the parties, but will give effect to it, adhering to the cardinal rule of pacta sunt servanda, ruled Justice Ndlovu.\n\nAs part of the order, Sibanda and all those claiming through him must remove their mining equipment from C-Mine, failing which the Sheriff and police will forcibly evict them. The court also directed both Sibanda and Anesu Gold to account for all minerals extracted since November 2024, with a chartered accountant appointed to audit the proceeds.\n\nWhat the applicant would have managed to gain from the mining activities  ought to be accounted for and returned, the judge ordered.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The  Bulawayo High Court has handed a decisive victory to Chinese-owned Chengbao Mining (Pvt) Ltd, declaring its tribute agreement over C-Mine in Mberengwa valid and binding, while ordering rival parties to vacate the disputed site and account for minerals already extracted. In a recent judgment, Justice Bongani  Ndlovu ruled that Chengbao’s October</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-rules-in-favour-of-chinese-owned-chengbao-mining-in-bitter-mberengwa-mine-dispute/\">High Court rules in favour of Chinese-owned Chengbao Mining in bitter Mberengwa mine dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "23 Sep 2025"
        },
        {
            "title": "Grieving mother wins case against police following child’s death in traffic chaos, police to pay US$42,000 in damages",
            "url": "https://www.newzimbabwe.com/grieving-mother-wins-case-against-police-following-childs-death-in-traffic-chaos-police-to-pay-us42000-in-damages/",
            "content": "By Mary Taruvinga\n\nThe High Court of Zimbabwe has ruled in favour of a grieving mother, Patricia Dengezi whose one-year-old son was tragically killed during a chaotic traffic incident between pirate taxi operators and the police.\n\nHigh Court judge Regis Dembure awarded Dengezi US$42,000 in damages, ruling that the polices conduct created a chaotic environment that directly contributed to the fatal accident.\n\nDengezi was represented by Tendai Biti of Biti Law Chambers.\n\nThe violent, indiscriminate smashing of commuter omnibuses and the use of spikes in crowded streets during peak hours can never be justified.\n\nSuch cases are inimical to modern-day policing standards, Dembure ruled.\n\nCited as defendants were the Commissioner General of Police, Stephen Mutamba and the Minister of Home Affairs Kazembe Kazembe, as well as the driver who fatally crushed her son, Munyaradzi Nyamaruru.\n\nThe judge said their officers displayed reckless and gross negligence that directly led to the death of Lesley Chitanda, the plaintiffs son.\n\nThe incident occurred on April 17, 2017, in Harare.\n\nDengezi, a vendor, was sitting on a pavement feeding her child when a commuter omnibus, driven by Nyamaruru, veered off the road to avoid a collision with other buses fleeing from police officers who had thrown spike strips.\n\nThe result was catastrophic.\n\nWhile Dengezi sustained serious injuries, her young child was killed on the spot.\n\nDescribing the scene, Dengezi recounted, If the police had not thrown spikes, Lesley would have been alive.\n\nHer testimony was corroborated by witnesses, including Sibongile Mazividza, who confirmed that the polices aggressive tactics had sparked widespread chaos on the street during peak hours, endangering civilians.\n\nThe ongoing dispute over liability was significantly impacted by a stay ordered by the court in 2022 for a constitutional review of the Police Acts stipulation that civil claims against the police must be filed within eight months.\n\nHowever, in November 2023, the Constitutional Court dismissed the stay, citing procedural deficiencies in the arguments presented.\n\nThroughout the trial, significant criticisms were levied against the investigative processes of the police as both Sergeant Solomon Kanyoka and Constable James Thomas failed to produce crucial evidence, including accident assessment reports and witness statements, due to a claimed destruction of police dockets.\n\nJustice Dembure said that the destruction of every police evidence available, including the docket with witnesses statements, can reasonably be taken to be a cover-up for the clear criminal actions of the three police officers.\n\nWhile Dembure expressed sympathy for the plaintiff, acknowledging that the loss of her only son can never be compensated for by any amount of money, he also affirmed that a settlement of $42,000 had been reached to cover damages, which the court endorsed, holding both the police and driver accountable for the tragic events that unfolded.\n\nThis judge reminded the police of the importance of responsible policing, especially in urban environments where innocent lives can be significantly impacted by reckless actions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/22180446/Stephen-Mutamba.jpg",
            "description": "<p>By Mary Taruvinga The High Court of Zimbabwe has ruled in favour of a grieving mother, Patricia Dengezi whose one-year-old son was tragically killed during a chaotic traffic incident between pirate taxi operators and the police. High Court judge Regis Dembure awarded Dengezi US$42,000 in damages, ruling that the police’s conduct created a chaotic environment</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/grieving-mother-wins-case-against-police-following-childs-death-in-traffic-chaos-police-to-pay-us42000-in-damages/\">Grieving mother wins case against police following child’s death in traffic chaos, police to pay US$42,000 in damages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "23 Sep 2025"
        },
        {
            "title": "EFF files murder case against Operation Dudula, SAPS in Gauteng investigating",
            "url": "https://www.newzimbabwe.com/eff-files-murder-case-against-operation-dudula-saps-in-gauteng-investigating/",
            "content": "IOL\n\nThe Economic Freedom Fighters (EFF) in Gauteng has opened a criminal case against the Operation Dudula movement, accusing the militant group of inciting violence and unlawfully targeting foreign nationals in South Africa.\n\nOn Sunday, Gauteng police spokesperson Lieutenant Colonel Mavela Masondo confirmed to IOL that investigations are underway.\n\nPolice have opened an inquiry docket for investigation. Once the investigation is complete, the docket will be taken to the National Prosecution Authority (NPA) for a decision, said Masondo.\n\nOn Saturday, EFF Gauteng chairperson Nkululeko Dunga led supporters to the Alexandra Police Station, where the case was opened against Operation Dudula. According to the Julius Malema-led party, the case relates to the death of a one-year-old baby who was allegedly denied access to healthcare at a public health facility.\n\nReports indicate that the childs mother, Malawian national Grace Banda, said she and her baby were turned away from the Alexandra Community Health Centre in July. She alleged that members of Operation Dudula blocked her from entering, insisting she could only access the premises after producing a South African identity document. The sick child later died.\n\nDunga told journalists that the childs death amounted to murder. If someone gets sick, and someone dies, and if they could be assisted there and there, it is not only negligence, they knew exactly what they were doing, and they eliminated a life of a one-year-old.\n\nSo, we have opened a case of murder. It is up to the State to pick up and do the necessary investigations. In our minds, someone has passed on and that is a murder case.\n\nEFF Gauteng chairperson Nkululeko Dunga led supporters to the Alexandra Police Station, where the case was opened against Operation Dudula. According to the Julius Malema-led party, the case relates to the death of a one-year-old baby who was allegedly denied access to healthcare at a public health facility. Image: EFF Gauteng/X\n\nThe traumatised childs mother, according to Dunga, is now living in fear. The EFF further claims that several South Africans have also been denied access to healthcare facilities in Gauteng after being presumed to be foreign nationals.\n\nOperation Dudula has frequently clashed with political parties, human rights groups, and foreign governments over its campaigns to remove undocumented migrants from communities, workplaces, and public services. Leaders of the movement argue they are not against all foreign nationals, but specifically undocumented migrants.\n\nZandile Dabula, leader of Operation Dudula Image: Itumeleng English\n\nEarlier this month,IOL reported that Operation Dudula and Zimbabwes ruling party Zanu PF clashed in a war of words after the latter condemned Dudulasstance on foreign nationals accessing healthcare in South Africa.\n\nOperation Dudula leader Zandile Dabula told IOL that South Africa would not be dictated to by outsiders and dismissed Zanu PFs criticism. We will not be dictated to by foreigners on how to run our country. We have the Constitution that is supposed to be guiding us, we have immigration laws that we use as guiding documents, said Dabula.\n\nHer comments were in response to Zanu PFs director of information, Farai Marapira, who told IOL that Operation Dudulas campaign against undocumented migrants was a betrayal of Ubuntu and a continuation of colonial-era tactics of dividing Africans.\n\nNational spokesperson of Zimbabwes ruling party, Zanu PF, Christopher Mutsvangwa (left) with Zanu PF director of information Farai Marapira in Harare. Image: File\n\nBut Dabula fired back, calling his remarks baseless. For Farai (Marapira) to talk about these unfounded allegations, that we are funded by former colonisers, that is definitely not true. How are we going to be funded by the very same people who we are working against? she said.\n\nThey should focus on fixing their country, Zimbabwe. It is the very same former colonisers they chased away in their country, hence they are in problems. They are sitting with land, and they are doing nothing about it. That is why the very same Zimbabweans are fleeing to South Africa, to take up our spaces, not just in South Africa but they are all over the world seeking better life.\n\nDabula further insisted that Zimbabweans were in South Africa in far greater numbers than official estimates suggested, accusing them of placing pressure on jobs, schools, and public services. He also spoke about us having one million Zimbabweans in this country. Thats a lie. There is way more than that. There are millions of Zimbabweans in this country. We are on the ground. We see them, we know where they work, their own businesses, they are in our schools, she said.\n\nMembers of Operation Dudula movement Image: Leon Lestrade\n\nOn the issue of healthcare, Dabula clarified that Operation Dudula was not calling for a blanket denial of treatment to all migrants, but for foreign nationals to pay for the services they use. We are not saying they shouldnt get medical treatment, we are saying they should go to public facilities and pay for it, or rather go to private facilities because these people are working  that is what they always claim, Dabula told IOL.\n\nMarapira had argued earlier that healthcare was a universal human right. Dabula, however, turned her fire on Zanu PFs governance in Zimbabwe and its close ties with the ANC, warning that South Africa risked going down the same path. Zanu-PF is a problem to the people of Zimbabwe. They have been voted out, but they are still continuing to bully people. Their relationship with the ANC is very problematic to us as South Africans because we can see that we are heading to the state where Zimbabwe is at currently, Dabula said.\n\nOperation Dudula, she stressed, is committed to prioritising South Africans, ensuring that foreigners comply with immigration laws and contribute to the services they use.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/22174412/eff-police.webp",
            "description": "<p>IOL The Economic Freedom Fighters (EFF) in Gauteng has opened a criminal case against the Operation Dudula movement, accusing the militant group of inciting violence and unlawfully targeting foreign nationals in South Africa. On Sunday, Gauteng police spokesperson Lieutenant Colonel Mavela Masondo confirmed to IOL that investigations are underway. “Police have opened an inquiry docket</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eff-files-murder-case-against-operation-dudula-saps-in-gauteng-investigating/\">EFF files murder case against Operation Dudula, SAPS in Gauteng investigating</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "23 Sep 2025"
        },
        {
            "title": "Zimbabwe’s plan to host Bafana Bafana clash in Botswana backfires; SA venue back in the frame",
            "url": "https://www.newzimbabwe.com/zimbabwes-plan-to-host-bafana-bafana-clash-in-botswana-backfires-sa-venue-back-in-the-frame/",
            "content": "IOL\n\nZimbabwes plans to stage their 2026 Fifa World Cup qualifier against South Africa in Francistown have been scuppered by the Botswana Football Association (BFA), which confirmed that the Francistown Sports Complex is unavailable.\n\nThe venue will host Botswanas own qualifier against Uganda on 9 October, just a day before the scheduled meeting between the Warriors and Bafana Bafana. That clash of dates contravenes FIFA regulations, which require that visiting teams be given access to match venues the day before a fixture.\n\nThe impasse now points to Zimbabwe relocating their home game to South Africa, with two familiar options in the frame: Orlando Stadium in Johannesburg and Moses Mabhida Stadium in Durban. Both arenas have served as temporary home grounds in previous years when Zimbabwean facilities failed to meet international standards.\n\nReports at the weekend suggested Moses Mabhida was the favoured choice, though no confirmation has come from the South African Football Association, as the final decision rests with the Zimbabwe Football Association (Zifa).\n\nIn the meantime, Zifa has bristled at the BFAs handling of the matter, condemning its public announcement as premature. Spokesperson Mike Madoda said: It is Zifas prerogative to pick a venue that suits our interests. Zimbabwe will always make decisions that are in the interests of the Warriors and Zimbabwean football.\n\nMadoda also rejected speculation that Zifa had been swayed by financial inducements to stage the match in South Africa, dismissing such claims as baseless. He underlined that venue selection remains an internal process, carried out with independence and integrity.\n\nThe dispute underscores the undercurrents of regional rivalry in Southern African football, where off-field logistics often intertwine with long-standing national competition.\n\nFor Zimbabwe, the bigger picture is already clear: their World Cup campaign is over after a torrid run produced only four points from eight matches, leaving them bottom of Group C without a win. The Warriors struggles mark a sobering end to their qualification hopes.\n\nBy contrast, Bafana Bafana are riding high. Coach Hugo Broos has moulded a side that sits atop the group with 17 points, galvanised by cohesion, tactical discipline and growing belief. South Africa are now on the brink of confirming their place at the 2026 finals in the United States, Canada and Mexico.\n\nStill, the fixture between neighbours carries significance beyond mathematics. Zimbabwes captain Knowledge Musona has promised his side will fight for pride: We may not have lived up to our hopes in the tournament, but we want to ensure we leave everything on the pitch against South Africa.\n\nThe clash, whenever and wherever it is finally staged, will serve as both a test of Bafana Bafanas momentum and a chance for Zimbabwe to reassert their footballing pride, ensuring the rivalry burns as fiercely as ever.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10172257/WhatsApp-Image-2024-10-10-at-18.22.36.jpeg",
            "description": "<p>IOL Zimbabwe’s plans to stage their 2026 Fifa World Cup qualifier against South Africa in Francistown have been scuppered by the Botswana Football Association (BFA), which confirmed that the Francistown Sports Complex is unavailable. The venue will host Botswana’s own qualifier against Uganda on 9 October, just a day before the scheduled meeting between the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-plan-to-host-bafana-bafana-clash-in-botswana-backfires-sa-venue-back-in-the-frame/\">Zimbabwe’s plan to host Bafana Bafana clash in Botswana backfires; SA venue back in the frame</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "23 Sep 2025"
        },
        {
            "title": "PPC reports significant financial growth, with EBITDA up over 20%",
            "url": "https://www.newzimbabwe.com/ppc-reports-significant-financial-growth-with-ebitda-up-over-20/",
            "content": "IOL\n\nPPCs share price surged 3.6% on Monday morning to R5.16 after it reported a marked improvement in its financial performance for the four months to July 31, 2025.\n\nThe JSE-listed cement and aggregates maker for markets in South Africa, Botswana, and Zimbabwe said in an update for the four months that their two-year-old Awaken the Giant turnaround strategy was gaining traction. This had resulted in further growth and margin expansion, on top of the improvement across key metrics achieved in the 2025 financial year.\n\nTheir strategy, being implemented in a weak macro-economic environment in South Africa, focuses on increasing long-term leadership and competitiveness, through enhanced profitability and cash flow.\n\nIn the four-months, group earnings before interest, tax, depreciation, and amortisation (EBITDA) increased by more than 20% over the comparable period a year before, and the EBITDA margin grew by over 2 percentage points, PPCs directors stated.\n\nSales volumes in South Africa and Botswana increased by 2% due to stronger retail sales and sales of clinker to PPC Zimbabwe.\n\nThe four-month EBITDA for South Africa and Botswana cement continued to see notable improvement, with the EBITDA margin significantly increasing from 10.3% to 17.7%.\n\nThe timing of certain plant shutdowns contributed positively. As this normalises in the six months ending September 30, 2025, the South Africa and Botswana cement margin is expected to remain at around 17%, PPCs directors said.\n\nIn Zimbabwe, cement sales volumes increased by 22%, largely due to strong consumer demand and the positive impact of a 30% tariff on imported cement introduced in May 2025.\n\nIn the first two months of the current period, PPC Zimbabwe implemented an extended shutdown at its Colleen Bawn plant. This was planned as part of a three-year plant performance improvement plan to better position PPC Zimbabwe to produce higher own-clinker volumes for the production of cement, thereby supplying the growing demand in the market.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/07095716/PPC-Zimbabwe.png",
            "description": "<p>IOL PPC’s share price surged 3.6% on Monday morning to R5.16 after it reported a “marked improvement” in its financial performance for the four months to July 31, 2025. The JSE-listed cement and aggregates maker for markets in South Africa, Botswana, and Zimbabwe said in an update for the four months that their two-year-old “Awaken</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ppc-reports-significant-financial-growth-with-ebitda-up-over-20/\">PPC reports significant financial growth, with EBITDA up over 20%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "23 Sep 2025"
        }
    ]
}