{
    "news": [
        {
            "title": "IMF lauds Zimbabwe’s economic progress, but says arrears block lending",
            "url": "https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Reuters The International Monetary Fund said on Thursday it remains unable to lend to Zimbabwe due to the country’s outstanding arrears, but praised recent economic reforms as discussions progress on a potential staff-monitored program. “Zimbabwe’s ability to borrow financially from us is constrained by the fact that they have arrears through the African Development Bank,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/\">IMF lauds Zimbabwe’s economic progress, but says arrears block lending</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Zanu PF risks implosion if factional tensions are mismanaged – analyst warns",
            "url": "https://www.newzimbabwe.com/zanu-pf-risks-implosion-if-factional-tensions-are-mismanaged-analyst-warns/",
            "content": "By Anna Chibamu\n\nThe Zanu PF political landscape is increasingly volatile, and if current tensions are not carefully managed, the party could face an implosion that threatens its key structures and processes, a political analyst has warned.\n\nIn an interview withNewZimbabwe.com, political analyst Eldred Masunungure said the outcome of the ruling partys ongoing succession battle will hinge on who holds the strategic cards within the power structure.\n\nMasunungure cautioned that delegates attending the ongoing Zanu PF National Peoples Conference in Mutare must address internal divisions decisively to prevent a full-blown crisis.\n\nThe long and short of it is that the Zanu PF pot is overboiling and if not managed well, it may very well explode.\n\nIt is therefore incumbent upon the National Peoples Conference managers to sharpen their conflict resolution skills to abate a dangerous fallout, Masunungure said.\n\nThe conference, currently underway in Mutare is expected to deliberate on key issues including the ailing economy, corruption, and the 2030 agenda. However, the gathering has been overshadowed by factional wars between camps aligned to President Emmerson Mnangagwa and his deputy Constantino Chiwenga.\n\nDuring a Politburo meeting on Tuesday, Chiwenga reportedly questioned why Mnangagwa had not taken action against individuals named in a corruption dossier he presented earlier. Those implicated include controversial businessmen Wicknell Chivayo, Kudakwashe Tagwirei, and gold dealer Pedzai Sakupwanya, who are accused of stealing millions from state coffers.\n\nThe dossier has triggered a fierce backlash from Mnangagwas loyalists, including Zanu PF Secretary for Legal Affairs Ziyambi Ziyambi and party spokesperson Christopher Mutsvangwa, both of whom have publicly attacked the Vice President.\n\nIn response to the dossier, Ziyambi described Chiwenga as ignorant and accused him of treason, while Mutsvangwa slammed the VP for turning the presidium into a kangaroo court.\n\nCommenting on the power struggle, Masunungure said the decisive factor will be which camp is able to outmanoeuvre the other.\n\nThe critical factor depends on who is capable of outmanoeuvring the other or, to use Donald Trumps language, who has the cards?.\n\nFrom the vantage point of an outsider looking in, it appears like the incumbent Mnangagwa has most of the strategic cards courtesy of the power of incumbency, both in the party and the state.\n\nChiwengas military base has been significantly eroded and cannot be relied on to mount another military-assisted transition. The balance of evidence suggests that Mnangagwa will emerge the winner, on account of the manipulation of incumbency.\n\nRecent changes within Zanu PF have further fuelled speculation of a deliberate purge of Chiwengas allies.\n\nMnangagwa recently removed Obert Mpofu from the influential Secretary General post, reassigning him to the ICT department, and replaced him with Jacob Mudenda.\n\nWithin days, he also dismissed Zanu PF Director General Ezekiel Zabanyana, a move widely seen as an effort to weaken Chiwengas internal support base.\n\nMasunungure warned that the escalating factionalism could spill beyond the party, affecting national governance.\n\nThe fallout will most probably infect the state, its key organs and processes. More broadly, it will further deepen and widen the already worrying societal polarisation.\n\nZanu PF is expected to hold its elective congress in 2027, where the partys succession question may be resolved. Some of the resolutions from the Mutare conference are expected to be implemented in the lead-up to that crucial event.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Anna Chibamu The Zanu PF political landscape is increasingly volatile, and if current tensions are not carefully managed, the party could face an implosion that threatens its key structures and processes, a political analyst has warned. In an interview with NewZimbabwe.com, political analyst Eldred Masunungure said the outcome of the ruling party’s ongoing succession</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-risks-implosion-if-factional-tensions-are-mismanaged-analyst-warns/\">Zanu PF risks implosion if factional tensions are mismanaged – analyst warns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Munetsi raises alarm over fake agents preying on African footballers",
            "url": "https://www.newzimbabwe.com/munetsi-raises-alarm-over-fake-agents-preying-on-african-footballers/",
            "content": "By Sports Reporter\n\nWarriors vice captain Marshall Munetsi has expressed deep concern over the growing number of African footballers falling victim to fake agents, warning that the scam is robbing many young players of their dreams and hard-earned money.\n\nThe Wolverhampton Wanderers midfielder said the trend is on the rise, with con artists exploiting the ambitions of players seeking opportunities in Europe.\n\nMunetsi, a member of the FIFPro Global Player Council, said he has long been advocating for awareness on the issue, describing it as a crisis that requires urgent attention.\n\nIts more than a crisis in Africa, a person might create a social media account, come to Europe, watch a game take a picture [with a player], then put that picture on their profile and write theyre a football agent.\n\nA lot of people then end up paying money to that agent with promises of going to Europe, he said.\n\nThe midfielder revealed that he has personally encountered victims of these scams during his time in France, including established players who were deceived by fake agents.\n\nI had three guys who came to France when I was at Reims asking for accommodation because an agent had promised them some trials in Europe, and then they were just stuck at the airport when they got there and nobody was there.\n\nI am talking about guys who are playing for top teams in Africa that were also scammed. Its a big problem that needs to get real attention, said Munetsi.\n\nWhile there are no official statistics on the number of players defrauded by bogus agents, FIFPro has intensified awareness campaigns across Africa to help players identify legitimate representation and avoid exploitation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070129/munetsi-debut.webp",
            "description": "<p>By Sports Reporter Warriors vice captain Marshall Munetsi has expressed deep concern over the growing number of African footballers falling victim to fake agents, warning that the scam is robbing many young players of their dreams and hard-earned money. The Wolverhampton Wanderers midfielder said the trend is on the rise, with con artists exploiting the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/munetsi-raises-alarm-over-fake-agents-preying-on-african-footballers/\">Munetsi raises alarm over fake agents preying on African footballers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "South Africa’s defence committees decry ‘non-existent’ Beitbridge border post security",
            "url": "https://www.newzimbabwe.com/south-africas-defence-committees-decry-non-existent-beitbridge-border-post-security/",
            "content": "IOL\n\nIn a stark assessment, the South African Joint Standing Committee on Defence (JSCOD) and the Portfolio Committee on Defence and Military Veterans (PCDMV) have expressed grave concern over border security, warning that the countrys frontiers are operating with minimal control and are vulnerable to illegal crossings.\n\nThis follows a recent oversight visit to Limpopo, where MPs inspected the Beitbridge border post and other high-risk areas to evaluate existing security measures.\n\nMalusi Gigaba, chairperson of the JSCOD, criticised government inaction on long-standing concerns.\n\nThe SANDF is severely underfunded. We should have 22 companies patrolling our borders, but currently there are only 15. Even these face critical shortages of personnel, vehicles and modern surveillance tools like drones, he said.\n\nThis admission paints a bleak picture of a defence force stretched thin across vast and often inhospitable border terrain.\n\nThe SANDF highlighted further challenges, citing insufficient manpower to monitor the borders shared with Zimbabwe, Botswana and Mozambique. Soldiers are required to patrol hundreds of kilometres with limited resources, and the presence of informal settlements near the Limpopo River has complicated matters, with some residents allegedly assisting illegal crossings.\n\nDakota Legoete, chair of the PCDMV, was equally candid.\n\nIf we are being honest, we dont have functioning borders  and that puts the safety of our country at risk, he said. His comments were echoed by Mr Phiroane Phala, co-chair of the JSCOD, who emphasised the need to balance diplomatic relations with neighbouring countries and the imperative of national security. We cannot allow people to enter and leave the country without control, he said.\n\nCommittee members witnessed the dilapidated state of border fences and identified several areas where illegal crossings are rampant. Soldiers stationed in these zones shared their frustrations over the lack of numbers and support, saying they are unable to effectively monitor the largely unregulated movement of people.\n\nIn response, the committees have pledged to strengthen their oversight efforts.\n\nThey are advocating for increased funding, improved coordination between departments and modernised border infrastructure. They also plan to engage key stakeholders  including the Border Management Authority, the SANDF, the SAPS and SARS  to develop a more unified response to the crisis, with particular focus on the Beitbridge border post.\n\nThe visit comes at a pivotal moment in South Africas border control strategy, underlining the urgency of interdepartmental cooperation and renewed investment in national security infrastructure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/11030946/Border-jumper.jpg",
            "description": "<p>IOL In a stark assessment, the South African Joint Standing Committee on Defence (JSCOD) and the Portfolio Committee on Defence and Military Veterans (PCDMV) have expressed grave concern over border security, warning that the country’s frontiers are operating with minimal control and are vulnerable to illegal crossings. This follows a recent oversight visit to Limpopo,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-defence-committees-decry-non-existent-beitbridge-border-post-security/\">South Africa’s defence committees decry ‘non-existent’ Beitbridge border post security</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Police warns against participation in Geza’s October 17 protests",
            "url": "https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/",
            "content": "By Thandiwe Garusa\n\nTHEZimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatheringson Fridaywill be met with the full wrath of the law.\n\nThis follows war veteran and ex-Zanu PF committee member Blessed Gezas call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.\n\nIn a statement Thursday, policespokespersonCommissionerPaul Nyathisaid comprehensive security measures havebeen put in place nationwideto ensure peace and stability.\n\nThe Zimbabwe Republic Police assures all Zimbabweans and visitors that comprehensive security measures have been put in place to ensure peace, law and order prevails before, during and after October 17.\n\nThe public is urged not to be misled or intimidated by rumours, misinformation, or threats circulating on social media platforms.\n\nActs of violence, threats, vandalism, or incitement to commit crime will be severely dealt with in line with the countrys laws\n\nAny attempts to engage in unlawful demonstrations, gatherings, or processions will be met with the full wrath of the law, Nyathi said.\n\nHe further urged the public to go about their daily activities without fear, adding that all essential services, including schools, businesses, public transport, and government offices will continue to operate as normal.\n\nMembers of the public are implored to go about their daily activitieswithoutfear.All essential services, including schools, businesses, public transport and government institutions,willcontinue to operate as usual, headded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/19204352/Paul-Nyathi-3.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatherings on Friday will be met with “the full wrath of the law”. This follows war veteran and ex-Zanu PF committee member Blessed Geza’s call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/\">Police warns against participation in Geza’s October 17 protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Panicky Mnangagwa announces US$150 ‘Special Presidential Bonus’ for civil servants ahead of planned anti-govt protests",
            "url": "https://www.newzimbabwe.com/panicky-mnangagwa-announces-us150-special-presidential-bonus-for-civil-servants-ahead-of-planned-anti-govt-protests/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwas administration has announced a US$150 Special Presidential Bonus for civil servants, a move widely viewed as an attempt to ease growing frustration and avert planned anti-government protests called by war veteran and former Zanu PF committee member Blessed Geza.\n\nThe announcement, made a day before the scheduled October 17 demonstrations, has fueled speculation that the government is seeking to appease the civil serviceand maintain calm amid rising economic discontent.\n\nIn a statement issued Thursday, Public Service, Labour and Social Welfare Minister Edgar Moyo said the bonus will be disbursed in two instalments of US$75 each in November and December.\n\nFollowing ongoing engagement between government and its employees and in pursuit of achieving this objective, government seeks to announce the following interventions:\n\nTo provide festive season relief and recognise dedicated service, the government will pay a once-off Special Presidential Bonus of US$150 for all civil servants, which will be disbursed in two equal instalments of US$75 in November and December 2025.This will be in addition to the regular annual bonus and salaries, said Moyo.\n\nHe added that the government will next year implement a Job Evaluation Framework to align salaries with job responsibilities and restore long-withdrawn benefits for public workers.\n\nThe civil servants vehicle rebate scheme,which allows duty-free car imports,has been reinstated to 2022 benefit levels with effect from December.\n\nThe civil servants vehicle rebate is being fully restored to 2022 benefit levels, rewarding long service and commitment as reflected in Statutory Instrument 124 of 2022 with effect from 1 December 2025.\n\nFurthermore, government is revitalising medical insurance by recapitalising Premier Service Medical Aid Society (PSMAS) to ensure sustainable access to quality healthcare for public servants, he said.\n\nThe government also pledged to assist civil servants in acquiring housing, offering 26,000 residential stands, 20,000 in Harare and 6,000 in Bulawayo, with more to be made available nationwide.\n\nGeza, who is reportedly backed by Vice President Constantino Chiwenga, has urged citizens to take to the streets accusing Mnangagwa and his allies of corruption and economic mismanagement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192321/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa’s administration has announced a US$150 “Special Presidential Bonus” for civil servants, a move widely viewed as an attempt to ease growing frustration and avert planned anti-government protests called by war veteran and former Zanu PF committee member Blessed Geza. The announcement, made a day before the scheduled October 17</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/panicky-mnangagwa-announces-us150-special-presidential-bonus-for-civil-servants-ahead-of-planned-anti-govt-protests/\">Panicky Mnangagwa announces US$150 ‘Special Presidential Bonus’ for civil servants ahead of planned anti-govt protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Kenya police fire shots and tear gas at crowds gathered to see body of ex-PM Odinga",
            "url": "https://www.newzimbabwe.com/kenya-police-fire-shots-and-tear-gas-at-crowds-gathered-to-see-body-of-ex-pm-odinga/",
            "content": "BBC\n\nHuge crowds of mourners in Kenya fled screaming after police fired gunshots and tear gas in a stadium where they had gathered to see the body of former Prime Minister Raila Odinga.\n\nSeveral people at the arena, located in the capital Nairobi, were reportedly injured in the chaos as security officers sought to disperse the surging crowds.\n\nIt is not yet clear whether the police were using live ammunition or rubber bullets.\n\nOdingas body was flown back from India, where he died on Wednesday morning. Thousands of supporters had earlier travelled to the countrys main airport to receive the coffin, in an outpouring of grief that forced a brief halt to flights.\n\nThe authorities said mourners had gained access to restricted areas, prompting a precautionary closure that lasted about two hours.\n\nFrom the airport, thousands of people moved in a procession to escort the vehicle carrying the body to the stadium, about 10km (six miles) from the city centre.\n\nBecause of the unexpectedly large crowds, the public viewing ceremony for Odingas body was moved to Nairobis Moi International Sports Centre in the Kasarani neighbourhood, rather than inside the parliament building where it was initially scheduled to take place.\n\nThe convoy arrived to a packed stadium, with more people waiting outside.\n\nMinutes afterwards, a large crowd breached a gate in the arena, prompting the police to fire tear gas. Masses of mourners rushed towards the exits in response.\n\nA BBC reporter at the scene also saw men in civilian clothing beating protesters with batons.\n\nAt least three people were visibly injured and one had a serious head wound, the AFP news agency reported.\n\nAfter the chaos had settled, government officials and dignitaries were able to view it the coffin.\n\nA stream of supporters had earlier gathered at Lee Funeral Home, where the body was first expected, and around parliament.\n\nI came here at six in the morning. We have been at the airport to welcome Baba [Odingas nickname], one mourner had told the BBC near the airport.\n\nWe are sad, we have been left as orphans. He is our father.\n\nMotorcycle rider William Otieno Adoyo said he was a Baba die-hard.\n\nWe want to see Baba, how do we know its him in the casket? Let them show us and well be contented, he told the BBC.\n\nMourners have been carrying twigs and palm branches, a symbol of mourning and grief among the Luo ethnic group that Odinga belonged to.\n\nThe state funeral will be held at the Nyayo National Stadium in Nairobi on Friday and on Saturday his body will be transported to Kisumu, a city in western Kenya on the shores of Lake Victoria  his political stronghold.\n\nMembers of the public will get a chance to view the body before he is buried on Sunday at his farm in Bondo, about 60km west of Kisumu.\n\nAccording to the family, it was Odingas wish to be laid to rest within the shortest time possible, ideally within 72 hours.\n\nThe 80-year-old former prime minister collapsed during a morning walk in India on Wednesday morning and he was taken to Devamatha Hospital, about 50km (30 miles) east of the port city of Kochi.\n\nA seven-day period of mourning has been declared. Odinga will also be accorded a state funeral with full military honours, Kenyan President William Ruto said.\n\nHe was towering figure in Kenyan politics and for many years was the countrys main opposition leader, losing five presidential campaigns, most recently three years ago.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16161129/kenya.webp",
            "description": "<p>BBC Huge crowds of mourners in Kenya fled screaming after police fired gunshots and tear gas in a stadium where they had gathered to see the body of former Prime Minister Raila Odinga. Several people at the arena, located in the capital Nairobi, were reportedly injured in the chaos as security officers sought to disperse</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenya-police-fire-shots-and-tear-gas-at-crowds-gathered-to-see-body-of-ex-pm-odinga/\">Kenya police fire shots and tear gas at crowds gathered to see body of ex-PM Odinga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        }
    ]
}