{
    "news": [
        {
            "title": "In Pictures: Thousands of fish die after contamination of Lake Chivero with cyanobacteria",
            "url": "https://www.newzimbabwe.com/in-pictures-thousands-of-fish-die-after-contamination-of-lake-chivero-with-cyanobacteria/",
            "content": "Below are some pictures from Lake Chivero, where thousands of fish died after suffocating under water contaminated with cyanobacteria.\n\nAmong the dead fish, some still appeared fresh, others were decomposing, and some had reduced to mere skeletons.\n\nThe distance between the dead fish and the current shoreline was approximately ten meters. The presence of dried algae further indicated that the fish had been dying over an extended period.\n\nSome fish were crusted in this dried algae.\n\nThe Harare City Council has been blamed for the water contamination crisis, as it is responsible for discharging raw sewage into the lake.\n\nImages by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18164126/chivero-18.jpeg",
            "description": "<p>Below are some pictures from Lake Chivero, where thousands of fish died after suffocating under water contaminated with cyanobacteria. Among the dead fish, some still appeared fresh, others were decomposing, and some had reduced to mere skeletons. The distance between the dead fish and the current shoreline was approximately ten meters. The presence of dried</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-thousands-of-fish-die-after-contamination-of-lake-chivero-with-cyanobacteria/\">In Pictures: Thousands of fish die after contamination of Lake Chivero with cyanobacteria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "African Hunger Crisis Deepens as Leaders Call for Sanctions Relief During Russia Visit",
            "url": "https://www.newzimbabwe.com/african-hunger-crisis-deepens-as-leaders-call-for-sanctions-relief-during-russia-visit/",
            "content": "BusinessInsiderAfrica\n\nA delegation from the Pan-African Parliament (PAP)has made an unexpected visit to Russiain a bid to address Africas growing food crisis driven by fertilizer shortages. The delegation, which included representatives from a dozen African nations, emphasized the need for urgent global action to address the growing food crisis as fertilizer prices skyrocket and agricultural yields plummet across the continent.\n\nThe visit highlighted Africas increasing frustration with the global sanctions regime, which has disrupted exports of potash and nitrogen fertilizers from Russia and Belarussuppliers that together account for over third of the worlds potash. These sanctions, imposed to isolate Moscow over the war in Ukraine, have had significant consequences for African nations, where agriculture is central to both economies and livelihoods.\n\nGayo Ashebir, the PAP vice president for East Africa, led the delegation and did not mince words. The sanctions imposed by the West are not just hurting Russia and Belarusthey are hurting Africa, Ashebir said. Our farmers cannot afford fertilizers, and this has triggered a chain reaction: reduced yields, skyrocketing food prices, and widespread hunger. This is a humanitarian crisis.\n\nThe delegation included representatives from countries such as Ethiopia, Uganda, Malawi, Tanzania, Somalia, Djibouti, and Mozambique, all of which have been severely impacted by the global fertilizer crunch. The leaders voiced strong support for the full-scale resumption of fertilizer exports from Russia and Belarus, urging Western nations to ease financial and other restrictions that have made it nearly impossible for African governments to pay for these critical agricultural inputs.\n\nWe are willing to purchase fertilizers directly from Russia and Belarus, a member of the delegation said. But the financial restrictions imposed by Western powers are effectively blocking these transactions. This is no longer about politicsits about saving lives.\n\nThe timing of the visit reflects the urgency of the crisis. According to the United Nations, one in five Africans282 million peoplefaced food insecurity in 2023, with the numbers expected to worsen in 2024. In sub-Saharan Africa, where smallholder farmers produce roughly 80% of the continents food, the price of fertilizers has risen by as much as 300% since the start of the Ukraine war. Analysts warn that cereal yields in some African nations have dropped by 20-30%, pushing millions closer to famine.\n\nThe delegations visit has already faced criticism from Western and Ukrainian media and sparked a wave ofanonymous articlesattacking the trip. But Ashebir defended the mission, arguing that African nations must advocate for their own survival amid the global geopolitical conflict. This is about ensuring that Africas voice is heard on the world stage and that food security is treated as a global priority, Ashebir said.\n\nThe food crisis has been compounded by soaring energy prices, driven in part by the conflict in Ukraine. Natural gas, a key component in fertilizer production, saw prices spike by nearly 300% in Europe in 2022, driving up production costs for ammonia-based fertilizers worldwide. These costs have been passed on to farmers, with devastating effects in low-income nations.\n\nIn Africa, where agriculture accounts for 23% of GDP and employs more than half the population, the ripple effects have been severe. Countries like Malawi, Zambia, and Tanzania have reported widespread reductions in planting activity as farmers cannot afford fertilizers. In turn, food prices have surged in local markets, making basic staples like maize, wheat, and rice inaccessible to millions.\n\nGlobally, hunger is on the rise. The UN estimates that between 691 and 783 million people were affected by food insecurity in 2022, up from 613 million in 2019. The Food and Agriculture Organization (FAO) warns that without intervention, the crisis could escalate, potentially affecting 900 million people by 2030, with Africa bearing the brunt of the impact.\n\nThe Pan-African delegations visit to Moscow is part of a broader effort to reframe the global conversation around sanctions and food security. Delegates argued that the Wests sanctions regime disproportionately impacts vulnerable nations, effectively penalizing African countries for a conflict they did not create.\n\nWhile it remains unclear whether the delegations Moscow visit will lead to concrete policy changes, it has succeeded in amplifying Africas voice in the global debate. PAP leaders are now pushing for discussions at the upcoming UN General Assembly to address the unintended consequences of sanctions and to establish mechanisms for ensuring that essential commodities like fertilizers are exempt from geopolitical disputes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18171246/Screenshot-2024-12-18-at-19.12.30.png",
            "description": "<p>BusinessInsiderAfrica A delegation from the Pan-African Parliament (PAP) has made an unexpected visit to Russia in a bid to address Africa’s growing food crisis driven by fertilizer shortages. The delegation, which included representatives from a dozen African nations, emphasized the need for urgent global action to address the growing food crisis as fertilizer prices skyrocket and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-hunger-crisis-deepens-as-leaders-call-for-sanctions-relief-during-russia-visit/\">African Hunger Crisis Deepens as Leaders Call for Sanctions Relief During Russia Visit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "World Soil Day: Zimbabwe reaffirms commitment to promoting sustainable soil management practices",
            "url": "https://www.newzimbabwe.com/world-soil-day-zimbabwe-reaffirms-commitment-to-promoting-sustainable-soil-management-practices/",
            "content": "By Staff Reporter\n\nTHE government has pledged continued efforts in soil conservation to ensure maximum agricultural output and guaranteedfood security in the country.\n\nThe former breadbasket of Africa joined the world in commemorating World Soil Day during an event held in Harare this week.\n\nAs the world celebrated the important calendar event, Zimbabwe reaffirmed its commitment to promoting sustainable soil management practices.\n\nSpeaking at the commemorations, Agriculture permanent secretary, Obert Jiri, in a speech read on his behalf by Chief Director of the Department of Agricultural Engineering, Mechanisation and Farm Infrastructure Development, Edwin Zimunga, said the onus to conserve soils was upon everyone.\n\nlts not just about government efforts collective action is key. Soil plays a vital role in human life, from producing food and filtering water to supporting biodiversity and mitigating climate change, said Jiri.\n\nZimbabwe has a variety of soil types, including sandy, loamy, and alluvial.\n\nSandy soil covers about 70% of the country, and is mostly derived from coarse granite.\n\nA balance of sand, silt, clay, and humus, loamy soil is dark in colour and mealy in the hands. It is considered to be the perfect soil for arable farming while alluvial soil is deposited by surface water, and are found along rivers, in floodplains and deltas, and stream terraces.\n\nSoils produce 94% of our food, through their extraordinary capacity to form, store, transform, and recycle nutrients.\n\nThe government has emphasized the importance of soil conservation, highlighting key initiatives such as the National Soil Conservation Policy and the Agriculture Food Systems and Rural Transformation Strategy.\n\nThe Directorate of Agricultural Engineering, Mechanisation and Farm Infrastructure Development, Soil Conservation unit is working tirelessly to conserve our soils, said Jiri.\n\nConstructing soil conservation mechanical works contour ridges, infiltration pits and practicing conservation agriculture, as well as rehabilitation of degraded land is part of the departments agenda to conserve or protect the precious resource, the soil.\n\nJiri hailed efforts by partners such as the Environmental Management Agency (EMA), the Food and Agriculture Organization of the United Nations (FAO), schools, and partner ministries, for their support in promoting sustainable soil management practices.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18133242/soil-day-2023-hero.jpg",
            "description": "<p>By Staff Reporter THE government has pledged continued efforts in soil conservation to ensure maximum agricultural output and guaranteed food security in the country. The former breadbasket of Africa joined the world in commemorating World Soil Day during an event held in Harare this week. As the world celebrated the important calendar event, Zimbabwe reaffirmed its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-soil-day-zimbabwe-reaffirms-commitment-to-promoting-sustainable-soil-management-practices/\">World Soil Day: Zimbabwe reaffirms commitment to promoting sustainable soil management practices </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Crocodiles eat man in Gonarezhou National Park, remains retrieved from their bellies",
            "url": "https://www.newzimbabwe.com/crocodiles-eat-man-in-gonarezhou-national-park-remains-retrieved-from-their-bellies/",
            "content": "By Staff Reporter\n\nA 23-year-old man was killed by two crocodiles at Chilo Gorge in Gonarezhou National Park and his body parts were recovered from their bellies.\n\nThe incident was confirmed by the Zimbabwe Parks and Wildlife Management Authority (Zimparks) spokesperson, Tinashe Farawo who said the two crocodiles have since been killed.\n\nIt is unfortunate that a 23-year-old man was killed by a crocodile at Chilo Gorge in Gonarezhou.\n\n2 crocodiles were eliminated and body parts of the deceased were recovered from the bellies of the crocs, Farawowrote on X.\n\nIt is unfortunate that a 23 year old man was killed by a crocodile at Chilo Gorge in Gonarezhou. 2 crocodiles were eliminated and body parts of the deceased were recovered from the bellies of the crocs.\n\n Tinashe Farawo (@FarawoTinashe)December 18, 2024\n\nCrocodile attacks are common near river banksin Zimbabwe.\n\nWildlife authorities say crocodiles kill more people than any other animals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/13165408/crocodile.jpg",
            "description": "<p>By Staff Reporter A 23-year-old man was killed by two crocodiles at Chilo Gorge in Gonarezhou National Park and his body parts were recovered from their bellies. The incident was confirmed by the Zimbabwe Parks and Wildlife Management Authority (Zimparks) spokesperson, Tinashe Farawo who said the two crocodiles have since been killed. “It is unfortunate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crocodiles-eat-man-in-gonarezhou-national-park-remains-retrieved-from-their-bellies/\">Crocodiles eat man in Gonarezhou National Park, remains retrieved from their bellies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Crypto Sentiment Shifts in November",
            "url": "https://www.newzimbabwe.com/crypto-sentiment-shifts-in-november/",
            "content": "November 2024 saw a notable shift in crypto market sentiment, influenced by various factors ranging from macroeconomic changes to industry-specific developments.\n\nMarket Recovery:The crypto market experienced a bullish recovery in November, with Bitcoin leading the charge, as reported inAMBCryptos Sentiment Analysis. This recovery instilled a sense of optimism among investors, shifting the sentiment from cautious to confident.\n\nInstitutional Endorsement:The approval of Bitcoin ETFs and their subsequent performance played a significant role in enhancing institutional trust, thus positively affecting market sentiment.\n\nRegulatory Clarity:News of regulatory bodies like the SEC providing clearer guidelines for crypto operations contributed to reducing uncertainty, fostering a more positive market sentiment.\n\nTech Breakthroughs:Technological advancements, particularly in Ethereums scaling solutions like layer-2 implementations, alleviated concerns over scalability, boosting sentiment.\n\nDeFi Sector Growth:DeFi continued to expand, with platforms like Aave and Uniswap seeing increased activity, signaling robust health in the sector and contributing to bullish sentiment.\n\nAltcoin Surge:November witnessed an altcoin rally, with many tokens significantly outperforming Bitcoin, reigniting interest and speculative fervor in the market.\n\nAI Integration:The integration of AI into blockchain projects, leading to the rise of AI tokens, provided a fresh narrative for investors, enhancing enthusiasm.\n\nMemecoin Mania:The resurgence of memecoins, particularly on networks like Solana, added a playful yet significant boost to market activity and sentiment.\n\nSocial Media Influence:Sentiment on platforms like X (formerly Twitter) turned increasingly positive, with influential figures and crypto communities discussing growth forecasts and technological promises.\n\nEconomic Indicators:US inflation data and Federal Reserve statements on interest rates influenced sentiment, as lower inflation and potential rate cuts are traditionally good for risk assets like crypto.\n\nWhale Behavior:Tracking tools showed whales accumulating rather than selling, which often signals a bullish market sentiment, as large holders anticipate price appreciation.\n\nFear & Greed Index:The Crypto Fear & Greed Index moved towards greed, reflecting a market where the fear of missing out (FOMO) was beginning to drive sentiment.\n\nPublic Perception:Public perception of crypto shifted, with more mainstream media outlets covering crypto positively, often focusing on its adoption and utility.\n\nGeopolitical Factors:Geopolitical events and their economic implications sometimes swayed sentiment, with crypto often viewed as a hedge against traditional market instability.\n\nCrypto Adoption News:Announcements of crypto payment systems by major corporations or countries accepting digital currencies for transactions uplifted market sentiment.\n\nNFT Market Rebound:The NFT market, which had cooled down, showed signs of rebounding, contributing to a broader positive sentiment in the crypto space.\n\nLayer-2 Solutions:The growing adoption of layer-2 solutions like Optimism and Arbitrum for Ethereum transactions made DeFi more accessible, bolstering sentiment.\n\nStaking and Yield:Increased staking and yield farming activities indicated investors were looking to park their assets for passive income, a sign of long-term confidence.\n\nMarket Liquidity:Higher liquidity in November meant easier trading, which often translates to increased confidence and a positive sentiment among traders.\n\nToken Burn Events:Projects conducting token burns to reduce supply typically led to price pumps, lifting sentiment across related tokens.\n\nCross-Chain Developments:Developments in blockchain interoperability, allowing for easier movement of assets between chains, were seen as a step towards a more cohesive crypto ecosystem.\n\nPrivacy Enhancements:Improvements in privacy features for transactions and smart contracts also contributed to a more secure and thus more positive market environment.\n\nRegulatory Hiccups:Despite the positive shifts, any hint of regulatory crackdown could still cause sentiment to waver, showing the markets sensitivity.\n\nCrypto in Gaming:The integration of crypto in gaming economies, with tokens offering real value, brought in new user bases, enhancing sentiment.\n\nGlobal Crypto Events:Events like the Binance Blockchain Week or ETHDenver, even though not in November, their anticipation in the community contributed to ongoing positive sentiment.\n\nMarket Correction Expectations:While sentiment was largely positive, there was also an undercurrent of caution, with many anticipating a healthy market correction.\n\nCommunity Sentiment:The crypto communitys discussions often leaned optimistic, with forums and social media groups sharing success stories and future predictions.\n\nInstitutional Moves:Institutional investments, especially in Bitcoin ETFs, continued to validate crypto as an asset class, influencing sentiment positively.\n\nConclusion:Novembers sentiment shifts in the crypto market were a tapestry of technological progress, institutional acceptance, and broader economic factors.\n\n",
            "image_url": null,
            "description": "<p>November 2024 saw a notable shift in crypto market sentiment, influenced by various factors ranging from macroeconomic changes to industry-specific developments. Market Recovery: The crypto market experienced a bullish recovery in November, with Bitcoin leading the charge, as reported in AMBCrypto’s Sentiment Analysis. This recovery instilled a sense of optimism among investors, shifting the sentiment from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crypto-sentiment-shifts-in-november/\">Crypto Sentiment Shifts in November</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "How Social Casinos Are Enhancing Online Entertainment for Diaspora Zimbabweans",
            "url": "https://www.newzimbabwe.com/how-social-casinos-are-enhancing-online-entertainment-for-diaspora-zimbabweans/",
            "content": "For Zimbabweans living abroad, connecting to familiar experiences while enjoying entertainment is essential.Social casinos, like Spree, offer a perfect blend of entertainmentthat brings the thrill of casino-style games without financial risks. These platforms use virtual coins instead of real monetary, allowing players to enjoy popular games such as slots, poker, and blackjack purely for leisure. This format is especially appealing to Zimbabweans in the diaspora who want to indulge in fun games without the pressures associated with traditional casino.\n\nSocial casinos provide players with a safe way to enjoy their favorite games. Since theres no monetary involved, users can explore a variety of games, challenge themselves, and even participate in friendly competitions without concerns about financial loss. The social element of these platforms is also a significant attraction. Many social casinos include features like chat rooms, which allow players to interact with others, make new friends, and even connect with fellow Zimbabweans across the globe.\n\nFor theZimbabwean diaspora, staying connected with others who share their background is an important aspect of adjusting to life abroad. Social casinos allow them to create a virtual network of players from all walks of life, fostering a sense of community that can otherwise be hard to come by.\n\nOne unique aspect of social casinos is the diversity of games available, catering to a range of cultural preferences. Social casinos often include themes and events that reflect Zimbabwean culture, helping players feel more connected to their roots. At the same time, these platforms expose users to global trends in gaming, allowing them to enjoy a wide array of experiences. This blend of cultural relevance and global trends ensures that players feel both at home and part of a broader international community.\n\nAdditionally, many social casinos hold promotions and themed events that coincide with Zimbabwean holidays, making them a popular choice for those looking to celebrate special occasions in a way that feels familiar. This cultural sensitivity not only enhances the gaming experience but also brings a sense of belonging to those far from home.\n\nThe accessibility of social casinos is another key factor in their popularity among Zimbabweans abroad. With mobile compatibility and often no download requirements, players can join from any device, anytime and anywhere. This makes it easy for users to fit gaming into their busy schedules, offering a quick and easy form of entertainment during breaks or at the end of a long day.\n\nThe games themselves are often designed to be easy to pick up and play, with simple rules and engaging graphics that attract players of all ages. This broad appeal makes social casinos an attractive entertainment option for a diverse range of users.\n\nSocial casinos are continually evolving, with new games and features being added regularly. Many platforms are exploring virtual reality and augmented reality experiences, which add an extra layer of immersion and excitement to the gaming experience. For Zimbabweans abroad, these innovations mean more ways to engage with entertainment that feels fresh and exciting.\n\nAs technology continues to advance, social casinos will likely expand their offerings to include even more sophisticated features. This growth in the sector promises to deliver an enhanced gaming experience, connecting players with the latest in online entertainment while retaining the sense of community and enjoyment that social casinos are known for.\n\nBy leveraging platforms like Spree, Zimbabweans living abroad can enjoy a taste of home and a connection to their culture, all while participating in a vibrant and growing digital entertainment space. These platforms provide a safe, enjoyable, and culturally enriching way for the diaspora to stay entertained and connected, no matter where they are.\n\n",
            "image_url": null,
            "description": "<p>For Zimbabweans living abroad, connecting to familiar experiences while enjoying entertainment is essential. Social casinos, like Spree, offer a perfect blend of entertainment that brings the thrill of casino-style games without financial risks. These platforms use virtual coins instead of real monetary, allowing players to enjoy popular games such as slots, poker, and blackjack purely for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-social-casinos-are-enhancing-online-entertainment-for-diaspora-zimbabweans/\">How Social Casinos Are Enhancing Online Entertainment for Diaspora Zimbabweans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Cyclone Chido leaves death, damage from Mauritius to Mozambique",
            "url": "https://www.newzimbabwe.com/cyclone-chido-leaves-death-damage-from-mauritius-to-mozambique/",
            "content": "Bloomberg\n\nRescue workers are racing to save lives and repair damage wrought by Tropical Cyclone Chido in a string of islands across the southwestern Indian Ocean.\n\nThe official death toll in the French territory of Mayotte, an archipelago off the coast of Mozambique that was hit the hardest, was 22 as of Tuesday morning, along with 1 400 injuries, local official Ambdilwahedou Soumaila told Radio France Internationale. But authorities say the number of dead is likely to rise into the hundreds in the worst storm to hit the area in nearly a century.\n\nFrance instituted a curfew from 10 pm to 4 am local time starting Tuesday and President Emmanuel Macron said he would travel to Mayotte in coming days and decree a day of national mourning, while the US State Department has said its ready to offer assistance.\n\nFrances interior minister, Bruno Retailleau, arrived in the capital Mamoudzou on Monday, as the nation rushed hundreds of soldiers and firefighters to assist in recovery efforts. He said the island is totally devastated\n\nThe storm developed in the Indian Ocean from Dec. 7 to 8, hitting Agalega, a dependency located 1,000 kilometers north of Mauritius on December 11, before intensifying north of Madagascar, slamming into the French territory of Mayotte and making landfall in Mozambique on Sunday.\n\nChido hit Mauritius Agalega atoll last Wednesday at more than 200 kilometers per hour, a force that damaged equipment designed to record wind speed, Mauritius Prime Minister Navinchandra Ramgoolam told lawmakers Tuesday. The islands are home to an India-financed and constructed airstrip and jetty.\n\nApproximately 95% of buildings including homes, the hospital, the police and the national coast guards facilities in the north island have been destroyed, he said in response to a parliamentary question. Around 98% of the infrastructure are completely damaged in the south of the island.\n\nThere were no casualties, he said.\n\nThe storm then hit the densely populated Mayotte. Around one-third of the territorys 320,000 residents live in shantytowns, whose sheet-metal roofs are vulnerable to high winds. Mayotte is Frances poorest territory and is heavily dependent on aid from Paris.\n\nChido made landfall in northern Mozambique on Dec. 15 south of Pemba port, dumping more than 250 millimeters of rain in 24 hours. At least 34 people died, with more than 35,000 houses completely or partially destroyed, according to a preliminary assessment from the southeast African nations disaster management institute on Tuesday.\n\nThe storm weakened as it moved inland and will dissipate near Zimbabwe later on Tuesday, the United Nations Office for the Coordination of Humanitarian Affairs said in a report.\n\nMozambique has been rocked by weeks of protests against what opposition leader Venncio Mondlane said were fraudulent elections on Oct. 9. Mondlane was set to announce a new round of demonstrations on Monday, but Chidos wreckage prompted him to postpone these until December 23, by when the Constitutional Council is due to validate the election results.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18064241/chido.jpg",
            "description": "<p>Bloomberg Rescue workers are racing to save lives and repair damage wrought by Tropical Cyclone Chido in a string of islands across the southwestern Indian Ocean. The official death toll in the French territory of Mayotte, an archipelago off the coast of Mozambique that was hit the hardest, was 22 as of Tuesday morning, along</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cyclone-chido-leaves-death-damage-from-mauritius-to-mozambique/\">Cyclone Chido leaves death, damage from Mauritius to Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Amalgamated Regional Trading suffers a 15% export volume decline",
            "url": "https://www.newzimbabwe.com/amalgamated-regional-trading-suffers-a-15-export-volume-decline/",
            "content": "By Alois Vinga\n\nAMALGAMATED Regional Trading (ART) has suffered a 15% export volume decline on the back of acute foreign currency shortages affecting the region.\n\nPresenting the groups performance for the period ended September 30 2024, Art chairman, Dr Thomas Wushe said export volumes during the period were depressed.\n\nExport volumes declined by 15% compared to the prior year. The foreign currency shortages in the region continued resulting in significant payment delays in Zambia and Malawi, he said.\n\nHe said during the period, the group had a difficult year and was not able to deliver the expected level of financial performance as the ongoing transformation of the business was severely impacted by the changes in the economic environment.\n\nThe bold and defensive decisions taken to scale back investment in the Paper segment during the year resulted in significant losses in the Paper divisions after taking into account once-off restructuring costs and under-recoveries.\n\nThe energy storage, timber and stationery businesses delivered resilient performances as they remain foundationally strong but power shortages during the period exacerbated product availability challenges in the peak season.\n\nRevenue for the year decreased by 11% from the prior year due to product availability challenges and the deliberate scaling down of Paper production.\n\nGross profit margins at 44% improved by 2 percentage points benefiting from the change in sales mix with the slowdown of the low-margin paper volumes. Operating expenses increased as currency movements drove service providers to move to hard currency and hedge against further value loss.\n\nThe Group was relentless in its drive to fix, strengthen and reposition the business. Overall short-term bank debt was reduced substantially as proceeds from property disposals were applied towards loans. Finance costs remained relatively high, reducing by 6% from the prior year.\n\nWe anticipate that the market conditions will remain unpredictable and challenging as the underlying economic problems are being addressed.\n\nThe Board remains confident that the ongoing restructuring efforts and decisions taken will see the gradual strengthening of the Group and increased agility in taking of opportunities identified in all our business units, added Wushe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18061320/Dr-Wushe.png",
            "description": "<p>By Alois Vinga AMALGAMATED Regional Trading (ART) has suffered a 15% export volume decline on the back of acute foreign currency shortages affecting the region. Presenting the group’s performance for the period ended September 30 2024, Art chairman, Dr Thomas Wushe said export volumes during the period were depressed. “Export volumes declined by 15% compared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amalgamated-regional-trading-suffers-a-15-export-volume-decline/\">Amalgamated Regional Trading suffers a 15% export volume decline</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "Harare Mayor Mafume blames informal settlements, obsolete equipment for Lake Chivero disaster",
            "url": "https://www.newzimbabwe.com/harare-mayor-mafume-blames-informal-settlements-obsolete-equipment-for-lake-chivero-disaster/",
            "content": "By Mary Taruvinga\n\nHarare Mayor Jacob Mafume has blamed informal settlements for compounding the contamination crisis in Lake Chivero stating that there is a need to stop or regulate them.\n\nMafume was addressing journalists at a press briefing held to give an update regarding the ecological disaster unearthed last weekend.\n\nThe mayor also said Harare is relying on obsolete infrastructure which is now failing to cope with the growing population in the city.\n\nWe have sewer works but they are not at full capacity because they were designed many years ago and cannot deal with the effluent and the quantities that go there and the natural growth of the city.\n\nThere are informal settlements that have been formed in and around Lake Chivero that then create a situation where there are too much pollution levels.\n\nWe are also concerned about the pollution. As the pollution increases,\n\nMafume said they need resources to build new water sources and upgrade the water system.\n\nHe said these are early days to say much about the situation evolving at Chivero, however indicating that experts, city officials, government officials and other stakeholders willsoonbe visiting the lake to get an understanding.\n\nTests will guide us on what needs to be done, he said.\n\nThe City of Harare was blamed for causing contamination of Lake Chivero by discharging raw sewage into the water body.\n\nThis followed the deaths of four rhinos, fish and wildlife in a contamination scare that has pushed authorities into action.\n\nLake Chivero serves as the primary source of water for Harare residents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Mary Taruvinga Harare Mayor Jacob Mafume has blamed informal settlements for compounding the contamination crisis in Lake Chivero stating that there is a need to stop or regulate them. Mafume was addressing journalists at a press briefing held to give an update regarding the ecological disaster unearthed last weekend. The mayor also said Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-mayor-mafume-blames-informal-settlements-obsolete-equipment-for-lake-chivero-disaster/\">Harare Mayor Mafume blames informal settlements, obsolete equipment for Lake Chivero disaster</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        },
        {
            "title": "NPA enlists 34 new prosecutors, move set to improve justice delivery system",
            "url": "https://www.newzimbabwe.com/npa-enlists-34-new-prosecutors-move-set-to-improve-justice-delivery-system-2/",
            "content": "By Staff Reporter\n\nTHE National Prosecuting Authority (NPA) has recruited 34 new public prosecutors in a bid to enhance the justice delivery system saddled by case backlogs due to short-staffing.\n\nThe cohort of rookie prosecutors recently underwent a week-long induction workshop to acquaint them with the needs of their profession.\n\nAddressing the group of recruits, Deputy Prosecutor-General, Nelson Mutsonziwa said continuous learning, diligence and integrity were key to remaining relevant in the job.\n\nBe well-read, apply yourselves diligently, be sensitive to the needs of the victims of crime, and always shy away from corruption, said Mutsonziwa.\n\nThe induction course focussed on the structure of the NPAZ, standard operating procedures, ethics and the statutes governing their profession.\n\nWe wish them all the best in their new roles, he added.\n\nThe shortage of public prosecutors, just like magistrates, has witnessed the delay in the kick-off of trials, thereby denying citizens timely justice.\n\nThe 34 new public prosecutors are set to be deployed to various stations across the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18042034/GeWHZLWWsAAzW80.jpeg",
            "description": "<p>By Staff Reporter THE National Prosecuting Authority (NPA) has recruited 34 new public prosecutors in a bid to enhance the justice delivery system saddled by case backlogs due to short-staffing. The cohort of rookie prosecutors recently underwent a week-long induction workshop to acquaint them with the needs of their profession. Addressing the group of recruits,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/npa-enlists-34-new-prosecutors-move-set-to-improve-justice-delivery-system-2/\">NPA enlists 34 new prosecutors, move set to improve justice delivery system </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "18 Dec 2024"
        }
    ]
}