{
    "news": [
        {
            "title": "Zimbabwe records refugee influx, DRC constitutes larger population",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-refugee-influx-drc-constitutes-larger-population/",
            "content": "By Staff Reporter\n\nThe population of refugees in Zimbabwe is expected to shoot up to 18,000 by the end of this year due to a prevailing peaceful environment, the government has said.\n\nAddressing the media on the state and welfare of refugees in Zimbabwe ahead of the World Refugee Day commemoration to be held this Friday at Tongogara Refugee Camp, Labour and Public Service Deputy Minister Mercy Dinha said Zimbabwe is home to at least 17,200 refugees.\n\nThe refugees are mainly from DRC, which constitutes 76% while Mozambique sits in the second position at 11%, with the remainder from Burundi, Rwanda and other smaller nationalities.\n\nThe national influx trend also projects a continual increase in the refugee population, with an expected number of 18,000 refugees by December, she said.\n\nIn terms of protection arrangements, Zimbabwe currently uses the settlement system as its policy position.\n\nThis arrangement is in line with some reservations that were expressed when we ratified the 1951 Convention, she said.\n\nHowever, some refugees who are professionals and some refugees who are business people are accorded authority to work and reside outside Tongogara refugee settlement.\n\nAccording to Dinha, the government has allocated at least 175 hectares of irrigable plots to refugees at Tongogara Refugee Camp.\n\nThe ministry is also working in collaboration with the office of the United Nations, in collaboration with World Vision and other UN organisations and developmental partners.\n\nThis years commemoration will be held under the theme Solidarity with refugees.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/17031706/Tongogara-Camp.jpg",
            "description": "<p>By Staff Reporter The population of refugees in Zimbabwe is expected to shoot up to 18,000 by the end of this year due to a prevailing peaceful environment, the government has said. Addressing the media on the state and welfare of refugees in Zimbabwe ahead of the World Refugee Day commemoration to be held this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-refugee-influx-drc-constitutes-larger-population/\">Zimbabwe records refugee influx, DRC constitutes larger population </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Jun 2025"
        },
        {
            "title": "Zimbabwe sets historic tobacco production record, eyes value-driven growth",
            "url": "https://www.newzimbabwe.com/zimbabwe-sets-historic-tobacco-production-record-eyes-value-driven-growth/",
            "content": "MedAfrica\n\nZimbabwe has reached an unprecedented milestone in its tobacco industry, surpassing its previous national production record with over 300 million kilogrammes of leaf tobacco sold since the marketing season began in March 2025.\n\nAccording to the Tobacco Industry and Marketing Board (TIMB), this achievement exceeds the 296 million kg record set in 2023 and has generated more than 1 billion U.S. dollars in revenue for farmers, marking a significant boost to the countrys agricultural economy.\n\nTIMB spokesperson Chelesani Tsarwe described the 2024 season as historic, attributing the success to the resilience and collaboration across the entire value chain.\n\nHowever, she stressed that future growth must transcend volume metrics, urging a shift toward greater local processing, improved farmer income, diversified export markets, and environmentally sustainable practices.\n\nThe ultimate goal, she noted, is to ensure that tobacco production delivers more inclusive and long-term economic value.\n\nZimbabwes progress aligns with its 2021 Tobacco Value Chain Transformation Plan, which set an ambitious annual production target of 300 million kg and a broader vision of building a 5-billion-dollar industry by 2025.\n\nAs one of the countrys key export earners, with major markets in China and South Africa, tobacco remains a vital economic driver, especially for rural communities.\n\nAuthorities now aim to move from sheer output to a more integrated and value-oriented industry that benefits the nation more holistically.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/20225815/Tobacco-auction-floors.jpg",
            "description": "<p>MedAfrica Zimbabwe has reached an unprecedented milestone in its tobacco industry, surpassing its previous national production record with over 300 million kilogrammes of leaf tobacco sold since the marketing season began in March 2025. According to the Tobacco Industry and Marketing Board (TIMB), this achievement exceeds the 296 million kg record set in 2023 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-sets-historic-tobacco-production-record-eyes-value-driven-growth/\">Zimbabwe sets historic tobacco production record, eyes value-driven growth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Jun 2025"
        },
        {
            "title": "Trump to decide on US action in Israel-Iran war within two weeks, White House says",
            "url": "https://www.newzimbabwe.com/trump-to-decide-on-us-action-in-israel-iran-war-within-two-weeks-white-house-says/",
            "content": "PresidentDonald Trumpwill decide in the next two weeks whether the U.S. will get involved in theIsrael-Iran air war, the White House said on Thursday, raising pressure on Tehran to come to the negotiating table.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>Reuters President Donald Trump will decide in the next two weeks whether the U.S. will get involved in the Israel-Iran air war, the White House said on Thursday, raising pressure on Tehran to come to the negotiating table. Citing a message from Trump, White House Press Secretary Karoline Leavitt told reporters: “Based on the fact that there’s a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-to-decide-on-us-action-in-israel-iran-war-within-two-weeks-white-house-says/\">Trump to decide on US action in Israel-Iran war within two weeks, White House says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Jun 2025"
        },
        {
            "title": "Uncapped pacer in Zimbabwe squad to face the Proteas",
            "url": "https://www.newzimbabwe.com/uncapped-pacer-in-zimbabwe-squad-to-face-the-proteas/",
            "content": "Zimbabwe and South Africa will face off in a two-match Test series, starting June 28 in Bulawayo.\n\nZimbabwe have named their squad of 16 players to faceWorld Test Championship 2025 winners, South Africain a two-match Test series at home, beginning later this month.\n\nThe sides previously met in a warm-up match for the Proteas ahead of the World Test Championship final.\n\nThey will be led by long-standing skipper,Craig Ervine, while leg spinner, Vincent Masekesa has also been recalled.\n\nZimbabwe are bolstered by the return of pacer Trevor Gwandu, who was injured on the tour of England.\n\nUncapped pacer Kundai Matigimu earns his maiden Test call-up, while Prince Masvaure and Takudzwanashe Kaitano return to strengthen the top-order alongside Brian Bennett.\n\nBlessing Muzarabanileads the pace attack, with Sean Williams stabilising the middle-order in the two-Test series.\n\nZimbabwe Squad v South Africa:\n\nCraig Ervine (Captain), Brian Bennett, Tanaka Chivanga, Trevor Gwandu, Takudzwanashe Kaitano, Wessly Madhevere, Clive Madande, Vincent Masekesa, Wellington Masakadza, Prince Masvaure, Kundai Matigimu, Blessing Muzarabani, Newman Nyamhuri, Tafadzwa Tsiga, Nicholas Welch, Sean Williams\n\nFirst Test:June 28 to July 2\n\nSecond Test:July 6 to July 10\n\nBoth Tests are set to be played at the Queens Sports Club in Bulawayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19193111/matigimu.jpeg",
            "description": "<p>ICC Zimbabwe and South Africa will face off in a two-match Test series, starting June 28 in Bulawayo. Zimbabwe have named their squad of 16 players to face World Test Championship 2025 winners, South Africa in a two-match Test series at home, beginning later this month. The sides previously met in a warm-up match for the Proteas</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uncapped-pacer-in-zimbabwe-squad-to-face-the-proteas/\">Uncapped pacer in Zimbabwe squad to face the Proteas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Jun 2025"
        },
        {
            "title": "Government unveils Event-Based Surveillance guidelines",
            "url": "https://www.newzimbabwe.com/government-unveils-event-based-surveillance-guidelines/",
            "content": "By Staff Reporter\n\nThe Health Ministry, in partnership with its development partners, has launched Zimbabwes National Event-Based Surveillance Guidelines in a bid to improve efficacy in preparing for hazards that threaten public health.\n\nThe Event-Based Surveillance (EBS) presents a shift from passive reaction to proactive preparedness.\n\nIt comprises the use of Public Health Emergency Operations Centres, toll-free hotlines, and community engagement platforms to build a surveillance ecosystem that is people-centred.\n\nIt will enable public health stakeholder to identify warning signs at their earliest possible moment, enabling preparedness.\n\nSpeaking at the launch of the event, Health Minister Douglas Mombeshora said early action becomes a tool of prevention.\n\nIt represents a culture of vigilance.\n\nA system where every signal matters, whether it comes from a hospital Ward, a village clinic, a local rumour, or a message shared online.\n\nIn this system, timely information becomes a tool of protection and early action becomes a tool of prevention.\n\nZimbabwe, like many of our sister countries across the continent, has not been spared from the devastating effects of disease outbreaks, both known and emerging.\n\nThese experiences have taught us a vital truth in public health: speed saves lives, he said.\n\nIn this initiative government partnered with the Africa CDC, the World Health Organisation, UNICEF, among other partners who provided technical and financial support.\n\nMombeshora urged partners to translate the policy into practice to realise intended results.\n\nIt means strengthening our laboratories, capacitating our call centres, and ensuring rapid coordination across all levels of government and community structures.\n\nRegional Program Lead Africa CDC, Batsirai Mbodza, said, At Africa CDC, we firmly believe that early detection saves lives.\n\nWe know that health threats know no borders, whether from infectious diseases, environmental hazards, or other emergencies, the ability to pick up signals quickly and respond effectively is what stands between containment and crisis.\n\nWHO Emergencies Team Lead Lincoln Charimari said they are committed to working with the government to strengthen surveillance, a position also seconded by UNICEF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Staff Reporter The Health Ministry, in partnership with its development partners, has launched Zimbabwe’s National Event-Based Surveillance Guidelines in a bid to improve efficacy in preparing for hazards that threaten public health. The Event-Based Surveillance (EBS) presents a shift from passive reaction to proactive preparedness. It comprises the use of Public Health Emergency Operations</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-unveils-event-based-surveillance-guidelines/\">Government unveils Event-Based Surveillance guidelines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Jun 2025"
        },
        {
            "title": "Dictatorship by-laws – opposition MPs push back against ZANU PF’s move for National Ideology",
            "url": "https://www.newzimbabwe.com/dictatorship-by-laws-opposition-mps-push-back-against-zanu-pfs-move-for-national-ideology/",
            "content": "By Darlington Gatsi\n\nPARLIAMENT is divided over the motion for Zimbabwe to adopt a legal framework for a National Ideology, which opposition legislators have condemned as the ZANU-fication of the country, warning it could lead to the suppression of government critics.\n\nRecently, ZANU PF Member of Parliament (MP) Joseph Mapiki tabled a motion for the National Assembly to debate the adoption of a national ideology across Zimbabwean society.\n\nAccording to Mapiki, the National Ideology would entrench patriotism and Zimbabwean identity.\n\nHowever, the proposal has angered opposition legislators, who fear the legal framework could be used to restrict democratic freedoms.\n\nCitizens Coalition for Change (CCC) MP Lynnette Karenyi-Kore argued that if passed, the law would be weaponised against opposition members.\n\nOur Constitution guarantees freedom of thought, opinion and expression. To enforce patriotism legally would infringe upon these basic rights, Madam Speaker.\n\nCreating a legal framework compelling ideological loyalty undermines democracy and pluralism through thriving on diversity of opinion. The dangers of institutionalising ideology are as follows: An ideology institution sounds disturbing.\n\nHistory has shown us that once States begin controlling ideology, State abuse, censorship and suppression of dissent follow. Decisiveness and weaponisation risk, it is also going to be one of the challenges, said Karenyi.\n\nZANU PF is pushing to nationalise the ideological school concept it established within its party. The ruling party has previously proposed enrolling civil servants into the Herbert Chitepo School of Ideology.\n\nThe National Ideology would also be incorporated into the school curriculum, with patriotism as a core component of education from primary to tertiary level.\n\nCCC legislator Gladys Hlatywayo warned that the proposal risks being hijacked by ZANU PFs interests rather than serving the nation.\n\nTerms such as national interest are often euphemisms for advancing party interest and the interest of the ruling class or ruling elite. In this case, legislating patriotism might be legislating the zanufication of the State.\n\nThere is also a danger that legislating patriotism can erode civil liberties and restrict freedoms of speech, assembly and association. These civil liberties are at the heart of any democratic society and encoded in our own Bill of Rights, in our own Constitution, and must therefore be protected and protected rather than taken away by opaque, divisive and undemocratic laws under the guise of legislative patriotism.\n\nThe proposed prayer by the mover of the motion also has a chilling effect on public discourse Madam Speaker. Open, honest public debate that is so instrumental to democratic development might be discouraged as fear grips the country, said Hlatywayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/08063728/karenyi.jpg",
            "description": "<p>By Darlington Gatsi PARLIAMENT is divided over the motion for Zimbabwe to adopt a legal framework for a National Ideology, which opposition legislators have condemned as the “ZANU-fication” of the country, warning it could lead to the suppression of government critics. Recently, ZANU PF Member of Parliament (MP) Joseph Mapiki tabled a motion for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dictatorship-by-laws-opposition-mps-push-back-against-zanu-pfs-move-for-national-ideology/\">Dictatorship by-laws – opposition MPs push back against ZANU PF’s move for National Ideology </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Jun 2025"
        }
    ]
}