{
    "news": [
        {
            "title": "Kirsty Coventry outlines Olympic vision ahead of historic IOC presidency",
            "url": "https://www.newzimbabwe.com/kirsty-coventry-outlines-olympic-vision-ahead-of-historic-ioc-presidency/",
            "content": "Xinhua\n\nKirsty Coventry, poised to become the first woman and the first African to lead the International Olympic Committee, has laid out her vision for the future of the Olympic Movement, grounded in its core values and potential for global unity.\n\nCoventry, elected in March during the 144th IOC Session in Greece, will assume the presidency on June 23, succeeding Thomas Bach, who has led the organization since 2013. She received 49 of 97 votes in the first round, prevailing over six other candidates.\n\nValues are what have led this movement for over a hundred years. Its whats kept this movement intertwined together. And that is something that we can never compromise, the 41-year-old Zimbabwean told the Olympic Channel at the Olympic House in Lausanne on Thursday.\n\nWe have to be proud that were a movement that not just lives by its values, but shares its values, and promotes its values, Coventry said.\n\nAnd if we can find more ways to do that in the future, and can reach all households around the world, thats part of my goal. How do we have more reach to communities across our massive globe? How do we reach those children to share our values with them? How do we reach them to inspire them?\n\nDespite the weight of expectations that accompany the role, Coventry expressed enthusiasm about the opportunity to lead.\n\nI dont really look at the presidency as a weight, she said. Are there a lot of expectations? Yes. Does that come with a lot of responsibility? Yes. But Im really so honored to have been given this opportunity, and Im so excited for what the future holds. Its a movement that has been a part of my life for so long, so it almost feels like a very natural progression.\n\nCoventrys deep ties to the Olympics began with her storied swimming career. She competed in five consecutive Games beginning in Sydney 2000, winning seven medals  including two golds  and becoming Africas most decorated Olympian. Her return to Zimbabwe after her Olympic success, during a time of national difficulty, further cemented her belief in sports transformative power.\n\nIn addition to her achievements in the pool, Coventry has played a key role in sports governance. She joined the IOC as an athlete member in 2013, chaired the Athletes Commission, served on the Executive Board, and led initiatives promoting safe sports environments for children through the Kirsty Coventry Academy and the HEROES programme in Zimbabwe.\n\nShe also served as Zimbabwes Minister of Youth, Sport, Arts and Recreation from 2018, during which she pushed legislation aimed at curbing match-fixing, abuse, and sexual harassment in sport.\n\nBalancing her new role with her home life as the mother of two young daughters has been a challenge, she admitted.\n\nIt has been crazy. And its been hard, but its also been wonderful, Coventry said.\n\nI have a lot more patience, she added. I now realize I can do a lot more with a lot less sleep. [The children] humble you. And when you get home after a rough day, you can look at them and you can realize, Okay, this is why were doing this. But were also doing this so that the Olympic Games and our values remain relevant in this crazy world of ours. Theyre the meaning.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20181137/kirsty-IOC-scaled.jpeg",
            "description": "<p>Xinhua Kirsty Coventry, poised to become the first woman and the first African to lead the International Olympic Committee, has laid out her vision for the future of the Olympic Movement, grounded in its core values and potential for global unity. Coventry, elected in March during the 144th IOC Session in Greece, will assume the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kirsty-coventry-outlines-olympic-vision-ahead-of-historic-ioc-presidency/\">Kirsty Coventry outlines Olympic vision ahead of historic IOC presidency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "20 Jun 2025"
        },
        {
            "title": "Trump to decide on US action in Israel-Iran war within two weeks, White House says",
            "url": "https://www.newzimbabwe.com/trump-to-decide-on-us-action-in-israel-iran-war-within-two-weeks-white-house-says/",
            "content": "PresidentDonald Trumpwill decide in the next two weeks whether the U.S. will get involved in theIsrael-Iran air war, the White House said on Thursday, raising pressure on Tehran to come to the negotiating table.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>Reuters President Donald Trump will decide in the next two weeks whether the U.S. will get involved in the Israel-Iran air war, the White House said on Thursday, raising pressure on Tehran to come to the negotiating table. Citing a message from Trump, White House Press Secretary Karoline Leavitt told reporters: “Based on the fact that there’s a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-to-decide-on-us-action-in-israel-iran-war-within-two-weeks-white-house-says/\">Trump to decide on US action in Israel-Iran war within two weeks, White House says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "20 Jun 2025"
        },
        {
            "title": "Uncapped pacer in Zimbabwe squad to face the Proteas",
            "url": "https://www.newzimbabwe.com/uncapped-pacer-in-zimbabwe-squad-to-face-the-proteas/",
            "content": "Zimbabwe and South Africa will face off in a two-match Test series, starting June 28 in Bulawayo.\n\nZimbabwe have named their squad of 16 players to faceWorld Test Championship 2025 winners, South Africain a two-match Test series at home, beginning later this month.\n\nThe sides previously met in a warm-up match for the Proteas ahead of the World Test Championship final.\n\nThey will be led by long-standing skipper,Craig Ervine, while leg spinner, Vincent Masekesa has also been recalled.\n\nZimbabwe are bolstered by the return of pacer Trevor Gwandu, who was injured on the tour of England.\n\nUncapped pacer Kundai Matigimu earns his maiden Test call-up, while Prince Masvaure and Takudzwanashe Kaitano return to strengthen the top-order alongside Brian Bennett.\n\nBlessing Muzarabanileads the pace attack, with Sean Williams stabilising the middle-order in the two-Test series.\n\nZimbabwe Squad v South Africa:\n\nCraig Ervine (Captain), Brian Bennett, Tanaka Chivanga, Trevor Gwandu, Takudzwanashe Kaitano, Wessly Madhevere, Clive Madande, Vincent Masekesa, Wellington Masakadza, Prince Masvaure, Kundai Matigimu, Blessing Muzarabani, Newman Nyamhuri, Tafadzwa Tsiga, Nicholas Welch, Sean Williams\n\nFirst Test:June 28 to July 2\n\nSecond Test:July 6 to July 10\n\nBoth Tests are set to be played at the Queens Sports Club in Bulawayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19193111/matigimu.jpeg",
            "description": "<p>ICC Zimbabwe and South Africa will face off in a two-match Test series, starting June 28 in Bulawayo. Zimbabwe have named their squad of 16 players to face World Test Championship 2025 winners, South Africa in a two-match Test series at home, beginning later this month. The sides previously met in a warm-up match for the Proteas</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uncapped-pacer-in-zimbabwe-squad-to-face-the-proteas/\">Uncapped pacer in Zimbabwe squad to face the Proteas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "20 Jun 2025"
        },
        {
            "title": "Government unveils Event-Based Surveillance guidelines",
            "url": "https://www.newzimbabwe.com/government-unveils-event-based-surveillance-guidelines/",
            "content": "By Staff Reporter\n\nThe Health Ministry, in partnership with its development partners, has launched Zimbabwes National Event-Based Surveillance Guidelines in a bid to improve efficacy in preparing for hazards that threaten public health.\n\nThe Event-Based Surveillance (EBS) presents a shift from passive reaction to proactive preparedness.\n\nIt comprises the use of Public Health Emergency Operations Centres, toll-free hotlines, and community engagement platforms to build a surveillance ecosystem that is people-centred.\n\nIt will enable public health stakeholder to identify warning signs at their earliest possible moment, enabling preparedness.\n\nSpeaking at the launch of the event, Health Minister Douglas Mombeshora said early action becomes a tool of prevention.\n\nIt represents a culture of vigilance.\n\nA system where every signal matters, whether it comes from a hospital Ward, a village clinic, a local rumour, or a message shared online.\n\nIn this system, timely information becomes a tool of protection and early action becomes a tool of prevention.\n\nZimbabwe, like many of our sister countries across the continent, has not been spared from the devastating effects of disease outbreaks, both known and emerging.\n\nThese experiences have taught us a vital truth in public health: speed saves lives, he said.\n\nIn this initiative government partnered with the Africa CDC, the World Health Organisation, UNICEF, among other partners who provided technical and financial support.\n\nMombeshora urged partners to translate the policy into practice to realise intended results.\n\nIt means strengthening our laboratories, capacitating our call centres, and ensuring rapid coordination across all levels of government and community structures.\n\nRegional Program Lead Africa CDC, Batsirai Mbodza, said, At Africa CDC, we firmly believe that early detection saves lives.\n\nWe know that health threats know no borders, whether from infectious diseases, environmental hazards, or other emergencies, the ability to pick up signals quickly and respond effectively is what stands between containment and crisis.\n\nWHO Emergencies Team Lead Lincoln Charimari said they are committed to working with the government to strengthen surveillance, a position also seconded by UNICEF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Staff Reporter The Health Ministry, in partnership with its development partners, has launched Zimbabwe’s National Event-Based Surveillance Guidelines in a bid to improve efficacy in preparing for hazards that threaten public health. The Event-Based Surveillance (EBS) presents a shift from passive reaction to proactive preparedness. It comprises the use of Public Health Emergency Operations</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-unveils-event-based-surveillance-guidelines/\">Government unveils Event-Based Surveillance guidelines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "20 Jun 2025"
        },
        {
            "title": "Zimbabwe’s gold reserves reach 3.4 metric tons, Mnangagwa inspects RBZ vaults",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-reserves-reach-3-4-metric-tons-mnangagwa-inspects-rbz-vaults/",
            "content": "By Alois Vinga\n\nZimbabwes gold reserves have grown to 3.4 metric tons to back the Zimbabwe Gold (ZiG) currency, introduced in April 2024.\n\nPresident Emmerson Mnangagwa inspected the Reserve Bank of Zimbabwes (RBZ) gold vaults on Thursday, reaffirming the administrations commitment to strengthening the currencys fundamentals through mineral-backed reserves.\n\nThe RBZ aims to increase its gold holdings to 5 metric tons by year-end.\n\nSpeaking after the tour, President Mnangagwa said the growing reserves are essential for maintaining currency stability and building a resilient economic framework.\n\nThis milestone is a direct result of the policy decision made two years ago to accumulate gold reserves as a foundation for a stable and sovereign national currency, he said.\n\nMnangagwa described the reserves policy as a long-term resilience measure and a central pillar of Zimbabwes ongoing economic reform agenda.\n\nThe government has also introduced reforms to formalise the gold sector, boost production, and curb smuggling, aiming to ensure mineral wealth contributes directly to national development.\n\nRBZ Governor John Mushayavanhu stated that current reserves are sufficient to support the ZiG in circulation, attributing the currencys recent stability to fiscal discipline and tight monetary policy.\n\nThe ZiG has remained relatively stable since its launch, a trend recognised by the International Monetary Fund, which this week praised Zimbabwes macroeconomic management and inflation control.\n\nThe gold accumulation programmebased on local purchases and refined production stored at the central bankhas become a core feature of Zimbabwes monetary strategy. RBZ officials noted that bolstering gold reserves not only underpins the currency but also enhances resilience to global financial instability.\n\nAs geopolitical uncertainty rises, many countries are turning to gold as a stable asset. Zimbabwe, as a significant gold producer, is well positioned to follow this global trend, a central bank official said.\n\nThe initiative reflects broader international patterns, with countries such as China, Russia and Turkey also increasing their gold holdings to hedge against inflation and currency fluctuations.\n\nAccording to official figures, Zimbabwe produced more than 30 tonnes of gold in 2024, with a growing share retained by the RBZ under the reserve accumulation strategy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19203358/ed-mushayavanhu-gold-.jpeg",
            "description": "<p>By Alois Vinga Zimbabwe’s gold reserves have grown to 3.4 metric tons to back the Zimbabwe Gold (ZiG) currency, introduced in April 2024. President Emmerson Mnangagwa inspected the Reserve Bank of Zimbabwe’s (RBZ) gold vaults on Thursday, reaffirming the administration’s commitment to strengthening the currency’s fundamentals through mineral-backed reserves. The RBZ aims to increase its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-reserves-reach-3-4-metric-tons-mnangagwa-inspects-rbz-vaults/\">Zimbabwe’s gold reserves reach 3.4 metric tons, Mnangagwa inspects RBZ vaults</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "20 Jun 2025"
        },
        {
            "title": "Dictatorship by-laws – opposition MPs push back against ZANU PF’s move for National Ideology",
            "url": "https://www.newzimbabwe.com/dictatorship-by-laws-opposition-mps-push-back-against-zanu-pfs-move-for-national-ideology/",
            "content": "By Darlington Gatsi\n\nPARLIAMENT is divided over the motion for Zimbabwe to adopt a legal framework for a National Ideology, which opposition legislators have condemned as the ZANU-fication of the country, warning it could lead to the suppression of government critics.\n\nRecently, ZANU PF Member of Parliament (MP) Joseph Mapiki tabled a motion for the National Assembly to debate the adoption of a national ideology across Zimbabwean society.\n\nAccording to Mapiki, the National Ideology would entrench patriotism and Zimbabwean identity.\n\nHowever, the proposal has angered opposition legislators, who fear the legal framework could be used to restrict democratic freedoms.\n\nCitizens Coalition for Change (CCC) MP Lynnette Karenyi-Kore argued that if passed, the law would be weaponised against opposition members.\n\nOur Constitution guarantees freedom of thought, opinion and expression. To enforce patriotism legally would infringe upon these basic rights, Madam Speaker.\n\nCreating a legal framework compelling ideological loyalty undermines democracy and pluralism through thriving on diversity of opinion. The dangers of institutionalising ideology are as follows: An ideology institution sounds disturbing.\n\nHistory has shown us that once States begin controlling ideology, State abuse, censorship and suppression of dissent follow. Decisiveness and weaponisation risk, it is also going to be one of the challenges, said Karenyi.\n\nZANU PF is pushing to nationalise the ideological school concept it established within its party. The ruling party has previously proposed enrolling civil servants into the Herbert Chitepo School of Ideology.\n\nThe National Ideology would also be incorporated into the school curriculum, with patriotism as a core component of education from primary to tertiary level.\n\nCCC legislator Gladys Hlatywayo warned that the proposal risks being hijacked by ZANU PFs interests rather than serving the nation.\n\nTerms such as national interest are often euphemisms for advancing party interest and the interest of the ruling class or ruling elite. In this case, legislating patriotism might be legislating the zanufication of the State.\n\nThere is also a danger that legislating patriotism can erode civil liberties and restrict freedoms of speech, assembly and association. These civil liberties are at the heart of any democratic society and encoded in our own Bill of Rights, in our own Constitution, and must therefore be protected and protected rather than taken away by opaque, divisive and undemocratic laws under the guise of legislative patriotism.\n\nThe proposed prayer by the mover of the motion also has a chilling effect on public discourse Madam Speaker. Open, honest public debate that is so instrumental to democratic development might be discouraged as fear grips the country, said Hlatywayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/08063728/karenyi.jpg",
            "description": "<p>By Darlington Gatsi PARLIAMENT is divided over the motion for Zimbabwe to adopt a legal framework for a National Ideology, which opposition legislators have condemned as the “ZANU-fication” of the country, warning it could lead to the suppression of government critics. Recently, ZANU PF Member of Parliament (MP) Joseph Mapiki tabled a motion for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dictatorship-by-laws-opposition-mps-push-back-against-zanu-pfs-move-for-national-ideology/\">Dictatorship by-laws – opposition MPs push back against ZANU PF’s move for National Ideology </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "20 Jun 2025"
        }
    ]
}