{
    "news": [
        {
            "title": "Take positions – government says over a year after announcing Mutasa Airport plans",
            "url": "https://www.newzimbabwe.com/take-positions-government-says-over-a-year-after-announcing-mutasa-airport-plans/",
            "content": "By Staff Reporter\n\nMORE than a year after announcing plans to construct an International Airport in Manicaland, government is still inviting investors for the take-off of the project.\n\nLast year, government announced plans to construct an airport in Mutare which is envisagedto be vital for the Manicaland provincestourism sites as wellas the mining sector.\n\nThe project had been touted as a game changer in exposing the tourist destinations in Manicaland.\n\nAfter identifying an area in Mutasa, government indicated that a feasibility study would have been completed by theend of the first quarterof this year.\n\nPosting on his X handle under the pseudonym Jamwanda, Presidential Spokesperson, George Charamba said investors should take positions for the airport project.\n\nBy the way, a new International Airport has been planned for Manicaland in the Mutasa Area. Those keen to invest must take forward positions, said Charamba.\n\nCharambas sentiments follow an announcement by Air Zimbabwe that it would be introducing the Mutare flights during the Sanganai/Hlanganani World Travel Expo, which will run from September 10 to 12.\n\nThe flights will provide a seamless travel for tourists to visit attractions in Manicaland Province.\n\nIn a statement, Air Zimbabwe Chief Executive Edmund Makona indicated that the flights might be a common feature after the Expo.\n\nThis operation is a pilot project. We are testing the market, understanding demand, and exploring the long-term viability of this route. If the demand is there, Air Zimbabwe will be ready to make it a permanent feature of our network, said Makona.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/20170847/The-AirZimbabwe-B777.jpg",
            "description": "<p>By Staff Reporter MORE than a year after announcing plans to construct an International Airport in Manicaland, government is still inviting investors for the take-off of the project. Last year, government announced plans to construct an airport in Mutare which is envisaged to be vital for the Manicaland province’s tourism sites as well as the mining sector. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/take-positions-government-says-over-a-year-after-announcing-mutasa-airport-plans/\">Take positions – government says over a year after announcing Mutasa Airport plans </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "02 Sep 2025"
        },
        {
            "title": "Putin says he reached ‘understandings’ with Trump over end of Ukraine war",
            "url": "https://www.newzimbabwe.com/putin-says-he-reached-understandings-with-trump-over-end-of-ukraine-war/",
            "content": "BBC\n\nRussian President Vladimir Putin says he reached understandings with US President Donald Trump over the end of the Ukraine war at their meeting in Alaska last month.\n\nBut he did not say whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky brokered by Trump, who had apparently given Monday as a deadline for Putins response.\n\nSpeaking during a summit in China, Putin continued to defend his decision to invade Ukraine, once again blaming the West for the war.\n\nFollowingthe Alaska meeting, US special envoy Steve Witkoff said Putin had agreed to security guarantees for Ukraine as part of a potential future peace deal, though Moscow has yet to confirm this.\n\nPutin was speaking in Tianjin at the Shanghai Co-operation Organisation summit, where he met Xi Jinping and Narendra Modi.\n\nHe thanked the Chinese and Indian leaders for their support and their efforts to facilitate the resolution of the Ukrainian crisis.\n\nChina and India are the biggest buyers of Russian crude oil, attracting criticism from the West that they are propping up the Russian economy which has been battered by the war effort.\n\nIn his speech, Putin also said that the understandings reached at his meeting with Trump in Alaska were I hope, moving in this direction, opening the way to peace in Ukraine.\n\nAt the same time, he reiterated his view that this crisis wasnt triggered by Russias attack on Ukraine, but was a result of a coup in Ukraine, which was supported and provoked by the West.\n\nHe also attributed the war to the Wests constant attempts to drag Ukraine into Nato.\n\nThe Russian president has consistently opposed the idea of Ukraine joining the Western military alliance. But both this claim  and that the war was provoked  have been repeatedly rebuffed by Western allies.\n\nIt was in 2014 that Putin seized Crimea and Russian proxies grabbed part of eastern Ukraine. Years later, in February 2022,Putin then ordered Russias full-scale invasion of Ukraine.\n\nPutins latest comments come days after Russia launched itssecond biggest aerial attackon Ukraine in the war.\n\nOn Friday, French President Emmanuel Macron said that Putin faced a Monday deadline set by Trump to agree to peace talks with Zelensky.\n\nIf the Russian leader does not agree, it will show again President Putin has played President Trump, said Macron.\n\nBut in an interview with CNN, on 22 August, Trump himself again gave Putin a couple of weeks to give a response before the US takes action, in the latest of a series of ultimatums and deadlines he has issued to the Russian leader.\n\nTrump had previously said he could solve the Ukraine war in one day.\n\nFollowing his meeting with Putin last month, Trump dropped a demand for a ceasefire and called instead for a permanent peace deal.\n\nHe also met Zelensky along with top European leaders who paid an urgent visit to Washington DC.\n\nTrump insisted there would be no going into Nato by Ukraine as part of a peace deal.\n\nBut he also hinted there would be security guarantees, saying Europe was the first line of defence and that the US would be involved.\n\nWell give them good protection, he said, though he clarified it would not mean sending US troops to Ukraine.\n\nUS Special Envoy Witkoff also told CNN thatPutin had agreed to security guarantees.\n\nHe said this would see the US and Europe effectively offer Article 5-like language to cover a security guarantee, referring to the Nato clause which states that member states should defend another member that has come under attack.\n\nZelensky has said he expected a framework for security guarantees to be set out on paper as soon as this week.\n\nBut last Friday, Russia criticised Western proposals as one-sided and clearly designed to contain Russia, adding that it turned Kyiv into a strategic provocateur.\n\nRussian attacks on Ukraine have continued. Last Thursday, Moscow fired 629 drones and missiles at Kyiv, killing 23 people in one of the biggest aerial assaults of the war so far, prompting outrage from European leaders.\n\nGermany and France have since pledged to put pressure on Russia to agree to a deal.\n\nMeanwhile, Zelensky hasrejected proposals for a buffer zonewith Russia as part of a peace deal.\n\nHe has accused Russia of not being ready for diplomacy and seeking ways to postpone the end of the war.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26183936/Russian-President-Vladimir-Putin.png",
            "description": "<p>BBC Russian President Vladimir Putin says he reached “understandings” with US President Donald Trump over the end of the Ukraine war at their meeting in Alaska last month. But he did not say whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky brokered by Trump, who had apparently given Monday as a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/putin-says-he-reached-understandings-with-trump-over-end-of-ukraine-war/\">Putin says he reached ‘understandings’ with Trump over end of Ukraine war</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "02 Sep 2025"
        },
        {
            "title": "What is at stake in Malawi’s elections?",
            "url": "https://www.newzimbabwe.com/what-is-at-stake-in-malawis-elections/",
            "content": "BBC\n\nThe people of Malawi are set to vote for their next leader, following a turbulent five years involving economic turmoil, natural disasters and the shock death of the nations vice-president.\n\nCurrent President Lazarus Chakwera is vying for a second term, his main rival being Peter Mutharika, an octogenarian who has also held office in the southern African nation once before.\n\nTransparency and fairness are key talking points ahead of the vote, given that the result of Malawis 2019 presidential election was overturned in the courts due to widespread irregularities.\n\nPolling day is Tuesday 16 September 2025.\n\nThe 7.2 million registered voters will be taking part in three elections:\n\nAFP/Getty Images Lazarus Chakwera (L) and Peter Mutharika (R) have faced each other at the ballot before\n\nAmong the 17 hopefuls there are two clear front-runners.\n\nChakwera and Mutharika will square off against each other at the polls for the fourth time  though the third time ended up not counting.\n\nMutharika first defeated Chakwera in 2014, but when he was declared winner over Chakwera in the next election in 2019 the result was annulled. Chakwera won the re-run the following year.\n\nLazarus Chakwera  Malawi Congress Party (MCP)\n\nChakwera, a former theology lecturer and preacher, had no political experience when he emerged as leader of the MCP in 2013.\n\nWhen he ran for president in 2014 he was unsuccessful, but in 2020 he triumphed,beating the incumbent, Mutharika, in that unprecedented re-run.\n\nChakweras time in office has been marred by economic turmoil and allegations of corruption. The 70-year-old did, however, reintroduce train services in Malawi for the first time in over three decades. He has also overseen major road construction across the country.\n\nPeter Mutharika  Democratic Progressive Party (DPP)\n\nMutharika, an 85-year-old former lawyer and law lecturer, led Malawi from 2014 to 2020.\n\nHe is the brother of the late President Bingu wa Mutharika, who died in office in 2012.\n\nLike Chakwera, Mutharika is also burdened by corruption allegations and links to economic crises. However, his supporters would argue that the current high inflation rate (around 27%) is proof that Mutharika managed the economy better than his successor.\n\nMutharikas age may count against him this election  speculation about his health is rife, especially as he has rarely been seen out in public during the campaign period.\n\nOther contenders garnering attention are former presidentJoyce Banda(Peoples Party), current Vice-PresidentMichael Usi(Odya Zake Alibe Mlandu)and former reserve bank governorDalitso Kabambe(UTM).\n\nThe economy\n\nMalawi has long been one of the poorest countries in the world, butthe past few years have been especially punishing.\n\nThe country wasdevastated by Cyclone Freddythat killed hundreds of people in 2023, then a drought swept across southern Africa the following year. Food prices skyrocketed due to a short supply of crops, pushing many Malawians into extreme poverty.\n\nEconomists also put Malawis current inflation problems partly down to the shortage of foreign currencies  known as forex  in the banks.\n\nIn addition, Malawi has beenforced to devalue its currencyand was recently crippled by fuel shortages and nationwide power outages.\n\nCorruption\n\nWhen Chakwera came to power, he vowed to to clear the rubble of corruption that has long plagued Malawian politics. His administration says it has excelled in this area, but critics  including the influential Catholic Church  say this is not the case.\n\nScepticism was sparked last year when the director of public prosecutions dropped corruption charges against high-profile figures.\n\nAdditionally, Malawis anti-graft agency, the Anti-Corruption Bureau (ACB), has been without a director since former boss Martha Chizuma left more than a year ago.\n\nTo some, the failure to appoint a new head actively hinders the fight against corruption.\n\nBut previous administrations have also been dogged by graft allegations. For instance, the ACBaccused Mutharika of receiving a kickback from a contractto supply food to the police  he denied any wrongdoing.\n\nBandas reputation was dented by a scandal dubbed cashgate which happened under her watch. She was cleared by the ACB of any wrongdoing.\n\nThe former vice-presidents death\n\nIn June last year, Vice-PresidentSaulos Chilima died in a plane crash. Popular with the youth, Chilima led the UTM party and could have been a key contender in the upcoming elections, especially as he had fallen out with the president.\n\nAlthough two investigations  one carried out by Germanys aviation accidents agency and another by a Malawi government-appointed commission  did not find evidence of foul play, some Malawians remain suspicious of the authorities.\n\nOpposition parties have been fuelling this scepticism during their campaigns, referring to Chakweras party as the Chikangawa Party (Chikangawa Forest being the site of the plane crash).\n\nAFP/Getty Images Hundreds in Malawi lost their lives to Cyclone Freddy\n\nMalawi was governed by the MCP from its independence in 1964 until the countrys first multi-party poll in 1994.\n\nSince the shift from a one-party state, the United Democratic Front, the DPP, the Peoples Party and the MCP have all enjoyed stints in power.\n\nChakweras victory with the MCP in 2020 was one of the most significant moments in the countrys political history.\n\nA general election had taken place the year before and Mutharika was declared the winner.\n\nHowever,the Constitutional Court annulled the election, saying there had been widespread tampering, including the use of Tipp-Ex correction fluid on results sheets.\n\nJudges ordered a re-run for 2020, and Chakwera won with 59% of the vote after having teamed up with Chilima.\n\nAlthough Mutharika branded the re-run unacceptable, the Constitutional Court gained international acclaim for safeguarding democracy and refusing to be influenced by presidential power.\n\nFollowing the controversy of the 2019 election, Malawi implemented a new system, where a candidate must gain more than 50% of the total votes to win the presidency in the first round.\n\nThere is a strong possibility that this years candidates will not reach this threshold in the initial poll, meaning a run-off election will have to be held.\n\nThe MCP and DPP will likely try to bring other, smaller parties on board in order to secure a majority in the second time round.\n\nThe courts actions following the 2019 vote have given some Malawians faith in the electoral process.\n\nHowever, over the past months, a number or civil society organisations and opposition parties have accused the electoral commission of favouring the MCP, alleging that its top management has links to the governing party. The commission has firmly denied being biased.\n\nA protest in June calling for the resignation of the commissions top officials was attacked by masked, machete-wielding men, leading to concerns about freedom of expression in the run-up to the election.\n\nThe assault was not an isolated incident  there have been numerous reports of politically motivated violence ahead of the general election.\n\nThe outcome of the presidential election will be announced by the end of 24 September.\n\nThe parliamentary results will be announced by the end of 30 September.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01184956/malawi-election.webp",
            "description": "<p>BBC The people of Malawi are set to vote for their next leader, following a turbulent five years involving economic turmoil, natural disasters and the shock death of the nation’s vice-president. Current President Lazarus Chakwera is vying for a second term, his main rival being Peter Mutharika, an octogenarian who has also held office in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-is-at-stake-in-malawis-elections/\">What is at stake in Malawi’s elections?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "02 Sep 2025"
        },
        {
            "title": "Kaya fires Sol Phenduka over ‘misogynistic remarks’ about Minnie Dlamini",
            "url": "https://www.newzimbabwe.com/kaya-fires-sol-phenduka-over-misogynistic-remarks-about-minnie-dlamini/",
            "content": "SowetanLive\n\nKaya 959 has officially fired radio personality Sol Phenduka as co-host of the breakfast show after misogynistic remarks were made about media personality Minnie Dlamini onPodcast and Chill with MacG.\n\nPhenduka was the co-host of #SizTheWorld breakfast show with Sizwe Dhlomo.\n\nIn a lengthy statement released on Monday, Kaya 959 acting managing executive, Dave Tiltmann, confirmed that the station had terminatedPhendukas contract with immediate effect after an internal review.\n\nKaya 959 cannot and will not condone comments made on the MacG Vodcast, where Sol Phenduka is an integral part of the presenting team, saidTiltmann.\n\nMisogynistic remarks made about actress Minnie Dlamini were unacceptable and inconsistent with respect owed to women. As a content provider of our flagship breakfast show, his alignment with comments made on the vodcast does not reflect who we are as a station, nor what our listeners expect of us.\n\nPhenduka was placed under suspension on August 20 pending the outcome of an internal process.\n\nTiltmann added that the incident was a further material breach of his Independent Contract, despite Sols written assurance to Kaya management in June 2023 that such conduct would not recur, while acknowledging his responsibilities as a representative of the station, apologising to the Kaya family and stakeholders, and committing to upholding the standards expected of him.\n\nTiltmann reiterated Kaya 959s values are not open to compromise.\n\nTrust, integrity, accountability, respect, and inclusivity are the foundations of Kaya 959. They guide everything we do on air, online and off air. We are answerable to our listeners, and when conduct falls short, we act decisively, Tiltmann said.\n\nTiltmann further explained that the decision followed a process aligned with Kaya 959s Independent Contractor Agreement, which allows for immediate termination in cases where the actions of an individual with a public profile bring the station into disrepute. Kaya 959 remains committed to maintaining a safe, respectful, and inclusive working environment, supported by rigorous broadcasting standards and a culture of accountability across all platforms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20183902/sol-phenduka.jpg",
            "description": "<p>SowetanLive Kaya 959 has officially fired radio personality Sol Phenduka as co-host of the breakfast show after “misogynistic remarks” were made about media personality Minnie Dlamini on Podcast and Chill with MacG. Phenduka was the co-host of #SizTheWorld breakfast show with Sizwe Dhlomo. In a lengthy statement released on Monday, Kaya 959 acting managing executive, Dave</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kaya-fires-sol-phenduka-over-misogynistic-remarks-about-minnie-dlamini/\">Kaya fires Sol Phenduka over ‘misogynistic remarks’ about Minnie Dlamini</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "02 Sep 2025"
        },
        {
            "title": "Foreign national arrested for stealing US$16,000 from motor vehicle",
            "url": "https://www.newzimbabwe.com/foreign-national-arrested-for-stealing-us16000-from-motor-vehicle/",
            "content": "By Staff Reporter\n\nDETECTIVES in Harare have arrested a foreign national for allegedly stealing US$16,000 from a parked motor vehicle while the owner was shopping.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.On August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.The suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.The suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nOn August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.\n\nThe suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nThe suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.\n\nThe detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nThe detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/13180829/Crime.jpg",
            "description": "<p>By Staff Reporter  DETECTIVES in Harare have arrested a foreign national for allegedly stealing US$16,000 from a parked motor vehicle while the owner was shopping. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “On August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/foreign-national-arrested-for-stealing-us16000-from-motor-vehicle/\">Foreign national arrested for stealing US$16,000 from motor vehicle </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "02 Sep 2025"
        },
        {
            "title": "Globe-trotting Mnangagwa to attend Chinese war commemorations",
            "url": "https://www.newzimbabwe.com/globe-trotting-mnangagwa-to-attend-chinese-war-commemorations/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa is expected to arrive in China this Monday to attend commemorations to mark the 80th Anniversary of the Victory in the Chinese Peoples War of Resistance Against Japanese Aggression and World Anti-Fascist War set for Wednesday.\n\nChina is Mnangagwas latest foreign destination to cap the month of August that saw the Zanu PF leader clocking hours on end while airborne.\n\nOn August 20, Mnangagwa travelled to Tokyo, Japan, where he met with Japanese Prime Minister Shigeru Ishiba on the sidelines of TICAD 9. He reportedly discussed strengthening cooperation in trade, health, agriculture, mining, investment, technologyincluding milestones like ZIMSAT1and reaffirmed commitment to deepen ZimbabweJapan relations.\n\nOnly last week, the 82-year-old Zanu PF leader met with His Holiness Pope Leo XIV at the Vatican, where they reflected on the Catholic churchs vital role in Zimbabwes schools, hospitals, and social services, and shared views on peace and justice in todays world.\n\nBefore the jetleg could subside, Mnangagwa, whose initial days in office were toned around austerity to cut on spending on foreign travel, he was off to the East this Sunday.\n\nAccording to State media, Mnangagwa is expected to join fellow invited Heads of State and Government from 26 countries, including Russian President Vladimir Putin, at Tiananmen Square for a massive military parade among other activities hosted by China for the commemorations.\n\nThe Chinese Peoples War of Resistance Against Japanese Aggression (1931-1945) was the first to break out and lasted the longest in the World Anti-Fascist War.\n\nAccording to reports, in 14 years, 35 million Chinese were killed or wounded. Japan officially surrendered on September 2, 1945 by signing the Instrument of Surrender.\n\nIn 2014, Chinas national legislature designated September 3 as Victory Day of its War of Resistance.\n\nA year later, the country held its first-ever large-scale parade at Tiananmen Square to mark the occasion.\n\nState media quoted Zimbabwes Ambassador to China, Abigail Shoniwa, saying President Mnangagwa, who left the Vatican last night, is one of a few African leaders invited to the event, signalling deep ties between Harare and Beijing.\n\nThe Presidents arrival is awaited and we are very excited, he is coming at the invitation of his counterpart, President Xi Jinping and he will be one of quite a number of Heads of State that are coming.\n\nPerhaps, I can take the opportunity to add that he is one of the very few African Heads of State coming, Shoniwa told State media.\n\nWhile in China, Mnangagwa is billed to hold bilateral talks with President Xi on deepening co-operation across various sectors.\n\nThe octogenarian leader will also dialogue with company executives with business interests in Zimbabwe.\n\nChina has supported Zimbabwes various local projects, including Hwange Units 7 and 8 expansion, Kariba South Hydro Power Extension, expansion of the Robert Gabriel Mugabe and Victoria Falls International Airports.\n\nChina is Zimbabwes largest source of investment with cumulative investments exceeding US$4,4 billion, including US$400 million in the past year alone. In 2024, bilateral trade surged to US$3,8 billion with 24 percent year-on-year growth.\n\nLast month, Mnangagwa presided over the signing ceremony of a US$55 million Economic and Technical Co-operation Agreement between Zimbabwe and China in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter  PRESIDENT Emmerson Mnangagwa is expected to arrive in China this Monday to attend commemorations to mark the 80th Anniversary of the Victory in the Chinese People’s War of Resistance Against Japanese Aggression and World Anti-Fascist War set for Wednesday. China is Mnangagwa’s latest foreign destination to cap the month of August that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/globe-trotting-mnangagwa-to-attend-chinese-war-commemorations/\">Globe-trotting Mnangagwa to attend Chinese war commemorations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "02 Sep 2025"
        }
    ]
}