{
    "news": [
        {
            "title": "Government appeals for hospital beds to furnish drug rehabilitation centres",
            "url": "https://www.newzimbabwe.com/government-appeals-for-hospital-beds-to-furnish-drug-rehabilitation-centres/",
            "content": "By Anna Chibamu\n\nLOCAL Government ministry permanent secretary, John Basera is appealing for donations in the form of hospital beds for drug rehabilitation centres countrywide.\n\nAccording to a letter addressed to provincial medical directors, district medical officers, private hospitals, corporates, faith-based organisations and civil society, Basera said most rehabilitation institutions are in dire need of hospital admission beds.\n\nThe country has sixty-three (63) facilities for drug rehabilitation and livelihood centres that have been identified to date.\n\nThe Resource Mobilization Pillar in the National Committee on Drug and Substance Abuse is mandated to seek, coordinate and pool resources together for all seven (7) pillars so as to enable them to manage the menace of drug and substance abuse in Zimbabwe.\n\nMost of the availed rehabilitation institutions are in dire need of hospital admission beds.\n\nThe National Committee on Drug and Substance Abuse is kindly appealing to all private and government institutions to donate beds which are not in use at their facilities, read part of the letter.\n\nCases of drug and substance use have been on the increase over the past few years with most families affected.\n\nTo demonstrate the prevalence of the scourge, recently there were reports of the expulsion of eight (8) girls from Dominican Convent High School over allegations of violating the schools anti-drug policy.\n\nMost government institutions do not have enough medical equipment and even such consumables as gloves and syringes are not found in major referral centres or hospitals.\n\nOn drug and substance use, government has put in place policies to curb the misuse, but not much has been achieved as shown by a surge in cases reported or arrests made last year.\n\nArrests of drug and substance use culprits have also surged in 2024, with close to 2,400 people said to have been taken into custody.\n\nOfficials say economic difficulties are hampering efforts to curb the problem.\n\nFines ranging from $30 to $400 or imprisonment not exceeding two years for any business convicted of selling illicit drugs have been imposed by Cabinet, Information minister Jenfan Muswere told the media recently.\n\nIn addition to the 2,373 people who were arrested in 2024, 48 bases in six provinces were raided and dismantled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22144959/Empty-hospital-ward-1.jpg",
            "description": "<p>By Anna Chibamu LOCAL Government ministry permanent secretary, John Basera is appealing for donations in the form of hospital beds for drug rehabilitation centres countrywide. According to a letter addressed to provincial medical directors, district medical officers, private hospitals, corporates, faith-based organisations and civil society, Basera said most rehabilitation institutions are in dire need of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-appeals-for-hospital-beds-to-furnish-drug-rehabilitation-centres/\">Government appeals for hospital beds to furnish drug rehabilitation centres</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "‘We are confident of defending PSL title despite player mass exodus’— says Simba Bhora",
            "url": "https://www.newzimbabwe.com/we-are-confident-of-defending-psl-title-despite-player-mass-exodus-says-simba-bhora/",
            "content": "By Sports Reporter\n\nFOLLOWING a mass exodus which saw 13 players leaving the club, reigning Premier Soccer League (PSL) champions, Simba Bhora, are confident of defending the title this coming season.\n\nThe Shamva-based side did not only lose players as team head coach Tonderai Ndiraya together with his technical team also deserted the side.\n\nDespite losing a number of its key players including team captain and 2024 Castle Lager PSL Soccer Star of The Year Walter Musona, club chairman Isiah Mupfurutsa is of the belief that they can still defend the title.\n\nWe are the defending champions, and we will be one of the teams to beat.\n\nWe are not going to surrender the title rather we want to fight and make sure we defend it, said Mupfurutsa.\n\nThe Go Buju Go side has made a number of new acquisitions to try and cover the void with new signings Donald Mudadi from Dynamos, Liberty Chakoroma from Manica Diamonds and Blessed Ndereki from Yadah FC.\n\nAs replacement to departed coach Ndiraya, the club has appointed former Highlanders and Dynamos assistant coach Joel Lupahla.\n\nWith a task to compete in the CAF Champions League lying ahead, Mupfurutsa is basing on the experience of incoming players whom he said are groomed for the task.\n\nIts not going to be an easy season because we will be fighting on two fronts, that is the local league and CAF Champions League.\n\n So, in our replacements we have taken note of this, and we are bringing players with experience and quality to meet these demands, Mupfurutsa added.\n\nSimba Bhora were promoted into the premiership in 2023 and made history last year after becoming the first team from Mashonaland Central to win the league title in Zimbabwean football.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09045209/GdF2D7NW0AAmBht-1.jpeg",
            "description": "<p>By Sports Reporter  FOLLOWING a mass exodus which saw 13 players leaving the club, reigning Premier Soccer League (PSL) champions, Simba Bhora, are confident of defending the title this coming season. The Shamva-based side did not only lose players as team head coach Tonderai Ndiraya together with his technical team also deserted the side. Despite</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-confident-of-defending-psl-title-despite-player-mass-exodus-says-simba-bhora/\">‘We are confident of defending PSL title despite player mass exodus’— says Simba Bhora </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "Harare’s clogged sewer systems pose headaches as cholera outbreak looms",
            "url": "https://www.newzimbabwe.com/harares-clogged-sewer-systems-pose-headaches-as-cholera-outbreak-looms/",
            "content": "By Staff Reporter\n\nBURST sewer systems have for years been a problem in most high-density suburbs of Harare, especially in Glenview and Budiriro, which are two cholera hotspots.\n\nResearch recently made revealed that the major cause of diarrheal diseases being treated in Harare is drinking contaminated water due to broken sewer systems.\n\nZimbabwe is already trying to curb a cholera outbreak as 104 positive cases and one death have been recorded in Mashonaland Central province from December to date.\n\nIn an effort to curb the water borne disease, government, together with City of Harare (CoH) went on a tour of Mbare high density suburb, which is another potential hotspot.\n\nAfter coming across several streams of raw sewer in Mbare, Health and Child Care Deputy Minister, Sleiman Kwidini said there is urgent need for government to work closely with the local authority to fix the compromised sewer systems.\n\nWe have seen that sewer problems in this area are a big problem.\n\nSo, we have agreed to work hand in hand with the CoH to help in addressing this problem.\n\nWe have agreed that we will come up with a team combining people from both Ministry of Health and CoH so as to see how best we can tackle these ever-growing sewer problems.\n\nThe only way we can be successful in defeating cholera is by solving such problems like poor sewer systems, said Kwidini.\n\nSpeaking during the same tour, CoH Health Services Director, Prosper Chonzi, said solving sewer problem in the capital is beyond council hence, there is a need for all stakeholders to come together and create a solution.\n\nWe need to put our hands together because cholera knows no political boundary.\n\nWe need government to support us in dealing with this problem, it should not be a CoH problem, everyone needs to come on board, and we fix this once and for all, said Chonzi.\n\nThe country recently witnessed a cholera outbreak, which ended May 2024, in which there were 88 confirmed deaths and 631 suspected deaths from 34,550 suspected cholera cases.\n\nZimbabwe experienced a devastating cholera crisis in 2008, which saw 4,200 people dying with more than 100,000 being infected.\n\nStatistics from research made during the time indicated that 60% of the cause of infections was poor sewer system in the hotspots.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/17041733/Matapi-sewage.jpg",
            "description": "<p>By Staff Reporter BURST sewer systems have for years been a problem in most high-density suburbs of Harare, especially in Glenview and Budiriro, which are two cholera hotspots. Research recently made revealed that the major cause of diarrheal diseases being treated in Harare is drinking contaminated water due to broken sewer systems. Zimbabwe is already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-clogged-sewer-systems-pose-headaches-as-cholera-outbreak-looms/\">Harare’s clogged sewer systems pose headaches as cholera outbreak looms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "Teachers’ union vows to push back ‘illegal’ setting of retirement age at 70",
            "url": "https://www.newzimbabwe.com/teachers-union-vows-to-push-back-illegal-setting-of-retirement-age-at-70/",
            "content": "By Staff Reporter\n\nAMALGAMATED Rural Teachers Union of Zimbabwe (ARTUZ) has vowed to fight government over what it terms illegal elevation of the retirement age.\n\nARTUZ president, Obert Masaraure said his organisation will not sit and relax whilst civil servants rights are trampled upon by President Emmerson Mnangagwas administration.\n\nThe elevation of the retirement age of civil servants is illegal on the front of the right to collective bargaining.\n\nIf you go through the Constitution of Zimbabwe, particularly Section 203 (i) (b), states that the conditions of service shall be fixed by the Commission but following through what is set out in Section 65 (v) were the right to bargaining so where a retirement age is part of the whole retirement package for the civil servants.\n\nThis cannot be unilaterally fixed by a bunch of people from the employers side wherever they meet in Cabinet or wherever they meet, we do not care, Masaraure said.\n\nHe added: As long as they have not engaged the employee side to then say, what is rational of this particular change, we find such a change both inappropriate and illegal.\n\nThat is why we are up against it.\n\nGovernment recently extended the retirement age from 45 years to 55 for police officers whilst the military will be allowed to retire at 65 from 50 with an allowance to get to 70 years.\n\nwe understand that the ruling elites are locked in power tussles. We however have a responsibility to fight for labour justice and right to education. Our responsibilities will not be shelved to allow factions of the ruling elites to settle their power issues. We will continue with the fight demanding urgent solutions to the questions of the day.\n\nWe are getting ready to push back against underpayment and the illegal elevation of the retirement age, Masaraure wrote on social media.\n\nDuring an interview with NewZimbabwe.com this Wednesday, Masaraure argued that factionalism had taken centre stage in the ruling Zanu PF party causing destructive decisions which do not take into consideration youths, who are supposed to be given a chance to occupy the few available jobs in the country.\n\nMost young graduates are unemployed as government amid government failure to create jobs for those churned out of universities and colleges yearly.\n\nWe look at the rate of unemployment of our young people and realise that this government cannot create jobs.\n\nWhy then do they want to keep old people occupying the little jobs that are there in the Republic, Masaraure queried.\n\nThere are issues to do with mental capacity of the person to say as we grow old, we get incapacitated. So why are we not giving the best brains; young people who are fresh graduates an opportunity to provide services to the people of Zimbabwe?\n\nWe need to build a strong State bureaucracy and that needs competent people who are highly energetic and young, but if we are going to be retaining our old friends in the interest of power retention, we are sabotaging the agenda of national development and unfortunately this is the path that has been chosen by the regime.\n\nWe will be protesting against it and rejecting it, and it will be reversed, Masaraure vowed.\n\nFundamentals such as the life expectancy of Zimbabweans which is now below 60 are some of the issues to include when a government changes laws or policies, said the trade unionist.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/25160906/Obert-Masaraure.jpg",
            "description": "<p>By Staff Reporter  AMALGAMATED Rural Teachers Union of Zimbabwe (ARTUZ) has vowed to fight government over what it terms “illegal elevation of the retirement age.” ARTUZ president, Obert Masaraure said his organisation will not sit and relax whilst civil servants’ rights are trampled upon by President Emmerson Mnangagwa’s administration. “The elevation of the retirement age</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teachers-union-vows-to-push-back-illegal-setting-of-retirement-age-at-70/\">Teachers’ union vows to push back ‘illegal’ setting of retirement age at 70</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "Go Beer Brewery to reopen after decade closure",
            "url": "https://www.newzimbabwe.com/go-beer-brewery-to-reopen-after-decade-closure/",
            "content": "By Staff Reporter\n\nGO Beer Brewery, a liquor manufacturing company located in Gweru, is set to reopen soon thereby creating 50 job opportunities.\n\nThe liquor undertaking concern run by City of Gweru was closed nearly a decade ago due to financial mismanagement that saw the company swimming in a staggering US$2.6 million debt.\n\nIn an interview, Gweru Mayor, Martin Chivoko said the reopening will boost Gwerus economy.\n\nWith the resuscitation of Go Beer Brewery, we are excited to announce that the brewery will create employment opportunities for at least 50 people for a start.\n\nThis is a significant boost to our local economy and will help stimulate economic growth, he said.\n\nThe premier also added that, Were thrilled to have partnered with Crest Street Industries to revive the brewery and restore it to its former glory.\n\nHe said the revival of Go Beer Brewery is crucial for the councils revenue generation which will also improve service delivery.\n\nWe put 23 hectares under winter wheat at the Go Beer Farm, which we are going to use as raw materials for the brewery. We aim to produce our own raw materials for the brewery to make the business viable, Chivoko told the media recently.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09042604/ytrgf55543.jpg",
            "description": "<p>By Staff Reporter  GO Beer Brewery, a liquor manufacturing company located in Gweru, is set to reopen soon thereby creating 50 job opportunities. The liquor undertaking concern run by City of Gweru was closed nearly a decade ago due to financial mismanagement that saw the company swimming in a staggering US$2.6 million debt. In an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/go-beer-brewery-to-reopen-after-decade-closure/\">Go Beer Brewery to reopen after decade closure</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "Incest monster Josef Fritzl who sired 7 children with daughter demands a house ‘with a basement’ if freed",
            "url": "https://www.newzimbabwe.com/incest-monster-josef-fritzl-who-sired-7-children-with-daughter-demands-a-house-with-a-basement-if-freed/",
            "content": "By Agencies\n\nJOSEF Fritzl has demanded a house with a basement if he is released from prison, as he continues to pursue an early release from prison.\n\nFritzl, 89, is demanding a house with a basement if he wins his freedom, as his lawyers try to use his dementia as a reason to secure his early release from prison.\n\nThe convicted rapist infamously fathered seven children with his daughter Elisabeth over 24 years, while entrapping her as a sex slave for 24 years in the basement of their Austria family home.\n\nSince he was sentenced to life imprisonment in 2009 he has been held in high-security psychiatric detention at Stein prison.\n\nBut because of his dementia, doctors might declare Austrias most famous prisoners unfit for imprisonment next year.\n\nHis lawyer, Astrid Wagner, told German press that every day he dreams of having his own house or apartment.\n\nMs Wagner told the Heute talk show that Fritzl doesnt care where exactly his life will be outside, though last year the criminal said he wanted to move to the UK and roam the highlands of Scotland.\n\nMs Wagner added that the 89-year-old no longer feels confident driving after so many years without practice, so he wants to live near a train connection.\n\nBut the main thing the rapist demanded was that the apartment or house must have a basement.\n\nThe eerie demand, considering that he imprisoned his daughter in a basement for 24 years, is apparently so he can store his files and documents.\n\nYou know, I have so many files, documents and memories, Fritzl said.\n\nIn fact, his cell is currently piled high with many folders and boxes filled with papers.\n\nLast year, public officials in Krems, a town West of Austrian capital Vienna, confirmed Fritzl will be placed under guardianship due to his declining mental state.\n\nThis means the court will appoint someone to make decisions on Fritzls behalf after he has been deemed unable to make them on his own.\n\nBut Fritzls lawyer, Astrid Wagner, informed Austrian media that she would be fighting the process as she considers the appointment of an adult to manage his affairs as not tenable  on the basis that he has no business to attend to and does not own any property.\n\nWagner says there is no necessity nor justification for appointing an adult representative, despite the fact Fritzl has beginning dementia and delusional episodes.\n\nFritzl has been transferred from Steins correctional facility to a cell in the normal prison following a decision by a three-member panel in the Krems Regional Court.\n\nBut the sex-offender pensioner was denied a general conditional release from normal prison in mid-May, with authorities deeming it not possible for special preventive reasons.\n\nThey said that future freedom from crime cannot be guaranteed due to the unprecedented criminal energy in connection with the convicted crimes.\n\nFritzl reportedly plans to move to the UK if he is ever released from prison.\n\nWhen I get released, it is not Austria I want to stay [in], rather I want to emigrate to the UK. Above all I want to roam free on the wild Highlands of Scotland, he said according to the Sun.\n\nFor me the lush green fields of Wales are also very, very appealing, but the main thing is its to the United Kingdom I am headed.\n\nFritzls crimes involved rape, coercion and imprisonment, keeping his daughter and her children trapped in a basement for years as he raped her thousands of times.\n\nElisabeth was abused from the age of 11, and was locked in the cellar from the age of 18 until she was 42.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08183242/2009-provincial-courthouse-sankt-poelten-74930898.jpg",
            "description": "<p>By Agencies JOSEF Fritzl has demanded a house ‘with a basement’ if he is released from prison, as he continues to pursue an early release from prison. Fritzl, 89, is demanding a house with a basement if he wins his freedom, as his lawyers try to use his dementia as a reason to secure his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/incest-monster-josef-fritzl-who-sired-7-children-with-daughter-demands-a-house-with-a-basement-if-freed/\">Incest monster Josef Fritzl who sired 7 children with daughter demands a house ‘with a basement’ if freed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "Shock as boy (9) commits suicide; Police express worry over growing trend of minors taking own lives",
            "url": "https://www.newzimbabwe.com/shock-as-boy-9-commits-suicide-police-express-worry-over-growing-trend/",
            "content": "By Staff Reporter\n\nIN a bizarre incident which has left members of the Mhondoro community shocked, a nine-year-old boy committed suicide by hanging from a tree.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector lan Kohwera confirmed the incident.\n\nThe now deceased was identified as Malvern Runyararo of Denhere village under Chief Chivero.\n\nPolice Mashonaland West province confirm a sudden death incident in which a juvenile aged 9 years committed suicide by hanging.\n\nMalvern Runyararo of Denhere village Chief Chivero was found hanging on a tree using a rope by one of the village members Rodrick Andrea (47) on 29 December 2024, said Kohwera.\n\nCircumstances are that on the night of December 28,2024, the boys family retired to bed and everyone went to their bedroom.\n\nThe following morning, informant discovered Malverns lifeless body dangling from a tree before alerting his family.\n\nA police report was made at ZRP Gonza Base who attended the scene and conveyed the body to Norton District Hospital mortuary for post-mortem.\n\nInvestigations are reportedly still in progress to ascertain the cause of the death.\n\nInspector Kohwera said authorities are concerned with suicidal deaths amongst minors, which have become prevalent throughout the province.\n\nIt is worrisome that the trend is increasing were minors take their lives after being corrected by their parents or guardians.\n\nWe appeal to the general public to counsel young people that taking their life after being corrected is not a solution rather they must appreciate it inorder to become future leaders, the police spokesman said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/09191405/hang-suicide.jpg",
            "description": "<p>By Staff Reporter  IN a bizarre incident which has left members of the Mhondoro community shocked, a nine-year-old boy committed suicide by hanging from a tree. Zimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector lan Kohwera confirmed the incident. The now deceased was identified as Malvern Runyararo of Denhere village under Chief Chivero. “Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shock-as-boy-9-commits-suicide-police-express-worry-over-growing-trend/\">Shock as boy (9) commits suicide; Police express worry over growing trend of minors taking own lives</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "Zanu PF activist claims fired CIO boss Isaac Moyo was working with French Intelligence to undermine Zimbabwe",
            "url": "https://www.newzimbabwe.com/zanu-pf-activist-claims-fired-cio-boss-isaac-moyo-was-working-with-french-intelligence-to-undermine-zimbabwe/",
            "content": "By Staff Reporter\n\nZANU PF activist Rutendo Matinyarare has made sensational claims that fired Central Intelligence Organisation (CIO) director-general Isaac Moyo was compromised and had been working with French Intelligence to undermine Zimbabwes security since his appointment in 2017.\n\nAccording to the controversial Matinyarare, Moyos relationship with the French dates back 15 years to his time as African Union (AU) executive secretary.\n\nSpeaking after Moyos dismissal by President Emmerson Mnangagwa less than a week ago, Matinyarare said the former spy boss was now touchable as past efforts to raise the issue did not stick.\n\nFor years, insiders within the AU and intelligence networks across Africa warned us of how Moyo was compromised, especially his alleged ties to French intelligence during his time as Executive Secretary at the African Union. But as a sitting head of intelligence, he was untouchableuntil now, said Matinyarare.\n\nThis removal is proof that President Mnangagwa is armed with enough intelligence to act decisively against those working against the nation of Zimbabwe.\n\nIt signals the beginning of a critical cleanup within our security apparatus.\n\nNo reasons were given for Moyos removal as head of the dreaded CIO in Chief Secretary to the President and Cabinet Martin Rushwayas statement, however.\n\nMatinyarare, who has numerous defamation cases before Zimbabwean and South African courts, proceeded to accuse Moyo of fighting the Zimbabwe Anti-Sanctions Movement (ZASM)s efforts to fight for the removal of restrictive measures imposed on local individuals and companies.\n\nMatinyarare leads the ZASM in his capacity as chairperson.\n\nThe greatest opposition to our anti-sanctions and anti-GMO campaigns came not from foreign enemies, but from the very institution that should have been our greatest allythe CIO, said Matinyarare.\n\nNonetheless, despite this betrayal, we found critical support from counter-forces within the system who defied the DGs orders and followed higher orders to help us fight for Zimbabwe.\n\nA few of those who initially stood with us in the fight against sanctions, were later turned against us in the anti-GMO fight, as they aligned themselves with smugglers of toxic GMOs, forex externalisers, and economic saboteurs on the instruction of Moyo and his inner circle.\n\nRumour has it that the DG and his close personal circle had been put on a hefty retainer by some of the GMO smugglers to destroy me, for daring to fight against their smuggling and forex externalisation operations.\n\nNow that Moyo is gone, we hope the President clears out the remaining elements of his corrupt regimethose on foreign payrolls, those on the payrolls of those sabotaging our economy, our currency, and the Presidents agenda to rebuild Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08185755/isaac-moyo.jpg",
            "description": "<p>By Staff Reporter ZANU PF activist Rutendo Matinyarare has made sensational claims that fired Central Intelligence Organisation (CIO) director-general Isaac Moyo was compromised and had been working with French Intelligence to undermine Zimbabwe’s security since his appointment in 2017. According to the controversial Matinyarare, Moyo’s relationship with the French dates back 15 years to his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-activist-claims-fired-cio-boss-isaac-moyo-was-working-with-french-intelligence-to-undermine-zimbabwe/\">Zanu PF activist claims fired CIO boss Isaac Moyo was working with French Intelligence to undermine Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "President Carter’s Legacy in Zimbabwe",
            "url": "https://www.newzimbabwe.com/president-carters-legacy-in-zimbabwe/",
            "content": "By Pamela Tremont, U.S. Ambassador to Zimbabwe\n\nU.S. President Jimmy Carters commitment to health, human rights, and peace worldwide will feature during his funeral proceedings in Washington, D.C. today. Eulogies from President Joe Biden and others will extoll Carters achievements both during his four years in the White House and his 44 years of philanthropy that followed. Carter, the longest-living of any U.S. president, was a ubiquitous, positive presence in our world for nearly half a century  building homes for the poor, monitoring elections around the globe, delivering humanitarian relief to those in need  often with his wife of 77 years, Rosalynn, by his side.\n\nThose are the familiar themes that will be beamed from the Washington National Cathedral around the globe today.\n\nHere in Zimbabwe, the story is more personal. As Carter would recall years later, What most people dont realize is, I spent more time on Zimbabwe than I did the Middle East. Historian Andrew DeRoche describes how Carter directed his future UN Ambassador, Andrew Young, on Inauguration Day to go to Africa and get some sense of what African leadership expected. Nearly four years later, President Carter would hear directly from Robert Mugabe himself when he visited the White House. The new Prime Minister of independent Zimbabwe appreciated the people of the United States who in our hour of need came to our support and thanked President Carter who stood firm on a matter of principle.\n\nPresident Carters principled leadership is the legacy he leaves for us. As President Carter said, during Prime Minister Mugabes visit to the White House, Today we stand with Zimbabwes efforts toward economic development and toward stability in your own country and the realization of the legitimate hopes and dreams of the people whom you lead. Those words are as true today as they were 45 years ago.\n\nOur commitment today to Zimbabwes economic development is rooted in President Carters principled leadership on human dignity. It is part of why last year we graduated more than 100 women from the Embassys Academy for Women Entrepreneurs, whose Zimbabwe alumnae now number more than 500 strong. These businesswomen, who own companies in security, agriculture, mining, and financial services  to name just a few  join a global network of entrepreneurs with increased knowledge and access to scale their successful ventures. Likewise, USAIDs Feed the Future programs trained nearly 3,200 young farmers last year to commercialize their farming businesses. On average, they tripled their annual incomes. The peanut farmer from Plains, Georgia turned president would be proud.\n\nThe legacy of President Carters principled leadership in public health contributes to Zimbabwes stability. His foundation  The Carter Center  championed the near elimination of the guinea worm disease, which afflicted 3.5 million people across 21 countries in 1986 but was reduced to just over a dozen cases in 2023. In that same spirit, we work every day with Zimbabwean partners on issues of clean water and sanitation. The United States continues to support Zimbabwe to strengthen water quality monitoring systems to prevent cholera outbreaks. In 2024, USAID helped improve water access for more than 97,000 people and nearly 37,000 livestock. Likewise, as The Carter Center battles malaria in Haiti and the Dominican Republic, U.S. initiatives through USAID and the U.S. Centers for Disease Control and Prevention helped reduce the incidence of malaria in Zimbabwe by 40 percent in the last 15 years. Support from the American people makes available 800,000 mosquito nets, 1.2 million malaria rapid test kits, and nearly 100,000 life-saving antimalarial medications as our teams on the ground train health care workers and educate communities about malaria prevention and early treatment.\n\nFinally, President Carter believed in the hopes and dreams of the people of Zimbabwe. His elevation of human rights as a foreign policy priority of the United States demonstrated his view that might did not make right. He believed, as we do, that countries that respect human rights are more stable, more secure, and more peaceful. In the economic sphere, President Carter signed into law the Foreign Corrupt Practices Act that, to this day, remains a cornerstone in the global fight against corruption. He campaigned on the need for legislation to prohibit corporate bribery, which is both ethically repugnant and competitively unnecessary, erodes public confidence, and harms our relations with other countries. His support for Historically Black Colleges and Universities in the United States helped those institutions strengthen their academics, infrastructure, and research. Our EducationUSA and consular officers celebrate that legacy as we facilitate study and exchange in the United States for thousands of young Zimbabweans today and develop partnerships between institutions of higher learning in our two countries.\n\nJimmy Carters principled leadership and legacy encourage us all to think about how we can contribute to our communities and embody the idea that one principled person can make a positive change. As the first U.S. president to visit Sub-Saharan Africa and the only to visit Zimbabwe in his many trips to the continent post presidency, Jimmy Carter and his principles will continue to inspire our partnership with the people of Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08183313/Carter-Photo.jpg",
            "description": "<p>By Pamela Tremont, U.S. Ambassador to Zimbabwe U.S. President Jimmy Carter’s commitment to health, human rights, and peace worldwide will feature during his funeral proceedings in Washington, D.C. today.  Eulogies from President Joe Biden and others will extoll Carter’s achievements both during his four years in the White House and his 44 years of philanthropy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-carters-legacy-in-zimbabwe/\">President Carter’s Legacy in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        },
        {
            "title": "Chiwenga fires shots at Zimbabwean care workers in the UK, says they are taking care of mentally challenged former sex workers",
            "url": "https://www.newzimbabwe.com/chiwenga-fires-shots-at-zimbabwean-care-workers-in-the-uk-says-they-are-taking-care-of-mentally-challenged-former-sex-workers/",
            "content": "By Staff Reporter\n\nOUTSPOKEN evangelist, Apostle Talent Chiwenga has blasted Zimbabweans working as caregivers in the United Kingdom and other developed countries, saying they have been relegated to taking care of unwanted, mentally challenged former sex workers all because of money.\n\nChiwenga was speaking during a sermon at Jesus Revelation Ministries, a denomination he founded with controversial and strict doctrines such as the absence of wives consent within a marriage.\n\nHis comments on caregivers come at a time when Zimbabweans are leaving the country enmasse to eke out a living in greener pastures due to lack of employment opportunities locally, a faltering economy and maladministration.\n\nOver 4,500 Zimbabwean trained nurses and doctors are employed by the UKs National Health Service (NHS), thousands more went there as nurse aides while countries such as Australia, USA and New Zealand have taken in more.\n\nIt is an error for us the sons of God to be used to toiling day and night doing filthy work so that other sinners may enjoy their lives, said the charismatic preacher.\n\nYou are the one taking care of the mother suffering from dementia as they go on vacation. You will be busy taking pictures of yourself and sending them back home saying life is good.\n\nYou have never washed your mothers clothes, have never bathed her or your grandmother but you are doing it all because of money.\n\nSome of these women were commercial sex workers who were abandoned by their children and are now being taken care of by the State. Those are the people you are taking care of in England.\n\nZimbabwean caregivers in the UK form a considerable chunk of the countrys diaspora community that contributed 25% of its total foreign currency earnings last year.\n\nChiwenga, however, said that kind of work should not be tolerated as it also causes mental fatigue.\n\nHe added: When you come back from work after finishing your shift, when you have spent the day bearing their spits on your face, what kind of love would you give to your spouse.\n\nDo you know that taking care of a mental patient causes mental fatigue itself because you are spending the day with them? Their relatives looked for you to do it because they did not want to do it themselves.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/10154139/Apostle-Chiwenga-e1583855020857.jpg",
            "description": "<p>By Staff Reporter OUTSPOKEN evangelist, Apostle Talent Chiwenga has blasted Zimbabweans working as caregivers in the United Kingdom and other developed countries, saying they have been relegated to taking care of unwanted, mentally challenged former sex workers all because of money. Chiwenga was speaking during a sermon at Jesus Revelation Ministries, a denomination he founded</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiwenga-fires-shots-at-zimbabwean-care-workers-in-the-uk-says-they-are-taking-care-of-mentally-challenged-former-sex-workers/\">Chiwenga fires shots at Zimbabwean care workers in the UK, says they are taking care of mentally challenged former sex workers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "09 Jan 2025"
        }
    ]
}