{
    "news": [
        {
            "title": "Tensions rise as memorial for former Zambian president Lungu takes place in South Africa amid ongoing dispute with government",
            "url": "https://www.newzimbabwe.com/tensions-rise-as-memorial-for-former-zambian-president-lungu-takes-place-in-south-africa-amid-ongoing-dispute-with-government/",
            "content": "The Star\n\nA memorial service for Zambias former President Edgar Chagwa Lungu is being held Tuesday at the Cathedral in Pretoria, South Africa, under a cloud of political tension and unresolved conflict between his family and the Zambian government.\n\nMourners, including members of the Patriotic Front (PF), Lungus former ruling party, filled the cathedral as emotional tributes were paid to the late statesman.\n\nHowever, the atmosphere was not one of peace.\n\nInstead, it reflected the deepening rift over Lungus legacy, his cause of death, and the governments controversial handling of his passing.\n\nThe 68-year-old former president died last Thursday in a South African hospital, where he had been undergoing treatment for an undisclosed illness.\n\nSince his death, speculation and accusations have surfaced, with some PF leaders claiming Lungu may have been poisoned  a charge the Zambian government has not addressed publicly.\n\nAccording to hospital sources, government officials allegedly tried to repatriate Lungus body to Zambia without the familys consent.\n\nMedical staff say they were intimidated and threatened, prompting outrage from PF leaders and human rights groups alike.\n\nSpeaking at a media roundtable in Sandton, Johannesburg, PF Secretary General Mangani Nakacinda condemned the governments actions, calling them a calculated political manoeuvre to seize control of the narrative. Nakacinda added,\n\nThis is no longer just about mourning a former president  it is about defending his dignity and our democracy.\n\nOne of the most contentious issues is the Zambian governments reported insistence on taking full control of Lungus funeral arrangements.\n\nThe Lungu family, backed by PF allies, has resisted this, citing concerns about trust and transparency. So far, the standoff has stalled any official state funeral plans.\n\nAdding to the pain and confusion, two of Lungus children were allegedly denied permission to leave Zambia to attend their fathers memorial in South Africa. Family representatives say the travel ban is another example of the administrations deliberate cruelty.\n\nInside Zambia, the situation is increasingly volatile. PF members have vowed to fight until the end to expose what they claim is a campaign to erase Lungus political legacy and prevent scrutiny into the events leading to his death.\n\nMeanwhile, the government appears determined to maintain authority over the funeral process, citing protocol and national interest.\n\nThe late presidents political comeback in 2023 had reignited tensions in the country. After years of relative silence, Lungu announced his intention to run in the 2026 elections, challenging the ruling United Party for National Development (UPND) and its leader, President Hakainde Hichilema.\n\nIn response, the Constitutional Court ruled him ineligible, sparking legal and political protests.Shortly after, Lungu was stripped of all state benefits, including security and medical support, further isolating him.\n\nPF leaders claim these actions left him vulnerable, even hindering access to vital medical treatment in the months before his death.\n\nAs his body remains in South Africa and legal negotiations continue behind the scenes, todays memorial has become more than a moment of remembrance  it is a flashpoint in a deepening national crisis.\n\nThe treatment of former President Lungu is a reflection of the state of our democracy, said Brian Mundubile, a senior PF figure.\n\nThis is about justice, truth, and respect  not just for him, but for all Zambians.With the cause of Lungus death still unconfirmed and calls for an independent investigation growing louder, todays service may not be the end of mourning but the beginning of a prolonged battle for answers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>The Star A memorial service for Zambia’s former President Edgar Chagwa Lungu is being held Tuesday at the Cathedral in Pretoria, South Africa, under a cloud of political tension and unresolved conflict between his family and the Zambian government. Mourners, including members of the Patriotic Front (PF), Lungu’s former ruling party, filled the cathedral as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tensions-rise-as-memorial-for-former-zambian-president-lungu-takes-place-in-south-africa-amid-ongoing-dispute-with-government/\">Tensions rise as memorial for former Zambian president Lungu takes place in South Africa amid ongoing dispute with government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "The work of cybercriminals – Chamisa claims X account hacked after cryptocurrency launch",
            "url": "https://www.newzimbabwe.com/the-work-of-cybercriminals-chamisa-claims-x-account-hacked-after-cryptocurrency-launch/",
            "content": "By Staff Reporter\n\nOPPOSITIONleader Nelson Chamisahas claimed hisX account was hackedafter he appeared to have launched a digital currency called God Is In It($GIT) and promoted it on his page.\n\nThe hackers gained access to Chamisas X account early on Tuesday, posting images and videos of Chamisa in a morning gown, endorsing the God Is In It digital currency.\n\nTo my fellow citizens, I wish to kindly inform you that my X (formerly Twitter) account has been hacked and compromised by cybercriminals, Chamisa posted on his WhatsApp channel moments later.\n\nOur cybersecurity team is working diligently with X support team to fix this problem, regain control and implement remedial measures. We will keep you updated on the status of the account recovery and any actions being taken.\n\nBy midday, Chamisas X account had removed all the unusual posts from his timeline and appeared to have regained control of the account.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter OPPOSITION leader Nelson Chamisa has claimed his X account was hacked after he appeared to have launched a digital currency called “God Is In It ($GIT)” and promoted it on his page. The hackers gained access to Chamisa’s X account early on Tuesday, posting images and videos of Chamisa in a morning gown, endorsing the “God Is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-work-of-cybercriminals-chamisa-claims-x-account-hacked-after-cryptocurrency-launch/\">The work of cybercriminals – Chamisa claims X account hacked after cryptocurrency launch</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa",
            "url": "https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/",
            "content": "IOL\n\nThe Supreme Court of Appeal has dismissed with costs the Department of Home Affairs attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protectingnearly 200,000 Zimbabwean Exemption Permit (ZEP) holdersagainst arrest and deportation.\n\nAfter winning Part A of the court wrangle, the federation will be heading back to the court, for Part B, to argue before court that the Department of Home Affairs overreached in 2021, when the then home affairs minister Aaron Motsoaledi announced the termination of the ZEP.\n\nThe special permit dispensation has allowed 180,000 Zimbabwean nationals to live and work in South Africa since 2009.\n\nIn the federations view, the jurisdiction to terminate the ZEP lies with Parliament, not the minister.\n\nIOL had an interview with Vindren Magadzire, director of the Zimbabwe Immigration Federation who said his organisations case revolves around the termination of the ZEP programme by the minister of home affairs.\n\nVindren Magadzire, director of the Zimbabwe Immigration Federation Image:Supplied\n\nThe programme allowed approximately 180,000 Zimbabweans to live and work in South Africa. In 2021, the minister of home affairs announced plans to terminate the ZEP permits, sparking legal actions from the Zimbabwe Immigration Federation, Magadzire told IOL.\n\nThe Zimbabwe Immigration Federation was inspired to go through courts due to the South African minister of home affairs decision to terminate the permits. The decision would have significant implications for approximately 180,000 Zimbabweans living and working in South Africa under the ZEP permit program.\n\nMagadzire said his organisation is requesting the superior court to declare the termination of the ZEP permits unlawful, setting aside the termination decision, and protecting permit holders rights.\n\nIn Magadzires view, a lasting solution would be granting the ZEP holders permanent residence status in South Africa.\n\nThe latest development in the court case is that the Supreme Court of Appeal dismissed the minister of home affairs appeal. This decision upholds a Johannesburg High Court interdict that shields approximately 180,000 ZEP holders from arrest and deportation, said Magadzire.\n\nLast year,IOL reported thatthe High Court in Pretoria heard arguments from the Helen Suzman Foundation to enforce the courts order that the ZEP remains valid, while the minister of home affairs conducts a fair and rational inquiry into the impact of its termination.\n\nThe foundation turned to court in a bid to give ZEP holders a lifeline.\n\nWhen the minister first signalled his intention to appeal the courts June 2023 judgment, the foundation asked him to leave the ZEP in place until he exhausted the appeal process. The minister refused, Nicole Fritz, executive director of the foundation said at the time.\n\nThe court had held earlier that the ministers appeal had no prospects of success. Home Affairs then decided to turn to the Supreme Court of Appeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>IOL The Supreme Court of Appeal has dismissed with costs the Department of Home Affairs’ attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protecting nearly 200,000 Zimbabwean Exemption Permit (ZEP) holders against arrest and deportation. After winning Part A of the court wrangle, the federation will be heading back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/\">‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "4,912 injuries, 76 fatalities recorded in workplaces in 2024",
            "url": "https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.\n\nVarious factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.\n\nIn a speech read on behalf of the ZCTU President, Florence Taruvinga, to mark this years June 6 commemorations, the labour organ revealed that workplace injuries and fatalities rose significantly during the period.\n\nIn 2024, Zimbabwe experienced a concerning rise in occupational injuries and fatalities. It is reported that there were 4,912 injuries and 76 fatalities throughout the year. What about those accidents that went unreported? It is our demand that we cannot continue to suffer from workplace neglect as workers without the responsible authorities being brought to account for the injuries and deaths being experienced in the workplace, she said.\n\nTaruvinga said the mining industry has become synonymous with unsafe shafts, equipment failure, and weak regulations that are causing unnecessary deaths.\n\nIn Agriculture, she said, employees work without personal protective equipment and are exposed to chemicals, heat stress, and poor living conditions, while in the retail and commercial sectors, workers are exposed to long hours of work, job insecurity and poor ergonomics.\n\nTaruvinga said that in the informal sector, over 80% of workers operate with no safety laws, medical care, or recognisable rights, while the transport and manufacturing sectors have also not been spared, as workers work with very dangerous old and archaic machinery, poorly maintained and without proper safety nets.\n\nAs the voice of workers, we clearly pronounce that enough is enough. We demand the following: Full enforcement of OSH laws across all economic sectors, establishment of functional health and safety committees in every workplace and access to adequate PPE, occupational health training, and medicalservices for all workers, added Taruvinga.\n\nThe June 6 commemorations are held annually to reflect on the Kamandama Mine Disaster, in which 427 miners were killed in 1972 in a mine explosion. The accident, which was attributed to a methane gas explosion, forced the permanent closure of the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.    Various factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.   In a speech read on behalf of the ZCTU President, Florence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/\">4,912 injuries, 76 fatalities recorded in workplaces in 2024  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "Smith to retire from Kavango Resources",
            "url": "https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/",
            "content": "By Alois Vinga\n\nKAVANGO Resources Plcboard chairman David Smith has indicated the intention to retire at the end of June 2025.\n\nHe steps down after a long and illustrious career, devoting considerable experience which raised the groups flag.\n\nThe company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board. Peter, who is currently the Non-Executive Deputy Chairman, will assume the position when David steps down.\n\nPeter is an experienced lawyer who has focused on financing and managing mining companies. He has raised capital for the development of mining projects since 1990.\n\nSuccessful projects include the development of a gold mine in Zambia, a copper mine in Zimbabwe and the Skorpion zinc mine in Namibia prior to its takeover by Anglo-American. He recently retired from Mexico Resources plc, where he was the founder and executive chairman, the company said in a statement.\n\nKavango also announced the appointment of Gautam Dalal, who will join the Company as a non-executive director, the effective date is expected to be 1 July 2025. The Company welcomes Gautam Dalal to the Board. Gautam Dalal joins the Company as a non-executive director.\n\nGautam is a chartered accountant with over 30 years of experience with KPMG London, where he was a partner from 1990 to 2010. From 1993 to 1997 he was responsible for the commencement of KPMGs business in India where he was based.\n\nGautam returned to India in 2000 as Chairman and Chief Executive Officer of KPMGs Indian operations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09181535/smith-david.jpeg",
            "description": "<p>By Alois Vinga KAVANGO Resources Plc board chairman David Smith has indicated the intention to retire at the end of June 2025.  He steps down after a long and illustrious career, devoting considerable experience which raised the group’s flag.  The company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/\">Smith to retire from Kavango Resources </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:46",
            "date": "10 Jun 2025"
        },
        {
            "title": "Trump travel ban barring citizens from 12 countries takes effect",
            "url": "https://www.newzimbabwe.com/trump-travel-ban-barring-citizens-from-12-countries-takes-effect/",
            "content": "BBC\n\nPresident Donald Trumps sweeping new travel ban which bars citizens of 12 countries from entering the United States came into effect at 00:00 ET (05:00 BST) on Monday.\n\nThe order, which Trump signed last week, restricts the nationals of Afghanistan, Myanmar, Chad, Congo-Brazzaville, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen from entering the US.\n\nNationals from a further seven countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  will face partial travel restrictions.\n\nThe US president saidthe listcould be revised if material improvements were made, while other countries could be added as threats emerge around the world.\n\nIt is the second time Trump has ordered a ban on travel from certain countries. He signed a similar order in 2017 during his first term in office.\n\nThe White House said these common sense restrictions would protect Americans from dangerous foreign actors.\n\nThere are a number of people from affected countries who may still be able to enter the US due to a number of exceptions. The order does not apply to:\n\nIn a video posted to his Truth Social website last week, Trump said the recent attack in Boulder, Colorado underscored the extreme dangers posed by foreign nationals who had not been properly vetted.\n\nTwelve people were injured in Colorado on 1 June when a man attacked a group gathering in support of Israeli hostages. The FBI called it a suspected terror attack and said the suspect had used a makeshift flamethrower, Molotov cocktails and other incendiary devices.\n\nThe man accused of carrying out the attack was identified as an Egyptian national, but Egypt has not been included on the list of banned countries.\n\nTrumps latest order, which is likely to face legal challenges, drew a swift response, at home and abroad.\n\nChad retaliated by suspending all visas to US citizens while Somalia promised to work with the US to address security issues.\n\nThe African Union, which represents all countries on the continent, called on the US to engage in constructive dialogue with the countries concerned.\n\nIn the US, Democrats were quick to condemn the move.\n\nThis ban, expanded from Trumps Muslim ban in his first term, will only further isolate us on the world stage, Congresswoman Pramila Jayapal wrote on social media.\n\nBut others support the ban.\n\nCongressman Clay Higgins of Louisiana told the BBC that travel to the US was a privilege, not a right.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09201449/TRUMP-D.webp",
            "description": "<p>BBC President Donald Trump’s sweeping new travel ban which bars citizens of 12 countries from entering the United States came into effect at 00:00 ET (05:00 BST) on Monday. The order, which Trump signed last week, restricts the nationals of Afghanistan, Myanmar, Chad, Congo-Brazzaville, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-travel-ban-barring-citizens-from-12-countries-takes-effect/\">Trump travel ban barring citizens from 12 countries takes effect</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:46",
            "date": "10 Jun 2025"
        }
    ]
}