{
    "news": [
        {
            "title": "I quit CCC to “teach ED a lesson” – Chamisa",
            "url": "https://www.newzimbabwe.com/i-quit-ccc-to-teach-ed-a-lesson-chamisa/",
            "content": "By Staff Reporter\n\nFormer leader of the Citizens Coalition for Change (CCC), Nelson Chamisa, has revealed that his departure from both the CCC and the Movement for Democratic Change (MDC), was a calculated move aimed at frustrating President Emmerson Mnangagwa, whom he accuses of orchestrating a takeover of the opposition parties.\n\nChamisa resigned as leader of the CCC in January last year, citing the hijacking of his party by Mnangagwa as punishment for his refusal to accept the results of the chaotic August 2023 general elections.\n\nThe fallout from the elections saw Sengezo Tshabangu emerge, seemingly from nowhere, claiming to be the interim Secretary General of the CCC.\n\nTshabangus stated aim was to restore order within the opposition by addressing alleged irregularities in the candidate selection process leading up to the 2023 elections.\n\nTshabangu subsequently initiated a widespread recall of elected representatives, claiming that certain candidates had been improperly selected.\n\nThis led to the unprecedented recall of over 40 MPs and councillors, effectively handing Zanu-PF back the two-thirds parliamentary majority it had failed to secure during the harmonised elections.\n\nChamisas attempts to prevent these recalls, including written appeals to the then Local Government Minister July Moyo and Speaker of the National Assembly Jacob Mudenda, proved futile. The courts upheld the recalls, leaving Chamisa with no option but to step aside.\n\nIn a Facebook post on Thursday, Chamisa confirmed that his decision to leave the CCC was motivated by a desire to spite Mnangagwa.\n\nThe best decision I ever made in my leadership journey was to walk away from MDC & CCC. You will thank me later. I had to break the cycle of going in circles. And that was my best way to teach ED a lesson!, Chamisa declared.\n\nThis was not Chamisas first departure from a major political entity. He had previously walked away from the Movement for Democratic Change (MDC) after a Supreme Court ruling questioned the legitimacy of his assumption of the party leadership following the death of Morgan Tsvangirai.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/15180623/Mnangagwa-Chamisa.jpg",
            "description": "<p>By Staff Reporter Former leader of the Citizens Coalition for Change (CCC), Nelson Chamisa, has revealed that his departure from both the CCC and the Movement for Democratic Change (MDC), was a calculated move aimed at frustrating President Emmerson Mnangagwa, whom he accuses of orchestrating a takeover of the opposition parties. Chamisa resigned as leader</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-quit-ccc-to-teach-ed-a-lesson-chamisa/\">I quit CCC to “teach ED a lesson” – Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "UZ reinstates students suspended after protesting in support of lecturers’ strike",
            "url": "https://www.newzimbabwe.com/uz-reinstates-students-suspended-after-protesting-in-support-of-lecturers-strike/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe has lifted its suspension on six student activists who were dismissed for staging a protest on campus in May in solidarity with their striking lecturers.\n\nThe students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of the Zimbabwe National Students Union (ZINASU), UZ Chapter.\n\nThey staged a flash protest at UZ campus where they demanded an urgent resolution to the grievances of their lecturers, who have been on strike since April 16.\n\nThe student activists were later suspended in July by UZ Vice Chancellor Paul Mapfumo, citing that they had put the institution in disrepute.\n\nThe suspension drew criticism from opposition politicians and was raised in Parliament on Wednesday.\n\nIn separate letters seen by NewZimbabwe.com which were written to the six students by UZ registrar Munyaradzi Madambi, the institution made a U-turn and announced the withdrawal of student disciplinary matter against them.\n\nPlease be advised that the University has reconsidered its position and decided to lift your suspension from the University of Zimbabwe and also withdraw the Student Disciplinary matter which had previously beenleveledagainstyou.\n\nIt is sincerely hoped that you have atoned for your behaviour, which seriously threatens the integrity and reputation of the University.\n\nWe anticipate that you desist from engaging in behaviour that may put the University into disrepute.\n\nBy copy of this letter, the Manager, Examinations and Certification is requested to reactivate your E-mhare account and release your results and all other relevant Departments of the University are advised to take the necessary steps to facilitate the resumption of studies by the student, the letters read.\n\nThree weeks ago, the university also fired four leaders of the ongoing lecturers industrial action after having been initially suspended and undergoing a hearing for using the campuss great hall without approval from authorities.\n\nThe lecturers are demanding a salary increase to at least US$2,250 from their current US$250 as well as improved working conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe has lifted its suspension on six student activists who were dismissed for staging a protest on campus in May in solidarity with their striking lecturers. The students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of the Zimbabwe National Students Union</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-reinstates-students-suspended-after-protesting-in-support-of-lecturers-strike/\">UZ reinstates students suspended after protesting in support of lecturers’ strike</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "Govt approves exam classes vacation school",
            "url": "https://www.newzimbabwe.com/govt-approves-exam-classes-vacation-school/",
            "content": "By Thandiwe Garusa\n\nTHE government has given schools the green light to conduct August vacation classes for examination classes, saying that different challenges may have affected syllabus coverage.\n\nIn a statement, the Ministry of Primary and Secondary Education Permanent Secretary, Moses Mhike said the holiday lessons must be done for ten days only between 18 and 29 August.\n\nIt is recognised that schools have different challenges that may have affected their syllabus coverage and necessitated the conduct of vacation school for examination classes.\n\nTherefore, for the year 2025, authority is granted for schools to conduct vacation school during the August holidays for the examination classes of Grade 7, Form Four and Upper Sixth.\n\nThe holiday lessons will take place between 18 and 29 August, a period of ten (10) working days only, Mhike said.\n\nThe Ministry also stressed the importance of preventing the ever-escalating cost of teaching and learning for parents in view of disadvantaged pupils who may be excluded from these vacation schools due to financial constraints.\n\nPrimary schools will charge US$2.00 per Learning Area per Grade 7 or its equivalent bank rate in Zimbabwe Gold currency.\n\nSecondary Schools will charge USD$3.00 per learning area for form fours (4) and USD$5.00 per learning area for Upper Six (6) or its equivalent bank rate in Zimbabwe Gold currency.\n\nAll borders will pay an extra USD$5.00 per day for their upkeep during the vacation school period, Mhike said.\n\nMhike also said parents must be given receipts upon payment, and accurate financial records should be kept for auditing purposes.\n\nThe vacation school should be fully supervised and monitored by the District Literacy Coordinators and the Remedial Tutors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/30220718/Picture5.jpg",
            "description": "<p>By Thandiwe Garusa THE government has given schools the green light to conduct August vacation classes for examination classes, saying that different challenges may have affected syllabus coverage. In a statement, the Ministry of Primary and Secondary Education Permanent Secretary, Moses Mhike said the holiday lessons must be done for ten days only between 18</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-approves-exam-classes-vacation-school/\">Govt approves exam classes vacation school</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "Stolen R2.5 million Nissan Patrol: Zimbabwean man remains behind bars",
            "url": "https://www.newzimbabwe.com/stolen-r2-5-million-nissan-patrol-zimbabwean-man-remains-behind-bars/",
            "content": "IOL\n\nA 48-year-old Zimbabwean man, Stephen Nyoni, has been remanded in custody after appearing in a Limpopo court for possessing a stolen vehicle.\n\nLast week,IOL reported that police in Limpopo had intercepted and recovered a high-performance luxury sport utility vehicle, valued at over R2.5 million, during a targeted anti-smuggling operation.\n\nThe anti-crime blitz was conducted by the South African Police Service (SAPS) in Limpopo in collaboration with private security partners along the N1 highway near Polokwane on Wednesday.\n\nActing on intelligence regarding a stolen vehicle travelling from Gauteng towards the Beitbridge border, the operational team consisting of Limpopo SAPS, ShadowSecure Security, Tshimollo Security and Investigations, and Tracker Connect kept strategic observation along the N1 route, said Limpopo police spokesperson, Brigadier Hlulani Mashaba.\n\nThe vehicle matching the description, a Nissan Patrol V8 5.6, was identified and intercepted near Shell Ultra City within the Westernburg policing area.\n\nMashaba said further investigations confirmed that the vehicle had been stolen in Brooklyn, Pretoria.\n\nStephen Nyoni was arrested while allegedly driving a stolen V8 Nissan Patrol 5.6 worth R2.5 million towards the Beitbridge port of entry Image: SAPS\n\nA 48-year-old Zimbabwean national, who was driving the vehicle, was arrested on the spot and charged with possession of a suspected stolen motor vehicle, he said.\n\nIn an update,SAPS in Limpopo told IOL that Nyoni is expected to seek bail when he returns to the Polokwane Magistrates Court this week.\n\nThe accused person appeared before Polokwane Magistrates Court, and the matter was postponed to Wednesday, 16 July 2025, for formal bail application, said Mashaba.\n\nThe accused person was remanded in custody till then.\n\nIn May, IOL reported that a31-year-old man,Mikael Mlambo, appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted a stolenToyota Corolla Crosssport utility vehicle which was being driven towards the Beitbridge port of entry.\n\nAt the time,Mashaba said the matter was postponed to allow for the profiling of the arrested man. He said police had established that Mlambo is a South African national.\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen in May, around Pretoria central.\n\nOn Friday, 16 May 2025, members of provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17032342/Screenshot-2025-07-17-at-04.21.30.png",
            "description": "<p>IOL A 48-year-old Zimbabwean man, Stephen Nyoni, has been remanded in custody after appearing in a Limpopo court for possessing a stolen vehicle. Last week, IOL reported that police in Limpopo had intercepted and recovered a high-performance luxury sport utility vehicle, valued at over R2.5 million, during a targeted anti-smuggling operation. The anti-crime blitz was conducted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stolen-r2-5-million-nissan-patrol-zimbabwean-man-remains-behind-bars/\">Stolen R2.5 million Nissan Patrol: Zimbabwean man remains behind bars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "17 Jul 2025"
        },
        {
            "title": "Pedestrian killed, two others injured after trailer dislodged from commuter omnibus",
            "url": "https://www.newzimbabwe.com/pedestrian-killed-two-others-injured-after-trailer-dislodged-from-commuter-omnibus/",
            "content": "By James Muonwa\n\nA PEDESTRIAN died while two others were seriously injured after they were hit by a trailer that had dislodged from a commuter omnibus towing it.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy that occurred along Plumtree Road in Bulawayo.\n\nThe ZRP confirms a fatal road traffic accident which occurred on July 14, 2025 at around 1330 hours along Plumtree Road in Belmont, Bulawayo said Nyathi.\n\nA trailer of a Mercedes-Benz Sprinter with one passenger on board disengaged. It then hit three pedestrians who were walking on the edge of the road.\n\nThe victims sustained varying injuries and were ferried to Mpilo Hospital for treatment. Unfortunately, one of the victims succumbed to the injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By James Muonwa  A PEDESTRIAN died while two others were seriously injured after they were hit by a trailer that had dislodged from a commuter omnibus towing it. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy that occurred along Plumtree Road in Bulawayo. “The ZRP confirms a fatal road traffic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pedestrian-killed-two-others-injured-after-trailer-dislodged-from-commuter-omnibus/\">Pedestrian killed, two others injured after trailer dislodged from commuter omnibus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "17 Jul 2025"
        }
    ]
}