{
    "news": [
        {
            "title": "‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid",
            "url": "https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/",
            "content": "IOL\n\nFormer Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movements bold plans to extend President Emmerson Mnangagwas term of office to 2030, warning that the move will end badly for both the president and Zimbabwe.\n\nSpeaking to IOL, Kasukuwere said:He (Mnangagwa) is dreaming and he has set himself up for a gigantic failure. Greediness knows no boundaries, and this will lead to a huge disaster for the country.\n\nEarlier this week,IOL reported that Zanu PF has emboldened its move to push through a proposal allowing Mnangagwa to remain in powerbeyond his current constitutional term, which ends in 2028. The party recently adopted a resolution at its annual conference backing the extension to align with the governments so-called Vision 2030 development agenda.\n\nKasukuwere, once a senior figure in the Zanu PF government led by Robert Mugabe before going into exile during the 2017 military intervention, became one of the most prominent former insiders to condemn the partys Mnangagwa plan publicly.\n\nZanu-PF party has announced plans to begin the process of extendingMnangagwas term of officeby two years  a move that, if successful, would keep him in power until 2030.\n\nThe proposal was formally endorsed at the partys annual national peoples conference in the eastern city of Mutare over the weekend. Delegates instructed government structures to start work on legislation to amend the constitution.\n\nAccording to State-ownedThe Herald, delegates argued that the extension would allow Mnangagwa to complete ongoing national development programmes aligned with the governments Vision 2030 agenda.\n\nThe conference adopted the resolution unanimously, describing it as a step toward ensuring policy continuity and consolidating the gains made under Mnangagwas leadership.\n\nZanu-PFs acting political commissar, Munyaradzi Machacha, toldThe Heraldthat the resolution formed part of the official conference outcomes and would be referred to the partys central committee for consideration.\n\nOur president has demonstrated exceptional leadership in driving national development. The conference agreed he should be supported to continue implementing Vision 2030, Machacha said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/15191341/Kasukuwere.jpg",
            "description": "<p>IOL Former Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movement’s bold plans to extend President Emmerson Mnangagwa’s term of office to 2030, warning that the move will end badly for both the president and Zimbabwe. Speaking to IOL, Kasukuwere said: “He (Mnangagwa) is dreaming and he has set himself up</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/\">‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "23 Oct 2025"
        },
        {
            "title": "Businessmen Mpofu, Chimombe found guilty of US$7 million fraud",
            "url": "https://www.newzimbabwe.com/businessmen-mpofu-chimombe-found-guilty-of-us7-million-fraud/",
            "content": "By Mary Taruvinga\n\nBusinessmen Moses Mpofu and Mike Chimombe have been found guilty of defrauding the government of US$7 million in a botched Presidential Goats Scheme tender.\n\nThe two, who have been in remand prison for over a year since their arrest in June last year. They return to court on October 31 for sentencing hearing.\n\nIn his ruling, High Court Judge Pisirayi Kwenda said the first accused, Mpofu, shot himself in the foot. He said all he did was in his capacity as a director and that he was directed to do so. So there was no further proof needed by the State.\n\nThe second accused argued that his case was strange because the State closed its case without mentioning how he was involved in the misrepresentation. His closing submission was that the State failed to bring him any closer to the case, insisting that he was implicated merely by association.\n\nKwenda said there was no basis for invoking the doctrine of association, as no law was cited.\n\nWe accepted the submission by the State that Blackdeck was not registered. Was the use of that name meant to deceive? Could it be said the intention was to bring perjury? We believe the name was used to attract some colour, not to deceive the ministry, although different names were used interchangeably, said the judge.\n\nKwenda noted that Mpofus failure to call witnesses affected his credibility and his defence.\n\nHe knew these witnesses were important as he was being charged in his personal capacity. His decision not to call these witnesses was his own, except that one witness had died,which was not verified by production of evidence, the judge said.\n\nWhere a litigant threatens to call witnesses to confirm his defence and later abdicates, the usual inference is there was no intention to call that witness, or that the witness, if called, would not confirm that defence.\n\nKwenda dismissed Mpofus explanation that he changed his mind after realising he was being charged personally, describing it as lame because he knew that from the beginning.\n\nHe explained that a company is a legal fiction: A company is just a person in terms of the law. Its really not a natural person created by God. It being a fiction, you cant touch it. It does not have a brain of its own, so its very difficult to separate the acts of a company from the acts of the person who represents it.\n\nKwenda said a corporate body might be liable, but the State may choose not to use the body. The fact that one is a director gives rise to that liability.\n\nHe added, Mpofu must have been aware of his obligation. He submitted a bid which contained falsified information, so which confirms that he was liable. He should have called witnesses to confirm that he was not involved in the submission, but he did not do so.\n\nKwenda said that where presumption gives rise to criminal liability, the onus is on a litigant to prove that he did not play a part.\n\nRegarding the second accused, Chimombe, the judge said: The second accused person strenuously denied he had much involvement in this scheme. We were faced with a situation where we had a threatened case against his denial. We must resolve that factual dispute, and that can be rectified by reference to the testimony of witnesses.\n\nThe witnesses, John Bhasera and Nhundurwa, said they would attend meetings together. We therefore found that he participated. We did not find his explanation convincing. If he said he attended meetings with Nhundurwa, that would have nothing to do with lobbying for an award for Blackdeck because it had already been awarded.\n\nKwenda rejected the claim that the second accused attended meetings merely to resolve disputes as a member of EEG. There was clearly another reason for this. Why would he be there to attend a business meeting?\n\nIt shows he had a mandate, said the judge.\n\nKwenda concluded: We found that the version of the first accused person,that Chimombe was co-opted to represent the company,is binding. To that extent, we found that the second accused was controlling the affairs of the entity. His liability flows from his participation.\n\nIn January this year, Kwenda, while turning down a bail application by the two business partners, said they risk being jailed for 20 years if convicted.\n\nRegarding the seriousness of the offence, I have looked at the penalty and the presumptive penalty for fraud is 20 years, Kwenda said then, adding that if a fraud involves public funds, the sentence will be severe.\n\nMpofu and Chimombedefrauded the Ministry of Lands of US$7 million after securing a tender using a non-existent firm, Blackdeck Pvt Ltd.\n\nThe two forged a ZIMRA Tax clearance certificate and a NSSA compliance certificate in the name of Blackdeck Private Limited and attached them to a bidding document which they submitted to the Ministry of Lands, Agriculture, Water, Fisheries and Rural Development for a tender for the supply and delivery of goats for the Presidential Goat Pass-on Scheme.\n\nThey misrepresented that the company was in full compliance with ZIMRA and NSSA requirements.\n\nActing on the misrepresentation, the Ministry of Lands contracted Blackdeck Private Limited and they were paid US$7 million.\n\nInvestigations later indicated that the QR code and the reference on the NSSA compliance certificate were issued to a different company. It was further established that Blackdeck Private Limited was deregistered from the NSSA system in January 2016. Further investigations established that Blackdeck Private Limited was not issued with a ZIMRA tax clearance certificate for the year 2021.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga Businessmen Moses Mpofu and Mike Chimombe have been found guilty of defrauding the government of US$7 million in a botched Presidential Goats Scheme tender. The two, who have been in remand prison for over a year since their arrest in June last year. They return to court on October 31 for sentencing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessmen-mpofu-chimombe-found-guilty-of-us7-million-fraud/\">Businessmen Mpofu, Chimombe found guilty of US$7 million fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "23 Oct 2025"
        },
        {
            "title": "Lloyd Mutasa admits MWOS FC lacked depth in Premier League Title chase",
            "url": "https://www.newzimbabwe.com/lloyd-mutasa-admits-mwos-fc-lacked-depth-in-premier-league-title-chase/",
            "content": "By Sports Reporter\n\nMWOS FC head coach Lloyd Mutasa says his teams lack of squad depth cost them the 2025 Castle Lager Premier Soccer League title, despite an impressive campaign that saw themat thetop of the logfor several weeks.\n\nThe Norton-based side currently sits third on the log with 55 points, six behind leaders Scottland FC, with only three matches remaining in the season.\n\nMWOS FCs faint title hopes were dashed last Saturday after a 1-0 loss to rivals Scottland FC, a result that effectively ended their championship pursuit.\n\nDespite falling short, MWOS have enjoyed a remarkable debut season in the top flight  spending more than ten weeks at the summit and going on a 16-match unbeaten run.\n\nReflecting on the campaign, Mutasa said the teams lack of adequate preparation before the season began played a major role in their late slip.\n\nFoundation is important. You know, pre-season and the kind of players you recruit will determine how you play, said Mutasa.\n\nThese guys punched above their weight because, if you look at our depth compared to other teams, there is a huge difference. We tried as much as we could, but we only stretched this far.\n\nMWOS FCs promotion to the Premier Soccer League was confirmed in February 2025, barely a month before the new season began. The club had finished second to Scottland in the Northern Region Division One League, and secured its top-flight berth by purchasing ZPC Hwanges PSL status.\n\nMutasa said the team is now focused on winning the Chibuku Super Cup, aiming to cap off their impressive season with silverware.\n\nMWOS face Triangle United in the semi-finals of the tournament at Ngoni Stadium on Saturday. Victory would see them progress to the final, where they will meet either Dynamos or Highlanders.\n\nConsidering the efforts put in place by management and our fans, I think we will try as much as possible to win the Chibuku Super Cup, as hard as it might be, added Mutasa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/22060943/lloyd-mutasa.jpg",
            "description": "<p>By Sports Reporter MWOS FC head coach Lloyd Mutasa says his team’s lack of squad depth cost them the 2025 Castle Lager Premier Soccer League title, despite an impressive campaign that saw them at the top of the log for several weeks. The Norton-based side currently sits third on the log with 55 points, six behind leaders Scottland</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lloyd-mutasa-admits-mwos-fc-lacked-depth-in-premier-league-title-chase/\">Lloyd Mutasa admits MWOS FC lacked depth in Premier League Title chase</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "23 Oct 2025"
        },
        {
            "title": "An ungrateful man – Mwonzora slams Mnangagwa as MDC opposes ZANU PF’s 2030 agenda",
            "url": "https://www.newzimbabwe.com/an-ungrateful-man-mwonzora-slams-mnangagwa-as-mdc-opposes-zanu-pfs-2030-agenda/",
            "content": "By Staff Reporter\n\nMOVEMENT for Democratic Change (MDC) leader Douglas Mwonzora has described President Emmerson Mnangagwa as an ungrateful man, as Zanu PFs controversial push to extend the presidents tenure beyond 2028 continues to face mounting opposition.\n\nDespite Mnangagwa publicly rejecting the idea of a term extension beyond the constitutionally mandated two terms, Zanu PF has been spearheading a plan to amend the Constitution to enable him to remain in power.\n\nThe ruling party is reportedly seeking to amend Section 91(2), which bars Mnangagwa from running for a third term, and Section 328(7), which prevents a sitting president from benefiting from such an amendment.\n\nAddressing the media in Harare recently, Mwonzora stopped short of saying Mnangagwa has overstayed his welcome at the helm of the country.\n\nWhy should we give President Mnangagwa who is 83 with another term? He has been Minister since 1980 and he has been President, first completing the tenure of President Mugabe and the two terms that he has been given. He needs to be an ungrateful man to seek anything beyond that, said Mwonzora.\n\nAt the just-ended Zanu PF Peoples Conference in Mutare, the ruling party resolved to fast-track constitutional amendments that would allow Mnangagwa to continue his tenure beyond 2028.\n\nMwonzora said the country has seen no tangible improvement under Mnangagwas leadership, who took over from long-time ruler Robert Mugabe following the 2017 military coup.\n\nThere is nothing special that we have received from his presidency at all. Zimbabweans continue wallowing in poverty, although they say that there is economic development in Zimbabwe. Average Zimbabweans have become poorer. Some Zimbabweans cannot afford a meal a day every day and there is a lot of unemployment, so why should we have a term? said Mwonzora.\n\nAccording to a leaked corruption dossier allegedly authored by Vice President Constantino Chiwenga, Zanu PF is plotting to smuggle a document into Parliament titled the Breaking Barriers Initiative (BBI), which seeks to postpone elections and extend the tenure of the National Assembly until 2030.\n\nThe BBI is reportedly being packaged as a national stability project aimed at helping Zimbabwe move away from the toxic cycle of elections.\n\nMwonzora, however, warned against tampering with the 2013 Constitution, which was overwhelmingly endorsed by citizens in a national referendum.\n\nMDC was an active participant in the drafting of the constitution and it heard the views of the people of Zimbabwe. The people of Zimbabwe want a limited term. Somebody rules the country, is given a second term if possible, then they go home. So we remain opposed to the so-called 2030 agenda, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter MOVEMENT for Democratic Change (MDC) leader Douglas Mwonzora has described President Emmerson Mnangagwa as “an ungrateful man,” as Zanu PF’s controversial push to extend the president’s tenure beyond 2028 continues to face mounting opposition. Despite Mnangagwa publicly rejecting the idea of a term extension beyond the constitutionally mandated two terms, Zanu PF</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-ungrateful-man-mwonzora-slams-mnangagwa-as-mdc-opposes-zanu-pfs-2030-agenda/\">An ungrateful man – Mwonzora slams Mnangagwa as MDC opposes ZANU PF’s 2030 agenda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "23 Oct 2025"
        },
        {
            "title": "TIGERE moves to expand property portfolio",
            "url": "https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/",
            "content": "By Alois Vinga\n\nTigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million.\n\nThe REIT said the proposed acquisitions are subject to unitholder approval and will be fully funded through the issuance of 770.5 million new Tigere REIT units.\n\nThis marks Tigere REITs second acquisition since its initial public offering (IPO), following the successful purchase of Highland Park Phase 2. The move aligns with the funds strategy of securing high-quality, income-generating real estate assets supported by long-term, US dollar-denominated leases, a key driver for stable returns and capital growth.\n\nThe total acquisition consideration reflects the combined net asset value (NAV) of the target properties. Upon completion, Tigere REITs total units in issue will increase to 1.84 billion, with the newly issued units representing 41.8% of the enlarged unit base.\n\nThe implied issuance price per unit for the transaction stands at US$3.26 cents, representing a 2.536% premium over Tigere REITs NAV per unit of US$3.18 as of June 30, 2025.\n\nThe bulk of the transaction involves the Greenfields Retail Centre, acquired on a leasehold basis. The property, whose development began in December 2024, features 54 tenants across 14,000m of gross lettable area (GLA) and is currently fully occupied.\n\nTigere REIT said the acquisitions will further strengthen its portfolio of high-quality retail assets, supporting consistent returns and sustainable long-term growth for investors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21180820/greenfields-retail.jpg",
            "description": "<p>By Alois Vinga Tigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million. The REIT said the proposed acquisitions are subject to unitholder approval</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/\">TIGERE moves to expand property portfolio</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "23 Oct 2025"
        }
    ]
}