{
    "news": [
        {
            "title": "Zimbabwe police officers banned from betting shops while in uniform",
            "url": "https://www.newzimbabwe.com/zimbabwe-police-officers-banned-from-betting-shops-while-in-uniform/",
            "content": "Gambling Insider\n\nZimbabwes police force has introduced a ban on officers entering betting shops or gambling while in uniform, due to reputational risks.\n\nThe announcement was made by National Police spokesperson Commissioner Paul Nyathi at the H-Metro National Forum On Responsible Betting, held in Harare over the weekend.\n\nThe forum, held in partnership with the Lotteries and Gaming Board, brought together government officials, regulators and industry stakeholders to discuss the rapid expansion of betting in Zimbabwe.\n\nThe discussion also touched on criminal cases linked to gambling misuse, including the conviction of a former manager who stole over $3,000 from his employer to fund a gambling addiction.\n\nHowever, betting industry representatives questioned the attribution of blame, arguing that some individuals may use gambling as a scapegoat for unrelated crimes.\n\nCommissioner Nyathi addressed growing concerns over law enforcements visibility in gambling environments, particularly after several viral images showed uniformed officers allegedly betting in shops, having said, This does not give a good picture of the countrys police force.\n\nThe ban is part of a wider push to strengthen regulation and safeguard the industrys growth, particularly as crash games continue to gain popularity across the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15015112/Police-Gambling-Betting-jpg.webp",
            "description": "<p>Gambling Insider Zimbabwe’s police force has introduced a ban on officers entering betting shops or gambling while in uniform, due to reputational risks. The announcement was made by National Police spokesperson Commissioner Paul Nyathi at the H-Metro National Forum On Responsible Betting, held in Harare over the weekend. The forum, held in partnership with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-police-officers-banned-from-betting-shops-while-in-uniform/\">Zimbabwe police officers banned from betting shops while in uniform</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        },
        {
            "title": "I never believed my child would one day have a birth certificate – Binga villager says in salute to ongoing remote registration blitz",
            "url": "https://www.newzimbabwe.com/i-never-believed-my-child-would-one-day-have-a-birth-certificate-binga-villager-says-in-salute-to-ongoing-remote-registration-blitz/",
            "content": "By Leopold Munhende recently in Binga\n\nWITH his wife seated on the carrier and their one-year-old son on her back, Honest Mudenda (28) cycled 10 kilometres on a perry bike to register a birth certificate last Wednesday, a two-hour ride through dense forests lined with all manner of wild animals found along Lake Kariba.\n\nOnly those who witnessed the couples smiles would understand how something so ordinary, so simple for most urbanites, can make a villager in far-flung Siamusanga, Binga happy.\n\nThe Mudenda family is one of many villagers in hard to reach areas that have benefited from a Civil Registration Department (CRD) led, Swedish government-funded and UNICEF-supported initiative to register birth certificates, national identity cards and death certificates.\n\nWearing brightly lit smiles, Mudenda said they were confident the certificate would change fortunes for their baby.\n\nThey live at Mujere Fishing Camp, some 198km from Binga Centre, on the shores of Lake Kariba, where internet is a luxury, radio signal is yet to reach and Zambia is a herd mans whistle away.\n\nThat Siamusanga is hard to reach is not up for discussion.\n\nElephants roam freely on the shores of the mighty Lake Kariba, and leopards and lions are not a rare sight too deep amongst the Tonga-speaking communities there.\n\nHonest Mudenda, a beneficiary of the ongoing programme, called for it to extend to their fishing camps that are also hard to reach.\n\nI never believed that one day my child would have a birth certificate. A lot of people in our community do not have these documents because there is nowhere to get them and Binga Centre is too far for them to travel to, said a visibly happy Mudenda.\n\nThere is no transport to get here from the fishing camp I work at, I for one used a bicycle to get here with my wife and child on the carrier, cautiously riding through forests which are usually full of wild animals.\n\nWe hope this programme continues so as to benefit more people; if it is possible, they can actually visit our camps too.\n\nBefore the satellite registration centre was opened, villagers had to travel 183km to Binga Centre, a distance that would be short were it tarred.\n\nIt is, however, a gruelling seven-hour drive, and costs no less than US$15 when using public transport, which is a fortune for simple fishermen.\n\nThe only public transport they know of is a ZUPCO bus that plies their route twice a week, on Wednesdays and Sundays, and even then, it does not get anywhere near Siamusanga. Its route ends about 60km from Siamusanga, at Chunga Growth Point.\n\n39-year-old Norah Mende, who proudly brandished her fifth childs new birth certificate, called for authorities to consider building a registry office closer to their remote villages.\n\nThe process is so smooth, I now have my sons birth certificate, have changed my ID and gotten my picture taken, said Mende with a giddy laugh. She walked four kilometres to the centre.\n\nThis facility should not leave this area because a lot of people do not have these documents and without it, we have to go to Siabuwa or Binga. Our children need these documents to attend school and write examinations, now consider that children are born every year.\n\nA young lady giving details as officials take them down to process her first ever identify card at Siamusanga Primary School.\n\nBinga, just like Mwenezi, is considered a hard-to-reach area, where villagers and animals share resources, clash often, and far more depressing, where basic services are hardly accessible.\n\nThere is 150km of partially tarred road between Cross Dete (along the Bulawayo-Victoria Falls highway) and Binga, most of which is a strip of a potholed former road.\n\nThe place is so far flung, Zambia could easily have claimed it and most Zimbabweans would not know of it.\n\nUp until the Zimbabwean, Swedish governments, and UNICEFs recent intervention, tens of thousands lived and died without having procured a birth certificate or national identity document, not for a shortage of need but access.\n\nThis is part of a broader programme that the CRD is embarking on in collaboration with UNICEF, where we are going around eight rural provinces of Zimbabwe targeting hard-to-reach areas to issue birth, death certificates and national IDs, said Christina Chikerema, the CRDs Deputy Registrar General in Charge of Operations.\n\nBy targeting hard-to-reach areas, we are ensuring that we leave no one and no place behind. So far, we have been to Chikombedzi (Masvingo Province), Mhangura (Mashonaland West) and Mangwe (Matabeleland South).\n\nOur partnership with the Swedish government and development partners such as UNICEF is very key in this programme.\n\nTraditional leaders also have been roped in the drive that has seen them taking on the responsibility to teach their communities on the process, encourage them to take identity documents and also register births that occur within their areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15011841/WhatsApp-Image-2025-07-14-at-18.45.33.jpeg",
            "description": "<p>By Leopold Munhende recently in Binga WITH his wife seated on the carrier and their one-year-old son on her back, Honest Mudenda (28) cycled 10 kilometres on a perry bike to register a birth certificate last Wednesday, a two-hour ride through dense forests lined with all manner of wild animals found along Lake Kariba. Only</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-never-believed-my-child-would-one-day-have-a-birth-certificate-binga-villager-says-in-salute-to-ongoing-remote-registration-blitz/\">I never believed my child would one day have a birth certificate – Binga villager says in salute to ongoing remote registration blitz   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        },
        {
            "title": "How Zimbabwe became the home of African guitar music",
            "url": "https://www.newzimbabwe.com/how-zimbabwe-became-the-home-of-african-guitar-music/",
            "content": "Chimuerenga means uprising, not in a metaphorical sense either. Its a Shona word that loosely translates into revolutionary struggle. It has been adapted into the word commonly used whenever peopleprotestand start pushing back against the political structures keeping them oppressed. In the culture of Zimbabwe, this is a word that, sadly, is deployed a lot. So much so that its developed a second meaning, describing the genre of music that came from Zimbabwe in the mid-1960s.\n\nThis was a time before the country was officially referred to as Zimbabwe as well. From 1923 to 1965, the country was under British occupation and referred to as Southern Rhodesia. After the British upped sticks, the name was shortened to Rhodesia at the insistence of its majority white government, which was desperately seeking to maintain control of the country in the face of a growing insurgency movement lead by Black nationalist groups.\n\nAll moments of civil unrest need a soundtrack and this conflict, known as the Rhodesian Bush War, had an absolute banger. Thomas Mapfumo was a native Zimbabwean who sought to take music traditional to Shona culture and combine it with American and British rock and roll music. His way into this was to take tunes, phrases and riffs that would normally be played on one of the national instruments of Zimbabwe, the mbira, andtranscribe them to the electric guitar.\n\nMapfumo first hit record came at the end of the 1970s, when the conflict between the Zimbabwean People and their government was at an all time high. The record, titledHokoyo!(Watch Out!in English) was a tense, politically charged effort that caught the attention of the government. Mapfumo was imprisoned without charge and the outrage that followed was one of the reasons that then-Rhodesian Prime Minister Ian Smith conceded to majority rule in 1978.\n\nWhile Mapfumo was the biggest name of the era, earning the nickname The Lion of Zimbabwe with his incediary protest music, he wasnt alone. The Great Sounds, OK Success, MD Rhythm Success, the Harare Mambos, the Hallelujah Chicken Run Band and the Acid Band were all taking Mapfumos mix of traditional sounds and modern instrumentation and making some of the most vital and joyous music of the era.\n\nThis coincided with a time in mainstream pop culture when the the patronisingly named concept of world music was beginning to take shape.African musicwas making headway in the mainstream in a way it had never done before, and there were several bands ready to take Chimurenga music, along with its more upbeat and poppier descendant jit music, right into charts from all over the world. One band above all others seemed set to do just that.\n\nBhundu Boys was the name given to the young boys that aided nationalist guerilla fighters in the conflict against the government in the 1970s. One of them, Biggie Tembo, started a band when the conflict ended and decided to name said band after that title. After becoming national heroes in Zimbabwe in the early 1980s, they were spotted by a number of high-profile UK music exectutives that sought to make them a name in the UK and beyond.\n\nTheir downfall is its own story, but The Bhundu Boys were living proof of one thing above all. That African music can capture an international audiencejust as well as anyone else. The likes of Tinariwen, Burna Boy and Wizkid are the descendants of Mapfumo and the Bhundu Boys, and Im sure those leading lights of the genre wouldnt have it any other way.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15013622/How-Zimbabwe-became-the-home-of-African-guitar-music-Far-Out-Magazine.webp",
            "description": "<p>By Will Howard, Far Out Chimuerenga means ‘uprising’, not in a metaphorical sense either. It’s a Shona word that loosely translates into “revolutionary struggle”. It has been adapted into the word commonly used whenever people protest and start pushing back against the political structures keeping them oppressed. In the culture of Zimbabwe, this is a word that,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-zimbabwe-became-the-home-of-african-guitar-music/\">How Zimbabwe became the home of African guitar music</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        },
        {
            "title": "Man slapped with two life sentences for in-laws’ brutal murder",
            "url": "https://www.newzimbabwe.com/man-slapped-with-two-life-sentences-for-in-laws-brutal-murder/",
            "content": "By Staff Reporter\n\nTHE High Court has slapped a Plumtree man, who gruesomely killed his in-laws in 2022, with two life imprisonment sentences.\n\nTafirei Ndlovu, whose age was not given, was found guilty on two counts of murder by the High Court sitting in Bulawayo.\n\nThe court held that the cold-blooded killings were committed in Plumtree under aggravated circumstances, noting that they were premeditated and involved gratuitous violence.\n\nCourt heard that on April 14, 2022, Ndlovu, acting in connivance with his accomplice Kudzanai Mathukuthu, who is still at large, murdered his father-in-law, Xolani Mpofu and mother-in-law, Sibalungele Ncube.\n\nThe victims were savagely assaulted with axes before being dragged into a kitchen hut, which was then set alight. The harrowing incident unfolded around 2am and witnessed by Nomusa Nyoni, who is Ndlovus wife and the daughter of the deceased.\n\nIt was heard that the attack stemmed from an estrangement between Ndlovu and his wife, who had left their matrimonial home in Botswana in April 2022 after 13 years of marriage as a result of marital problems. Her return to her parents home angered Ndlovu.\n\nCourt heard that the previous day before the incident, Ndlovu contacted his mother-in-law, claiming he wanted to reconcile with his wife and the rest of the family.\n\nHowever, he arrived in the dead of the night and committed the heinous murders before kidnapping his wife, forcing her to cross back illegally into Botswana. Fortunately, she managed to alert border police on patrol and informed them of her kidnapping and her parents murder.\n\nThe pair fled the scene but Ndlovu was apprehended before making good his escape, while his co-accused disappeared and is still at large.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter THE High Court has slapped a Plumtree man, who gruesomely killed his in-laws in 2022, with two life imprisonment sentences. Tafirei Ndlovu, whose age was not given, was found guilty on two counts of murder by the High Court sitting in Bulawayo. The court held that the cold-blooded killings were committed in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-slapped-with-two-life-sentences-for-in-laws-brutal-murder/\">Man slapped with two life sentences for in-laws’ brutal murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        },
        {
            "title": "Industrial supplies dominate Zimbabwe’s import list",
            "url": "https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/",
            "content": "By Alois Vinga\n\nINDUSTRIAL supplies dominated Zimbabwes import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed.\n\nThe RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and Transport and Equipment US$73,7 million.\n\nOut of the US$818,3 million spent during the period, just US$98,3 million and US$44,5 million was spent on food and consumer goods.\n\nZimbabwe is currently pursuing an industrial turnaround strategy with the objective to align with Vision 2030 as well as minimise the huge foreign exchange expenditure on the importation of simple consumables.\n\nThe countrys imports were mainly sourced from South Africa (37.1%), China (14.5%), Bahrain (10.4%), the Bahamas (7.4%), and Mozambique (3.8%). The remainder of the imports came from various other markets.\n\nDuring April 2025, the countrys trade deficit narrowed to US$118.7 million, from US$235.2 million recorded in the previous month. Relative to April 2024, the trade deficit narrowed from US$206.1 million to US$118.7 million in the reporting month.\n\nThe countrys merchandise exports increased by 13.6% to US$662.6 million, from the previous months outturn of US$583.1 million. The increase was largely underpinned by growth in export earnings from gold, platinum group of metals (PGMs) and diamond.\n\nOn a year-on-year basis, exports were 29.0% higher compared to US$513.5 million recorded in April 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15010733/pump-and-steel-supplies-zimbabwe-0009a-scaled-1.jpg",
            "description": "<p>By Alois Vinga INDUSTRIAL supplies dominated Zimbabwe’s import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed. The RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/\">Industrial supplies dominate Zimbabwe’s import list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        },
        {
            "title": "Warriors midfielder Maswanhise aims big in Scottish league",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-maswanhise-aims-big-in-scottish-league/",
            "content": "By Sports Reporter\n\nWarriors midfielder Tawanda Maswanhise has set his sights high at Motherwell FCthis season in the Scottish Premier Soccer League after kicking off his campaign with two goals over the weekend.\n\nMaswanhise scored a brace over the weekend against Clyde FC in the Premier Sports Cup, which was the first competitive match for his side this season.\n\nSo important were the two goals that it saw his side picking a draw in regulation time (2-2) before they won 5-4 on penalties to proceed to the next round.\n\nIm happy to kick-start the campaign with two goals.\n\nI really want to get more goals this season and Im just delighted with the two goals.\n\nThere is always room for improvement, but I have set myself higher goals this season because I know what the leagues, said Maswanhise.\n\nMotherwell FC will be in action on Tuesday when they play Peterheadin the second match of the season, and all eyes will be on the Zimbabwean midfielder to deliver.\n\nWith new coach Jens Berthel, who joined the side in June, Maswanhise added that he is happy to be given first-team preference.\n\nIts good that I have been through one or two managers now.\n\nObviously, its my first season in professional football, so Im taking on board what he is doing and its going really well so far.\n\nSo Im happy that Im being selected for the team, really, he added.\n\nThis season will be the second in a row for Maswanhise, who joined Motherwell last season.\n\nThe 22-year-old won Motherwells best goals of the season (2024-25), and all eyes will be on him this season under new manager Jens Berthel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/31090359/IMG-20241031-WA0003.jpg",
            "description": "<p>By Sports Reporter Warriors midfielder Tawanda Maswanhise has set his sights high at Motherwell FC this season in the Scottish Premier Soccer League after kicking off his campaign with two goals over the weekend. Maswanhise scored a brace over the weekend against Clyde FC in the Premier Sports Cup, which was the first competitive match for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-maswanhise-aims-big-in-scottish-league/\">Warriors midfielder Maswanhise aims big in Scottish league</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        },
        {
            "title": "Revolutionising transport, Click A Ride making travel safer and cheaper",
            "url": "https://www.newzimbabwe.com/revolutionising-transport-click-a-ride-making-travel-safer-and-cheaper/",
            "content": "By Staff Reporter\n\nRIDE-hailing company Click A Ride is making headway, revolutionising the local e-transport system by offering unique services ranging from cheaper prices to watertight security features.\n\nDespite starting as an idea last year, the fully functional mobile application launched in March this year has been making inroads in the local e-hailing system.\n\nClick A Ride is a locally tailored product designed to offer seamless services to passengers, with security features that enhance client safety.\n\nTinotenda Chinembiri, one of the companys founders, said this sets the platforms services apart, as they collaborate with the Zimbabwe Republic Police (ZRP) officers whenever passenger or driver safety is compromised.\n\nThe application requires data. This enhances security for the passenger at all times. It also enables us to know who the passenger is, where they are going, and any other necessary information. This helps safeguard both the passenger and the driver. There had been rising cases of robberies in taxis.\n\nThe security features reduce the risk of robberies for both the driver and the passenger. We can trace whenever a car goes off route, and we work with relevant security services, including the police, whenever safety is compromised, said Chinembiri.\n\nHe added that thorough security checks for drivers have been praised by clients.\n\nWe have been receiving feedback on our security system. If you give the driver a parcel, there is an one-time password OTP that one receives, making it easier to track the goods. We conduct thorough verification when someone joins our platform, which makes tracking easier, he explained.\n\nThe ride-hailing platform also keeps costs low, offering affordable services to its customer base. It allows both drivers and passengers to negotiate fares, giving them control over ride terms.\n\nChinembiri said the application is synonymous with lower transport costs for passengers, and drivers benefit from commission.\n\nGone are the days when people were charged based solely on their destination. With Click A Ride, you can charge a passenger per kilometre, which is cheaper. Passengers can also select their own prices. We also have lower commissions and conduct driver training sessions to reduce service conflicts, he said.\n\nClick A Ride offers taxi services, premium vehicle hire, parcel delivery via motorcycles, three-wheelers, trucks, and emergency towing services, making it the first platform in Zimbabwe to provide such a wide range of options.\n\nAdditionally, clients can choose from different service tiers, bronze, silver, gold, and platinum, with the latter offering top-notch services.\n\nClick A Ride enables users to access emergency taxis. If you have a business and sell goods online, our bikes help with deliveries. We also have scooters at the same prices as bikes and assist in moving heavy goods.\n\nOur application will soon be updated to include goods-in-transit insurance, which will be visible and help with compensation in case of accidents, Chinembiri added.\n\nCurrently, Click A Ride is running a weekly competition where top clients stand to win US$100 or even a motor vehicle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15004739/IMG-20250711-WA00211.jpg",
            "description": "<p>By Staff Reporter RIDE-hailing company Click A Ride is making headway, revolutionising the local e-transport system by offering unique services ranging from cheaper prices to watertight security features. Despite starting as an idea last year, the fully functional mobile application launched in March this year has been making inroads in the local e-hailing system. Click</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/revolutionising-transport-click-a-ride-making-travel-safer-and-cheaper/\">Revolutionising transport, Click A Ride making travel safer and cheaper</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        },
        {
            "title": "DRC nationals in court for smuggling skin bleaching creams into Zimbabwe",
            "url": "https://www.newzimbabwe.com/drc-nationals-in-court-for-smuggling-skin-bleaching-creams-into-zimbabwe/",
            "content": "By Staff Reporter\n\nTWO men from the Democratic Republic of Congo (DRC) have appeared in court facing a charge of smuggling skin bleaching creams into Zimbabwe.\n\nAccused persons, Aurora Mujinga (35) and Lolo Kapamba (45), appeared before the Chinhoyi Magistrates Court, where they were convicted of the crime.\n\nThe pair was sentenced to pay a US$200 fine each or in default, spend the next four months in jail. In addition to the sentence, the contraband was forfeited to the State.\n\nThe prosecutor told the court that on June 29, 2025, at Chirundu One-Stop Border Post, the offenders unlawfully imported a significant quantity of various goods from Zambia into the country without the required permits.\n\nCourt heard that at around 6pm on the same day, detectives from the Criminal Investigations Department (CID) received a tip-off that there were smuggled goods aboard a CAG bus parked at the Chirundu bus terminus.\n\nThe cops proceeded to the rank and directed the bus to the Zimbabwe Revenue Authority (ZIMRA) Chirundu yard for a search.\n\nDuring the search, three bags were found containing a variety of items, including bleaching products namely CT Plus, Lemon Plus, Dema Clair, Mark Clear, Extra Clear, Infirm Clear, Princes Clear, and Coco Pulp, which are cosmetic or medicinal creams/liquids.\n\nThe duo claimed to have purchased the goods in Zambia but could not produce any customs documentation to prove declaration to ZIMRA customs leading to their arrest. The following day, the recovered goods were seized by authorities.\n\nIn passing sentence, the magistrate noted that the defendants had shown disregard for the law and the potential harm caused by the products. However, considering they were first offenders and had pleaded guilty, the court decided to impose a fine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15011638/Skin-lightening-creams.jpeg",
            "description": "<p>By Staff Reporter TWO men from the Democratic Republic of Congo (DRC) have appeared in court facing a charge of smuggling skin bleaching creams into Zimbabwe. Accused persons, Aurora Mujinga (35) and Lolo Kapamba (45), appeared before the Chinhoyi Magistrates’ Court, where they were convicted of the crime. The pair was sentenced to pay a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drc-nationals-in-court-for-smuggling-skin-bleaching-creams-into-zimbabwe/\">DRC nationals in court for smuggling skin bleaching creams into Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "15 Jul 2025"
        }
    ]
}