{
    "news": [
        {
            "title": "Man arrested at Beitbridge border, driving ‘stolen’ luxury BMW into Zimbabwe",
            "url": "https://www.newzimbabwe.com/man-arrested-at-beitbridge-border-driving-stolen-luxury-bmw-into-zimbabwe/",
            "content": "By IOL\n\nA 40-year-old foreign national is expected to appear in court after he allegedly tried to drive a luxury BMW across the border into Zimbabwe on New Years Eve.\n\nPolice said officers were on duty at the Beitbridge Port of Entry when they spotted a man driving a black BMW G70, 7 Series, valued at over R2 million. The man wanted to drive over into Zimbabwe.\n\nThe man had a South African passport. Preliminary investigation reveals that the vehicle is wanted by one of the banks in South Africa. The driver alleged that the real owner will be flying to South Africa on January 1, said police spokesperson, Lieutenant Colonel Stephen Thakeng.\n\nHe said the man was arrested and charged for possession of a suspected stolen vehicle and providing the SAPS with fraudulent documents.\n\nThe vehicle was seized. He will appear on January 3 in the Musina Magistrates Court.\n\nLimpopo police commissioner, Lieutenant General Thembi Hadebe applauded the members who were vigilant to ensure that the suspect was brought to book to face the full might of the law.\n\nShe added that its the results of more boots on the ground during festive season.\n\nMeanwhile, Deputy Minister of Police, Polly Boshielo, MEC for Community Safety and Transport, Violet Mathye, Vhembe District Executive Mayor, councillor Freda Nkondo and commissioner Hadebe, led the annual Safer Festive Season Operational-Inspection Tour at Musina and Beitbridge Port of Entry.\n\nThe visit was part of efforts to fight cross-border crimes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03111610/The-black-BMW-G70-7-Series-of-2023-worth-over-R2-million-seized-by-police-at-the-South-Africa-Zimbabwean-border.webp",
            "description": "<p>By IOL  A 40-year-old foreign national is expected to appear in court after he allegedly tried to drive a luxury BMW across the border into Zimbabwe on New Year’s Eve. Police said officers were on duty at the Beitbridge Port of Entry when they spotted a man driving a black BMW G70, 7 Series, valued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-arrested-at-beitbridge-border-driving-stolen-luxury-bmw-into-zimbabwe/\">Man arrested at Beitbridge border, driving ‘stolen’ luxury BMW into Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "Mozambique – The Emerging Southern Africa Energy giant",
            "url": "https://www.newzimbabwe.com/mozambique-the-emerging-southern-africa-energy-giant/",
            "content": "By Noel T Ngangira\n\nPut aside the recent political turmoil, Mozambique set in motion an energy juggernaut plan that left many African nations drooling in awe.\n\nLets rewind a bit. In 2023, energy exports from coal, gas, and electricity topped US$5.8 billion. Coal led the pack with $3.4 billion, followed by gas at $1.73 billion and electricity ($658 million). 80% of its electricity exports went to SA and 15.4% to Zimbabwe.\n\nWith 180 trillion cubic feet of natural gas reserves mainly in the Rovuma Basin off the coast of Cabo Delgado, Mozambique is only bettered by Nigeria (with 203 trillion cubic feet) in Africa. It ranks 14th in the world. Energy giants TotalEnergies (France), Exxon Mobil (USA), Eni (Italy) and CNPC (China) are the key LNG operators in Mozambique.\n\nCahora Bassa Hydro power station in Tete province has a power generation capacity of 2,075MW, and plans are underway to increase it to 4,000MW. The following hydroelectric power plants are also in the pipeline and will be online between 2027 and 2031: Mphanda Nkuwa, 1,500MW (Tete); Chemba, 1,000 MW (Sofala); Lupata, 650MW (Tete); and Boroma, 210MW (Tete). This is hydropower only; there is solar and thermal to boot.\n\nFor comparison, Zimbabwe generates about 1,500MW but has an installed capacity of about 2,240MW (hydro and thermal). According to the 2022 Population and Housing Census, 62% of Zimbabwes population has access to electricity  though its not mentioned how many hours per day was/is the electricity actually available.\n\nAccording to the International Trade Administration (ITA), Mozambique aims to achieve universal electrification by 2030. Significant strides to achieve this goal have been made. It moved from 34% in 2021 to 48% in 2022 in terms of population with access to electricity. With the investments made and the work in progress, energy for all is within reach for sure.\n\nThe Mozambican government plans an additional 14,000MW of green energy (hydro) between 2030 and 2040. In its energy transition strategy document, the government plans a whooping US$80 billion investment in the energy sector by 2050. Serious stuff!\n\nITA adds that Mozambique has the largest power generation potential of all Southern African countries. Power Africa estimates that the nation could generate 187 gigawatts (187,000MW) of power from coal, hydro, gas, wind, and solar.\n\nSources include Global Data, Club Mozambique, International Trade Administration (ITA), Power Africa, ADB COP28, and UNICEF.\n\nNoel T Ngangira writes in his personal capacity. He can be contacted at ntngangira@gmail.com\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03104119/moza-.webp",
            "description": "<p>By Noel T Ngangira Put aside the recent political turmoil, Mozambique set in motion an energy juggernaut plan that left many African nations drooling in awe. Let’s rewind a bit. In 2023, energy exports from coal, gas, and electricity topped US$5.8 billion. Coal led the pack with $3.4 billion, followed by gas at $1.73 billion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambique-the-emerging-southern-africa-energy-giant/\">Mozambique – The Emerging Southern Africa Energy giant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "SA border authorities working with Zimbabwe to prevent entry of illegal immigrants",
            "url": "https://www.newzimbabwe.com/sa-border-authorities-working-with-zimbabwe-to-prevent-entry-of-illegal-immigrants/",
            "content": "By SABC\n\nTHE Border Management Authority (BMA) says its working with its Zimbabwean counterparts to prevent illegal immigrants from entering South Africa.\n\nBMA Commissioner, Dr Michael Masiapato assessed readiness at the biggest land port, the Beitbridge Border Post, between Zimbabwe and South Africa yesterday ahead of the end of the festive season.\n\nThe border post is a critical gateway linking South Africa with the Southern African Development Community (SADC) region.\n\nAuthorities launched a crime-fighting campaign yesterday to address pressing challenges.\n\nDr Masiapato says they expect to see an increase in vehicles and people towards the end of the weekend.\n\nWith its high volume of travellers and goods, the border post also serves as a hotspot for illicit activities, including the smuggling of contraband.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03092510/Beitbridge-Border-X-%40SAPoliceService-resized.jpg",
            "description": "<p>By SABC THE Border Management Authority (BMA) says it’s working with its Zimbabwean counterparts to prevent illegal immigrants from entering South Africa. BMA Commissioner, Dr Michael Masiapato assessed readiness at the biggest land port, the Beitbridge Border Post, between Zimbabwe and South Africa yesterday ahead of the end of the festive season. The border post</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sa-border-authorities-working-with-zimbabwe-to-prevent-entry-of-illegal-immigrants/\">SA border authorities working with Zimbabwe to prevent entry of illegal immigrants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "Armyworm outbreak hits Mashonaland East province",
            "url": "https://www.newzimbabwe.com/armyworm-outbreak-hits-mashonaland-east-province/",
            "content": "By Staff Reporter\n\nZIMBABWE Commercial Farmers Union (ZCFU) president, Shadreck Makumbe has warned farmers to be on the lookout for armyworms during the ongoing rain season.\n\nThis comes after a number of African army worm attacks have been reported by farmers in Mashonaland East province.\n\nThe African army worm has for years been a problem to Zimbabwean farmers, and it emerges during wet seasons, attacking cereal crops mainly maize, wheat and sorghum.\n\nIn an interview with New Zimbabwe.com, Makumbe encouraged farmers to be alert and report any case to Agritex officers so as to help curb the spread of the pests.\n\nWe encourage farmers to be alert and on the lookout for the Fall Armyworm and African armyworm.\n\n We advise farmers to report infestations to local Agritex officers or the Migratory Pests Department.\n\nCurrently, the situation is not dire, although there are isolated areas under attack, he said.\n\nAccording to the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, the first case of African army worm was recorded on December 23, 2024, and efforts are already underway to curb the spread of the pests.\n\nWe dont expect to be too devastated because we are already on top of it, and we are prepared as government to be able to control it.\n\nWe have enough stock of chemicals that are required to curb the spread of the pests.\n\nOur Migratory Pests Department is geared, and they have been setting traps across the country, and already they are on the ground in Mashonaland East, said the Agriculture ministrys permanent secretary, Obert Jiri.\n\nAt present, the African army worm is said to have affected seven hectares of maize and four hectares of pasture in Mashonaland East province.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/04190040/army-worm1.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE Commercial Farmers Union (ZCFU) president, Shadreck Makumbe has warned farmers to be on the lookout for armyworms during the ongoing rain season. This comes after a number of African army worm attacks have been reported by farmers in Mashonaland East province. The African army worm has for years been a problem</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/armyworm-outbreak-hits-mashonaland-east-province/\">Armyworm outbreak hits Mashonaland East province</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "Dynamos FC’s longest serving team manager Chihoro dies",
            "url": "https://www.newzimbabwe.com/dynamos-fcs-longest-serving-team-manager-chihoro-dies/",
            "content": "By Sport Reporter\n\nFORMER Dynamos player and team manager Richard Chihoro has died.\n\nAged 68, Chihoro passed on Thursday night at a hospital in the capital. Details that led to his demise are yet to be revealed.\n\nChihoro kicked off his football journey at Dynamos juniors in the late 60s before joining the senior team.\n\nAlthough he did not make much impact as a player, Chihoro made his name at the club as a team manager, a role he served for more than 10 decades winning multiple silverwares with the Glamour Boys.\n\nNicknamed Nyoka, Chihoros relationship with Dynamos had turned sour in the past two year as he was fired and re- hired twice before the parties divorced last October.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03091306/GgWeTZLWoAAfTzj.jpeg",
            "description": "<p>By Sport Reporter FORMER Dynamos player and team manager Richard Chihoro has died. Aged 68, Chihoro passed on Thursday night at a hospital in the capital. Details that led to his demise are yet to be revealed. Chihoro kicked off his football journey at Dynamos juniors in the late 60s before joining the senior team.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-fcs-longest-serving-team-manager-chihoro-dies/\">Dynamos FC’s longest serving team manager Chihoro dies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "WATCH: Flooding as heavy downpour is recorded in Chipinge",
            "url": "https://www.newzimbabwe.com/watch-flooding-as-heavy-downpour-is-recorded-in-chipinge/",
            "content": "By Staff Reporter\n\nTHE New Year 2025 was marked with a heavy downpour of rains in the town of Chipinge, Manicaland province, triggering flooding in shops and houses.\n\nThis Thursday, the eastern border town recorded above normal rainfall, which resulted in flooding of properties thereby exposing the poor drainage system.\n\nIn one viral video posted by an anonymous shopper at the countrys leading retail chain store, TM Supermarket, excitable shoppers are immersed in water up to ankle level.\n\nWe are literally swimming under water here at TM Chipinge, the female shopper is heard saying in the footage.\n\nChipinge is located on the southeastern side of Zimbabwe, close to the border with Mozambique, and is part of the area devastated by Cyclone Idai in 2019, the other being Chimanimani.\n\nThe district is the largest producer of tea, coffee, dairy milk and timber and is associated with heavy rainfall.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/11/12094652/Chipinge.jpeg",
            "description": "<p>By Staff Reporter  THE New Year 2025 was marked with a heavy downpour of rains in the town of Chipinge, Manicaland province, triggering flooding in shops and houses. This Thursday, the eastern border town recorded above normal rainfall, which resulted in flooding of properties thereby exposing the poor drainage system. In one viral video posted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-flooding-as-heavy-downpour-is-recorded-in-chipinge/\">WATCH: Flooding as heavy downpour is recorded in Chipinge </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "Drunken Zambian policeman freed 13 suspects to celebrate New Year",
            "url": "https://www.newzimbabwe.com/drunken-zambian-policeman-freed-13-suspects-to-celebrate-new-year/",
            "content": "By BBC\n\nA DRUNKEN police officer in Zambia freed 13 suspects from custody so that they could go and celebrate the new year, officials say.\n\nDetective inspector Titus Phiri was arrested after releasing the suspects from Leonard Cheelo police station in the capital, Lusaka, before running away himself.\n\nThe 13 detainees were accused of crimes such as assault, robbery and burglary.\n\nThey are all currently on the run and a manhunt has been launched to find them.\n\nPolice spokesperson Rae Hamoonga said that Mr Phiri, in a state of intoxication, forcibly seized cell keys from constable Serah Banda on New Years Eve.\n\nSubsequently, detective inspector Phiri unlocked both the male and female cells and instructed the suspects to leave, stating they were free to cross over into the new year, he said.\n\nOut of the 15 suspects in custody, 13 escaped. Following the incident, the officer fled the scene.\n\nMr Phiri has not yet commented on the allegations.\n\nReacting to the incident, former presidential spokesperson and lawyer Dickson Jere wrote on Facebook: I keep laughing each time I picture the scenario  comical! But then, I remembered a similar incident in 1997.\n\nOn New Years Eve in 1997, the late, controversial High Court Judge Kabazo Chanda ordered the release of 53 suspects, some of whom were deemed dangerous by the police.\n\nMr Chanda was annoyed that the suspects had been arrested as long ago as 1992, but had not yet appeared in court.\n\nJustice delayed, is justice denied, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03052152/920c3cf0-c910-11ef-94cb-5f844ceb9e30.jpg.jpeg",
            "description": "<p>By BBC  A DRUNKEN police officer in Zambia freed 13 suspects from custody so that they could go and celebrate the new year, officials say. Detective inspector Titus Phiri was arrested after releasing the suspects from Leonard Cheelo police station in the capital, Lusaka, before running away himself. The 13 detainees were accused of crimes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drunken-zambian-policeman-freed-13-suspects-to-celebrate-new-year/\">Drunken Zambian policeman freed 13 suspects to celebrate New Year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "Winky D reflects on a year of trials and triumphs as 2025 kicks off",
            "url": "https://www.newzimbabwe.com/winky-d-reflects-on-a-year-of-trials-and-triumphs-as-2025-kicks-off/",
            "content": "By Tapiwa Svondo\n\nAS the new year 2025 begins to unfold, lyrical genius, Wallace Chirumiko popularly known as Winky D or Gaffa President invited his fans to embark on his reflective odyssey, marked by personal and professional hurdles.\n\nIn a heartfelt message to his fans, the music icon expressed the need to pause and contemplate the past year of 2024.\n\nAs we start a new year, I am compelled to pause and reflect on what was, what is, what could have been, and what was not. As I confuse thyself in the bars of the prison that is my mind.\n\nThis journey has been a tapestry woven with threads of trials and triumphs. Each moment a stitch in the fabric of the collective nation called GAFA, said Winky D.\n\nIn this tumultuous year, Winky D discovered flickers of joy amid the shadows. As the year 2024 drew to a close, he faced significant hurdles that threatened to overwhelm him.\n\nOne of the most challenging moments was losing his beloved venue, the Harare International Conference Centre (HICC), known affectionately as paJabuna, where he has hosted his iconic New Years Eve shows.\n\nDespite securing the place as early as May 2024, the venue was in a biased manner given to gospel musician Everton Mlalazi, who has strong ties to the Zanu PF acolyte Kudakwashe Tagwirei.\n\nThis unexpected setback was a heavy blow for the artist, who expressed, Amidst the tempest, we found flickers of joy and connection through music. Towards the end, I faced hurdles that overwhelmed my feeble heart.\n\nAnxiety gripped me as I pondered how to close this chapter on a high note, said the dreadlocked artist.\n\nThe loss of the HICC venue was described as sabotage, yet, amidst this uncertainty, a beacon of hope emerged as his loyal fans in the United Kingdom and Bulawayo embraced his last shows of the year.\n\nYour presence at my live shows in the UK and Bulawayo became the beacon of light during dark hours!\n\nDances on the edge of uncertainty, anxiety and excitement fought within me. But you, the Gafas, sang along. Hope flickered anew.\n\nYour unwavering loyalty and vibrant enthusiasm reminded me of the profound unbreakable bond we have shared over the years.\n\nBefore the HICC debacle, Winky D in 2023 faced a ban on State media over Eureka Eureka, only to be unbanned in 2024 according to NewZimbabwe.com sources.\n\nHowever, certain songs from Winky Ds Eureka Eureka album, such as Ibotso and Dzimba Dzemabwe, remain banned.\n\nDuring his 2023-2024 New Years Eve concert, Winky D acknowledged the impact of the blackout on his music.\n\nFrom 2004 up until 2024, 2023 was the most difficult year for me musically, said Winky D.\n\nI could not get an interview on the radio for the show. I only had the internet and dreams and then you (fans), he further said.\n\nAs the new year dawns, the GAFA, stands ready to embrace whatever challenges and triumphs await, thanking his fans for their love and loyalty towards him and his Vigilance Band.\n\nEach note I play and every lyric I sing is dedicated to you. Your energy fuels my creativity and commitment to our cause. Thank you for being my strength during these trying times.\n\nYour support transcends words; it is a lifeline that propels me forward. Together, let us carry this momentum into the new year, embracing both challenges and triumphs that might await us on the horizon.\n\nHappy Twenty Twenty Strive, he wrote.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/08090848/ZimFest-18.png",
            "description": "<p>By Tapiwa Svondo  AS the new year 2025 begins to unfold, lyrical genius, Wallace Chirumiko popularly known as ‘Winky D’ or ‘Gaffa President’ invited his fans to embark on his reflective odyssey, marked by personal and professional hurdles. In a heartfelt message to his fans, the music icon expressed the need to “pause” and contemplate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/winky-d-reflects-on-a-year-of-trials-and-triumphs-as-2025-kicks-off/\">Winky D reflects on a year of trials and triumphs as 2025 kicks off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "Jah Prayzah fans angered by his praises for Wicknell Chivayo",
            "url": "https://www.newzimbabwe.com/jah-prayzah-fans-angered-by-his-praises-for-wicknell-chivayo/",
            "content": "By Staff Reporter\n\nCELEBRATED musician Mukudzeyi Mukombe also known as Jah Prayzah has drawn widespread condemnation from his fans over his effusive praise for controversial tenderpreneur, Wicknell Chivayo, who has lately been gifting cars and cash.\n\nChivayo, known for his close ties to the ruling party, Zanu PF, and his dubious reputation as a tenderpreneur, the endorsement has raised serious ethical questions by Jahs followers over his post.\n\nIn a Facebook post dripping with adoration, Jah Prayzah referred to Chivayo as a blesser par excellence.\n\nBorn with an open hand that uplifts the orphans, the widows and less privileged. In front of you there are no strangers but only children of God, with this you are a blessing to this nation as we have never witnessed this huge kind of love.\n\nThe gifts you offer are received by those who accept them like the rains from God that suddenly pour down, and we cast our seeds into the ground, he said.\n\nWith such rhetoric, while appealing on the surface, is deeply misleading and raises eyebrows in a nation that has witnessed the detrimental impact of Chivayos business practices.\n\nHis tenure as a controversial businessman has often been marred by allegations of corruption, leaving many Zimbabweans questioning his integrity, and leaving the country bleeding.\n\nBootlicking Jah Prayzah himself last year received lavish gifts from Chivayo, including a $180,000 Mercedes Benz S500 becoming the most expensive car gifted a musician in the country.\n\nFollowing the recent Harare shutdown show in November, his female dancers were also gifted with Toyota Aquas, and he was also given an additional $20,000.\n\nThe fans in his Facebook comment section have pointed at serious concerns about whether his rosy lifestyle has clouded his judgment and led him to overlook the troubling realities of those he claims to uplift, as they are seen as people who already have a background to work on their own but are the ones mostly benefitting from Chivayos unquestionable source of income.\n\nJah Prayzah also posed troubling questions, Do you think blessings would fail to multiply through the hearts of many you have pleased? Do you think they would fail to love you for your goodness or for your excellent deeds? Do you think that even God Himself would fail to add blessings on top of others? Out of respect for you, we give you honor; your dignity will forever be associated with your name. Your actions increase the glory of Gods goodness, said Jah\n\nThe award-winning artists praises to Chivayo have alienated the very fans who have supported him through thick and thin, many of whom are disillusioned by the rampant corruption that has plagued their lives.\n\nBELOW IS JAH PRAYZAH SHONA STATEMENT CONVERTED TO ENGLISHYou were born with an open hand that uplifts the orphans, the widows and less privileged. In front of you there are no strangers but only children of God, with this you are blessing to this nation as we have never witnessed this huge kind of love.The blessings that you get from the heavens, along with your hard-earned money you get from your own sweat, that you pray and fast for, you also give to others.You are like a large river that when it overflows it shares its waters to other rivers.Like a tree that, when it bears fruit, it drops some to sustain animals, birds, and humans.The gifts you offer are received by those who accept them like the rains from God that suddenly pours down, and we cast our seeds into the ground.Your name has not been raised through insults, criticism, or by belittling the spirit of others. Those who know you recognize you by your generosity like Kupakwashe Scott Sakupwanya, without an endless giving from a spring that never runs dry.Do you think blessings would fail to multiply through the hearts of many you have pleased? Do you think they would fail to love you for your goodness or for your excellent deeds? Do you think that even God Himself would fail to add blessings on top of others? Out of respect for you, we give you honor; your dignity will forever be associated with your name. Your actions increase the glory of Gods goodness.Everything you plan with your efforts may it succeed, may you be added with more wisdom because it enhances wealth through unification and reconciliation.May your health be preserved because it is the primary wealth. Continue to wipe away the tears of people because those are the blessings you have received. Happy new year to you, my brother Sir Wicknell.\n\nBELOW IS JAH PRAYZAH SHONA STATEMENT CONVERTED TO ENGLISH\n\nYou were born with an open hand that uplifts the orphans, the widows and less privileged. In front of you there are no strangers but only children of God, with this you are blessing to this nation as we have never witnessed this huge kind of love.\n\nThe blessings that you get from the heavens, along with your hard-earned money you get from your own sweat, that you pray and fast for, you also give to others.\n\nYou are like a large river that when it overflows it shares its waters to other rivers.\n\nLike a tree that, when it bears fruit, it drops some to sustain animals, birds, and humans.\n\nThe gifts you offer are received by those who accept them like the rains from God that suddenly pours down, and we cast our seeds into the ground.\n\nYour name has not been raised through insults, criticism, or by belittling the spirit of others. Those who know you recognize you by your generosity like Kupakwashe Scott Sakupwanya, without an endless giving from a spring that never runs dry.\n\nDo you think blessings would fail to multiply through the hearts of many you have pleased? Do you think they would fail to love you for your goodness or for your excellent deeds? Do you think that even God Himself would fail to add blessings on top of others? Out of respect for you, we give you honor; your dignity will forever be associated with your name. Your actions increase the glory of Gods goodness.\n\nEverything you plan with your efforts may it succeed, may you be added with more wisdom because it enhances wealth through unification and reconciliation.\n\nMay your health be preserved because it is the primary wealth. Continue to wipe away the tears of people because those are the blessings you have received. Happy new year to you, my brother Sir Wicknell.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/01025717/Wicknell-Chivayo-gifts-Jah-Prayzah-180-000-Mercedes-Benz-S500.jpeg",
            "description": "<p>By Staff Reporter  CELEBRATED musician Mukudzeyi Mukombe also known as Jah Prayzah has drawn widespread condemnation from his fans over his effusive praise for controversial tenderpreneur, Wicknell Chivayo, who has lately been gifting cars and cash. Chivayo, known for his close ties to the ruling party, Zanu PF, and his dubious reputation as a tenderpreneur,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jah-prayzah-fans-angered-by-his-praises-for-wicknell-chivayo/\">Jah Prayzah fans angered by his praises for Wicknell Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        },
        {
            "title": "HIV and AIDS issues take a ‘dead’ seat: Activist speaks on challenges faced by people living with the condition",
            "url": "https://www.newzimbabwe.com/hiv-and-aids-issues-take-a-dead-seat-activist-speaks-on-challenges-faced-by-people-living-with-the-condition/",
            "content": "By Anna Chibamu\n\nEVEN though public health facilities continue providing HIV and AIDS medication with more players tackling the endemic, dealing with the condition, sexual reproductive health and rights (SRHR) issues, focus on the subject seems to be taking a dead seat, an activist has said.\n\nMartha Todhlana told media health practitioners during a Media and Science Cafe Programme in Harare recently that it was sad to note HIV counselling issues had declined with a lot of people now out of support programmes and no longer getting some health services such as health checks and or monitoring.\n\nOnce the universal programme started to say anyone who tests can just test and treat, I think issues of counselling have declined and also people not seeing the need for being in support groups.\n\nYou will find that currently, a lot of people who are in support groups now are those who tested some years back, before we had the programme as it is, but those who started treatment in the test and treat programme, a lot of them are not in support groups because they dont see the need.\n\nI think a positive is that public health facilities continue providing HIV medication and there are more players tackling HIV, tackling sexual and reproductive health and rights, SRHR, but sadly I think focus on HIV seems to be taking a dead seat, Todhlana said.\n\nAll this, according to her, has been attributed to several reasons amongst them a weak psycho-social support system, a shift in funding which is now more focused on young people and to a certain extent, the emergence of non-communicable diseases that are on the increase.\n\nMany people with HIV are struggling with non-communicable diseases, which are not properly managed, and some non-communicable diseases come with extreme pain. Those sharing their experiences indicate that the pain management approach is almost close to none.\n\nI think this is linked to funding and there is a focus on young people, which is good, especially adolescent girls and young women.\n\nWe have seen an improvement on the PrEP issues, but the realities that we consider as we get into 2025 include sadly that HIV stigma and discrimination persists, the level of domestic funding for health and particularly HIV is worryingly too low, Todhlana, who tested HIV positive in 2003 added.\n\nShe explained further: And the continued focus on young people or the 0-49 age group ignores the effect of HIV successes, which means people are ageing with HIV.\n\nBecause when we celebrate the success, by the way I turned 16 last week and Im already out of the 0-49 age group and I get my treatment from the public health sector and it is very obvious that you are autistic outside, but I see so many people who are even older than me, living with HIV and getting their treatment and then you are left to your own individual and without the proper care and support.\n\nI think the HIV facility used to be linked to a robust psycho-social support system, but a lot of times I see that this is no longer available and also it was still for people who are more than 49.\n\nAccording to Todhlana, her worry is the upkeep of the young adults born with HIV.\n\nI keep worrying about who is looking after them and the language we still use around young people is being reckless. We say Im a 2,000 reckless, but we call, and they are putting themselves in situations where they can get HIV. They are putting themselves at risk, but we forget that there is that cohort of young people who were not reckless.\n\nShe said many of those who were born with HIV or might have got it from breast milk before we know what we know now are quite a big number in our population who are in this cohort.\n\nSo, when I talk of people ageing with HIV, I include these young people. And then people diagnosed in their adulthood, like me, we have more than 20 years of treatment and Im increasing in number.\n\nTodhlana spoke of ART side effects saying a lot of lives were being lost because of less attention and monitoring to those taking ARVs.\n\nOn the packaging of the ARVs, the side effects are written, they are very clearly written there to say your kidneys will be affected, your liver will be affected, you know, a whole lot of organs will be affected so they need to be monitored regularly.\n\nBut I, I think the reason they are not being monitored is because when they were doing the monitoring there was external funding to do that and once the external fund has left, then it is no longer there because our labs are no longer eternally being funded.\n\nShe also raised issues to do with menopause and social isolation issues to those living with HIV.\n\nMenopause is coming much earlier for women with HIV than for those who do not have HIV. Maybe 10 years or so earlier.\n\nAnd then also the social isolation at times. With social isolation, I havent been to church for three years now. Im someone who enjoys going for Sunday services and going for midweek services. I havent been inside a church for the past three years.\n\nI was diagnosed of HIV in 2000, then diagnosis of arthritis in my spine in 2008, that was five years after starting ARVs in 2003. But the ARVs we were taking, were too many, at least three tablets three times a day, compared to one tablet once a day. You see how our researchers continue to improve. Today we have progressed to one tablet every 24 hours.\n\nShe stated that research studies are very important.\n\nClinical research and social research have been very important to the response to HIV. And also Im hoping to see that theres also media doing their research as well, as media, to make sure that they contribute to the body of knowledge that is building on our HIV response, she explained.\n\nTodhlana has a daughter, now at university, born without HIV to a mother living with HIV.\n\nShe gave credit to GALZ for the support given during her most difficult time of life.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/26042835/Ruth-Mlambo-looking-at-some-of-the-HIV-and-AIDS-pamphlets-inside-her-house-in-Matika-village-in-Mutare-Zimbabwe-Farai-MatiasheAljazeera-1724176194.webp",
            "description": "<p>By Anna Chibamu EVEN though public health facilities continue providing HIV and AIDS medication with more players tackling the endemic, dealing with the condition, sexual reproductive health and rights (SRHR) issues, focus on the subject seems to be taking a dead seat, an activist has said. Martha Todhlana told media health practitioners during a Media</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hiv-and-aids-issues-take-a-dead-seat-activist-speaks-on-challenges-faced-by-people-living-with-the-condition/\">HIV and AIDS issues take a ‘dead’ seat: Activist speaks on challenges faced by people living with the condition </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Jan 2025"
        }
    ]
}