{
    "news": [
        {
            "title": "Healing or Hustle? Smuggled Meds Are Big Draw in Zimbabwe’s Hidden Markets",
            "url": "https://www.newzimbabwe.com/healing-or-hustle-smuggled-meds-are-big-draw-in-zimbabwes-hidden-markets/",
            "content": "By Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Its possible to buy pretty much anything at the market in Hopley, an informal settlement south of this capital city: rat poison, mops  even medicine.\n\nThat medicine is sold without prescriptions, to buyers who dont have a diagnosis from a doctor in hand. Some vendors even offer diagnoses to their customers, even though they dont have any medical training. And in many cases, the medicine is fake. At any moment, police could swoop in for a raid. Vendors keep the medicine out of view, and buyers know who to ask.\n\nGladys Chihozhwa buys contraceptive pills from one of them, and even turns to the vendors for diagnoses when shes sick. She knows the drugs might be expired, or even fake. That doesnt deter her. I buy them because they are cheap, she says.\n\nZimbabwe is overwhelmed with counterfeit medicine, driven by the expansion of informal markets and consumer demand for cheaper products. Police routinely impound pharmaceuticals. In just one example, the Medicines Control Authority of Zimbabwe in January discovered counterfeit rabies vaccines in circulation. Their packaging mimicked that of legitimate imports from India, a big supplier of Zimbabwes medicine.\n\nThe vaccines pathway into the market remains unclear, but some products pour into Zimbabwes informal markets through its leaky borders with Zambia, where counterfeit medicines from India are easily available, and cheap.\n\nThe consequences of this trade can be fatal. According to a2022 report by the United Nations Office on Drugs and Crime, in sub-Saharan Africa alone, counterfeit medicines kill just over a quarter of a million people each year.\n\nEven when not immediately fatal, they can cause long-term harm, includingincreasing antibiotic resistance, says Dr. Grant Marewanhema, a public health expert.\n\nIn a written response, public relations officer Davison Kaiyo says the Medicines Control Authority of Zimbabwe has tried to address this problem by conducting raids with the police and intercepting counterfeit medicines at borders. They also conduct regular inspections at pharmacies. Those caught are prosecuted, and the medicines confiscated, he says.\n\nBut demand is high, so new shipments keep pouring in.\n\nDistribution of fake and substandard medicines is a global, highly profitable criminal enterprise. One 2020study by the Pacific Research Instituteestimated that the counterfeit medicine market is worth somewhere between US$200 billion and US$431 billion annually.\n\nMany of the counterfeit drugs are produced in India, where a mix of highly reputable drug manufacturers and unregulated producers creates serious challenges for oversight and quality control.\n\nAfrica is particularly affected. According to the World Health Organization, 42% of globally detected cases of counterfeit and substandard medical products between 2013 and 2017 were in Africa.\n\nIn Zimbabwe, porous borders facilitate the movement, but a combination of other factors fuels the trade. The countrys decades-long economic problems have left thehealth care system hanging by a thread. Many public hospitals simply dont have medicine supply, says Portifa Mwendera, a pharmacist of 25 years. Most times, patients are given prescriptions and told to source the medication elsewhere, he says.\n\nBut Zimbabwe produces only 30% of its essential medicines. The rest is imported and costly in pharmacies. Many people in the country are too strapped for cash, and these vendors offer options that are easier on the pocket, Mwendera says.\n\nSanudi, a cross-border truck driver, has for two decades smuggled medicine into the country through the Chirundu border post, a key trade and travel point between Zambia and Zimbabwe. He knows many other truckers who do the same. Sanudi asked Global Press Journal to use his middle name for fear of arrest.\n\nIts easy, he says. At the border, if the bag is small, he leaves it with a security guard as the truck undergoes scanning. He pays the guard US$50 to US$60, then charges the traders about US$200 to transport two small bags. If the consignment is too big to stash with the guards, he simply bribes the officials scanning the trucks.\n\nIts a risky operation, but I do it for the extra money I get, he says.\n\nGlobal Press Journal reached out to officials at the Zimbabwe Revenue Authority, but they did not respond to interview requests.\n\nGozo, a vendor who also asked Global Press Journal to use only one name for fear of arrest, sells pharmaceuticals without a license, and offers diagnoses. Once the customer describes their symptoms, Gozo says she knows what to sell them. Two years in this trade have sufficiently equipped her, she says, especially in prescribing antibiotics.\n\nThe people I sell the drugs to get better, she says.\n\nAntibiotics such as ciprofloxacin are popular at her stall, and many of them come from a supplier who gets them from Zambia. Ten antibiotics pills go for US$1 at her stall. In licensed pharmacies, the cost can be twice as much.\n\nIf arrested, she could face high fines or even imprisonment. Police conduct raids at the market from time to time, but sellers like her depend on this trade for a living.\n\nI always take the risk, she says.\n\nGamuchirai Masiyiwais a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02132438/01_GPJNews_Zim_GM_UnregisteredMedicine_-26_L_web.jpg",
            "description": "<p>By Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — It’s possible to buy pretty much anything at the market in Hopley, an informal settlement south of this capital city: rat poison, mops — even medicine. That medicine is sold without prescriptions, to buyers who don’t have a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/healing-or-hustle-smuggled-meds-are-big-draw-in-zimbabwes-hidden-markets/\">Healing or Hustle? Smuggled Meds Are Big Draw in Zimbabwe’s Hidden Markets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "03 Jun 2025"
        },
        {
            "title": "Thuli Phongolo denies dating gold dealer Scott Sakupwanya",
            "url": "https://www.newzimbabwe.com/thuli-phongolo-denies-dating-gold-dealer-scott-sakupwanya/",
            "content": "TimesLive\n\nActress and DJ Thuli Phongolo has come out to refute claims she is dating Zimbabwean businessman Scott Sakupwanya.\n\nThis after controversial celebrity bloggerMusa Khawulaalleged the two were an item.\n\nTaking to her Instagram stories recently, Thuli poured water on the rumours, saying:Let me indulge you for a sec. You guys need to stop trying to link me to people I wouldnt even consider dating. Im not dating Scott Kupa. The end.\n\nThuli Ps Instagram story post. Image:Instagram/ Thuli P\n\nThuli was then rumoured to be dating DJ and producer Master KG when she was often spotted in the comment section of his social media posts.She was later linked to DJ Maphorisa after videos of them holding hands and spending time together circulated on the timeline.\n\nWhile Thuli first shut down the rumours, the truth came to light that they were an item when she opened a case of assault against him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02124608/thuli.jpg",
            "description": "<p>TimesLive Actress and DJ Thuli Phongolo has come out to refute claims she is dating Zimbabwean businessman Scott Sakupwanya. This after controversial celebrity blogger Musa Khawula alleged the two were an item. Taking to her Instagram stories recently, Thuli poured water on the rumours, saying: “Let me indulge you for a sec. You guys need to stop</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thuli-phongolo-denies-dating-gold-dealer-scott-sakupwanya/\">Thuli Phongolo denies dating gold dealer Scott Sakupwanya</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "03 Jun 2025"
        },
        {
            "title": "Olorato Mongale’s mother: ‘I could see that my daughter fought, she even lost her nails’",
            "url": "https://www.newzimbabwe.com/olorato-mongales-mother-i-could-see-that-my-daughter-fought-she-even-lost-her-nails/",
            "content": "BLOEMFONTEIN  The mother of slain journalist Olorato Mongale shared the heartbreaking moment she realised something was wrong.\n\nBasetsana Mongale took to the podium at the Bloemfontein City Hall on Sunday, where hundreds gathered to bid farewell to the 30-year-old, who was killed in Johannesburg last Sunday.\n\nThe young journalist had left home to meet a man shed recently been dating, but never returned.\n\nHer mother said she drove through the night, from Bloemfontein to Johannesburg, after getting a call from her daughters friend.\n\nIt was a Sunday, I was at home relaxing after golf. I got a call from her friend asking when last I spoke to her, I said in the morning. She said Olorato is missing. I showered, poured petrol and sped to Johannesburg. In my heart, something was saying shes no more.\n\nOloratos body was discovered in Lombardy East hours later.\n\nThe prime suspect Philangenkosi Makhanya, wasfatally shot during a confrontation with policein KwaZulu-Natal (KLZN) on Friday.\n\nAnothersuspect was clearedon Saturday, while a third remains at large.\n\nBasetsana described her daughter as a fighter, someone who never backed down, even in her final moments.\n\nHer mother spoke of her daughters courage.\n\nI know shes a fighter. When I saw her at the government mortuary, I could see that my daughter fought. There is no time where she begged for mercy. She fought to the end, she even lost her nails, she fought.]\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02123709/olorato-mongales-mom.webp",
            "description": "<p>EWN BLOEMFONTEIN – The mother of slain journalist Olorato Mongale shared the heartbreaking moment she realised something was wrong. Basetsana Mongale took to the podium at the Bloemfontein City Hall on Sunday, where hundreds gathered to bid farewell to the 30-year-old, who was killed in Johannesburg last Sunday. The young journalist had left home to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/olorato-mongales-mother-i-could-see-that-my-daughter-fought-she-even-lost-her-nails/\">Olorato Mongale’s mother: ‘I could see that my daughter fought, she even lost her nails’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "03 Jun 2025"
        },
        {
            "title": "Nonku Williams bids farewell to ‘The Real Housewives of Durban’: no reunion, no return, just peace",
            "url": "https://www.newzimbabwe.com/nonku-williams-bids-farewell-to-the-real-housewives-of-durban-no-reunion-no-return-just-peace/",
            "content": "IOL\n\nNonku Williamshas chosen to break free from the TheReal Housewives Of Durban reality TV show, citing that the series pits women against each other in the pursuit of relentless drama.\n\nWilliams recently issued an official statement where she outlined various reasons for her decision to exit the franchise and not be a part of the season 5 reunion.\n\nWatching myself on screen, I am confronted with a reality thats hard to accept. The woman I see isnt someone I recognised or respect, wrote the shows OG.\n\nWilliams continued to share that although shes played a role in shaping the shows narrative, she believes shes also a product of the shows dynamics.\n\nThe relentlesspursuit of drama, the pitting women against each other, the gossip and the put-downs -its a toxic cycle that wears me down.\n\nShe explained that she wants to be a better role model to her children and uphold her responsibility to herself, her faith, her children, and her community.\n\nI want to make a difference, to leave a positive mark on the world. But this show, with its destructive tendencies, isnt the platform for that. Ive come to realise that I have a responsibility to myself to prioritise my well-being, to protect my mental health, and to surround myself with positivity.\n\nI have a responsibility to the community to be a force for good, to uplift and inspire others, and to make a positive impact  Im choosing to break free from this cycle.\n\nShe aims to now use her platform to spread love, kindness and positivity.\n\nAs I close this chapter, I hope my story can serve as a testament to the power of self-awareness, courage and redemption, she ended.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02123459/Screenshot-2025-06-02-at-13.34.03.png",
            "description": "<p>IOL Nonku Williams has chosen to “break free” from the “The Real Housewives Of Durban” reality TV show, citing that the series pits women against each other in the pursuit of relentless drama. Williams recently issued an official statement where she outlined various reasons for her decision to exit the franchise and not be a part of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nonku-williams-bids-farewell-to-the-real-housewives-of-durban-no-reunion-no-return-just-peace/\">Nonku Williams bids farewell to ‘The Real Housewives of Durban’: no reunion, no return, just peace</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "03 Jun 2025"
        },
        {
            "title": "Mom kills toddler, says child’s father failing to support upkeep",
            "url": "https://www.newzimbabwe.com/mom-kills-toddler-says-childs-father-failing-to-support-upkeep/",
            "content": "By Staff Reporter\n\nPOLICE in Matebeleland North have arrested a 29-year-old woman over the alleged murder of her daughter citing the childs fathers neglect.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.On May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred in Seafield Estate village on May 28, 2025.The suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.He added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred in Seafield Estate village on May 28, 2025.The suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.He added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nOn May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred in Seafield Estate village on May 28, 2025.\n\nThe suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.He added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nThe suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.\n\nHe added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nHe added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.\n\nIn another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nIn another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12224313/Murder.jpg",
            "description": "<p>By Staff Reporter  POLICE in Matebeleland North have arrested a 29-year-old woman over the alleged murder of her daughter citing the child’s father’s neglect. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “On May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mom-kills-toddler-says-childs-father-failing-to-support-upkeep/\">Mom kills toddler, says child’s father failing to support upkeep </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "03 Jun 2025"
        }
    ]
}