{
    "news": [
        {
            "title": "ZHRC urges government to strengthen social security for older persons",
            "url": "https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution.\n\nOlder persons human rights have long been overlooked due to perceptions of being non-productive, yet many remain active contributors.\n\nCommemorating the International Day of Older Persons (IDOP), which was celebrated under the theme Older Persons Driving Local and Global Action: Our Aspirations, Our Well-Being and Our Rights, the ZHRC urged the government to prioritise their well-being and rights.\n\nThe ZHRC calls on the government of Zimbabwe to domesticate and implement provisions of the AU Protocols protecting the rights of older persons it is partyto.\n\nIn particular, the commission urges the government to avail resources for the provision of social security for older persons, including meaningful pensions so that retired people do not become destitute, ZHRC said in a statement Thursday.\n\nThe African Union (AU) adopted protocols on the rights of older persons (2016) and on social protection and security (2022), both of which Zimbabwe ratified in 2024.\n\nFurthermore, the government of Zimbabwe enacted progressive laws that protect the rights and entitlements of older persons, which advance the rights of older persons to human dignity, appropriate care facilities, provision of social protection through harmonised cash transfers, food deficit mitigation programmes, assisted treatment orders, prevention of age-based discrimination, and protection from abuse, neglect and exploitation of all forms.\n\nDespite all these legislative steps, older persons in Zimbabwe still encounter obstacles in fully accessing their constitutional rights and benefits.\n\nDespite these positive legislative measures, older persons in Zimbabwe continue to face barriers to the enjoyment of their constitutional rights and entitlements.\n\nChallenges in this regard include discrimination of older persons within their family environments and in public spaces, age-based stereotyping including accusations of witchcraft directed at older women in particular, limited access to health care, inadequate social protection, prolonged isolation and loneliness, neglect and in some instances outright abuse by relatives or caregivers.\n\nThese challenges are compounded by limited or ineffective enforcement of laws that protect older persons from violations of their fundamental rights and entitlements, ZHRC added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/05055346/Old-woman.jpg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution. Older persons’ human rights have long been overlooked due to perceptions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/\">ZHRC urges government to strengthen social security for older persons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Oct 2025"
        },
        {
            "title": "Sharrif Mussa Returns as Warriors General Manager",
            "url": "https://www.newzimbabwe.com/sharrif-mussa-returns-as-warriors-general-manager/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has reappointed Sharrif Mussa as the Warriors general manager, marking his comeback to the national team setup since resigning in 2017 after clashing with the then Philip Chiyangwa-led executive.\n\nMussas return comes as part of Zimbabwes preparations for the 2025 Africa Cup of Nations (AFCON) finals in Morocco, where the Warriors will compete. He will work alongside current team manager Clemence Matawu.\n\nClemence Matawu remains the team manager. Mussa is coming in as general manager because we are banking on his experience ahead of the crucial tournament. He has previously served in this capacity, ZIFA president Nqobile Magwizi said.\n\nA seasoned administrator, the Harare businessman first joined the Warriors at the turn of the millennium as understudy to then team manager Rafiq Adam, before later taking charge of the role. He oversaw Zimbabwes participation at three AFCON finals in 2004, 2006 and 2017.\n\nBeyond his Warriors duties, Mussa has also been serving as chairperson of ZIFAs First Instance Board, responsible for assessing and approving stadiums for use.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/03053551/shariff-mussa.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has reappointed Sharrif Mussa as the Warriors’ general manager, marking his comeback to the national team setup since resigning in 2017 after clashing with the then Philip Chiyangwa-led executive. Mussa’s return comes as part of Zimbabwe’s preparations for the 2025 Africa Cup of Nations (AFCON) finals in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sharrif-mussa-returns-as-warriors-general-manager/\">Sharrif Mussa Returns as Warriors General Manager</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Oct 2025"
        },
        {
            "title": "Gold rally fuels 45% stocks rise on Zimbabwe’s dollar bourse",
            "url": "https://www.newzimbabwe.com/gold-rally-fuels-45-stocks-rise-on-zimbabwes-dollar-bourse/",
            "content": "Bloomberg\n\nZimbabwes dollar-only stock market is riding a wave of gains, powered by gold miners cashing in on a 48% jump in the precious metal this year.\n\nThe Victoria Falls Stock Exchanges benchmark index has surged 45%, lifting its market value to $1.8 billion at the end of September.\n\nThe VFEX was set up in late 2020 to raise capital, specifically for mining companies, and has 17 listed firms. Chief Executive OfficerJustin Bgoniexpects it to add five more by the end of the year, in sectors ranging from mining to property, he said Thursday by phone.\n\nThe exchange has performed well with valuations now approaching their regional peers, he said.\n\nVFEX All-Share Indexs 45% Rise\n\nUK-basedKavango Resources, with mining interests in Filabusi in south-eastern Zimbabwe, became the third gold miner to list on the bourse last month. Others includeCaledonia Mining Corp.andPadenga Holdings Ltd., which also has interests in crocodile skins.\n\nTheir stocks have become a proxy for gold, saidIH Securitiesresearch head,Lloyd Mlotshwa. These companies invested well in time to catch the gold rush and have also ramped up production when the timing is right.\n\nAlso boosting the VFEX is a shortage of ZiGs, the local currency, which has shifted investor sentiment away from the main exchange in Harare to the dollar-only bourse, Mlotshwa said. ZiG liquidity is weak, he added Investors resort instead to using their dollars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>Bloomberg Zimbabwe’s dollar-only stock market is riding a wave of gains, powered by gold miners cashing in on a 48% jump in the precious metal this year. The Victoria Falls Stock Exchange’s benchmark index has surged 45%, lifting its market value to $1.8 billion at the end of September. The VFEX was set up in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-rally-fuels-45-stocks-rise-on-zimbabwes-dollar-bourse/\">Gold rally fuels 45% stocks rise on Zimbabwe’s dollar bourse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Oct 2025"
        },
        {
            "title": "Mansions, 5 000 cattle and a weekly US$200,000 kickback! Mutodi claims Guvamatanga making a killing as Finance Ministry permanent secretary",
            "url": "https://www.newzimbabwe.com/mansions-5-000-cattle-and-a-weekly-us200000-kickback-mutodi-claims-guvamatanga-making-a-killing-as-finance-ministry-permanent-secretary/",
            "content": " says Parliament has received reports and proposes lifestyle audit\n\nBy Leopold Munhende\n\nTHE Chairperson of Parliaments Portfolio Committee on Budget, Finance, and Economic Development, Energy Mutodi has made sensational claims that Finance Ministry Permanent Secretary George Guvamatanga is getting kickbacks of as much as US$200,000 from government contractorsso asto facilitate payments.\n\nAccording to Mutodi, Parliament received complaints about how Guvamatanga has been managing affairs, and further alleged that he was demanding kickbacks from other ministries and government departments of between 5% and 10% for every treasury disbursement.\n\nMutodi claims Guvamatangas loot now exceeds US$1 billion and adds onto an empire that includes several mansions and 5,000 dairy cattle.\n\nThe Parliament of Zimbabwehas received agonising reports that Guvamatanga is receiving 5%-10% for every payment done by the Treasury. GG as he is notoriously called has accumulated more thanUS$1 billion becoming the richest civil servant, said Mutodi.\n\nContractors, Ministries and Departments refusing to pay Guvamatanga a kick back of at least 5% after receiving Treasury payments have been denied payments for several months even if the funds are budgeted for.\n\nOver the past six months, Parliament itself has struggled to operate after being denied its budgeted funds by George Guvamatanga. A civil servant earning less than $1000 GG has more than 5000 dairy cattle, dairy equipment and several mansions hence the proposed lifestyle audit.\n\nOnecontractor Bitumen which was contracted to do roads has been asked to pay US$200,000 byGuvamatangafor every $2,000,000 weekly payment he authorises that theyreceive and they have made several complaints tomembers of the Budget Committee at Parliament.\n\nGuvamatanga was earlier this year accused of receiving bribes from shadowy businessman Wicknel Chivayo to approve payments to the controversialRen-Form CC, a South African company that supplied Zimbabwe Electoral Commission (ZEC) with voting material at highly inflated prices.\n\nPresident Emmerson Mnangagwa is said to have fired and forgiven him in June this year before he begged for the job he has kept since 2018.\n\nAZanu PF Member of Parliament (MP) for Bikita South, Mutodiclaimed Guvamatanga had made threats to deal with him if the committee was to ever seek a lifestyle audit or engage the Zimbabwe Anti-Corruption Commission (ZACC).\n\nHe added: Guvamatangahas also made threats to senda terror team to deal with the(me)upon hearing that the Committee was considering carrying out a life audit on him as well as asking for a ZACC probe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>– says Parliament has received reports and proposes lifestyle audit By Leopold Munhende THE Chairperson of Parliament’s Portfolio Committee on Budget, Finance, and Economic Development, Energy Mutodi has made sensational claims that Finance Ministry Permanent Secretary George Guvamatanga is getting kickbacks of as much as US$200,000 from government contractors so as to facilitate payments. According to Mutodi,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mansions-5-000-cattle-and-a-weekly-us200000-kickback-mutodi-claims-guvamatanga-making-a-killing-as-finance-ministry-permanent-secretary/\">Mansions, 5 000 cattle and a weekly US$200,000 kickback! Mutodi claims Guvamatanga making a killing as Finance Ministry permanent secretary</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "03 Oct 2025"
        }
    ]
}