{
    "news": [
        {
            "title": "Leader of Congo’s rebel alliance claims they have taken Goma",
            "url": "https://www.newzimbabwe.com/leader-of-congos-rebel-alliance-claims-they-have-taken-goma/",
            "content": "By Reuters\n\nREBELS in the Democratic Republic of Congo (DRC) said on Sunday they had taken Goma, the biggest city in the east of the mineral-rich country, after a lightning advance that has forced thousands of people to flee and fuelled concerns of a regional war.\n\nWe have taken Goma and have ordered soldiers to surrender by 3:00 a.m. local time (0100 GMT), Corneille Nangaa, leader of the Congo River Alliance that includes the M23, told Reuters.\n\nReuters could not independently determine whether the city was fully under rebel control. Spokespeople for the Kinshasa government and the army did not immediately respond to requests for comment.\n\nThe Rwanda-backed M23 rebels have quickly gained ground this month in Democratic Republic of Congos conflict-riven eastern borderlands and launched an assault on Goma, the capital of North Kivu province, earlier this week.\n\nBy Sunday evening, M23 fighters had pushed past Munigi, an outlying neighbourhood around 9 km (5 miles) from the city centre, three sources told Reuters.\n\nGoma is in our hands, Nangaa said.\n\nThe rebels had earlier ordered defending government forces late on Sunday to disarm and surrender, saying they were preparing to enter and take control.\n\nNangaa said that following negotiations, the rebels had allowed army officers to leave Goma by boat for Bukavu.\n\nWe gave the (Congolese forces) a 48-hour ultimatum to lay down their arms. The ultimatum has already passed, so we say that they can deposit their military equipment at (U.N. mission) MONUSCO, Willy Ngoma, a spokesman for M23, told Reuters.\n\nHe added that surrendering government soldiers were to assemble at one of the citys stadiums ahead of the 3:00 a.m. deadline. A second rebel spokesman posted on X that all boat traffic on Lake Kivu was suspended.\n\nCity residents reported hearing scattered gunfire in different areas after nightfall, but it was unclear who was shooting or whether fighting was continuing.\n\nMost of Goma, meanwhile, was plunged into darkness due to a power cut.\n\nWith the rebels appearing poised to seize Goma, the United Nations Security Council met earlier on Sunday to discuss the situation, fearing the fighting could spill over into a broader regional war and aggravate one of the worlds worst humanitarian crises.\n\nAddressing the council via video link, the head of the U.N. mission in Congo Bintou Keita said M23 and supporting Rwandan forces had penetrated the outer edges of the city.\n\nRoads are blocked and the airport can no longer be used for evacuation or humanitarian efforts. M23 has declared the airspace over Goma closed, she said.\n\nIn other words, we are trapped.\n\nCONDEMNATION\n\nThe United States, France and Britain on Sunday condemned what they said was Rwandas backing of the rebel advance.\n\nKigali has long denied supporting M23.\n\nRwandas U.N. Ambassador Ernest Rwamucyo said his country regretted the deteriorating situation in eastern Congo, but blamed Kinshasa.\n\nThe current crisis could have been averted had (Congos) government demonstrated a genuine commitment to peace, he added.\n\nThe eastern borderlands of Congo, a country roughly the size of Western Europe, remain a tinder-box of rebel zones and militia fiefdoms in the wake of two successive regional wars stemming from Rwandas 1994 genocide.\n\nWell-trained and professionally armed, M23  the latest in a long line of Tutsi-led rebel movements  says it exists to protect Congos ethnic Tutsi population.\n\nCongos government, however, says the rebels are proxies for Kigalis expansionist ambitions in the region, an accusation the Rwandan government has long denied.\n\nCongo severed all diplomatic ties with Rwanda amid this weeks rebel offensive and on Saturday blamed Rwandan snipers for the killing of North Kivus military governor on the front line a day earlier. Three U.N. peacekeepers  a Uruguayan and two South Africans  were also killed in the last two days.\n\nA spokesperson for Rwandas government did not respond to a request for comment.\n\nAid agencies are concerned about the conflicts impact on civilians.\n\nHundreds of thousands of civilians have fled multiple zones of fighting since the latest M23 offensive began around Goma on Jan. 23, the office of the U.N. humanitarian coordinator said in a statement.\n\nThe escalation in violence has also forced the World Food Programme to temporarily pause emergency operations, the agency said on Sunday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27053648/77afcab0-3e06-11ef-9e1c-3b4a473456a6.jpg.webp",
            "description": "<p>By Reuters REBELS in the Democratic Republic of Congo (DRC) said on Sunday they had taken Goma, the biggest city in the east of the mineral-rich country, after a lightning advance that has forced thousands of people to flee and fuelled concerns of a regional war. “We have taken Goma and have ordered soldiers to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/leader-of-congos-rebel-alliance-claims-they-have-taken-goma/\">Leader of Congo’s rebel alliance claims they have taken Goma</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "The Victoria Falls Stock Exchange: Redefining capital markets in Africa’s mining sector",
            "url": "https://www.newzimbabwe.com/the-victoria-falls-stock-exchange-redefining-capital-markets-in-africas-mining-sector/",
            "content": "By IOL\n\nTHE Victoria Falls Stock Exchange (VFEX) offers compelling advantages for investors seeking new opportunities in Southern Africa.\n\nIt opens doors for investors to tap into Southern Africas abundant natural resources and rapidly growing economies as well as a unique opportunity for portfolio diversification by facilitating investments in emerging markets.\n\nVFEX launched in 2020 is a subsidiary of the Zimbabwe Stock Exchange (ZSE), strategically located in the special economic zone of Victoria Falls.\n\nOperating under a distinct and flexible regulatory framework, the VFEX stands apart from the ZSE, positioning itself as a premier offshore exchange. This strategic differentiation enables the VFEX to attract significant local and foreign investment.\n\nThe VFEX offers incentives for companies to list and raise capital in hard currency. Investing on the VFEX has the following benefits;\n\nTax incentives: There is no capital gains tax on the VFEX for investors and dividend withholding tax for foreign investors is only 5%.\n\nRepatriation of dividends: The VFEX facilitates greater freedom for foreign shareholders by imposing fewer restrictions on the repatriation of dividends and proceeds from share sales.\n\n100%foreign ownership: Companies listed on the VFEX can have 100% foreign ownership, making it an attractive platform for international investors.\n\nUS dollar-denominated listings with no currency risk: The VFEX listings are denominated in US dollars, eliminating currency risk for investors.\n\nNo requirements for a primary listing: Companies can list on the VFEX without a primary listing on another exchange, providing greater flexibility.\n\nStreamlined listing process: The VFEX has a streamlined listing process to facilitate faster and easier listing for companies.\n\nThe VFEX provides an avenue for business to raise capital and local and international investors to invest in Zimbabwe without the associated currency risk.\n\nHistorically, the main deterrents to investing in Zimbabwes mining sector have been unfavourable and uncertain exchange control, currency, and fiscal policies. Investors need assurance that they can invest in the country and repatriate their gains without undue restriction.\n\nHowever, Zimbabwes current laws and economic conditions often do not provide this comfort, making it challenging to raise foreign currency for capital-intensive mining projects.\n\nGrowth\n\nThe VFEX saw the number of trades increasing by 35.78% between the second quarter of 2023 and the second quarter of 2024. This surge is complemented by a substantial 52.8% rise in turnover over the same period.\n\nListing of new companies\n\nSix new counters were added to its listings and improved trading levels, reflecting growing confidence and interest from market participants.\n\nKavango Resources PLC, already listed on the London Stock Exchange, has announced plans for a secondary listing on the VFEX.\n\nOn April 5,2024, Edgars Stores, a manufacturer and retailer of clothing was listed on the VFEX, while Invictus Energy, a Zimbabwean oil and gas exploration company, completed its listing on the VFEX on August 2, 2024 joining other companies such as Innscor, Axia Corporation, Padenga Holdings, First Capital Bank, and Zimplow.\n\nTechnological advancements\n\nThe VFEX continues to innovate in its efforts to attract investors. The VFEX has partnered with Mauritius-based broker VCG Markets to launch Contracts for Differences (CFDs), a new financial product designed to enhance local capital markets. CFDs are financial instruments that allow two parties to speculate on the price movements of underlying assets, such as company stocks or commodities, without directly owning them.\n\nThis innovative product enables traders to engage in markets like gold, silver, oil, and various global indices, offering a more flexible approach to investing without the need to directly trade the underlying assets.\n\nAccording to the VFEX CEO Justin Bgoni, the benefits of trading in CFDs include:\n\nMaximised capital outlay: CFDs provide an efficient way of maximizing ones capital outlay.\n\nPortfolio diversification: CFDs can help diversify existing investment portfolios or hedge positions.\n\nLeverage: CFDs are leveraged products, enabling traders to increase their exposure to an underlying asset with a small initial outlay.\n\nMarket access: CFDs allow traders access to a wide range of global markets that would otherwise be difficult to access.\n\nConclusion\n\nThe expansion and modernisation of the VFEX presents significant opportunities for investors and companies alike. With its unique incentives, growing listings, strategic partnerships, investor outreach, and technological advancements, the VFEX is well-positioned to drive economic growth and become a key player in Southern Africas financial markets.\n\nWhile raising foreign currency capital is the main driver behind companies in the mining sector listing on the VFEX, a less obvious benefit of listing on the VFEX is gaining the license to mine.\n\nThis doesnt refer to legal mining rights, but rather the positive reputation miners need with local communities and host governments.\n\nBy listing on the VFEX, mining companies demonstrate their commitment to Zimbabwes legal framework and economic growth. This in turn helps miners build trust with the government, which is vital for successful mining projects.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/10110147/Victoria-Falls-Stock-Exchange.jpg",
            "description": "<p>By IOL THE Victoria Falls Stock Exchange (VFEX) offers compelling advantages for investors seeking new opportunities in Southern Africa. It opens doors for investors to tap into Southern Africa’s abundant natural resources and rapidly growing economies as well as a unique opportunity for portfolio diversification by facilitating investments in emerging markets. VFEX launched in 2020</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-victoria-falls-stock-exchange-redefining-capital-markets-in-africas-mining-sector/\">The Victoria Falls Stock Exchange: Redefining capital markets in Africa’s mining sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "‘Mnangagwa is a failure and must go now, his 2030 agenda is illegal and treacherous’— say war veterans miffed by rampant corruption",
            "url": "https://www.newzimbabwe.com/failed-mnangagwa-must-go-now-his-2030-agenda-is-illegal-and-treacherous-say-war-veterans-miffed-by-deepening-corruption-and-cronyism/",
            "content": "By Staff Reporter\n\nA GROUP of veterans of the 1970s war of liberation have come out guns blazing demanding President Emmerson Mnangagwas immediate exit for reneging on the founding virtues of the struggle of Zimbabwes independence.\n\nLed by Blessed Runesu Geza, popularly known in Zanu PF circles as Bombshell for his acerbic tongue, the former guerilla fighters held a press conference in Harare, where they expressed their disquiet over Mnangagwas sloppy leadership, which has resulted in corruption and other vices festering.\n\nToday, l am accompanied by fellow patriotic Zimbabweans who fought in the trenches, commanders from both ZIPRA (Zimbabwe Peoples Revolutionary Army) and ZANLA (Zimbabwe African National Liberation Army), who fought to liberate this country from the brutal minority white colonial rule, said Geza.\n\nThese are well-known fighters from the second Chimurenga who fought with the hope of bringing economic emancipation, freedom and justice to our fellow brothers and sisters and future generations.\n\nSadly, these values and aspirations which we carried as we fought during the war continue to evade us 44 years after independence. The majority of Zimbabweans remain poor and jobless as a few black leaders assumed the very character of the beast we fought against in the 1970s war of liberation.\n\nGeza, who is former Sanyati Member of Parliament and soldier, said the press briefing was aimed at mapping the way forward to address imbalances, which for long have been neglected or ignored.\n\nIn particular, it is a special message to Emmerson Mnangagwa, a nationalist, who in 2017 was brought to power through the help and support of war veterans and the general population of Zimbabwe via Operation Restore Legacy.\n\nIn general, we also address corrupt gangsters and hangers-on, who surround him and abuse national resources for selfish reasons, added Geza.\n\nThis man and those around him have failed us, they have failed all Zimbabweans, who believed that the events of 2017 would bring an end to nepotism and privatisation of the nation and its people.\n\nThe war veterans charged that Mnangagwa, in power for 10 years now, has presided over corruption, cronyism and nepotism which have reached unprecedented levels.\n\nFellow Zimbabweans allow me to elaborate on these direct allegations against Mnangagwa, which demonstrate that he has failed this nation, constitutionally, morally and historically.\n\nEmmerson Mnangagwa, on assumption of power, showed that he was a man who had learnt nothing and forgotten nothing. He forgot the roots of his power on Day 1, and instead of correcting the mistakes of former president Robert Mugabe, he instead went about to prove to all of us that Mugabe was actually a saint.\n\nHe deliberately sidelined the very people who fought on his side and instead praised thieves and conmen and heartless killers in his government.\n\nHe systematically targeted and purged war veterans who stood for social justice in various arms of government and replaced them with crooks.\n\nThis is very evident in his Cabinet which is now stuffed with non-performing and deceitful ministers. Its a known secret that they were picked either they belong to his clan or are benefactors to his family, through his children, Geza said.\n\nWithout mincing his words, the combative Zanu PF Central Committee member accused Midlands Provincial Affairs Minister, Owen Mudha Ncube of leading a morbid operation to eliminate military generals, who have died mysteriously one after the other.\n\nHe also blasted Speaker of Parliament, Advocate Jacob Mudenda for conniving with impostor Citizens Coalition for Change (CCC) secretary general Sengezo Tshabangu to remove democratically elected legislators and replace them with cronies to push the agenda to extend Mnangagwas incumbency. He says Mudenda was willing to trash the Constitution on the promise of getting the vice presidents post.\n\nGeza further warned Mnangagwa against attempting to turn the country into a fiefdom by appointing his children and relatives to influential positions in all strategic pillars of the nation.\n\nThis mischief has capacity to throw the country into chaos. We are not fools and dont see us as fools, a visibly emotional Geza charged.\n\nThe uniformed forces have lost dignity in the eyes of the public while university lecturers and civil servants have been pauperized under Mnangagwas leadership, the ex-guerilla fighters said.\n\nThis is not the Zimbabwe we envisioned when we took up arms, he said.\n\nBased on the slew of allegations levelled against the 82-year-old Zanu leader, Geza demanded his immediate exit or face repercussions of his illegal and treacherous 2030 agenda which flies in the face of 90 percent of citizens, who in a 2013 referendum rejected removal of presidential term limits.\n\nIt is clear to us that Mnangagwa is not fit to run this country and his time to go is now. We ask him to go peacefully. If he refuses to take heed of this advice, we have no option but to ask the people of Zimbabwe to deal with a rogue President in line with the Constitution, said Geza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051558/zdf-Mnangagwa-0.jpeg",
            "description": "<p>By Staff Reporter A GROUP of veterans of the 1970s war of liberation have come out guns blazing demanding President Emmerson Mnangagwa’s immediate exit for reneging on the founding virtues of the struggle of Zimbabwe’s independence. Led by Blessed Runesu Geza, popularly known in Zanu PF circles as “Bombshell” for his acerbic tongue, the former</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/failed-mnangagwa-must-go-now-his-2030-agenda-is-illegal-and-treacherous-say-war-veterans-miffed-by-deepening-corruption-and-cronyism/\">‘Mnangagwa is a failure and must go now, his 2030 agenda is illegal and treacherous’— say war veterans miffed by rampant corruption</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "Four brothers and neighbour sentenced to life imprisonment for murder",
            "url": "https://www.newzimbabwe.com/four-brothers-and-neighbour-sentenced-to-life-imprisonment-for-murder/",
            "content": "By Staff Reporter\n\nFOUR members of the Ncube family from Silobela in Kwekwe, together with their neighbour, were last week convicted of murder and sentenced to life imprisonment.\n\nMkhululi (26), Qhubekani (23), Cabangani (30) and Thulani (27) all hailing from the Ncube clan and neighbour, Mexen Moyo (28) appeared at the Gweru High Court Circuit for killing a fellow villager in 2022.\n\nThe court heard how the five men brutally attacked Isabel Ndlovu at Linda Business Centre, Silobela, on November 30, 2022, stabbing and assaulting him with knives, logs and empty beer bottles.\n\nThe victim succumbed to injuries while being rushed to Kwekwe District Hospital.\n\nMeanwhile, Jeremiah Donhora and Kudakwashe Ncube, both from Shurugwi, appeared before the same court for the cold-blooded murder of Bernard Canaan Ngulube in 2017.\n\nThe duo was slapped with 20 years imprisonment.\n\nProsecutors proved how the pair, along with an accomplice who is still at large, accused the now deceased of theft.\n\nCourt heard how the assailants unleashed violence and started punching and kicking Ngulube, before scalding him with boiling water.\n\nVictim sustained serious injuries which led to his death five days later while hospitalised.\n\nThe presiding magistrate found the killers actions callous and premeditated, thereby deserving of languishing in jail for the next 20 years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12224313/Murder.jpg",
            "description": "<p>By Staff Reporter  FOUR members of the Ncube family from Silobela in Kwekwe, together with their neighbour, were last week convicted of murder and sentenced to life imprisonment. Mkhululi (26), Qhubekani (23), Cabangani (30) and Thulani (27) all hailing from the Ncube clan and neighbour, Mexen Moyo (28) appeared at the Gweru High Court Circuit</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-brothers-and-neighbour-sentenced-to-life-imprisonment-for-murder/\">Four brothers and neighbour sentenced to life imprisonment for murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "In Pictures: Various musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare",
            "url": "https://www.newzimbabwe.com/in-pictures-various-musicians-perform-at-a-show-to-launch-cigarette-brands-by-swan-valley-group-in-mbare/",
            "content": "A WIDE array of musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare, Harare on Saturday. Hereunder are scenes from the free event that attracted a huge crowd.\n\nPictures by Tapiwa Svondo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27024548/IMG-20250126-WA0020.jpg",
            "description": "<p>A WIDE array of musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare, Harare on Saturday. Hereunder are scenes from the free event that attracted a huge crowd. Pictures by Tapiwa Svondo.      </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-various-musicians-perform-at-a-show-to-launch-cigarette-brands-by-swan-valley-group-in-mbare/\">In Pictures: Various musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "‘l cannot be bought with a car’— Winky D spits lyrical venom targeting Wicknell Chivayo",
            "url": "https://www.newzimbabwe.com/l-cannot-be-bought-with-a-car-winky-d-spits-lyrical-venom-targeting-wicknell-chivayo/",
            "content": "By Tapiwa Svondo\n\nTHE undisputed king of Zimdancehall, Wallace Chirumiko popularly known as Winky D, has confirmed his resolve to stay away from gifts and other trinkets offered by politicians and their associates inorder to influence his art.\n\nDuring a Saturday gig in Mbare, Harare, sponsored by a cigarette maker Swan Valley Group, Winky D took aim at tenderprenuer Wicknell Chivayo, telling him he will never be bought with a car and will not betray the struggle of the young people, who face unemployment and other vices.\n\nVanoti nemuzita rababa, apa ndofuti vaba, vhura meso hona ka, handitengeke nemota car (They preach the word of God but they are the ones stealing, open your eyes I am not bought by a car), he sang to wild applause from the crowd.\n\nChivayo has in recent months been on a spree donating cars and money, which he has been gifting artists aligned to the ruling party, Zanu PF.\n\nSaturday saw Winky D returning to perform in Mbare after seven years, a development which was met with cheers and enthusiastic sing alongs.\n\nThe dreadlocked artist is popular among youths as his lyrics resonate with their struggles, hopes and aspirations.\n\nWinky D, who rarely makes noise on social media, uses the stage as a platform to address a number of societal issues, and Saturday nights repertoire was no exception.\n\nNdakachibata kuti dzvii but handisi keeper ini handitengese handisi Peter ini, ndorwiswa handinete ndichasvika ini, ndendiri zii handina noise handisi speaker ini (Im holding it firm but Im not a keeper, Im not a sellout like Peter, they fight me, but I wont give up. I will get there, Im not a speaker I dont make noise, I am cool)\n\nFurther, the gifted artist used a powerful wordplay to address a contentious issue, which saw him being elbowed out of Harare International Conference Centre (HICC) by Zanu PF acolyte, Kudakwashe Tagwirei ostensibly to pave way for a church event.\n\nNdabva paJabhuna (HICC) horaiti chiitai, musandipe tuma notes handina teacher ini, ndapfuura 40 handidi teacher ini, ndosasa nezvandada handina firita (I left HICC its fine do your own, dont give me notes I dont have a teacher, I passed 40 I dont want a teacher, I say what I like I dont filter), he went on.\n\nZanu PF activists and spendthrifts, Wicknell Chivayo and Passion Java were not spared the lyrical attacks.\n\nIn 2020, Passion Java attempted to lure Winky D with a US$35 000 contract which the latter refused to accept.\n\nWinky D also referenced ongoing tender scandals involving Zanu PF member Mike Chimombe and his associate Moses Mpofu, adding a layer of commentary on the current state of the music industry.\n\nHamusi Mapofu (Mpofu) mbudzi yadzoswa (Winky) buritsai Mic (Chimombe), sang Winky, loosely translated to mean You are not blind, the goat has been brought back release the mic.\n\nAdditionally, Winky D responded to Seh Calaz for accusing him of sidelining him at shows.\n\nThe free music concert showcased an impressive lineup of artists, including Master H, Aleck Macheso, Saintfloew, Da Ruler, Silent Killer, and Nisha T, but it was Winky D who juggled the Mbare audience.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27021831/InShot_20250126_200744969-scaled.jpg",
            "description": "<p>By Tapiwa Svondo THE undisputed king of Zimdancehall, Wallace Chirumiko popularly known as Winky D, has confirmed his resolve to stay away from gifts and other trinkets offered by politicians and their associates inorder to influence his art. During a Saturday gig in Mbare, Harare, sponsored by a cigarette maker Swan Valley Group, Winky D</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/l-cannot-be-bought-with-a-car-winky-d-spits-lyrical-venom-targeting-wicknell-chivayo/\">‘l cannot be bought with a car’— Winky D spits lyrical venom targeting Wicknell Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "Methodist-run Marange High School among Manicaland’s ZIMSEC Advanced Level results fast movers",
            "url": "https://www.newzimbabwe.com/marange-umc-high-school-among-manicalands-zimsec-advanced-level-results-fast-movers/",
            "content": "By Alois Vinga\n\nTHE United Methodist Church (UMC) run Marange High School (MHS) has proved its mettle after recording a significant improvement in the latest Zimbabwe School Examinations Council (ZIMSEC) 2024 Advanced Level exams, becoming one of the greatest movers in Manicaland province.\n\nOut of an enrolment of 85 students, who sat for their A Levels, Marange, the institutions overall pass rate rose significantly to 98.82% from the previous years pass rate that hovered around 91%, a development which is set to improve the schools nationwide ranking once the relevant authorities are done with comparisons.\n\nEducation experts in the province believe the institutions results are breathtaking considering that MHS does not ordinarily stick to a strict policy of recruiting already highly capable learners as is the case with other institutions.\n\nThe latest results analysis shows that the school produced 16 students with flying colours whose results ranged from 14 to 20 A Level points.\n\nThe most excelling wizkid produced 20 points in Mathematics, Physics, Computers and Chemistry, followed by four others who scored between 16 and 19 points.\n\nThe institution has also managed to deliver the gender dividend, after enrolling 56 female students against 29 males.\n\nOfficial records indicate that in the 20224 A Level results the majority of districts in the province attained higher than the national pass rate of 94.58% pass, with Buhera scoring 97.8%, Makoni 97.3%, Mutare 96.54%, Nyanga 97.16%, Chimanimani 98.23%, Mutasa District 98.7% while Chipinge district which was the least in the province had 93.5%.\n\nAbout half of Zimbabwes best top 10 performing schools have been drawn from Manicaland province over the years, testifying the areas spine in contributing towards the countrys education dividend.\n\nAccording to Zimsec, 31 443 of the 33 246 candidates got Grade E or better in two or more subjects, representing a pass rate of 94.58% compared to 94.60% in 2023 nationally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27021515/maxresdefault-1.jpg",
            "description": "<p>By Alois Vinga THE United Methodist Church (UMC) run Marange High School (MHS) has proved its mettle after recording a significant improvement in the latest Zimbabwe School Examinations Council (ZIMSEC) 2024 Advanced Level exams, becoming one of the greatest movers in Manicaland province. Out of an enrolment of 85 students, who sat for their ‘A’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marange-umc-high-school-among-manicalands-zimsec-advanced-level-results-fast-movers/\">Methodist-run Marange High School among Manicaland’s ZIMSEC Advanced Level results fast movers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Corporate Rescue in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-corporate-rescue-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss corporate rescue, what it is and when it is necessary.\n\nVM: Before defining what corporate rescue is and its purpose, it is necessary to contextualize it in light of the general business operating environment in Zimbabwe. We have witnessed a lot of major businesses applying to be placed in corporate rescue of late.\n\nThis is a result of the limited access to affordable finance for businesses which are expected to remain innovative against the novel, fluid informal sector which operates with little to no recurrent fixed costs like wages, statutory obligations and rentals.\n\nIt is common knowledge that at the heart of every business, guaranteeing its very survival, is the businesss ability to manage cashflow. A failure to manage cashflow can ultimately affect the very existence of the business due to financial distress.\n\nCorporate rescue, previously known as judicial management, is intended to literally rescue businesses that face collapse by placing a moratorium on legal actions against the company from creditors, restructuring the companys liabilities, debts, affairs and property with the purpose of returning it to being a viable concern.\n\nThe overarching purpose is to ensure that the business remains viable and open, employees remain at work and creditors are paid the whole or an agreed part of what they are owed.\n\nIt is probably the last line of defence for a business against collapse.\n\nReporter:When is a company considered financially distressedincorporate rescue proceedings?\n\nVM: A company is financially distressed when it cannot pay its debts when they become due in the normal course of business or when it is likely to be insolvent within 6 months. Key indicators may be negative cashflow, possibly from the company being owed significantly under long-term arrangements while itself being burdened by short term loans that have become due.\n\nWhat is critical in the analysis of financial distress from a corporate rescue perspective is that the company has a realistic prospect of recovery if it is placed in corporate rescue, it has a positive net worth, with assets that are more valuable than liabilities or that if managed properly, the assets are capable of paying off the liabilities and returning the business to a viable competitive state.\n\nReporter: What is the procedure to place a company incorporaterescue?\n\nVM: Our law allows for directors of a company to pass a resolution to put the company in corporate rescue if the directors are of the view that the company is financially distressed and there are reasonable prospects of rescuing the company.\n\nAlternatively, an affected person, such as a creditor or even an employee can apply to the court to have the company placed under corporate rescue if they can demonstrate that the company is distressed and there are reasonable prospects of the company being rescued from that distress.\n\nReporter: What is the effect of corporate rescue on stakeholders?\n\nVM: Once an order has been issued to place the company in corporate rescue, a corporate rescue practitioner takes over the management of the company. He or she will develop a rescue plan which includes the restructuring of the debts and operations of the company including its implementation plan if approved by stakeholders.\n\nThe most significant development is that a moratorium is imposed on all legal proceedings against the company allowing the company breathing spaceto operationalize its rescue plan.\n\nLong and short, the creditors ability or rights to sue or enforce their judgments or court orders against the company are suspended. Their only option is to participate in the development of the rescue plan and in some instances, they will have to compromise on the quantum of the debts meaning agreeing to a haircut of what they are owed. This in some situations is their only guarantee that the debts are repaid.\n\nOn the other hand, the employees contracts remain in force and employee claims of unpaid wages are a priority. The powers of directors are significantly curtailed as they have to report to the corporate rescue practitioner and assist him or her in bringing back the company to viability.\n\nThe rights of the shareholders are preserved, however, their interest in the company may be affected by the restructuring and its consequences to the remaining value of the company. The positive is that after a successful rescue, they will still have a company to talk of. The alternative is having no company without corporate rescue.\n\nReporter: Can an interested person object to a company being placed in corporate rescue and what will the grounds be?\n\nVM: Any affected party, creditors, employees, shareholders or any stakeholder can object to a company being placed in corporate rescue. The common objection is that the company is attempting to use corporate rescue in bad faith for purposes of circumventing its obligation to pay debts that have become due.\n\nHowever, stakeholders may have different reasons for objecting to a rescue plan, for instance, if employees feel that their rights or claims are not adequately addressed, creditors feel that the rescue plan will not likely succeed but result in them having to wait too long for only a fraction of their debtet cetera.\n\nOther reasons may be the questionable capacity of the rescue practitioner to revive the company, an unviable rescue plan or that the company has no prospect of rescue.\n\nReporter: Thank you, Mr. Madzima we will continue on insolvency next week but we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, this week we want to discuss corporate rescue,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-corporate-rescue-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Corporate Rescue in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "Labour rejects government’s policy for civil servants to work ‘forever’",
            "url": "https://www.newzimbabwe.com/labour-rejects-governments-policy-for-civil-servants-to-work-forever/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) has rejected governments policy offering civil servants an opportunity to work way beyond their retirement age arguing the initiative breaches basic rights.\n\nThrough Statutory Instrument 201 of 2024 under the Presidential Powers (Temporary Measures) (General Laws Amendment) Regulations, 2024, President Emmerson Mnangagwa raised the retirement age from 65 to 70.\n\nHowever, at the age of 60, they still have the choice to retire early, provided they submit a three-month notice.\n\nbefore the effective date, may have a pensionable age of sixty-five years with option to retire at seventy-years on full pension: Provided that any retirement after the year of sixty-fifth anniversary and before the seventieth anniversary shall be deemed to be early retirement; or on or after the effective date, shall have a pensionable age of seventy years.\n\nA member may, on giving three months notice of retirement be permitted by the commission to retire before pensionable age at any time after attaining the age of sixty, part of the SI reads.\n\nWhile some sections of the society have perceived the move as noble for those civil servants who are still active, the countrys most influential labour organ, ZCTU expressed reservations over the extension of the retirement age for civil servants and uniformed forces.\n\nThe labour organ contends that the move is not adequate to address issues affecting its employees and pensioners.\n\nCivil servants and pensioners are plagued with serious welfare challenges arising from poor remuneration and working conditions that are pauperising them to the extent that they involuntarily find it reasonable to work forever instead of resting and enjoying their old age.\n\nThe government needs to address fundamental welfare challenges affecting its employees so that it becomes attractive to retire, the ZCTU acting secretary general, Runesu Dzimiri said in a statement.\n\nThe ZCTU said it finds it outrageous for the government to, without adequate consultation, resort to self-help antics to avoid meeting and improving its obligations to employees and pensioners.\n\nWhile noting that it is optional for one to extend to the new age limits, the ZCTU reiterated that the option must not be driven by desperation and fear of poverty after retirement owing to poor pensions and implored the government to pay above Poverty Datum Line (PDL)salaries so that a worker can be at liberty to continue working or proceed on retirement without reservations.\n\nSaid Dzimiri; Government policy needs to unlock employment opportunities for thousands of youths graduating from universities, polytechnics and vocational training institutions instead of shutting them out of employment. The move entails a five year freeze or insignificant payment of pension gratuities with the government saving millions of dollars.\n\nHe said the move may also disadvantage some workers who may die before reaching the age of 70 as their benefits would be significantly reduced.\n\nThe ZCTU called upon the government to revisit the reform, respect senior citizens and focus on tenets that bring direct and improved benefits to its employees and pensioners instead of crafting slave policies to wriggle out of its responsibilities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/09165340/ZCTU.jpg",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) has rejected government’s policy offering civil servants an opportunity to work way beyond their retirement age arguing the initiative breaches basic rights. Through Statutory Instrument 201 of 2024 under the Presidential Powers (Temporary Measures) (General Laws Amendment) Regulations, 2024, President Emmerson Mnangagwa raised the retirement</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-rejects-governments-policy-for-civil-servants-to-work-forever/\">Labour rejects government’s policy for civil servants to work ‘forever’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        },
        {
            "title": "24 people killed in Zimbabwe’s rainfall-related incidents",
            "url": "https://www.newzimbabwe.com/24-people-killed-in-zimbabwes-rainfall-related-incidents/",
            "content": "By Xinhua\n\nA TOTAL of 24 people died, and six others have been injured in rainfall-related incidents in Zimbabwe since the start of the rainy season last October, the countrys Department of Civil Protection (DCP) said Friday.\n\nAfter experiencing below-average rainfall during the first half of the season, from October to December 2024, Zimbabwe has recorded significant rainfall across the country since January, leading to several rain-induced incidents, including drownings.\n\nAccording to a situation report issued by the DCP, the heavy rains have affected hundreds of households and caused damage to critical public infrastructure, including schools, health facilities, roads, bridges, dams, electricity poles and irrigation schemes.\n\nSince October, 983 households, 129 schools and 13 health facilities have been damaged, the DCP reported.\n\nMoreover, 42 public infrastructure facilities, including a police post, a government building responsible for issuing national identity documents and industrial buildings, have sustained damage due to the heavy rains, the DCP noted.\n\nZimbabwes rainy season typically spans the summer months, occurring from around October to March.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/16044936/Drown.jpg",
            "description": "<p>By Xinhua A TOTAL of 24 people died, and six others have been injured in rainfall-related incidents in Zimbabwe since the start of the rainy season last October, the country’s Department of Civil Protection (DCP) said Friday. After experiencing below-average rainfall during the first half of the season, from October to December 2024, Zimbabwe has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/24-people-killed-in-zimbabwes-rainfall-related-incidents/\">24 people killed in Zimbabwe’s rainfall-related incidents</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "27 Jan 2025"
        }
    ]
}