{
    "news": [
        {
            "title": "DNC bus accident: Government allocates US$197,000 for victims as repatriation process begins",
            "url": "https://www.newzimbabwe.com/dnc-bus-accident-government-allocates-us197000-for-victims-as-repatriation-process-begins/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT has set aside nearly US$197,000 to cover the medical and repatriation costs for Zimbabwean victims of the Limpopo bus accident, which killed 44.\n\nThe victims, Zimbabweans and Malawians, were travelling back home when the DNC bus veered off the N1 North near Louis Trichardt on 13 October, killing 43 passengers and injuring 40 others, the victims. One more person succumbed to injuries in the hospital, bringing the death toll to 44.\n\n36 Zimbabweans died and 13 remain hospitalised in South Africa, with three in a critical condition.\n\nPreliminary investigations have revealed that the accident was due to brake failure and overloading of the bus, which was carrying 91 passengers with only a 62-seater capacity.\n\nPresident Emmerson Mnangagwa has since declared the bus accident a national disaster.\n\nPresenting a ministerial statement in the National Assembly recently, the Deputy Minister of Local Government and Public Works, Benjamin Kabikira, said the repatriation will be conducted in batches beginning on Friday.\n\nThe positive identification of all deceased was completed on the 20th of October, 2025, with the ZRP forensic team present to assist with the fingerprint screening and verification. In cases involving deceased children, DNA samples were collected from both the deceased and their next of kin for accurate identification.\n\nThen, on the death registration and documentation, all required documentation, including the death certificates and burial orders, are being processed to facilitate repatriation.\n\nThe repatriation to Zimbabwe is anticipated to begin in batches from Friday, 24th October 2025, pending the completion of all formal processes. A mass memorial service will be held in Beitbridge when the bodies arrive in Zimbabwe, said Kabikira.\n\nKabikira added that US$197,000 has been set aside to assist the victims.\n\nSecondly, we have dispatched a bus with next of kin or relatives from the National Disaster Management Centre, Harare, to the Beitbridge route to South Africa, for identification of the bodies. Zimbabwean nationals, that is next of kin without valid passports, were granted temporary passage into South Africa for the sole purpose of identifying the deceased.\n\nA list of names for the next of kin and national IDs was submitted to South African Immigration in advance to ensure smooth border processing. As a Ministry, post mortems were completed on Friday, the 17th of October, 2025 and the physical identification was also completed as of 20 October at Siloam Hospital.\n\nAs an intervention, the department of Civil Protection requested the Ministry of Transport and Infrastructural Development and Zim Borders for a waiver of border charges for the hearses and bus carrying the bodies and families of the bereaved. The budget for intervention and coordination of the disaster is as follows: We are anticipating using a total amount of US$197,940 or ZWG5,340,930. 3 in the coordination and intervention of the disaster, said Kabikira.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus-e1760778980550.png",
            "description": "<p>By Darlington Gatsi GOVERNMENT has set aside nearly US$197,000 to cover the medical and repatriation costs for Zimbabwean victims of the Limpopo bus accident, which killed 44. The victims, Zimbabweans and Malawians, were travelling back home when the DNC bus veered off the N1 North near Louis Trichardt on 13 October, killing 43 passengers and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-accident-government-allocates-us197000-for-victims-as-repatriation-process-begins/\">DNC bus accident: Government allocates US$197,000 for victims as repatriation process begins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "24 Oct 2025"
        },
        {
            "title": "UK police arrest three men on suspicion of spying for Russia",
            "url": "https://www.newzimbabwe.com/uk-police-arrest-three-men-on-suspicion-of-spying-for-russia/",
            "content": "Agencies\n\nPolice in the United Kingdom have arrested three men on suspicion of assisting Russias foreign intelligence service, as tensions between a key ally of Ukraine in the war and Moscow continue to simmer.\n\nThe Metropolitan Police said on Thursday the men  aged 44, 45 and 48  were arrested from west and central London under the 2023 National Security Act on suspicion of assisting a foreign intelligence service.\n\nThey said the country in question isRussia, according to The Associated Press news agency.\n\nThose addresses, along with another, are currently being searched, with counterterrorism police leading the investigation, they said.\n\nBritish authorities allege that Russia is conducting an increasingly boldcampaignof espionage, sabotage and cyber-interference against the United Kingdom.\n\nWere seeing an increasing number of who we would describe as proxies being recruited by foreign intelligence services, and these arrests are directly related to our ongoing efforts to disrupt this type of activity, said Commander Dominic Murphy, head of counterterrorism policing in London.\n\nThe developments came as six men were being sentenced for their part in an arson attack on Ukraine-linked businesses in east London last year. Prosecutors said it had been ordered by the Russian mercenary group Wagner.\n\nThe ringleader, Dylan Earl, was the first person convicted under the National Security Act, which gives prosecutors powers to put spying suspects on trial in a wider set of circumstances.\n\nLast week, the head of the UKs MI5 security service, Ken McCallum, alleged that Russia is committed to causing havoc and destruction.\n\nIn the last year, we and the police have disrupted a steady stream of surveillance plots with hostile intent aimed at individuals [whom] Russian leaders perceive as their enemies, he said.\n\nThe Kremlin has denied accusations that it is involved in any such acts of sabotage, saying the British government repeatedly blames Russia for anything bad that happens in the UK.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23201037/new-scotland-yard.webp",
            "description": "<p>Agencies Police in the United Kingdom have arrested three men on suspicion of assisting Russia’s foreign intelligence service, as tensions between a key ally of Ukraine in the war and Moscow continue to simmer. The Metropolitan Police said on Thursday the men – aged 44, 45 and 48 – were arrested from west and central</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-police-arrest-three-men-on-suspicion-of-spying-for-russia/\">UK police arrest three men on suspicion of spying for Russia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "24 Oct 2025"
        },
        {
            "title": "IVF test could misjudge embryo health, study finds",
            "url": "https://www.newzimbabwe.com/ivf-test-could-misjudge-embryo-health-study-finds/",
            "content": "BBC\n\nResearchers have raised concerns about the reliability of a widely used IVF screening method, which checks for chromosomal abnormalities.\n\nScientists at the Loke Centre for Trophoblast Research, University of Cambridge, said the test, used in many fertility clinics for IVF, was likely to overestimate the number of embryos with abnormalities.\n\nThe treatment is often offered to older women or women with a history of miscarriage or failed IVF cycles.\n\nHowever, scientists believed the test could be picking up errors in cells that would form in the placenta, rather than those that had developed in the embryos.\n\nThe test, known as pre-implantation genetic testing for aneuploidy (PGT-A), is designed to screen embryos before implantation.\n\nWhen abnormalities were detected, the embryo may be deemed inviable and discarded, so patients may undergo another cycle of treatment, which can be costly.\n\nButnew researchsuggested that some of the abnormalities detected by the tests may not be relevant to the embryos viability.\n\nLooking to better understand the development of the embryo at its early stage, Cambridge researchers and the Francis Crick Institute developed a new, state-of-the-art method to watch embryos live in high resolution.\n\nIt used fluorescent tagging to track cell division in 3D.\n\nAbnormalities arise at a relatively late stage of the embryos development and appear in the outer layer of the blastocyst.\n\nThe blastocyst develops into the placenta, and it is from this layer that biopsies were taken for pre-genetic testing.\n\nFirst author Dr Ahmed Abdelbaki, a postdoctoral researcher at the Loke Centre, said it was the first time the imaging technique had been used, and it allowed them to see what was happening.\n\nIt meant that we could watch the embryos as they developed over a two-day period, the longest continuous time that this process has been observed.\n\nCo-author Professor Ben Steventon from the Department of Genetics at the University of Cambridge said: Its proof of the power of direct observation to uncover unexpected findings in human biology.\n\nThe embryos in the study were donated by families who had successful pregnancies.\n\nProfessor Kathy Niakan, director of the Loke Centre and chair of Cambridge Reproduction, said her team was now studying cells in the inner cell layer, which forms the fetus.\n\nMuch more basic research is needed to inform future clinical practice and improve rates of assisted conception, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/13080322/baby-feet.jpg",
            "description": "<p>BBC Researchers have raised concerns about the reliability of a widely used IVF screening method, which checks for chromosomal abnormalities. Scientists at the Loke Centre for Trophoblast Research, University of Cambridge, said the test, used in many fertility clinics for IVF, was likely to overestimate the number of embryos with abnormalities. The treatment is often</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ivf-test-could-misjudge-embryo-health-study-finds/\">IVF test could misjudge embryo health, study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "24 Oct 2025"
        },
        {
            "title": "Chiwenga is naive, not a politician, was castrated when he dumped military post for role under Mnangagwa – says Mliswa",
            "url": "https://www.newzimbabwe.com/chiwenga-is-naive-not-a-politician-was-castrated-when-he-dumped-military-post-for-role-under-mnangagwa-says-mliswa/",
            "content": "By Leopold Munhende\n\nVICE President Constantino is naive, has no people behind him and was castrated when he dumped his post as Commander of Defence Forces (CDF) for a political role under President Emmerson Mnangagwa, outspoken former legislator Temba Mliswa has said in another scathing attack.\n\nChiwenga, who is eyeing the presidency after Mnangagwa, is having to deal with a well-oiled faction within Zanu PF that is not only backing businessman Kudakwashe Tagwirei to succeed but supporting the extension of their bosss current term to 2030.\n\nMliswa is now part of this unit behind Tagwirei and Mnangagwa. He has not made his choice a secret over the past weeks.\n\nSpeaking on The Hot Seat, an online current-affairs show hosted by journalist Violet Gonda, Mliswa did not hold back. He ripped into Chiwenga over the hour-long interview available on YouTube.\n\nThe Vice President has no political capital; he is not a politician and for him to become a president of this country he must be supported by the party structures which are political, said Mliswa.\n\nHe is not at all supported by the party structures. He does not even see eye to eye with the chairperson of his own province, Mashonaland East, Daniel Garwe. He is a soldier; he is not a politician.\n\nHe has to go at ward, village, constituency, district, provincial then national level; these are the structures. I have never seen him at village, ward, constituency, provincial level, all I have seen him is in the Central Committee and Politburo lobbying for himself.\n\nWhen you have people, they lobby for you, you do not lobby for yourself. He has nobody behind him. He has no political capital.\n\nIf at all he had political capital, why did he and his people not object to Resolution No. 1 of at the last conference in Bulawayo. He was sitting there, he did not object to it, he adopted it.\n\nHe speaks on his own.\n\nChiwenga has so far faltered in his attempts to shut out Tagwirei. His attempts to bar him from joining the partys powerful Central Committee fell through when Tagwirei was eventually confirmed last week, while he was asked to redirect a litany of corruption allegations against him to the Zimbabwe Anti-Corruption Commission (ZACC) or police.\n\nHaving led the military-assisted coup that toppled late President Robert Mugabe and installed Mnangagwa, very little is known about Chiwengas influence within the army or whether it still exists.\n\nAdded Mliswa: It was nave on his part to think that being a Vice President is powerful, it is not; if anything, he was castrated.\n\nAs CDF you have power, you are probably the second most powerful person in the country after the President.\n\nHe left a more powerful position and went for a weaker position. He is nave, he was misguided, misinformed to think that when you are VP you will be President.\n\nHe has no political capital at all because the very same war veterans that he relies on, the very same soldiers he relies on do not respect him because they have suffered yet he has been in key positions to uplift their welfare.\n\nThe war veterans welfare has been a mess. Where has he been?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/26072826/Chiwenga-scaled.webp",
            "description": "<p>By Leopold Munhende VICE President Constantino is naive, has no people behind him and was “castrated” when he dumped his post as Commander of Defence Forces (CDF) for a political role under President Emmerson Mnangagwa, outspoken former legislator Temba Mliswa has said in another scathing attack. Chiwenga, who is eyeing the presidency after Mnangagwa, is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiwenga-is-naive-not-a-politician-was-castrated-when-he-dumped-military-post-for-role-under-mnangagwa-says-mliswa/\">Chiwenga is naive, not a politician, was castrated when he dumped military post for role under Mnangagwa – says Mliswa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "24 Oct 2025"
        }
    ]
}