{
    "news": [
        {
            "title": "Mutsvangwa avoids tackling ZANU PF factionalism head-on, claims vocal Geza being “used”",
            "url": "https://www.newzimbabwe.com/mutsvangwa-avoids-tackling-zanu-pf-factionalism-head-on-claims-vocal-geza-being-used/",
            "content": "By Darlington Gatsi\n\nAS the Zanu PF internal fissures worsen, party spokesperson, Christopher Mutsvangwa, on Thursday sidestepped the elephant in the roomfactionalism.\n\nZANU PF is currently divided, with one faction pushing for the suspension of the 2028 elections to enable President Emmerson Mnangagwa to remain in power until 2030, while another believed to be backing Vice President Constantino Chiwenga insists on maintaining the constitutionally stipulated two-term limit.\n\nNeither Mnangagwa nor Chiwenga has publicly acknowledged the emerging factions.\n\nAddressing the media at the ZANU PF headquarters on Thursday, Mutsvangwa professed ignorance of the simmering tensions within the party.\n\nThat question is new to me. I am trying to focus on things which have consequences, said Mutsvangwa when questioned by the media.\n\nNational events have laid bare the fractures within the ruling party, with supporters displaying clear internal divisions. Recently two factions of ZANU PF supporters were heard chanting pro-Mnangagwa and another, pro-Chiwenga songs at Heroes Acre.\n\nAnother faction of war veterans, led by the outspoken Blessed Geza, has been calling for Mnangagwa to step aside, accusing him of overseeing a corrupt government.\n\nMnangagwas term ends in 2028, and he has stated that he will not run for another term, contrary to the sentiments of some of his supporters within ZANU PF.\n\nWithout mentioning names, Mutsvangwa suggested that Geza was being used to further a certain agenda within the party to unseat Mnangagwa.\n\nI have a lot of angst about the way he is being used by people who have a certain agenda. Comrade Geza, I do not know what other issues might be bothering you, but we, the war veterans, always remember I wish he would not follow fools who are misleading him. I am deeply concerned about what is happening with him, said Mutsvangwa.\n\nThe factional battles within ZANU PF are reminiscent of the internal politics that rocked the revolutionary party, resulting in the ousting of long-time ruler Robert Mugabe, who was replaced by Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>By Darlington Gatsi AS the Zanu PF internal fissures worsen, party spokesperson, Christopher Mutsvangwa, on Thursday sidestepped the elephant in the room—factionalism. ZANU PF is currently divided, with one faction pushing for the suspension of the 2028 elections to enable President Emmerson Mnangagwa to remain in power until 2030, while another believed to be backing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutsvangwa-avoids-tackling-zanu-pf-factionalism-head-on-claims-vocal-geza-being-used/\">Mutsvangwa avoids tackling ZANU PF factionalism head-on, claims vocal Geza being “used”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zimbabwe defiant amid Trump’s onslaught, vows to fill funding void",
            "url": "https://www.newzimbabwe.com/zimbabwe-defiant-amid-trumps-onslaught-vows-to-fill-funding-void/",
            "content": "By Darlington Gatsi\n\nTHE government has stopped short of telling the United States of America to go hang following the termination of financial aid to African countries.\n\nZimbabwe is among the African nations affected by the Executive Order signed by U.S. President Donald Trump, which halts aid to Africa.\n\nFinancial aid had previously alleviated the countrys burden in tackling HIV and AIDS through the U.S. Presidents Emergency Plan for AIDS Relief (PEPFAR).\n\nResponding to questions in the National Assembly recently, Deputy Minister of Health Sleiman Kwidini stated that the government would cover the gaps left by the withdrawal of U.S. funding.\n\nYes, there might indeed be an impact from the withdrawal of the United States Agency for International Development (USAID) from the World Health Organisation (WHO). However, what I want the Honourable Member to be aware of is the policy. When a policy is formulated, it is not wholly dependent on other stakeholders with whom we may collaborate to improve the livelihoods of our people.\n\nNevertheless, the issue is now before the Ministry and the Government at large because we had an agreement and collaboration with these stakeholders, who have now withdrawn their support.\n\nIt is now the mandate of the Ministry and the Government to ensure that these programmes, which were previously supported by external stakeholders, are now fully managed by the Ministry so that we can cover the gap left by the withdrawal of funding, said Kwidini.\n\nAn estimated 1.2 million Zimbabweans are benefiting from PEPFAR, with 1,600 public hospitals and clinics having received technical support from the U.S. government.\n\nLast year, Zimbabwe achieved the 95-95-95 goals in the fight against HIV/AIDS, but there are concerns that this progress might be derailed if the government fails to find a solution to fill the gap left by the withdrawal of U.S. support.\n\nKwidini said a clear plan is being formulated to allocate funds accordingly.\n\nIn terms of HIV and AIDS, malaria, and tuberculosis, these were originally Government programmes. We then had stakeholders who came in to fund those programmes. As we speak, our technocrats are working to ensure that we cover the gap left by these programme implementers, as they were supporting our national policies.\n\nHowever, as policymakers, and as I mentioned earlier, the Ministrys technocrats are currently exploring the best ways to develop solutions, particularly in budgeting and human capital, which have been affected by the withdrawal of these funds. Essentially, the policy already exists, but what has been withdrawn is the support we were receiving from the funders, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01092436/PEPFAR.webp",
            "description": "<p>By Darlington Gatsi THE government has stopped short of telling the United States of America to go hang following the termination of financial aid to African countries. Zimbabwe is among the African nations affected by the Executive Order signed by U.S. President Donald Trump, which halts aid to Africa. Financial aid had previously alleviated the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-defiant-amid-trumps-onslaught-vows-to-fill-funding-void/\">Zimbabwe defiant amid Trump’s onslaught, vows to fill funding void </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zimbabwe’s bullion-backed ZiG is missing out on gold’s record run",
            "url": "https://www.newzimbabwe.com/zimbabwes-bullion-backed-zig-is-missing-out-on-golds-record-run/",
            "content": "Bloomberg\n\nZimbabwes bullion-backed currency is missing out on an impressive gold rally, because of a liquidity squeeze thats choking the economy and difficulties in exchanging the unit for dollars.\n\nSince the ZiG, short for Zimbabwe Gold, started trading on April 8 the gold price has rallied 24% to a record high, while the local currency has weakened 95% to the dollar.\n\nNo rationale market player is really looking at the gold price, but money supply, said Shelton Sibanda, the chief investment officer at Imara Asset Management, the nations oldest brokerage, which manages $100 million. We have seen money supply tightened in the past few months and that really is what has sway on the local currency.\n\nThe central bank has curtailed money supply and kept the key interest rate at 35% since devaluing the ZiG by 43% in September to help it stabilize. It was launched last year to supersede the dollar in domestic transactions after previous attempts to stand up a local currency failed.\n\nTight monetary policy has also negatively impacted stocks. Governor John Mushayavanhu said last week the central banks tight policy stance comes with inevitable liquidity squeeze, necessary to instill market discipline and curtail disruptive speculative behavior in the economy.\n\nDifficulties in being able to exchange ZiGs for dollars have also excluded it from golds gains by casting doubt over the local currencys viability, Sibanda said.\n\nIt also points to the southern African nation not having enough hard currency foreign reserves to support a stable, freely convertible currency, said Hasnain Malik, an emerging markets strategist at Tellimer in Dubai.\n\nThe only real benefit its getting from bullions record run is in the value of the countrys gold reserves, said Sibanda. The Reserve Bank of Zimbabwes stockpiles have risen to 2.67 tons from 1.5 tons at the ZiGs debut.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171613/mushayavanhu-zig.jpg",
            "description": "<p>Bloomberg Zimbabwe’s bullion-backed currency is missing out on an impressive gold rally, because of a liquidity squeeze that’s choking the economy and difficulties in exchanging the unit for dollars. Since the ZiG, short for Zimbabwe Gold, started trading on April 8 the gold price has rallied 24% to a record high, while the local currency</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-bullion-backed-zig-is-missing-out-on-golds-record-run/\">Zimbabwe’s bullion-backed ZiG is missing out on gold’s record run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "Mnangagwa declares Beitbridge accident which killed 24 a national disaster, offers state-assisted funerals",
            "url": "https://www.newzimbabwe.com/mnangagwa-declares-beitbridge-accident-which-killed-24-a-national-disaster-offers-state-assisted-funerals/",
            "content": "By Thandiwe Garusa\n\nThe government has declared the accident which claimed 24 lives along the Masvingo-Beitbridge highway on Thursday a national disaster and has pledged to assist bereaved families with funeral expenses.\n\nThe tragicaccidentoccurred near Lutumba tollgate when a Beitbridge-bound Urban Connect bus collided with a truck transporting magnesium to Chirundu.\n\n17 died on the spot, while seven others succumbed to their injuries upon admission at Beitbridge Hospital.More than 30 passengers were injuredwith 12 in critical condition.\n\nIn a statement, President Emmerson Mnangagwa said, The death of 24 Zimbabweans in a head-on collision between an Urban Connect bus and a commercial haulage truck, along the Beitbridge-Masvingo Highway this morning, left me horrified and heartbroken.\n\nFellow Zimbabweans, our nation does not deserve this at all, let alone experiencing such a tragic incident at the beginning of the year. We must do everything possible to prevent such unjustified loss of life.\n\nI therefore appeal to all motorists to exercise extreme caution on our roads, for the sake of both their fellow road users and themselves.\n\nAll arms of government responsible for ensuring road safety are reminded to work tirelessly and use all legal means and powers available to them to reduce and ultimately end such carnage.\n\nGovernment has therefore declared this incident a national disaster and will accord victims of this horrendous crash state-assisted burials, Mnangagwa said.\n\nHe also wished those injured a speedy recovery.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13112930/urban-connect.jpeg",
            "description": "<p>By Thandiwe Garusa The government has declared the accident which claimed 24 lives along the Masvingo-Beitbridge highway on Thursday a national disaster and has pledged to assist bereaved families with funeral expenses. The tragic accident occurred near Lutumba tollgate when a Beitbridge-bound Urban Connect bus collided with a truck transporting magnesium to Chirundu. 17 died on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-declares-beitbridge-accident-which-killed-24-a-national-disaster-offers-state-assisted-funerals/\">Mnangagwa declares Beitbridge accident which killed 24 a national disaster, offers state-assisted funerals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zimbabwe seeks $950m in new bid to kick-start mining firm",
            "url": "https://www.newzimbabwe.com/zimbabwe-seeks-950m-in-new-bid-to-kick-start-mining-firm/",
            "content": "Bloomberg\n\nZimbabwes state miner is planning a fresh bid to kick-start a range of projects a year after the government took full control of the company.\n\nKuvimba Mining House, under new Chief Executive Officer Trevor Barnard, is looking to development banks, mining companies and traders to raise $950 million to develop lithium, platinum and gold assets, he said in an interview.\n\nAccess to all the large development banks, to all the funding, to all the major traders has just opened up, said Barnard, without identifying the potential financiers. The change in the ownership structure has been really a very good move for Kuvimba.\n\nPrevious attempts to raise funding were hindered because of speculation over the undisclosed identity of private investors who held about a third of the company. Earlier attempts to hold an initial public offering and form a venture with Russian investors were abandoned.\n\nKuvimbas main assets were formerly held by companies tied to Kudakwashe Tagwirei, a politically connected businessman, Bloomberg reported in 2021.\n\nTagwirei, a one-time adviser to Zimbabwes President Emmerson Mnangagwa, has been sanctioned for alleged corruption by the US and the UK. Kuvimba has always denied that he ever held a stake in the company.\n\nThe government has discussed handing some of Kuvimbas output to Trafigura Group to repay an outstanding fuel debt, Bloomberg reported in 2022.\n\nMore than half of the amount the company plans to raise will go toward a building an underground platinum mine at the long-delayed Darwendale project, according to Barnard, who took up his post in December. A lithium project the company estimates will cost as much as $275 million may be quicker to develop, he said.\n\nThe company has agreed a lithium joint venture with Chinese mining firms, and will finalise the deal by March before proceeding to build the first phase of the project known as Sandawana.\n\nIt will take about 15 months after signing to start production that will ultimately reach 500 000 tons of lithium concentrate per annum, Barnard said. The Chinese partners will finance the project and transfer it back to Kuvimba once the loan is repaid, a process he estimated would take less than five years.\n\nKuvimba also plans to develop a second area at Sandawana. Barnard said the company has already received interest from potential investors, including Cluff Africa Ltd. and a major European commodity trader that he declined to name. Other Chinese investors are also keen, he said, adding Kuvimba may sign a deal within six to 12 months.\n\nCluff didnt immediately respond to an emailed request for comment.\n\nAt the Darwendale platinum deposit, the company initially plans to develop a smaller open-pit mine this year that will cost about $50 million to dig. It will pay another mining company to process that ore, according to Barnard.\n\nKuvimba is in talks with development banks for loans to finance the bigger, underground project and processing facilities, he said, without giving more detail. The targeted start date is within three years.\n\nZimbabwe holds the worlds second-biggest platinum reserves after South Africa and is Africas biggest lithium producer.\n\nKuvimba is now 70%-owned by the state sovereign wealth fund known as Mutapa Investment Fund, with entities held by the finance ministry, including state pension funds, power utilities and a deposit insurance fund, holding the rest, Barnard said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10062203/kuvimba.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s state miner is planning a fresh bid to kick-start a range of projects a year after the government took full control of the company. Kuvimba Mining House, under new Chief Executive Officer Trevor Barnard, is looking to development banks, mining companies and traders to raise $950 million to develop lithium, platinum and gold</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-seeks-950m-in-new-bid-to-kick-start-mining-firm/\">Zimbabwe seeks $950m in new bid to kick-start mining firm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "ZMX set to host landmark A-ACX Annual Conference",
            "url": "https://www.newzimbabwe.com/zmx-set-to-host-landmark-a-acx-annual-conference/",
            "content": "By Alois Vinga\n\nZIMBABWE Mercantile Exchange (ZMX) is set to host the Africa Continental Free Trade Area (AfCFTA) Association of African Commodity Exchanges (A-ACX) annual conference in March.\n\nRunning from 26 to 27 March 2025 at the Elephant Hills Hotel in Victoria Falls, the conference will feature high-level continental and global speakers and panellists ranging from commodities exchanges, financial and logistics services providers, government officials and many others in the commodities value chains.\n\nThe decision to select Zimbabwe for this momentous event underscores the countrys growing influence in the continental commodities market and its commitment to the objectives of the African Continental Free Trade Area (AfCFTA), said ZMX.\n\nThe A-ACX, an alliance of commodity exchanges across Africa, was established to foster collaboration and alignment with AfCFTAs broader goals of catalysing economic growth and promoting trade among African nations. The association aims to play a pivotal role in advancing intra-African trade in commodities and related services, providing a platform for innovation, market development, and regional economic integration.\n\nThe theme of the upcoming conference,Scaling Intra-African Trade: Leveraging Commodity Exchanges for Economic Resilience and Growth,reflects the shared vision of enhancing Africas trade ecosystem.\n\nThe event is set to address critical issues, such as harmonising trade practices across African markets, building pan-African supply chains, promoting investment in the continents abundant resources, and advocating for policy reforms to unlock the potential of regional trade.\n\nZimbabwe, through the ZMX, has been a key contributor to the A-ACXs initiatives. As the host nation, Zimbabwe is tasked with managing a comprehensive agenda for the conference, which will bring together key stakeholders, including commodity exchange leaders, policymakers, and international organisations. The conference will feature a diverse array of sessions, discussions, and networking opportunities designed to share knowledge, build capacity, and explore innovative strategies for market development, said the organisation.\n\nHosting the A-ACX Annual Conference represents a significant milestone for Zimbabwe, offering numerous benefits.\n\nZimbabwe will showcase its contributions to the continents commodities market, highlighting its innovative frameworks and market development strategies. It is also expected to attract investments in commodities and natural resources, sectors vital to Zimbabwes economy.\n\nThe ZMX, which has been at the forefront of transforming Zimbabwes commodities market, will gain a platform to highlight its innovative frameworks and inspire other African nations.\n\nThe conference will also provide a boost to Zimbabwes tourism and hospitality sectors, welcoming delegates from across the continent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13082417/zmxpost-01.png",
            "description": "<p>By Alois Vinga ZIMBABWE Mercantile Exchange (ZMX) is set to host the Africa Continental Free Trade Area (AfCFTA) Association of African Commodity Exchanges (A-ACX) annual conference in March. Running from 26 to 27 March 2025 at the Elephant Hills Hotel in Victoria Falls, the conference will feature high-level continental and global speakers and panellists ranging</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zmx-set-to-host-landmark-a-acx-annual-conference/\">ZMX set to host landmark A-ACX Annual Conference   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "Africa’s population growth requires stronger food security measures: AU official",
            "url": "https://www.newzimbabwe.com/africas-population-growth-requires-stronger-food-security-measures-au-official/",
            "content": "Xinhua\n\nWith Africas population expected to reach 2.5 billion by 2050, the continent has to enhance its sustainable food production and processing capabilities to ensure food security, a senior African Union (AU) official has said.\n\nJosefa Sacko, AU commissioner for agriculture, rural development, blue economy and sustainable environment, made the call on Thursday while addressing the media on the sidelines of the ongoing 38th AU Summit, which is taking place from Feb. 12 to 16 at the AU headquarters in Addis Ababa, Ethiopias capital.\n\nNoting the complex impact of global and regional shocks, ranging from public health challenges and pandemics to the ongoing crisis in Ukraine and other geopolitical uncertainties, Sacko said Africa has to strengthen its food production and processing systems. She added that these challenges have been further exacerbated by rising inflation, making food security an even more critical issue.\n\nShe said that the 10-year Comprehensive Africa Agriculture Development Program strategy and action plan for 2026-2035, adopted earlier this year at the AU Extraordinary Summit in Kampala, Ugandas capital, serves as a blueprint for advancing agricultural development and food systems across the continent.\n\nOur first strategic pillar is intensifying sustainable food production because we need to produce more. By 2050, Africas population is projected to reach 2.5 billion, so how are we going to feed this growing population? That is why we must intensify sustainable food production, Sacko told reporters.\n\nThe AU commissioner said that, in addition to increasing food production, African countries must also enhance food processing capabilities.\n\nShe said that improving these systems is essential not only for strengthening food security but also for creating job opportunities for Africas rapidly growing youth population.\n\nShe stressed that achieving food and nutrition security for all Africans requires promoting inclusive and equitable livelihoods, particularly since 70 percent of the continents population lives in rural areas.\n\nNoting that Africas agricultural production is predominantly rain-fed, Sacko underscored the need to develop resilient agri-food systems.\n\nWe need to look at the nexus between the environment and agriculture, including the impact of climate change on our largely rain-fed farming, she said, adding that it is essential to apply innovative technologies to mitigate the adverse effects of recurrent droughts and other natural disasters on Africas agriculture sector.\n\nThis years AU Summit is being held under the AUs 2025 theme: Justice for Africans and People of African Descent Through Reparations. As part of the annual gathering, the AU Executive Council, comprising foreign ministers from AU members, met on Wednesday and Thursday, followed by the Assembly of African Heads of State and Government, which will convene on Saturday and Sunday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13171535/african_union001.webp",
            "description": "<p>Xinhua With Africa’s population expected to reach 2.5 billion by 2050, the continent has to enhance its sustainable food production and processing capabilities to ensure food security, a senior African Union (AU) official has said. Josefa Sacko, AU commissioner for agriculture, rural development, blue economy and sustainable environment, made the call on Thursday while addressing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africas-population-growth-requires-stronger-food-security-measures-au-official/\">Africa’s population growth requires stronger food security measures: AU official</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zimbabwe’s Foreign Minister plans to visit Russia ‘very soon’",
            "url": "https://www.newzimbabwe.com/zimbabwes-foreign-minister-plans-to-visit-russia-very-soon/",
            "content": "Sputnik\n\nZimbabwes Minister of Foreign Affairs and International Trade, Amon Murwira, has told Sputnik that he plans to visit Russia very soon.\n\nVery soon. Extremely soon, Murwira said when asked whether he wanted to visit Russia in the near future.\n\nThe minister described relations between the southern African nation and Russia as excellent, adding that the two countries were cooperating on numerous joint projects in science, technology and mining.\n\nBut most broadly, we have excellent relations, excellent economic cooperation, and we are looking forward to deeper issues, Murwira said.\n\nThe top Zimbabwean diplomat spoke to Sputnik on the sidelines of the 46th ordinary session of the Executive Council of the African Union in the Ethiopian capital of Addis Ababa, which began on Wednesday.\n\nThe two-day event is taking place under the slogan Justice for Africans and People of African Descent through Reparations. African Union member states will review and assess their achievements in addressing the damage inflicted on the continent by the policies of colonialism and apartheid, as well as the transatlantic slave trade.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13165307/Zimbabwe-s-President-Emmerson-Mnangagwa-L-Zimbabwe-s-Minister-of-Foreign-Affairs-and-International-Trade-Amon-Murwira.webp",
            "description": "<p>Sputnik Zimbabwe’s Minister of Foreign Affairs and International Trade, Amon Murwira, has told Sputnik that he plans to visit Russia “very soon.” “Very soon. Extremely soon,” Murwira said when asked whether he wanted to visit Russia in the near future. The minister described relations between the southern African nation and Russia as “excellent,” adding that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-foreign-minister-plans-to-visit-russia-very-soon/\">Zimbabwe’s Foreign Minister plans to visit Russia ‘very soon’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "Afrobeats’ rise documented in ‘The Odyssey,’ new film from Adekunle Gold featuring Seun Kuti and Ebenezer Obey",
            "url": "https://www.newzimbabwe.com/afrobeats-rise-documented-in-the-odyssey-new-film-from-adekunle-gold-featuring-seun-kuti-and-ebenezer-obey/",
            "content": "Variety\n\nIn an ambitious effort to chart the lineage of Yoruba and Afrobeats music over the past century and its global influence, Nigerian superstar Adekunle Gold has co-produced a forthcoming documentary titled The Odyssey. Co-produced by and helmed by award-winning director Abba T. Makama, the film aims to illuminate the timeline of Yoruba music from its foundational genres like Were, Sakara, Apala, Juju, and Fuji to its transformative impact on modern Afrobeats.\n\nThe Odyssey features contributions from a strong team led by executive producer Bobo Omotayo. Known for his Fuji: An Opera platform, Omotayo has been a champion of preserving and reimagining Yoruba music for contemporary audiences. The documentary also brings in Tosin Ashafa and Papa Omotayo as producers, with acclaimed Nigerian photographer Andrew Esiebo contributing a visual exhibition that will debut alongside the film.\n\nAmong its prominent voices, The Odyssey featuresSeun Kuti, the youngest son of Afrobeat pioneer Fela Kuti, who leads his fathers legendary band Egypt 80. Also joining the narrative are Chief Commander Ebenezer Obey, a Juju music icon, and Benson Idonije, celebrated music historian and Burna Boys grandfather. Their insights provide a variety of perspectives on Yoruba musics cultural significance and its enduring legacy.\n\nAdekunle Golds involvement as co-producer adds a dynamic layer to the documentary. The singer, whose genre-defying style blends Afropop, Fuji, Juju, R&B, and Amapiano, is positioned to bridge the gap between the past and the future of Yoruba music. This documentary is more than simply another project; its an opportunity to highlight the history of a sound that has shaped and will continue to shape music culture around the world, Gold says.\n\nDirector Abba T. Makama, known for such films as Green White Green and The Lost Okoroshi, is no stranger to using his lens to explore Nigerian culture. Weve already captured some incredibly fascinating interviews, Makama says. Having Adekunle Gold on board brings a contemporary touch that connects this story to a global audience.\n\nThe documentarys scope is as expansive as its subject matter, promising to examine Yoruba musics evolution across generations and its influence on Afrobeats. Interviews with musicians, producers, academics, and historians aim to deliver an immersive narrative, while Esiebos accompanying photography exhibition offers an intimate glimpse into the lives of the artists shaping this sound.\n\nExecutive producer Bobo Omotayo emphasized the importance of authentic storytelling. Our goal from the start has been to make a documentary that gives justice to Yoruba music by showcasing its essence, Omotayo says. With Adekunle Golds involvement, were adding a modern perspective to an already rich story.\n\nThe films release will be accompanied by a groundbreaking exhibition of Esiebos work, blending auditory and visual storytelling to honor Yoruba musics vibrancy and energy. Esiebos collection will highlight private and onstage moments of the featured artists, creating a multi-dimensional experience for viewers.\n\nAs Afrobeats continues to dominate global stages, The Odyssey seeks to remind audiences of its roots while celebrating its rise. The documentary aims to position Yoruba music not just as a regional phenomenon but as a pivotal force in the evolution of global music.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13171056/adekunle-gold.webp",
            "description": "<p>Variety In an ambitious effort to chart the lineage of Yoruba and Afrobeats music over the past century and its global influence, Nigerian superstar Adekunle Gold has co-produced a forthcoming documentary titled “The Odyssey.” Co-produced by and helmed by award-winning director Abba T. Makama, the film aims to illuminate the timeline of Yoruba music from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afrobeats-rise-documented-in-the-odyssey-new-film-from-adekunle-gold-featuring-seun-kuti-and-ebenezer-obey/\">Afrobeats’ rise documented in ‘The Odyssey,’ new film from Adekunle Gold featuring Seun Kuti and Ebenezer Obey</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        },
        {
            "title": "UK-based investigative unit claims CIO sought to kill Chamisa and have it blamed on Covid-19",
            "url": "https://www.newzimbabwe.com/uk-based-investigative-unit-claims-cio-sought-to-kill-chamisa-and-have-it-blamed-on-covid-19/",
            "content": "By Leopold Munhende\n\nUNITED Kingdom investigative unitDug Uphas made sensational claims that Zimbabwes much-feared Central Intelligence Organisation (CIO) considered eliminating opposition leader Nelson Chamisa in 2020, then have it blamed on Covid-19.\n\nChamisa, who was the front-runner to win Zimbabwes 2023 presidential elections, had been identified by CIO operatives as the main challenge to President Emmerson Mnangagwas second term in office.\n\nDug Ups article which seeks to explain how former CIO director general (DG) Isaac Moyo lost his job reveals intricate details about the goings on at the state security agency, including a plot to have him fired as way back as 2020, just over two years after his appointment by Mnangagwa.\n\nMoyo, reads the investigative piece, was viewed more as a diplomat rather than an operative. His juniors are said to have openly told Mnangagwa that having him as head of the CIO would cost him his presidency and advised that he be relieved of all duties.\n\nFor refusing to kill Chamisa and other problematic elements within Zimbabwes politics, Moyo was described as being too nice to lead the CIO.\n\nAs early as 2020, Mnangagwa received reports that claimed Moyo was a nice but ineffective DG. One such report, dated February 15, 2021, claimed Moyo had turned down two projects/operations that suggested using the Covid-19 pandemic as a smokescreen to kill opposition candidates including Nelson Chamisa.\n\nDug Up understands the proposal came from the operative division of the CIO and suggested that the elimination of opposition actors could be hidden behind the pandemic.\n\nThe DG refused to authorise the operations. His juniors wrote a report saying he was too nice to lead the CIO.\n\nMoyo found out and in a heated internal JOC meeting blasted his juniors. Provincial directors who sat in that meeting told Dug Up it was explosive and Isaacs deputies flat out told him You are not an Operative.\n\nThen leading the Citizens Coalition for Change (CCC) Chamisa survived numerous attempts on his life towards the 2023 elections.\n\nMoyo, who was eventually replaced by Fulton Mangwanya earlier this year, is reported to have unsuccessfully sought an exit in 2022 as confrontations and questions around his modus operandi from his juniors continued.\n\nAmongst many reforms Moyo brought to the CIO, operatives reportedly did not take kindly to him demanding that they surrender their identity cards before knocking off to reduce cases of abuse.\n\nMoyo, according to the article, also demanded reports for any case of excess force and barred the carrying of weapons.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Leopold Munhende UNITED Kingdom investigative unit Dug Up has made sensational claims that Zimbabwe’s much-feared Central Intelligence Organisation (CIO) considered eliminating opposition leader Nelson Chamisa in 2020, then have it blamed on Covid-19. Chamisa, who was the front-runner to win Zimbabwe’s 2023 presidential elections, had been identified by CIO operatives as the main challenge to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-based-investigative-unit-claims-cio-sought-to-kill-chamisa-and-have-it-blamed-on-covid-19/\">UK-based investigative unit claims CIO sought to kill Chamisa and have it blamed on Covid-19</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "14 Feb 2025"
        }
    ]
}