{
    "news": [
        {
            "title": "USAID website goes offline in Trump administration’s 2-week-old freeze on foreign aid worldwide",
            "url": "https://www.newzimbabwe.com/usaid-website-goes-offline-in-trump-administrations-2-week-old-freeze-on-foreign-aid-worldwide/",
            "content": "By Associated Press\n\nTHE website of the U.S. Agency for International Development went offline without explanation Saturday as thousands of furloughs, layoffs and program shutdowns continued in President Donald Trumps freeze on U.S.-funded foreign aid and development worldwide.\n\nCongressional Democrats battled the Trump administration increasingly openly, expressing concern that Trump may be headed toward ending USAID as an independent agency and absorbing it into the State Department.\n\nDemocrats say Trump has no legal authority to eliminate a congressionally funded independent agency, and that the work of USAID is vital to national security.\n\nTrump and congressional Republicans say much of foreign aid and development programs is wasteful. They single out programs they say advance liberal social agendas.\n\nThe fear of even tougher administration action against USAID comes two weeks into the administrations shutdown of billions of dollars of the United States humanitarian, development and security assistance.\n\nThe U.S. is the worlds largest donor of humanitarian aid by far. It spends less than 1% of its budget on foreign assistance, a smaller share overall than some other countries.\n\nAdministration officials had no comment Saturday when asked about concerns expressed by lawmakers and others that Trump may be planning to end USAIDs separate status.\n\nPresident John F. Kennedy created the organization at the height of the Cold War to counter Soviet influence. USAID today is at the center of U.S. challenges to the growing influence of China, which has a successful Belt and Road foreign aid program of its own.\n\nCongress passed the Foreign Assistance Act in 1961, and Kennedy signed that law and an executive order establishing USAID as an independent agency.\n\nUSAID staffers spent Friday and Saturday in chat groups monitoring its fate, giving updates on whether the agencys flag and signs were still up outside agency headquarters in Washington. As of late Saturday afternoon, they were.\n\nIn a post on X, Democratic Sen. Chris Murphy said presidents cannot eliminate congressionally appropriated federal agencies by executive order, and said Trump was poised to double down on a constitutional crisis.\n\nThats what a despot  who wants to steal the taxpayers money to enrich his billionaire cabal  does, Murphy said.\n\nBillionaire Elon Musk, advising Trump in a campaign to whittle down the federal government in the name of efficiency, endorsed posts on his X site calling for dissolving USAID.\n\nLive by executive order, die by executive order, Musk tweeted in reference to USAID. Trump placed an unprecedented 90-day freeze on foreign assistance on his first day in office Jan. 20.\n\nThe order, a tougher-than-expected interpretation of Trumps freeze order on Jan. 24 drafted by Peter Marocco, a returning political appointee from Trumps first term, shut down thousands of programs around the world and forced the furloughs or layoffs of many thousands.\n\nSecretary of State Marco Rubio has since moved to keep more kinds of strictly life-saving emergency programs going during the freeze. Aid groups say confusion surrounding what programs are still allowed to operate is contributing to paralysis in global aid organizations.\n\nRubio, in his first public comments on the matter, said Thursday that USAIDs programs were being reviewed to eliminate any that are not in the U.S. national interest, but he said nothing about eliminating it as an agency.\n\nThe shutdown of U.S.-funded programs during the 90-day review meant the U.S. was getting a lot more cooperation from recipients of humanitarian, development and security assistance, Rubio said.\n\nRepublicans and Democrats long have fought over the agency, arguing whether humanitarian and development aid protects the U.S. by helping stabilize partner countries and economies or is a waste of money.\n\nRepublicans typically push to give State more control of USAIDs policy and funds. Democrats typically build USAID autonomy and authority.\n\nA version of that battle played out in Trumps first term, when Trump tried to cut the budget for foreign operations by a third.\n\nWhen Congress refused, the Trump administration used freezes and other tactics to cut the flow of funds already appropriated by Congress for foreign programs. The General Accounting Office later ruled that it violated a law known as the Impoundment Control Act.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/07030414/USAID.jpg",
            "description": "<p>By Associated Press  THE website of the U.S. Agency for International Development went offline without explanation Saturday as thousands of furloughs, layoffs and program shutdowns continued in President Donald Trump’s freeze on U.S.-funded foreign aid and development worldwide. Congressional Democrats battled the Trump administration increasingly openly, expressing concern that Trump may be headed toward ending</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/usaid-website-goes-offline-in-trump-administrations-2-week-old-freeze-on-foreign-aid-worldwide/\">USAID website goes offline in Trump administration’s 2-week-old freeze on foreign aid worldwide</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "Who should count as African at the Grammy Awards?",
            "url": "https://www.newzimbabwe.com/who-should-count-as-african-at-the-grammy-awards/",
            "content": "By BBC\n\nAMERICAN musician Chris Brown, along with Nigerian artists, are up for Best African Music Performance this year.\n\nThe Grammy Awards has a dedicated space for African music, but just a year after the categorys introduction it is already proving contentious.\n\nThe Best African Music Performance made its debut with South Africas Tyla winning for her hit song Water, a blend of South African amapiano and Afropop.\n\nIt was a move welcomed across the industry, especially by African artists.\n\nBut the nominations for this years award have raised eyebrows, especially with the inclusion of US R&B star Chris Brown.\n\nThe 35-year-old has been nominated for his chart-topping single Sensational, which incorporates Afrobeats elements and features guest vocals from Nigerian artists Davido and Lojay.\n\nHowever, the participation of an American artist in an African music category has sparked some debate.\n\nShould non-African artists be considered in a category meant to showcase African talent?\n\nMusic is about inclusivity. We dont want to fence people out of genres, Grammy CEO Harvey Mason Jr tells the BBC.\n\nIf we start deciding who can or cant make a certain type of music, we lose the essence of creativity.\n\nThe head of the Grammys explains that such cross-fertilisation is expected.\n\nWeve seen it with Latin before, weve seen it with K-Pop and now youre starting to see it with Afrobeats and amapiano, he says.\n\nWe like to honour all music [regardless of] where it comes from or who makes it. If its excellent we want to celebrate it.\n\nAnother bone of contention this year is the dominance of Afrobeats, which has its roots in Nigeria and Ghana.\n\nThere is a feeling that the Grammys remain too focused on it, to the exclusion of other African music genres, despite calls for inclusivity.\n\nNigerian music journalist Ayomide Tayo says he understands why Afrobeats is dominating this years awards.\n\nI dont think Afrobeats is better, he tells the BBC.\n\nIts just that Afrobeats has had over three decades of exposure. We consistently pushed great music, superstars and events that have attracted the world to it, Lagos-based Tayo explains.\n\nNigerians living abroad have also played a crucial role in the popularisation of Afrobeats.\n\nThe Nigerian diaspora in England and North America is one of the key factors why Afrobeats exploded in Europe and the US, Tayo says.\n\nWhile other Africa-based music business professionals see a bright future for other African music genres, saying this year could be a one-off.\n\nFor example, amapiano, a genre that in 2023 surpassed 1.4 billion streams on the music app Spotify.\n\nRaphael Benza, head of Johannesburg-based record label Vth Season, says the very name Best African Performance goes against pigeonholing.\n\nComing from the home of amapiano, I would say [musicians] are doing extremely good work and I think next year youll see amapiano artists being nominated in this category, he tells the BBC.\n\nThe Best African Music Performance category was introduced as a way to honour Africas increasing influence on global music.\n\nWhen Tyla won, she beat Nigerian heavyweights like Davido and Burna Boy, establishing her place on the international stage.\n\nSince then, the 22-year-old has been spotted at the Met Gala in New York and has been featured in top fashion magazines, proving that the Grammys effect is real.\n\nThis years nominees, however, have shifted almost entirely to Nigerian artists, with Yemi Alade, Burna Boy, Tems and a joint nomination for Asake & Wizkid, as well as Davido and Lojay featuring on Chris Browns hit.\n\nTo be fair to Chris Brown, he has been invested in Afrobeats and African music for a long time, says Tayo, explaining that the US musician flew to Nigeria to collaborate with Davido and Wizkid.\n\nWe have an inside joke in Nigeria that we say Chris Brown is Nigerian, because of the ways he pops up in our songs and our music videos all the time.\n\nLast month, he also held two massive sell-out concerts at a 90,000-seater stadium in Johannesburg  with people travelling from across southern Africa to see his performance, which fans said was electrifying.\n\nAfrican musicians have won Grammys long before the Best African Music Performance Award was established.\n\nSouth Africas Mariam Makeba was the first to win one  Best Folk Recording  in 1966 for her collaboration with Harry Belafonte, called simply An Evening with Belafonte/Makeba.\n\nAfrican artists became more of a feature after 1992, with the introduction of the Best World Music Album.\n\nThat category has gone through various guises over the years  including being split into traditional and contemporary world music awards  and is now known as Best Global Music Album.\n\nMulti-award winners include Anglique Kidjo, Youssou NDour, Ali Farka Tour and Ladysmith Black Mambazo.\n\nBut African musicians have often broken out of that category for example, South Africas Black Coffee won Best Dance/Electronic Album in 2022.\n\nThe hope is that to counter the dominance of Afrobeats, more categories from Africa will be offered at the Grammys in years to come.\n\nThis would cover the ever-growing popularity of African music globally  and better reflect the huge number of music styles produced in Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/02053135/91ce3bf0-dfed-11ef-a319-fb4e7360c4ec.jpg.webp",
            "description": "<p>By BBC  AMERICAN musician Chris Brown, along with Nigerian artists, are up for Best African Music Performance this year. The Grammy Awards has a dedicated space for African music, but just a year after the category’s introduction it is already proving contentious. The Best African Music Performance made its debut with South Africa’s Tyla winning</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/who-should-count-as-african-at-the-grammy-awards/\">Who should count as African at the Grammy Awards?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "CBZ lays off 347 workers in restructuring exercise",
            "url": "https://www.newzimbabwe.com/cbz-lays-off-347-workers-in-restructuring-exercise/",
            "content": "By Staff Reporter\n\nFINANCIAL services behemoth, CBZ Holdings Limited has announced the redundancy of 347 employees affected by a restructuring exercise that started last year.\n\nDuring inception of the lay-off last year, 13 senior managers were sent packing from Zimbabwes biggest financial services group.\n\nComputerisation has enabled the financial services sector to operate effectively with a leaner workforce, thereby rendering some roles redundant.\n\nIn the latest development, CBZ group chief executive officer, Lawrence Nyazema said the bank was streamlining its workforce inorder to enhance operational efficiency, strengthen its market position and ensure long term sustainability.\n\nIn October 2024, we undertook a restructuring exercise across our group of companies to better align our strategic direction with the evolving business landscape.\n\nThis initiative has been a key component of our broader efforts to enhance operational efficiency, strengthen our market position and ensure long term sustainability, the CBZ boss said in a statement.\n\nBy adapting to the changing environment, we aim to position the organisation for continued growth and success in a competitive market.\n\nWe would like to confirm that we have now concluded the restructuring exercise as of 31 January 2025.\n\nAs part of the process, a total of 347 staff roles were impacted in the second phase of the restructuring out of a total staff complement of 1448.\n\nWe are deeply grateful for the contributions of all affected employees, and we are committed to supporting them during this transition and providing the necessary resources to assist in their next steps, said Nyazema.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/13084037/CBZ-Holdings.jpeg",
            "description": "<p>By Staff Reporter  FINANCIAL services behemoth, CBZ Holdings Limited has announced the redundancy of 347 employees affected by a restructuring exercise that started last year. During inception of the lay-off last year, 13 senior managers were sent packing from Zimbabwe’s biggest financial services group. Computerisation has enabled the financial services sector to operate effectively with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cbz-lays-off-347-workers-in-restructuring-exercise/\">CBZ lays off 347 workers in restructuring exercise </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "Swimming expedition ends in tragedy as boy (12) drowns in river",
            "url": "https://www.newzimbabwe.com/swimming-expedition-ends-in-tragedy-as-boy-12-drowns-in-river/",
            "content": "By Staff Reporter\n\nA SWIMMING expedition ended in tragedy Saturday after a 12-year-old Chinhoyi boy drowned in Hunyani River.\n\nZimbabwe Republic Police (ZRP) acting provincial spokesperson, Assistant Inspector Effort Chapoto confirmed the incident.\n\nThe deceased was identified as Wallace Kavhukatema, who was a pupil at Alpha College Primary School.\n\nI can confirm a sad incident in which a 12-year-old male juvenile Wallace Kavhukatema of 3487 Cherima, Chinhoyi drowned in Hunyani River.\n\nThe incident occurred on February 1, 2025, around 1230 hours when the now and his 11-year-old friend of the same address went for a swimming expedition at the river.\n\nAs they were swimming, Wallace failed to swim and drowned, said Chapoto.\n\nHis colleague rushed and informed Consider Chimulambi (23), who proceeded to the scene and retrieved the lifeless body.\n\nA report was made at Chemagamba Police, who attended the scene and conveyed the body to Chinhoyi Provincial Hospital mortuary for postmortem.\n\nPolice expressed worry over the increase in drowning cases around the province.\n\nThe incessant rains mean more measures should be taken to avoid such incidents lest we lose more lives.\n\nParents are urged to monitor their children wherever they are and ensure their safety, Chapoto said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/16044936/Drown.jpg",
            "description": "<p>By Staff Reporter  A SWIMMING expedition ended in tragedy Saturday after a 12-year-old Chinhoyi boy drowned in Hunyani River. Zimbabwe Republic Police (ZRP) acting provincial spokesperson, Assistant Inspector Effort Chapoto confirmed the incident. The deceased was identified as Wallace Kavhukatema, who was a pupil at Alpha College Primary School. “I can confirm a sad incident</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/swimming-expedition-ends-in-tragedy-as-boy-12-drowns-in-river/\">Swimming expedition ends in tragedy as boy (12) drowns in river </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "World Bank warns Zimbabwe on climate-induced economic losses",
            "url": "https://www.newzimbabwe.com/world-bank-warns-zimbabwe-on-climate-induced-economic-losses/",
            "content": "By Xinhua\n\nTHE World Bank (WB) has warned that climate change could erode up to 12 percent of Zimbabwes gross domestic product (GDP) annually if the country does not implement robust measures to tackle the phenomenon.\n\nIn its latest Zimbabwe economic update report launched Friday in Harare, Zimbabwes capital, the WB urged Zimbabwe to bolster resilience against climate-related shocks, focusing on agriculture as a critical pillar of the economy.\n\nStatistics from the Zimbabwean government show agriculture contributes from 11 percent to 14 percent of GDP and provides employment for some 70 percent of the population and about 60 percent of all raw materials for the industry.\n\nThe countrys heavy reliance on rain-fed systems and maize production, however, leaves it vulnerable to increasingly severe climate events, the WB noted.\n\nIn the 2023/2024 farming season, Zimbabwe experienced a severe El Nino-induced drought, resulting in a 60 percent decline in maize yield compared to the five-year average.\n\nThe significant reduction in rainfall, coupled with high temperatures, has led to widespread food insecurity and economic hardship.\n\nThe WB observed that the governments ambitious target to boost agricultural output to 12.5 billion U.S. dollars by 2025 is under threat due to climate-induced challenges.\n\nClimate shocks disrupt GDP, trade balances, and fiscal stability. The 2023/2024 El Nino-induced drought alone caused approximately 363 million U.S. dollars in damage losses, the WB said.\n\nThis cycle of drought and recovery undermines sustainable development and exacerbates poverty levels, making it imperative to enhance the resilience of the agricultural sector, said Easther Chigumira, World Bank senior agriculture specialist and co-author of the report.\n\nShe said to strengthen Zimbabwes resilience to weather shocks and climate change, a dual approach is essential, involving substantial investment in climate adaptation and the enhancement of anticipatory actions.\n\nThe report, titled Improving Resilience to Weather Shocks and Climate Change, highlighted the opportunity for Zimbabwe to strengthen resilience to climate shocks and further boost economic growth.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/27201329/World-bank.jpg",
            "description": "<p>By Xinhua THE World Bank (WB) has warned that climate change could erode up to 12 percent of Zimbabwe’s gross domestic product (GDP) annually if the country does not implement robust measures to tackle the phenomenon. In its latest Zimbabwe economic update report launched Friday in Harare, Zimbabwe’s capital, the WB urged Zimbabwe to bolster</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-bank-warns-zimbabwe-on-climate-induced-economic-losses/\">World Bank warns Zimbabwe on climate-induced economic losses </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "Davis Cup: Zimbabwe relegated to Group lll",
            "url": "https://www.newzimbabwe.com/davis-cup-zimbabwe-relegated-to-group-lll/",
            "content": "By Sport Reporter\n\nZIMBABWE tennis team failed to take advantage of playing on home after they recorded whitewash at the hands of Morocco in a Davis Cup Group II play-off held at Harare Sports Club Saturday.\n\nThe defeat saw Zimbabwe being relegated to Group III of the Africa Davis Cup competition.\n\nRunning for two days, Zimbabwe tennis team was taken for a ride by the visitors, who dominated with victories in successive days.\n\nZimbabwes streak of defeats started on Friday when Courtney Lock and Ethan Sibanda lost their singles Friday.\n\nCourtney lost by 6-2 6-4 to Taha Baadi while Sibanda went down 6-3 6-2 to Elliot Benchentrit.\n\nMorocco continued with its dominance over Zimbabwe Saturday after with their doubles team won 6-1 6-1 to claim an unassailable 3-0 lead.\n\nIn the doubles, the hosts were represented by Courtney Lock and Ronnan Mtisi, who came in for injured Ethan Sibanda.\n\nWith a task to save the face of Team Zimbabwe, Mtisi then played Karim Bennani in the reverse singles match in which he lost by 6-4 6-3, taking the tally to 4-0 win for the visitors.\n\nZimbabwes whitewash defeat by Morocco means they will be going back to compete in Group III this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/02034649/GinetYQXQAARpVl.jpeg",
            "description": "<p>By Sport Reporter  ZIMBABWE tennis team failed to take advantage of playing on home after they recorded whitewash at the hands of Morocco in a Davis Cup Group II play-off held at Harare Sports Club Saturday. The defeat saw Zimbabwe being relegated to Group III of the Africa Davis Cup competition. Running for two days,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/davis-cup-zimbabwe-relegated-to-group-lll/\">Davis Cup: Zimbabwe relegated to Group lll</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "Netball league honours 2024 season top performers",
            "url": "https://www.newzimbabwe.com/netball-league-honours-2024-season-top-performers/",
            "content": "By Sport Reporter\n\nRAINBOW Netball League (RANL) Saturday night honoured the 2024 top performers at a glittering awards ceremony held in the capital.\n\nRunning for the sixth time, the awards ceremony was preceded by an elective Annual General Meeting (AGM), which saw the election into power of a new executive chaired by Chipo Chirenje.\n\nThe new executives term will run for four years.\n\nSaturday night belonged Anifa Luya, who won the Player of The Year accolade.\n\nPlaying as a winger, the Flow Angels player had 13 Player of The Match accolades to her name during the 2024 season, hence without doubt she was voted the best player in the league.\n\nHonestly, l am happy, its something l never expected. I want to thank my teammates for their support because without them l could not have made it this far, said Luya, with joy written all over her face.\n\nThe league also recognised the brilliance of top goalscorer, Tafadzwa Mawango of Correctional Queens with a Golden Glove accolade.\n\nMawango scored a total of 1802 goals, the highest by any player in the league during the 2024 season.\n\nAfter helping Correctional Queens to lift the league title since 2019, team head coach Naftali Nyangulu was voted Coach of The Year, taking the gong away from Glow Petroleums Perpetua Siyachitema who won it the previous two seasons.\n\nRANL Awards 2024 Winners List\n\nMost Disciplined Team  Mtala Netball Club\n\nRookie of The Year  Ashley James\n\nGolden Hand  Tafadzwa Mawango\n\n(1802 goals) (Correction Queens)\n\nPeoples Choice Award  Pamela Muchena\n\nCoach of The Year  Naftali Nyanguru\n\nPlayer Of The Year  Anifa Luya\n\nPlayers Player of The Year  Amanda Ncube\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/02034335/EMOQoI9XUAUvV9l.jpeg",
            "description": "<p>By Sport Reporter  RAINBOW Netball League (RANL) Saturday night honoured the 2024 top performers at a glittering awards ceremony held in the capital. Running for the sixth time, the awards ceremony was preceded by an elective Annual General Meeting (AGM), which saw the election into power of a new executive chaired by Chipo Chirenje. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netball-league-honours-2024-season-top-performers/\">Netball league honours 2024 season top performers </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "SADC proposes joint summit with East African Community to solve DRC crisis",
            "url": "https://www.newzimbabwe.com/sadc-proposes-joint-summit-with-east-african-community-to-solve-drc-crisis/",
            "content": "By Thandiwe Garusa\n\nSOUTHERN African Development Community (SADC) leaders have suggested holding a meeting with the East African Community (EAC) to discuss the conflict in the Democratic Republic of Congo (DRC), where rebels have seized the eastern city of Goma.\n\nThe EAC is a regional bloc comprising eight member states: Burundi, Kenya, Rwanda, Somalia, South Sudan, Uganda, Tanzania and DRC. Its headquarters are located in Arusha, Tanzania.\n\nSADC leaders held an extraordinary summit in Harare Friday, following intensified attacks by the March 23 Movement (M23) rebels who killed 16 soldiers serving with SADC and United Nations (UN) peacekeeping forces last week and quickly expanded their presence in eastern DRC after capturing Goma.\n\nSummit called for an immediate joint Summit of SADC and East African Community (EAC) to deliberate on the way forward regarding the security situation in the DRC as proposed by the 24th Extraordinary Summit of Heads of State of the EAC held on 29th January 2025, SADC executive secretary Elias Magosi said.\n\nThe leaders also called for humanitarian support as the situation worsens leaving ordinary Congolese without basic essentials.\n\nSummit expressed concern that the recent attacks continued to worsen the security and humanitarian situation in the DRC and called for immediate restoration of essential utilities such as water, electricity, means of communication and supply lines for food and other essential commodities, he added.\n\nMeanwhile, over 400 000 people have been displaced due to the clashes since the beginning of the year.\n\nThe M23 group is the strongest of over 100 armed groups fighting for control in eastern DRC, an area rich in valuable minerals used in global technology.\n\nAccording to UN experts, M23 is supported by about 4,000 soldiers from Rwandamany more than in 2012 when they briefly took over Goma in a conflict fuelled by ethnic tensions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31174300/SADC-head-of-states-scaled.jpg",
            "description": "<p>By Thandiwe Garusa SOUTHERN African Development Community (SADC) leaders have suggested holding a meeting with the East African Community (EAC) to discuss the conflict in the Democratic Republic of Congo (DRC), where rebels have seized the eastern city of Goma. The EAC is a regional bloc comprising eight member states: Burundi, Kenya, Rwanda, Somalia, South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-proposes-joint-summit-with-east-african-community-to-solve-drc-crisis/\">SADC proposes joint summit with East African Community to solve DRC crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "Raw ivory lands suspected poacher in trouble",
            "url": "https://www.newzimbabwe.com/raw-ivory-lands-suspected-poacher-in-trouble/",
            "content": "By Staff Reporter\n\nA SUSPECTED poacher was nabbed in Bulawayo while in possession of raw ivory, which he wanted to sell.\n\nA 29-year-old man identified as Blessed Matibenga has since been arrested for illegal possession of the elephant tusk.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn January 31, 2025, police in Bulawayo acted on a tip-off and arrested Blessed Matibenga (29) for possession of raw, unmarked and unregistered ivory at Amakhosi Service Station along the Bulawayo-Victoria Falls road.\n\nPolice recovered one elephant tusk, which was concealed in a white sack from the suspect who was seeking potential buyers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/16125356/Ivory.jpg",
            "description": "<p>By Staff Reporter  A SUSPECTED poacher was nabbed in Bulawayo while in possession of raw ivory, which he wanted to sell. A 29-year-old man identified as Blessed Matibenga has since been arrested for illegal possession of the elephant tusk. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. On January 31, 2025,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/raw-ivory-lands-suspected-poacher-in-trouble/\">Raw ivory lands suspected poacher in trouble </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        },
        {
            "title": "Breaking free from generational curses: A call to prayer",
            "url": "https://www.newzimbabwe.com/breaking-free-from-generational-curses-a-call-to-prayer/",
            "content": "SUNDAY MORNING TABLET\n\nDear brothers and sisters in Christ,\n\nWe are living in perilous times, and the Bible warns us that in the last days, difficult times will come (2 Timothy 3:1).\n\nMany families are facing unimaginable pain and suffering due to generational spirits that Satan uses to wreak havoc.\n\nSome families are haunted by mysterious deaths, while others are plagued by infidelity, troubled marriages, and economic stagnation. Children are disrespecting their parents, and mental health issues are on the rise.\n\nFurthermore, some individuals have found themselves entangled in the web of Satans deceit, leading them to commit heinous crimes, including murder. The Bible warns us that Satan is a murderer from the beginning (John 8:44), and he seeks to destroy humanity through his evil schemes.\n\nBut we must not lose hope. The Bible reminds us that we are not fighting against flesh and blood, but against the spiritual forces of evil (Ephesians 6:12).\n\nWe must stay prayerful and vigilant, putting on the full armour of God to withstand the schemes of the devil (Ephesians 6:13-18).\n\nAs families, communities, and workmates, we must come together to pray and seek Gods protection and deliverance.\n\nLET US PRAY:\n\nDear Heavenly Father, we come to you in humility and repentance, acknowledging our helplessness against the forces of darkness. We ask that you cover us with your precious blood and protect us from the evil one.\n\nDeliver us from generational spirits that seek to destroy our families, communities, and workplaces.\n\nGive us wisdom and discernment to recognize the schemes of the devil and to stand firm against them. We pray for your mighty hand to move in our midst, bringing healing, restoration, and revival. In Jesus name, we pray.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/16093245/IMG-20240616-WA0009.jpg",
            "description": "<p>SUNDAY MORNING TABLET Dear brothers and sisters in Christ, We are living in perilous times, and the Bible warns us that in the last days, difficult times will come (2 Timothy 3:1). Many families are facing unimaginable pain and suffering due to generational spirits that Satan uses to wreak havoc. Some families are haunted by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/breaking-free-from-generational-curses-a-call-to-prayer/\">Breaking free from generational curses: A call to prayer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "02 Feb 2025"
        }
    ]
}