{
    "news": [
        {
            "title": "White South Africans going to US are cowards, Ramaphosa says",
            "url": "https://www.newzimbabwe.com/white-south-africans-going-to-us-are-cowards-ramaphosa-says/",
            "content": "BBC\n\nPresident Cyril Ramaphosa has called a group of 59 white South Africans who have moved to the US to resettle cowards, saying theyll be back soon.\n\nThe group of Afrikanersarrived in the US on Mondayafter President Donald Trump granted them refugee status, saying they faced racial discrimination.\n\nBut Ramaphosa said those who wanted to leave were not happy with efforts to address the inequities of the apartheid past, terming their relocation a sad moment for them.\n\nAs South Africans, we are resilient. We dont run away from our problems. We must stay here and solve our problems. When you run away you are a coward, and thats a real cowardly act, he added.\n\nTrump and his close ally, South Africa-born Elon Musk, have said there was a genocide of white farmers in South Africa a claim that has been widely discredited.\n\nThe US has also accused the South African government of seizing land from white farmers without paying compensation.\n\nMore than 30 years after the end of decades of rule by South Africas white minority, black farmers own only a small fraction of the countrys best farmland, with the majority still in white hands, leading to anger over the slow pace of change.\n\nIn January President Ramaphosa signed acontroversial law allowing the government to seize privately owned landwithout compensation in certain circumstances, when it is deemed equitable and in the public interest.\n\nBut the government says no land has yet been seized under the act.\n\nTrump has offered to resettle the white Afrikaners, descendants of mostly Dutch settlers, saying they were fleeing a terrible situation in South Africa.\n\nSpeaking on Monday at an agricultural exhibition in the Free State province, Ramaphosa said the Afrikaners were moving to the US because they were not favourably disposed to efforts aimed at addressing the countrys challenges.\n\nIf you look at all national groups in our country, black and white, theyve stayed in this country because its our country and we must not run away from our problems. We must stay here and solve our problems, Ramaphosa said.\n\nI can bet you that they will be back soon because there is no country like South Africa, he added.\n\nHis coward remark angered some social media users, who condemned it as an insult to aggrieved white South Africans.\n\nThe group of Afrikaners were welcomed by top US officials who claimed they had been living under a shadow of violence and terror in South Africa.\n\nWelcome to the land of the free, Deputy Secretary of State Chris Landau said as he received the South Africans who landed at Dulles airport near Washington DC on Monday.\n\nSome held young children and waved small American flags in the arrival area adorned with red, white and blue balloons on the walls.\n\nEarlier on Monday, President Ramaphosa told an Africa CEO forum in Abidjan, Ivory Coast, that he had recently told Trump during a phone call the US assessment of the situation was not true.\n\nWere the only country on the continent where the colonisers came to stay and we have never driven them out of our country, he added, dismissing claims Afrikaners were being persecuted.\n\nRamaphosa said dozens of white South Africans who arrived in the US on Monday dont fit the bill for refugees.\n\nAccording to theUS embassy in South Africa, to be considered eligible for the refugee resettlement scheme, someone must be:\n\nThe South African leader said he was due to meet his US counterpart soon regarding the issue.\n\nTrump has threatened to boycott the forthcoming G20 summit in South Africa unless the situation is taken care of.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/29012333/Ramaphosa.jpeg",
            "description": "<p>BBC President Cyril Ramaphosa has called a group of 59 white South Africans who have moved to the US to resettle “cowards”, saying “they’ll be back soon”. The group of Afrikaners arrived in the US on Monday after President Donald Trump granted them refugee status, saying they faced racial discrimination. But Ramaphosa said those who wanted to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/white-south-africans-going-to-us-are-cowards-ramaphosa-says/\">White South Africans going to US are cowards, Ramaphosa says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "March 31 protests: 89 granted bail",
            "url": "https://www.newzimbabwe.com/march-31-protests-89-granted-bail/",
            "content": "By Staff Reporter\n\nHigh Court judge Justice Esther Muremba has granted bail to 89 individuals accused of staging the March 31 protests against President Emmerson Mnangagwa.\n\nTheir freedom follows a successful appeal against the magistrates court decision to deny them bail.\n\nIn a brief court order, Muremba freed the suspects without giving reasons for her decision.\n\nThe appeal by all the appellants be and is hereby allowed.\n\nThe decision by the court a quo denying the appellants bail be and is hereby set aside and in its place is substituted by the following: Each accused shall deposit US$100 with the Clerk of Court at Harare Magistrates Court.\n\nUntil the matter is finalised, each accused shall reside at the address listed in the schedule submitted to the State and the court by the accuseds counsel during the appeal hearing, she said.\n\nMuremba said each accused, save for Joseph Gatsi, Kudzanai Murungweni, Memory Dehwe and Munyaradzi Kanonama, shall report once a fortnight, every alternate Friday, between 6 am and 6 pm at CID Law and Order until the matter is finalised.\n\nGatsi shall report to Chegutu Police Station, Murungweni to Sanyati Police Station, Dehwe to Rusape Police Station and Munyaradzi Kanonama to Glendale Police Station once a fortnight, every alternate Friday, between 6 am and 6 pm until the matter is finalised.\n\nThey were also ordered not to interfere with investigations.\n\nThe suspects were represented by their lawyers Kossam Ncube, Douglas Coltart, Jeremiah Bamu and Gift Mutisi of the Zimbabwe Lawyers for Human Rights.\n\nSome of them were granted bail earlier by the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133846/march-7.png",
            "description": "<p>By Staff Reporter High Court judge Justice Esther Muremba has granted bail to 89 individuals accused of staging the March 31 protests against President Emmerson Mnangagwa. Their freedom follows a successful appeal against the magistrates’ court decision to deny them bail. In a brief court order, Muremba freed the suspects without giving reasons for her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protests-89-granted-bail/\">March 31 protests: 89 granted bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Chevrons pumped up for the historical England Test match",
            "url": "https://www.newzimbabwe.com/chevrons-pumped-up-for-the-historical-england-test-match/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens cricket team coach Justin Summons says his team is super excited for the historical Test match against England, scheduled for May 22 to 25 at Trent Bridge cricket ground in Nottingham.\n\nThe Chevrons arrived in England on Sunday and conducted their first training in Leicester on Monday.\n\nBefore taking on England, Zimbabwe will fine-tune their preparations with a four-day warm-up match against a First-Class Counties XI from 15 to 18 May at the Uptonsteel County Ground in Leicester.\n\nCommenting ahead of the historical test, Summons said, I think our preparation is excellent.\n\nWe have got ten days ahead of us for good preparations.\n\nI think its just naturally energising the group, and they are super excited to get going.\n\nI mean, its why you play the game, you want to play against the best, and obviously England are one of the best Test teams in the world.\n\nAnd it really gives us a gauge as to where we are and what we need to do moving forward.\n\nZimbabwes tour to England comes after more than two decades since the two sides last played each other in crickets longest format.\n\nFollowing the Test against England, Zimbabwe will take on South Africa in a four-day encounter from 3 to 6 June at Arundel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/15045705/zim-cricket.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s cricket team coach Justin Summons says his team is “super excited” for the historical Test match against England, scheduled for May 22 to 25 at Trent Bridge cricket ground in Nottingham. The Chevrons arrived in England on Sunday and conducted their first training in Leicester on Monday. Before taking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-pumped-up-for-the-historical-england-test-match/\">Chevrons pumped up for the historical England Test match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Belarus’ Lukashenko says ready to rescue Zimbabwe’s hospitals",
            "url": "https://www.newzimbabwe.com/belarus-lukashenko-says-ready-to-rescue-zimbabwes-hospitals/",
            "content": "By Darlington Gatsi\n\nBELARUS President Aleksandr Lukashenko has pledged to revamp Zimbabwes ailing healthcare system, which has been deteriorating due to underfunding by the government.\n\nZimbabwes healthcare system has been under scrutiny, with major hospitals failing to cater to sick patients owing to a shortage of basic medical supplies.\n\nLukashenko, who is hosting President Emmerson Mnangagwa, said his country would assist Zimbabwe by supplying medicines and equipment.\n\nWe are ready to assist Zimbabwe in creating a comprehensive healthcare system, supplying medicines and specialised equipment to address the issue of healthcare accessibility for children, women, and the entire population of Zimbabwe.\n\nYou have studied our healthcare system. As far as I know, you liked it, and you are ready to build it in Zimbabwe with our help. We are willing to assist you in this, said Lukashenko, as quoted by Belarus state media.\n\nZimbabwes healthcare system is likely to collapse further following a halt in funding from the United States of America, which had assisted in providing medicines to vulnerable communities.\n\nDespite the government downplaying the current state of hospitals, health institutions are in dire straits, with patients required to bring their own essential supplies.\n\nWednesday, Finance Minister Mthuli Ncube signed a Memorandum of Understanding with Lukashenkos government to refurbish Parirenyatwa Hospital.\n\nHowever, critic Hopewell Chinono is sceptical about the agreement, raising concerns over its lack of transparency.\n\nThere is nothing he will bring from Belarus that you cannot find in South Africa, China, or Europe, where the goods are actually cheaper than in Belarus. The only difference is that it is harder to steal as much as he wants from those other countries!\n\nWe await the details of the prices of the medical goods that will be procuredwe will find out soon! said Chinono in a social media post.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/30041701/Parirenyatwa-Hospital.jpg",
            "description": "<p>By Darlington Gatsi BELARUS’ President Aleksandr Lukashenko has pledged to revamp Zimbabwe’s ailing healthcare system, which has been deteriorating due to underfunding by the government. Zimbabwe’s healthcare system has been under scrutiny, with major hospitals failing to cater to sick patients owing to a shortage of basic medical supplies. Lukashenko, who is hosting President Emmerson</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/belarus-lukashenko-says-ready-to-rescue-zimbabwes-hospitals/\">Belarus’ Lukashenko says ready to rescue Zimbabwe’s hospitals </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Ford Ranger murder: Police believe Ali Mugoya aka Arizona can help in ongoing investigation",
            "url": "https://www.newzimbabwe.com/ford-ranger-murder-police-believe-ali-mugoya-aka-arizona-can-help-in-ongoing-investigation/",
            "content": "IOL\n\nIt is more than a month afterthe shocking incident whereEmmanuel Mahambawas brutally murderedduring a fight linked to a love triangle in Joburg, and the South African Police Service (SAPS) is still investigating circumstances around the incident.\n\nThe disturbing murder was recorded in a video which went viral last month, where a grey Ford Ranger double-cab bakkie was used in the attack.\n\nIn the video, widely circulated on social media platforms, Mahamba, a Zimbabwean national, is lying flat on the road surface while the Ford Ranger bakkie runs over him repeatedly. He died at the scene.\n\nGauteng police said they are searching for the motorist implicated in the brutal attack, which happened after a heated dispute.\n\nThe murder incident happened on April 5, 2025, in Rivonia, Sandton.\n\nIn the latest development, the SAPS in Gauteng has told IOL that they are seeking to interview a man called Ali Mugoya in relation to the ongoing investigation.\n\nThe South African Police Service in Gauteng is seeking to interview Ali Mugoya, also known as Arizona, whom they believe can help in an ongoing probe around the murder of Emmanuel Mahamba in April 2025.Image: Facebook\n\nMasondo confirmed to IOL that Mugoya is the man seen in pictures shared widely on social media.\n\nWe believe Mr Ali Mugoya, also known as Arizona, can help with our investigation, Masondo told IOL.\n\nAnyone with information regarding Mugoyas whereabouts is requested to contact the investigating officer, Constable Ndou Murabeleni on076 416 5664 or 069 591 6447.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17045656/A-woman-only-identified-as-Ntombi-has-narrated-how-her-baby-daddy-a-Ugandan-national-who-is-on-the-run-brutally-murdered-her-former-boyfriend-Zimbabwean-national-Emmanuel-Mahamba.webp",
            "description": "<p>IOL It is more than a month after the shocking incident where Emmanuel Mahamba was brutally murdered during a fight linked to a love triangle in Joburg, and the South African Police Service (SAPS) is still investigating circumstances around the incident. The disturbing murder was recorded in a video which went viral last month, where a grey Ford</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ford-ranger-murder-police-believe-ali-mugoya-aka-arizona-can-help-in-ongoing-investigation/\">Ford Ranger murder: Police believe Ali Mugoya aka Arizona can help in ongoing investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Zimbabwe crowned champions in inaugural Online Continental Chess Championships for Prisoners",
            "url": "https://www.newzimbabwe.com/zimbabwe-crowned-champions-in-inaugural-online-continental-chess-championships-for-prisoners/",
            "content": "By Sports Reporter\n\nZimbabwe was on Tuesdaycrowned the overall winner of the inaugural Online Continental Chess Championships for Prisoners.\n\nThe competition, which is played virtually, saw prisoners from different nations across Africa competing.\n\nZimbabwe scooped gold in both male and female categories, proving to be a force to reckon with at the continental level.\n\nTwo of Zimbabwes top male players, Leo Matibe and Nicholas Damota, who came second in 2021 at the Intercontinental chess online competition for prisoners, were the biggest contributors to the teams success.\n\nTeam Zimbabwes male team was undefeated on the day as it posted 6 wins and one draw, securing 13 match points and 24.5 board points.\n\nZimbabwe chess players in prisons are now shifting the focus to the upcoming Behind The Wall Chess Tournament to be played in June.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/14184628/WhatsApp-Image-2025-05-14-at-09.08.46.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe was on Tuesday crowned the overall winner of the inaugural Online Continental Chess Championships for Prisoners. The competition, which is played virtually, saw prisoners from different nations across Africa competing. Zimbabwe scooped gold in both male and female categories, proving to be a force to reckon with at the continental level. Two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-crowned-champions-in-inaugural-online-continental-chess-championships-for-prisoners/\">Zimbabwe crowned champions in inaugural Online Continental Chess Championships for Prisoners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Ex-ZIPRA combatants camp in Chinhoyi, demanding seized properties shared among Zanu PF bigwigs – say VP Mohadi backing them",
            "url": "https://www.newzimbabwe.com/ex-zipra-combatants-camp-in-chinhoyi-demanding-seized-properties-shared-among-zanu-pf-bigwigs-say-vp-mohadi-backing-them/",
            "content": "By James Muonwa\n\nFORMER Zimbabwe Peoples Revolutionary Army (ZIPRA) combatants, widows and children of fallen fighters have so far spent three cold winter nights camped on a piece of land in Chinhoyi, Mashonaland West, in protest over the governments failure to facilitate the reclamation of their properties.\n\nThe land, on which a new suburb named Pearview has been established by a private land developer, reportedlybelongs to Nitram Holdings, a company established by former ZIPRA fighters after independence in 1980.\n\nNitram is a holding company formed by the ex-freedom fighters from their demobilisation payments. The veterans contributed $50 each from their demobilisation pay-outs after independence and purchased 52 properties, which include farms, hotels and buildings.\n\nIn a bid to reclaim the property allegedly seized by Zanu PF bigwigs and their cronies during the height of the Gukurahundi atrocities in the 1980s, the ex-ZIPRA combatants, led by Moffat Commander Karomo, have set up camp at a site opposite Mzari Extension, near Machamire area, in Chinhoyi.\n\nThe group numbering nearly 50, comprises former liberation struggle veterans, widows and children of those who died before and after independence.\n\nThe protestors say they will stay put for as long as it takes for whoever forcibly grabbed the property, and many others dotted across the town and countrywide, to hand over the properties to them.\n\nIn an interview with NewZimbabwe.com in Chinhoyi this Wednesday, Karomo claimed their actions, as staged recently at Glen Forest where another of Nitram properties lies, had the blessings of Vice President Kembo Mohadi.\n\nWe are here with the blessings of VP Mohadi, and we are here to take back what was illegally taken away from ZIPRA combatants, widows and their children who are wallowing in abject poverty, said Karomo.\n\nHe claimed President Emmerson Mnangagwa had tasked the veterans to identify their properties across the country so he could facilitate their repossession.\n\nIn Chinhoyi, Karomo claims that besides owning the vast land on which Pearview medium-density suburb was sited, Nitram is the legitimate owner of Old Chinhoyi Hotel and Caves Hotel, currently under the management of the Zimbabwe Parks and Wildlife Authority (ZimParks).\n\nKaromo said it has taken far too long since Mnangagwa promised to facilitate the return of Nitram Holdings stolen properties.\n\nMnangagwa must show his sincerity now. Since he instructed us to identify our properties, we are doing exactly that, thats why we are here in Chinhoyi today on one of our properties. We are not here to fight anyone, but those who took what doesnt belong to them are the ones out to fight us.\n\nIts been 45 years of being taken for a ride. We are not politicking nor engaging in factional politics. We are all Zanu PF, but we want to hear from President Mnangagwa what he has to say, now that we have identified our properties, Karomo told NewZimbabwe.com.\n\nA widow of a former ZIPRA combatant, Cecilia Moyo, said her late husband had confided in her of the vast wealth ex-guerilla fighters had accumulated courtesy of investment in Nitram Holdings.\n\nShe demanded the legacy of her children and grandchildren, which Nitram Holdings amassed under the stewardship of late Vice President Joshua Nkomo.\n\nWe are suffering from hypertension and other chronic diseases because of this matter. We are being victimised on the small plots where we were settled, yet we have all this wealth. We are suffering while some crooked people are enjoying our childrens inheritance, said Moyo.\n\nIn respect of the Chinhoyi land where the group is camped, Moyo claimed an Indian descendant only identified as Khan, now late, who was linked to late VP Nkomo, had knowledge of its ownership as well as the inventory of other Nitram Holdings properties in Mashonaland West.\n\nMoyo says the late Khans son has to answer for his father on how he transferred the disputed land to its current purported owner.\n\nFarai Madzvanya, a representative of children of war veterans, appealed to Mnangagwa to facilitate the expeditious return of the properties, an inheritance bequeathed to them by their now deceased fathers, who themselves never benefited from it.\n\nGovernment, which seized Nitram Holdings properties following the alleged discovery of arms caches at some farms in Midlands and Bulawayo provinces, is accused of dragging its feet in proceedings to return the properties to ex-ZIPRA fighters, widows and their children.\n\nTheNitram Holdings board is on record accusing some unnamed influential government officials of scuttling efforts to repossess their properties.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051629/zdf-mohadi-e1747279959354.jpeg",
            "description": "<p>By James Muonwa FORMER Zimbabwe People’s Revolutionary Army (ZIPRA) combatants, widows and children of fallen fighters have so far spent three cold winter nights camped on a piece of land in Chinhoyi, Mashonaland West, in protest over the government’s failure to facilitate the reclamation of their properties. The land, on which a new suburb named</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-zipra-combatants-camp-in-chinhoyi-demanding-seized-properties-shared-among-zanu-pf-bigwigs-say-vp-mohadi-backing-them/\">Ex-ZIPRA combatants camp in Chinhoyi, demanding seized properties shared among Zanu PF bigwigs – say VP Mohadi backing them</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Zim under-17 girls through to COSAFA Cup semi-finals",
            "url": "https://www.newzimbabwe.com/zim-under-17-girls-through-to-cosafa-cup-semi-finals/",
            "content": "By Sports Reporter\n\nZimbabwe under 17 girls team on Wednesday proceeded to the semi-finals of the COSAFA Cup tournament in Windhoek Namibia, after thrashing Lesotho 12-2.\n\nZimbabwe walked into the match as underdogs following a 3-0 defeat to Botswana on Sunday.\n\nA draw was enough for Lesotho to progress to the semi-finals, but a surprising defeat to Zimbabwe turned the tables.\n\nDee Mapuwa and Mya Munyanduki scored four goals each as Zimbabwe knocked out last years finalists, who were being favoured by odds before the match, as the young Mighty Warriors needed a clear five-goal win.\n\nZimbabwe will now face old rivals Zambia on Friday in the first semi-final, while Mozambique and Malawi clash later on the day in the second semi-final.\n\nMeanwhile, Zimbabwe under-20 girls hope of playing next years World Cup was thwarted by Rwanda on Wednesday after playing a nil-all draw at Kigali Pele stadium.\n\nThe result saw Rwanda qualify for the next round with a 2-1 aggregate from their win on Sunday in the first leg at the same venue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/15045831/cosafa.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe under 17 girls team on Wednesday proceeded to the semi-finals of the COSAFA Cup tournament in Windhoek Namibia, after thrashing Lesotho 12-2. Zimbabwe walked into the match as underdogs following a 3-0 defeat to Botswana on Sunday. A draw was enough for Lesotho to progress to the semi-finals, but a surprising</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-under-17-girls-through-to-cosafa-cup-semi-finals/\">Zim under-17 girls through to COSAFA Cup semi-finals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Zim Diaspora Property Showcase returns to UK in July with bigger vision",
            "url": "https://www.newzimbabwe.com/zim-diaspora-property-showcase-returns-to-uk-in-july-with-bigger-vision/",
            "content": "By Staff Reporter\n\nFollowing the highly-subscribedUS-Canadaedition in Dallas, Texas, the Zim Diaspora Property Showcase is set to return to the West Midlands on 1112 July 2025 at the prestigious Hilton Birmingham Metropole.\n\nNow in its second year, theZimbabwe Diaspora Property Showcase organised by real estate agency, Seeff Zimbabwe provides a platform for Zimbabweans living abroad to invest in real estate and connect with industry experts.\n\nPatience Patongamwoyo, Managing Director at Seeff Zimbabwe, said the upcoming UK event has been given impetus by the inaugural edition and the investment opportunities available in real estate.\n\nThe positive and productive engagement we had last year has allowed us to return with more investment opportunities and engagements, based on your feedback and suggestions.\n\nWe have realised that the diaspora has a real appetite to invest back home and rebuild, and we are more than happy to walk this journey with you  facilitating this by bringing the real estate industry together as a united effort to deliver the products and services that diasporans need, said Patongamwoyo.\n\nThe showcase attracts real estate companies, property developers, legal experts, construction companies in Zimbabwe to exhibit and help potential investors navigate the challenges of acquiring properties in the country.\n\nIndustry experts will also be part of a speakers panel, offering insights and investment strategies.\n\nReal estate is a sector that has been recording exponential growth, which has also opened avenues for fraudulent activities, making the Zimbabwe Diaspora Property Showcase a vital opportunity for diasporans.\n\nPatongamwoyo expressed eagerness to host this years edition, which has been crafted in line with the expectations of Zimbabwes diaspora community.\n\nAs the real estate industry continues to thrive in Zimbabwe, so too must our approach in creating a safe environment to invest in and deliver quality products. Our goal now is to grow the showcase by reaching out to diaspora hotspots and continuing to rebuild trust in real estate ventures back home.\n\nWe will achieve this by diversifying our exhibitor pool, offering more relevant speaker sessions, and creating richer one-on-one engagement opportunities. We are looking forward to returning this July with a platform designed specifically for the diaspora  and we expect this second edition to be a resounding success, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23073043/SEEFFUK-24143of205-scaled.jpg",
            "description": "<p>By Staff Reporter Following the highly-subscribed US-Canada edition in Dallas, Texas, the Zim Diaspora Property Showcase is set to return to the West Midlands on 11–12 July 2025 at the prestigious Hilton Birmingham Metropole. Now in its second year, the Zimbabwe Diaspora Property Showcase organised by real estate agency, Seeff Zimbabwe provides a platform for Zimbabweans living</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-diaspora-property-showcase-returns-to-uk-in-july-with-bigger-vision/\">Zim Diaspora Property Showcase returns to UK in July with bigger vision </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        },
        {
            "title": "Magistrate orders police to refund UZ lecturers fined over salary protests",
            "url": "https://www.newzimbabwe.com/magistrate-orders-police-to-refund-uz-lecturers-fined-over-salary-protests/",
            "content": "By Staff Reporter\n\nHarare magistrate Isheanesu Matova has ordered the Zimbabwe Republic Police (ZRP) to refund some admission of guilt fines, which had been paid by three University of Zimbabwe (UZ) lecturers, who were arrested last month and charged with disorderly conduct.\n\nThe arrest of the trio followed protests against poor salaries and working conditions.\n\nThe three are Professor Obvious Vengeyi, Boncase Mwakorera and Desmond Ndedzu, who are also leaders of the Association of University Teachers (AUT) at UZ.\n\nMatova has set aside the conviction of Professor Vengeyi, Mwakorera and Ndedzu and ordered ZRP to refund the admission of guilty fines each of the accused persons had paid to the law enforcement agency on 17 April 2025.\n\nIn his response to the letter written by Kabaya, Chibwe and Chinopfukutwa, Magistrate Matova ordered that a full trial should be conducted, where the trio will answer to charges of disorderly conduct in a public place as defined in section 41 of the Criminal Law (Codification and Reform) Act and asked the District Public Prosecutor to ensure that the UZ lecturers are prosecuted in the ordinary course, said Zimbabwe Lawyers for Human Rights in a statement.\n\nUpon arrest, ZRP officers accused Professor Vengeyi, Mwakorera and Ndedzu of breaching the countrys laws when they allegedly picketed together with other UZ lecturers on 16 April 2025, demanding improved working conditions and salary increments.\n\nProfessor Vengeyi, Mwakorera and Ndedzu, who were represented by Kelvin Kabaya, Emmanuel Lawrence Chibwe and Tinashe Chinopfukutwa of Zimbabwe Lawyers for Human Rights, resorted to paying admission of guilt fines amounting to US$15 each, to secure their release and to avert the rigours of pre-trial detention over lawful conduct during the Easter holidays.\n\nOn 22 April 2025, the trios lawyers challenged the confirmation of the admission of guilt fines paid, writing a letter to the Provincial Magistrate at Harare Magistrates Court as provided for in terms of section 356 of the Criminal Procedure and Evidence Act, on the grounds that the trade unionists actions, were protected by the Labour Act and that they only paid the fines to secure their liberty.\n\nIn their letter, the human rights lawyers argued that they were protecting the trios right to collective job action as provided for in section 65 of the Constitution.\n\nKabaya, Chibwe and Chinopfukutwa argued that they would be available to defend the trade unionists should any criminal charges be preferred against them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Staff Reporter Harare magistrate Isheanesu Matova has ordered the Zimbabwe Republic Police (ZRP) to refund some admission of guilt fines, which had been paid by three University of Zimbabwe (UZ) lecturers, who were arrested last month and charged with disorderly conduct. The arrest of the trio followed protests against poor salaries and working conditions.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magistrate-orders-police-to-refund-uz-lecturers-fined-over-salary-protests/\">Magistrate orders police to refund UZ lecturers fined over salary protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "15 May 2025"
        }
    ]
}