{
    "news": [
        {
            "title": "DA’s Zille implores Zim opposition to unite against Zanu-PF",
            "url": "https://www.newzimbabwe.com/das-zille-implores-zim-opposition-to-unite-against-zanu-pf/",
            "content": "By Alois Vinga\n\nHELEN Zille, the federal chairperson of the Democratic Alliance (DA) in South Africa, has called on opposition leaders in Zimbabwe to unite and take advantage of the internal divisions in the ruling Zanu-PF party.\n\nShe made the remarks following a meeting with Zimbabwe People First chairperson, Stephen Mazanza, last week.\n\nShe reiterated that the current political landscape in Zimbabwe is toxic and does not reflect what the people voted for in terms of economic and political stability.\n\nZimbabwes political giants have failed the masses, and sooner rather than later, Zimbabweans need to put enough or necessary pressure on the government, either in the form of petitions, meetings, or demonstrations, so that the Zanu PF government yields to the peoples demands.\n\nThe central bank (Zimbabwe Reserve Bank) has failed to come up with sound policies to stabilise the economy and there might be a need to abandon both the US dollar, and the ZiG currencies and adopt the South African Rand whilst the RBZ is put under administration by the South African Federal Reserve until it can stand on its own, she said.\n\nZille said opposition leaders, including Nelson Chamisa, Elisabeth Valerio and Tendai Biti, among others must immediately sit down and form a grand coalition that will challenge the ruling party and set itself in motion to take over the power vacuum in case the infighting within Zanu PF self-destructs as widely predicted.\n\nShe underscored that there has been widespread and loud noises of a unity government from within diehard Zanu PF ranks, which again is a signal of instability within, but immediately urged the opposition parties to be very cautious.\n\nOn his part, Mazanza said the meeting with Zille was pivotal and driven by the urgent need to address the catastrophic situation facing Zimbabweans.\n\nHe said the engagement was not merely a discussion but aplea for solidarity against the systematic destructionofthe nation which he described as suffocating under the weight of suppression of freedom of expression, the silencing of dissenting voices is a hallmark of this regime, and rampant corruption and nepotism.\n\nState resources are being plundered for personal gain, enriching a select few while the masses suffer. Police brutality and political purges targeting opposition members and concerned citizens are rampant. Vital institutions are being hijacked by individuals to serve their interests, and undermining the foundations of our society, he said.\n\nThe opposition leader accused the governments policies of creating a stark divide, leaving the majority impoverished and the economy on a freefall, which has escalated citizens hardship.\n\nWe also discussed the internal instability in Zanu PF and its potential to further destabilise the country. We are preparing for all possible outcomes, and we are determined to ensure that any power vacuum is filled by a government that represents the will of the people, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/05055622/HELEN-ZILLE.jpeg",
            "description": "<p>By Alois Vinga HELEN Zille, the federal chairperson of the Democratic Alliance (DA) in South Africa, has called on opposition leaders in Zimbabwe to unite and take advantage of the internal divisions in the ruling Zanu-PF party. She made the remarks following a meeting with Zimbabwe People First chairperson, Stephen Mazanza, last week. She reiterated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/das-zille-implores-zim-opposition-to-unite-against-zanu-pf/\">DA’s Zille implores Zim opposition to unite against Zanu-PF</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Billionaire Masiyiwa says idea to build Africa’s 1st AI factory inspired by Dangote, Obasanjo",
            "url": "https://www.newzimbabwe.com/billionaire-masiyiwa-says-idea-to-build-africas-1st-ai-factory-inspired-by-dangote-obasanjo/",
            "content": "Nairametrics\n\nZimbabwean billionaire and founder of Cassava Technologies, Strive Masiyiwa, who just announced a partnership with Nvidia to launch Project Mufungi, Africas first AI factory, has said the idea was inspired by Nigerias richest man, Aliko Dangote, and former President Olusegun Obasanjo.\n\nMasiyiwa shared this in a lengthy Facebook post on Monday, detailing how a conversation with Dangote and Obasanjo seven years ago in Singapore pushed him to take on ambitious projects that would transform Africas technological landscape.\n\nI will never forget the day seven years ago when I had coffee with my friend Aliko Dangote and our Baba [as we call former President Obasanjo] at an event in Singapore,Masiyiwa recalled. Baba challenged us both that day to do bigger things for Africa stuff you guys can now do!\n\nThe turning point came when he attended a panel discussion where multiple speakers claimed Africa would remain a mere consumer of AI because the cost of computing power was beyond the continents reach.\n\nSitting there, I thought to myself, If Aliko can raise $19 billion, surely I should be able to raise a few billion dollars to get AI Compute started in Africa. After all, we already have most of the key components right here in our own companies!\n\nMasiyiwa revealed that when he later mentioned his idea to Dangote and their mutual friend, Prof Benedict Oramah, the President of Afreximbank, they both encouraged him to pursue it.\n\nWhen I mentioned this to Aliko the next time we met, this time together with our friend Prof Oramah of Afreximbank, they were egging me on to do it.\n\nMy brother, you got this. Its your field now. If you cant do it, then who? Aliko joked before adding: Dont forget Nigeria!\n\nProf [as we call Prof Oramah] as usual just said, We are always there for you as Afreximbank, even though you will also have to go global for such funding. Thats how he has spoken to me for over 30 years now,Masiyiwa said.\n\nNow, in partnership with Nvidia, Masiyiwas Cassava Technologies is launching Project Mufungi, an initiative that will establish high-performance AI computing infrastructure across Africa.\n\nOur AI factory provides the infrastructure for this innovation to scale, empowering African businesses, startups, and researchers with access to cutting-edge AI infrastructure to turn their bold ideas into real-world breakthroughs. And now they dont have to look beyond Africa to get it,Masiyiwa said.\n\nThe move also comes amid increasing interest in Africas digital infrastructure from global technology firms.\n\nWith backing from partners like Nvidia and Afreximbank, the project is expected to catalyze further investments in Africas digital economy, helping to close the AI divide between the continent and the rest of the world.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/03054027/Strive-Masiyiwa.jpg",
            "description": "<p>Nairametrics Zimbabwean billionaire and founder of Cassava Technologies, Strive Masiyiwa, who just announced a partnership with Nvidia to launch Project Mufungi, Africa’s first AI factory, has said the idea was inspired by Nigeria’s richest man, Aliko Dangote, and former President Olusegun Obasanjo. Masiyiwa shared this in a lengthy Facebook post on Monday, detailing how a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/billionaire-masiyiwa-says-idea-to-build-africas-1st-ai-factory-inspired-by-dangote-obasanjo/\">Billionaire Masiyiwa says idea to build Africa’s 1st AI factory inspired by Dangote, Obasanjo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Police re-arrest inmate who escaped from custody in court",
            "url": "https://www.newzimbabwe.com/police-re-arrest-inmate-who-escaped-from-custody-in-court/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Republic has re-arrested an inmate who, with the assistance of a prison guard, escaped from the court premises last Friday.\n\nLuke Zinyengere (29) was arrested while trying to skip the country.\n\nZinyengere was helped to escape by a Zimbabwe Prisons and Correctional Services officer, Donald Madzinga, whom he allegedly paid US$500.\n\nMadzinga has since appeared in court charged with criminal abuse of office.\n\nIn a statement, Police Spokesperson Commissioner Paul Nyathi said Zinyengere is facing three criminal charges.\n\nThe Zimbabwe Republic Police confirms the arrest of Luke Zinyengere (29) in connection with a case of escaping from lawful custody, armed robbery and unlawful possession of a firearm.\n\nThe police also arrested the suspects relatives, Tatenda Zinyengere (19), Kelvin Chinganga (31), Siphelile Zinyengere and Obey Rwaendepi (28) for assisting the suspect to escape from the court premises and after the escape, harbouring Luke Zinyengere, Nyathi said.\n\nAccording to the police, preliminary investigations have revealed that Luke Zinyengeres young brother, Tatenda Zinyengere, allegedly provided the revolver pistol which was used to escape from custody and rob Tinashe Chiyamuro of his Mazda Demio vehicle.\n\nAfter the robbery, Luke Zinyengere allegedly abandoned the vehicle along Kaguvi Street in Harare and then joined the other suspects, who attempted to facilitate his escape to a neighbouring country.\n\nNyathi warned the public against harbouring criminals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Republic has re-arrested an inmate who, with the assistance of a prison guard, escaped from the court premises last Friday. Luke Zinyengere (29) was arrested while trying to skip the country. Zinyengere was helped to escape by a Zimbabwe Prisons and Correctional Services officer, Donald Madzinga, whom he allegedly paid</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-re-arrest-inmate-who-escaped-from-custody-in-court/\">Police re-arrest inmate who escaped from custody in court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Teachers condemn mandatory civic days to fund Independence Day Celebrations",
            "url": "https://www.newzimbabwe.com/teachers-condemn-mandatory-civic-days-to-fund-independence-day-celebrations/",
            "content": "By Staff Reporter\n\nThe Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has reacted with fury to a government directive, ordering all schools in Gweru district to hold civic days for the purpose of raising funds for Independence Day Celebrations.\n\nZimbabwes 45th Independence celebrations are scheduled to run under the theme Zim@45: Devolve and Develop Together Towards Vision 2030 in Gokwe Nembudziya.\n\nA letter seen by NewZimbabwe.com dated 24 March 2025 addressed to the Midlands Provincial Education Director, mandates all schools in the province to conduct civic days, requiring each learner to contribute a maximum of US$1.\n\nThe letter states that the proceeds from these civic days will be channelled towards covering unforeseen costs for the 45th Independence Day Celebration.\n\nThe district is requesting all schools to conduct a once-off civics in order to purchase regalia, food and fuel including unforeseen costs for the Nembudziya Independence Celebrations to be conducted on 18 April 2025.The heads are expected to deposit the civics money into the BSPZ account. The civic money not exceed US$1 per child, reads part of the letter.\n\nHowever, ARTUZ has vehemently criticised the Ministry of Educations use of civic days as a fundraising strategy, arguing that these celebrations have been reduced to partisan Zanu-PF events.\n\nThey maintain that, whilst many value the sacrifices made in liberating Zimbabwe, they can no longer associate themselves with these events. To ARTUZ, the situation smacks of political opportunism.\n\nARTUZ further suggested that the independence celebrations would provide fertile ground for Mnangagwas supporters, the 2030ists, to further their agenda of keeping him in power beyond his constitutional term limit, which is expected to end in 2028.\n\nIt is unethical and illegal for the government to force schools to fund the partisan junket dedicated to the violation of the constitution, ARTUZ wrote on X.\n\nZimbabwes schools are severely underfunded because of governments neglect. The parents are bearing the burden of funding education in violation of section 75 of the Constitution which mandates the government to provide state funded basic education.\n\nIt is cruel for Mnangagwas government to extract from the incapacitated schools. We urge school heads to refuse to participate in this illegality. We stand ready to defend our schools from abuse.\n\nFormer Citizens Coalition for Change (CCC) party spokesperson commented that Zanu-PF has reduced key events into internal partisan programmes, making it difficult for other citizens to participate.\n\nIn Zimbabwe, the state and the party are conflated. National events are essentially ZANU-PF rallies, replete with party slogans, regalia, and exhausted nationalist rhetoric, he wrote.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/19035112/Independence-Flame.png",
            "description": "<p>By Staff Reporter The Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has reacted with fury to a government directive, ordering all schools in Gweru district to hold civic days for the purpose of raising funds for Independence Day Celebrations. Zimbabwe’s 45th Independence celebrations are scheduled to run under the theme ‘Zim@45: Devolve and Develop Together</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teachers-condemn-mandatory-civic-days-to-fund-independence-day-celebrations/\">Teachers condemn mandatory civic days to fund Independence Day Celebrations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "World Athletics approves swab test to determine female gender",
            "url": "https://www.newzimbabwe.com/world-athletics-approves-swab-test-to-determine-female-gender/",
            "content": "AFP\n\nWorld Athletics said on Tuesday it had approved the introduction of a cheek swab test to determine if anathlete is biologically female.\n\nSebastian Coe, the president of the international track and field federation, said the test, whose introduction was given the green light by the World Athletics Council, was a really important way of protecting the female category.\n\nIts important to do it because it maintains everything that weve been talking about, and particularly recently, about not just talking about the integrity of female womens sport, but actually guaranteeing it, Coe said in a press conference after the Council met over two days in Nanjing, China following the World Indoor Championships.\n\nWe feel this is a really important way of providing confidence and maintaining that absolute focus on the integrity of competition, he added.\n\nWorld Athletics has not fixed a date for the introduction of the test, but it is expected to be in place for the outdoor World Championships in Tokyo this September.\n\nCoe said the decision to introduce the swab testing was taken after a wide consultation on the proposal.\n\nOverwhelmingly, the view has come back that this is absolutely the way to go, Coe said, adding that the swab test was not considered to be overly intrusive.\n\nHe said he was confident that the policy could stand up to legal challenge, but added: You accept the fact that that is the world we live in.\n\nI would never have set off down this path to protect the female category in sport if Id been anything other than prepared to take the challenge head on.\n\nWeve been to the Court of Arbitration on our DSD (difference of sex development) regulations.\n\nThey have been upheld, and they have again been upheld after appeal. So we will doggedly protect the female category, and well do whatever is necessary to do it. And were not just talking about it.\n\nWorld Athletics is looking at cheek swab tests but is also considering using blood spot tests.\n\nThe test for the SRY gene, which is almost always on the male Y chromosome and is used as a highly accurate proxy for biological sex, would need to be taken just once by an athlete during their career, the federation says.\n\nCoe warned during his campaign to be elected International Olympic Committee president that we run the risk of losing womens sport unless the female category was protected.\n\nThe Briton finished third in the race last week which was won byKirsty Coventry, the former Olympic swimmer from Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/26053416/World-Athletics-has-not-fixed-a-date-for-the-introduction-of-the-test-but-it-is-expected-to-be-in-place-for-the-outdoor-World-Championships-in-Tokyo-this-September.webp",
            "description": "<p>AFP World Athletics said on Tuesday it had approved the introduction of a cheek swab test to determine if an athlete is biologically female. Sebastian Coe, the president of the international track and field federation, said the test, whose introduction was given the green light by the World Athletics Council, was a “really important” way of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-athletics-approves-swab-test-to-determine-female-gender/\">World Athletics approves swab test to determine female gender</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Harry leaves Lesotho-based charity he co-founded following row between trustees and board chair",
            "url": "https://www.newzimbabwe.com/harry-leaves-lesotho-based-charity-he-co-founded-following-row-between-trustees-and-board-chair/",
            "content": "BBC\n\nThe Duke of Sussex has announced his resignation as a patron of Sentebale, a Lesotho-based British charity which he co-founded, after a row between the trustees and the chair of its board.\n\nPrince Harry said he had stepped down alongside co-founder and fellow patron Prince Seeiso of Lesotho and Sentebales board of trustees after Dr Sophie Chandaukas relationship with the trustees broke down beyond repair and she sued the charity after she was asked to step down.\n\nDr Chandauka has reported the charity to the UK Charity Commission. She said she had blown the whistle about abuse of power and harassment, and said her work was in pursuit of the integrity of the organisation.\n\nThe Charity Commission says it is aware of concerns about the governance of Sentebale and is looking into them.\n\nSentebale was founded by Prince Harry and Prince Seeiso in 2006 with a focus on addressing the effects of HIV and Aids on young people in the southern African nations of Lesotho and Botswana.\n\nIn a joint statement, the princes said: With heavy hearts, we have resigned from our roles as Patrons of the organisation until further notice, in support of and solidarity with the board of trustees who have had to do the same.\n\nIt is devastating that the relationship between the charitys trustees and the chair of the board broke down beyond repair, creating an untenable situation.\n\nThese trustees acted in the best interest of the charity in asking the chair to step down, while keeping the wellbeing of staff in mind. In turn, she sued the charity to remain in this voluntary position, further underscoring the broken relationship.\n\nThey would, they added, be sharing all of our concerns with the Charity Commission as to how this came about.\n\nFormer trustees Timothy Boucher, Mark Dyer, Audrey Kgosidintsi, Dr Kelello Lerotholi and Damian West described their decision as nothing short of devastating for all of them.\n\nThey said they had lost trust and confidence in the chairwoman but her legal action meant they had no other option than to resign in the best interest of the charity, as it could not take on the legal and financial burden.\n\nThis was not a choice willingly made, but rather something we felt forced into in order to look after the charity, they said.\n\nDr Chandauka said her work at Sentebale had been guided by the principles of fairness and equitable treatment for all, regardless of social status or financial means.\n\nThere are people in this world who behave as though they are above the law and mistreat people, and then play the victim card and use the very press they disdain to harm people who have the courage to challenge their conduct, she added.\n\nThis, she said, was the story of a woman who dared to blow the whistle about issues of poor governance, weak executive management, abuse of power, bullying, harassment, misogyny, misogynoir  and the coverup that ensued.\n\nThe charity itself said it had not received resignations from either Royal Patron but it did confirm a restructuring of its board on Tuesday to bring in more experts with the capabilities and networks to accelerate Sentebales transformation agenda.\n\nIt said that it had announced plans last April to move from being a development organisation addressing the impact of HIV and Aids on children and young people in Lesotho and Botswana to one that is addressing issues of youth health, wealth and climate resilience in Southern Africa.\n\nThe recalibration of the Board is, therefore, part of Sentebales ambitious transformation agenda, the charity added.\n\nThe Charity Commission said it was aware of concerns over Sentebales governance, adding: We are assessing the issues to determine the appropriate regulatory steps.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/26051435/PA-Media-Prince-Harry-meeting-children-at-a-Lesotho-childrens-home-in-2006.webp",
            "description": "<p>BBC The Duke of Sussex has announced his resignation as a patron of Sentebale, a Lesotho-based British charity which he co-founded, after a row between the trustees and the chair of its board. Prince Harry said he had stepped down alongside co-founder and fellow patron Prince Seeiso of Lesotho and Sentebale’s board of trustees after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harry-leaves-lesotho-based-charity-he-co-founded-following-row-between-trustees-and-board-chair/\">Harry leaves Lesotho-based charity he co-founded following row between trustees and board chair</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Mnangagwa urges IOC president-elect Kirsty Coventry to champion young African athletes’ cause",
            "url": "https://www.newzimbabwe.com/mnangagwa-urges-ioc-president-elect-kirsty-coventry-to-champion-young-african-athletes-cause/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has urged newly elected International Olympic Committee (IOC) leader Kirsty Coventry to use her platform to advocate for young athletes from Africa.\n\nLast week, Coventry became the youngest IOC president in history, the first female and African to do so. She will be moving to Lausanne, Switzerland for her new role which she will officially assume on June 24 2025.\n\nSpeaking at Coventrys Banquet dinner held at State House Tuesday, Mnangagwa said, As you go on to assume your new role at the helm of the IOC, I exhort you, Honourable Coventry, to draw from those insights to advocate and advance the cause of the young athletes from the developing world and Africa, in particular.\n\nAfter all, sport has the ability to empower and unite us under a common vision and goal.\n\nSport also has the ability to help us achieve the Africa we all want.\n\nMnangagwa also expressed pride in Coventrys achievements.\n\nThis election of the first ever woman and a candidate from Africa is indeed, a testament that Africa is ready to lead, as you amply declared after your triumph.\n\nThe victory of Honourable Coventry is, thus, not only a source of inspiration and pride for Zimbabwe, but for the SADC region and Africa as a whole.\n\nYou are not only our national treasure, but a treasure to all young athletes across Africa and the developing world, he added.\n\nCoventry has been relieved of her duties as Sports Minister and will be replaced by General Anselem Sanyatwe has been retired as army commander.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/26054028/WhatsApp-Image-2025-03-25-at-18.45.13.jpeg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has urged newly elected International Olympic Committee (IOC) leader Kirsty Coventry to use her platform to advocate for young athletes from Africa. Last week, Coventry became the youngest IOC president in history, the first female and African to do so. She will be moving to  Lausanne, Switzerland for her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-urges-ioc-president-elect-kirsty-coventry-to-champion-young-african-athletes-cause/\">Mnangagwa urges IOC president-elect Kirsty Coventry to champion young African athletes’ cause</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "ZIMURA to carry out consultations over controversial US$150 cover band fee",
            "url": "https://www.newzimbabwe.com/zimura-to-carry-out-consultations-over-controversial-us150-cover-band-fee/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Music Rights Association (ZIMURA) has temporarily set aside the newly introduced tariff on cover bands.\n\nThis follows an outcry from musicians that the US$150 tariffs on bands for cover songs are unfair.\n\nThey also argued the vagueness of the regulations and how the artists with intellectual property would benefit from the tariffs.\n\nThe National Arts Council of Zimbabwe in a statement, said ZIMURA should revisit the regulations and consult the affected parties.\n\nThe National Arts Council is committed to fostering a vibrant and inclusive arts sector. This meeting marks a significant step forward in addressing the concerns of cover bands while upholding the rights of copyright holders.\n\nThe National Music Strategy which was launched in 2022 spells out the need for a well-structured copyright system ensures that royalties are distributed fairly to all contributors, including songwriters, performers, producers, and publishers.\n\nWe believe that this collaborative approach will benefit all stakeholders and contribute to the growth of Zimbabwes creative economy in line with the national vision 2030, read the statement.\n\nThe regulations come at a time ZIMURA is underfire for failing to disburse yearly royalties. Some artists have bemoaned meagre royalties from ZIMURA.\n\nThe new regulations have seen establishments such as Gava Restaurant, which hosts cover bands, halting performances in recent days.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/26050739/intotal-band.jpg",
            "description": "<p>By Staff Reporter THE Zimbabwe Music Rights Association (ZIMURA) has temporarily set aside the newly introduced tariff on cover bands. This follows an outcry from musicians that the US$150 tariffs on bands for cover songs are unfair. They also argued the vagueness of the regulations and how the artists with intellectual property would benefit from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimura-to-carry-out-consultations-over-controversial-us150-cover-band-fee/\">ZIMURA to carry out consultations over controversial US$150 cover band fee </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Singer-songwriter Rachel Chinouriri is leading the Indie Pop Renaissance",
            "url": "https://www.newzimbabwe.com/singer-songwriter-rachel-chinouriri-is-leading-the-indie-pop-renaissance/",
            "content": "VogueUK\n\nTheres a mighty bouquet of blush-pink roses almost wilting in Rachel Chinouriris house right now. Theyre kind of going off, admits the 26-year-old musician, one of Britains most exciting new stars. She wont be getting rid of them anytime soon. The occasion? A celebration of Chinouriris twoBrit nominations. The sender? Adele.\n\nThat was mental and incredibly unexpected, Chinouriri recalls of the surprise delivery from her fellow Brit School alumni. Sipping a dirty chai latte in a coffee spot in Hackney Wick, the singer-songwriter  who recently created a tour journal of random items given to her by fans at shows  is notably sentimental about these things. I need to press the good flowers that are left because I want to put them in a frame\n\nSomething tells me this wont be the last extravagant bouquet she will receive from music legends. At 26, Chinouriri has achieved the modern indie pop princess fantasy: stratospheric virality with endlessly catchy tracks such as the raw So My Darling, a tribute to a dear friend, and pop anthem All I Ever Asked. Now a die-hard audience lingers on her every word and fans suchFlorence Pugh(or my Flossie Pop! as Chinouriri calls her) slide into the singers DMs to profess their love for her music (the singer and actor ended up with a new friendship, and Pugh a cameo in Chinouriris music video for Never Need Me). In 2024 her gut-punch debut album,What a Devastating Turn of Events, landed in the top 20 and she closed out a run of sold-out shows. Now she is in arenas supporting Sabrina Carpenter on the European leg of herShort n Sweettour, to say nothing of releasing a new EP next month.\n\nIm really happy with how the journey has gone, says the south London-born star, bathed in the glow of mid-morning winter sun. I think, when youre 18, you are obviously like, Oh, my God, I want to blow up. You see people your age or younger getting to those heights  which is amazing  but minus those heights, what do you want your legacy to be? Because I want to be doing this forever. Thats not to say its been easy. During her rise, Chinouriri found herself pigeonholed as an urban artist and being introduced as the next R&B soulstress, despite her music being nothing of the sort. In January 2022, she published an open letter in a bid to stop being mislabelled. Has she noticed an industry change since then? I think theres been a realisation that Black girls can be marketed [outside of assumed Black genres], but until I see more than just me, Cat [Burns] and Olivia [Dean], then things arent changing. Its a shame I had to be so loud about it.\n\nGrowing up in Croydon, Chinouriri discovered music in earnest at secondary school, inspired by her musically inclined Zimbabwean South African family. Visits to her aunties house always ended with prayer and song. Theyd start singing and everyone would harmonise. My brain almost felt it spiritually  it would give me tingles. With the encouragement of a well-meaning teacher, eventually she would end up at The Brit School studying musical theatre. I was like, If I dont get in, I wont ever touch music again, she recalls, matter-of-factly. To think that I wouldnt have even tried simply because I didnt get into the school Its quite sad.\n\nFlash forward to today and Chinouriri is already plotting out album number two, while adding the finishing touches to her forthcoming EP,Little House, out on 4 April. Shes been experiencing something of a songwriting evolution over the past year. I started writing music because of trauma  it was a gateway to help me get out of very difficult things when I was younger, Chinouriri says, referring in part to the aggressive bullying she was a victim of at school. Id gotten quite accustomed to: Im having a terrible time, so I can write a great song quite easily. But things change. Ive gone to therapy Im in a healthy relationship But by doing that, I ended up unable to write for nearly a year, she says. Recently she found herself wondering: How do I write without self-sabotaging mentally? Then she realised she could write about joy instead. Im in love with someone and its healthy, she says, smiling at her new inspiration. Love makes you do the corniest things.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/25181913/AS-VOGUK-180325-RACHELC.webp",
            "description": "<p>VogueUK There’s a mighty bouquet of blush-pink roses almost wilting in Rachel Chinouriri’s house right now. “They’re kind of going off,” admits the 26-year-old musician, one of Britain’s most exciting new stars. She won’t be getting rid of them anytime soon. The occasion? A celebration of Chinouriri’s two Brit nominations. The sender? Adele. “That was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/singer-songwriter-rachel-chinouriri-is-leading-the-indie-pop-renaissance/\">Singer-songwriter Rachel Chinouriri is leading the Indie Pop Renaissance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Namibia to require visas for U. S. citizens and tourists from over 30 countries from beginning of April",
            "url": "https://www.newzimbabwe.com/namibia-to-require-visas-for-u-s-citizens-and-tourists-from-over-30-countries-from-beginning-of-april/",
            "content": "In a significant policy shift reflective of the evolving dynamics of international travel, the Namibian government has announced that as from April 1, 2025, U.S. citizens and tourists from more than 30 other countries will be required to obtain a visa prior to entering the country.\n\nThe announcement has been underscored by a notice from the U.S. Embassy in Namibia, which has urged American travellers to begin preparations for the new visa requirements.\n\nVisitors arriving in Windhoek, Walvis Bay, or entering at high volume border crossing points (e.g., Katima Mulilo, Ngoma) will also have the option of purchasing a tourist visa upon arrival at the respective airport or border crossing point. Namibias visa on arrival system is new and implementation details are subject to change, said the U.S. Embassy.\n\nVisa requirements will now apply to citizens from all non-reciprocating countries, which are those that currently impose visa restrictions on holders of Namibian passports.\n\nThe changes come days after the countryinauguratedNetumbo Nandi-Ndaitwah as Namibias first female president.\n\nPopularly known by her initials NNN, the 72-year-old secured 58 percent of the vote in the chaotic November elections, which were extended several times after logistical failures led to major delays.\n\nOn her election as Namibias first woman president, she told SABC: Of course, its a good thing that we are breaking the ceiling, we are breaking the walls.\n\nNNN, a conservative daughter of an Anglican pastor, has taken a strict stance against abortion, which is banned in Namibia except in exceptional circumstances. Gay marriage is also illegal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/26051002/Netumbo-Nandi-Ndaitwah-made-history-as-Namibia-s-first-female-president.webp",
            "description": "<p>IOL In a significant policy shift reflective of the evolving dynamics of international travel, the Namibian government has announced that as from April 1, 2025, U.S. citizens and tourists from more than 30 other countries will be required to obtain a visa prior to entering the country. The announcement has been underscored by a notice</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namibia-to-require-visas-for-u-s-citizens-and-tourists-from-over-30-countries-from-beginning-of-april/\">Namibia to require visas for U. S. citizens and tourists from over 30 countries from beginning of April</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "26 Mar 2025"
        }
    ]
}