{
    "news": [
        {
            "title": "Robert Mugabe Jnr fined US$300 following conviction for illegal drug possession",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-fined-us300-following-conviction-for-illegal-drug-possession/",
            "content": "By Staff Reporter\n\nLate former President Robert Mugabes son, Robert Tinotenda Mugabe Junior (33), has been fined US$300 after being found guilty of unlawful possession of drugs.\n\nMugabe appeared before Harare magistrate Lisa Mutendereki, who ordered him to pay the fine or serve four months in prison if he defaults.\n\nHe was convicted on Thursday after pleading for leniency, telling the court he is a single father of two children.\n\nMugabe was arrested in October after police allegedly found two sachets of dagga, a pack of Rizla, and a white dagga crusher in his sling bag during a traffic blitz in Harare.\n\nAccording to court papers, he was stopped after driving against a one-way street along Second Street Extension in a silver Honda Fit.\n\nHe was represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/13161100/robert-mugabe-jnr.jpeg",
            "description": "<p>By Staff Reporter Late former President Robert Mugabe’s son, Robert Tinotenda Mugabe Junior (33), has been fined US$300 after being found guilty of unlawful possession of drugs. Mugabe appeared before Harare magistrate Lisa Mutendereki, who ordered him to pay the fine or serve four months in prison if he defaults. He was convicted on Thursday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-fined-us300-following-conviction-for-illegal-drug-possession/\">Robert Mugabe Jnr fined US$300 following conviction for illegal drug possession</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "13 Nov 2025"
        },
        {
            "title": "Mugabe Jnr convicted for drug possession – pleads for leniency, says he is a single father of two",
            "url": "https://www.newzimbabwe.com/mugabe-jnr-convicted-for-drug-possession-pleads-for-leniency-says-he-is-a-single-father-of-two/",
            "content": "By Mary Taruvinga\n\nRobert Tinotenda Mugabe Junior, the son of the late former President Robert Mugabe, has been convicted of unlawful possession of drugs and is set to be sentenced this afternoon.\n\nDuring mitigation, Mugabe, 33,pleaded for leniency, telling the court he is a single father of two children.\n\nI am a farmer, single father of two, earning US$7,000 a month, a first-time offender and pleaded on own accord.\n\nHe was arrested in October after police allegedly found two sachets of dagga, a pack of Rizla, and a white dagga crusher in his sling bag during a traffic blitz in Harare.\n\nMugabe was initially granted US$300 bail by Harare magistrate Lisa Mutendereki after spending two nights in custody.\n\nAccording to court papers, he was stopped after driving against a one-way street along 2nd Street Extension in a silver Honda Fit, registration number AGY 5850.\n\nProsecutor Mandirasa Chigumira told the court that the recovered dagga, weighing two grams and valued at US$30, would be tendered as an exhibit.\n\nThe accused acted unlawfully, Chigumira said during the trial, adding that Mugabe refused to sign the police seizure receipt.\n\nMugabe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Tinotenda Mugabe Junior, the son of the late former President Robert Mugabe, has been convicted of unlawful possession of drugs and is set to be sentenced this afternoon. During mitigation, Mugabe, 33, pleaded for leniency, telling the court he is a single father of two children. “I am a farmer, single father</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabe-jnr-convicted-for-drug-possession-pleads-for-leniency-says-he-is-a-single-father-of-two/\">Mugabe Jnr convicted for drug possession – pleads for leniency, says he is a single father of two</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "13 Nov 2025"
        },
        {
            "title": "Sikhala granted R10,000 bail by South African court",
            "url": "https://www.newzimbabwe.com/sikhala-granted-r10000-bail-by-south-african-court/",
            "content": "By Costa Nkomo\n\nOpposition leader Job Sikhala and his co-accused Alexander Thema have been granted R10 000 bail each by the Pretoria Magistrates Court.\n\nThe matter has been moved to 3 February 2026.\n\nSikhala and his elderly uncle, Thema were arrested last week on charges of possession of explosives. The two maintain their innocence.\n\nAccording to Gauteng regional spokesperson for South Africas National Prosecuting Authority (NPA), Lumka Mahanjana, police intercepted the pair along Kgosi Mampuru Street in Pretoria on November 6 following a tip-off about a suspicious vehicle.\n\nThe vehicle was searched and found with 26 blasting cartridges and 15 capped fuse connectors.\n\nSikhala insists it was a set-up, describing his detention as politically motivated.\n\nSikhala has been frequenting South Africa for medical treatment after his health deteriorated when he spentover 500 days in pretrial detention before being released without charge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/10115142/20251110_135118.jpg",
            "description": "<p>By Costa Nkomo Opposition leader Job Sikhala and his co-accused Alexander Thema have been granted R10 000 bail each by the Pretoria Magistrates Court. The matter has been moved to 3 February 2026. Sikhala and his elderly uncle, Thema were arrested last week on charges of possession of explosives. The two maintain their innocence. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikhala-granted-r10000-bail-by-south-african-court/\">Sikhala granted R10,000 bail by South African court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "13 Nov 2025"
        },
        {
            "title": "Gweru medical doctor busted smoking crystal meth",
            "url": "https://www.newzimbabwe.com/gweru-medical-doctor-busted-smoking-crystal-meth/",
            "content": "By Staff Reporter\n\nA Gweru-based medical doctor, Farikai Manjeya (49), has been arrested alongside three accomplices after being caught smoking methamphetamine, commonly known locally asmutoriro.\n\nManjeya was apprehended at his residence in Gweru while allegedly smoking the illicit substance with Tafara Chigoya (28), Kudakwashe Godknows Mutata (29), and Tariro Pambwa (35).\n\nAccording to a statement by the National Prosecuting Authority of Zimbabwe (NPAZ), police received a tip-off on November 9 about suspected drug activity at the doctors cottages.\n\nWhen detectives raided the premises, they reportedly found the group smoking crystal meth using J-pipes and lighters. The items were seized, and all four suspects were immediately arrested.\n\nThe accused have since appeared in court and were remanded in custody pending a bail hearing.\n\nThe NPAZ reiterated that drug offences will not be tolerated and encouraged the public to report drug use to protect young people and communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/29054941/Doctor.jpg",
            "description": "<p>By Staff Reporter A Gweru-based medical doctor, Farikai Manjeya (49), has been arrested alongside three accomplices after being caught smoking methamphetamine, commonly known locally as mutoriro. Manjeya was apprehended at his residence in Gweru while allegedly smoking the illicit substance with Tafara Chigoya (28), Kudakwashe Godknows Mutata (29), and Tariro Pambwa (35). According to a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gweru-medical-doctor-busted-smoking-crystal-meth/\">Gweru medical doctor busted smoking crystal meth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "13 Nov 2025"
        },
        {
            "title": "Harare residents petition Parliament over weak enforcement of environmental laws amid worsening pollution at Lake Chivero",
            "url": "https://www.newzimbabwe.com/harare-residents-petition-parliament-over-weak-enforcement-of-environmental-laws-amid-worsening-pollution-at-lake-chivero/",
            "content": "By Thandiwe Garusa\n\nHARARE residents have petitioned Parliament, demanding urgent action to address worsening water pollution, citing weak enforcement of environmental laws and institutional failures that have turned Lake Chivero and surrounding water sources into serious health hazards.\n\nThe residents say the persistent pollution is largely caused by the continuous discharge of raw sewage from Chitungwiza, Harare, and Epworth, due to non-functional sewer systems. They also accuse industries of releasing untreated effluent into municipal sewer networks in violation of the Environmental Management Act.\n\nIn a petition tabled before Parliament by the Combined Harare Residents Association (CHRA), residents urged legislators to strengthen water legislation, create a dedicated regulatory authority, and enforce tougher measures to curb pollution and restore water safety.\n\nHarmonise existing environmental water laws and regulations to eliminate overlapping contradictions.\n\nReform water laws to establish a dedicated regulatory authority, the Water and Wastewater Services Regulatory Unit, which would oversee wastewater and drinking water management, enforce water quality standards, conduct regular audits, and ensure public health compliance.\n\nInclude legal provisions in environmental water laws to ensure that fines and permit fees collected under the polluter pays principle are exclusively used for pollution mitigation and ecological restoration, reads part of the petition.\n\nThe petitioners also called for a review of the Environmental Management Act [Chapter 20:27] and related pollution laws to ensure that fines and permit fees reflect the actual cost of environmental damage, while introducing incentives for industries to minimise or prevent pollution.\n\nLake Chivero, Harares main water source, remains heavily polluted with nutrients such as phosphates and nitrates, which have triggered the proliferation of cyanobacteria (blue-green algae) and the release of toxins harmful to aquatic life and human health.\n\nTests conducted on water samples have revealed contamination levels capable of causing serious health complications.\n\nIn November 2024, government banned fishing activities at Lake Chivero after excessive pollution led to the deaths of four rhinos, fish, and other wildlife.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18163427/chivero-11.jpeg",
            "description": "<p>By Thandiwe Garusa HARARE residents have petitioned Parliament, demanding urgent action to address worsening water pollution, citing weak enforcement of environmental laws and institutional failures that have turned Lake Chivero and surrounding water sources into serious health hazards. The residents say the persistent pollution is largely caused by the continuous discharge of raw sewage from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-petition-parliament-over-weak-enforcement-of-environmental-laws-amid-worsening-pollution-at-lake-chivero/\">Harare residents petition Parliament over weak enforcement of environmental laws amid worsening pollution at Lake Chivero</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "13 Nov 2025"
        }
    ]
}