{
    "news": [
        {
            "title": "‘Police are lenient’: Zimbabwe’s disabled black market currency dealers",
            "url": "https://www.newzimbabwe.com/police-are-lenient-zimbabwes-disabled-black-market-currency-dealers/",
            "content": "By Calvin Manika, Al Jazeera\n\nKenias Mutsenha had long ceased using his Zimbabwean local currency bank account, abandoning it for one trading in US dollars, as many in the economically volatile country prefer dealing with more stable foreign currencies.\n\nBut when he took on consultancy work in Harare this year and a client needed to pay him in Zimbabwe Gold, or ZiG, currency, he returned to the bank to reopen his account. There, the teller asked for a reactivation fee in ZiG notes. Again, Mutsenha only had US dollars, which the bank would not accept or exchange.\n\nI had to find cash somewhere, Mutsenha, 46, said, realising there was only one place he could go: The streets.\n\nWhile most Zimbabweans prefer trading in US dollars to avoid the pitfalls of major currency fluctuations  government institutions use local currency. At the same time, banks dont have enough ZiG notes, as the Central Bank  wanting Zimbabwe to move towards a cashless society  has not put enough cash in circulation, experts say.\n\nAs a result, people flock to Harares central business district (CBD), where there is a thriving black marketforeign exchange trading operation.\n\nSince the launch of the ZiG last year, the government has beenclamping downon informal currencydealers. But this has only created a situation where the suppliers find new avenues to explore  as Mutsenha discovered that day.\n\nFinding local currency on the street was a nightmare, he said. I wandered in the CBD until one illegal forex dealer [who said he had no cash] directed me to a certain street. I was told the person [exchanging money] is disabled on a wheelchair.\n\nOn a bustling street corner, Mutsenha found Leonard Mumba*,who used to sell mobile phone airtime at a local bus terminus but now deals in something far more lucrative, secretive, and risky.\n\nEvery day except Sundays, 43-year-old Mumba is wheeled into town by a relative. He works from about 7am to 6pm from the same spot on the corner, and is paid a weekly commission by the black market dealer who hired him.\n\nAs Mutsenha handed over his US dollar note to Mumba, he observed the subtle operations of this trade. A man came from across the road, walking, passing by the street corner. He just dropped a black satchel at this illegal forex dealer and hooked it on the wheelchair. They did not speak to each other, Mutsenha recounted.\n\nAll across the capital city, dealers like Mumba now sit in wheelchairs and on sidewalks with satchels of banknotes. Silent handoffs are not uncommon to witness: A plastic bag tossed casually at a traders feet as a supplier walks by, avoiding eye contact and accountability.\n\nAfter the 2024 introduction of the ZiG and the associated government crackdown on illegal money traders, an increasing number of people with disabilities have taken up the trade in Harare, observers and disability rights groups say.\n\nAlthough there are no clear estimates of how many people with disabilities work as black market dealers, Plaxedes Choto, a disability activist, told Al Jazeera that in the CBD alone, there are more than three dozen disabled people involved in the trade.\n\nWhile some have approached the trade organically, others, like Mumba, were recruited to be proxies for someone else.\n\nI used to sell airtime at Copacabana bus terminus, but when police continued rounding up the money changers, one of the suppliers approached me to work for him, Mumba told Al Jazeera from his street corner.\n\nDue to my condition [being in a wheelchair], police would not easily suspect me, especially in the beginning, he said. And they are lenient on arrest due to our circumstances.\n\nPeople with disabilities may be overlooked or viewed more sympathetically by the police, who are less likely to crack down on them, according to observers. Thabiso Moyo, a Harare-based social justice activist and human rights defender, told Al Jazeera this is because police stations are often not disability friendly, which creates hassles for the officers.\n\nBeing generally spared from police raids then creates a situation which allows wheelchair users to be shields and proxies in a broader system of economic survival and corruption. Real culprits hide behind the disabled.\n\nMoyo notes that the shift to front-lining disabled money traders is a tactic that allows the real suppliers of illicit street currency to stay behind the scenes and be more protected.\n\nDespite their work with sought-after US dollars, observers say there are seldom reports of disabled money traders being robbed by thieves. However, many traders say law enforcement agents approach them for bribes in exchange for allowing their operations to continue.\n\nDespite any risks, for many, including Mumba, the benefits of the job outweigh previous economic ventures. With airtime and fruits it was quite a hustle. And now everyone wants money  cash or online transfers, both in USD and ZiG. Its a lucrative business and I could not deny such a [job] offer.\n\nNot too far away, Clever Gorejena*, another street currency dealer, has been in a wheelchair since an accident a decade ago left him disabled. He dabbles in the trade to make additional income.\n\nLike Mumba, he works for someone else and is paid weekly on commission based on the profits from the transactions he makes.\n\nI took the offer as an opportunity to make money. I deal in both hard currency and online transactions using my phone. In addition to forex exchange,I also sell airtime. Those are my two major activities, he told Al Jazeera.\n\nPeople with disabilities face many hurdles in Zimbabwe, including a high cost of living due to additional care and resources they may require. On the streets of Harare, several told Al Jazeera about the stressful cost of diapers, food for their specific diets, special transport services, and a support person or aids to help them get by.\n\nAlthough Zimbabwes social welfare department gives monthly grants to people with disabilities, representatives of this community say it is a drop in the ocean. Employment prospects also remain a challenge. In 2021, Zimbabwe launched a national disability policy to close the gaps between disabled and able-bodied Zimbabweans. The policy stated the governments intention for inclusion, including employment opportunities, but four years down the line, the community say they are still excluded and often exploited.\n\nFor many, this has led to begging or vending to earn money. According to a 2017 study by the National Association of Social Workers, 57 percent of people begging in Harare have a physical disability.\n\nBeggars with disabilities have a low level of education. Forty-seven percent have no formal education. This has made it difficult for them to get employed, said the report.\n\nAs people attempt to leave begging, many are drawn to the informal sector because of the challenging economic situation, said Samantha Sibanda, the director of Signs of Hope Trust, an organisation for people with disabilities. Some fall into illegal currency dealing, while others sell what they can in the street.\n\nI think the national budget and other economic outlooks have shown that, generally, we have now moved to an informal economy, said Sibanda. But for persons with disabilities, the challenges are unique, she added, including insufficient access to education, as few schools provide accessible infrastructure. This then affects their chances of getting a formal job. And even for the employed, workplace discrimination remains a challenge.\n\nThis is a huge gap in inclusion. Our infrastructure was built without the disabled in mind, Sibanda said. The majority of the disabled find their way to city centres, in the streets or vending due to lack of opportunities.\n\nIn August, the Harare City Council conducted Operation Restore CBD Order, during which officials inspected shops and buildings to ensure their businesses were complying with the law.\n\nThe city council told Al Jazeera that although it was aware that disabled people are working in the illegal money trade in Harare, the current focus of its operation was on unlicensed shops and illegal infrastructure in the greater CBD.\n\nBut anyone operating any business within the CBD without regulation through the City of Harare is illegal, including those in the streets, added Stanley Gama, the citys spokesperson.\n\nOther concerned stakeholders say that despite government efforts to fight illegal forex trade, currency shortages and bureaucracy in the banking system drive the black market operation.\n\nIn Zimbabwe, changing foreign currency to local notes the official way is a long process, involving paperwork and banks asking for detailed information. Meanwhile, changing ZiG to foreign currency requires Central Bank approval and is near impossible, locals say. So many choose to go the black market route.\n\nNgonidzashe Mutsigo, a Harare resident, mentions other challenges for Zimbabweans.\n\nI dont have a bank account; it costs to maintain a bank account in Zimbabwe. It costs to withdraw and transact using the bank account. So I think such things are the ones that make the business of informal money changing blossom, he said.\n\nUnfortunately, even for those with bank accounts, when they want to buy the USD in the bank, they dont get it, and we meet in the streets.\n\nA black-market money supplier who provides currency to disabled traders said that, these days, ZiG notes are scarce. As the ZiG is in demand, the supplier, who requested anonymity for security reasons, told Al Jazeera, black market suppliers often source it from big businesspeople.\n\nThere are people in business and government getting tenders and paid in local currency  this is big money  millions. And the only way for them to get the USD is to come to the streets.\n\nEven though the government pays in local currency, the big shots want US dollars, he said.\n\nWe help them by looking for the greenback  and we work with our guys on the ground, including those with disabilities. We believe in numbers  the more we get these people, the quicker our money is turned into the sought-after USD.\n\nIn June, the Reserve Bank of Zimbabwe (RBZ) reported that it had achieved one year of ZiG stability.\n\nZimbabwes exchange rate has become more stable, with the difference between the official and black market rates now below 20 percent. The country also received more foreign currency  [This has] made it easier for businesses and individuals to access foreign currency for genuine needs, and helped keep the financial sector stable and healthy, said RBZ governor, John Mushayavanhu.\n\nObservers and financial experts, however, say the RBZ is not realistic about the situation on the ground, where US dollars arein demand and widely different exchange rates on the officialand parallel markets have created opportunities for illegal dealers to thrive.\n\nMeanwhile, on the streets, people with disabilities have been drawn in, too  many out of desperation or necessity.\n\nWe are living in tough times, Sign of Hopes Sibanda said. We do also have people who have been exploiting persons with disabilities since time immemorial, using them for begging, using them to run their stores while they keep their money for themselves. Recruitment by money traders wanting to stay in the shadows is the newest iteration of that.\n\nOperating a parallel market of forex or currency exchange is illegal, and we do not condone such activities, Sibanda said. But we do look forward to other opportunities that can give people with disabilities better incomes and a better life.\n\nOn his street corner, Mumba agrees. Despite some financial respite, he says currency trading does not provide real security  neither economic nor social. He hopes the government will roll out initiatives and invest in helping him and others get away fromthe criminal trade and unsafe streets of Harare.\n\nNo one knows about tomorrow. Robbers can target me, here or at home, and it will affect my family, Mumba said. My biggest fear is that the work we do is illegal and does not help in building my countrys economy.\n\n*Name changed for safety reasons\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/08173329/forex-dealer.jpg",
            "description": "<p>By Calvin Manika, Al Jazeera Kenias Mutsenha had long ceased using his Zimbabwean local currency bank account, abandoning it for one trading in US dollars, as many in the economically volatile country prefer dealing with more stable foreign currencies. But when he took on consultancy work in Harare this year and a client needed to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-are-lenient-zimbabwes-disabled-black-market-currency-dealers/\">‘Police are lenient’: Zimbabwe’s disabled black market currency dealers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Zimbabwe embassy takes passports outreach to Scotland, Ireland with Diaspora Insurance support",
            "url": "https://www.newzimbabwe.com/zimbabwe-embassy-takes-passports-outreach-to-scotland-ireland-with-diaspora-insurance-support/",
            "content": "By UK Correspondent\n\nLONDON: The Zimbabwean embassy in United Kingdom (UK) will this month take its consular outreach programme to Scotland and Ireland, relieving many nationals of the long journey to London for services.\n\nThe outreach is again supported byDiaspora Insuranceas the company continues its partnership with embassies of African nationalities it now covers which have since increased to 25.\n\nAccording to a statement released by Zimbabwe House in London, the first stop in Scotland will be Glasgow from 13 to 14 October after which the programme will move to Dundee from October 15 to 16.\n\nApart from passport applications, other services available include, temporary travel documents, birth registrations, name changes through marriage or divorce as well as applications for police clearance.\n\nMeanwhile, from Scotland the outreach will move to Ireland, beginning with Belfast on the 27thand 28thof October, shifting to Dublin from the 29thto the 31stof October.\n\nDiaspora Insurances partnership with the embassy started in July this year when the company hosted the embassy for a week at its Birmingham global headquarters with hundreds of people getting their consular concerns attended to.\n\nCommenting on the development at the time, a company representative said, We are pleased to support the Zimbabwe Embassys consular services outreach programme.\n\nProviding a platform for such essential services not only helps facilitate easier access to consular assistance but also demonstrates our commitment to serving the needs of the Zimbabwean community here.\n\nWe look forward to continuing this collaboration and working together to ensure that our community members receive the support and services they deserve.\n\nManagement said the head office facilities were available not just to the Zimbabwe community but all the 25 African nationalities the company covers across the globe.\n\nEstablished more than 14 years ago,Diaspora Insurancehas grown exponentially over the years with its bespoke funeral cash plan product providing critical financial intervention which ensures Africans in the Diaspora do not endure the indignity of GoFundMe appeals to deal with end-of-life expenses.\n\nWith no medicals asked, African transnational citizens can cover themselves in the Diaspora as well as family back home with a product that removes the double trauma of bereaving a loved one while also begging for financial assistance to help with funeral costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/08192042/Embassy-Outreach-DI.png",
            "description": "<p>By UK Correspondent LONDON: The Zimbabwean embassy in United Kingdom (UK) will this month take its consular outreach programme to Scotland and Ireland, relieving many nationals of the long journey to London for services. The outreach is again supported by Diaspora Insurance as the company continues its partnership with embassies of African nationalities it now</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-embassy-takes-passports-outreach-to-scotland-ireland-with-diaspora-insurance-support/\">Zimbabwe embassy takes passports outreach to Scotland, Ireland with Diaspora Insurance support</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Zimbabwe set to implement “very ugly” measures against drug abuse",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-to-implement-very-ugly-measures-against-drug-abuse/",
            "content": "By Staff Reporter\n\nPRESIDENTIALspokesperson George Charamba has warned that the government is preparing to introduce harsh measures to curb drug abuse, cautioning that those involved in selling or using illicit substances should brace for very ugly consequences.\n\nThis comes at a time when Zimbabwe is grappling with an alarming rise in drug and substance abuse cases, particularly among young people.\n\nPosting on one of his X handles under the pseudonym Jamwanda, Charamba wrote, Guys get warned: We are contemplating very ugly measures for those involved in peddling or consuming drugs.\n\nIt is going to be really ugly.\n\nWith the high rates of unemployment among the youth in Zimbabwe, many have turned to harmful drug use, often with minimal chances of full recovery.\n\nSome of the most potent drugs abused by young people are homemade mixtures, including substances like sodium polyacrylate, commonly known as waterlock, which are produced in backyards.\n\nSodium polyacrylate is an absorbent for urine in diapers and is also found in some detergents.\n\nDrug dealers are reportedlytaking advantage of the countrys porous borders to smuggle in drugs such as crystal meth, heroin, cocaine and cough mixtures like Broncleer, fueling the rapidly expanding drug market.\n\nPresident Emmerson Mnangagwa last year launched a multi-sectoral drug and substance abuse plan to fight the scourge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/15161941/Drug-Use-e1623770429846.jpg",
            "description": "<p>By Staff Reporter PRESIDENTIAL  spokesperson George Charamba has warned that the government is preparing to introduce harsh measures to curb drug abuse, cautioning that those involved in selling or using illicit substances should brace for “very ugly” consequences. This comes at a time when Zimbabwe is grappling with an alarming rise in drug and substance abuse</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-to-implement-very-ugly-measures-against-drug-abuse/\">Zimbabwe set to implement “very ugly” measures against drug abuse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Burkina Faso’s military govt arrests European NGO workers for ‘spying’",
            "url": "https://www.newzimbabwe.com/burkina-fasos-military-govt-arrests-european-ngo-workers-for-spying/",
            "content": "Al Jazeera\n\nBurkina Fasos military government says it has arrested eight people working for a humanitarian organisation, accusing them of spying and treason, allegations the Dutch nonprofit categorically rejected.\n\nBurkina Fasos Security Minister Mahamadou Sana said the eight people arrested worked for the International NGO Safety Organisation (INSO), a Netherlands-based group specialising in humanitarian safety.\n\nThose detained included a French man, a French-Senegalese woman, a Czech man, a Malian and four Burkinabe nationals, Sana said, alleging the staff members had continued working for the organisation after it was banned for three months, for allegedly collecting sensitive data without authorisation.\n\nThe security minister claimed some of INSOs staff had continued to clandestinely or covertly conduct activities such as information collection and meetings in person or online following the ban, including its country director, who had also previously been arrested when the suspension came into effect at the end of July.\n\nSana said the INSO staff members had collected and passed on sensitive security information that could be detrimental to national security and the interests of Burkina Faso, to foreign powers.\n\nThe Hague-based humanitarian organisation issued a statement on Tuesday saying it categorically rejected the allegations about its activities in Burkina Faso.\n\n[We] remain committed to doing everything in our power to secure the safe release of all our colleagues, INSO said in the statement.\n\nINSO also said it collects information exclusively for the purpose of keeping humanitarians safe, and that the information it gathers is not confidential and is largely already known to the public.\n\nBurkina Fasos military government has turned away from the West and, in particular, its former colonial ruler, France, since seizing power in a September 2022 coup.\n\nTogether with neighbouring Mali and Niger, which are also ruled by military governments, it has also withdrawn from regional and international organisations in recent months, with the three countriesforming their own blocknown as the Alliance of Sahel States.\n\nThe three West African countries have also wound back defence cooperation with Western powers, most notably their former colonial ruler,France, in favour of closer ties with Russia, including Niger nationalising a uranium mine operated by French nuclear firmOrano.\n\nWithin the three countries, the military governments are fighting armed groups linked to al-Qaeda that control territory and have staged attacks on army posts.\n\nHuman Rights Watch and other advocacy groups have accused the fighters, the military and partner forces of Burkina Faso and Mali of possible atrocities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17174007/traore.webp",
            "description": "<p>Al Jazeera Burkina Faso’s military government says it has arrested eight people working for a humanitarian organisation, accusing them of “spying and treason”, allegations the Dutch nonprofit “categorically” rejected. Burkina Faso’s Security Minister Mahamadou Sana said the eight people arrested worked for the International NGO Safety Organisation (INSO), a Netherlands-based group specialising in humanitarian safety.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/burkina-fasos-military-govt-arrests-european-ngo-workers-for-spying/\">Burkina Faso’s military govt arrests European NGO workers for ‘spying’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Biti fights in Mutodi’s corner after removal from Parliamentary Committee chair post for calling out “corrupt” Guvamatanga",
            "url": "https://www.newzimbabwe.com/biti-fights-in-mutodis-corner-after-removal-from-parliamentary-committee-chair-post-for-calling-out-corrupt-guvamatanga/",
            "content": "By Staff Reporter\n\nFormer Finance Minister Tendai Biti has condemned the removal of Energy Mutodi from his position as Chair of the Parliamentary Portfolio Committee on Budget and Finance, following the Bikita South legislators demand that Parliament summon Finance Ministry Permanent Secretary George Guvamatanga to answer bribery allegations involving millions of dollars.\n\nMutodi had taken to X to allege that Guvamatanga was demanding kickbacks from contractors undertaking government work across various sectors. He further claimed that contractors had lost interest in working with the government because Guvamatanga was allegedly demanding millions of dollars as bribes at every turn, threatening to withhold their payments if his demands were not met.\n\nHis allegations sparked debate on social media, with some Zanu PF colleagues criticising him for rocking the boat and causing divisions within the party. Consequently, he was removed from his post as Chair of the Budget and Finance Parliamentary Committee and replaced by Chipinge East MP Lincoln Dhliwayo  a move Biti has branded as unconstitutional.\n\nWananchi, The abrupt removal of Honourable @energymutodi as chair of parliament Budget & Finance Committee is an abject unconstitutional overreach by a desperate canterkarous cartel that has captured the State and will do everything legally & extra-legally to perpetuate its vice-like grip on the public coffers of this country, Biti wrote on his X account on Monday.\n\nBiti emphasised that Parliamentarians have a constitutional duty to hold the executive to account and must be allowed to do so without facing punishment.\n\nMembers of Parliament have a constitutional obligation to hold the Executive & every other institution to account in terms of section 119 of the Constitution.\n\nFurther Members of Parliament have absolute privilege, and an unfettered right to feeedom of expression when they stand and debate in the chambers of the August House. Honorable Mutodi enjoys this constitutional protection.\n\nHe has an obligation to raise a matter of great national interest, Biti said.\n\nHe further argued that Mutodi should not be made a scapegoat for speaking out on matters that were already in the public domain, noting that Guvamatangas alleged corrupt conduct was documented in the 2024 Auditor Generals Report.\n\nThe issue of George Tongesai Guvamatanga and the alleged bribes he is demanding is a matter in the public domain and requires parliamentary scrutiny.\n\nThe issue of direct payments being made directly by Treasury to suppliers oblivious of line Ministries, Departments and Agencies has been captured in the Auditor Generals Reports.\n\nBiti also alleged that Guvamatanga had facilitated over US$2 billion in payments to service providers in contravention of the Public Finance Management Act.\n\nIn 2024 alone US$2 billion of payments were made directly by Mr Guvamatanga in his role and capacity as the Paymaster General.\n\nYet Treasury Instructions, which he supervises, the Public Finance Management Act and the Constitution clearly proscribe the same, he said.\n\nBiti suggested that Mutodi should not have retracted his statement against Guvamatanga.\n\nIn other words, Hon Mutodi did not disclose anything new. Everything he uttered in parliament was a matter of direct and implicit public knowledge. His mistake was his purported retraction and apology. Understandably, as a loyal member of Zanu PF, it would be expecting too much from the same. A mosquito cannot cure malaria, Biti said.\n\nBe that as it may, Honourable Mutodis removal is a direct attack on the constitution, which gives autonomy to the institution of Parliament. It is a direct attack on Parliament itself.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/06045739/Tendai-Biti1.jpg",
            "description": "<p>By Staff Reporter Former Finance Minister Tendai Biti has condemned the removal of Energy Mutodi from his position as Chair of the Parliamentary Portfolio Committee on Budget and Finance, following the Bikita South legislator’s demand that Parliament summon Finance Ministry Permanent Secretary George Guvamatanga to answer bribery allegations involving millions of dollars. Mutodi had taken</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/biti-fights-in-mutodis-corner-after-removal-from-parliamentary-committee-chair-post-for-calling-out-corrupt-guvamatanga/\">Biti fights in Mutodi’s corner after removal from Parliamentary Committee chair post for calling out “corrupt” Guvamatanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Jazzworx and Thukuthela to headline Afro-house festival in Zimbabwe",
            "url": "https://www.newzimbabwe.com/jazzworx-and-thukuthela-to-headline-afro-house-festival-in-zimbabwe/",
            "content": "The South African\n\nThe sensational duo Kgotso Thukuthela Dube and Kamohelo Jazzworx Monese are set to perform in Zimbabwe for the first time.\n\nThe pair will headline the 7th edition of HiNDE at Mystique Gardens in Bulawayo, Zimbabwe on 29 November.\n\nKnown for their electrifying 3-step dance house, the pair have become major forces in Southern Africasmusic scene.\n\nTheir groove-packed, polished tracks dominate streaming platforms and top The Official SA Charts, making this debut a must-see for Afro-house fans.\n\nSunday Worldreports that the duo cut ties with some friends and relocated after experiencing atraumatic house robbery.\n\nJust weeks before releasing their 13-track album, armed robbers invaded their home, kidnapped Jazzworx, and held their friend and fellow musician Gobokweone GL Ceejay Lekganyane captive.\n\nJazzworx and Thukuthela remain relatively new in the business but have picked up valuable experience.\n\nWe are learning about the business side of the music industry. We had a dream but didnt see ourselves reaching international standards so soon, Thukuthela toldSunday World.\n\nOur music is being recognised globally.\n\nHiNDEhave confirmed on their social media pages that Jazzworx and Thukuthela will headline their upcoming event.\n\nHiNDE is a recurring Afro-house music and culture event that takes place in Zimbabwe.\n\nSince its launch in 2021, HiNDE has grown beyond a typical night out. It has become a vibrant platform where local and international DJs share the stage.\n\nThis edition promises to elevate Bulawayos house music scene even further as Jazzworx and Thukuthela bring their signature energy to Zimbabwean audiences for the very first time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07055811/thukuthela.webp",
            "description": "<p>The South African The sensational duo  Kgotso “Thukuthela” Dube and Kamohelo “Jazzworx” Monese are set to perform in Zimbabwe for the first time. The pair will headline the 7th edition of HiNDE at Mystique Gardens in Bulawayo, Zimbabwe on 29 November. Jazzworx and Thukuthela making waves Known for their electrifying 3-step dance house, the pair</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jazzworx-and-thukuthela-to-headline-afro-house-festival-in-zimbabwe/\">Jazzworx and Thukuthela to headline Afro-house festival in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Pastor loses Budiriro home after faking illiteracy to evade repaying debt",
            "url": "https://www.newzimbabwe.com/pastor-loses-budiriro-home-after-faking-illiteracy-to-evade-repaying-debt/",
            "content": "By Mary Taruvinga\n\nA retired pastor who tried to evade repaying a US$22,750 loan by falsely claiming illiteracy has lost his case at the High Court, which ordered him to settle the debt and declared his Budiriro house executable.\n\nJudges of appeal Justices Hapias Zhou and Benjamin Chikowero ruled that Pastor Stefan Pios Mumbiro knowingly signed all loan and mortgage documents binding him to businessman Collins Farai Muchada, but later attempted to take advantage of his supposed illiteracy to escape liability.\n\nThe first respondent was not illiterate. He was educated up to Grade 7, could read and write, and even successfully undertook pastoral studies, the judges said. He cannot evade responsibility by pretending not to understand what he signed.\n\nThe court condemned Mumbiros conduct, saying he had taken advantage of Muchadas trust while later seeking to hide behind claims of being duped.\n\nEvidence before the court showed that Mumbiro willingly signed an Acknowledgement of Debt, a Power of Attorney to register a Mortgage Bond, and other loan documents, all of which were verified by a handwriting expert.\n\nThe only credible evidence on record was that adduced by the appellant himself, amply corroborated by the Questioned Document Examiner, the Acknowledgement of Debt, the Power of Attorney to Pass Mortgage Bond, the Mortgage Bond, and the Forensic Examination Report, Chikowero said.\n\nThe court said Mumbiros story fell apart under cross-examination when he admitted signing blank papers, a move the judges described as a deliberate attempt to distort facts and mislead the court.\n\nCiting the long-standing legal principle of caveat subscriptor, the bench reminded litigants that a party to a contract is bound by his signature, whether or not he has read or understood the document.\n\nChikowero criticised the lower court for allowing Mumbiro to eat his cake and still have it by accepting contradictory statements about how much he borrowed.\n\nAs a result, the High Court ordered Mumbiro to repay US$22,750 plus interest and costs, and ruled that his Budiriro home, Stand 2308 of Willowvale Estate, be declared specially executable should he fail to pay.\n\nIn their judgment, the judges issued a clear warning to others attempting similar deceit.\n\nThe loud and clear message to go out from the court is: businessmen beware. If you fail to honour your contracts, dont start crying when the other party obtains an order compelling you to perform.\n\nMumbiro had earlier accused Muchada of being a fraudster who wants to con me of my house, but the judges found no proof of that claim.\n\nThe case originated at the Harare Magistrates Court, where Mumbiro initially won after convincing the magistrate that he was illiterate and had been duped. However, the High Court overturned that decision, ruling that Mumbiro had instead abused the courts sympathy and his position as a retired pastor to avoid his legal obligations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A retired pastor who tried to evade repaying a US$22,750 loan by falsely claiming illiteracy has lost his case at the High Court, which ordered him to settle the debt and declared his Budiriro house executable. Judges of appeal Justices Hapias Zhou and Benjamin Chikowero ruled that Pastor Stefan Pios Mumbiro knowingly</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-loses-budiriro-home-after-faking-illiteracy-to-evade-repaying-debt/\">Pastor loses Budiriro home after faking illiteracy to evade repaying debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        }
    ]
}