{
    "news": [
        {
            "title": "Police officer flogs suspect to death at station, family demands justice",
            "url": "https://www.newzimbabwe.com/police-officer-flogs-suspect-to-death-at-station-family-demands-justice/",
            "content": "By James Muonwa\n\nA ZIMBABWE Republic Police (ZRP) officer stationed at Ruwa allegedly beat up a suspect to death in a bid to instil fear and force him to pay a bribe for his freedom.\n\nAs a result, 39-year-old Constable Prince Ndavambi (Force Number 078641D) is now at the centre of controversy following the death of Blessed Believe Juruvenge (30) of 14316 Damafalls, Phase 1, Ruwa, situated on the outskirts of Harare.\n\nJuruvenges body still lies at Parirenyatwa Group of Hospitals mortuary awaiting another postmortem after relatives disputed the doctored results of the first one.\n\nAccording to a police internal memorandum gleaned by NewZimbabwe.com, the now deceased owned a tuck-shop at his place of residence in Ruwa. Sometime in April 2025, he got a job to operate as a pirate taxi driver and left his wife, Mercy Madenyika in charge of the store.\n\nOn April 25, 2025, around 1000 hours, Madenyikawas approached by a neighbor and five other unidentified male adults, who bought some groceries worth US$$10using a fake US$$50 note and were given some change before fleeing from the scene.\n\nMadenyika later discovered that she had been duped and alerted her husband, the now deceased, about the matter.\n\nJuruvenge then approached some of the people among the group which had bought groceries at his tuck-shop using fake money.\n\nAn altercation arose and the now deceased, assaulted one of the men once on the face using open hands. One of them only identified as Mwazha offered Juruvenge US$100 as compensation for the inconveniences and he accepted it and went away.\n\nMwazha later proceeded to ZRP Ruwa and made a report of assault and theft against the now deceased CR 185/04/25 refers, reads the memo.\n\nOn May 27, 2025, around 1130 hours, the accused person number 078641D Constable Prince Ndavambi and Mwazha proceeded to the now deceaseds place of residence and arrested the now deceased.\n\nThey took him to Ruwa Police Station together with his sister Melisa Manyepa of Damafalls, Phase 1 whom they accused of harbouring the now deceased, the memo further reads.\n\nOn arrival at the police station, Ndavambi detained the now deceased under DB 460/25 and force-marched his sister to the back of the cabin and assaulted her on the knees using a wooden stick.\n\nThe accused person later took the now deceased from cells to the cabin where he assaulted him all over the body using a wooden stick. He ordered the now deceased and his sister to refund Mwazha his US$100.\n\nThe accused person threatened to kill the now deceased if he fails to refund the money. He also demanded another US$100 from the now deceased and his sister so that he can release them, police said in the memo.\n\nThe constable only stopped flogging Juruvenge after noticing he had become unconscious.\n\nUnperturbed, Ndavambi is said to have ordered Manyepa to contact her relatives to bring the money. She contacted her mother Elipa Jimu and others, who could not raise the required money.\n\nAccording to the police internal communication, the rogue cop then instructed a battered Juruvenge to stand up from where he was lying so that he shunts him into cells, but victim could not move. The police officer them pulled now deceased into the cell.\n\nAssailant later released victims sister to go and find money and she proceeded home. That evening, the accused called Manyepa asking her to bring food for the now deceased and she indicated that that she could not walk due to her knee injury as a result of the earlier beating.\n\nOn the same date at around 2130 hours, a cell check was conducted by the duty member, and he observed that the now deceased had difficulties in talking and breathing.\n\nAn entry was endorsed in the Occurrence Book entry number 3917/25. Officer in Charge ZRP Ruwa was advised through telephone and instructed the duty member to take the now deceased to hospital under police guard.\n\nThe now deceased was taken to Ruwa Rehabilitation Centre for medical attention where he was admitted.\n\nOn 28 May 2025 around 0615 hours, the now deceased passed away at Ruwa Rehabilitation Centre, reads the memorandum.\n\nThe informant reported the matter at ZRP Ruwa. Scene was attended by ZRP Ruwa, CID Homicide and CID Studios. The deceaseds body was inspected and following observations were made:  small bruise on the left lower limb and bruises on the right hand.\n\nThe body of the now deceased was conveyed to Parirenyatwa Group of Hospitals mortuary for forensic postmortem. Next of kin Manyepa was advised and identified the body. Investigations are in progress, the memo says.\n\nThe investigations are being done under ZRP Ruwa CR 379/5/25.\n\nAccording to the now deceaseds brother, Robson Juruvenge his family is devastated by the murder, which they feel someone is trying to cover up.\n\nAfter we contested the unconvincing results of the first postmortem results, we have been told another postmortem will be done on Monday.\n\nWe have been in talks with police Commissioner Mbiri of PGHQ (Police General Headquarters). Also, we have been summoned to Ruwa Police Station this Saturday, Robson told NewZimbabwe.com.\n\nHe vowed the family will leave no stone unturned in a bid to unravel the truth surrounding his brothers gruesome killing at the hands of a rogue law enforcement officer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31080544/Screenshot_20250531-085053_1.jpg",
            "description": "<p>By James Muonwa  A ZIMBABWE Republic Police (ZRP) officer stationed at Ruwa allegedly beat up a suspect to death in a bid to instil fear and force him to pay a bribe for his freedom. As a result, 39-year-old Constable Prince Ndavambi (Force Number 078641D) is now at the centre of controversy following the death</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-flogs-suspect-to-death-at-station-family-demands-justice/\">Police officer flogs suspect to death at station, family demands justice </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "31 May 2025"
        },
        {
            "title": "Dynamos being run like a tuck-shop says fuming supporters",
            "url": "https://www.newzimbabwe.com/dynamos-being-run-like-a-tuck-shop-says-fuming-supporters/",
            "content": "By Darlington Gatsi\n\nDYNAMOS fans have declared war on club owner Bernard Marriot and his executive, vowing to protest against the maladministration that has seen the Harare giants slide into murky waters.\n\nThe fading Harare side find themselves in a quagmire days before they face old foes Highlanders on Sunday at Rufaro Stadium, with fan unrest threatening to overshadow the encounter.\n\nDynamos supporters are demanding sweeping reforms at the club, which they argue will address the troubles burdening the 22-time league champions.\n\nTeam loyalists are threatening to boycott the Highlanders match as they demand Marriot fire the board, led by Moses Maunganidze, whom they accuse of incompetence and unprofessionalism.\n\nAddressing the media in Harare Thursday, Dynamos Harare Chapter Organising Secretary Robetho Machovo said the deterioration at the club had reached alarming levels, prompting the boycott.\n\nWe are frustrated by the current state of affairs at our beloved club Dynamos. The mismanagement by the Dynamos executive led by Bernard Marriot, his relatives, and the so-called NEC has reached a boiling point, said Machovo.\n\nDynamos continue to sink deeper, currently occupying the relegation zone, separated by only two points from Kwekwe United, who sit at the basement of the table.\n\nDeMbare have managed just one win in 13 matches, scoring only two goalsa record that has sparked fury among supporters.\n\nThe struggles have been attributed to poor recruitment and the general welfare of players at the club.\n\nMachovo accused Dynamos leadership of running the club with an amateurish, and an outdated approach.\n\nWe can no longer remain silent. Our key concerns is the tuck shop mentality, outdated approach and sponsorship failure, said Machovo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Darlington Gatsi DYNAMOS fans have declared war on club owner Bernard Marriot and his executive, vowing to protest against the maladministration that has seen the Harare giants slide into murky waters. The fading Harare side find themselves in a quagmire days before they face old foes Highlanders on Sunday at Rufaro Stadium, with fan</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-being-run-like-a-tuck-shop-says-fuming-supporters/\">Dynamos being run like a tuck-shop says fuming supporters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "31 May 2025"
        },
        {
            "title": "Cement importer takes Zimbabwean government head on for breaching COMESA regulations",
            "url": "https://www.newzimbabwe.com/cement-importer-takes-zimbabwean-government-head-on-for-breaching-comesa-regulations/",
            "content": "By Mary Taruvinga\n\nA TOP cement importer, Augutich Investments (PVT) LTD has taken Finance Minister Mthuli Ncube to court on allegations breaching the law by imposing tax on goods covered under the Common Market for Eastern and Southern Africa (COMESA) after it was taxed on its cement now stuck at Chirundu Border Post.\n\nUnder the COMESA Free Trade Area (FTA) goods originating from Member States can be imported and exported with reduced or eliminated tariffs.\n\nAugutich purchased 70 000 tonnes of cement from Zambia at a total cost of US$9,659 999, and it contends that the only tax obligation since this was a COMESA certificate was 15% value added tax (VAT), which would have been the sum of US$ 1,448-999.\n\nHowever, on May 22 2025 to its surprise the finance minister instructed ZIMRA to implement the new tax regime even on cement purchased prior to the promulgated date.\n\nThe effect of this cumulatively is that the company is saddled with a tax obligation over time in the sum of US$1,448 999 the 30% surtax on the already purchased cement.\n\nThe company said not only is this unreasonable it is legally untenable as laws must never be applied retrospectively.\n\nAugutich had 50 haulage trucks that were in the process of bringing cement into Zimbabwe of cement purchased prior to May 16, 2025, ZIMRA then changed its system and demanded the said surtax.\n\nThe trucks have been stuck at Chirundu Border post since May 22, 2025 with negotiations with ZIMRA officials having collapsed.\n\nZIMRA, according to court papers, said the minister is the responsible authority.\n\nTo this end Augutich Investments filed an urgent chamber application with the High Court seeking a temporary interdict suspending the enforcement of a surtax of 30 % against it on white cement whether artificially coloured, introduced by the Customs and Excise (Surtax Tariff) (Amendment) Notice, 2025 (No.6).\n\nThe company through its Chief Executive Officer Levy Mashingaidze, and represented by Mugiya Law Chambers, is also seeking an order that the implementation of surtax 30% duty should not apply to cement purchased by the applicant prior to May 16, 2025.\n\nOn the return date, the company prays for an order which strikes out the surtax on the basis that it is inconsistent and in violation of section 3 Customs and Excise (Common Market For Eastern And Southern Africa) (Suspension) Regulations, 2000 Le 5.1. 244 of 2000.\n\nThe surtax law was introduced on 16th of May 2025, the enforcement was then done on the 22 of May 2025.\n\nIn the year 2000, government caused the promulgation of Customs and Excise (Common Market For Eastern And Southern Africa) (Suspension) Regulations, 2000, which provide for the exemption of duty/surtax on goods imported and exported between member states of the COMESA also known as the COMESA regulations.\n\nWith the coming into effect of the COMESA regulations and with the passage of time, the applicant being an importer of white cement and other cement related products would over the years import cement from Zambia for purposes of resale in Zimbabwe.\n\nWith Zambia being a COMESA Member State, the company would import the cement duty in accordance with the COMESA regulations.\n\nThe company started importing cement sometime in 2020 and has been doing so for a period of five years with the last such import being done on a monthly basis, the last of which was in February 2025.\n\nThe company purchased 70,000 tonnes of cement in Zambia last year.\n\nIt eventually applied for an Import Licence from the Ministry of Industry snd Commerce to import the said cement into Zimbabwe.\n\nThere were several legal issues and the applicant litigated with the Ministry of Industry and Commerce this culminated in a settlement, the effect of which is that over a period of just over a year the applicant was issued with an Import Permit for Cement.\n\nThe Deed Of Settlement was signed by the parties on May 14, 2025.\n\nWhilst in the process of ensuring that the cement consignment which the applicant had purchased is transported into Zimbabwe, Ncube without notice to the stakeholders and the applicant, proceeded to issue Customs and Excise (Surtax Tariff) (Amendment) Notice, 2025 (No.6) through S1. 50A of 2025, whose effect was to introduce some surtax, Mashingaidze said in his founding affidavit accompanying the application.\n\nThere was now additional duty on cement, this was done without prior warning or a grace period by the minister.\n\nThe applicant is of the view that the requirement for it to pay 30% surtax on cement imported from the COMESA region is unlawful or inconsistent with the dictates of the section 3 of the COMESA regulations which clearly exempt the applicant from paying surtax.\n\nI must also advise the court that the importation of Cement is regulated by the Ministry Of Industry and Commerce through the issuance of Import Licences; this is obviously meant to protect the local industry and products from being overrun by imports.\n\nThe financial prejudice which applicant is suffering and continues to suffer is massive; the haulage trucks that were hired are now currently in transit .\n\nThe applicant has further shown that it contracted a different transporter to ship its cement from Zambia at a cost which is likely to blow out of its budget on account of demurrage,he said.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Mary Taruvinga A TOP cement importer, Augutich Investments (PVT) LTD has taken Finance Minister Mthuli Ncube to court on allegations breaching the law by imposing tax on goods covered under the Common Market for Eastern and Southern Africa (COMESA) after it was taxed on its cement now stuck at Chirundu Border Post. Under the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cement-importer-takes-zimbabwean-government-head-on-for-breaching-comesa-regulations/\">Cement importer takes Zimbabwean government head on for breaching COMESA regulations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "31 May 2025"
        },
        {
            "title": "SRC suspends Zimbabwe Netball Association president",
            "url": "https://www.newzimbabwe.com/src-suspends-zimbabwe-netball-association-president/",
            "content": "By Sports Reporter\n\nTHE Sports and Recreation Commission (SRC) has suspended the Zimbabwe Netball Association (ZINA) president Lecitica Chipandu.\n\nIn a letter SRC said Chipandus suspension comes after an investigation conducted following several allegations against her.\n\nThe Sports and Recreation Commission (SRC) wishes to advise the public and netball stakeholders that the president of the Zimbabwe Netball Association (ZINA) Mrs Leticia Chipandu has been suspended as an official responsible for the stewardship and strategic direction of the Zimbabwe Netball Association, and from all forms of netball administration in Zimbabwe with immediate effect.\n\nThe suspension is as result of the investigations conducted by the SRC on the challenges prevailing within the Zimbabwe Netball Association administration and structures, reads part of SRC press release.\n\nChipandu reigned as the Zimbabwe netball boss since 2007 and is the associations longest serving leader.\n\nDuring her tenure, Chipandu has faced several allegations, amongst them embezzlement of 2019 Liverpool World Cup funds for the players.\n\nSRC further stated that Chipandus suspension shall stand until ZINA holds its next elections.\n\nThis is in terms of Section 30(1)(c)(i) as read with Section 19(a), (b) and (c) and paragraph 23 of the second schedule of the Sports and Recreation Act (Chapter 25:15) and shall subsist until such a time when the next ZINA elections are held, further read SRC letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31061320/ZINA-president-Leticia-Chipandu.webp",
            "description": "<p>By Sports Reporter THE Sports and Recreation Commission (SRC) has suspended the Zimbabwe Netball Association (ZINA) president Lecitica Chipandu. In a letter SRC said Chipandu’s suspension comes after an investigation conducted following several allegations against her. “The Sports and Recreation Commission (SRC) wishes to advise the public and netball stakeholders that the president of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/src-suspends-zimbabwe-netball-association-president/\">SRC suspends Zimbabwe Netball Association president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "31 May 2025"
        }
    ]
}