{
    "news": [
        {
            "title": "Drama as unidentified youths disrupt war veterans press conference",
            "url": "https://www.newzimbabwe.com/drama-as-unidentified-youths-disrupt-war-veterans-press-conference/",
            "content": "By Staff Reporter\n\nThe Zimbabwe National Liberation War Veterans Association (ZNLWVA) press conference in Bulawayo was disrupted by a group of unidentified men who claimed they had booked the same venue for their business.\n\nThe group, which refused to identify themselves, claimed to be from Youth Connect.\n\nWe are not here to provoke anyone, but we are here for our own meeting. We have our own business to attend to, just like you, said the man leading the group.\n\nZNLWVA chairman Ethan Mathibela stated that they had notified the police about the press conference and received approval.\n\nWe have clearance from the police headquarters. I personally delivered the letter, which was accepted by the Commissioner General. Now, I am seeing these guys here, Mathibela said.\n\nAfter the press conference was disrupted, the war veterans moved outside, where Mathibela continued addressing the media under police supervision.\n\nDuring this time, one of the individuals who had disrupted the press conference grabbed Mathibelas ZNLWA branded cap. The man was taken away by police.\n\nMeanwhile, ZNLWVA has notified the police that it will hold a protest this Thursday to draw attention to the economic crisis, demand government accountability, and push for economic freedom, as well as an end to corruption, tribalism, nepotism, and poor governance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/17114027/Ethan-Mathibela-1-1-scaled.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe National Liberation War Veterans Association (ZNLWVA) press conference in Bulawayo was disrupted by a group of unidentified men who claimed they had booked the same venue for their business. The group, which refused to identify themselves, claimed to be from Youth Connect. “We are not here to provoke anyone, but</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drama-as-unidentified-youths-disrupt-war-veterans-press-conference/\">Drama as unidentified youths disrupt war veterans press conference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "High Court indefinitely reserves judgement in journalist Mhlanga’s bail appeal",
            "url": "https://www.newzimbabwe.com/high-court-indefinitely-reserves-judgement-in-journalist-mhlangas-bail-appeal/",
            "content": "By Mary Taruvinga\n\nThe High Court on Monday reserved its ruling after Alpha Media Holdings (AMH) journalist Blessed Mhlanga appealed against a lower courts decision to deny him bail in a case he is accused of transmitting messages inciting public violence.\n\nMhlanga was arrested three weeks ago with the State alleging that he published videos recorded at a press conference held by war veteran Blessed Geza who is opposing an extension of President Mnangagwas tenure.\n\nHe was denied bail by Harare magistrate Farai Gwitima who ruled that he was likely to interfere with witnesses if granted bail.\n\nAggrieved, he took the matter up to the High Court arguing that the lower court erred in denying him bail.\n\nThe accused has given a sensible or plausible defence. At this stage, the accused is entitled to be heard in respect of allegations against him and the defence he deposed, his lawyer Chris Mhike told High Court Judge Gibson Mandaza.\n\nHe was not present at that press conference and has nothing to do with what was said at that press conference.\n\nSecondly he did not transmit what was uttered at that less conference because he is not HSTV.\n\nHe also admits that on YouTube, the ownership of the video was attributed to HSTV. He makes it clear that he is not HSTV. Therefore with these common cause factors, it is difficult to comprehend why the state would in the first place arrest the accused and thereafter allege it has a strong case.\n\nThis case is based on a lie. The lie that my client is HSTV. HSTV is the owner of the content and broadcasts the content.\n\nThe State suggests that the transmission of that relevant video is an uncontroverted fact.\n\nBut the question is who transmitted the videos. It would be unfair to conclude that because the videos were concluded, it was the appellant who transmitted the videos.\n\nIt is not even alleged by the state that the video recordings show the appellant broadcasting or transmitting the videos, Mhike said.\n\nMhike added that the state did not say that Mhlanga was seen sitting on a computer transmitting the video.\n\nThere is no evidence for this and therefore, the state did not give compelling reasons to deny the appellant bail.\n\nMhike also said the words which were quoted as the broadcasted messages were not uttered by Mhlanga but Geza.\n\nIt cannot be a compelling reason to say he is the one who transmitted the words. There is no logical link between my client and the words quoted by the State saying it was words which are inciting violence.\n\nMhike said his client was being punished for something he did not do.\n\nThe onus to prove a strong case is on the state.\n\nThe record of proceedings in the court aquo makes it clear that the video does not pin his presence at the press conference or that he broadcast the press conference. It is clear the arrest was baseless, Mhike said.\n\nMhike said Mhlanga did not challenge remand as it would have prejudiced him by staying in jail for over two weeks.\n\nSo he reluctantly subjected himself to bail proceedings, Mhike said.\n\nThe vast of accused persons are on bail while on remand, why is my client being denied the same when thousands of suspects are on bail?\n\nPlacement on remand is not a conviction. This offence is not scheduled as a serious offence. It is a finable offence.\n\nWhere a fine can be imposed the court should lean in favour of granting bail, Mhike said.\n\nThe magistrate erred by ignoring that the witnesses were not named. How can one interfere with an unknown witness?\n\nThere was no evidence that if the appellant continues to work, he will threaten the security of this nation.\n\nThere is no basis for asserting that the appellant before you would undermine public order or peace and security, he added.\n\nThe offence under review is not a scheduled offence so the magistrate erred in denying the appellant bail on rounds that his release will threaten peace and security in the country.\n\nThe magistrate also made other errors which constitute unfairness in his determination.\n\nThere was no evaluation of other factors such as the appellants cooperation with the police, the act that he presented himself to the police, he flew in from Lusaka specifically to deal with reports that the police wanted to interview him. The magistrate totally ignored that.\n\nFungai Nyahunzvi representing the state said the prosecution abides by its written submissions.\n\nHe said Mhlanga transmitted the messages.\n\nWe did not say he generated the message. For example, if one forwards nude images he will be committing an offence of transmission.\n\nWe are not saying he authored the uttered messages. We are saying he transmitted the messages.\n\nWe are told that challenging placement on remand would have prejudiced the appellant but we dont why this is being said. Thats why courts sit, he said.\n\nWhen you look at the reasons why the accused was denied bail you will see that his case is different from other accused persons. The issue is not that he is a flight risk, we are saying he will interfere with witnesses.\n\nNyahunzvi also said it cannot be contested that Mhlanga is not a senior journalist at HSTV.\n\nThe prosecutor said because of his seniority he was likely to interfere with witnesses who are his subordinates.\n\nBecause he is a presidential correspondent. You cannot have a junior coming from college being assigned as a presidential reporter.\n\nWe still abide by submissions we forwarded to the court, Nyahunzvi added.\n\nThe presiding judge said he will need time to go through the submissions.\n\nQuite a lot of submissions have been made. As soon as Im ready I will put a notice on IECMS, I might put a date and advise parties when to come. It will just be a few days.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Mary Taruvinga The High Court on Monday reserved its ruling after Alpha Media Holdings (AMH) journalist Blessed Mhlanga appealed against a lower court’s decision to deny him bail in a case he is accused of transmitting messages inciting public violence. Mhlanga was arrested three weeks ago with the State alleging that he published videos</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-indefinitely-reserves-judgement-in-journalist-mhlangas-bail-appeal/\">High Court indefinitely reserves judgement in journalist Mhlanga’s bail appeal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "In Tune with the Mind: Women’s Month – Postpartum depression",
            "url": "https://www.newzimbabwe.com/in-tune-with-the-mind-womens-month-postpartum-depression/",
            "content": "By Nqoba M Sibenke\n\nOne of the most beautiful yet challenging seasons of life is pregnancy. There are so many mental health challenges that come with the pre and post-natal seasons. In this article, we explore Postnatal Depression. The DSM-V identifies this disorder as a major depressive disorder with peripartum onset. It falls under depressive disorders and is commonly referred to as Postpartum Disorder (PPD).\n\nThere are many risks associated with PPD, including demographic risk factors, obstetric and medical risk factors, psychological and social risk factors, hormonal and neurobiological risk factors and other risk factors.\n\nWomen under 20 or over 35 years old are highly likely to experience PPD. This is due to age-related constraints in pregnancy and childbirth. It is also likely that women from low-income societies or those with limited education may suffer from PPD. Marital status during the pregnancy also contributes to PPD.\n\nObstetric and Medical Risk Factors also have an influence. If one has a history of depression or anxiety, they might suffer from PPD. Previous traumatic birth experience or complicated delivery also creates risk. Psychological and social risk factors include a lack of social support from family, friends, or a partner. Stressful life events such as moving, job change, or loss of a loved one contribute to PPD.\n\nPrevious traumatic experiences, such as abuse or neglect, can pre-expose women to PPD. Some personality traits, for example, perfectionistic or high-achieving personality traits, are also more inclined towards PPD.\n\nThere are also hormonal and neurobiological risk factors. These include significant hormonal fluctuations during pregnancy and postpartum, Thyroid dysfunction and Neurotransmitter imbalance. Other risk factors include previous substance abuse or addiction, women who have experienced PPD in a previous pregnancy and women with a family history of depression or anxiety.\n\nEmotional symptoms include persistent feelings of sadness, mood swings, apathy, guilt or shame, and anxiety. Physical symptoms are fatigue, change in appetite increase or decrease in eating, sleep disturbances, digestive issues, and pain eg headaches, joint aches, etc.\n\nPPD can be treated through medication, psychotherapy and social interventions. Psychological interventions include Cognitive-Behavioral Therapy (CBT), which helps women identify and change negative thought patterns and behaviors. Psychodynamic therapy explores the emotional and psychological factors contributing to PPD. These can be administered by qualified psychologists. Medications such as antidepressants and mood stabilizers can be prescribed by psychiatrists.\n\nSocial Support Interventions like Peer Support Groups connect women with others who have experienced PPD. Partner support educates partners on how to support their loved ones. Family Therapy Involves the entire family in the healing process.\n\nRemember to take care of your loved ones as they experience this life-changing season. Womens health affects the health of their children and families. It is critical to safeguard them.\n\nNqoba Sibenke is registered with AHPCZ as an intern Counselling Psychologist and can be reached atnqoba.sibenke@icloud.com\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/17074143/postpartum.jpg",
            "description": "<p>By Nqoba M Sibenke One of the most beautiful yet challenging seasons of life is pregnancy. There are so many mental health challenges that come with the pre and post-natal seasons. In this article, we explore Postnatal Depression. The DSM-V identifies this disorder as a major depressive disorder with peripartum onset. It falls under depressive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-tune-with-the-mind-womens-month-postpartum-depression/\">In Tune with the Mind: Women’s Month – Postpartum depression</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "Pope Francis acknowledges fragility in hospital message",
            "url": "https://www.newzimbabwe.com/pope-francis-acknowledges-fragility-in-hospital-message/",
            "content": "By AFP\n\nPOPE Francis acknowledged on Sunday being fragile and facing a period of trial, as he thanked well-wishers for prayers in a message from hospital, where he has been receiving treatment for pneumonia.\n\nThe 88-year-old pope, hospitalised since February 14, sent a particularly personal message to the faithful published by the Vatican, as he once again missed delivering the traditional Angelus prayer in person.\n\nI am sharing these thoughts with you while I am facing a period of trial, and I join with so many brothers and sisters who are sick: fragile, at this time, like me, wrote the pope.\n\nOur bodies are weak but, even like this, nothing can prevent us from loving, praying, giving ourselves, being for each other, in faith, shining signs of hope, he added.\n\nSunday was the fifth time the popes condition had prevented him from personally giving the Angelus prayer, which he usually delivers to the crowd gathered in St Peters Square following mass.\n\nLast week the Vatican signalled the Argentine pontiff was out of danger after a series of breathing crises earlier in his hospitalisation had sparked fears for his life.\n\nOn Saturday, the Vatican said Franciss condition continued to be stable and showing progress, as it has for the past week, but cautioned he still needed therapies to be administered within the hospital.\n\nThe Holy Father still requires hospital medical therapy, motor and respiratory physiotherapy; these therapies, at present, are showing further, gradual improvements, it said.\n\nThat message appeared to quash speculation that the popes progress could signal an imminent release from hospital.\n\nIn his Sunday message  which also called for peace in war-torn countries  Francis once again thanked his caretakers and those who have been praying for him.\n\nHow much light shines, in this sense, in hospitals and places of care! How much loving care illuminates the rooms, the corridors, the clinics, the places where the humblest services are performed! he said.\n\nFrancis is being cared for on the 10th floor of the hospital, home to a special papal suite including a chapel.\n\nAt the entrance of the hospital Sunday morning, dozens of children from a Catholic scout group called out Pope Francis, Pope Francis, as they held yellow and white balloons.\n\nI know that many children are praying for me; some of them came here today to Gemelli as a sign of closeness, Francis wrote in his message.\n\nThank you, dearest children! The pope loves you and is always waiting to meet you.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/17053044/Pope-Francis-Picture-Tiziana-Fabi-AFP.webp",
            "description": "<p>By AFP POPE Francis acknowledged on Sunday being fragile and “facing a period of trial”, as he thanked well-wishers for prayers in a message from hospital, where he has been receiving treatment for pneumonia. The 88-year-old pope, hospitalised since February 14, sent a particularly personal message to the faithful published by the Vatican, as he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pope-francis-acknowledges-fragility-in-hospital-message/\">Pope Francis acknowledges fragility in hospital message</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "Vice President Chiwenga ‘supporters’ allege Mutsvangwa is a treacherous double agent working for the West",
            "url": "https://www.newzimbabwe.com/vice-president-chiwenga-supporters-allege-mutsvangwa-is-a-treacherous-double-agent-working-for-the-west/",
            "content": "By Staff Reporter\n\nVICE President Constantino Chiwengas supporters have jumped to his defence, days after the release of a recording in which Zanu PF spokesperson Christopher Mutsvangwa trashed any chance of him succeeding President Emmerson Mnangagwa.\n\nMutsvangwa, who did not hold back in his scathing analysis of Chiwengas capabilities and lack thereof, has been sensationally accused of working as a spy for hostile foreign nations.\n\nHis comments exposed the worsening factional fights within the ruling party, despite senior members wearing brave faces whenever they are questioned about it.\n\nA shadowy group calling itself General Chiwenga Voluntary Supporters Association (GCVSA) claims to expose and dismantle Mutsvangwa whose mission the military had already unmasked. GCVSA further claims the former Presidential Advisor is a double agent.\n\nThe GCVSA is aware of a recent military intelligence dossier linking Mutsvangwa to espionage activities involving hostile foreign powers, reads the statement signed by the organisations Secretary General Ntokozo Msipha.\n\nThis intelligence confirms what many have long suspectedMutsvangwa is not merely a loudmouth but an active saboteur working to weaken Zimbabwe from within.\n\nHis attacks on General Chiwenga are not personal but part of a broader scheme dictated by those who seek to install puppets in positions of power while eliminating true patriots.\n\nHis masters have sent him on a mission: to undermine the military, to spread falsehoods about national heroes, and to confuse the people with propaganda so that the 2030 succession project can be smoothly implemented.\n\nWe say to him and his handlers: we see you, we know your plans, and you will not succeed.\n\nAn audio recording of Mutsvangwa describing Chiwenga as unelectable, cruel and illiterate was published in an investigation by United Kingdom-based Dug Up, last week.\n\nMutsvangwa highlighted the plight of Chiwengas ex-wife Marry as one of the reasons the former general should not be anywhere near power, a position that falls in line with Mnangagwas 2030 agenda.\n\nCertain sections within Zanu PF want Mnangagwa to hold onto power beyond his 2028 mandate.\n\nSurprisingly, Mutsvangwa, who is now in the cross hairs of the Chiwenga faction, played a central role in the coup that toppled late President Robert Mugabe and installed both Mnangagwa and Chiwenga.\n\nThe people of Zimbabwe are not blind. They see through your deception, Chris Mutsvangwa. You are not a kingmaker. You are not a revolutionary. You are a political scavenger, feeding on the scraps left behind by real leaders.\n\nYour name will be remembered not among the liberators but among the traitors who sold their souls for thirty pieces of silver.\n\nWe issue this final warning: Zimbabwe will not be destabilised by cowards, mercenaries, and political prostitutes masquerading as nationalists. The revolution will not be hijacked.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/20162426/Chris-Mutsvangwa-1.png",
            "description": "<p>By Staff Reporter VICE President Constantino Chiwenga’s supporters have jumped to his defence, days after the release of a recording in which Zanu PF spokesperson Christopher Mutsvangwa trashed any chance of him succeeding President Emmerson Mnangagwa. Mutsvangwa, who did not hold back in his scathing analysis of Chiwenga’s capabilities and lack thereof, has been sensationally</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vice-president-chiwenga-supporters-allege-mutsvangwa-is-a-treacherous-double-agent-working-for-the-west/\">Vice President Chiwenga ‘supporters’ allege Mutsvangwa is a treacherous double agent working for the West</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "Man fatally assaulted for restraining trio from pelting bar patrons",
            "url": "https://www.newzimbabwe.com/man-fatally-assaulted-for-restraining-trio-from-pelting-bar-patrons/",
            "content": "By Staff Reporter\n\nIN an unfortunate incident, a 45-year-old Zhombe man in Kwekwe, Midlands province, who wanted to play peacekeeper, was repeatedly assaulted with bricks until he died.\n\nThis was after the now deceased Shepherd Mavhangira tried to restrain three other men from throwing bricks at imbibers at a beer drinking spot.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident and subsequent manhunt for the attackers, who are now on the run.\n\nPolice in Kwekwe are appealing for information which may lead to the arrest of Kenias Mapfumo, Armstrong Marumahoko and Mathias Tatenda Dhlamini who are being sought in connection with a case of murder which occurred on March 13, 2025, at Mushange Business Centre, Zhombe in which Shepherd Mavhangira (45) died, said Nyathi.\n\nThe suspects allegedly hit the victim with bricks on the forehead, thigh and left bicep and he died on the spot.\n\nThe victim had tried to refrain the suspects from throwing bricks at patrons who were drinking beer at a bar, he added.\n\nZRP is appealing to anyone who might have information that may lead to the arrest of the trio to report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  IN an unfortunate incident, a 45-year-old Zhombe man in Kwekwe, Midlands province, who wanted to play peacekeeper, was repeatedly assaulted with bricks until he died. This was after the now deceased Shepherd Mavhangira tried to restrain three other men from throwing bricks at imbibers at a beer drinking spot. Zimbabwe Republic Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-fatally-assaulted-for-restraining-trio-from-pelting-bar-patrons/\">Man fatally assaulted for restraining trio from pelting bar patrons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "Two killed in dynamites explosion at Kwekwe mine",
            "url": "https://www.newzimbabwe.com/two-killed-in-dynamites-explosion-at-kwekwe-mine/",
            "content": "By Staff Reporter\n\nTWO miners were killed in a devastating explosion at a Kwekwe mine Saturday after one of them unknowingly placed a hot object above hidden explosives, which detonated.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms a tragic incident in which Loveson Nkiwane (41) and Albert Mulima (36) died after an explosion believed to have been caused by heated mine dynamites on March 15, 2025, at Donzic 6 Mine, Kwekwe, said Nyathi.\n\nPreliminary investigations reveal that one of the victims had unknowingly placed a hot iron pick head underground, directly onto a hidden cache of the explosives.\n\nSubsequently, the heat from the pick head ignited the dynamites, causing a devastating explosion which claimed the lives of the victims.\n\nThe ZRP said it is conducting a probe into circumstances surrounding the tragic incident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/12/03195329/Gas-explosion.jpg",
            "description": "<p>By Staff Reporter  TWO miners were killed in a devastating explosion at a Kwekwe mine Saturday after one of them unknowingly placed a hot object above hidden explosives, which detonated. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms a tragic incident in which Loveson Nkiwane (41) and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-killed-in-dynamites-explosion-at-kwekwe-mine/\">Two killed in dynamites explosion at Kwekwe mine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase USA-Canada",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-usa-canada/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. We understand you will be part of the team that will be presenting at theZim Diaspora Property Showcase USA-Canadain Dallas, United States of America, on legal issues affecting diasporansin America and Canada when investing in Zimbabwe. What are we to expect?\n\nVM: Firstly, allow me to thank Seeff Zimbabwe for coming up with the idea of this event and executing it. The exchange of ideas at such events is invaluable.\n\nOur experience in Birmingham, United Kingdom, at the Zim Diaspora Property Showcase UK in July last year taught us that the diaspora property market is hungry for one-on-one interactions with the potential Zimbabwe service provider, specifically those in the real estate sector where most of their investments are housed. This allows for a better understanding of each others operating models.\n\nI am sure my colleagues in the real estate sector of Zimbabwe are preparing something special for the USA and Canada markets at this particular showcase. The attendees will be able to access special deals prepared specifically for the showcase, including structured payment options that the diaspora market normally fails to get access to.\n\nReporter:Are you suggesting that they will be specific deals prepared only for the USA-Canada diaspora market?\n\nVM: Yes.The property showcase is not just to showcase our real estate to the diaspora, it is also to expose the diaspora market to our Zimbabwean businesses. It will be negligent as a business person to use a one size fits all approach in all dealings with the local and various markets in the diaspora.\n\nThe attendees from Zimbabwe will also be using it as a fact  finding conference, to understand the market from that part of the world, their interests, considerations and concerns when investing with the aim to tailor make products that are attractive to that market, taking into consideration their specific needs for a mutually beneficial relationship going forward.\n\nMy understanding is that the organizers of the event will also be intentionally exposing the Zimbabwean real estate businesses to the Dallas real estate sector. It is anticipated that sufficient synergies and networks will be created from that exchange.\n\nREAD MORE: The Premier Zimbabwe Diaspora Property Showcase is coming to the USA!\n\nReporter: What can we expect from your presentation on legal issues affecting property investments?\n\nVM: My mandate at the conference is to educate potential investors on the Zimbabwean legal framework, specifically when it comes to investing in the real estate sector. My presentation will cover a variety of issues, example, the property titles that are in Zimbabwe, how to conduct a due diligence on the various property titles, other legal issues that affect your investment in Zimbabwe, if a member of the diaspora, issues to do with Zimbabwe registered marriages, death et cetera.\n\nIf the investors are foreign, we will also discuss the property investment regulatory framework with the aim of ensuring that the investments are safe and protected and also that the investor is able to repatriate capital and profits on disinvestment.\n\nReporter: Will that include how to avoid being duped when investing in property from the diaspora?\n\nVM: That will be one of the topics in the presentation. The overarching aim of the presentation is to safeguard potential buyers against fraudsters. Our economy is in transition, with a lot of real estate developments mushrooming across our cities. There are notable and significant gains in value on existing real estate as a result of this real estate development boom. This creates a lot of opportunities for investors and also fraudsters.\n\nOur local property developers have also been creative in their fundraising initiatives to complete developments when access to mainstream finance is limited. This, however, motivates for thorough due diligence by professionals to ensure that the development financial and legal structures are sound and also that the investor is sufficiently protected.\n\nReporter: How do you engage a lawyer from the diaspora and track your property transaction?\n\nVM: Most of our lawyers across Zimbabwe can be found online if the investor cannot get a lawyer by reference. If in doubt of the lawyers track record, our Law Society of Zimbabwe is available to assist people with various enquiries on the legal practitioners in Zimbabwe.\n\nReporter: Thank you, Mr. Madzima we have to end here because of our time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor www.mcmlegal.co.zw\n\nFor those looking to attend the Zim Diaspora Property Showcase USA-Canada, please sign up by connecting with the event organizers atwww.zimpropertyshowcaseusa.com.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23072005/SEEFFUK-24145of205-scaled.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. We understand you</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-usa-canada/\">Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase USA-Canada</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "War veterans plot protest against President Mnangagwa",
            "url": "https://www.newzimbabwe.com/war-veterans-plot-protest-against-president-mnangagwa/",
            "content": "By Staff Reporter\n\nWAR veterans, together with other disgruntled citizens, are planning to stage a protest this Thursday, citing Zimbabwes worsening economic meltdown.\n\nEarlier this month, the former liberation struggle combatants vowed to embark on massive protests to force President Emmerson Mnangagwa to resign.\n\nIn a letter written to the Zimbabwe Republic Police (ZRP), the war veterans stated that the planned demonstration aims to draw attention to the economic crisis, demand government accountability, and push for economic freedom, as well as an end to corruption, tribalism, nepotism, and poor governance.\n\nWe, the concerned citizens of Zimbabwe, hereby notify the Joint Operations Command (JOC) of our intention to participate in a peaceful demonstration countrywide.\n\nThis demonstration is a direct response to the current state of the Zimbabwean economy, which has been exacerbated by corruption, tribalism, nepotism, and a lack of governance.\n\nWe wish to emphasise that the demonstration is a constitutional right, as enshrined in the Constitution of Zimbabwe. We are exercising our right to hold the government accountable for the economic meltdown, which has deprived citizens of economic freedom, reads the letter.\n\nThe letter was signed by the Zimbabwe National Liberation War Veterans Association (ZNLWVA) chairman Ethan Matibela.\n\nRecently, the war veterans held a press conference calling for President Mnangagwa to step down immediately, accusing him of failure.\n\nThis followed recent demands by expelled Zanu PF Central Committee member Blessed Geza, a vocal critic of Mnangagwa, who insisted that the President must step aside due to his poor leadership.\n\nGeza is currently in hiding after police launched a manhunt for him over four criminal charges, including undermining the authority of the President and inciting public violence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Staff Reporter WAR veterans, together with other disgruntled citizens, are planning to stage a protest this Thursday, citing Zimbabwe’s worsening economic meltdown. Earlier this month, the former liberation struggle combatants vowed to embark on massive protests to force President Emmerson Mnangagwa to resign. In a letter written to the Zimbabwe Republic Police (ZRP), the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-veterans-plot-protest-against-president-mnangagwa/\">War veterans plot protest against President Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zimbabwe records 124 cholera cases amid latest outbreak",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-124-cholera-cases-amid-latest-outbreak/",
            "content": "By Xinhua\n\nZIMBABWE has recorded 124 confirmed cases of cholera since the latest outbreak started in November last year, Minister of Health and Child Care Douglas Mombeshora said on Friday.\n\nAddressing a press conference in the national capital of Harare, Mombeshora said Zimbabwe has registered 15 confirmed deaths, 608 suspected cases, and 566 recoveries.\n\nSix out of the countrys 10 provinces have been affected, with the bulk of recent cases reported in Mashonaland Central Province, the minister noted.\n\nAccording to Mombeshora, most cases were identified among artisanal miners along the Mazowe River and the small farming town of Glendale in Mashonaland Central Province.\n\nArtisanal miners move from place to place and as they move, they also spread cholera. As a result, we have seen the persistence of cases coming up from Mashonaland Central Province, especially along the Mazowe River where a lot of gold panning is taking place, he said.\n\nWe are looking at the possibility of getting more vaccines because our stocks have run out. We now have about 4,000 doses only left, which are not enough to deal with the affected areas, the health minister added.\n\nMombeshora also revealed that recurring cholera outbreaks continued to hit Zimbabwe, primarily driven by a lack of sustainable water and sanitation infrastructure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/24110127/cholera.webp",
            "description": "<p>By Xinhua ZIMBABWE has recorded 124 confirmed cases of cholera since the latest outbreak started in November last year, Minister of Health and Child Care Douglas Mombeshora said on Friday. Addressing a press conference in the national capital of Harare, Mombeshora said Zimbabwe has registered 15 confirmed deaths, 608 suspected cases, and 566 recoveries. Six</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-124-cholera-cases-amid-latest-outbreak/\">Zimbabwe records 124 cholera cases amid latest outbreak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "17 Mar 2025"
        }
    ]
}