{
    "news": [
        {
            "title": "US court rules in Zimbabwe’s favour over $93m mining dispute",
            "url": "https://www.newzimbabwe.com/us-court-rules-in-zimbabwes-favour-over-93m-mining-dispute/",
            "content": "Bloomberg\n\nA US court has dismissed a case brought by two Mauritian companies seeking to enforce a decade-old arbitration award against a Zimbabwean state-owned miner.\n\nThe US Court of Appeals, District of Columbia Circuit, ordered the case brought by Amaplat Mauritius Ltd. and Amari Nickel against the Zimbabwe Mining Development Corporation (ZMDC) be dismissed, citing a lack of jurisdiction.\n\nThe Mauritian firms approached the US court after the Zimbabwean company ignored an arbitration order and a court ruling to pay.\n\nThe International Court of Arbitration in Zambia in 2014 ordered ZMDC to pay $42.9 million to Amaplat and $3.9 million to Amari, with 5% annual interest, for cancelling a nickel and platinum joint venture in the southern African nation.\n\nThe amount has since risen to $93 million.\n\nIn 2019, the Zambian High Court granted the two companies permission to enforce the arbitration award, which would have allowed them to seize the state miners assets.\n\nZimbabwes Secretary for Mines and Mining Development Pfungwa Kunaka welcomed the outcome.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17163300/mine.jpg",
            "description": "<p>Bloomberg A US court has dismissed a case brought by two Mauritian companies seeking to enforce a decade-old arbitration award against a Zimbabwean state-owned miner. The US Court of Appeals, District of Columbia Circuit, ordered the case brought by Amaplat Mauritius Ltd. and Amari Nickel against the Zimbabwe Mining Development Corporation (ZMDC) be dismissed, citing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-court-rules-in-zimbabwes-favour-over-93m-mining-dispute/\">US court rules in Zimbabwe’s favour over $93m mining dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "War veterans win legal battle for Spring Farm against Billy Rautenbach",
            "url": "https://www.newzimbabwe.com/war-veterans-win-legal-battle-for-spring-farm-against-billy-rautenbach/",
            "content": "By Mary Taruvinga\n\nIn a dramatic turn of events, war veterans from Spring Farm in Goromonzi have emerged victorious in a court case concerning the contentious loss of their land to businessman Billy Rautenbach. This followed the governments cancellation of their offer letters.\n\nSeeking justice, the veterans turned to the High Court after Rautenbach, a business associate of President Emmerson Mnangagwa, assumed control of the land. The courtroom erupted in joy when Judge Regis Dembure of the Harare High Court handed down the ruling on Thursday.\n\nThe judge was critical of Lands Minister Anxious Masuka, chastising him for his irrational and inconsiderate decision to cancel the veterans offer letters. Although the ministry had initially challenged the veterans application, Masuka failed to submit an opposing affidavit, a significant misstep that ultimately led to the cases outcome.\n\nThe court heard that the minister had delegated authority to the permanent secretary, a move that Dembure rejected outright. Striking off the permanent secretarys affidavit, the judge declared that the veterans legal arguments stood unopposed, leading to their victory.\n\nI wish to point out that the law in relation to authority to act is already settled that where authority has been challenged, it will be necessary to produce evidence, said Judge Dembure.\n\nHe emphasised the importance of substantiating claims regarding authority in court.\n\nThe judge added, What is clear is that where the authority of a defendant is put on issue, there will be a need to put evidence of that authority in court. He dismissed the permanent secretarys mere assertion of authority, saying, There is no evidence before me to show that he has authority.\n\nDembure further explained, The act of withdrawal of the offer letter is by the minister and cannot be delegated. The decision is his and he must justify his action.\n\nThe judge also said that the minister is expected by law to make decisions independently, stating, No delegated authority can speak on his behalf.\n\nIn his ruling, the judge noted that the minister only has the power to delegate administrative, not statutory, authority.\n\nIf a decision-maker has failed to depose an affidavit, its inadmissible.\n\nThe judge highlighted that the ministers actions had severely disrupted the veterans livelihood.\n\nHe criticised Masuka for not thoughtfully considering the implications of withdrawing the offer letters.\n\nHe is the one who should have told the court if it was a good intention to withdraw the offer letters and what was his state of mind when he formulated these decisions, Dembure said.\n\nIn the absence of his affidavit, the opposition is clearly a nullity. There is no proper opposition before the court.\n\nConsequently, the opposition was struck out, allowing the case to proceed without challenge.\n\nCritics of the allocation of Spring Farm to Rautenbachs Marimba Residential Properties Limited had raised concerns about potential manipulation and corruption surrounding the land seizure in Mashonaland East Province.\n\nWar veterans expressed alarm when it became known that Rautenbach was granted the deed of transfer for the land on June 5, 2025, prior to the court hearing, while indigenous farmers, including the veterans, had their applications still pending in court.\n\nAs if to heighten tensions, armed guards were deployed around the farm last week, further complicating matters ahead of the judicial proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Mary Taruvinga In a dramatic turn of events, war veterans from Spring Farm in Goromonzi have emerged victorious in a court case concerning the contentious loss of their land to businessman Billy Rautenbach. This followed the government’s cancellation of their offer letters. Seeking justice, the veterans turned to the High Court after Rautenbach, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-veterans-win-legal-battle-for-spring-farm-against-billy-rautenbach/\">War veterans win legal battle for Spring Farm against Billy Rautenbach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "Smile follows sweat — Zimbabwe achieves record tobacco output",
            "url": "https://www.newzimbabwe.com/smile-follows-sweat-zimbabwe-achieves-record-tobacco-output/",
            "content": "Xinhua\n\nAccording to the Tobacco Industry and Marketing Board (TIMB), the sector is witnessing record-breaking sales this year, with farmers already delivering more than 340 million kg of the golden leaf to the market, a significant hike from about 240 million kg last year.\n\nA warm, earthy scent filled the grading shed as workers carefully sorted tobacco leaves at a farm in Beatrice, a rural area in Zimbabwes Mashonaland East Province.\n\nWith practiced hands, they ensured each golden leaf met the high standards demanded by buyers.\n\nOutside, a truck loaded with tightly packed bales rumbled toward the market, trailing dust along the winding country roads.\n\nIn general, this growing season has been a very good one for most tobacco growers, especially the small-scale farmers. They have done exceptionally well, and overall, everyone has had a better yield per hectare than ever before, said Steve Riley, a tobacco farmer who has invested heavily in the crop, one of Zimbabwes most lucrative exports.\n\nUtilizing both rainfall and irrigation facilities at his farm, Riley successfully cultivated quality tobacco on 34 hectares of land last season. The harvest is now being delivered to the market.\n\nIn Zimbabwe, the tobacco marketing season, running from March to August, is a critical period in the agricultural calendar, given the crops role as one of the countrys top economic drivers and export earners.\n\nFor farmers like Riley, the marketing season is the most anticipated time of year, offering the long-awaited opportunity to reap the rewards of months of hard work and commitment in the fields.\n\nThanks to these sustained efforts, Zimbabwes tobacco output is on the rise, further reinforcing the countrys position as Africas leading tobacco producer.\n\nAccording to the Tobacco Industry and Marketing Board (TIMB), the sector is witnessing record-breaking sales this year, with farmers already delivering more than 340 million kg of the golden leaf to the market, a significant hike from about 240 million kg last year.\n\nThis surge in production is attributed to several factors, including favorable rainfall, increased cultivated land, and a rising number of farmers, especially small-scale producers.\n\nTobacco hectarage expanded from 113,000 hectares in the 2023-2024 season to 125,000 hectares in the 2024-2025 season, according to TIMB. The number of registered growers also rose by 11 percent during the same period, reaching 127,311.\n\nFollowing a successful farming and selling season, Riley is already preparing seedlings for the next planting cycle.\n\nWe dont know what the weather is going to bring us next season. It could be a terrible drought, but we plan as if its going to be a decent season, he said.\n\nChina, one of Zimbabwes key trading partners, remains the largest importer of Zimbabwean tobacco, drawn by its high quality.\n\nOurs, in a nutshell, is a bit like the sugar in a cup of tea. It adds the flavor. And they (the Chinese) need the flavor, and Zimbabwean tobacco seems to be the quality theyre really looking for, said Riley.\n\nAccording to statistics from the Chinese Embassy in Zimbabwe, tobacco exports to China increased by 17.3 percent in 2024.\n\nThe growing demand for Zimbabwean tobacco in international markets has spurred employment and economic activity in rural communities where the crop is cultivated. The government and industry stakeholders are now working to boost production, increase local value addition, and grow exports in the coming seasons.\n\nTacla Munemo, a farm head forewoman, said this season has been productive, and preparations for the next season are already in progress.\n\nWe are expecting another yield like this next season. We have to work hard to achieve another bumper harvest and maintain the quality of the tobacco, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17163510/tobacco-.jpeg",
            "description": "<p>Xinhua According to the Tobacco Industry and Marketing Board (TIMB), the sector is witnessing record-breaking sales this year, with farmers already delivering more than 340 million kg of the golden leaf to the market, a significant hike from about 240 million kg last year. A warm, earthy scent filled the grading shed as workers carefully</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smile-follows-sweat-zimbabwe-achieves-record-tobacco-output/\">Smile follows sweat — Zimbabwe achieves record tobacco output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "Pretoria court denies bail to Zimbabwean man accused of raping landlord’s minor daughter",
            "url": "https://www.newzimbabwe.com/pretoria-court-denies-bail-to-zimbabwean-man-accused-of-raping-landlords-minor-daughter/",
            "content": "IOL\n\nThe Atteridgeville Magistrates Court in Pretoria has denied bail to a 55-year-old Zimbabwean national based in Saulsville, who was charged with three counts of raping his landlords 12-year-old daughter.\n\nThe horrific rape incidents allegedly happened in March.\n\nThe NPAs firm opposition to bail underscores its unwavering commitment to combating gender-based violence (GBV) and protecting vulnerable children, said the National Prosecuting Authority (NPA) Gauteng regional spokesperson, Lumka Mahanjana.\n\nThe name of the alleged rapist has been withheld to protect the identity of the minor victim.\n\nMahanjana explained that the accused man had been a tenant at the girls family home in Saulsville for 12 years as of March.\n\nHe allegedly called the 12-year-old girl to his back room in the yard on three separate occasions, raped her, and gave her money ranging from R24 to R50 to buy kotas.\n\nOn 25 June 2025, in the evening, while the complainant (the young girl) was on the phone in the house, her mother asked her who she was talking to, and when she could not respond, the mother requested to go through her phone. While going through the phone, she saw conversations where the accused (tenant) was asking the complainant when she will be going on her periods, said Mahanjana.\n\nThe mother confronted the tenant in his back room, where he denied the allegations and requested that they take the child to Kalafong Hospital in Tshwane for examination.\n\nWhile at the hospital during examination, one of the nurses called the police, and the accused was arrested on the scene.\n\nDuring the bail hearing, the accused, through his legal representative, asked to be released on bail, claiming that the states case was weak and citing his responsibilities to support his wife and six children. He further stated that, as a self-employed individual, detention would hinder his income and ability to afford legal fees, said Mahanjana.\n\nHowever, state prosecutor Katlego Manana opposed bail, arguing the severity of the charges and the high prevalence of such offences in the courts jurisdiction.\n\nManana highlighted the risk of the Zimbabwean man interfering with the investigation, due to his familiarity with the victim and her mother.\n\nThe prosecution also noted the accused mans lack of immovable property in South Africa, increasing the likelihood of him evading trial.\n\nThe magistrate said the Zimbabwean man did not produce any proof that he is self-employed and that there is no evidence that shows whether he stays with his family in the country or has left them in Zimbabwe.\n\nThe magistrate added that in his bail application, the accused man only listed his responsibilities and no substantial circumstances.\n\nMoreover, the magistrate said if the accused suffers financially while in custody and cannot afford a legal representative, he can apply for Legal Aid. Therefore, bail was denied.\n\nMeanwhile, the National Prosecuting Authority in Gauteng has welcomed the courts decision, commending the vigilance of the victims mother, whose swift action led to the tenants arrest.\n\nThe NPA also saluted the vigilant staff at Kalafong Hospital who facilitated police involvement.\n\nActing Director of Public Prosecutions in Gauteng, advocate Marika Jansen Van Vuuren has also commended prosecutor Manana for the fight against the accused mans bail bid.\n\nThe denial of bail sends a clear message: the NPA will vigorously oppose release for those accused of heinous GBV crimes, prioritising the safety of victims and communities, she said.\n\nThe NPA urges families and communities to remain vigilant, report suspected abuse promptly, and support survivors throughThuthuzela Care Centres (TCCs), which offer medical, psychological, and legal assistance.\n\nThe NPA has called on South Africans to unite against gender-based violence, fostering safe environments where childrens constitutional rights to dignity and safety are upheld, and perpetrators face the full might of the law.\n\nThe case against the Zimbabwean man was postponed to 23 July for regional court allocation.\n\nLast year,IOL reported that a32-year-old Olievenhoutbosch father was found guilty of the rapeand attempted murder of his 11-month-old daughter, as well as defeating the ends of justice in the High Court in Pretoria.\n\nAt the time, the NPA said the father and the mother of the baby were in a love relationship, and on the evening of April 30, 2023, the couple was at their place of residence when a neighbour came and asked the mother to come and help her cook.\n\nThe neighbour who asked for help was hosting an overnight ceremony. The childs mother then departed with the neighbour, leaving the baby under the guardianship of her father.\n\nThe following day, in the early hours of the morning, while the mother was still assisting the neighbour, she saw her partner on the streets. When she asked about the whereabouts of the baby, he told her that he had left the baby sleeping, Mahanjana said at the time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17164539/Screenshot-2025-07-17-at-17.45.08.png",
            "description": "<p>IOL The Atteridgeville Magistrate’s Court in Pretoria has denied bail to a 55-year-old Zimbabwean national based in Saulsville, who was charged with three counts of raping his landlord’s 12-year-old daughter. The horrific rape incidents allegedly happened in March. “The NPA’s firm opposition to bail underscores its unwavering commitment to combating gender-based violence (GBV) and protecting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pretoria-court-denies-bail-to-zimbabwean-man-accused-of-raping-landlords-minor-daughter/\">Pretoria court denies bail to Zimbabwean man accused of raping landlord’s minor daughter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "PEPFAR keeps millions of people with HIV alive and may be spared from Trump spending cuts",
            "url": "https://www.newzimbabwe.com/pepfar-keeps-millions-of-people-with-hiv-alive-and-may-be-spared-from-trump-spending-cuts/",
            "content": "AP\n\nThe program known as PEPFAR is one of the most effective and popular U.S. foreign aid projects in history, and the government says it has saved the lives of over 25 million people around the world with HIV.\n\nBut despite years of bipartisan support, PEPFAR has faced a severe threat as the Trump administration dismantles most U.S. foreign aid.\n\nPEPFAR on Tuesday appeared to be spared a $400 million cut as Republicans acted in rare defiance of a request by President Donald Trump. But governments, health experts and people with HIV around the world are alarmed by the effects of other U.S. aid cuts and chaos that are already disrupting the crucial supply of HIV drugs  which are meant to be taken daily.\n\nHeres a look at PEPFAR and how it affects millions of people globally.\n\nToday, many babies are born infection-free to mothers with HIV  the U.S. State Department says PEPFAR has been responsible for 5.5 million such births  and most people around the world no longer see an infection as a death sentence.\n\nGovernments in Africa and elsewhere had even begun to worry about complacency as people, especially youths, took the widespread availability of HIV drugs for granted. In another significant step forward, the U.S. Food and Drug Administration recently approved for use the worlds only twice-a-year shot to prevent HIV.\n\nBut the abrupt U.S. aid cuts have health officials in developing countries warning of a return to the early days of the AIDS pandemic, when drugs were nonexistent or severely limited and clinics were filled with the dying. PEPFAR was launched in 2004 in response to those grim scenes.\n\nAlso known as the U.S. Presidents Emergency Plan for AIDS Relief, the program has partnered with nonprofit groups to provide HIV medication  including the preventative PrEP  to millions around the world. It has strengthened national health care systems, cared for children orphaned by AIDS and provided job training for people at risk. It has played an important role in testing for and tracking HIV infections.\n\nHIV/AIDS has no cure, and it has killed over 40 million people globally over the years. Now the U.N. agency on AIDS is warning that analysis suggests 4 million additional AIDS-related deaths between now and 2029, including 300,000 additional childrens deaths, if programs permanently lose PEPFARs support.\n\nSince PEPFARs creation by Congress and Republican President George W. Bush, the program has largely enjoyed support across the political spectrum  and gratitude from countries whose health systems have been poorly equipped to care for millions with HIV.\n\nBut misinformation has crept in. The Heritage Foundation, an influential conservative Washington think tank, accused the Biden administration of using PEPFAR to promote its domestic radical social agenda overseas. Conservatives claimed there were efforts to integrate abortion with HIV/AIDS prevention, a claim the Biden administration denied. Similar claims linger under the Trump administration.\n\nTrump and his officials also claim widespread waste and fraud as they seek to dismantle U.S. foreign aid. But PEPFAR has been repeatedly scrutinized. Last year, the government said the State Departments Office of Inspector General had conducted 80 audits, inspections, and special reviews that included oversight of PEPFAR programs, including 21 thematic reviews and audits specifically focused on PEPFAR.\n\nThe $400 million proposed cut to PEPFAR still could be restored, in part or in full, as the bill on spending cuts faces a final vote in the Senate, a vote in the House of Representatives and Trumps signature before a Friday deadline.\n\nWe must stay vigilant, International AIDS Society President Beatriz Grinsztejn said in a statement Wednesday after PEPFAR appeared to be spared.\n\nNo matter what, countries and health experts say it will be impossible to fill the funding gap left by the overall U.S. withdrawal of billions of dollars in aid for the global HIV response, including via PEPFAR.\n\nLast month, a UNAIDS report said the abrupt cuts have destabilized supply chains, led to the closure of health facilities, left thousands of health clinics without staff, set back prevention programs, disrupted HIV testing efforts and forced many community organizations to reduce or halt their HIV activities.\n\nSouth Africa, where more people live with HIV than anywhere else in the world, has said 12 specialized HIV clinics that were funded by the U.S. have had to close down and over 8,000 health workers in its national HIV program are out of work.\n\nNow health workers there and elsewhere are trying to track down an unknown number of people who have lost access to HIV medication. The stakes are deadly. Stopping the drugs allows the virus to start multiplying again. HIV can rebound to detectable levels in peoples blood in just a few weeks, putting sexual partners at risk. The virus could even become drug-resistant.\n\nIt has really been hectic for us, said Mbonisiwe Hlongwane, manager of the HIV program at the Bertha Gxowa public hospital in Germiston, east of Johannesburg. And the uncertainty only continues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17164222/pepfar.webp",
            "description": "<p>AP The program known as PEPFAR is one of the most effective and popular U.S. foreign aid projects in history, and the government says it has saved the lives of over 25 million people around the world with HIV. But despite years of bipartisan support, PEPFAR has faced a severe threat as the Trump administration</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pepfar-keeps-millions-of-people-with-hiv-alive-and-may-be-spared-from-trump-spending-cuts/\">PEPFAR keeps millions of people with HIV alive and may be spared from Trump spending cuts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "Mudzuri is wayward – Mwonzora’s MDC-T says as fight for party’s crumbs continues",
            "url": "https://www.newzimbabwe.com/mudzuri-is-wayward-mwonzoras-mdc-t-says-as-fight-for-partys-crumbs-continues/",
            "content": "By Darlington Gatsi\n\nMOVEMENT for Democratic Change (MDC-T) has labelled its vice president, Elias Mudzuri, wayward following skirmishes at the partys headquarters in Harare on Thursday.\n\nMDC-T officials were heavily guarded by riot police and party youths on Thursday, blocking an address by Mudzuri, who is challenging the legitimacy of Douglas Mwonzoraelected to lead the opposition party in 2022.\n\nThe clashes are the latest in a series of power wrangles within the opposition party, which has faced turbulence since the death of its leader, Morgan Tsvangirai in 2018.\n\nMwonzoras spokesperson, Lloyd Damba, said Mudzuri has no basis to return to the MDC-T as he has since formed another party.\n\nAs you know we held our Ordinary Congress in 2022 and Mudzuri due to his power-hungry nature approached the courts to have our Congress nullified, basing his argument that the Womens Assembly Congress was not held but apparently they were also delegates at the same Congress.\n\nThe High Court ruled in his favour, and we appealed to the Supreme Court. effectively. Our appeal suspends the High Court Ruling. He then insists that the party has no leader but if we are to implement the High Court ruling it means the default position is that we fall back to the Extraordinary Congress position.\n\nWhere Senator Mwonzora was elected President and Komichi returns his chairman position and Mudzuri as Deputy National chairman, but unfortunately, Komichi has already formed his party so automatically he has lost his right to return his position, said Damba.\n\nMudzuri and other disgruntled MDC-T members won their court challenge seeking to nullify Mwonzoras 2022 election as party leader. The High Court ordered the MDC-T to return to pre-election structures and convene an extraordinary congress. Mwonzora has since filed an appeal with the Supreme Court.\n\nDamba said Mudzuris latest actions were disruptive, coinciding with the Epworth by-election campaign.\n\nUnfortunately, our case us still before the courts and please note that it is not us who approached the courts but its them, so we are simply pursuing the legal route that they initiated.\n\nUnfortunately, Mudzuri is so wayward that he called for a press conference today, and nobody knows what he wanted to announce.\n\nThe MDC is a party with a constitution and all meetings are structured around certain office bearers, not the chaotic manner in which he wants to do it and he decided to do it at a time we are campaigning in Epworth North Ward 6 By Election. He intends to disrupt our by-election campaign so that Zanu-PF wins the seat, said Damba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Darlington Gatsi MOVEMENT for Democratic Change (MDC-T) has labelled its vice president, Elias Mudzuri, “wayward” following skirmishes at the party’s headquarters in Harare on Thursday. MDC-T officials were heavily guarded by riot police and party youths on Thursday, blocking an address by Mudzuri, who is challenging the legitimacy of Douglas Mwonzora—elected to lead the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudzuri-is-wayward-mwonzoras-mdc-t-says-as-fight-for-partys-crumbs-continues/\">Mudzuri is wayward – Mwonzora’s MDC-T says as fight for party’s crumbs continues </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "In Pictures: Zimbabwe successfully performs open-heart surgeries on 10 children",
            "url": "https://www.newzimbabwe.com/in-pictures-zimbabwe-successfully-performs-open-heart-surgeries-on-10-children/",
            "content": "ZIMBABWE has successfully conducted open-heart surgeries on 10 children during a week-long medical camp at Parirenyatwa Hospital.\n\nBelow are some images captured at the hospital.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17172701/1000775988.jpg",
            "description": "<p>ZIMBABWE has successfully conducted open-heart surgeries on 10 children during a week-long medical camp at Parirenyatwa Hospital. Below are some images captured at the hospital. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-zimbabwe-successfully-performs-open-heart-surgeries-on-10-children/\">In Pictures: Zimbabwe successfully performs open-heart surgeries on 10 children</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        }
    ]
}