{
    "news": [
        {
            "title": "What is at stake in Malawi’s elections?",
            "url": "https://www.newzimbabwe.com/what-is-at-stake-in-malawis-elections/",
            "content": "BBC\n\nThe people of Malawi are set to vote for their next leader, following a turbulent five years involving economic turmoil, natural disasters and the shock death of the nations vice-president.\n\nCurrent President Lazarus Chakwera is vying for a second term, his main rival being Peter Mutharika, an octogenarian who has also held office in the southern African nation once before.\n\nTransparency and fairness are key talking points ahead of the vote, given that the result of Malawis 2019 presidential election was overturned in the courts due to widespread irregularities.\n\nPolling day is Tuesday 16 September 2025.\n\nThe 7.2 million registered voters will be taking part in three elections:\n\nAFP/Getty Images Lazarus Chakwera (L) and Peter Mutharika (R) have faced each other at the ballot before\n\nAmong the 17 hopefuls there are two clear front-runners.\n\nChakwera and Mutharika will square off against each other at the polls for the fourth time  though the third time ended up not counting.\n\nMutharika first defeated Chakwera in 2014, but when he was declared winner over Chakwera in the next election in 2019 the result was annulled. Chakwera won the re-run the following year.\n\nLazarus Chakwera  Malawi Congress Party (MCP)\n\nChakwera, a former theology lecturer and preacher, had no political experience when he emerged as leader of the MCP in 2013.\n\nWhen he ran for president in 2014 he was unsuccessful, but in 2020 he triumphed,beating the incumbent, Mutharika, in that unprecedented re-run.\n\nChakweras time in office has been marred by economic turmoil and allegations of corruption. The 70-year-old did, however, reintroduce train services in Malawi for the first time in over three decades. He has also overseen major road construction across the country.\n\nPeter Mutharika  Democratic Progressive Party (DPP)\n\nMutharika, an 85-year-old former lawyer and law lecturer, led Malawi from 2014 to 2020.\n\nHe is the brother of the late President Bingu wa Mutharika, who died in office in 2012.\n\nLike Chakwera, Mutharika is also burdened by corruption allegations and links to economic crises. However, his supporters would argue that the current high inflation rate (around 27%) is proof that Mutharika managed the economy better than his successor.\n\nMutharikas age may count against him this election  speculation about his health is rife, especially as he has rarely been seen out in public during the campaign period.\n\nOther contenders garnering attention are former presidentJoyce Banda(Peoples Party), current Vice-PresidentMichael Usi(Odya Zake Alibe Mlandu)and former reserve bank governorDalitso Kabambe(UTM).\n\nThe economy\n\nMalawi has long been one of the poorest countries in the world, butthe past few years have been especially punishing.\n\nThe country wasdevastated by Cyclone Freddythat killed hundreds of people in 2023, then a drought swept across southern Africa the following year. Food prices skyrocketed due to a short supply of crops, pushing many Malawians into extreme poverty.\n\nEconomists also put Malawis current inflation problems partly down to the shortage of foreign currencies  known as forex  in the banks.\n\nIn addition, Malawi has beenforced to devalue its currencyand was recently crippled by fuel shortages and nationwide power outages.\n\nCorruption\n\nWhen Chakwera came to power, he vowed to to clear the rubble of corruption that has long plagued Malawian politics. His administration says it has excelled in this area, but critics  including the influential Catholic Church  say this is not the case.\n\nScepticism was sparked last year when the director of public prosecutions dropped corruption charges against high-profile figures.\n\nAdditionally, Malawis anti-graft agency, the Anti-Corruption Bureau (ACB), has been without a director since former boss Martha Chizuma left more than a year ago.\n\nTo some, the failure to appoint a new head actively hinders the fight against corruption.\n\nBut previous administrations have also been dogged by graft allegations. For instance, the ACBaccused Mutharika of receiving a kickback from a contractto supply food to the police  he denied any wrongdoing.\n\nBandas reputation was dented by a scandal dubbed cashgate which happened under her watch. She was cleared by the ACB of any wrongdoing.\n\nThe former vice-presidents death\n\nIn June last year, Vice-PresidentSaulos Chilima died in a plane crash. Popular with the youth, Chilima led the UTM party and could have been a key contender in the upcoming elections, especially as he had fallen out with the president.\n\nAlthough two investigations  one carried out by Germanys aviation accidents agency and another by a Malawi government-appointed commission  did not find evidence of foul play, some Malawians remain suspicious of the authorities.\n\nOpposition parties have been fuelling this scepticism during their campaigns, referring to Chakweras party as the Chikangawa Party (Chikangawa Forest being the site of the plane crash).\n\nAFP/Getty Images Hundreds in Malawi lost their lives to Cyclone Freddy\n\nMalawi was governed by the MCP from its independence in 1964 until the countrys first multi-party poll in 1994.\n\nSince the shift from a one-party state, the United Democratic Front, the DPP, the Peoples Party and the MCP have all enjoyed stints in power.\n\nChakweras victory with the MCP in 2020 was one of the most significant moments in the countrys political history.\n\nA general election had taken place the year before and Mutharika was declared the winner.\n\nHowever,the Constitutional Court annulled the election, saying there had been widespread tampering, including the use of Tipp-Ex correction fluid on results sheets.\n\nJudges ordered a re-run for 2020, and Chakwera won with 59% of the vote after having teamed up with Chilima.\n\nAlthough Mutharika branded the re-run unacceptable, the Constitutional Court gained international acclaim for safeguarding democracy and refusing to be influenced by presidential power.\n\nFollowing the controversy of the 2019 election, Malawi implemented a new system, where a candidate must gain more than 50% of the total votes to win the presidency in the first round.\n\nThere is a strong possibility that this years candidates will not reach this threshold in the initial poll, meaning a run-off election will have to be held.\n\nThe MCP and DPP will likely try to bring other, smaller parties on board in order to secure a majority in the second time round.\n\nThe courts actions following the 2019 vote have given some Malawians faith in the electoral process.\n\nHowever, over the past months, a number or civil society organisations and opposition parties have accused the electoral commission of favouring the MCP, alleging that its top management has links to the governing party. The commission has firmly denied being biased.\n\nA protest in June calling for the resignation of the commissions top officials was attacked by masked, machete-wielding men, leading to concerns about freedom of expression in the run-up to the election.\n\nThe assault was not an isolated incident  there have been numerous reports of politically motivated violence ahead of the general election.\n\nThe outcome of the presidential election will be announced by the end of 24 September.\n\nThe parliamentary results will be announced by the end of 30 September.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01184956/malawi-election.webp",
            "description": "<p>BBC The people of Malawi are set to vote for their next leader, following a turbulent five years involving economic turmoil, natural disasters and the shock death of the nation’s vice-president. Current President Lazarus Chakwera is vying for a second term, his main rival being Peter Mutharika, an octogenarian who has also held office in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-is-at-stake-in-malawis-elections/\">What is at stake in Malawi’s elections?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Kaya fires Sol Phenduka over ‘misogynistic remarks’ about Minnie Dlamini",
            "url": "https://www.newzimbabwe.com/kaya-fires-sol-phenduka-over-misogynistic-remarks-about-minnie-dlamini/",
            "content": "SowetanLive\n\nKaya 959 has officially fired radio personality Sol Phenduka as co-host of the breakfast show after misogynistic remarks were made about media personality Minnie Dlamini onPodcast and Chill with MacG.\n\nPhenduka was the co-host of #SizTheWorld breakfast show with Sizwe Dhlomo.\n\nIn a lengthy statement released on Monday, Kaya 959 acting managing executive, Dave Tiltmann, confirmed that the station had terminatedPhendukas contract with immediate effect after an internal review.\n\nKaya 959 cannot and will not condone comments made on the MacG Vodcast, where Sol Phenduka is an integral part of the presenting team, saidTiltmann.\n\nMisogynistic remarks made about actress Minnie Dlamini were unacceptable and inconsistent with respect owed to women. As a content provider of our flagship breakfast show, his alignment with comments made on the vodcast does not reflect who we are as a station, nor what our listeners expect of us.\n\nPhenduka was placed under suspension on August 20 pending the outcome of an internal process.\n\nTiltmann added that the incident was a further material breach of his Independent Contract, despite Sols written assurance to Kaya management in June 2023 that such conduct would not recur, while acknowledging his responsibilities as a representative of the station, apologising to the Kaya family and stakeholders, and committing to upholding the standards expected of him.\n\nTiltmann reiterated Kaya 959s values are not open to compromise.\n\nTrust, integrity, accountability, respect, and inclusivity are the foundations of Kaya 959. They guide everything we do on air, online and off air. We are answerable to our listeners, and when conduct falls short, we act decisively, Tiltmann said.\n\nTiltmann further explained that the decision followed a process aligned with Kaya 959s Independent Contractor Agreement, which allows for immediate termination in cases where the actions of an individual with a public profile bring the station into disrepute. Kaya 959 remains committed to maintaining a safe, respectful, and inclusive working environment, supported by rigorous broadcasting standards and a culture of accountability across all platforms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20183902/sol-phenduka.jpg",
            "description": "<p>SowetanLive Kaya 959 has officially fired radio personality Sol Phenduka as co-host of the breakfast show after “misogynistic remarks” were made about media personality Minnie Dlamini on Podcast and Chill with MacG. Phenduka was the co-host of #SizTheWorld breakfast show with Sizwe Dhlomo. In a lengthy statement released on Monday, Kaya 959 acting managing executive, Dave</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kaya-fires-sol-phenduka-over-misogynistic-remarks-about-minnie-dlamini/\">Kaya fires Sol Phenduka over ‘misogynistic remarks’ about Minnie Dlamini</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "New report finds that Southern Africa has become a hub for organised crime",
            "url": "https://www.newzimbabwe.com/new-report-finds-that-southern-africa-has-become-a-hub-for-organised-crime/",
            "content": "IOL\n\nEast and Southern Africa is regarded as a central component for organised crime, which connects regional criminal markets to global networks.\n\nThis was revealed in the Global Initiative report, which stated that the region serves as a thriving source, hub and conduit for a wide variety of illegal commodities.\n\nThese criminal syndicates operate from the shores of Somalia to border crossings and international air and sea points in Ethiopia, Kenya, Tanzania, Mozambique, Zimbabwe, South Africa and Namibia.\n\nFor example, heroin trafficked from Afghanistan via Pakistan and Iran, is shipped across the Arabian Sea and Indian Ocean by boat before it is deposited in the northern Mozambique and Tanzania.\n\nThere, according to the report titled Mapping Organised Criminal Economies in East and Southern Africa, it splits into two primary supply lines: One of higher purity bound for international markets in Europe and Australia, and another that is significantly adulterated and consumed in towns and villages across the East and Southern Africa.\n\nAccording to the report, rhino is smuggled from Johannesburg and Addis Ababa, routed through Dubai and Doha and sometimes Paris and London to throw off law enforcement.\n\nIvory departs in shipping containers from ports in Der es Salaam, Nampula and Durban, ending up in Singapore, Sihanoukville, Huangpu and Haiphong.\n\nGold is mined illegally in Zimbabwes mineral-rich Kwekwe gold fields and deep shaft mines in the towns of Krugersdorp, Carletonville, Klerksdorp and Welkom in South Africa. It is processed and eventually laundered through Dubai.\n\nThe report added that gold is also smuggled by the tonne into countries along the strife-torn Democratic Republic of Congo (DRC)s eastern border and laundered through Rwanda, Burundi, Uganda, Tanzania and the United Arab Emirates (UAE).\n\nIn the northern Mozambique and KwaZulu-Natal province, Islamic State-aligned insurgents and supporters have been implicated in criminal economies, gold smuggling, and kidnapping and extortion schemes to raise funds.\n\nThe region has attracted a coterie of international criminal players, according to the report.\n\nFor instance, networks from China, Pakistan and Iran are known to interface with African intermediaries for drug trafficking (drug precursor chemicals, methamphetamine and heroin) and wildlife smuggling (notably of abalone and ivory). In Southern Africa, Nigerian and Congolese syndicates, often operating from hubs such as Johannesburg, coordinate regional drug distribution and financial fraud schemes while also connecting to global diaspora networks.\n\nThe report added that this chaotic mixture of different criminal commodities and networks is, in many ways, shaped by geography and coalesces around a spiders web of regional hubs and economic centres.\n\nEnvironmental, social and regional dynamics in hinterlands allow warlords and smugglers to thrive, while bustling trade hubs provide cover for clandestine flows and access to key transport links.\n\nIn urban slums, neglected towns and remote rural communities, criminal actors and parallel illicit economies rapidly fill the void left by an often absent state. Ancient trade and migratory routes over mountains and along rivers and coastlines that long pre-date colonial borders allow for the largely untrammelled movement of people and goods, both licit and illicit. This means many of these trafficking networks and criminal groups are found concentrated in certain illicit hubs, reads the report.\n\nCrime expert at the Institute for Security Studies (ISS), Willem Els, added that poor governance is one of the reasons behind the challenges in the region andallows the situation to get out of control.\n\nIf you look at criminality levels, you will see that South Africa is number one in the region and number three in the continent. It is also number seven in the world. That means we created an environment that is conducive for organised crime to thrive. And one of the main factors is the State-embedded actors because none of these criminal syndicates can effectively survive without the protection of politicians and without the compromising of senior officials, Els said.\n\nHe said South Africa is rapidly approaching a failed State scenario where the rule of law is completely crumbled.\n\nSouth Africa is also suffering because of corruption, infrastructure, weak border controls and financial systems, and criminals are exploiting that, he said.\n\nThe report added that the Gauteng province is arguably the most significant organised crime hub in Southern Africa.\n\nAs the regions economic heart, with excellent transport links (notably airports and highways) and financial infrastructure, Johannesburg attracts many criminal enterprises. It is a crucial distribution centre for drugs (heroin arriving from East Africa and cocaine direct from Latin America or via West Africa) destined for local consumption or re-export.\n\nSouth African law enforcement notes that domestic and foreign drug trafficking syndicates converge in Johannesburg  for instance, Nigerian networks base themselves there to manage Southern African operations and South Asian cartel operatives have been detected collaborating with local crime bosses.\n\nJohannesburg is also a central hub for human smuggling and trafficking rings: victims from poorer African countries (including Malawi, Mozambique and Lesotho) are brought to the citys informal brothels and labour markets, while the citys international airport serves as a transit point for traffickers moving people to Europe or the Middle East.\n\nCape Town, according to the report, is a hub for the narcotics trade, a market associated with gang activity, while Northern KwaZulu-Natal is a strategic location.\n\nWeak border controls and existing criminal networks make it a prime hub for various forms of organised crime.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01084108/organised-crime.png",
            "description": "<p>IOL East and Southern Africa is regarded as a central component for organised crime, which connects regional criminal markets to global networks. This was revealed in the Global Initiative report, which stated that the region serves as a thriving source, hub and conduit for a wide variety of illegal commodities. These criminal syndicates operate from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-report-finds-that-southern-africa-has-become-a-hub-for-organised-crime/\">New report finds that Southern Africa has become a hub for organised crime</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Foreign national arrested for stealing US$16,000 from motor vehicle",
            "url": "https://www.newzimbabwe.com/foreign-national-arrested-for-stealing-us16000-from-motor-vehicle/",
            "content": "By Staff Reporter\n\nDETECTIVES in Harare have arrested a foreign national for allegedly stealing US$16,000 from a parked motor vehicle while the owner was shopping.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.On August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.The suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.The suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nOn August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.\n\nThe suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nThe suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.\n\nThe detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nThe detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/13180829/Crime.jpg",
            "description": "<p>By Staff Reporter  DETECTIVES in Harare have arrested a foreign national for allegedly stealing US$16,000 from a parked motor vehicle while the owner was shopping. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “On August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/foreign-national-arrested-for-stealing-us16000-from-motor-vehicle/\">Foreign national arrested for stealing US$16,000 from motor vehicle </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Globe-trotting Mnangagwa to attend Chinese war commemorations",
            "url": "https://www.newzimbabwe.com/globe-trotting-mnangagwa-to-attend-chinese-war-commemorations/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa is expected to arrive in China this Monday to attend commemorations to mark the 80th Anniversary of the Victory in the Chinese Peoples War of Resistance Against Japanese Aggression and World Anti-Fascist War set for Wednesday.\n\nChina is Mnangagwas latest foreign destination to cap the month of August that saw the Zanu PF leader clocking hours on end while airborne.\n\nOn August 20, Mnangagwa travelled to Tokyo, Japan, where he met with Japanese Prime Minister Shigeru Ishiba on the sidelines of TICAD 9. He reportedly discussed strengthening cooperation in trade, health, agriculture, mining, investment, technologyincluding milestones like ZIMSAT1and reaffirmed commitment to deepen ZimbabweJapan relations.\n\nOnly last week, the 82-year-old Zanu PF leader met with His Holiness Pope Leo XIV at the Vatican, where they reflected on the Catholic churchs vital role in Zimbabwes schools, hospitals, and social services, and shared views on peace and justice in todays world.\n\nBefore the jetleg could subside, Mnangagwa, whose initial days in office were toned around austerity to cut on spending on foreign travel, he was off to the East this Sunday.\n\nAccording to State media, Mnangagwa is expected to join fellow invited Heads of State and Government from 26 countries, including Russian President Vladimir Putin, at Tiananmen Square for a massive military parade among other activities hosted by China for the commemorations.\n\nThe Chinese Peoples War of Resistance Against Japanese Aggression (1931-1945) was the first to break out and lasted the longest in the World Anti-Fascist War.\n\nAccording to reports, in 14 years, 35 million Chinese were killed or wounded. Japan officially surrendered on September 2, 1945 by signing the Instrument of Surrender.\n\nIn 2014, Chinas national legislature designated September 3 as Victory Day of its War of Resistance.\n\nA year later, the country held its first-ever large-scale parade at Tiananmen Square to mark the occasion.\n\nState media quoted Zimbabwes Ambassador to China, Abigail Shoniwa, saying President Mnangagwa, who left the Vatican last night, is one of a few African leaders invited to the event, signalling deep ties between Harare and Beijing.\n\nThe Presidents arrival is awaited and we are very excited, he is coming at the invitation of his counterpart, President Xi Jinping and he will be one of quite a number of Heads of State that are coming.\n\nPerhaps, I can take the opportunity to add that he is one of the very few African Heads of State coming, Shoniwa told State media.\n\nWhile in China, Mnangagwa is billed to hold bilateral talks with President Xi on deepening co-operation across various sectors.\n\nThe octogenarian leader will also dialogue with company executives with business interests in Zimbabwe.\n\nChina has supported Zimbabwes various local projects, including Hwange Units 7 and 8 expansion, Kariba South Hydro Power Extension, expansion of the Robert Gabriel Mugabe and Victoria Falls International Airports.\n\nChina is Zimbabwes largest source of investment with cumulative investments exceeding US$4,4 billion, including US$400 million in the past year alone. In 2024, bilateral trade surged to US$3,8 billion with 24 percent year-on-year growth.\n\nLast month, Mnangagwa presided over the signing ceremony of a US$55 million Economic and Technical Co-operation Agreement between Zimbabwe and China in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter  PRESIDENT Emmerson Mnangagwa is expected to arrive in China this Monday to attend commemorations to mark the 80th Anniversary of the Victory in the Chinese People’s War of Resistance Against Japanese Aggression and World Anti-Fascist War set for Wednesday. China is Mnangagwa’s latest foreign destination to cap the month of August that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/globe-trotting-mnangagwa-to-attend-chinese-war-commemorations/\">Globe-trotting Mnangagwa to attend Chinese war commemorations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Labour Ministry officials accused of ignoring court ruling in dispute involving NEC Medical and Allied Industry",
            "url": "https://www.newzimbabwe.com/labour-ministry-officials-accused-of-ignoring-court-ruling-in-dispute-involving-nec-medical-and-allied-industry/",
            "content": "By Alois Vinga\n\nSENIOR officials in the Ministry of Labour have been accused of enabling an ongoing leadership dispute within the National Employment Council (NEC) for the Medical and Allied Industry, despite a Supreme Court ruling confirming the legitimate leadership of the workers union.\n\nThe NEC Medical was established in 2012 through a partnership between the Medical Professions and Allied Workers Union of Zimbabwe (MPAWUZ) and the Medical and Allied Employers Association (MEAZ). However, a legal battle over control of the union culminated in a Supreme Court judgment on February 6, 2025, recognising Tecla Barangwe as the rightful leader of MPAWUZ.Despite this ruling, ministry officials have reportedly failed to enforce the courts decision. Correspondence seen by NewZimbabwe.com shows that on 19 June 2025, acting registrar M.T. Maphaka wrote to NEC Medical, criticising its refusal to comply.NEC Medical leadership had argued that Barangwe could not be reinstated because the 2025 accreditation process had lapsed. The Labour ministry dismissed this reasoning as inadequate, noting that the council had failed to provide any supporting evidence.The authority of the Supreme Court judgment, which explicitly recognises Ms Barangwe as the rightful leader of MPAWUZ, cannot be diminished. The NEC is hereby directed to ensure that the legitimate leadership of MPAWUZ is recognised and accorded due representation, Maphaka stated in the letter.Despite these instructions, insiders allege that two senior ministry officials are protecting the current NEC Medical leadership.They prefer the current team and are merely issuing empty warnings while maintaining the status quo, one source claimed.When contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\nThe NEC Medical was established in 2012 through a partnership between the Medical Professions and Allied Workers Union of Zimbabwe (MPAWUZ) and the Medical and Allied Employers Association (MEAZ). However, a legal battle over control of the union culminated in a Supreme Court judgment on February 6, 2025, recognising Tecla Barangwe as the rightful leader of MPAWUZ.\n\nDespite this ruling, ministry officials have reportedly failed to enforce the courts decision. Correspondence seen by NewZimbabwe.com shows that on 19 June 2025, acting registrar M.T. Maphaka wrote to NEC Medical, criticising its refusal to comply.NEC Medical leadership had argued that Barangwe could not be reinstated because the 2025 accreditation process had lapsed. The Labour ministry dismissed this reasoning as inadequate, noting that the council had failed to provide any supporting evidence.The authority of the Supreme Court judgment, which explicitly recognises Ms Barangwe as the rightful leader of MPAWUZ, cannot be diminished. The NEC is hereby directed to ensure that the legitimate leadership of MPAWUZ is recognised and accorded due representation, Maphaka stated in the letter.Despite these instructions, insiders allege that two senior ministry officials are protecting the current NEC Medical leadership.They prefer the current team and are merely issuing empty warnings while maintaining the status quo, one source claimed.When contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\nDespite this ruling, ministry officials have reportedly failed to enforce the courts decision. Correspondence seen by NewZimbabwe.com shows that on 19 June 2025, acting registrar M.T. Maphaka wrote to NEC Medical, criticising its refusal to comply.\n\nNEC Medical leadership had argued that Barangwe could not be reinstated because the 2025 accreditation process had lapsed. The Labour ministry dismissed this reasoning as inadequate, noting that the council had failed to provide any supporting evidence.The authority of the Supreme Court judgment, which explicitly recognises Ms Barangwe as the rightful leader of MPAWUZ, cannot be diminished. The NEC is hereby directed to ensure that the legitimate leadership of MPAWUZ is recognised and accorded due representation, Maphaka stated in the letter.Despite these instructions, insiders allege that two senior ministry officials are protecting the current NEC Medical leadership.They prefer the current team and are merely issuing empty warnings while maintaining the status quo, one source claimed.When contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\nNEC Medical leadership had argued that Barangwe could not be reinstated because the 2025 accreditation process had lapsed. The Labour ministry dismissed this reasoning as inadequate, noting that the council had failed to provide any supporting evidence.\n\nThe authority of the Supreme Court judgment, which explicitly recognises Ms Barangwe as the rightful leader of MPAWUZ, cannot be diminished. The NEC is hereby directed to ensure that the legitimate leadership of MPAWUZ is recognised and accorded due representation, Maphaka stated in the letter.Despite these instructions, insiders allege that two senior ministry officials are protecting the current NEC Medical leadership.They prefer the current team and are merely issuing empty warnings while maintaining the status quo, one source claimed.When contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\nThe authority of the Supreme Court judgment, which explicitly recognises Ms Barangwe as the rightful leader of MPAWUZ, cannot be diminished. The NEC is hereby directed to ensure that the legitimate leadership of MPAWUZ is recognised and accorded due representation, Maphaka stated in the letter.\n\nDespite these instructions, insiders allege that two senior ministry officials are protecting the current NEC Medical leadership.They prefer the current team and are merely issuing empty warnings while maintaining the status quo, one source claimed.When contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\nDespite these instructions, insiders allege that two senior ministry officials are protecting the current NEC Medical leadership.\n\nThey prefer the current team and are merely issuing empty warnings while maintaining the status quo, one source claimed.When contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\nThey prefer the current team and are merely issuing empty warnings while maintaining the status quo, one source claimed.\n\nWhen contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\nWhen contacted for comment, Labour Ministry Permanent Secretary Simon Masanga declined to address the allegations directly and referred questions to the Director of Labour, Clemence Vusani, who did not respond to calls or messages.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18041857/masanga.jpg",
            "description": "<p>By Alois Vinga  SENIOR officials in the Ministry of Labour have been accused of enabling an ongoing leadership dispute within the National Employment Council (NEC) for the Medical and Allied Industry, despite a Supreme Court ruling confirming the legitimate leadership of the workers’ union. The NEC Medical was established in 2012 through a partnership between</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-ministry-officials-accused-of-ignoring-court-ruling-in-dispute-involving-nec-medical-and-allied-industry/\">Labour Ministry officials accused of ignoring court ruling in dispute involving NEC Medical and Allied Industry </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Scottland FC’s Tymon Machope gets late Warriors call-up",
            "url": "https://www.newzimbabwe.com/scottland-fcs-tymon-machope-gets-late-warriors-call-up/",
            "content": "By Sports Reporter\n\nAFTER netting a brace against Dynamos on Saturday, Scottland FC striker Tymon Machope has received a late call-up to feature in the national senior mens national soccer team, the Warriors, ahead of the upcoming World Cup Qualifiers.\n\nMachope, who is enjoying a good run in the league, scored seven goals in the month of August, the highest by any player this season during that period.Saturdays brace saw Machope move to second position on the top goalscorers chart with 12 goals, one behind Tel Ones Washington Navaya, who is the highest.The recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.Zimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nMachope, who is enjoying a good run in the league, scored seven goals in the month of August, the highest by any player this season during that period.\n\nSaturdays brace saw Machope move to second position on the top goalscorers chart with 12 goals, one behind Tel Ones Washington Navaya, who is the highest.The recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.Zimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nSaturdays brace saw Machope move to second position on the top goalscorers chart with 12 goals, one behind Tel Ones Washington Navaya, who is the highest.\n\nThe recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.Zimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nThe recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.\n\nZimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nZimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.\n\nThe Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nThe Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.\n\nCurrently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nCurrently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.\n\nSouth Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nSouth Africa  13 points\n\nBenin  8 points\n\nRwanda  7 points\n\nNigeria  6 points\n\nLesotho  5 points\n\nZimbabwe  4 points.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01050539/GM9Th8SWAAEn-TI.jpg_large.jpg",
            "description": "<p>By Sports Reporter  AFTER netting a brace against Dynamos on Saturday, Scottland FC striker Tymon Machope has received a late call-up to feature in the national senior men’s national soccer team, the Warriors, ahead of the upcoming World Cup Qualifiers. Machope, who is enjoying a good run in the league, scored seven goals in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-fcs-tymon-machope-gets-late-warriors-call-up/\">Scottland FC’s Tymon Machope gets late Warriors call-up</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Zimbabwe business lobby group calls for Argentina-style reforms",
            "url": "https://www.newzimbabwe.com/zimbabwe-business-lobby-group-calls-for-argentina-style-reforms/",
            "content": "Bloomberg\n\nZimbabwes main business lobby group urged the government to implement a raft of measures to reduce firms operating costs, and said Argentinas reform program could serve as a template.\n\nZimbabwe requires bold and accelerated reforms, including systematic deregulation inspired by Argentines President Javier Mileis one deregulation per-day model, the Confederation of Zimbabwe Industries said in a letter to the Industry and Commerce Ministry. Maybe in Zimbabwe, it could be one deregulation measure a week, it said.\n\nDecades of government mismanagement and policy missteps have taken a heavy toll on Zimbabwe  poverty and unemployment are widespread, basic services are lacking or non-existent, and hard currency shortages and runaway inflation are perennial problems. The CZI identified nine areas requiring immediate intervention, including cutting the states debt to the private sector, adjusting a 30% foreign-currency retention threshold for exporters and reducing sugar taxes on beverage makers.\n\nIt also called for a currency policy revamp and for the central bank to formalise and legalise its proclamations on phasing out the use of the dollar, so as to strengthen business and investor confidence. Most transactions in the southern African nation are currently conducted with the greenback, and the authorities aim to end that practice and ensure the bullion-backed Zimbabwe Gold currency is used solely by 2030.\n\nZimbabwes Industry and Commerce Minister Mangaliso Ndlovu didnt immediately respond to a call to his mobile phone seeking comment. Finance Minister Mthuli Ncube last month said the authorities are working on tackling regulatory constraints faced by formal businesses that bear the brunt of taxes, while a burgeoning informal sector avoids paying.\n\nIn Argentina, Milei has been spearheading a campaign to make it easier to do businesses, promote investment and reduce the role of the state in the economy, including scrapping most price controls and abolishing a number of regulations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01083800/ZB-Bank-.jpg",
            "description": "<p>Bloomberg Zimbabwe’s main business lobby group urged the government to implement a raft of measures to reduce firms’ operating costs, and said Argentina’s reform program could serve as a template. Zimbabwe “requires bold and accelerated reforms, including systematic deregulation inspired by Argentine’s President Javier Milei’s one deregulation per-day model,” the Confederation of Zimbabwe Industries said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-business-lobby-group-calls-for-argentina-style-reforms/\">Zimbabwe business lobby group calls for Argentina-style reforms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "CUT graduate dies in car crash a few hours after graduation ceremony; parents and sibling battling for life",
            "url": "https://www.newzimbabwe.com/cut-graduate-dies-in-car-crash-a-few-hours-after-graduation-ceremony-parents-and-sibling-battling-for-life/",
            "content": "By James Muonwa\n\nA CHINHOYI University of Technology (CUT) graduate died following a road traffic accident just a few hours after being conferred with a degree.\n\nPanashe Mwinga graduated with a Bachelors degree in Visual and Multimedia Communication on Thursday and was involved in the fatal crash in the Mapinga area as she and her family returned to Harare, where her dad was on a working visit.\n\nThe now deceaseds father, an engineer, was driving the vehicle. Also in the ill-fated car was Panashes mother and eight-year-old sister.\n\nIn a press statement, CUT Students Representative Council (SRC)s Minister for External Affairs, Information and Publicity, Marlvin Saint Madanda, confirmed the untimely death of the young graduate.\n\nIt is with profound sorrow and a deep sense of loss that we inform you of the passing of Panashe Mwinga, a gifted young lady who graduated just yesterday (Thursday) with a Bachelors degree in Visual and Multimedia Communication, said Madanda.\n\nPanashe was involved in a fatal road accident on the evening of 28 August 2025 near Mapinga, close to Gwebi River, while travelling with her sibling and both parents.\n\nShe sustained serious injuries and despite medical efforts, passed away a few hours after being admitted to Parirenyatwa Hospital. Her body has since been transferred to Nyaradzo Funeral Services for funeral arrangements.\n\nHer untimely passing is a profound loss to the university community and to all who had the privilege of sharing in her journey, the CUT SRC spokesperson said.\n\nIn honour of Panashes life, legacy and in solidarity with the bereaved family, this Monday, September 1, 2025, has been declared Black Monday.\n\nWe encourage all students to wear black on this day as a sign of collective mourning and respect, the students body said.\n\nMeanwhile, Eng. Mwinga and his wife reportedly sustained serious head injuries and are both in critical condition and unconscious. The minor suffered broken legs.\n\nEng. Mwinga had come to Harare from Matebeleland North for the Zimbabwe Agricultural Show (ZAS) and on the sidelines went to Chinhoyi to attend the CUT graduation ceremony at which his daughter was a participant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/30204302/IMG-20250830-WA0107.jpg",
            "description": "<p>By James Muonwa  A CHINHOYI University of Technology (CUT) graduate died following a road traffic accident just a few hours after being conferred with a degree. Panashe Mwinga graduated with a Bachelor’s degree in Visual and Multimedia Communication on Thursday and was involved in the fatal crash in the Mapinga area as she and her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cut-graduate-dies-in-car-crash-a-few-hours-after-graduation-ceremony-parents-and-sibling-battling-for-life/\">CUT graduate dies in car crash a few hours after graduation ceremony; parents and sibling battling for life </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        }
    ]
}