{
    "news": [
        {
            "title": "‘Don’t Ask. We are adults’: Khanyi Mbau and Kudzai Mushonga kiss and make-up",
            "url": "https://www.newzimbabwe.com/dont-ask-we-are-adults-khanyi-mbau-and-kudzai-mushonga-kiss-and-make-up/",
            "content": "News24\n\nReality TV star and actor Khanyi Mbau announced via Instagram on Monday that she and Kudzai Mushonga are back together again.\n\nEarlier this month, Mbau sent shockwaves across social media when she announced their split.\n\nHe was a good guy, but he did some bad things, he tried everything he could to make it up to me. I did most of my grieving while we were together. I finally got the courage to leave. And of course, I wish him the best, she wrote.\n\nThe pair who dated for five years and became one of the most popular couples in SA during that time, have now buried the hatchet, yet again.\n\nDont ask!! he didnt entertain my rubbish.We are adults!!! (listen dont judge).Besides where would I go with a thigh laminated in bold with his name, she wrote.\n\nHeres a look back at the couples tumultuous dating life following these developments:\n\nThe beginning: January 2021\n\nJanuary 2021 marked the beginning of what would be a rollercoaster relationship for Mbau and Mushonga.\n\nAfter having been single for a while following her public split from Kwela Tebza musician Tebogo Lerole, South Africans caught glimpses of Mbaus new man when she started posting the then mystery man on Instagram.\n\nThe man was later revealed as Terrence Kudzai Mushonga, a Zimbabwean-born controversial millionaire.\n\nExtravagant love and controversy: February 2021\n\nThe couple made their relationship public in February.\n\nSoon after that, the TV personality started posting her bae, showing offher expensive Valentines Day gifts, which included a hotel room filled with 1 250 individually staged red roses and Louis Vuitton bags.\n\nThat same month Zimbabwe Republic Police Assistant Commissioner Paul Nyathi toldCity Pressthat Mushonga had been on the run for almost five years.\n\nPlease be advised that our criminal investigation department has advised us that Mushonga is a wanted person in connection with a report of fraud made by Margaret Chipunza of African Century Limited in 2016, Nyathi said in a statement.\n\nAccording to a report in The Herald, a state-owned newspaper in Zimbabwe, Mushonga and three accomplices defrauded the microlender of $166 000 (R3.1 million).\n\nFor more info on the allegations that were labelled against Mushonga, readhere.\n\nLove tattoo: March 2021\n\nDespite the controversy surrounding Mushonga, Mbau continued to stand by her man and even went as a far as getting a tattoo of his name on her thigh.\n\nWhen you showed me before bedtime, I was in shock. Love you always. No going back. We will never end, Mushonga wrote on his Instagram account, which has since been deactivated.\n\nMbau flees Dubai: August 2021\n\nA couple of months went by as the pair served couple goals. They continued to share loved-up snaps right until Mushonga set the country in a panic when he claimed that he was unable to locate Mbau in Dubai after dropping her off at a salon.\n\nThe actor was on the trends list, with some genuinely worried about her whereabouts.\n\nHowever, Mbau later in an Instagram post,revealed that she was in Johannesburg, posting a photo of herself at her fathers grave, dispelling allegations that she went missing.\n\nMbau cleared the air with News24, saying she was home safe and sound after her partner expressed concern on Instagram.\n\nI am home safe and sound. I am so sorry to have worried and stressed the country, my fans, friends, relatives and family. Thank you for all your prayers, support, search parties, and all my friends who pulled major strings to locate me.\n\nREAD |Khanyi Mbau sorry to have worried and stressed country after boyfriend claimed shed gone missing\n\nAfter her whereabouts were confirmed, Mushonga, in a 24-minute Instagram Live broadcast, said: I dont know if this is the part where were breaking up, or there was something urgent that I didnt have to know.\n\nWe didnt fight; we didnt argue the same day that she left, he said about the events that transpired in the lead-up to her departure from Dubai.\n\nHe went on to say that he still loved Khanyi.\n\nYou hurt me, he said to Khanyi. I never lied to that woman. I told the truth. And Khanyi is the first lady that I never cheated on. In my whole life  Ive been a bad guy, guys, he said.\n\nMushonga later apologised to Khanyi for sharing their personal life on Instagram. I was hurting. I honestly didnt know how to deal with my emotions, baby. I love you.\n\nHe added: Im not ashamed to stand on top of the world and admit I love you I love you, and Im sorry.\n\nWater under the bridge or so it seemed: September 2021\n\nThe Young, Famous & Africanstarreunited with Mushongain Dubai after a few weeks in South Africa.\n\nMushonga later shared on his Instagram stories and videos how he showered Mbau with gifts from Cartier. The couple was later seen sharing a kiss while cosying up in the backseat of a Mercedes-Maybach.\n\nThe social media debacle even earned Mbau a Drama Queen of the Year nomination at the 2021 Feather Awards.\n\nCreating a life in Dubai: October 2021  2022\n\nFor a while after the eventful start to their relationship, the couple seemed to have finally found their rhythm. They relocated to Dubai, with hope of building an empire together.\n\nWhile the true nature of their love can only be confirmed by the pair, the years 2022 to 2023 were lived away from the spotlight, with Mbau occasionally offering a glimpse into her relationship when she was doing interviews for new projects.\n\nAfter her debut on Young, Famous & African in 2022, the actor spoke of being in a loving relationship with Mushonga despite their seven-year age gap.\n\nTrouble in paradise? 2023/2024\n\nIn the last episode of season three of the reality show, Mbau confirmed cracks in her relationship with Mushonga.\n\nIn a scene where she engaged with Naked DJ and offered advice about his relationship, the Metro FM DJ questions Mbau silence and why she was portraying a happy relationship with Mushonga on social media.\n\nMbau revealed she had burnout but did not offer any information of the current state of her relationship.\n\nThe end of the road: 3 February 2025\n\nAfter nearly 5 years, Mbau announced that she had broken up with her boyfriend and said it had been a long time coming.\n\nHe was a good guy, but he did some bad things; he tried everything he could to make it up to me. I did most of my grieving while we were together. I finally got the courage to leave. And, of course, I wish him the best, she wrote.\n\nGive everything time. I am grateful for the experience, she captioned the post that she has since deleted.\n\nThe beginning of another chapter? 17 February 2025\n\nWhile many were sure the pair were done, and others were processing the breakup, Mbau announced that theyve kissed and made up.\n\nHe called, demanded I address the bad things he did, she wrote, saying she was headed home.\n\nSEE THE POST HERE:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/18061211/KHANYI-KUDZAI.webp",
            "description": "<p>News24 On Monday Khanyi Mbau announced that she and her businessman boyfriend Kudzai Mushonga have made up after a short-lived breakup. This comes less than a month after Mbau announced on 3 February that she had ended her long-time relationship with Mushonga. The couple, who had been together for five years, have marked several, public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-ask-we-are-adults-khanyi-mbau-and-kudzai-mushonga-kiss-and-make-up/\">‘Don’t Ask. We are adults’: Khanyi Mbau and Kudzai Mushonga kiss and make-up</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "If money was stolen, report to the police – Mnangagwa says his time being wasted on questions over Chivayo’s splurging",
            "url": "https://www.newzimbabwe.com/if-money-was-stolen-report-to-the-police-mnangagwa-says-his-time-being-wasted-on-questions-over-chivayos-splurging/",
            "content": "By Costa Nkomo\n\nPresident Emmerson Mnangagwa has dismissed claims that controversial businessman Wicknell Chivayo is acting as his frontman, distributing vehicles and cash donations to various individuals, largely from his ruling Zanu-PF party and the artistic community.\n\nHe has defended Chivayo as a philanthropist, a view sharply at odds with that of his deputy, Constantino Chiwenga, who appears to consider Chivayo an unscrupulous businessman.\n\nRumours have been rife, that Chivayo is being used by Mnangagwa to lavish gifts  from luxury to budget vehicles  on strategic individuals, particularly artists, in a bid to drum up support for a potential presidential term extension. This is despite Mnangagwa maintaining that he will abide by the constitution and step down in 2028.\n\nAddressing journalists at State House on Monday, Mnangagwa refuted allegations that he is providing Chivayo with funds to splash around the country at a time when the economy and social services are on their knees.\n\nWhere would I get the money to give him? he questioned.\n\nInvestigate where you think Im getting the money to give Chivayo to distribute, rather than wasting my time worrying about someone who is using his own money. You cant bother me about someone who is philanthropic. If anyones money was stolen then they should report to the police.\n\n\"Kana pane akabirwa please report to the police\"  President Mnangagwa comments on Chivayo's splurging\n\nJoin thehttps://t.co/iVVKatQx0sChannelhttps://t.co/4EHrosKaUfpic.twitter.com/KCqUAs56mV\n\n NewZimbabwe.com (@NewZimbabweCom)February 17, 2025\n\nChivayo has been seen distributing vehicles and cash across the country, even, on occasion, throwing banknotes into the crowd, prompting desperate Zimbabweans to scramble for the money.\n\nWhile Mnangagwa paints Chivayo as a benevolent benefactor, his deputy, Constantino Chiwenga, views him in a distinctly different light.\n\nAddressing mourners at the National Shrine last month, Chiwenga, though not mentioning Chivayo by name, launched a veiled attack on his character, referring to him as a chigananda. Translated, this term implies someone who engages in dubious deals at the expense of others.\n\nVision 2030 is for all of us, not those you refer to asmbinga. During the liberation struggle, we referred to those aszvigananda.\n\nTo add fuel to the fire, Chivayo has publicly voiced his support on X (formerly Twitter) for Mnangagwas presidential term extension, arguing that the Zanu-PF leaders vision must be supported, not derailed.\n\nOutspoken Zanu-PF Central Committee member and war veteran Blessed Geza, now hunted by the police after his explosive press conference demanding Mnangagwas resignation (chiefly due to corruption), has also turned his ire towards Chivayo.\n\nGeza questioned the provenance of Chivayos seemingly limitless wealth, implicitly pointing the finger at Mnangagwa, suggesting his actions are merely to divert attention.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/10132512/Mnangagwa-and-Chivayo.webp",
            "description": "<p>By Costa Nkomo President Emmerson Mnangagwa has dismissed claims that controversial businessman Wicknell Chivayo is acting as his frontman, distributing vehicles and cash donations to various individuals, largely from his ruling Zanu-PF party and the artistic community. He has defended Chivayo as a philanthropist, a view sharply at odds with that of his deputy, Constantino</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/if-money-was-stolen-report-to-the-police-mnangagwa-says-his-time-being-wasted-on-questions-over-chivayos-splurging/\">If money was stolen, report to the police – Mnangagwa says his time being wasted on questions over Chivayo’s splurging</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "Warriors to host Benin in South Africa as new ZIFA exco misses target",
            "url": "https://www.newzimbabwe.com/warriors-to-host-benin-in-south-africa-as-new-zifa-exco-misses-target/",
            "content": "By Sport Reporter\n\nZimbabwe Football Association (ZIFA) has announced that Moses Mabhidha Stadium in Durban, South Africa will be the home venue for the upcoming Warriors match against Benin.\n\nThis is despite assurances by new ZIFA president Nqobile Magwizi that the 2026 World Cup Qualifiers would be played at the National Sports Stadium which is currently under renovation.\n\nThe two sides will clash on the 20th of March in a Group C 2026 World Cup Qualifiers match.\n\nZimbabwe has been without a CAF-approved ground since its re-admission to the international football family in July 2023 and has been seeking refuge in foreign lands for home matches.\n\nThe Zimbabwe Football Association (ZIFA) is delighted to announce that the Zimbabwe Senior Mens National Team, the Warriors, will play their Matchday 5, Group C, FIFA World Cup Qualifier against Benin at the iconic Moses Mabhida Stadium in Durban, South Africa.\n\nOriginally, ZIFA had planned to host this fixture in Polokwane; however, after it was allocated to Bafana Bafana in January, alternative venues had to be considered, read part of ZIFA statement.\n\nIn an interview withThe Standardthree weeks back, Magwizi had said the National Sports Stadium will be ready in time for the World Cup Qualifiers.\n\nWe are keen to have football return to the National Sports Stadium as soon as possible.\n\nAlthough it will not be easy, we aim to mobilise resources to see to it that renovations are completed in time for the World Cup Qualifiers, he pledged.\n\nNational Sports Stadium is the only local stadium close to meeting FIFAs required standards, provided all the recommendations boxes are ticked.\n\nPart of the requirements includes the installation of electronic turnstiles, bucket seats, standard changing rooms, and electronic screens.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10172257/WhatsApp-Image-2024-10-10-at-18.22.36.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe Football Association (ZIFA) has announced that Moses Mabhidha Stadium in Durban, South Africa will be the home venue for the upcoming Warriors match against Benin. This is despite assurances by new ZIFA president Nqobile Magwizi that the 2026 World Cup Qualifiers would be played at the National Sports Stadium which is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-to-host-benin-in-south-africa-as-new-zifa-exco-misses-target/\">Warriors to host Benin in South Africa as new ZIFA exco misses target</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "OK Zimbabwe blames ZWG devaluation; calls for market-determined exchange rates",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-blames-zwg-devaluation-calls-for-market-determined-exchange-rates/",
            "content": "By Alois Vinga\n\nLEADING retailer Ok Zimbabwe says the Reserve Bank of Zimbabwes (RBZ) decision to devalue the ZWG currency doubled the entitys US$-denominated loans and credits.\n\nThe supermarket chain is currently reeling under pressure to keep its heads above water as most shelves have gone empty without any stocks. At the heart of the problems is supplier resistance to offering commodities, which are often paid for in local currency.\n\nThe situation has led many suppliers to channel their commodities to the informal market, which often enjoys easy access to the much-needed greenback.\n\nPresenting a trading update for the third quarter period, OK Zimbabwes group company secretary, Margaret Munyuru, bemoaned the impact of the central banks decisions.\n\nThe local currency unit (ZWG) experienced a sharp devaluation at the end of September 2024 as monetary authorities sought to improve the viability of the exchange rate system for the broader economy. Invariably, the devaluation had the net effect of nearly doubling existing US Dollar denominated obligations in loans and creditors balances, she said.\n\nIn September 2024,the RBZdevalued the ZWG currency by 43%to keep pace with exchange rate premiums which had seen the official rate at the time stuck at ZWG13,80 when the parallel market rate had gravitated to a premium of ZWG30 against the greenback.\n\nThe move effectively worsened most retailers and companies balance sheets as they now had to pay more for their debts.\n\nMunyuru said during the period, the group had outstanding and overdue creditorsbalances which were predominantly denominated in US$ sales collection.\n\nShe attributed the low stocking levels to the direct manifestation of sub-economic pricing arising out of exchange rate distortions and suppliers need for foreign currency invoicing to cover their operational and raw material needs.\n\nResultantly, volumes during the period decreased by 36% in comparison to the same period last year. The reduction for the quarter also translated to a 36% revenue decline.\n\nDespite the challenges, the business has since begun to restock with support from suppliers as well as financial institutions that continue to assist with short-term funding structures.\n\nNew alternative procurement models have been developed which include, but are not limited to, a structured stock supply arrangement with a third party for supplier assurance purposes as the business works to restore critical supply relationships with both local and foreign suppliers.\n\nThe fortunes of the countrys formal retail sector hinge on the stability of our exchange rate regime. There is a need for absolute clarity on the roadmap towards a full market-determined exchange rate system. Such a liberalized system will go a long way in restoring the competitiveness of the formal retail sector, added Munyuru.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga LEADING retailer Ok Zimbabwe says the Reserve Bank of Zimbabwe’s (RBZ) decision to devalue the ZWG currency doubled the entity’s US$-denominated loans and credits. The supermarket chain is currently reeling under pressure to keep its heads above water as most shelves have gone empty without any stocks. At the heart of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-blames-zwg-devaluation-calls-for-market-determined-exchange-rates/\">OK Zimbabwe blames ZWG devaluation; calls for market-determined exchange rates   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "Hate speech on X surged for at least 8 months after Elon Musk takeover – new research",
            "url": "https://www.newzimbabwe.com/hate-speech-on-x-surged-for-at-least-8-months-after-elon-musk-takeover-new-research/",
            "content": "The Conversation\n\nHate speech on X was consistently 50% higher for at least eight months after tech billionaire Elon Musk bought the social media platform, new research has found.\n\nThe research looked at the prevalence of overt hate speech including a wide range of racist, homophobic and transphobic slurs.\n\nThe study,published today in PLOS ONE, was conducted by a team of researchers led by Daniel Hickney from the University of California, Berkeley.\n\nIt clearly demonstrates how a platform initiallyinvented to help friends and family stay in touchhas now metamorphosed into a place where hate speech is prolific. This is especially concerning givenhate speech online has been linkedto violent hate crimes offline.\n\nOn October 27 2022, Musk officially purchased X (then known as Twitter) for US$44 billion and became its CEO. His takeover was accompanied by promises toreduce hate speechon the platform andtackle botsand other inauthentic accounts.\n\nBut after he bought X, Musk made several changes to the platform to reduce content moderation. For example,in November 2022 he firedmuch of the companys full time workforce. He also fired outsourced content moderators who tracked abuse on X, despite research showing social medial platforms with high levels of content moderationcontain less hate speech.\n\nThe following month,Musk also disbanded the platforms Trust and Safety Council a volunteer advisory group of independent human rights leaders and academics formed in 2016 to fight hate speech and other problems on the platform.\n\nPrevious researchhas shownhate speech increased on X immediately afterMusk took over. So too did the prevalence of most types of bots.\n\nThis new study is the first to show that this wasnt an anomaly.\n\nThe study examined 4.7 million English language posts on X from the beginning of 2022 through to June 9 2023. This period includes the ten months before Musk bought X and the eight months afterwards.\n\nThe study measured overt hate speech, the meaning of which was clear to anyone who saw it  speech attacking identity groups or using toxic language. It did not measure covert types of hate speech, such ascoded language used by some extremist groupsto spread hate but plausibly deny doing so.\n\nAs well as measuring the amount of hate speech on X, the study also measured how much other users engaged with this material by liking it.\n\nThe researchers access to X data was cut off during the study due to a policy change by the platform, replacing free access to approved academic researchers with payment options which are generally unaffordable. This significantly hampered their ability to collect sample posts. But they dont mention whether it affected their results.\n\nThe study found a clear increase in the average number of posts containing hate speech following Musks purchase of X. Specifically, the volume of posts containing hate speech was consistently 50% higher after Musk took over X compared to beforehand  a jump from an estimated average of 2,179 to 3,246 posts containing hate speech per week.\n\nTransphobic slurs saw the highest increase, rising from an average of roughly 115 posts per week before Musks acquisition to an average of 418 afterwards.\n\nThe level of user engagement with posts containing hate speech also increased under Musks watch. For example, the weekly rate at which hate speech content was liked by users jumped by 70%.\n\nThe researchers say these results suggest either hate speech wasnt taken down, hateful users became more active, the platforms algorithm unintentionally promoted hate speech to users who like such content  or a combination of these possibilities.\n\nThe study also detected no decrease in the activity of inauthentic accounts on X. In fact, it found a potential increase in the number of bot accounts partly based on a large upswing in posts promoting cryptocurrency, which are typically associated with bots.\n\nThere were a number of limitations to the study. For example, it only measured hate speech posts in English, which accounts foronly 31% of postson the platform.\n\nEven so, the study is an important, data-driven deep dive into the state of X. It shows it is a platform where hate speech is prolific. It also shows Musk has failed to fulfil his earlier promises to address problems on X such as hate speech and bot activity.\n\nAsMusk himself saidat the White House earlier this week: Some of the things I say will be incorrect and should be corrected.\n\nAssociate professor, Institute for Governance and Policy Analysis, University of Canberra, University of Canberra\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/26043006/esla-and-SpaceX-CEO-Elon-Musk.jpeg",
            "description": "<p>The Conversation Hate speech on X was consistently 50% higher for at least eight months after tech billionaire Elon Musk bought the social media platform, new research has found. The research looked at the prevalence of overt hate speech including a wide range of racist, homophobic and transphobic slurs. The study, published today in PLOS ONE,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hate-speech-on-x-surged-for-at-least-8-months-after-elon-musk-takeover-new-research/\">Hate speech on X surged for at least 8 months after Elon Musk takeover – new research</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "Miniyothabo Chiwenga drops fraud charges against Gray Homes owners in botched US$1 million construction deal",
            "url": "https://www.newzimbabwe.com/miniyothabo-chiwenga-drops-fraud-charges-against-gray-homes-owners-in-botched-us1-million-construction-deal/",
            "content": "By Staff Reporter\n\nThe State on Monday withdrew criminal charges against a Harare couple and owners of a top construction company, Gray Homes, who were accused of duping Vice President Constantino Chiwengas wife Miniyothabo Baloyi-Chiwenga of nearly US$1 million.\n\nThe couple, Annavestah Mudiwa (39) and her husband Gray Mudiwa failed to complete a double-storey mansion, warehouse and shopping mall despite receiving the payment from Miniyothabo.\n\nThe case was withdrawn before Harare magistrate Donald Ndirowei but no reasons were given in court.\n\nThe State was alleging thatsometime in March 2023, thecoupleduped the complainant into believing that they could construct for her a double-storey house, a cottage and a precastwall.\n\nThey misrepresented their capacity and falsified that they could and would complete the project in 90 days.\n\nThis excited the complainant leading to her dispatching US$560,000to the accused persons,the statesaid.\n\nIt was alleged that after receiving the funds, the accused persons diverted them to their own use, and did not complete the project prejudicing Chiwenga of US$389,100.\n\nIn the second count itwas alleged that sometime in June 2023, the accused persons misled the complainant into believing that they were able to construct a Warehouse at Chivaraidze Farm in Goromonzi while they knew and were certain that they could not work on the construction.\n\nActing on the misrepresentation Chiwenga again proceeded to give to the accused persons US$550,000.\n\nAfter receiving the funds, the accused did not complete the projected and converted funds amounting to US$390,000 to their own use. The accused did not complete the project as was promised, said the state.\n\nIt was alleged that nothing was recovered.\n\nIn the last count itwas alleged that in September 2023, using the same modus operandi, the accused persons convinced Chiwenga that they were able to construct a Shopping Mall at Silalatshani Business Centre in Filabusi on behalf of the complainant while they knew that they had no capacity to do so.\n\nThe accused was given US$158,000 due to the misrepresentation.\n\nAfter receiving the funds, the accused persons diverted funds worth US$151,000 to their own use.\n\nAs a result of the accuseds actions, the complainant suffered a total financial prejudice in the sum of US$151,000 and nothing has been recovered so far, the court heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051524/zdf-chiwengas.jpeg",
            "description": "<p>By Staff Reporter The State on Monday withdrew criminal charges against a Harare couple and owners of a top construction company, Gray Homes, who were accused of duping Vice President Constantino Chiwenga’s wife Miniyothabo Baloyi-Chiwenga of nearly US$1 million. The couple, Annavestah Mudiwa (39) and her husband Gray Mudiwa failed to complete a double-storey mansion,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miniyothabo-chiwenga-drops-fraud-charges-against-gray-homes-owners-in-botched-us1-million-construction-deal/\">Miniyothabo Chiwenga drops fraud charges against Gray Homes owners in botched US$1 million construction deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "Climate change, insecurity compound Zimbabwe and Nigeria’s malnutrition crisis",
            "url": "https://www.newzimbabwe.com/climate-change-insecurity-compound-zimbabwe-and-nigerias-malnutrition-crisis/",
            "content": "Nigeria Health Watch\n\nPamelaArikuretis grandchild, who is nearly two years old, has been severely affected by the widespread malnutrition in Mudzi, Zimbabwe. The young girl has not gained any weight for the past six months,We give her plain maize porridge every morning because thats what we can afford,Pamela explained.\n\nIn Zimbabwe, a severe drought worsened by the El Nio phenomenonhas triggered a malnutrition crisis threatening the health and livelihoods of vulnerable communities across the country.\n\nWith staple crop yields plummeting and food prices skyrocketing, families like Pamelas are facing dire food shortages, leading to increased rates of stunting and wastingamong children. Most days, we eat Sadza [a maize meal] and okra for lunch and the same meal for dinner. It has been a difficult year for us due to the drought as we did not harvest anything.At times, we have to sleep on our empty stomachs,she adds.\n\nThe situation is no better in Nigeria, particularly in the northern region, where ongoing conflict and insecurity have worsened the crisis. Armed violence has displaced countless families, cutting off their access to farmland. Coupled withrising inflationand soaring food prices, manyNigerians are struggling with hunger.\n\n As humanitarian organisations scramble to provide relief, the long-term consequences of this nutritional emergency could hinder the recovery and development of Nigeria and Zimbabwes for years to come. This highlights the urgent need for immediate assistance and sustainable agricultural practices to combat the effects of climate change.\n\nIn Nigeria and Zimbabwe, children pay the price\n\nAccording to the United Nations Childrens Fund (UNICEF), 2 million children in Nigeria are suffering from malnutrition. The organisation also reported that the country has the second-highest burden of stunted children globally, with a national prevalence rate of 32% among children under five.\n\nIn Zimbabwe,24% of children aged 0 to 5suffer are stunted, with boys more likely to be affected than girls. The UNICEF further reported that just 10% of children (623 months) receive an acceptable diet, and the children in the poorest homes are twice as likely to be stunted.\n\nEl Nios impact in Zimbabwe\n\nEl Nio is a complex climate phenomenon characterised by the periodic warming of sea surface temperatures in the Central and Eastern tropical Pacific Ocean. This warming disrupts normal weather patterns, leading to significant global climatic effects. Typically occurring every few years, El Nio can influence weather events such as increased rainfall and flooding in some regions, while causing droughts and higher temperatures in others.\n\nAccording to the Famine Early Warning System(FEWS) Network, dry and very hot conditions have limited planting activities across much of the country  following cumulatively low rainfall. This has resulted in a decline in market maize grain availability as more households increase their dependence on market purchases.\n\nThe 2024 Zimbabwe LivelihoodsAssessment report(ZIMLaC) further indicates a decline in access to a minimum acceptable diet in the majority of Zimbabwes provinces.Women like Pamela are now forced to stretch their meagre resources to feed their families.\n\nIn the past, we were able to support ourselves through subsistence farming during periods of exceptionally heavy rainfall. We used to feed our kids well-balanced meals, but that is no longer the case because we dont harvest anything from our fields anymore,she said.\n\nTatenda Chimutu, a nutritionist, said malnutrition rates in Mudzi have also increased due to inadequate funds for scaling up nutrition interventions. The situation has worsened, food insecurity increased from 31% in 2023 to 64% in 2024. Wasting has also increased compared to last year,he explained.\n\nTatenda reported that the community response to this crisis has been through local health centres, which provide nutrition counselling, community-based nutrition programmes. Traditional leaders have been advocating for nutrition education,while self-help groups promote kitchen gardening. In addition, partnerships with Non-Governmental Organisations (NGOs) have provided food aid and support.\n\nHowever, for first-time mothers like 22-year-old Dorothy Ngaufe, the food aid from NGOs has only provided a temporary solution to her nutrition challenges.The only assistance we received was in the form of groceries consisting of peanut butter, cooking oil,Kapenta,and beans once per month for three months. This was specifically meant for my 2-year-old daughter, but this has since been stopped,she explained.As of now we have nothing, my daughter is facing severe malnutrition as we hardly have anything to eat. My daughter only weighs eight kilograms.According to the World Health Organisation (WHO),the average weight for a 2-year-old girl is 12 kilograms.\n\nConflict and banditry worsen malnutrition in Nigeria\n\nThe rise of banditry in northwest Nigeria has led tofrequent kidnapping for ransomsand attacks on villages and schools. Once a peaceful farming community, Tungar Adaka, a village in Zamfara, has become a target, forcing residents like Zainab Shafiu, 37, to flee.\n\nFor over a decade,banditry has claimed over 8,000 lives in the northwest, and over 1 million people had been displaced. The number keeps rising. According to the International Rescue Committee (IRC), at least 10,000 people weredisplacedin Zamfara and Sokoto states due to armed attacks between March and April 2024.\n\nZainabs three-year-old son was diagnosed with malnutrition in June 2024 due to the lack of basic living items in displacement camps. I noticed he began to look pale, suffered from diarrhea, lost weight, and became weaker,Zainab said.Bandits have taken control of the villages. No one can farm, so theres very little food for my son. My husband hasnt farmed for three years and [does not] earn enough from mining to keep us [well fed].\n\nTo treat her son, Zainab took him to a primary healthcare center, where he was given ready-to-use therapeutic food (RUTF). While her son has shown improvement, Zainab remains deeply worried without a steady food supply.\n\nA call for urgent intervention\n\nCurrent food systems in both countries dont seem to address the problem of child malnutrition comprehensively. We need the government to support us with food and shelter,Zainab urged, echoing a similar call from Doctors Without Borders/Mdecins Sans Frontires (MSF).\n\nIn September 2024, MSFurgedfor increased efforts to address the escalating malnutrition crisis in Northwest Nigeria. MSF reported a sharp rise in severely malnourished children with life-threatening complications. It is worried that even though one in four children are malnourished, the region remains excluded from the United Nations Humanitarian Response Plan.\n\nHowever, Damba Rabiu, a doctor at a clinic in Gusau, the capital of Zamfara, noted that ignorance and poverty exacerbate the crisis. He explained that some mothers, after receiving nutritional supplements, sell part of them to meet other pressing needs.\n\nSome parents are short-changing their children. If a child is supposed to receive two sachets of nutritional supplements per day for seven days, that adds up to 14 sachets. However, some children only receive two sachets for the entire week, as parents sell the rest or use them for other family members. As a result, the child doesnt get the nutrition required for recovery,Dr. Rabiu said.\n\nBut this is largely due to circumstance rather than negligence on the part of parent. For example, the price of cooking a pot of Jollof Rice, a Nigerian staple food,went upfrom about 16,000 in March 2024 to over 20,000 in June 2024. This means families are now spending almost 20% more on the same meal in just a few months. In desperate situations where multiple children are malnourished in a household, mothers are forced to make the decision to find food for the entire household.\n\nJoy Alejo, a pediatric neurologist at the University College Hospital in Ibadan, noted thatwhen children dont get enough food for proper brain development, youre limiting their potential for inventions, innovations, and achievements. The government needs to address this urgently.\n\nWhile the brain continues to develop after age five, the early years are crucial for laying the foundation for future growth.Alejo also shares concerns about the insecurity, stating that it has driven doctors away from the region, limiting the care available to malnourished children.\n\nEnding malnutrition\n\nTatenda, the nutritionist in Zimbabwe, explained ways to end malnutrition, including short- and long-term solutions.Food assistance programmes, is one he said, includingemergency nutrition intervention programmes, nutrition and healthcare service outreaches.\n\nFor the long-term, he added that people need to practice sustainable agriculture initiatives and there is a need for economic empowerment programmes that can benefit people. On a policy level, there is a need for policy changes supporting nutrition and food security,he said.\n\nDr. Ibrahim Baba Shatambaya, a political scientist and public policy expert in Nigeria, noted that insecurity is something every serious government should do everything to tackle, especially in rural areas, to guarantee food security.\n\nHe also emphasised that,to tackle malnutrition effectively, there must be a strong partnership between the government and international organisations. This collaboration should focus on mapping areas where malnourished children are located, identifying the affected individuals, and implementing targeted interventions. These efforts will ensure a direct response to their needs and work toward preventing malnutrition in the future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17154136/malnutrition.webp",
            "description": "<p>Nigeria Health Watch Pamela Arikureti’s grandchild, who is nearly two years old, has been severely affected by the widespread malnutrition in Mudzi, Zimbabwe. The young girl has not gained any weight for the past six months, “We give her plain maize porridge every morning because that’s what we can afford,” Pamela explained. In Zimbabwe, a severe drought worsened</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/climate-change-insecurity-compound-zimbabwe-and-nigerias-malnutrition-crisis/\">Climate change, insecurity compound Zimbabwe and Nigeria’s malnutrition crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "Nampak Zimbabwe focuses on cost-containment as currency instability looms",
            "url": "https://www.newzimbabwe.com/nampak-zimbabwe-focuses-on-cost-containment-as-currency-instability-looms/",
            "content": "IOL\n\nNampak Zimbabwe is grappling with a challenging operating environment, compelling the company to implement cost-containment measures as it prepares to divest its stake to Zimbabwe-listed entity TSL.\n\nThis move comes as Zimbabwes economic landscape faces significant challenges exacerbated by recent policy changes and ongoing currency instability.\n\nJohn Van Gend, Nampak Zimbabwes managing director, said on Friday that the operating environment in Zimbabwe is undeniably complex, impacted by policy changes and currency instability.\n\nZimbabwe has just made currency policy changes that are likely to impact timeous reporting by companies.\n\nWhile the paper and packaging giant said it had transitioned to US dollar financial reporting, the Reserve Bank of Zimbabwe has directed that all companies use the local currency for all company reporting.\n\nVan Gend said he expected that the government of Zimbabwe will take decisive steps to effectively address the increasing risks of company closures and retrenchments that have escalated in the past few weeks.\n\nTo survive the countrys economic downturn, Nampak Zimbabwe will be be focusing on cost-containment measures to protect margins and drive profitability across its operations.\n\nDuring the quarter to the end of December, the company saw demand for packaging material face pressure due to intensified competitor activity. Moreover, it was affected by disruptions to supply chains due to the civil unrest in Mozambique.\n\nWe encountered supply chain disruptions with raw materials arriving via Beira Port, stemming from the political unrest in Mozambique following the disputed election results. Although the raw materials were ultimately received, the delays impacted our delivery capabilities during the festive season, said Van Gend.\n\nHowever, it is the yet to be resolved Zimbabwean economic challenges that the company expects to further affect demand, as the wholesale and retail sectors navigate considerable branch closures that threaten the sustainability of businesses.\n\nDuring the quarter under review, Nampak Zimbabwe reported 23% lower revenues in US dollar terms while trading profit for the period declined by 56%.\n\nThis decrease in revenue reflects the reduced demand across all business units, said the company.\n\nNonetheless, gross profit margins for the period held steady compared to the previous year, while the trading profit margin experienced a 9% drop. Nampak Zimbabwe attributed the reduction in trading margin to the hyperinflation accounting effects from the prior years comparative period.\n\nThe quarter period under review was fraught with fluctuations in exchange rates following a significant depreciation of the local currency.\n\nThe biggest impact though came from increasing challenges with power supply, limiting the companys ability to fully meet customer demand. To mitigate this, Nampak Zimbabwe has had to install generator capacity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17154841/nampak.webp",
            "description": "<p>IOL Nampak Zimbabwe is grappling with a challenging operating environment, compelling the company to implement cost-containment measures as it prepares to divest its stake to Zimbabwe-listed entity TSL. This move comes as Zimbabwe’s economic landscape faces significant challenges exacerbated by recent policy changes and ongoing currency instability. John Van Gend, Nampak Zimbabwe’s managing director, said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nampak-zimbabwe-focuses-on-cost-containment-as-currency-instability-looms/\">Nampak Zimbabwe focuses on cost-containment as currency instability looms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "Man jailed 20 years for raping mentally ill stepdaughter",
            "url": "https://www.newzimbabwe.com/man-jailed-20-years-for-raping-mentally-ill-stepdaughter/",
            "content": "By Staff Reporter\n\nA 61-year-old man from Upper Rangemore, Bulawayo has been sentenced to 20 years imprisonment after raping his stepdaughter who is mentally challenged.\n\nThe man appeared before the Bulawayo Magistrates Court.\n\nAccording to the State, on 21 November 2024, the stepfather covered the complainants mouth and nose and raped her while she was asleep in their family home. The victim is mentally incompetent and thus incapable of consenting.\n\nOn November 21, 2024, at approximately 1500 hours, the accused unlawfully had sexual intercourse with his mentally incompetent stepdaughter (24) who is legally incapable of giving consent.\n\nThe incident occurred at the family home. The accused, who is the stepfather of the complainant, allegedly assaulted her while she was sleeping, wherein he covered her mouth and nose and proceeded to rape her, said the prosecution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter A 61-year-old man from Upper Rangemore, Bulawayo has been sentenced to 20 years imprisonment after raping his stepdaughter who is mentally challenged. The man appeared before the Bulawayo Magistrates Court. According to the State, on 21 November 2024, the stepfather covered the complainant’s mouth and nose and raped her while she was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-20-years-for-raping-mentally-ill-stepdaughter/\">Man jailed 20 years for raping mentally ill stepdaughter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        },
        {
            "title": "Private Investigator Chidawa to further languish in jail as defence case drags on in theft case",
            "url": "https://www.newzimbabwe.com/private-investigator-chidawa-to-further-languish-in-jail-as-defence-case-drags-on-in-theft-case/",
            "content": "By Staff Reporter\n\nA former cop, Tafadzwa Chidawa will further languish in jail after he was remanded in custody while his defence case is dragging on.\n\nChidawa, popularly known as Kedha is currently locked up after his bail was cancelled for failing to appear in court for over a year.\n\nHe is jointly charged with Paradza Passmore Matubu, Perseverance Chisango, Malvern Mutanda, and Francis Takura on US$20,000 fraud allegations.\n\nMutanda isstill on the runand Takura is serving 36 yearsimprisonmentfor robberies.\n\nThe State alleges that the suspects stole US$20,000 from oneMelody Matanhire sometime in 2020.\n\nOn Monday,Chidawa took it to the witness stand to defend himself arguing that he knows nothing about the case.\n\nChidawa told regional magistrate Vongai Guwuriri that it is shocking that his particulars including his police officeridentification cards were found in Takuras car.\n\nChidawa told Muchuchuti that he only knows Takura as his former colleague at ZRP.\n\nTakura also exonerated Chidawa accusing the police of planting thedocuments in his car.\n\nI was arrested in the Central Business District but police drove my car to Highlands police station and I only signed a seizure for the vehicle because when they searched my carthey did not find anything.\n\nThe complainant ( Matanhire) was also tried for the same offence(theft) and she was sentenced.\n\nI never took US$20,000 which belongs to Matanhire, I dont know her and there is no proof to show that I met her, he said.\n\nHe also told the court that Matanhire lied to her husband of 21 years that the money was stolen when she was spending the money with her boyfriend.\n\nAccording to the State papers, Matanhire was in a relationship with Mutanda.\n\nThe court heard that on an unknown date in 2020, Matanhire told Mutanda that she had US$100,000 soiled money which needed some cleaning.\n\nMutanda allegedly told her that the process required US$20,000 in clean notes.\n\nOn August 27 2020, pursuant to the misrepresentation she advised Mutanda that she had managed to secure US$20 000, she then made arrangements with Mutanda to proceed to Blue Ridge Lodge where they were going to clean the money.\n\nUnbeknown to her Mutanda hatched a plan with Chidawa, Takura, Paradzai Matubu and Perseverance Chisango to steal from Melody.\n\nThe court heard that Matanharire handed over the money to Mutanda who then put it in a cooler box for the cleaning process to commence.\n\nAll other accomplices allegedly entered the lodge masquerading as police officers and manhandled Mutanda and took away the cooler box which had the money and they went away.\n\nThe hearing continues on Wednesday.\n\nTakudzwa Jambawu is prosecuting.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17153155/chidawa-e1739806340985.jpg",
            "description": "<p>By Staff Reporter A former cop, Tafadzwa Chidawa will further languish in jail after he was remanded in custody while his defence case is dragging on. Chidawa, popularly known as Kedha is currently locked up after his bail was cancelled for failing to appear in court for over a year. He is jointly charged with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/private-investigator-chidawa-to-further-languish-in-jail-as-defence-case-drags-on-in-theft-case/\">Private Investigator Chidawa to further languish in jail as defence case drags on in theft case </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "18 Feb 2025"
        }
    ]
}