{
    "news": [
        {
            "title": "IMF says Zim highly dollarised as local industry calls for further disinflation",
            "url": "https://www.newzimbabwe.com/imf-says-zim-highly-dollarised-as-local-industry-calls-for-further-disinflation/",
            "content": "IOL\n\nThe International Monetary Fund (IMF) says Zimbabwes economy remains highly dollarised, with any de-dollarisation policies needing gradual implementation while the Confederation of Zimbabwe Industries has called for further disinflation strategies into 2026 to correct pricing and manage stubbornly high inflation.\n\nZimbabwe is pushing for an end to the use of US Dollars across the economy by 2030, coinciding with a possible two year extension of President Emmerson Mnangagwas rule originally scheduled to end in 2028. Mnangagwas party, Zanu PF party has resolved to extend the Zimbabwean leaders tenure and to end dollarisation by 2030.\n\nHowever, the IMF has said in an interview that Zimbabwe remains highly dollarized with any confidence in a local currency needing to be built through credible fiscal and monetary policies, a strengthened FX market, and the absence of quasi-fiscal operations such as providing subsidies or financing government programsoutside of the budgetframework.\n\nThe Zimbabwe Gold (ZiG) local currency Zimbabwe says is backed by foreign currency reserves is largely shunned by locals for transactions. The IMF said Zimbabwe has to ringfence any de-dollarisation efforts by a stable policy environment that will accrue confidence for the local unit of exchange.\n\nConfidence in macro-economic policy and the currency is reinforced by a predictable, rules-based policy environment and progress on economic governance.Advancing these reformsalongside clear, consistent economic policy implementationwould help anchor expectations and bolster confidence, the IMFs chief of mission to Zimbabwe,Wojciech Stanislaw Maliszewski, said by email.\n\nThe Confederation of Zimbabwe Industries (CZI) has called for further disinflation strategies over the next few months. It argued that inflation should be lowered further.\n\nAn inflation rate of 30% is still too high, calling for more disinflation strategies into 2026.The policy target is to have an annual ZiG inflation of 30% by December 2025, said Cornelius Dube, chief economist for the CZI.\n\nAccording to the IMF, theReserve Bank of Zimbabwe (RBZ)has been tighteningits policy stancesince September last year afterhalting monetary financing. This had helpedtolower inflationfrom elevated highs while also easingexchange-rate pressures.\n\nThe gap between official and parallel market rates narrowed, and ZiG inflation declined by mid-2025, though the economy remains highly dollarized, said Maliszewski.\n\nFor the month of October, Zimbabwes inflation in ZiG local currency dropped to32.7%aftershedding 50 percentage points from a rate of 82.7% in the month of September 2025. on the other hand, the USD month-on-month inflation for October 2025 increased to 0.3% from a rate of 0% in the month of September2025.11.4\n\nThe CZI has explained that thismeansthatprices in USD terms remained stable as the observed increase is minimal.\n\nHowever, CZI believes that when the de-dollarisation programme gets rolled out, the inflation differential between ZiG and USD will matter in the decision of which currency to usein transactions.\n\nUSD price stability would make the USD attractive as both a transaction and savings currency. ZiG stability has to be sustainable for a very long time before it can also be considered a close substitute to the USD, said Dube.\n\nThis comes as ZimbabwesUSD year-on-year inflationhas continued on adeclining trend which started in July 2025.\n\nIn October 2025,ZimbabwesUSD inflation declined to 13% fromthe13.4% registered in the month of September. However, a 13% USD inflation is still very high, as it means that savings in USD lost about 13% purchasing power between October 2024 and October 2025, said the CZI.\n\nWith the USD being the main savings currency, it is critical for its inflation to remain very low if savings are to be protected.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>IOL The International Monetary Fund (IMF) says Zimbabwe’s economy remains highly dollarised, with any de-dollarisation policies needing gradual implementation while the Confederation of Zimbabwe Industries has called for further disinflation strategies into 2026 to correct pricing and manage stubbornly high inflation. Zimbabwe is pushing for an end to the use of US Dollars across the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-says-zim-highly-dollarised-as-local-industry-calls-for-further-disinflation/\">IMF says Zim highly dollarised as local industry calls for further disinflation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        },
        {
            "title": "War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm",
            "url": "https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/",
            "content": "By Leopold Munhende\n\nWAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land.\n\nLocal Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds.\n\nAccording to documents gleaned by NewZimbabwe.com, his Ministry is seeking to reopen a case that could grant Rautenbach ownership of land the High Court already decided was not his.\n\nThe war vets, under the Springs Farmers Association, have filed their intent to oppose the ministrys application, arguing that the government cannot relitigate a matter that was final and conclusive and that any further interference puts Zimbabwes land-reform credibility at stake.\n\nThe dispute centres on a March 2025 offer letter issued by Local Government Minister Daniel Garwe, allocating 671 hectares at Springs Farm and 412 hectares at Stuhm to Marimba Residential Properties (Pvt) Ltd as final compensation for land in Aspindale Park, Lochinvar, and Salisbury Park that the company claims to have lost years ago.\n\nHowever, the courts have already ruled on the matter.\n\nIn 2019, the High Court found that businessman Rautenbach and his associated companies had no valid title to the Aspindale property, affirming that the land had been lawfully acquired by the State and allocated to housing co-operatives under the National Housing Delivery Programme.\n\nThat ruling, described by the judge as final and definitive, was never overturned.\n\nDocuments show that while Marimba claims to have lost about 180 hectares in Aspindale, the new offer compensates it with over 1,100 hectares of prime farmland, six times the size and far higher in market and agricultural value.\n\nThe paper trail surrounding Marimba Residential Properties raises more questions than answers.\n\nThe Registrar of Companies confirmed in 2018 that Marimba Residential Properties and Marimba Industrial Properties are not registered companies in our database.\n\nAt the same time, the Registrar of Deeds admitted that the title deed purportedly linking Marimba to the Aspindale property is missing from the record.\n\nDespite those gaps, the company continues to feature in official correspondence and now, in the new compensation offer.\n\nIn their newly filed opposition, the farmers accuse the government of attempting to rescind a ruling made on the merits, which the law does not allow.\n\nThey describe the governments filing as a composite application that is procedurally and substantively defective, arguing that it merges three distinct processes: review, rescission, and interdict into a single motion, something the farmers lawyers say is jurisprudentially untenable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Leopold Munhende WAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land. Local Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/\">War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        },
        {
            "title": "Vandalism attempts led to restriction of Mbuya Nehanda statue – Information Perm Sec",
            "url": "https://www.newzimbabwe.com/vandalism-attempts-led-to-restriction-of-mbuya-nehanda-statue-information-perm-sec/",
            "content": "By Staff Reporter\n\nPermanent Secretary in the Ministry of Information and Publicity, Nick Mangwana, says government restricted public access to the Mbuya Nehanda statue in Harares Central Business District following several attempts of vandalism.\n\nThe statue, unveiled by President Emmerson Mnangagwa in 2021, cost the State a substantial amount of money.\n\nSince its unveiling, the monument which stands at the corner of Julius Nyerere Way and Samora Machel Avenue has been inaccessible to the public, with police officers stationed to guard it.\n\nThe monument was initially accessible to the public. Unfortunately, after a rise in visitor numbers and repeated vandalism attempts, including people trying to push it over or deface it, access had to be restricted, said Mangwana in a post on X.\n\nHe added that government is now working on measures to reopen access to the statue.\n\nTo enable safe public viewing of the Mbuya Nehanda statue, while protecting the iconic monument, the government is creating a new access framework. The President has instructed that this be implemented as soon as possible. We take this opportunity to apologize to the public for the delayed access, he said.\n\nMangwanas response follows criticism after international travel vlogger Davud Akhundzada was denied access to the statue during a recent visit.\n\nAuthorities came under fire for missing an opportunity to market Zimbabwes capital city.\n\nIn a statement, the Ministry of Tourism and Hospitality Industry distanced itself from the incident, saying responsibility for the monument lies with the Ministry of Home Affairs and Cultural Heritage.\n\nWe wish to clarify that the Mbuya Nehanda Statue is a National Heritage Monument managed by the Ministry of Home Affairs and Cultural Heritage. It stands as a proud symbol of Zimbabwes liberation history and identity.\n\nThe site is subject to specific preservation and security protocols and as such, public access to certain areas, including elevated or restricted zones, may be limited for safety, preservation and security reasons.\n\nHowever, as the Ministry of Tourism and Hospitality Industry, we are taking proactive steps to enhance tourist management at such sites. Through a Whole-of-Government Approach Strategy, in coordination with our counterparts at the Ministry of Home Affairs and Cultural Heritage, we are in the process of deploying tourism officers at key heritage and cultural monuments. These officers will facilitate seamless, well-informed and welcoming access for tourists, ensuring a positive experience while safeguarding our national heritage, read the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/03062339/Mbuya-Nehanda.jpg",
            "description": "<p>By Staff Reporter Permanent Secretary in the Ministry of Information and Publicity, Nick Mangwana, says government restricted public access to the Mbuya Nehanda statue in Harare’s Central Business District following several attempts of vandalism. The statue, unveiled by President Emmerson Mnangagwa in 2021, cost the State a substantial amount of money. Since its unveiling, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vandalism-attempts-led-to-restriction-of-mbuya-nehanda-statue-information-perm-sec/\">Vandalism attempts led to restriction of Mbuya Nehanda statue – Information Perm Sec</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        },
        {
            "title": "Glenview residents protest removal of borehole serving thousands of people",
            "url": "https://www.newzimbabwe.com/glenview-residents-protest-removal-of-borehole-serving-thousands-of-people/",
            "content": "By Thandiwe Garusa\n\nResidents of Glenview, one of Harares cholera hotspots, have petitioned Mayor Jacob Mafume to stop the planned demolition of a public borehole that serves more than 2,800 people.\n\nThe move follows a 48-hour removal notice issued by the City of Harare, ordering the clearing of the borehole site to pave way for four residential infill stands. The council cited illegal occupation under municipal by-laws.\n\nThe borehole, drilled in 2019 under the Presidential Borehole Scheme, remains the communitys main source of clean water in an area already suffering from severe shortages. No alternative water source has been proposed to replace it.\n\nIn a petition signed by 280 residents and submitted to the mayor on Wednesday, the community urged council to form a special committee to investigate the land allocations and assess how many boreholes would be affected by the planned housing development.\n\nThe Petitioner beseeches the Harare City Council to establish a Special Committee pursuant to Section 100 of the Urban Councils Act (Chapter 29:15), conduct an investigation into the allocation of infill residential stands in Glen View, determine the number of boreholes that will be affected, and provide recommendations to mitigate the water supply issues that may arise from the removal of the boreholes, the petition reads in part.\n\nResidents warned that demolishing the borehole without providing an alternative water source would violate their constitutional right to water and risk triggering another public health crisis in the cholera-prone suburb.\n\nThey also questioned how stands approved in 2024 could overlap with a borehole installed in 2018 and upgraded in 2025, describing the sequence as evidence of poor planning and possible corruption.\n\nAdding to their frustration, residents said individuals allocated the contested stands have already begun bringing building materials to the site, despite the ongoing dispute.\n\nThe petitioners further demanded that the City of Harare convene a public meeting to release documents showing whether the land was properly allocated before the borehole was drilled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/23184817/Highfields-residents-queuing-for-water-at-a-borehole-in-Highfields-as-the-water-crisis-worsens-in-the-country.jpg",
            "description": "<p>By Thandiwe Garusa Residents of Glenview, one of Harare’s cholera hotspots, have petitioned Mayor Jacob Mafume to stop the planned demolition of a public borehole that serves more than 2,800 people. The move follows a 48-hour removal notice issued by the City of Harare, ordering the clearing of the borehole site to pave way for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/glenview-residents-protest-removal-of-borehole-serving-thousands-of-people/\">Glenview residents protest removal of borehole serving thousands of people</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        },
        {
            "title": "Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story",
            "url": "https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/",
            "content": "By Alois Vinga\n\nFinance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs.\n\nThe World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and US$12,535. In an ideal setting, this level of income would reflect improved living standards for ordinary citizens through equitable distribution of national wealth.\n\nAddressing delegates at the 2026 Pre-Budget Seminar in Bulawayo on Wednesday, Ncube painted a rosy picture of Zimbabwes economy, adding that most citizens are already spending above the daily threshold associated with middle-income economies.\n\nSo, the minimum GNI per capita should be US$4,500 per person, and this is an annual figure. That means that you ought to be able to spend on any given day no less than US$12 per person. Currently, on average, with the GNI per capita of US$3,300, that implies that we are spending US$9 per day, Ncube said.\n\nHe attributed the progress to the successful implementation of the National Development Strategy 1 (NDS1), which he said drove the economy to an average growth rate of 5.6% between 2021 and 2025, surpassing the official target of 5.2%, buoyed by increased infrastructure development. Ncube added that the economy is forecast to expand by 6.6% this year.\n\nHis statement, however, contrasts sharply with the lived reality of many Zimbabweans. The majority of the working population continues to earn less than US$250 per month, while a significant portion of the labour force operates in the informal sector, struggling to meet daily needs amid rising inflation and a weakening local currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>By Alois Vinga Finance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs. The World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/\">Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        },
        {
            "title": "Govt acquires Monomotapa Hotel to cut costs for parliamentarians",
            "url": "https://www.newzimbabwe.com/govt-acquires-monomotapa-hotel-to-cut-costs-for-parliamentarians/",
            "content": "By Alois Vinga\n\nGovernment has officially acquired the historic Monomotapa Hotel to serve as a dedicated lodging facility for Members of Parliament, in a move aimed at curbing expenditure.\n\nFinance Minister Professor Mthuli Ncube made the announcement, describing the acquisition as a strategic step towards increasing efficiency and reducing the financial burden associated with parliamentary operations.\n\nThe move, he explained, will provide MPs with a convenient and cost-effective alternative to expensive private accommodation during parliamentary sessions and national events.\n\nThe governments acquisition of the Monomotapa Hotel underscores our ongoing commitment to improving the welfare of our Parliamentarians while also addressing the broader issue of fiscal responsibility. This initiative is not just about cutting costs, but about ensuring that public funds are used wisely, allowing for more resources to be directed toward national priorities, said Ncube.\n\nAlthough no current figures were provided, a 2013 report highlighted the high cost of hosting MPs in Harare, revealing that sitting allowances, accommodation, and travel expenses for Parliamentarians could easily exceed US$200,000 per week when both Houses were in session. With fuel allowances, travel stipends, and hotel bills, the financial burden had become unsustainable.\n\nThe decision to repurpose Monomotapa Hotel for government use is expected to deliver significant savings, which could be redirected to other national development priorities, thereby improving both efficiency and public service delivery.\n\nThe hotels previous owner, African Sun Limited, sold the property as part of a broader strategy to consolidate its portfolio, a move that reshapes the local hospitality sector. With its prime location and storied past, the hotels new role as a government facility is likely to redefine Harares hospitality landscape and spark debate over the balance between tourism, state infrastructure, and public service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/06043730/momotapa-hotel-entrance.jpg",
            "description": "<p>By Alois Vinga Government has officially acquired the historic Monomotapa Hotel to serve as a dedicated lodging facility for Members of Parliament, in a move aimed at curbing expenditure. Finance Minister Professor Mthuli Ncube made the announcement, describing the acquisition as a strategic step towards increasing efficiency and reducing the financial burden associated with parliamentary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-acquires-monomotapa-hotel-to-cut-costs-for-parliamentarians/\">Govt acquires Monomotapa Hotel to cut costs for parliamentarians</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        },
        {
            "title": "‘One of us’: Ugandan pride in New York mayor with roots in their country",
            "url": "https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/",
            "content": "BBC\n\nMany Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality.\n\nSome have described him as one of their own, saying he inspires them.\n\nA journalist who mentored him during his teenage internship at one of Ugandas leading newspapers told the BBC that there was a lot of excitement in Uganda about Mamdanis rise especially because of his young age. Uganda has the second-lowest median age worldwide of just 16.2, according to the CIA World Factbook.\n\nZohran, 34, is the son of Prof Mahmood Mamdani, a prominent Ugandan academic, while his mother, Mira Nair, is an acclaimed filmmaker.\n\nJournalist Angelo Izama told the BBCs Newsday programme that the younger Mamdani was initially shy while they worked together, but was absolutely determined to get things done.\n\nHe says Zohran is very fond of Kampala, Ugandas capital, which he often mentions.\n\nMahmood Mamdani was raised in Uganda and worked for more than a decade at Makerere University, the countrys main and oldest university. He met his wife in Kampala while she was researching Mississippi Masala, a film about the expulsion of Asians from Uganda under Idi Amin.\n\nProf Mamdani is known for his anti-colonialist scholarship, which examines the legacy of colonialism in Africa and its impact on governance, identity and justice.\n\nMakerere University professor Okello Ogwang says he feels great about Zohrans success, describing him as the son of a colleague. This is somebody from home.\n\nWe have one of us there, he told the BBC.\n\nIt gives me hope that the children we are raising are the hope of this world. As a continent we are missing out on the greatest resource we have  the youth.\n\nWhile many Ugandans had not heard of Zohran until his election, a student at the university said people were very happy, saying it proved that anyone could rise above their background.\n\nIt gives morale, especially to us as youths, said Abno Collins Kuloba. Wherever you have grown up, be it poor or rich, you can become something big, like what [Mamdani] has done.\n\nAnother student, Chemtai Zamzam, said she was happy, for herself and Ugandans. She said Mamdani was an inspiration to her as a young person, as it shows we can become anything we want as long as we put faith and determination.\n\nThe new mayor is also being celebrated elsewhere in the continent.\n\nAbdul Mohamed, an Ethiopian who is a former senior UN and African Union official, describes Mahmood Mamdani as a distinguished scholar of African politics, a man who interrogated power and justice.\n\nHe says having known Zohran since infancy, he sees him as having inherited his fathers commitment to pan-Africanism, his parents courage to think freely, and their belief that one can belong everywhere.\n\nHe says Zohrans rise is symbolic and practical especially to young Africans, asking them to draw from him lessons in politics.\n\nI think through him, [the] power and beauty of multi-ethnic, multi-religious identity found its voice. And Africa is by and large a multi-ethnic and a multi-religious society, he says.\n\nHe adds that as Zohran has demonstrated, young people need to organise and build political action and avoid despair and avoid pure anger.\n\nUganda is holding elections next year, with 81-year-old President Yoweri Museveni seeking another term after almost 40 years in power.\n\nThe Mamdani family also spent at around three years in Cape Town, South Africa, after Mahmood was appointed the Chair of African Studies at the University of Cape Town in the 1990s.\n\nSome South Africans have also been taking pride in his historic election.\n\nHailing his victory as as a remarkable achievement, the imam of Cape Towns Claremont Road Mosque, Rashied Omar, said that Zohrans formative years were shaped, in small part, in our congregation.\n\nHe said that Zohran began his Islamic education at the mosque, and started his schooling at St Georges Grammar.\n\nIt is inspiring to see how Zohrans early South African experiences, though modest, made a lasting impression on his political consciousness and helped shape his creative, community-based approach to politics, Dr Omar said.\n\nAs South African social justice activists, we can now learn from Zohrans example, how to practise progressive politics that resonates with new generations and builds bridges across race, class, and faith, he added.\n\nThe Economic Freedom Fighters (EFF), the fourth-biggest party in South Africa which champions left-wing economic policies, also hailed Zohrans victory as historic.\n\nHis election represents not only a transformative moment for the people of New York but also a powerful signal to the world that progressive justice-driven leadership is rising even in the heart of the global capitalist order, the party said in a statement.\n\nIn Nigeria, a Christian pastor who is a supporter of President Bola Tinubu also welcomed Zohrans victory.\n\nPastor Okezie J Atai said on X that Nigeria cannot be threatenedby US President Donald Trump, whose threats could not subdue the 34-year-old Zohran.\n\nLast week,Trump threatened to take military action to tackle Islamist insurgents in Nigeria, accusing the government of failing to protect Christians.\n\nGovernment officials responded by saying that jihadists were not targeting members of a particular religion and that they had killed people from all faiths, or none.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05180408/mamdani.webp",
            "description": "<p>BBC Many Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality. Some have described him as one of “their own”, saying he inspires them. A journalist who mentored him during his teenage internship at one of Uganda’s leading newspapers told</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/\">‘One of us’: Ugandan pride in New York mayor with roots in their country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        },
        {
            "title": "Back to the future: Why defending Zimbabwe’s Constitution is defending the country",
            "url": "https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/",
            "content": "By Chofamba Sithole\n\nWhen Nelson Chamisa recently declared on X that there is no constitution to protect or defend and that we must instead defend and protect our country, his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when clarity and focus are essential.\n\nTo suggest that there is no constitution to defend is to surrender the very ground upon which the democratic struggle was built. Our constitution is not some detached piece of paperit is the living embodiment of the peoples will, painstakingly won through generations of struggle. To abandon it is to abandon Zimbabwe itself.\n\nWe have been here before. In the late 1990s, Zimbabwe was gripped by a similar sense of national crisis. Corruption, authoritarianism, and economic decline had hollowed out public confidence in the state. Recognising the depth of the malaise, a broad coalition of social movementsfrom labour unions to churches, students, womens groups, and civic activistsconcluded that the countrys salvation lay in a new constitutional order.\n\nOut of this awakening came the National Constitutional Assembly (NCA), spearheaded by the Zimbabwe Congress of Trade Unions under the leadership of Gibson Sibanda and Morgan Tsvangirai. The NCAs mission was clear: to mobilise citizens to write a people-driven constitution that would redefine the relationship between state and citizen.\n\nAlarmed by this groundswell, Robert Mugabes government rushed to produce its own draft through a state-appointed commission. But when this elite-driven constitution was put to a referendum in February 2000, the people rejected it. For the first time in history, Mugabe tasted defeat at the ballot box, because Zimbabweans demanded a constitution of the people, not for the rulers.\n\nThat dream was finally realised in 2013, when, during the inclusive government, the Movement for Democratic Change (MDC) and ZANU-PF agreed to a consultative process that produced a new, progressive, and people-endorsed constitution. Adopted by an overwhelming majority, it became Zimbabwes first truly democratic social contract.\n\nBut from the very beginning, the ruling elite treated this document not as a national covenant but as an inconvenience. After Emmerson Mnangagwa became President following the November 2017 military coup, he led efforts to butcher the new constitution, most notably the presidential running mate clause, to ensure continuity of Big Man, presidential dominance.\n\nNow Mnangagwa seeks, further, to drive a chariot and horses through the same constitution he once swore to uphold. His reported ambition to amend or suspend key provisions to entrench a preferred succession plan amounts to nothing less than a constitutional coup. With a co-opted and compliant parliament, the regime hopes to legalise illegality and codify authoritarianism.\n\nWhat is at stake, therefore, is not simply a factional battle within ZANU-PF between Mnangagwa and his deputy, General Constantino Chiwenga. It is a national crisis that cuts to the very foundations of the Republic. The fight over the constitution is the fight over the soul of Zimbabwe.\n\nIt is in this context that Advocate Nelson Chamisas assertion that there is no constitution to defend may be seen as problematic. The constitution defines who we are, what we aspire to become, and what powers the state may or may not exercise over us.\n\nTo claim that the constitution is in tatters and therefore unworthy of defense is to concede defeat to those who have been tearing it apart. The constitutions fragility is not a reason to abandon it; it is the reason we must defend it all the more vigorously.\n\nThe 2013 Constitution remains a democratising document, a peoples shield against tyranny. It provides the legal, moral, and political framework through which citizens can resist authoritarian excesses. It tells us not just what Zimbabwe is, but what Zimbabwe ought to be.\n\nWithout it, talk of defending the country becomes abstract rhetoric. What country are we defending, if not the one defined by a constitution born of the peoples struggle? What rules guide that defence? What limits restrain it? If the fight for Zimbabwe is undefined, it risks descending into chaos or co-option.\n\nZimbabwe stands today at another historic crossroads. The constitution is under siege. The institutions meant to uphold it have been captured. The opposition has been divided and, in some cases, clearly paid off. Yet this very moment demands that all democratic forces  political, civic, and social  reclaim their original mission: to defend the constitution as the ultimate expression of the peoples sovereignty.\n\nThe answer to authoritarian manipulation is not to discard the constitution but to rally around it. That was the lesson of 1999. It remains the challenge of 2025.\n\nIf the constitution falls, the Republic falls with it.\n\nSo yes, Zimbabwe must be defended, but to defend Zimbabwe is to defend its constitution. The two are one and the same.\n\nHistory has given Nelson Chamisa a through-pass in the penalty box. The question is, will he shoot for the goal by galvanising Zimbabweans to save their constitution, hence their nation?\n\nChofamba Sithole is a veteran Zimbabwean journalist and political commentator.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05121529/chofamba.jpg",
            "description": "<p>By Chofamba Sithole When Nelson Chamisa recently declared on X that “there is no constitution to protect or defend” and that “we must instead defend and protect our country,” his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/\">Back to the future: Why defending Zimbabwe’s Constitution is defending the country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:14",
            "date": "06 Nov 2025"
        }
    ]
}