{
    "news": [
        {
            "title": "Journalist Mhlanga denied bail on appeal by High Court",
            "url": "https://www.newzimbabwe.com/journalist-mhlanga-denied-bail-on-appeal-by-high-court/",
            "content": "By Mary Taruvinga\n\nAlpha Media Holdings (AMH) journalist Blessed Mhlanga has been denied bail on appeal by the High Court.\n\nHe is accused of transmitting informationinciting public violence following a press conference bywar veteran Blessed Geza.\n\nHe was denied bail by Magistrate Farai Gwitima, who ruled that if granted bail, Mhlanga was likely to interfere with witnesses who are his junior subordinates.\n\nThe magistrate also said his lawyers were trying to trivialize a huge offence by treating it lightly.\n\nGwitima said his release would trigger anarchy in Zimbabwe.\n\nMhlanga then mounted the present appeal, which was dismissed by the High Court.\n\nIn passing his ruling judge Justice Gibson Mandaza said the lower court was right in concluding that the journalist was likely to interfere with investigations.\n\nMandaza said there was no need to interfere with the lower courts ruling.\n\nMy view is that the appellant lost it when he took the prosecutions view as an attack on his profession.\n\nHe said everyone, including journalists, should know that no one is above the law.\n\nEveryone should know that they are supposed to practice their job within the confines of the law, the judge said, adding that the state was right when it said he transmitted inciting messages.\n\nMandaza said the finding that he transmitted inciting messages cannot be faulted, although it is accepted that he is not Heart and Soul TV.\n\nThe defence had argued that witnesses statements had not been recorded, so releasing Mhlanga would jeopardise investigations.\n\nChris Mhike, representing Mhlanga also said there was no violence following the publication.\n\nThe judge said the charge is about transmission.\n\nIt is not an essential element of the offence that violence should have occurred, he said.\n\nI therefore associate my sentiments with those of the court below that the statement would affect peace and tranquility. Such a finding based on the messages that were circulated cannot be faulted, Mandaza said.\n\nHe said to allege that Mhlanga is being punished for what Geza said was invalid.\n\nI pointed out for the umpteenth time that the charge is not that he uttered the words. The fact that the messages were uttered by Geza does not change the colour of the allegations, said the judge.\n\nMhike said other suspects get bail, and his clients case was not unique.\n\nApplicants should not equate themselves with other accused persons. The law does not say that, said the judge.\n\nMhike said the presumption of innocence still operated in his clients favour because he is yet to be convicted\n\nBut the judge said that what is debatable is that bail is not an absolute right.\n\nBail is not absolute. You cant just say I deserve the constitutions notions.\n\nIts a qualified privilege which can be denied or granted by the court depending on the circumstances as supported by the law.\n\nMhike had also said the magistrate failed to appreciate that Mhlanga handed himself to the police when it denied him bail.\n\nMandaza said this would have worked in favour of Mhlanga if he had been recorded as a flight risk.\n\nOn the issue of interference. He didnt deny that he was a senior reporter.\n\nSurely the prosecution and the police didnt invent his title.\n\nIf that title was anything to go by, it would mean that the appellant wields significant power at HSTV, the judge said.\n\nOn the issue of public security, Mandaza said the court should take it upon itself to weigh the interests of an accused and that of the law to determine the issues of bail.\n\nThere was nothing amiss in the findings by the court aquo that the release of the appellant will undermine peace and security, the judge said.\n\nGiven the above, I have no doubt that the argument by the applicant that the finding of the magistrate was a misdirection is without merit and must be dismissed.\n\nThe ground of appeal should be dismissed. Most of the issues brought up are triable issues. It is my view there was a proper exercise of discretion in denying the appellant bail by the court aquo.\n\nMy conclusion is that .I did not find any misdirection by the court aquo. The appeal cannot succeed, and in the end, the decision of this court is that the appeal of the appellant against the magistrate be and is hereby dismissed in its entirety. Accordingly, this application is dismissed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Mary Taruvinga Alpha Media Holdings  (AMH) journalist Blessed Mhlanga has been denied bail on appeal by the High Court. He is accused of transmitting information inciting public violence following a press conference by war veteran Blessed Geza. He was denied bail by Magistrate Farai Gwitima, who ruled that if granted bail,  Mhlanga was likely to interfere</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-mhlanga-denied-bail-on-appeal-by-high-court/\">Journalist Mhlanga denied bail on appeal by High Court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "London’s Heathrow airport shuts after fire causes power outage",
            "url": "https://www.newzimbabwe.com/londons-heathrow-airport-shuts-after-fire-causes-power-outage/",
            "content": "Al Jazeera\n\nThe United Kingdoms Heathrow airport has closed until midnight on Friday due to a power outage, throwing the plans of tens of thousands of travellers into chaos.\n\nLondons main airport, which is Europes busiest gateway, said on Friday that it had suffered a significant power failure due to a fire at an electrical substation supplying the facility.\n\nTo maintain the safety of our passengers and colleagues, Heathrow will be closed until 23h59 on 21 March, Heathrow airport said in a post on X.\n\nPassengers are advised not to travel to the airport and should contact their airline for further information. We apologise for the inconvenience.\n\nFlight tracking website FlightRadar24 said the shutdown would affect at least 1,351 flights.\n\nThere were 120 aircraft in the air set to be diverted to alternate airports or return to their origin at the time of the announcement, according to FlightRadar24.\n\nWere trying to stop passengers from travelling to the airport, and then work with airline partners on flights that are delayed, diverted, or cancelled, a Heathrow spokesperson told Al Jazeera.\n\nThey [passengers] can reach out to airline partners to work on rebooking.\n\nHeathrow is one of the most globally connected airports and regularly ranks among the top five busiest gateways worldwide.\n\nThe airport serves more than 200 destinations in nearly 90 different countries and territories, and last year handled nearly 84 million passengers, the largest number on record.\n\nThe true impact of the closure only began to emerge hours after the announcement as the earliest flights depart from Heathrow at 06:00 GMT.\n\nAs the UK began to wake up early on Friday morning, the ripples of the closure were starting to be felt across Asia.\n\nSingapores Changi airport said in a statement that passengers should check with their airline about the status of upcoming flights.\n\nFootage shared on social media showed an inferno several stories high, lighting up the night sky and emitting massive plumes of black smoke.\n\nThe London Fire Brigade said that it had deployed 10 engines and about 70 firefighters to a fire at an electrical substation near the airport in Hayes, west London.\n\nThis is a highly visible and significant incident, and our firefighters are working tirelessly in challenging conditions to bring the fire under control as swiftly as possible, Assistant Commissioner Pat Goulbourne said in a statement.\n\nThe fire has caused a power outage affecting a large number of homes and local businesses, and we are working closely with our partners to minimise disruption. Firefighters have led 29 people to safety from neighbouring properties, and as a precaution, a 200-metre cordon has been established, with around 150 people evacuated.\n\nGoulbourne said the fire would be a prolonged incident, with crews to remain on scene throughout the night.\n\nAs we head into the morning, disruption is expected to increase, and we urge people to avoid the area wherever possible, he said.\n\nDue to the significant amount of smoke, we strongly advise local residents to keep their windows and doors closed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/21065347/heathrow.jpg",
            "description": "<p>Al Jazeera The United Kingdom’s Heathrow airport has closed until midnight on Friday due to a power outage, throwing the plans of tens of thousands of travellers into chaos. London’s main airport, which is Europe’s busiest gateway, said on Friday that it had suffered a “significant” power failure due to a fire at an electrical</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/londons-heathrow-airport-shuts-after-fire-causes-power-outage/\">London’s Heathrow airport shuts after fire causes power outage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Zanu PF youths back Mnangagwa, promise to thwart planned protest against his attempts to stay in power",
            "url": "https://www.newzimbabwe.com/zanu-pf-youths-back-mnangagwa-promise-to-thwart-planned-protest-against-his-attempts-to-stay-in-power/",
            "content": "By Staff Reporter\n\nIn a move that looks like a repeat of events in 2017, Zanu PF youths have backed President Emmerson Mnangagwa in an ongoing power wrangle with his deputy Constantino Chiwenga.\n\nSpeaking at the launch of Mnangagwas Youth Fund in Harare on Thursday, Deputy Secretary for Youth Affairs John Paradza declared that the partys youth will do everything in their power to thwart demonstrations planned by disgruntled war veterans.\n\nIn 2017, youths such as Kudzai Chipanga and Anastancia Ndhlovu were forced to apologise to the nation after publicly backing late President Robert Mugabe in factional fights he eventually lost.\n\nActs of bravado, such as those witnessed at the launch where thousands of youths chanted2030 ndeya EDin support of calls for him to hang on till 2030, against constitutional provisions, culminated in public apologies, one of which was broadcast live on ZBC by the military.\n\nWar veterans, led by Blessed Geza, have set March 31 as the date on which they will protest against Mnangagwas corrupt colleagues and the deteriorating economy. They have called on Zimbabweans to join.\n\nGeza, whose whereabouts are not public, has been laying into Mnangagwa, his cronies such as Wicknell Chivayo, Kudakwashe Tagwirei, Martin Rushwaya while propping up Chiwenga as the rightful successor to deal with Zimbabwes current mess.\n\nThere are things being said on social media that there will be demonstrations. What I can assure you is that as long as I still deputise Machakaire in this wing there will not be any demonstration, said Paradza to raucous applause from youths in attendance at the Harare International Conference Centre (HICC) on Thursday.\n\nWe do not lose sleep over utterances on social media, we want you to be at peace.\n\nOur duty as the youth league is to defend the President and the party.\n\nGeza, who has demanded Mnangagwas immediate resignation, was on Thursday described as delusional by information minister Jenfan Muswere. Zanu PF quickly moved to fire Geza from the party after his first few public utterances.\n\nZimbabweans are encouraged to ignore Gezas delusional rumblings, polemic and reactionary grandstanding is a clear misdirection of ambition, said Muswere.\n\nFactional fights within Zanu PF have seen former allies Mnangagwa and Chiwenga being pitted against each other as the party approaches its elective congress in 2027.\n\nChiwenga, whom many had been made to believe will take over from Mnangagwa, appears to have been dumped despite the central role he played in ensuring Mnangagwas ascent via the 2017 coup.\n\nZanu PF infighting is no longer being played out in the corridors of its headquarters, even party spokesperson Christopher Mutsvangwa was recorded laying into Chiwenga.\n\nMutsvangwa described Chiwenga as unelectable, cruel and unlearned.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/21062326/WhatsApp-Image-2025-03-20-at-15.58.13.jpeg",
            "description": "<p>By Staff Reporter In a move that looks like a repeat of events in 2017, Zanu PF youths have backed President Emmerson Mnangagwa in an ongoing power wrangle with his deputy Constantino Chiwenga. Speaking at the launch of Mnangagwa’s Youth Fund in Harare on Thursday, Deputy Secretary for Youth Affairs John Paradza declared that the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-youths-back-mnangagwa-promise-to-thwart-planned-protest-against-his-attempts-to-stay-in-power/\">Zanu PF youths back Mnangagwa, promise to thwart planned protest against his attempts to stay in power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Zimbabwe, Ethiopia enhance economic cooperation with strategic partnership",
            "url": "https://www.newzimbabwe.com/zimbabwe-ethiopia-enhance-economic-cooperation-with-strategic-partnership/",
            "content": "Fana Media Corporation\n\nThe Minister of Finance of Ethiopia Ahmed Shide, recently held a high-level meeting with the Minister of Finance, Economic Development, and Investment Promotion of Zimbabwe, Professor Mthuli Ncube, to explore areas of mutual interest and collaboration.\n\nThe meeting provided a platform for both nations to exchange insights on key policies and reforms, with Zimbabwe expressing a keen interest in learning from Ethiopias successful economic strategies.\n\nDuring the discussions, Ncube emphasized Zimbabwes interest in Ethiopias approaches to tax policy, social protection programs, and value chain development, particularly in the leather and agro-processing industries.\n\nAdditionally, Zimbabwe sought to gain insights into Ethiopias experiences in managing Sovereign Wealth Funds and Health Insurance Funds. Integrated urban renewal was also identified as a key area of interest, with Zimbabwe looking to learn from Addis Ababas rapid transformation.\n\nAhmed Shide welcomed Zimbabwes interest and reaffirmed Ethiopias commitment to strengthening bilateral cooperation by facilitating knowledge exchange and sharing best practices.\n\nHe also noted that Ethiopia could benefit from Zimbabwes expertise, particularly in the tourism sector. Both ministers emphasized the importance of leveraging each countrys experiences to enhance economic resilience and drive sustainable development.\n\nThe meeting concluded with an agreement to establish technical working groups to facilitate ongoing knowledge-sharing and collaboration in these critical areas. Furthermore, both parties agreed to organize an inaugural experience-sharing visit by a Zimbabwean delegation to Ethiopia in May 2025.\n\nThe ministers reaffirmed their commitment to fostering stronger economic ties and promoting mutual learning opportunities to support inclusive growth and prosperity in both nations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/21053000/ethiopia-zim-finance.jpg",
            "description": "<p>Fana Media Corporation The Minister of Finance of Ethiopia Ahmed Shide, recently held a high-level meeting with the Minister of Finance, Economic Development, and Investment Promotion of Zimbabwe, Professor Mthuli Ncube, to explore areas of mutual interest and collaboration. The meeting provided a platform for both nations to exchange insights on key policies and reforms,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ethiopia-enhance-economic-cooperation-with-strategic-partnership/\">Zimbabwe, Ethiopia enhance economic cooperation with strategic partnership</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "TikTokers call for ‘chubby filter’ to be banned",
            "url": "https://www.newzimbabwe.com/tiktokers-call-for-chubby-filter-to-be-banned/",
            "content": "BBC\n\nTikTok users have told the BBC they think a viral tool which makes people appear overweight should be banned from the platform.\n\nKnown as a chubby filter, the artificial intelligence (AI) tool takes a photo of a person and edits their appearance to look as though they have put on weight.\n\nMany people have shared their before and after images on the platform with jokes about how different they look  however others say it is a form of body shaming and should not be permitted.\n\nExperts have also warned the filter could fuel a toxic diet culture online and potentially contribute to eating disorders.\n\nTikTok has not responded to a request for comment.\n\nSadie, who has 66,000 followers on TikTok, is one of those calling for the mean filter to be banned.\n\nIt felt like girls being like, oh, Ive won because Im skinny and wouldnt it be the worst thing ever to be fat, the 29-year-old from Bristol said.\n\nShe said she had been contacted by women who said they had deleted TikTok from their phones because the trend made them feel bad about themselves.\n\nI just dont feel like people should be ridiculed for their body just for opening an app, she said.\n\nDr Emma Beckett, a food and nutrition scientist, told the BBC she felt the trend was a huge step backwards in weight stigma.\n\nIts just the same old false stereotypes and tropes about people in larger bodies being lazy and flawed, and something to be desperately avoided, she said.\n\nShe warned that could have a broad social effect.\n\nThe fear of weight gain contributes to eating disorders and body dissatisfaction, it fuels toxic diet culture, making people obsess over food and exercise in unhealthy ways and opening them up to scam products and fad diets.\n\nAnd it pressures everyone to conform to narrow beauty and health standards, rather than finding what works best for their own body  that causes harm to everyone, both in physical and mental health.\n\nFilters  which use AI to manipulate a persons appearance  are common on TikTok.\n\nMany are harmless  for example one popular trend makes it appear as if a person was made out of Lego.\n\nThey are often designed by individuals with no link to TikTok  as appears to be the case with the new chubby filter.\n\nSome of the most popular videos using the filterhave been liked tens of thousands of times.\n\nFor the purpose of this article, I used the filter on myself.\n\nI felt incredibly uncomfortable.\n\nAs someone who is very body positive and has struggled with their self-image in the past, using it couldnt be further away from how I personally use social media and I was unhappy that TikTok pushed it to me in the first place.\n\nThis filter appeared on my TikTok For You page the other day despite me not engaging with any weight-related or health content.\n\nAfter watching the video and reading the comments that was it  the way TikToks algorithm works means it began to suggest me similar videos from other people using the filter, and even another where AI can turn you thinner.\n\nThankfully it also began to start showing me creators who were criticising the trend, some of whom weve spoken to for this article.\n\nAI images and filters have become commonplace on TikTok and quickly accepted to be used for fun  the same way some Gen-Zs and Millennials might remember Snapchat filters.\n\nBut filters like these, although they may seem fun, can be very damaging to someones mental health and encourage them to compare themselves not only to others, but an unrealistic version of themselves.\n\nThe BBC has spoken to a number of TikTok users who said they were uncomfortable with the filter.\n\nNina, who lives in north Wales, said she felt it fed into a narrative being spread online tying together peoples appearance with their self-worth.\n\nThis is a toxic view that I thought we were moving away from, she said.\n\nIf a filter is clearly offensive it should be removed, she told the BBC.\n\nEmma, who lives in Ayr, agreed.\n\nMy first thought when I saw the chubby filter was how damaging that would be.\n\nPeople were basically saying they looked disgusting because they were chubby and as a curvier woman, who essentially looks like the after photo on this filter, it was disheartening for me.\n\nNina said she was happy to see people criticising the trend, which she called immoral and insensitive.\n\nWe should be lifting each other up, not shaming each others bodies, she said.\n\nSadie agreed that it should not be allowed  however she felt there might be other things TikTok could do.\n\nMaybe it should have a warning, she said.\n\nIf theres themes of body shaming or an eating disorder or anything like that, I think there should be a way of flagging it where, if these people want to post it, they post it, but it doesnt get pushed to a wider audience.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/21051945/chubby-filter.webp",
            "description": "<p>BBC TikTok users have told the BBC they think a viral tool which makes people appear overweight should be banned from the platform. Known as a “chubby filter”, the artificial intelligence (AI) tool takes a photo of a person and edits their appearance to look as though they have put on weight. Many people have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tiktokers-call-for-chubby-filter-to-be-banned/\">TikTokers call for ‘chubby filter’ to be banned</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Lady Sables provisional squad for Rugby Africa Division One tournament named",
            "url": "https://www.newzimbabwe.com/lady-sables-provisional-squad-for-rugby-africa-division-one-tournament-named/",
            "content": "By Sports Reporter\n\nZimbabwe senior womens rugby team coach Nsikelelo Sibanda has announced a provisional squad for the upcoming Rugby Africa Division One Womens Tournament.\n\nThe competition, set to take place in Ivory Coast from April 9 to 20, will see Zimbabwe competing against Uganda, Tunisia, and the hosts Ivory Coast.\n\nWinner of the tournament earn a spot in the Rugby Africa Cup, joining South Africa, Kenya, and Madagascar.\n\nWith limited time and resources, Sibanda emphasized the urgency of making every training session count.\n\nWe have very little time and resources to pull off an upset in this upcoming tournament, and the whole squad is taking every training opportunity and second on the field very seriously, said Sibanda.\n\nThe provisional squad includes a mix of seasoned players and emerging talents, with several Under-20 players from the recent Harare Provincial Tournament earning a call-up.\n\nThese Under-20 players are currently part of the Harare, Manicaland and Matabeleland Provincial Rugby Leagues, showcasing the depth of young talent available for selection.\n\nThis huge provisional squad includes Under-20 players who just came from the Provincial Tournaments going on and are raising their hands to play. But we will need anything close to a miracle to reach the standard we want in such a short period, he added.\n\nBefore heading to Ivory Coast, the Lady Sables will have their last competitive test in the highly anticipated Nedbank Challenge Cup from March 29 to April 5.\n\nThis will provide the team with valuable match time and an opportunity to finalize the squad selection.\n\nLady Sables Extended Provisional Squad\n\nForwards:\n\nBacks:\n\nLady Sables Technical Team\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/21051306/lady-sables.jpg",
            "description": "<p>By Sports Reporter Zimbabwe senior women’s rugby team coach Nsikelelo Sibanda has announced a provisional squad for the upcoming Rugby Africa Division One Women’s Tournament. The competition, set to take place in Ivory Coast from April 9 to 20, will see Zimbabwe competing against Uganda, Tunisia, and the hosts Ivory Coast. Winner of the tournament</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lady-sables-provisional-squad-for-rugby-africa-division-one-tournament-named/\">Lady Sables provisional squad for Rugby Africa Division One tournament named</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "South Africa spent more than R30m on police operations at Stilfontein",
            "url": "https://www.newzimbabwe.com/south-africa-spent-more-than-r30m-on-police-operations-at-stilfontein/",
            "content": "The Citizen\n\nThe South African government spent just over R30 million retrieving suspects involved in illegal mining at the Buffelsfontein Gold Mine in Stilfontein, North West.\n\nThis was part of Operation Vala Umgodi, which was launched in August last year to combat illegal mining across the country.\n\nThe Stilfontein mine became a focal point as the government, through Mine Safety Rescue Services (MSR), was compelled to intervene and rescue illegal miners who remained underground.\n\nAlthough the rescue mission concluded earlier this year, Operation Vala Umgodi is set to continue in May.\n\nBriefing Parliaments Portfolio Committee on Minerals and Petroleum Resources and Police in a joint meeting on Tuesday, National Police Commissioner Fannie Masemola stressed that illegal mining remains a significant issue across several provinces, including Free State, Gauteng, North West, Limpopo, Mpumalanga, Northern Cape, and KwaZulu-Natal (KZN).\n\nMasemola highlighted that most individuals involved in illegal mining are foreign nationals from the Southern African Development Community (SADC) region.\n\nActing North West Police Commissioner Patrick Asaneng provided details on the extensive law enforcement efforts at Stilfontein.\n\nHe revealed that the operation involved 944 police officers, with R23 million allocated for their deployment and an additional R9.8 million spent on overtime.\n\nThere were instances on many occasions where members had to work more than their prescribed hours of duty to be able to conduct this operation, Asaneng told MPs on Tuesday.\n\nDuring the operation, authorities arrested 1 826 illegal miners who had surfaced from the abandoned mine.\n\nThe arrested individuals included 1 128 Mozambicans, 473 Zimbabweans, 26 South Africans, 197 miners from Lesotho, one Malawian, and one Congolese national.\n\nAdditionally, over 90 bodies were retrieved, though only eight were identified.\n\nThe identified individuals were all foreign nationals, consisting of three from Mozambique, three from Lesotho, and two from Zimbabwe.\n\nWhen the mine rescue plan was started, there were allegations that there are more than 300 bodies underground which could not be brought to the surface, and then, contrary to that, when the mine rescue plan came, they only brought the few, bringing the total to 93, the provincial police commissioner added.\n\nAsaneng further indicated that police had confiscated gold and gold-bearing material worth R52.49 million, along with cash found at the scene.\n\nMineral Resources Minister Gwede Mantashe revealed that South Africa has 6 100 derelict and ownerless mines, which serve as hotspots for illegal mining and related crimes.\n\nIn the North West province alone, there are approximately1 041 such mines.\n\nHowever, he clarified that the Stilfontein mine is not among them, as it has a legally recognised owner.\n\nMantashe pointed out that more than 70% of the mine is owned by Chinese stakeholders.\n\nInitially, locating the owners proved difficult, according to the minister.\n\nWe found them, ultimately, and we didnt struggle to find them because they are not available. We started to find them because they were running away.\n\nWe had to trace them right into China. So, its not an ownerless and derelict mine; it is a mine operated by a company, Mantashe said.\n\nHe also confirmed that his department will engage with the Minerals Council South Africa to address illegal mining.\n\nMeanwhile, Police Minister Senzo Mchunu assured Parliament that investigations are ongoing to identify those who financially benefit from illegal mining.\n\nWere very much interested in that, and those matters are under investigation. We need to get to the bottom of it all, Mchunu said.\n\nLaw enforcement are also probing the potential involvement of law enforcement officials in theescapeof illegal mining kingpin James Tiger Tsoaeli during the rescue mission.\n\nFour police officers, accused of aiding his escape, have already appeared in court twice.\n\nThey were released onR1 000 bail, with their case scheduled to resume on29 May.\n\nCommenting on their alleged role in the escape, Mchunu remarked, I suppose they were subdued by money.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>The Citizen The South African government spent just over R30 million retrieving suspects involved in illegal mining at the Buffelsfontein Gold Mine in Stilfontein, North West. This was part of Operation Vala Umgodi, which was launched in August last year to combat illegal mining across the country. The Stilfontein mine became a focal point as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-spent-more-than-r30m-on-police-operations-at-stilfontein/\">South Africa spent more than R30m on police operations at Stilfontein</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "How Zimbabwe’s debt repayment could lead to economic collapse",
            "url": "https://www.newzimbabwe.com/how-zimbabwes-debt-repayment-could-lead-to-economic-collapse/",
            "content": "By Imraan Buccus | IOL\n\nDebt Thomas Sankara famously argued at the Organisation of African Unity (OAU) in Addis Ababa on 29 July 1987 is a cleverly managed reconquest of Africa.\n\nThe history of the misuse of debt as a form of political control goes back more than two centuries. Haiti, the first independent Black republic in the modern world, was coerced into paying reparations to France for its own freedom, won in 1804 after more than a decade of war against slavery.\n\nThis imposed debt, totalling an estimated $21 billion in todays terms, crippled Haitis economy for over a century. The injustice of this arrangement was not only in its moral absurdity but also in its economic implications, which locked Haiti into cycles of poverty and dependency.\n\nMore recently the Structural Adjustment Programs (SAPs) implemented across Africa during the 1980s and 1990s by the International Monetary Fund (IMF) and the World Bank devastated many countries.\n\nThese programmes were framed as necessary measures to stabilise economies, reduce debt, and promote development through liberalisation and integration into the global economy. However SAPs represented a form of neo-colonial control that seized control of large areas of policy formulation and prioritised the interests of global financial institutions and Western powers over the well-being of African populations.\n\nSAPs imposed severe austerity measures, including cuts to public spending on essential services such as healthcare, education, and social welfare.\n\nThey also mandated the privatisation of state-owned enterprises, the removal of trade barriers, and the liberalisation of financial markets. While these measures were justified as promoting efficiency and growth, they had devastating consequences for the majority of people.\n\nSAPs led to widespread poverty, unemployment, and inequality.\n\nThe dismantling of state support systems meant that millions of Africans lost access to basic services. Farmers, who were often forced to compete with subsidised agricultural products from the Global North, found their livelihoods destroyed.\n\nIn urban areas, the removal of subsidies on food and fuel led to skyrocketing prices, sparking protests and uprisings across the continent. Women, who often bore the brunt of caring for families and communities, were disproportionately affected by the social and economic dislocation caused by SAPs.\n\nThe emphasis on export-oriented growth and the repayment of external debt trapped many African countries in cycles of dependency.\n\nRather than investing in local development, governments were compelled to prioritise debt servicing, often at the expense of their own populations. This perpetuated a form of economic subjugation that mirrored the extractive relationships of colonial rule.\n\nZimbabwes descent into economic turmoil began in earnest with the implementation of the Economic Structural Adjustment Program (ESAP) in 1991. Mandated by the International Monetary Fund (IMF) and the World Bank, ESAP was presented as a pathway to liberalise the economy, attract foreign investment, and stimulate growth.\n\nHowever, the programme came with severe austerity measures, including cuts to public spending, removal of subsidies, and the deregulation of industries.\n\nThe immediate impacts of ESAP were devastating. Healthcare and education, two pillars of Zimbabwes post-independence achievements, suffered severe funding cuts. Public sector retrenchments led to widespread unemployment, while the removal of subsidies on basic goods made life unaffordable for the majority.\n\nThe promise of economic growth never materialised, and instead, Zimbabwe became increasingly reliant on external loans to service its growing debt. By the late 1990s, the structural adjustment program had left the economy weakened and the population in a state of profound distress.\n\nAs Zimbabwe grappled with the fallout of structural adjustment, its political landscape became increasingly fraught.\n\nIn 2000 ordinary Zimbabweans, desperate for land, began occupying white owned commercial farms. Seeking to sustain its collapsing legitimacy the Zanu-PF government sought to take over the process of land reform initially driven from below.\n\nIn response, the United States and the European Union imposed sanctions on Zimbabwe. The Zimbabwe Democracy and Economic Recovery Act (ZDERA) of 2001, enacted by the US, imposed a clandestine embargo on Zimbabwe.\n\nIt officially made it US policy to block Zimbabwes access to loans and investment from international financial institutions, such as the IMF and the World Bank. Senior US officials, who hold influential positions in many multilateral institutions, were prohibited under ZDERA from voting to support Zimbabwes financial needs.\n\nThis legislation has not only entrenched Zimbabwes economic isolation but also created significant barriers to recovery, further impoverishing an already struggling population.\n\nUN human rights experts argued that the human rights of ordinary Zimbabweans suffer greatly from the consequences of sanctions, and that sanctions and various forms of over-compliance with sanctions have had an insidious ripple effect on the economy  and on the enjoyment of fundamental human rights.\n\nThese findings underscore how punitive economic measures often harm the most vulnerable populations rather than achieving their stated political objectives.\n\nThe prohibition of debt relief and loans placed Zimbabwe in an economic stranglehold. Without access to international credit, the government struggled to finance development projects or stabilise the economy.\n\nHyperinflation, which reached its peak in 2008, wiped out savings and plunged millions into poverty.\n\nZanu-PF is authoritarian and corrupt but while mainstream Western narratives blame Zimbabwes leadership for the crisis, the role of sanctions in deepening the countrys economic collapse is seldom acknowledged.\n\nIn 2023, President Biden removed Zimbabwe-specific sanctions under the Treasury program. However ZDERA remains in force, blocking debt relief and restricting Zimbabwes access to loans from international financial institutions. Experts estimate that banks lose about $1bn annually in higher bank charges because of ZDERA.\n\nThe lifting of ZDERA and the provision of debt relief are critical steps toward economic recovery. If former white land owners are to be compensated for the expropriation of their farms that money must come from the coffers of the United Kingdom which never made good on its promises to fund reform.\n\nIn July 2020, a compensation deal was signed in Zimbabwe offering $3.5 billion to roughly 4,000 white former landowners for property expropriated in the land reform process of the early 2000s. This agreement was presented as an effort to mend relations with Western powers and restore Zimbabwes access to international financial markets.\n\nZimbabwe continues to grapple with extreme poverty, manifesting in widespread unemployment, chronic hunger, and inadequate income for the majority of its population.\n\nUnemployment is endemic. In 2019 the World Bank reported that as of 2019, 39.8% of Zimbabweans lived below the international poverty line of $2.15 per day, with 85% falling below the upper middle-income poverty line of $6.85 per day.\n\nFood insecurity is also an acute problem. In December last year, the U.N. World Food Programme warned of an impending dry season that could exacerbate hunger for millions already affected by drought. This dire situation has created a cycle of deprivation, deepening inequality and undermining the potential for long-term economic recovery.\n\nHuge numbers of people have had to leave the country to find livelihoods, with South African and the United Kingdom gaining many well educated people.\n\nNow, Zimbabwes government faces a dire ultimatum. US restrictions will not be removed unless the government fulfils its pledge to pay the $3.5 billion to white farmers who profited from colonial rule and post-independence land ownership patterns.\n\nThese billions, amounting to nearly half of Zimbabwes annual revenue, are unattainable for a nation already teetering on economic collapse.\n\nAt a time when Zimbabwe is ranked among the four most food-insecure countries globally and on the brink of man-made starvation, this demand can only deepen the humanitarian crisis.\n\nWhen Zimbabwe gained independence in 1980, the Lancaster House Agreement included a commitment from the United Kingdom to provide funding for land reform.\n\nThis was intended to facilitate a peaceful transition by compensating white farmers and redistributing land to the Black majority who had been dispossessed during colonial rule. However, this promise was not fully honoured.\n\nWhile some initial funds were provided, they fell far short of what was needed to address the land issue comprehensively. By the late 1990s, the UK had withdrawn its financial support for land reform.\n\nThe demand for the Zimbabwean government to pay $3.5 billion to the former white farmers who lost land during the land reform process can only mean that the Zimbabwean people will be further impoverished and Zimbabwes institutions, which are already in crisis, further degraded. If the farmers are to be compensated that money must come from the United Kingdom.\n\nNow that Donald Trump has turned on South Africa, citing possible land reform as well as South Africas position in support of Palestine, we must face the possibility that we may now also face the risk of being subject to sanctions.\n\nA problem once faced by the people of countries such as Cuba, Venezuela and Zimbabwe could conceivable become a crisis for our people too. In this moment it is essential that, while sustaining our critiques of the corrupt and authoritarian regime in Harare, we stand with the Zimbabwean people.\n\nDr Buccus is senior research associate at ASRI.The views expressed here do not necessarily represent those of Independent Media or IOL\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/17050648/harare.webp",
            "description": "<p>By Imraan Buccus | IOL “Debt” Thomas Sankara famously argued at the Organisation of African Unity (OAU) in Addis Ababa on 29 July 1987 “is a cleverly managed reconquest of Africa.” The history of the misuse of debt as a form of political control goes back more than two centuries. Haiti, the first independent Black</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-zimbabwes-debt-repayment-could-lead-to-economic-collapse/\">How Zimbabwe’s debt repayment could lead to economic collapse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "DStv gives Mzansi’s most popular podcasters their own TV shows",
            "url": "https://www.newzimbabwe.com/dstv-gives-mzansis-most-popular-podcasters-their-own-tv-shows/",
            "content": "TimesLive\n\nDStv has rewarded South Africas top-performing podcasters with their own TV shows.\n\nPopular local channels Mzansi Wethu and Mzansi Magic are set to introduce new shows from April 10 at 5.30pm, based on podcasts with largest numbers of viewers. These includePodcast and Chill with Mac G,Against The Wall with Skeem GP,Awkward Dates with Lasizwe, Joseph Dary,People Need Comedy with Mpho Popps,Spreading Humours,Open Chats PodcastandPiano Pulse.\n\nA source close to the situation suggests that DStv took a well-calculated move to rope in the internets most popular broadcasters, because technology is continuously evolving and many DStv subscribers have already shifted their focus to podcasts.\n\nThis move will convert podcasters subscribers into DStv viewers  and will work in both postcasters and DStvs favour, said source.\n\nDStv is dedicated to staying in sync with the fast-evolving viewing tastes of Mzansis youth. This is just the start of an exciting journey as it continues to roll out fresh, innovative content.\n\nThis is a revolution, a bold step into the future where linear television meets the gutsy, unfiltered world of digital storytelling, says Shirley Adonisi, director for M-Nets local entertainment channels.\n\nThese creators have redefined entertainment and now were welcoming them to shake up the traditional TV space and we are excited to be at the forefront of this transformation.\n\nThe weekly line-up of new shows offers something for every viewer:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/21044819/macg.webp",
            "description": "<p>TimesLive DStv has rewarded South Africa’s top-performing podcasters with their own TV shows. Popular local channels Mzansi Wethu and Mzansi Magic are set to introduce new shows from April 10 at 5.30pm, based on podcasts with largest numbers of viewers. These include Podcast and Chill with Mac G, Against The Wall with Skeem GP, Awkward Dates with Lasizwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dstv-gives-mzansis-most-popular-podcasters-their-own-tv-shows/\">DStv gives Mzansi’s most popular podcasters their own TV shows</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Zimbabwe ranks third in top 10 African countries with the highest diesel prices in March 2025",
            "url": "https://www.newzimbabwe.com/zimbabwe-ranks-third-in-top-10-african-countries-with-the-highest-diesel-prices-in-march-2025/",
            "content": "Business Insider Africa\n\nUnlike last month, when diesel prices in Africa were reported to have been fluctuating, diesel prices in the continent for the current month seems stable.\n\nWhile this may appear as a positive, it is still important to note that without a drop in diesel prices for some African countries, they are still set to still suffer the consequences of inflation, as stable diesel prices do not deter the fact that these countries still boast some of the worlds highest diesel costs.\n\nHigh diesel costs, alongside, poor energy infrastructure, and a lack of oil reserves ensure that some countries on the continent are subject to internal factors that drive up the cost of living.\n\nHistorically, high diesel prices have exerted significant pressure on African economies, particularly those heavily reliant on diesel for transportation and industrial activities.\n\nIn nations such as the Central African Republic, diesel prices have soared to over $2 per litre, the third highest in the world, driven by heavy reliance on fuel imports and logistical challenges.\n\nSimilarly, Zimbabwe faces diesel costs of $1.550 per litre, exacerbated by currency instability and high import duties.\n\nThese more expensive diesel prices have raised operational expenses for firms, particularly in manufacturing, shipping, and agriculture.\n\nAs a result, businesses may pass on these higher costs to customers, causing inflationary pressures and decreased buying power among households.\n\nWith that said, here are the African countries with the highest diesel prices for March 2025, according toGlobalPetrolPrices, which last updated its data on the 17th of the month.\n\nLike the previous month, global average price for diesel remains at 1.20 U.S. Dollar per liter.\n\nCompared to thetop 10 list for February, diesel prices for CAR, Seychelles, Cameroon, and Burundi, all increased marginally.\n\nWhile diesel prices for Malawi, Zimbabwe, Mozambique, Guinea, and Uganda saw a reduction.\n\nDiesel price for Sierra Leone remained the same.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/23171814/Fuel-Prices.jpeg",
            "description": "<p>Business Insider Africa Unlike last month, when diesel prices in Africa were reported to have been fluctuating, diesel prices in the continent for the current month seems stable. While this may appear as a positive, it is still important to note that without a drop in diesel prices for some African countries, they are still</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ranks-third-in-top-10-african-countries-with-the-highest-diesel-prices-in-march-2025/\">Zimbabwe ranks third in top 10 African countries with the highest diesel prices in March 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "22 Mar 2025"
        }
    ]
}