{
    "news": [
        {
            "title": "Elvis Chipezeze wins Carling Knockout Cup Player of the Tournament award",
            "url": "https://www.newzimbabwe.com/elvis-chipezeze-wins-carling-knockout-cup-player-of-the-tournament-award/",
            "content": "By Sports Reporter\n\nWarriors goalkeeper Elvis Chipezeze has been crowned Carling Knockout Cup Player of the Tournament at the 2024/25 Betway Premiership Awards held on Tuesday evening.\n\nChipezeze edged out Iqraam Rayners and Magesi FC teammate Edmore Chirambadare to claim the prestigious accolade.\n\nThe veteran shot-stopper was instrumental in Magesi FCs Cup success, earning four Player of the Match awards during the tournament, which the club went on to win.\n\nChipezeze also played a pivotal role in helping Magesi survive relegation, a run highlighted by him being named Betway Premiership Player of the Month for March.\n\nHe finished the season as one of the leagues top goalkeepers, keeping 12 clean sheets in 30 matches.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14051412/Elvis-Chipezeze.jpg",
            "description": "<p>By Sports Reporter Warriors goalkeeper Elvis Chipezeze has been crowned Carling Knockout Cup Player of the Tournament at the 2024/25 Betway Premiership Awards held on Tuesday evening. Chipezeze edged out Iqraam Rayners and Magesi FC teammate Edmore Chirambadare to claim the prestigious accolade. The veteran shot-stopper was instrumental in Magesi FC’s Cup success, earning four</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elvis-chipezeze-wins-carling-knockout-cup-player-of-the-tournament-award/\">Elvis Chipezeze wins Carling Knockout Cup Player of the Tournament award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "30 Jul 2025"
        },
        {
            "title": "Maswanhise voted Motherwell Player of the Month",
            "url": "https://www.newzimbabwe.com/maswanhise-voted-motherwell-player-of-the-month/",
            "content": "By Sports Reporter\n\nWarriors forward Tawanda Maswanhise has been voted Motherwell FCs Player of the Month for July, following an impressive run in the Premier Sports Cup.\n\nThe 22-year-old netted four goals in as many games, helping the Scottish side reach the Round of 16, where they will face St Johnstone.\n\nThank you for voting me for the Player of the Month. Thank you for the support, and hopefully many more Player of the Months for me and others, Maswanhise said after receiving the award.\n\nHe edged out fellow nominees Lukas Fadinger, Apostolos Stamatelopoulos, and Callum Slattery to clinch the honour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30155431/t.-maswanhise.jpeg",
            "description": "<p>By Sports Reporter Warriors forward Tawanda Maswanhise has been voted Motherwell FC’s Player of the Month for July, following an impressive run in the Premier Sports Cup. The 22-year-old netted four goals in as many games, helping the Scottish side reach the Round of 16, where they will face St Johnstone. “Thank you for voting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhise-voted-motherwell-player-of-the-month/\">Maswanhise voted Motherwell Player of the Month</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "30 Jul 2025"
        },
        {
            "title": "VP Chiwenga celebrates ex-wife Marry’s assets forfeiture, auctioning in SA – says he reported her criminal activities",
            "url": "https://www.newzimbabwe.com/vp-chiwenga-celebrates-ex-wife-marrys-assets-forfeiture-auctioning-in-sa-says-he-reported-her-criminal-activities/",
            "content": "By Staff Reporter\n\nVice President Constantino Chiwenga has disclosed that he was the one who reported his ex-wife, Marry Mubaiwas alleged criminal activities, and has welcomed the recent forfeiture and auctioning of her assets in South Africa.\n\nMubaiwa has lost her luxury home in Pretoria, along with two high-end vehicles, in the neighbouring country.\n\nOn Monday, the National Prosecuting Authority (NPA) confirmed the Gauteng High Courts ruling from 5 December 2022, which stipulated that Mubaiwas assets, a property in Sterrewag and two Land Rover Range Rovers, were the products of money laundering and illicit financial flows.\n\nOne of the vehicles has already been auctioned off, with the funds intended to compensate victims.\n\nThe ruling, which follows a preservation order issued in 2022, strengthens cross-border efforts to recover assets suspected of being gained through criminal activity. For Mubaiwa, the loss represents yet another setback in her ongoing legal battles.\n\nIn a statement released through his legal representatives, Machingura Legal Practitioners, Chiwenga hailed the development as significant and praised the collaborative efforts between the National Prosecuting Authority of Zimbabwe and its South African counterparts.\n\nOur client welcomes this significant development and commends the collaborative efforts between the NPA of Zimbabwe and its South African counterparts in pursuing justice across borders. The ruling by the Gauteng High Court affirms the principle that proceeds of crime have no sanctuary within the region, the statement read.\n\nChiwengas lawyers also stated that the forfeiture of Mubaiwas property would see the proceeds repatriated to Zimbabwe, in line with the global fight against illicit financial flows and the recovery of assets acquired through unlawful means.\n\nThe VP maintains that he reported his ex-wife after becoming aware of her alleged criminal activity.\n\nOur client wishes to place on record that upon becoming aware of the unlawful activities in question, he promptly reported the matter and has since rendered his full cooperation to the NPA. His actions were motivated solely by the national interest and in furtherance of justice and accountability, the statement added.\n\nMubaiwa, who has been in ill health for some time, has endured significant personal losses beyond the forfeiture of assets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22055746/Chiwenga-and-Wife.jpeg",
            "description": "<p>By Staff Reporter Vice President Constantino Chiwenga has disclosed that he was the one who reported his ex-wife, Marry Mubaiwa’s alleged criminal activities, and has welcomed the recent forfeiture and auctioning of her assets in South Africa. Mubaiwa has lost her luxury home in Pretoria, along with two high-end vehicles, in the neighbouring country. On</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vp-chiwenga-celebrates-ex-wife-marrys-assets-forfeiture-auctioning-in-sa-says-he-reported-her-criminal-activities/\">VP Chiwenga celebrates ex-wife Marry’s assets forfeiture, auctioning in SA – says he reported her criminal activities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "30 Jul 2025"
        },
        {
            "title": "Rangers injured following elephant attacks in Sengwa Chirisa Safaris",
            "url": "https://www.newzimbabwe.com/rangers-injured-following-elephant-attacks-in-sengwa-chirisa-safaris/",
            "content": "By Staff Reporter\n\nTwo Zimbabwe Parks and Wildlife Management Authority (ZimParks) rangers sustained critical injuries after they were attacked by elephants in Sengwa Chirisa Safaris Tuesday afternoon, according to officials.\n\nZimParks spokesperson Tinashe Farawo said the two have since been airlifted to Harare for urgent medical attention.\n\nOne of the rangers suffered a broken arm while fleeing, whilst the other was gored, sustaining abdominal wounds and fractures to his arm and leg.\n\nThe incident occurred after the duo was deployed to investigate a reported case of a snared buffalo that was perceived to be a potential danger to the community.\n\nOn the way, they encountered a herd of elephants with calves which charged at them, forcing them to flee in different directions, Farawo said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/10153528/unnamed-2.jpg",
            "description": "<p>By Staff Reporter Two Zimbabwe Parks and Wildlife Management Authority  (ZimParks) rangers sustained critical injuries after they were attacked by elephants in Sengwa Chirisa Safaris Tuesday afternoon, according to officials. ZimParks spokesperson Tinashe Farawo said the two have since been airlifted to Harare “for urgent medical attention.” One of the rangers suffered a broken arm</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rangers-injured-following-elephant-attacks-in-sengwa-chirisa-safaris/\">Rangers injured following elephant attacks in Sengwa Chirisa Safaris</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "30 Jul 2025"
        },
        {
            "title": "‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home",
            "url": "https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/",
            "content": "IOL\n\nMany Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation.\n\nThese were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa forthe 2025 Liberation Movements Summit hosted by the African National Congress (ANC) in Kempton Park.\n\nThe summit concluded on Monday and was hosted under the theme: Defending the liberation gains, advancing integrated socio-economic development, strengthening solidarity for a better Africa.\n\nSouthern African liberation movements, including the ANC, Peoples Movement for the Liberation of Angola (MPLA), Namibias ruling party, the South West Africa Peoples Organisation (Swapo); Mozambiques Frente de Libertao de Moambique (Frelimo); Zanu-PF, and Tanzanias ruling Chama Cha Mapinduzi (CCM) were represented at high level at the summit in Gauteng.\n\nMutsvangwa, in an interview withbroadcaster Newzroom Afrika, was asked for his views on the prevailing political and economic situation in Zimbabwe, which has resulted in the extensive migration of Zimbabweans into South Africa, estimated in the millions, sparking tensions in South African communities.\n\nIn his response, Mutsvangwa said Zimbabweans in South Africa are seeking greener pastures, but the situation back home has significantly improved.\n\nIt is the search for better pastures, that is natural. South Africa had the advantage of having comparative access to capital as a white apartheid state. In colonial times, capital into Africa followed white, and South Africa has the biggest white population on the African continent. All those Western countries gave South Africa a certain edge in access to capital.\n\nWe in Zimbabwe/Rhodesia were second in terms of our white population. We also had comparatively better access to capital than any other African country, and we had migration of labour from Mozambique, Malawi, and Zambia into Zimbabwe.\n\nThe former Zimbabwean ambassador to the Peoples Republic of China said people follow where they see an advantage in terms of development and capital.\n\nNow things have changed. We are now having capital in a flat global world where China can supply capital, India can supply capital, Riyadh can supply capital, so we now have an Africa that is going to global markets, getting capital. That discrepancy in access to capital, which was the case for the colonial era, is beginning to disappear.\n\nYou cannot believe it, there is now a seamless environment between life in Zimbabwe and life abroad. That is why our diaspora is coming back to Zimbabwe, putting a lot of money  our diaspora feels at home, they are now beginning to invest at home. For your information, the biggest diaspora migration is white.\n\nHe said the white Zimbabweans who had fled the country at the onset of majority rule in 1980 make up a good number of the people moving back into the landlocked Southern African nation ruled by President Emmerson Mnangagwa.\n\nSo the return of the white diaspora back to Zimbabwe is actually an indication that things are getting better in Zimbabwe. Remember we are operating the hardest currency in the world, the US dollar, and if you can make your economy succeed on the back of the US dollar, it means you are doing very well as a country, said theWar Veterans Association chairperson.\n\nSpeaking to IOL,Dr Alexander Rusero, head of the department of international relations and diplomacy at the Africa University situated in Mutare, Zimbabwe, said the landlocked country seemingly has its worst times behind it  economically and politically.\n\nI think in all fairness, Zimbabwe has had its bad tide and we are definitely past that in as much as the mess we were once in as a country is concerned. That explains why you hear an opposition voice. We are as good as not having an opposition in Zimbabwe, and if you want to look at Zimbabwes dynamics currently, just look at the balance of forces within Zanu-PF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>IOL Many Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation. These were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/\">‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "30 Jul 2025"
        },
        {
            "title": "Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project",
            "url": "https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project.\n\nTwo months back, the treasury had not disbursed enough funds withconstruction of the dam set to be completed this year.\n\nAccording to Lands Deputy Minister, Vangelis Haritatos, the Treasury was releasing funds in drips and drops which cannot make any significant changes.\n\nThe Gwayi-Shangani project, which is supposed to be a permanent fix to Bulawayos water shortages, has faced delays and failed to meet several deadlines since work started in 2004.\n\nThe most recent deadline, which was set by the government, was for the dam to be completed by the 2023/2024 summer cropping season, which it also missed.\n\nIn a statement posted on the social media platform X under his pseudonym Jamwanda, the Deputy Chief Secretary forPresidential Communications, George Charamba said US$10 million has already been disbursed.\n\nPresident ED Mnangagwa has ordered the finance ministry to ensure a monthly disbursement of US$5 million towards completion of the stalled Gwayi-Shangani dam.\n\nSo far US$10m has been released, ensuring some four meters of the all concrete wall are done, he wrote.\n\nIn 2018, Mnangagwa toured the Gwayi-Shangani dam and pledged to do everything in his power to ensure the project is completed by the end of 2019 and to date, it has not been completed.\n\nLast year, the government allocated ZiG1,2 billion in the national 2025 budget to complete Lake Gwayi-Shangani and Kunzvi Dam which is now at 72% completion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29182454/gwayi.webp",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project. Two months back, the treasury had not disbursed enough funds with construction of the dam set to be completed this year. According to  Lands Deputy Minister, Vangelis Haritatos,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/\">Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "30 Jul 2025"
        }
    ]
}