{
    "news": [
        {
            "title": "Caledonia Plc appoints Ross Jerrard new CFO",
            "url": "https://www.newzimbabwe.com/caledonia-plc-appoints-ross-jerrard-new-cfo/",
            "content": "By Alois Vinga\n\nCALEDONIA Mining Corporation Plc (Caledonia) has appointed Ross Jerrard as the new Chief Finance Officer.\n\nHis appointment is with immediate effect.\n\nHe takes over from outgoing CFO,Chester Goodburn who is set to step down from his role on March 24 2025, following the publication of Caledonias financial results for the year to December 31, 2024.\n\nJerrard brings extensive experience in financial leadership, having been the CFO of Centamin Plc from April 2016 until its acquisition by AngloGold Ashanti Plc in November 2024 for a deal value of US$2.5 billion.\n\nCentamin was a former FTSE-250 dual-listed (London and Canada) mining company with operations in Egypt and West Africa. Centamins flagship asset was the Sukari gold mine in Eqypt which is one of the worlds largest gold mines producing 450,000 ounces of gold per annum.\n\nJerrard is a member of the Institute of Chartered Accountants of Australia and New Zealand and the Institute of Chartered Accountants of Zimbabwe.\n\nCaledonia Plc CEO Mark Learmonth expressed gratitude to the services extended by Goodburn as he welcomed the incoming CFO.\n\nChester has made a substantial contribution to Caledonias growth since he joined us in 2014, the last two-and-a-half years as CFO. Along with the board and his colleagues, I thank him for his time at Caledonia and we wish him well in his future endeavours.\n\nI am pleased to welcome Ross to Caledonia. He brings a depth and breadth of experience which will be invaluable to Caledonia as we advance our strategy to become a mid-tier, Zimbabwe-focussed gold producer, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/04025045/Caledonias-chief-executive-officer-Mark-Learmonth.jpeg",
            "description": "<p>By Alois Vinga CALEDONIA Mining Corporation Plc  (Caledonia) has appointed Ross Jerrard as the new Chief Finance Officer. His appointment is with immediate effect. He takes over from outgoing CFO, Chester Goodburn who is set to step down from his role on March 24 2025, following the publication of Caledonia’s financial results for the year to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caledonia-plc-appoints-ross-jerrard-new-cfo/\">Caledonia Plc appoints Ross Jerrard new CFO</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "US$7 million Presidential Goats scheme fraud trial postponed again; lawyer says Chimombe is sick and needs time to heal",
            "url": "https://www.newzimbabwe.com/us7-million-presidential-goats-scheme-fraud-trial-postponed-again-lawyer-says-chimombe-is-sick-and-needs-time-to-heal/",
            "content": "By Mary Taruvinga\n\nJailed businessman, Mike Chimombe failed to show up for trialMondayin a case he is accused of defrauding the state of US$7 million in a Presidential Goats Scheme.\n\nAccording to a letter from doctors submitted before High Court judge Pisirayi Kwenda, Chimombe is currently ill and will require at least seven days to recuperate.\n\nHis lawyer, Ashiel Mugiya asked for a postponement of the trial to next Monday to allow his client to heal.\n\nThe basis of the application is that the second accused person, Mike Chimombe is not feeling well and is not in a state that he could stand trial. I received a document dated the 22ndof February 2025 in which a medical practitioner attended to the second accused person.\n\nThe document indicates that the accused is expected to recuperate within seven days so my application is that the matter be postponed to Monday next week, on the 3rdof March for commencement of trial, Mugiya submitted.\n\nThe court heard the letter was written by Dr D Ngwaru.\n\nMugiya also requested a court order directing that Chimombe be examined by a state doctor.\n\nI so pray that this directive will be issued by the court, he said.\n\nWitness Mabhaudhi representing the state said he was not opposed to the postponement but shot down the request to have a courtorderissued as requested by Mugiya.\n\nIts unlike a mental health issue. No one is challenging that medical report.\n\nWe expect him (Chimombe) to be here on Monday so there is no need for him to be examined by a doctor. The matter has been remanded so that should suffice, he said.\n\nThe presiding judge Kwenda granted a postponement of the trial to Monday but agreed with the state and said he would not issue a court order for Chimombe to be seen by state doctors.\n\nChimombe is jointly charged with his colleague Moses Mpofu.\n\nThe two have been in custody since their arrest in June last year with all their attempts to secure freedom having failed.\n\nThere have been many false starts to the duos trial from the time they were indicted last year.\n\nThe two made a lengthy application for referral of their case to the Constitution Court without luck.\n\nTheir trial has also been postponed on several occasions for various reasons.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga Jailed businessman, Mike Chimombe failed to show up for trial Monday in a case he is accused of defrauding the state of US$7 million in a Presidential Goats Scheme. According to a letter from doctors submitted before High Court judge Pisirayi Kwenda, Chimombe is currently ill and will require at least seven days to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us7-million-presidential-goats-scheme-fraud-trial-postponed-again-lawyer-says-chimombe-is-sick-and-needs-time-to-heal/\">US$7 million Presidential Goats scheme fraud trial postponed again; lawyer says Chimombe is sick and needs time to heal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "Journalist Blessed Mhlanga arrested over Geza interview; accused of transmitting information that incites violence",
            "url": "https://www.newzimbabwe.com/journalist-blessed-mhlanga-arrested-over-geza-interview-accused-of-transmitting-information-that-incites-violence/",
            "content": "By Costa Nkomo\n\nHeart and Soul Television (HSTV) journalist Blessed Mhlanga has been arrested and charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23. The charges relate to Mhlanga granting an interview to Blessed Geza, a staunch opponent of the Mnangagwa 2030 agenda, war veteran, and Zanu PF Central Committee member.Section 164 pertains to the transmission of information that incites violence or causes damage to property.Geza had issued press briefings and interviews through HSTV, anchored by Mhlanga, calling for President Emmerson Mnangagwa to resign from officeimmediately, adding that failure to which the people of Zimbabwe will use the constitution to assist him to step down.Last week, police issued a statement appealing to the public for informationregardingMhlangas whereabouts. Mhlanga denied that he was on the run andstatedthat he would present himself to the police on Monday. Upon presenting himself to the Harare Central Police State CID Law and Order department, Mhlanga was charged andsubsequentlydetained.Alpha Media Holdings owner Trevor Ncube posted on his X account on Monday afternoon, informing the public of Mhlangas arrest.I condemn in the strongest terms the arrest and detention of Blessed Mhlanga today. Dhara is spending the night in police custody accused of Transmission of data message inciting violence or damage to property. This followsHStvNewsbroadcast of an interview with Blessed Geza. This is punishing Dhara for doing his work as a journalist. Dhara is a principled and courageous journalist who will not be broken by this brazen harassment and intimidation, Ncube wrote.\n\nI condemn in the strongest terms the arrest and detention of@bbmhlangatoday. Dhara is spending the night in police custody accused of Transmission of data message inciting violence or damage to property. This follows@HStvNewsbroadcast of an interview with Blessed Geza. Thispic.twitter.com/MpMpbFa0js\n\n Trevor Ncube (@TrevorNcube)February 24, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24145559/blessed.jpeg",
            "description": "<p>By Costa Nkomo Heart and Soul Television (HSTV) journalist Blessed Mhlanga has been arrested and charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23. The charges relate to Mhlanga granting an interview to Blessed Geza, a staunch opponent of the Mnangagwa 2030 agenda, war veteran, and Zanu PF Central Committee</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-blessed-mhlanga-arrested-over-geza-interview-accused-of-transmitting-information-that-incites-violence/\">Journalist Blessed Mhlanga arrested over Geza interview; accused of transmitting information that incites violence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "Urban Connect bus accident death toll rises to 28; two victims yet to be identified",
            "url": "https://www.newzimbabwe.com/urban-connect-bus-accident-death-toll-rises-to-28-two-victims-yet-to-be-identified/",
            "content": "By Staff Reporter\n\nTHE death toll in theaccident involving an Urban Connect bus and a haulagetruck along the Masvingo-Beitbridge highway has risen to 28, police has said.\n\nThe accidentkilled 17 people on the spot, while seven others died upon admission at Beitbridge Hospital, and four more later died while receiving treatment bringing the total death toll to 28.\n\nThe tragic accident occurredtwo weeks agonear Lutumba tollgate when a Beitbridge-bound Urban Connect bus collided with a truck transporting magnesium to Chirundu.\n\nIn a statement Monday, the Zimbabwe Republic Police (ZRP) said two bodies remain unknown.\n\nReference is made to the ZRP press statement released on 21 February 2024 on a fatal road traffic accident which occurred on 13 February 2024 at the 262-kilometre peg along Masvingo-Beitbridge Road, Lutumba.\n\nThe death toll has risen to 28.\n\nTwo victims, a man and woman, are yet to be identified, ZRP said.\n\nThe crash was allegedly a result of reckless driving, as witnesses claimed the Urban Connect driver was speeding.\n\nThe government last week suspended Urban Connect Holdings Pvt Ltd operating license for six months saying the bus did not have a valid passenger insurance policy or route permit, and its driver had not met the re-test requirement, violating multiple transport regulations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13112930/urban-connect.jpeg",
            "description": "<p>By Staff Reporter THE death toll in the accident involving an Urban Connect bus and a haulage truck along the Masvingo-Beitbridge highway has risen to 28, police has said. The accident killed 17 people on the spot, while seven others died upon admission at Beitbridge Hospital, and four more later died while receiving treatment bringing the total death</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/urban-connect-bus-accident-death-toll-rises-to-28-two-victims-yet-to-be-identified/\">Urban Connect bus accident death toll rises to 28; two victims yet to be identified</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "How Mobile Gaming is Transforming Entertainment and Connectivity in Zimbabwe",
            "url": "https://www.newzimbabwe.com/how-mobile-gaming-is-transforming-entertainment-and-connectivity-in-zimbabwe/",
            "content": "Mobile gaming has seen explosive growth in Zimbabwe over the last decade, with online casino games such as roulette and slots becoming increasingly popular. What was once a niche industry is now a mainstream form of entertainment, attracting thousands of players from different backgrounds. The rapid adoption of smartphones, improvements in internet infrastructure, and growing interest in digital entertainment have contributed to this transformation. Today, many Zimbabweans can access online casino games from the palm of their hands, enjoying an experience that was once limited to physical casinos.\n\nSmartphones: Bringing Casino Games to the Masses\n\nOne of the primary reasons for the growth of mobile gaming in Zimbabwe is the increasing availability of affordable smartphones. A decade ago, high-end mobile devices were a luxury, accessible only to the wealthy. However, brands like Tecno, Itel, and Infinix have flooded the market with budget-friendly smartphones, making mobile gaming accessible to a much broader audience. With even entry-level smartphones now capable of running online casino games smoothly, more Zimbabweans are taking advantage of the convenience and entertainment these platforms provide.\n\nThis accessibility has led to a shift in gaming habits. Instead of visiting brick-and-mortar casinos, players now have the freedom to enjoy andplay online rouletteor spin the reels on a slot machine from anywherewhether they are at home, commuting, or even on a lunch break. The ease of access has played a significant role in driving interest in online casino gaming.\n\nFaster Internet and Improved Infrastructure\n\nAnother critical factor fuelling the growth of mobile gaming in Zimbabwe is the improvement in internet connectivity. Just a few years ago, slow speeds and expensive data plans made online gaming difficult. However, telecom providers such asEconet, NetOne, and Telecel have expanded their mobile broadband networks, bringing 3G and 4G connectivity to more areas. As a result, playing online casino games has become a seamless experience, with minimal buffering or connectivity issues.\n\nThe increasing competition among internet providers has also led to more affordable data packages. Daily, weekly, and monthly gaming bundles allow players to enjoy their favourite casino games without worrying about excessive data costs. This has made mobile gaming far more appealing, especially to younger audiences who are already accustomed to spending time on their phones.\n\nAdditionally, as Zimbabwe moves towards adopting 5G technology, the future of mobile gaming looks even brighter. Faster speeds and lower latency will improve the overall gaming experience, making it even easier for players to engage in real-time casino games like live dealer roulette or poker.\n\nThe Appeal of Online Casino Games: Why Players Love Slots and Roulette\n\nWhile mobile gaming spans multiple genres, casino games like roulette and slots have gained particular traction in Zimbabwe. These games offer quick entertainment, the potential for big winnings, and a level of excitement that keeps players engaged.\n\nSlot games are especially popular due to their simplicity. Unlike poker or blackjack, which require strategy and decision-making, slot games are easy to playjust spin the reels and hope for a winning combination. The introduction of themed slot games with vibrant graphics and sound effects has further enhanced their appeal, making them an attractive option for casual gamers.\n\nRoulette, on the other hand, appeals to those who enjoy a more dynamic betting experience. The thrill of watching the wheel spin and anticipating where the ball will land keeps players coming back for more. Online platforms now offer both classic European and American roulette variations, as well as modern digital adaptations that introduce new features and betting options.\n\nAnother factor contributing to the popularity of these games is the presence of progressive jackpots. Many online slots now offer huge pooled jackpots that can be won by any player, adding an extra layer of excitement. For Zimbabweans looking for entertainment combined with the chance to win life-changing amounts of money, these games are an irresistible option.\n\nThe Rise of Mobile Payments and Accessibility\n\nThe integration of mobile payment solutions has also played a major role in the expansion of mobile gaming in Zimbabwe. Unlike in many Western countries where credit and debit cards are the dominant payment methods, Zimbabweans rely heavily on mobile money platforms such as EcoCash, OneMoney, and Telecash for financial transactions.\n\nOnline casino operators have quickly adapted to this trend, making it easy for players to deposit and withdraw money using mobile wallets. This convenience has eliminated the traditional barriers to entry, allowing more players to participate in mobile gambling without the need for a bank account or credit card.\n\nCryptocurrency is also gaining traction within the online gaming industry. Some international betting sites that accept Zimbabwean players now support Bitcoin and other cryptocurrencies, offering an alternative for those who prefer secure and anonymous transactions.\n\nSocial and Economic Impact of Mobile Casino Gaming\n\nThe rapid growth of mobile gaming in Zimbabwe has not only provided entertainment but also opened up new economic opportunities. Local entrepreneurs are developing gaming apps and platforms, creating employment for developers, designers, and marketing professionals. As mobile gaming continues to grow, more job opportunities are expected to emerge within the industry.\n\nAdditionally, online casinos have introduced new revenue streams for players. While most people play casino games for fun, others see it as a way to supplement their income. Some players participate in online tournaments and high-stakes games, hoping to turn their skills into profit. Although gambling comes with risks, the potential rewards have encouraged many Zimbabweans to try their luck.\n\nHowever, the industry has also raised concerns about responsible gaming. The accessibility of online casino games means that players can engage in gambling at any time, which can lead to addiction if not managed properly. To address this issue, many online gaming platforms have introduced responsible gambling features, such as deposit limits and self-exclusion options. Awareness campaigns about the risks of gambling are also becoming more common, helping players make informed decisions about their gaming habits.\n\nLooking ahead, the mobile gaming industry in Zimbabwe is poised for continued growth. As smartphone technology improves and internet infrastructure expands, even more players will join the digital gaming revolution. The governments stance on online gaming regulations will also play a crucial role in shaping the industry. If properly regulated, mobile casino gaming could become a significant contributor to Zimbabwes digital economy, creating more jobs and generating tax revenue.\n\nDevelopers are likely to introduce more locally-themed casino games that appeal to Zimbabwean players, incorporating cultural elements and traditional games into digital formats. Additionally, as augmented reality (AR) and virtual reality (VR) technology become more accessible, online casinos may start offering immersive gaming experiences that replicate the feel of a real casino.\n\nFor now, the combination of affordable smartphones, faster internet, and seamless mobile payments has created the perfect environment for mobile casino gaming to thrive. As more Zimbabweans discover the thrill of playing roulette, slots, and other online casino games, the industry will continue to evolve, offering bigger, better, and more engaging experiences.\n\nMobile gaming in Zimbabwe is more than just a passing trendits a digital revolution thats transforming entertainment, creating new opportunities, and reshaping how people engage with casino games. Whether youre a casual player spinning the reels on a slot machine or a seasoned bettor trying your luck at roulette, one thing is certain: the future of mobile gaming in Zimbabwe is bright.\n\n",
            "image_url": null,
            "description": "<p>Mobile gaming has seen explosive growth in Zimbabwe over the last decade, with online casino games such as roulette and slots becoming increasingly popular. What was once a niche industry is now a mainstream form of entertainment, attracting thousands of players from different backgrounds. The rapid adoption of smartphones, improvements in internet infrastructure, and growing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-mobile-gaming-is-transforming-entertainment-and-connectivity-in-zimbabwe/\">How Mobile Gaming is Transforming Entertainment and Connectivity in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "Ukraine leader Zelensky willing to give up presidency in exchange for NATO membership",
            "url": "https://www.newzimbabwe.com/ukraine-leader-zelensky-willing-to-give-up-presidency-in-exchange-for-nato-membership/",
            "content": "By BBC\n\nVOLODYMYR Zelensky said he would be willing to give up his presidency in exchange for peace ahead of the third anniversary of Russias full-scale invasion of Ukraine.\n\nIf to achieve peace you really need me to give up my post  Im ready. I can trade it for Nato membership, if there are such conditions, the Ukrainian president said in response to a question during a news conference.\n\nHis comments came after US President Donald Trump called Zelensky a dictator without elections earlier in the week.\n\nI wasnt offended, but a dictator would be, Zelensky, who was democratically elected in May 2019, responded on Sunday.\n\nI am focused on Ukraines security today, not in 20 years, I am not going to be in power for decades, he added.\n\nAccording to Ukrainian law, elections are suspended under martial law, which has been in place since Russias full-scale invasion in February 2022.\n\nZelensky is meeting Western leaders on Monday, some in person in Kyiv and some online, as they work out how to provide a post-war security where the US will not.\n\nHe said the topic of Ukraine joining Nato would be on the table at the meeting but he did not know how the discussions would finish. He hoped the meeting would be a turning point.\n\nOn the topic of Trump, Zelensky said that he wanted to see the US president as a partner to Ukraine and more than a mediator between Kyiv and Moscow.\n\nI really want it to be more than just mediationthats not enough, he said.\n\nWith the White House demanding that it gets access to billions of dollars worth of Ukraines natural minerals in exchange for the military aid it provided to date  and could in the future  Zelensky said US help so far had been agreed as grants, not loans.\n\nHe said he would not agree to a security deal which  in his words  would be paid off by generation after generation.\n\nWhen asked about a potential mineral deal, Zelensky said we are making progress, adding that Ukrainian and US officials had been in touch.\n\nWe are ready to share, the Ukrainian leader said, but made clear that Washington first needed to ensure Russian President Vladimir Putin ends this war.\n\nZelensky appeared relaxed as he faced questions from the worlds media. In previous years he had been more impassioned and even emotional, but on Sunday his approach was business-like.\n\nIf Ukraines leader rejects a Donald Trump-shaped peace proposal he does not agree with  as he suggested today  then it could have lasting consequences for the course of this war.\n\nZelenskys comments came hours after Russia launched its largest single drone attack on Ukraine yet, Ukrainian officials said.\n\nOn Saturday night, Ukraines Air Force Command spokesman Yuriy Ignat said a record 267 Russian drones were launched in a single, coordinated attack on the country.\n\nThirteen regions were targeted and while many of the drones were repelled, those that were not caused destruction to infrastructure and at least three casualties, emergency services said.\n\nUkraines Air Force reported that 138 of the drones were shot down and 119, which were decoy drones, were lost without negative consequences, likely due to jamming.\n\nIn Kyiv, the attack meant six hours of air alerts.\n\nIn a statement, Zelensky thanked Ukraines emergency services for their response and called for the support of Europe and US in facilitating a lasting and just peace.\n\nIn a post on X, Ukraines First Lady Olena Zelenska said that hundreds of drones had brought death and destruction overnight.\n\nIt was another night of explosions, burning houses and cars, and destroyed infrastructure, she wrote. Another night when people prayed for their loved ones to survive.\n\nOn Monday, the war will enter its fourth year.\n\nDiplomatic wrangling over a potential peace deal continues, with Ukraine, European allies and the US offering differing visions for how to end the conflict.\n\nThe US and Russia held preliminary talks in Saudi Arabia this week  without delegates from Europe, including Ukraine, present  which resulted in European leaders holding a hastily-arranged summit in Paris.\n\nZelensky criticised Ukraines exclusion from the US-Russia talks, saying Trump was living in a disinformation space governed by Moscow, prompting Trump to respond by calling the Ukrainian president a dictator.\n\nFrench President Emmanuel Macron is expected to visit Washington on Monday, while UK Prime Minister Sir Keir Starmer will be there on Thursday.\n\nSir Keir has publicly backed Zelensky, reiterating the UKs ironclad support for Kyiv, and said he would discuss the importance of Ukraines sovereignty when he speaks to Trump.\n\nPope Francis  who is in hospital with respiratory illness  wrote in a remarks released on Sunday that the third anniversary of the war was a painful and shameful occasion for the whole of humanity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/16062050/Zelensky.jpg",
            "description": "<p>By BBC  VOLODYMYR Zelensky said he would be willing to “give up” his presidency in exchange for peace ahead of the third anniversary of Russia’s full-scale invasion of Ukraine. “If to achieve peace you really need me to give up my post – I’m ready. I can trade it for Nato membership, if there are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ukraine-leader-zelensky-willing-to-give-up-presidency-in-exchange-for-nato-membership/\">Ukraine leader Zelensky willing to give up presidency in exchange for NATO membership</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "Zimbabwe, Albania, Oman and Sulawesi offer the ultimate international vacation in 2025",
            "url": "https://www.newzimbabwe.com/zimbabwe-albania-oman-and-sulawesi-offer-the-ultimate-international-vacation-in-2025/",
            "content": "TravelandTourWorld\n\nOvertourism has become an escalating issue in many of the worlds most sought-after travel destinations. The overwhelming influx of visitors to a single location can lead to severe consequences, including overcrowding, environmental degradation, strained infrastructure, reduced quality of life for locals, resource depletion, and a diminished travel experience.\n\nBeyond harming ecosystems, overtourism also drives up travel costs, with many iconic hotspotsespecially in Europeintroducing tourist taxes and strict visitor limitations in an attempt to curb excessive footfall.\n\nIf youre looking to escape the crowds and explore destinations that remain largely untouched by mass tourism, consider these underrated travel gems, as highlighted by Independent.\n\nFor those dreaming of an African safari without the overwhelming crowds of Kenya or South Africa, Zimbabwe offers an authentic and intimate wildlife experience. The country is home to Hwange National Park, one of Africas largest game reserves, spanning 14,600 square kilometers and teeming with elephants, lions, and rhinos.\n\nZimbabwe is also home to one of the worlds most breathtaking natural wondersVictoria Falls, the largest waterfall on Earth, where the thunderous cascade of water plunges into the Zambezi River, creating a spectacle like no other.\n\nMost visitors begin their adventure in Harare, a city lined with jacaranda-filled streets and cultural hotspots. The National Gallery of Zimbabwe is a must-visit, showcasing captivating photography, sculptures, and historical artifacts that provide insight into the countrys rich artistic heritage.\n\nWith majestic mountains, pristine beaches, and charming islands in the Ionian Sea, Albania offers an incredible variety of landscapes packed into a compact area. The Albanian Riviera is a paradise for travelers seeking a tranquil escape without the overwhelming crowds.\n\nFor nature lovers, Theth National Park is a must-visit, featuring breathtaking hiking trails and hidden wonders like the Blue Eye, a mesmerizing natural spring nestled in limestone rock formations. Not far from here, the Albanian Alps form part of the Dinaric Alps, offering jagged peaks, verdant valleys, and a stunning display of wildflowers in spring.\n\nMeanwhile, Albanias capital, Tirana, is a fascinating blend of historical and modern influences. Architectural highlights include the Tirana Pyramid, the striking Namazgah Mosque, and the eerie House of Leaves, a museum dedicated to Albanias secret surveillance history.\n\nOften overshadowed by its glitzy neighbors, Oman is a land of vast deserts, unspoiled beaches, and towering mountains, offering an authentic Arabian experience steeped in tradition. Unlike many Middle Eastern cities filled with skyscrapers, Oman embraces its heritage by constructing buildings in the neo-Islamic architectural stylestunning examples include the Sultan Qaboos Grand Mosque and the Royal Opera House in Muscat.\n\nFor breathtaking natural beauty, head to Jebel Akhdar, where pink damask roses bloom in spring, creating a mesmerizing landscape. Meanwhile, Jebel Shams, Omans highest peak, is home to Wadi Ghul, often dubbed the Grand Canyon of Arabia, where Egyptian vultures soar above abandoned mud-brick villages.\n\nFor a truly off-the-beaten-path experience, explore theMusandam Peninsula, famous for its fjord-like inlets, where crystal-clear waters meet rugged cliffs, making it a perfect spot for dhow cruises and snorkeling adventures.\n\nWhile Bali steals the spotlight, Sulawesi remains one of Indonesias most underrated treasures, offering stunning coastlines, vibrant marine life, and a rich cultural heritageall without the tourist rush.\n\nIn South Sulawesi, Tanjung Bira Beach boasts soft white sands and swaying palm trees, offering a serene alternative to Balis often overcrowded beaches. Meanwhile, divers can explore Bunaken National Marine Park, home to vibrant coral reefs teeming with over 2,000 species of fish.\n\nFor a cultural experience, head to Tana Toraja, a highland region where the Toraja people uphold their unique traditions, including elaborate funeral ceremonies and ancient stone graves. This regions dramatic landscapes and fascinating customs make it an unmissable destination for adventurous travelers.\n\nThe world is filled with extraordinary destinations that remain untouched by mass tourism. By venturing off the beaten path to places like Albania, Oman, Sulawesi, and Zimbabwe, you not only enjoy breathtaking landscapes and rich cultural experiences but also contribute to sustainable tourism efforts that protect the integrity of these hidden gems.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/21060705/vic-falls.jpeg",
            "description": "<p>TravelandTourWorld Overtourism has become an escalating issue in many of the world’s most sought-after travel destinations. The overwhelming influx of visitors to a single location can lead to severe consequences, including overcrowding, environmental degradation, strained infrastructure, reduced quality of life for locals, resource depletion, and a diminished travel experience. Beyond harming ecosystems, overtourism also drives</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-albania-oman-and-sulawesi-offer-the-ultimate-international-vacation-in-2025/\">Zimbabwe, Albania, Oman and Sulawesi offer the ultimate international vacation in 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "Triple murder suspect arrested after week on the run",
            "url": "https://www.newzimbabwe.com/triple-murder-suspect-arrested-after-week-on-the-run/",
            "content": "By James Muonwa\n\nAFTER spending a week on the run, a fugitive triple murder suspect was finally arrested Sunday in dramatic fashion in Hurungwe district of Mashonaland West province.\n\nTrymore Tore (37), who had earlier been mistakenly reported as having been arrested following the gruesome killing of his wife, niece and village head, was surrounded by villagers at a homestead where he had sought food and water.\n\nAccording to sources, the villagers swamped the suspect, who armed himself with a knife before attempting suicide by slitting his own throat.\n\nHe was later disarmed and taken to Karoi Hospital where is reportedly receiving treatment under police guard.\n\nImages of a bloodied Tore were awash on social media with villagers expressing relief that his reign of terror had been brought to an end.\n\nThe gruesome murders have sent shockwaves in the Chundu chieftainship of Hurungwe district.\n\nPolice say their preliminary investigations have established that Tore and his wife had longstanding domestic issues, which now deceased village head, Kuwesu Masawu (56) tried to resolve as mediator.\n\nAccording to the police, bodies of the three victims were found on February 17, 2025, at Mubairecheni Village, Chundu, Hurungwe.\n\nThe first victim who is the suspects wife, Moline Chibayanzara (21), was found dead in a pit latrine with multiple injuries on the head.\n\nThe body was wrapped in a blue blanket, police spokesperson, Commissioner Paul Nyathi said in a statement.\n\nThe second victim, a 17-year-old female juvenile, who is the suspects niece was discovered about 60 metres from Tores homestead with a swollen head and a cut on the forehead.\n\nThe body was covered with tree branches and a knife was recovered beside the body.\n\nThe third victim Musawu, who was the village head, was discovered buried in a shallow grave behind the suspects house with a decapitated head and a deep cut on the neck.\n\nAccording to police, Tore and his wife were allegedly heard by villagers embroiled in a heated verbal exchange over an undisclosed matter at their homestead on February 15, 2025.\n\nMasawu was last spotted alive on February 16, 2025, proceeding to the suspects homestead to mediate a dispute between the couple, while the second victim was also last seen on her way to the suspects homestead to watch television.\n\nAt the weekend, prior to Tores capture, police had launched an appeal to the general public to come forward with information on his whereabouts, thereby allaying earlier claims that suspect had been accounted for.\n\nPolice correct earlier report that Trymore Tore was arrested. This information was not correct and may the public be guided accordingly, police provincial spokesperson, Inspector Ian Kohwera said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24044750/Screenshot_20250222-093255_1.jpg",
            "description": "<p>By James Muonwa  AFTER spending a week on the run, a fugitive triple murder suspect was finally arrested Sunday in dramatic fashion in Hurungwe district of Mashonaland West province. Trymore Tore (37), who had earlier been mistakenly reported as having been arrested following the gruesome killing of his wife, niece and village head, was surrounded</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/triple-murder-suspect-arrested-after-week-on-the-run/\">Triple murder suspect arrested after week on the run </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Changes in Estate Administration in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-changes-in-estate-administration-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back, Mr. Madzima. This week, we want to discuss the changes to estate administration in Zimbabwe. Is there a wholesale change in how estates are administered, and when is this coming into effect?\n\nVM: Thank you.\n\nThere is no wholesale change in how estates are managed in Zimbabwe. The Act is amending certain provisions of the laws administering estates.\n\nThe law that is being introduced is known as the Administration of Estates Amendment Act No. 3 of 2024 which is coming into effect on the 24thof February 2025\n\nThe new Act is amending certain provisions that are contained in the Administration of Estates Act Chapter {6:01} and the Sovereign Wealth Fund Act Chapter {22:20}\n\nReporter:In general terms what is the main purpose for this Amendment Act?\n\nVM: The main purpose of the Act is to convert the office of the Master into a body corporate, stand-alone entity, capable of suing and being sued in its name. The office is the Master is responsible for all estates and insolvency situations like corporate rescue and liquidations.\n\nIn furthering institutional independence for the Masters office, the new laws prescribe that a board of professionals be created whose chairperson has to be qualified as a High Court judge. It will be the duty of the board to determine policies and principles of how the office is managed on a day-to-day basis with a focus on ensuring financial management and operational efficiency.\n\nLong and short, the aim of the Act is to address inefficiencies through corporate governance, with a focus on accountability and judicial oversight in the operations of the Masters office.\n\nReporter: What are some of the amendments introduced that affect day-to-day estate administration?\n\nVM: One such amendment deals with what is to be done where there is a dispute or competition for appointment as the Executor Dative.\n\nFor those who are not aware, the Executor Dative is the person appointed by the Master or Court as responsible for the gathering of assets, establishing liabilities and beneficiaries and ultimately distributing the estate.\n\nSuch disputes on who is to be appointed arise where there is no will stating in clear terms who the testator wishes to be the executor.\n\nIn such circumstances,the new act states the order of preference in appointment as the surviving spouse failing which, next of kin, failing which creditors then failing them legatees.\n\nThe Master will have to apply to the High Court with his choice of executor and if the Master has good reasons against the appointment of any of the interested persons, he can appoint a professional or other fit and proper person. The surest way to oppose the Masters choice is for all interested persons to submit to the court on joint affidavit their preferred executor.\n\nReporter: I understand that the amendments also deal with the issue of removal of executors.\n\nVM: Yes that is true.\n\nFor the avoidance of doubt, the amendments do not override or remove the common law principles for the removal of executors by interested persons to the estate.\n\nThey address a situation where the Master on his own motion following his own enquiry is of the opinion that the executor should be removed for grounds that may include incompetence, illegality in appointment or unsuitability for the role due to physical or mental incapacity.\n\nHe the Master is obliged to apply to the High Court an affidavit justifying his reasons for removal of the executor. On receiving the application, the executor is suspended from his duties pending the decision of the Court. The Master, in the interim, assumes the role of the executor. The judges response can only dismiss the application if he receives an affidavit from an interested person to the estate that there is a good reason not to remove the executor.\n\nReporter: Is there any other amendment that could have an effect on day-to-day estate management by executors?\n\nVM: Where the executor wants to sell the property of the estate privately and not by public auction and the will does not forbid it. The executor is to produce to the Master an affidavit jointly sworn by all the interested persons to sell the property and if the Master is satisfied that it will be in the best interest of the estate that the property is sold privately, he shall grant his authority.\n\nIn the event that it is contested, the executor supported by the Master will make an application to the court which shall determine upon considering practical estate needs and beneficiary interests whether or not the property is sold privately.\n\nReporter: Do you foresee any challenges that may come about as a result of the amendments in the Act?\n\nVM: The additional board approval and court processes may slow down administration coupled with the normal transition risks into autonomy.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima atvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24043954/Probate-and-Trust-Administration.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back, Mr. Madzima. This week, we want to discuss the changes to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-changes-in-estate-administration-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Changes in Estate Administration in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        },
        {
            "title": "16 Zimbabweans among dozens arrested in SA’s Pretoria major crime crackdown against illegal foreigners",
            "url": "https://www.newzimbabwe.com/16-zimbabweans-among-dozens-arrested-in-sas-pretoria-major-crime-crackdown-against-illegal-foreigners/",
            "content": "By IOL\n\nThe City of Tshwanes weekly Reclaim our City crime operations have led to the arrest of 61 illegal immigrants in Sunnyside, Pretoria.\n\nSixteen of the apprehended illegal immigrants are from Zimbabwe, four are Nigerian, nine Mozambicans, five Ethiopians and Ugandans, one Senegalese and 21 Malawians.\n\nThree other people were nabbed for knowingly employing and harbouring illegal foreigners.\n\nAccording to Tshwane mayor Nasiphi Moya, the operations targeted areas such as Sunnyside, Pretoria West and Pretoria Central as part of her administrations efforts to combat crime.\n\nThe crackdown operation was successful through the joint partnership of law enforcement from several departments, including the Gauteng Traffic Police, the Economic Development and Spatial Planning Department in Tshwane.\n\nWe are grateful to the provincial government for showing support for the citys efforts to rid the Pretoria CBD of crime.\n\nThe operation exerted the necessary impact as proof that intergovernmental partnerships with role players can help strengthen the arm of the law, said Moya.\n\nThe operation was not all gloomy, as a Tshwane Metro Police officer helped a pregnant woman deliver a healthy baby boy.\n\nMoya revealed that the city issued 20 health compliance notices under Section 56, totalling R133 000 fines.\n\nAdditionally, one fine was issued for failing to provide building plans, three were for failing to register second-hand goods, and one fine was for failure to keep record of second-hand goods.\n\nThe operation also saw the closure of a bet-exchange business located at the corner of Robert Sobukwe and Troye Streets, including a takeaway store for not complying to health regulations.\n\nLaw enforcement further confiscated 26 perishable goods, followed by 11 taxis for violating the National Land Transport Act of 2009, and a total of 108 560ml of liquor was seized and taken to the Pretoria West SAPS.\n\nOfficials visited 24 spaza shops, one liquor outlet, two second-hand good shops, and seven drug hotspots.\n\nThe operation also involved searching 456 people and 109 vehicles, and one liquor outlet was shut down.\n\nTwenty-nine vehicles were tested, while authorities searched 10 bad buildings, 44 street traders, and 34 premises.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/06035044/SA-Police.png",
            "description": "<p>By IOL  The City of Tshwane’s weekly “Reclaim our City” crime operations have led to the arrest of 61 illegal immigrants in Sunnyside, Pretoria. Sixteen of the apprehended illegal immigrants are from Zimbabwe, four are Nigerian, nine Mozambicans, five Ethiopians and Ugandans, one Senegalese and 21 Malawians. Three other people were nabbed for knowingly employing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/16-zimbabweans-among-dozens-arrested-in-sas-pretoria-major-crime-crackdown-against-illegal-foreigners/\">16 Zimbabweans among dozens arrested in SA’s Pretoria major crime crackdown against illegal foreigners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Feb 2025"
        }
    ]
}