{
    "news": [
        {
            "title": "Man (22) up for gruesome murder",
            "url": "https://www.newzimbabwe.com/man-22-up-for-gruesome-murder/",
            "content": "By Staff Reporter\n\nA YEAR later, a 22-year-old Chegutu man has been arrested and dragged to court for murder.\n\nTinotenda Chipadza has appeared before the Chegutu Magistrates Court for killing another resident of the farming town.\n\nThe accused person allegedly stabbed a night crawler and stole his cellphone before leaving him to die.\n\nThe State case is that on February 3 last year, at around 0200 hours, the now deceased Elisha Munengerwa left Eddys Kite Bar, Chegutu while in the company of his friend, Scott Zowa.\n\nIt was averred in court that the accused and his partner-in-crime only identified as Enock, who is still at large, trailed Munengerwa and Zowa.\n\nCourt heard that, at some point, Zowa got to his place of residence and the now deceased proceeded with his journey alone.\n\nThe accused person and his accomplice continued following Munengerwa.\n\nAt around 0300 hours, behind a tuckshop, the accused person pounced on Munengerwa and stabbed him on the upper left arm and forcibly took his Techno cellphone before fleeing the scene leaving the victim lying in a pool of blood.\n\nA witness, who was sleeping in the tuckshop, heard groaning sounds and got out to investigate. He found the now-deceased battling for his life.\n\nA report was made to police who attended the scene before the victim was ferried to Chegutu Hospital, where he was pronounced dead upon admission.\n\nPolice investigations led to the arrest of accused person after the stolen phone was recovered from an unsuspecting person, who bought it from the suspected killer.\n\nThe matter is still on remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter A YEAR later, a 22-year-old Chegutu man has been arrested and dragged to court for murder. Tinotenda Chipadza has appeared before the Chegutu Magistrates Court for killing another resident of the farming town. The accused person allegedly stabbed a night crawler and stole his cellphone before leaving him to die. The State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-22-up-for-gruesome-murder/\">Man (22) up for gruesome murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "Nearly 8,000 arrested as police intensify traffic blitz",
            "url": "https://www.newzimbabwe.com/nearly-8000-arrested-as-police-intensify-traffic-blitz/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Republic Police (ZRP) has escalated the fight against pirate taxi operators and other offenders in an ongoing clampdown in Harare.\n\nCommonly known as mushikashika the illegal taxis are blamed for increasing cases of hit-and-run accidents and kidnappings. The operation aims to restore normalcy on the capital citys dangerous roads.\n\nZRP national spokesperson, Commissioner Paul Nyathi confirmed the blitz codenamed No to Mushikashika.\n\nNyathi said over 7,000 arrests have been made during the exercise, with over 500 arrests effected in a single day.\n\nOn January 21, 2025, 572 arrests were made under operation, No to Mushikashika, bringing cumulative arrests to 7,695, he said.\n\nThe operation also targets touts, unregistered vehicles, and those that do not have registration number plates displayed.\n\nSo far, 197 touts have been arrested while 67 unregistered and plateless vehicles have been impounded, Nyathi added.\n\nCases of armed hit-and-run accidents, robberies, kidnappings and rape, are on the rise and in most instances perpetrators use plateless vehicles.\n\nThe commuting public is on record voicing concern over illegal public transporters, who have become a menace on the countrys roads, but police have consistently encouraged commuters to use buses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/24062745/Traffic-police.jpg",
            "description": "<p>By Staff Reporter THE Zimbabwe Republic Police (ZRP) has escalated the fight against pirate taxi operators and other offenders in an ongoing clampdown in Harare. Commonly known as ‘mushikashika’ the illegal taxis are blamed for increasing cases of hit-and-run accidents and kidnappings. The operation aims to restore normalcy on the capital city’s dangerous roads. ZRP</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nearly-8000-arrested-as-police-intensify-traffic-blitz/\">Nearly 8,000 arrested as police intensify traffic blitz</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "Harare City Council’s bloated workforce under scrutiny; finance department alone has 700 workers",
            "url": "https://www.newzimbabwe.com/harare-city-councils-bloated-workforce-under-scrutiny-finance-department-alone-has-700-workers/",
            "content": "By Darlington Gatsi\n\nHARARE City Council is facing a financial crisis due to its bloated workforce which exceeds 10,000 employees and includes numerous duplicate roles, ultimately shortchanging the ratepayers by hindering the delivery of basic services to the residents.\n\nThis was revealed Wednesday at the ongoing Commission of Inquiry which is probing the operations of Harare City Council from the period of 2017 to date.\n\nHarare City Council is burdened by thehigh costs of salaries which consume a large portionof the revenue that is generated by the municipality.\n\nInterestingly, the finance department at HCC employs more than 700 workers. Despitethislarge workforce, the financial system of HCC is in shambles.\n\nHCC Executive Assistant to the Town Clerk, Mathew Marara, admitted before the Commission,chaired by retired Justice Maphios Cheda, that the workforceis excessively large.\n\nEven 300 is bloated. Yes, the percentage that goes towardssalaries each month exceeds the limits that are prescribedby the government, said Marara.\n\nRELATED:\n\nHCC is plaguedby allegations of bad governance and maladministration failing to carry out its mandate.\n\nThe situation is further exacerbated by City Council officials and Councillors who are influencing recruitment, inflating the wage bill at the Town House.\n\nWhat happens is when you come up with the structures for the organisation, departments recommend the number of personnel and type of personnel they require.\n\nThey recommend these to the human capital department and the human capital department writes reports to the Council to recommenda change in the structure of the organisation. It is the Council which authorises the structure which will be implemented, said Marara.\n\nHCC currently has more than 70 drivers responsible for refuse collection, but most of them are idle due to a shortage of vehicles.\n\nMarara said the only solutionis to reduce the number of workers at the HCC.\n\nCouncil needs to undergo a restructuring exercise but this restructuring can not be undertaken by the current council because on a number of occasions we had recommended reduction in numbers but it has not happened. Definitely, the numbers need to be reduced, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/19231720/Harare-Town-House.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council is facing a financial crisis due to its bloated workforce which exceeds 10,000 employees and includes numerous duplicate roles, ultimately shortchanging the ratepayers by hindering the delivery of basic services to the residents. This was revealed Wednesday at the ongoing Commission of Inquiry which is probing the operations of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-councils-bloated-workforce-under-scrutiny-finance-department-alone-has-700-workers/\">Harare City Council’s bloated workforce under scrutiny; finance department alone has 700 workers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "South African police launch manhunt for gang leader of illegal mine",
            "url": "https://www.newzimbabwe.com/south-african-police-launch-manhunt-for-gang-leader-of-illegal-mine/",
            "content": "VOA\n\nSouth African police have launched a manhunt for a Lesotho gang member believed to have controlled operations at an illegal gold mine where 78 bodies were recovered last week during a police siege, from which he escaped.\n\nThe alleged kingpin, known as Tiger, surfaced from the mine in Stilfontein while it was under police surveillance and escaped from custody with the help of officials, a statement on Monday from the South African Police Service said.\n\nExtensive investigations and tracing operations are underway to find those officials who aided his escape between shaft 11 and the Stilfontein police holding cells, the statement said.\n\nPolice were widely condemned for themonths-long operationin which theycut off food and water suppliesto the miners in an attempt to force them out of the mine to face arrest.\n\nThe stand-off culminated in a state-sponsored rescue operation last week in which 246 survivors were retrieved from the deep mine, many of whom were emaciated and weak from hunger.\n\nBut police claim the gang leaders were to blame for the deaths, citing reports from some miners who said there was food underground but the kingpins kept it for themselves.\n\nThousands of people are believed to be involved in illegal gold mining in abandoned industrial mines in South Africa in search of leftover gold. Some of the workers spend months at a time underground.\n\nThe lucrative industry is known to be run by Lesotho-based gangs, and police say some of the workers are illegal immigrants recruited from neighboring countries without knowledge of what they have come to do.\n\nTiger was named in statements by miners as a ring leader who ran operations, the police statement said.\n\nHe is also being accused by some illegal miners (as) being allegedly responsible for some deaths, assault and torture that is alleged to have taken place according to videos in police possession. He is also alleged to have hoarded and kept food away from other illegal miners, it said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>VOA South African police have launched a manhunt for a Lesotho gang member believed to have controlled operations at an illegal gold mine where 78 bodies were recovered last week during a police siege, from which he escaped. The alleged kingpin, known as “Tiger,” surfaced from the mine in Stilfontein while it was under police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-police-launch-manhunt-for-gang-leader-of-illegal-mine/\">South African police launch manhunt for gang leader of illegal mine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "Teachers criticize ‘unfunded’ Heritage-Based Curricula",
            "url": "https://www.newzimbabwe.com/teachers-criticize-unfunded-heritage-based-curricula/",
            "content": "By Alois Vinga\n\nTEACHERS believe the Heritage Based Curricula (HBC) currently under implementation will burden learners and their guardians due to the lack of budgetary support to back it just like the CALA it replaced.\n\nThe HBC,a curriculum framework in Zimbabwe launched in 2025, integrates the countrys cultural and historical heritage into the education system designed to promote a holistic approach to learning and to prepare students to drive national development.\n\nThe HBC is designed to be flexible and learner-centred, allowing students to choose their own research topics and projects.\n\nBut in a statement, the Progressive Teachers Union of Zimbabwe (PTUZ) President Takavafira Zhou called for the immediate allocation of a budget to support the initiative.\n\nBudget for implementation of the unilaterally imposed and rushed Heritage Based Curriculum in 2025. We reiterated that without a budget the envisaged new curriculum will be difficult to implement as teachers need to be work-shopped over the standardisation and interoperability process and school-based projects. Without a budget, the school-based projects will saddle parents just as CALA, he said.\n\nProviding feedback following the end of the Education Weeks commemorations Tuesday, the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) also criticized the new curriculum launch.\n\nThis years focus has shed light on systemic challenges that continue to hinder progress. The governments underfunding of education has emerged as a glaring issue, alongside its lack of seriousness in implementing the new Heritage-Based Curriculum.\n\nTeachers remain untrained for this curriculum, which has not been backed by adequate financial resources or the provision of updated syllabi. The gap between policy and implementation has left both teachers and students struggling, particularly in rural and underserved areas, said ARTUZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04192721/Zimbabwe-Examination-pupil.jpeg",
            "description": "<p>By Alois Vinga TEACHERS believe the Heritage Based Curricula (HBC) currently under implementation will burden learners and their guardians due to the lack of budgetary support to back it just like the CALA it replaced. The HBC, a curriculum framework in Zimbabwe launched in 2025, integrates the country’s cultural and historical heritage into the education system</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teachers-criticize-unfunded-heritage-based-curricula/\">Teachers criticize ‘unfunded’ Heritage-Based Curricula</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "Zim woman hacked to death in South Africa in fight over a canvas used to cover shacks",
            "url": "https://www.newzimbabwe.com/zim-woman-hacked-to-death-in-fight-over-a-canvas-used-to-cover-shacks/",
            "content": "The Citizen\n\nHuman rights group Zim Community in SA says it is shocked by the report of a 36-year-old Zimbabwean woman who was hacked to death with an axe in Alberton, Gauteng, on Sunday.\n\nThe woman was killed after an argument with a neighbour over a canvas sail used to cover shacks.\n\nAccording to the spokesperson for ZimCommunity SA, Ngqabutho Mabhena, the woman had tried to recover the sail from her neighbour. An argument broke out, and he hacked her with an axe.\n\nThe woman had a baby on her back at the time.\n\nThis young mother with her baby on her back was savagely hacked to death with an axe by a man known to the community. Her children saw what had happened.\n\nThe tragedy unfolded when she sought to reclaim her canvas sail, which the assailant had taken to cover his shack, said Mabhena.\n\nMabhena said he was disappointed that police had not arrested the assailant, being known to the community.\n\nThis barbaric act highlights the ongoing vulnerability and systemic injustices faced by migrants in South Africa.\n\nIt is deeply troubling that law enforcement has yet to act decisively.\n\nMabhena said foreign nationals in South Africa, especially those from other African countries, still face many challenges.\n\nMabhena said foreign nationals face challenges, including human rights abuses such as inadequate access to justice and health care.\n\nThe right to life, enshrined in the South African Constitution, is universal and must be upheld for everyone.\n\nYet, migrants often endure violence, neglect, and indifference from the justice system. This incident is not isolated  many crimes against migrants go unaddressed, dehumanising them and fostering a culture of impunity.\n\nMabhena said foreign nationals, especially those from the diaspora,contribute positively to the growth of the economyand have the same goals as South Africans.\n\nWe appeal to all people to reflect on their shared humanity. Migrants contribute to the growth and diversity of this society.\n\nViolence against any individual, irrespective of their nationality, violates the values of justice and dignity. We urge citizens and residents to unite against such atrocities and demand accountability from law enforcement and public institutions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>The Citizen Human rights group Zim Community in SA says it is shocked by the report of a 36-year-old Zimbabwean woman who was hacked to death with an axe in Alberton, Gauteng, on Sunday. The woman was killed after an argument with a neighbour over a canvas sail used to cover shacks. According to the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-woman-hacked-to-death-in-fight-over-a-canvas-used-to-cover-shacks/\">Zim woman hacked to death in South Africa in fight over a canvas used to cover shacks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "Zimbabwe braces for economic pressures from US policies under Trump",
            "url": "https://www.newzimbabwe.com/zimbabwe-braces-for-economic-pressures-from-us-policies-under-trump/",
            "content": "Business Report\n\nZimbabwean Finance Minister, Mthuli Ncube, is concerned that inward looking policies under newly inaugurated US President Donald Trump could result in higher inflation, elevated interest rates, and a stronger greenback, which could hurt emerging market currencies and capital flight as investors chase treasury bills.\n\nTrump is adopting policies that prioritise the United States interests. He has already signed Executive Orders withdrawing the US from the World Health Organisation (WHO) and limiting foreign aid, among others.\n\nEmerging market finance ministers meeting in Davos for the 2025 World Economic Forum (WEF) Annual Meetings are concerned that this could have implications for their economies and funding flows for critical sectors such as healthcare.\n\nNcube told a media briefing from Davos on Wednesday that he was concerned that higher interest rates and a stronger US dollar emanating from Trumps inward looking policies will hurt emerging market economies and currencies.\n\nHigher interest rates this will keep the USD stronger and we will not be comfortable if USD is too stronger. A strong USD may encourage imports too much which encourages current account deficits for countries like Zimbabwe, he said.\n\nFor emerging markets, explained Ncube, a stronger US dollar will suck liquidity away and hurt emerging market currencies and capital will exit from these economies in search of treasury bills.\n\nThe United States withdrawal from the WHO will likely result in limited funding flows for healthcare programs under the UN agency.\n\nNcube said Zimbabwe and other emerging markets now have to mobilise resources domestically to plug any funding gaps for healthcare.\n\nZimbabwe has implemented various taxes such as a sugar tax, levies on fast foods and on airtime top-ups in addition to an AIDS levy among others.\n\nResources from these statutory collections, said Ncube, would help the government to marshal domestic resources to fund health sector programs and importation of equipment used in cancer treatment.\n\nWe discussed what Trump means for global trade and international relations especially for Africa. One issue we noted was the US pulling out of the WHO  we felt that this perhaps signals reduced support on health front for countries such as Zimbabwe which relies on PEPFAR funding for HIV programs, said Ncube.\n\nThe withdrawal by US from the WHO means that Zimbabwe has to scale up our funding for health through taxes such as sugar taxes, and fast foods and sin taxes among others to fill the gap in any funding previously received.\n\nZimbabwe has however been battling a shrinking tax and revenue base due to economic difficulties that have resulted in the closure of companies and flight by international investors.\n\nCompanies such as Standard Chartered have recently divested from Zimbabwe while audit and accountancy firms have also been divesting, passing on operations to local management under new brands.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>Business Report Zimbabwean Finance Minister, Mthuli Ncube, is concerned that inward looking policies under newly inaugurated US President Donald Trump could result in higher inflation, elevated interest rates, and a stronger greenback, which could hurt emerging market currencies and capital flight as investors chase treasury bills. Trump is adopting policies that prioritise the United States’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-braces-for-economic-pressures-from-us-policies-under-trump/\">Zimbabwe braces for economic pressures from US policies under Trump</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "Zimbabwe issues urgent alert on counterfeit rabies vaccine",
            "url": "https://www.newzimbabwe.com/zimbabwe-issues-urgent-alert-on-counterfeit-rabies-vaccine/",
            "content": "By Tapiwa Svondo\n\nThe Medicines Control Authority of Zimbabwe (MCAZ) has issued a warning against a fake ABHAYRAB rabies vaccine which has been distributed through unauthorized channels and circulating locally.\n\nIn a circular addressed to licensed pharmacies, wholesalers, and public and private healthcare facilities, MCAZ Director General Richard Rukwata, said the falsified product may contain harmful components which pose health risks.\n\nThe Medicines Control Authority of Zimbabwe (MCAZ) has identified a falsified ABHAYRAB Rabies vaccine, circulating in the market through unauthorised sources.\n\nThis falsified product poses a significant threat to public health due to the potential for lack of efficacy, harmful components, and the risk of treatment failure in preventing rabies, a fatal disease, said Rukwata\n\nAll licensed entities have been ordered to immediately quarantine any units of the affected vaccine.\n\nThereafter, these quarantined units must be submitted to the Authority for disposal. The general public who might have purchased the same falsified vaccine is advised to return the product to the pharmacy where they obtained the medicine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/22184150/WhatsApp-Image-2025-01-22-at-16.24.18.jpeg",
            "description": "<p>By Tapiwa Svondo The Medicines Control Authority of Zimbabwe (MCAZ) has issued a warning against a fake ABHAYRAB rabies vaccine which has been distributed through unauthorized channels and circulating locally. In a circular addressed to licensed pharmacies, wholesalers, and public and private healthcare facilities, MCAZ Director General Richard Rukwata, said the falsified product may contain</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-issues-urgent-alert-on-counterfeit-rabies-vaccine/\">Zimbabwe issues urgent alert on counterfeit rabies vaccine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "MWOS finally makes it into PSL after securing ZPC Hwange franchise",
            "url": "https://www.newzimbabwe.com/mwos-finally-makes-it-into-psl-after-securing-zpc-hwange-franchise/",
            "content": "By Sport Reporter\n\n2024 Northern Region Division One League runners-up MWOS FC will now join the countrys topflight league after acquiring the ZPC Hwange franchise.\n\nMWOS fought for promotion lastyear in the Northern Region Division One League only to lose the title to Scottland on the last day.\n\nThe Norton-based side has since entered into an agreement with ZPC Hwange who secured promotion last year after winning the Southern Region Division One League.\n\nZPC Hwange sold the franchise to MWOS since they could not feature in the league due to CAF club licencing rules which restrict two or more clubs owned by one owner to compete in the same league.\n\nDue to the latest development, ZPC Hwange will now compete in the Southern Region Division One League.\n\nZPC Hwange is owned by Zimbabwe Power Company which happens to be the owners of topflight league side ZPC Kariba.\n\nYes, we will be in the Premiership this season after successfully concluding a deal with ZPC Hwange, though at this point in time, I cannot reveal much in terms of details, MWOS FC executive member Patrick Tamson told Soccer 24.\n\nMeanwhile, MWOS FCs Northern Region Division One League slot will be used by the clubs new Under 19 project which will be used for development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/22161018/mwos.webp",
            "description": "<p>By Sport Reporter 2024 Northern Region Division One League runners-up MWOS FC will now join the country’s topflight league after acquiring the ZPC Hwange franchise. MWOS fought for promotion last year in the Northern Region Division One League only to lose the title to Scottland on the last day. The Norton-based side has since entered into</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwos-finally-makes-it-into-psl-after-securing-zpc-hwange-franchise/\">MWOS finally makes it into PSL after securing ZPC Hwange franchise </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        },
        {
            "title": "Zimbabwe fears US withdrawal from WHO will hit HIV/AIDS programmes",
            "url": "https://www.newzimbabwe.com/zimbabwe-fears-us-withdrawal-from-who-will-hit-hiv-aids-programmes/",
            "content": "Reuters\n\nZimbabwes finance minister expressed concern on Wednesday that a U.S. withdrawal from the World Health Organization will lead to aid cuts to countries such as his that are most affected by HIV/AIDS.\n\nPresident Donald Trumpsigned anexecutive orderon the U.S. withdrawal after his inauguration to a second term on Monday.\n\nWarning that a U.S. withdrawal could signal cuts in health aid to countries such as Zimbabwe, Finance Minister Mthuli Ncube said: Any country with an HIV/AIDS challenge will be impacted.\n\nThis is a concern, a fear we are expressing, Ncube told an online briefing from the Swiss resort of Davos, where was attending theWorld Economic Forum.\n\nZimbabwe receives over $200 million annually from the U.S. Presidents Emergency Plan for AIDS Relief (PEPFAR), and the U.S government has given Zimbabwe over $1.7 billion since 2006 to strengthen health systems and support people living with HIV, according the U.S. embassy in Harare.\n\nPEPFAR contributes nearly $90 million a year to support salaries and incentives for healthcare workers in Zimbabwe, in addition to funding HIV and viral load testing, prevention, cervical cancer screening and tuberculosis treatment.\n\nZimbabwe is struggling to fund its public health system, and the government introduced a sugar tax on beverages last year to help raise funds for cancer treatment. Another tax on fast foods was introduced this year.\n\nWe need to scale up our funding for health. The earmarked taxes should be directed towards health as we build our capacity to fill the gap should any funding recede, Ncube said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01093427/mthuli-1.jpg",
            "description": "<p>Reuters Zimbabwe’s finance minister expressed concern on Wednesday that a U.S. withdrawal from the World Health Organization will lead to aid cuts to countries such as his that are most affected by HIV/AIDS. President Donald Trump signed an executive order on the U.S. withdrawal after his inauguration to a second term on Monday. Warning that a U.S. withdrawal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-fears-us-withdrawal-from-who-will-hit-hiv-aids-programmes/\">Zimbabwe fears US withdrawal from WHO will hit HIV/AIDS programmes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "23 Jan 2025"
        }
    ]
}