{
    "news": [
        {
            "title": "South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans",
            "url": "https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/",
            "content": "By Thandiwe Garusa\n\nPublic Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals.\n\nThere have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring countrys already stretched public resources.\n\nAmong these groups is Operation Dudula in Gauteng, which has been actively preventing undocumented immigrants from accessing healthcare.\n\nIn an interview on Monday, ZHRC Chairperson Jessie Majome told South African broadcaster Newzroom Afrika that she recently had discussions with PPSA to resolve the issue of healthcare denial for Zimbabweans.\n\nMajomesinterview triggered a public uproar from South Africans condemning the PPSA for allowing Zimbabweans to fight for rights in a foreign country instead of fighting for the same healthcare access in their country.\n\nHowever, in a statement Tuesday, PPSAspokesperson Ndili Msokidenied Majomes claims, saying there was never any discussion around healthcare issues specifically affecting Zimbabwean nationals.\n\nThe PPSA said that when it hosted a ZHRC delegation last year, the discussions focused on institutional strengthening, corruption, and service delivery challenges in both countries but did not address migrant access to healthcare.\n\nFollowing numerous media inquiries, the PPSA wishes to clarify that it has no record of a complaint lodged by the ZHRC in relation to the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nAt no point did the discussions then, nor recently, focus on the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nRather, the discussions were about, among other things, the state of the healthcare systems in both countries.\n\nAccordingly, the PPSA also referred to its own investigation into the state of the healthcare system in South Africa as a guide for the ZHRC to conduct similar investigations in its own country,Msoki said.\n\nThe PPSA also emphasised that it has not received any complaint of that nature.\n\nSouth African authorities have for long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>By Thandiwe Garusa Public Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals. There have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring country’s already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/\">South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:49",
            "date": "05 Aug 2025"
        },
        {
            "title": "Chinese national in trouble over illicit financial transfer",
            "url": "https://www.newzimbabwe.com/chinese-national-in-trouble-over-illicit-financial-transfer/",
            "content": "By Mary Taruvinga\n\nA Chinese national has landed in hot water after allegedly transferring US$880,000 to China without approval from the Reserve Bank of Zimbabwe.\n\nSun Limin (52) was arraigned before a Harare magistrate, charged with contravening the Exchange Control and Money Laundering Acts.\n\nLimin was granted US$500 bail and ordered to report every Friday to the police until her matter is finalised.\n\nAccording to the state, the Chinese national was arrested at her business premises located at 19 Basma, Graniteside.\n\nShe is accused of violating the Exchange Control Act [Chapter 22:05], by allegedly transferring US$880,000 to China without the Reserve Bank of Zimbabwes approval between January and January 2025.\n\nUnder the Money Laundering and Proceeds of Crime Act [Chapter 9:24], she is alleged to have concealed the true nature and source of the funds, which authorities believe are proceeds of crime, the state.\n\nProsecutors allege that investigations have confirmed bills of entry for the goods which were imported from China via Forbes Border Post.\n\nThe state also says it has secured witness testimonies from clearing agents and documents proving transactions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga A Chinese national has landed in hot water after allegedly transferring US$880,000 to China without approval from the Reserve Bank of Zimbabwe. Sun Limin (52) was arraigned before a Harare magistrate, charged with contravening the Exchange Control and Money Laundering Acts. Limin was granted US$500 bail and ordered to report every Friday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-national-in-trouble-over-illicit-financial-transfer/\">Chinese national in trouble over illicit financial transfer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:49",
            "date": "05 Aug 2025"
        },
        {
            "title": "ZIDA injects US$1,4 billion investments in just six months",
            "url": "https://www.newzimbabwe.com/zida-injects-us14-billion-investments-in-just-six-months/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Investment Development Agency (ZIDA) injected investments worth US$1,4 billion in the years first six months.\n\nThe details contained in the Mid-Term Budget Review published last week say ZIDA licensed 178 new investment projects, with a cumulative projected value of US$1.4 billion.\n\nThe investments are distributed as follows: Energy and Mining 36%; Manufacturing 24%; Agriculture and Agro-processing 20%; and Tourism, ICT, and Services 20%.Meanwhile, ZIDA strengthened its capacity to process and automate licensing processes during the period, said the Treasury.\n\nThe systems were strengthened by introducing an improved licensing tracker to monitor turnaround time for processing investor licenses and automating the license renewal process and compliance reporting as well as developing investor service charters in collaboration with key ministries.\n\nDuring the first half of 2025, ZIDA significantly advanced the Special Economic Zones (SEZ) agenda through strengthened partnerships, investment promotion and rendering operational support to SEZ owners, Treasury added.\n\nNotable achievements include signing key agreements to unlock the development of SEZs in Masuwe and Beitbridge.\n\nThe developments come at a time when Zimbabwe is desperately seeking investments after decades of isolation due to high country risk factors.\n\nWhile the government has made assurances to deal with all related bottlenecks, progress has been slow in addressing some factors like scarce capital, currency stability and exorbitant licensing fees.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26023140/Sec-Zim-CEO-Tafadzwa-Chinamo-scaled-1.jpeg",
            "description": "<p>By Alois Vinga THE Zimbabwe Investment Development Agency (ZIDA) injected investments worth US$1,4 billion in the year’s first six months. The details contained in the Mid-Term Budget Review published last week say ZIDA licensed 178 new investment projects, with a cumulative projected value of US$1.4 billion. “The investments are distributed as follows: Energy and Mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zida-injects-us14-billion-investments-in-just-six-months/\">ZIDA injects US$1,4 billion investments in just six months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:49",
            "date": "05 Aug 2025"
        },
        {
            "title": "British drug mules jailed for 9 years each",
            "url": "https://www.newzimbabwe.com/british-drug-mules-jailed-for-9-years-each/",
            "content": "By Mary Taruvinga\n\nTwo British nationals have been slapped with a nine-year jail term each after they were convicted of smuggling 66 kgs of dagga into the country.\n\nThe two are Tihaise Darlin Elisha (19) and Taylor Tamara Simone (21).\n\nThe two were charged with unlawful dealing in dangerous drugs.\n\nProsecutors proved they were caught with 65,415kg of dagga at Robert Mugabe International Airport on May 1 this year.\n\nThe couple arriving aboard Ethiopian Airways Flight ET 873 were flagged by detectives from the CID Drugs and Narcotics after suspicious behaviour and intelligence led to a successful search of their four suitcases.\n\nThe search uncovered a total of 53 packets of cannabis hidden in red and brown luggage, tagged names of the offenders, said the National Prosecuting Authority.\n\nThe two will serve six years each after part of their sentence was suspended on condition of behaviour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Mary Taruvinga Two British nationals have been slapped with a nine-year jail term each after they were convicted of smuggling 66 kgs of dagga into the country. The two are Tihaise Darlin Elisha (19) and Taylor Tamara Simone (21). The two were charged with unlawful dealing in dangerous drugs. Prosecutors proved they were caught</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/british-drug-mules-jailed-for-9-years-each/\">British drug mules jailed for 9 years each</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:49",
            "date": "05 Aug 2025"
        },
        {
            "title": "Ramaphosa admits SA is reeling from US tariffs, but insists it is not alone",
            "url": "https://www.newzimbabwe.com/ramaphosa-admits-sa-is-reeling-from-us-tariffs-but-insists-it-is-not-alone/",
            "content": "IOL\n\nPresident Cyril Ramaphosa has conceded that South Africa is grappling with the United States decision to impose a30% tariff on local imports, but insists the country is not alone in facing mounting global trade challenges.\n\nIn his weekly newsletter, Ramaphosa described the new US tariffs as a stark reminder of the urgent need to adapt to increasingly turbulent headwinds in international trade.\n\nThe US is South Africas second-largest trading partner by country, and these measures will have a considerable impact on industries that rely heavily on exports to that country and on the workers they employ, as well as on our fiscus, he said.\n\nSectors such as agriculture, automotive and textiles have historically benefited from duty-free access to the US market under the African Growth and Opportunity Act (AGOA), which now faces disruption.\n\nRamaphosa said that South Africas trade relationship with the US has historically been complementary, saying local exports do not compete with US producers and do not pose a threat to US industry.\n\nLargely, our exports are inputs into US industries and therefore support the United States industrial base, he said.\n\nSouth Africa is also the biggest investor from the African continent into the US, with 22 of our companies investing in a number of sectors including mining, chemicals, pharmaceuticals and the food chain.\n\nThe 30% tariff was recently announced by the Trump administration and will take effect on 7 August.\n\nSouth Africa is the only country in sub-Saharan Africa singled out for the steep tariff, reflecting deteriorating relations between Pretoria and Washington.\n\nOther African countries, such as Lesotho and Zimbabwe, will face a 15% tariff from the same date.\n\nThe announcement is a significant blow to South Africas economy, particularly as the government had been working to strengthen trade ties with the US.\n\nThis included deals on liquefied natural gas imports, easing poultry import regulations and investments in US industries.\n\nRamaphosa defended South African imports, arguing they ultimately benefit US consumers through greater variety and lower costs.\n\nFor example, citrus production is counter-seasonal and does not pose a threat to US production, he said.\n\nFurthermore, production by US companies has been on the decline due to low yields, citrus greening disease and other factors unrelated to competition from imports.\n\nSouth Africa, the worlds second-largest citrus exporter, has helped to stabilise supply and prices in the US market.\n\nWe have been engaging the United States to enhance mutually beneficial trade and investment relations. All channels of communication remain open, said Ramaphosa.\n\nOur foremost priority is protecting our export industries.\n\nHe said the government would continue to engage with US officials while also accelerating efforts to diversify export markets, particularly within Africa.\n\nWith a view to helping our producers and exporters aggressively explore alternative markets, we have established an Export Support Desk to assist affected producers, he said.\n\nRamaphosa added that details of a support package for companies, producers and workers impacted by the tariffs would be announced soon.\n\nHe said the intervention would also assist industries seeking to expand into regions such as the rest of Africa, Asia, the Middle East and other existing trade agreement markets.\n\nStrengthening regional value chains will be key to building resilience for our export markets in the longer term, he said.\n\nMuch as strengthening and establishing alternative value chains will take time, this moment presents us with an opportunity to push forward with the implementation and expansion of the African Continental Free Trade Area (AfCFTA).\n\nRamaphosa stressed the need to reduce South Africas dependence on specific export markets, calling it a strategic imperative to build economic resilience.\n\nIn the coming months, we will be scaling up our trade missions into new markets in Africa and beyond, as well as the National Exporter Development Programme, whose aim is to grow the pool of export-ready companies, he said.\n\nTrump has opposed several South African policies, including land expropriation, which he controversially claimed allowed land to be taken from white farmers.\n\nThe Presidency has firmly denied such claims,including that one of genocide on white farmers.\n\nRamaphosa met with Trump in May in a bid to mend relations, but no progress was made as things had gone worse.\n\nDespite growing tensions, Ramaphosa insisted that South Africa is not alone in facinghigh tariffs.\n\nA number of export-reliant developed and developing economies, including several on the continent, are also grappling with these measures, he said.\n\nThe international trading system is changing. Complacency will not serve us, and building resilience is imperative.\n\nMeanwhile, the Minister of Departments of Trade, Industry and Competition Parks Tau and Minister of International Relations and Cooperation Ronald Lamola will be having a joint press briefing on Monday morning to address the issue of high tariffs.\n\nThe briefing will take place at 10 a.m. at the Germiston Civic Centre, in Ekurhuleni.\n\nMeanwhile on Saturday,ANC NEC member Dr Kgosientsho Ramokgopatold journalists there had been a spirited and robust discussion on the US tariffs.\n\nHe said negotiations between the US and South Africa were ongoing, and expressed confidence that the two nations would be able to find each other.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/02032135/Cyril-Ramaphosa.png",
            "description": "<p>IOL President Cyril Ramaphosa has conceded that South Africa is grappling with the United States’ decision to impose a 30% tariff on local imports, but insists the country is not alone in facing mounting global trade challenges. In his weekly newsletter, Ramaphosa described the new US tariffs as a stark reminder of the urgent need to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-admits-sa-is-reeling-from-us-tariffs-but-insists-it-is-not-alone/\">Ramaphosa admits SA is reeling from US tariffs, but insists it is not alone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:49",
            "date": "05 Aug 2025"
        }
    ]
}