{
    "news": [
        {
            "title": "Vast Resources finds additional diamonds in historic parcel released by RBZ after 15 years",
            "url": "https://www.newzimbabwe.com/vast-resources-finds-additional-diamonds-in-historic-parcel-released-by-rbz-after-15-years/",
            "content": "By Alois Vinga\n\nAIM-listed miner, Vast Resources, says it has discovered more stones than anticipated in its parcel, which the Reserve Bank of Zimbabwe (RBZ) had held since 2010.\n\nThe miner recently regained control of a long-awaitedparcelcontaining129,400 carats of diamondsafter a 15-year dispute with theZimbabweangovernment.\n\nThe dispute stemmed from the revocation of Vast Resources mining rights in the Marange diamond fields in 2006.\n\nThe Company is pleased to report that the sorting process has revealed an additional quantity of stones in the sealed historic parcels, the existence of which was previously unknown to the board of directors of Vast.\n\nThis Additional Parcel contains 6,055.35 carats of gem quality stones, which, together with the rest of the consignment, are currently inDubaifor final sorting in preparation for cleaning and further preparation for their sale, said the miner.\n\nThe company said it is now in receipt of the final packing list post the Kimberly Process inspection.\n\nThe total quantity of diamonds included in the Historic Parcel is now estimated to be 135,139.47 carats, of which an aggregate 36,475.26 carats have already been identified to be gem quality, said the company.\n\nThe company is also in the process of selecting the first stones for cleaning and estimates that initial results will be available in the coming weeks. The Board currently anticipates that the selling process will be conducted in a phased manner in order to maximise value for the Company and its shareholders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/04023247/Diamonds.jpg",
            "description": "<p>By Alois Vinga AIM-listed miner, Vast Resources, says it has discovered more stones than anticipated in its parcel, which the  Reserve Bank of Zimbabwe (RBZ) had held since 2010. The miner recently regained control of a long-awaited parcel containing 129,400 carats of diamonds after a 15-year dispute with the Zimbabwean government. The dispute stemmed from the revocation of Vast Resources’ mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vast-resources-finds-additional-diamonds-in-historic-parcel-released-by-rbz-after-15-years/\">Vast Resources finds additional diamonds in historic parcel released by RBZ after 15 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "Trio arrested for torturing suspected vegetable thief to death",
            "url": "https://www.newzimbabwe.com/trio-arrested-for-torturing-suspected-vegetable-thief-to-death/",
            "content": "By Staff Reporter\n\nTHREE Mutare men have been arrested for fatally assaulting a suspected vegetable thief after tying him to a tree.\n\nThe incident occurred on Tuesday in Mutares Dangamvura suburb.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the incident.\n\nPolice in Mutare arrested Brighton Kaisa (27), Oliver Kaisa (28) and Garikai Saungwena (50) in connection with a case of murder which occurred at a house in Dangamvura on May 6, 2025, said Nyathi.\n\nThe suspects allegedly tied the victim, Tarick Mamenomuno (23), with a cable on a mango tree, head down, before taking turns to assault him with a wire and an electric cable several times all over the body.\n\nThe suspects had accused the victim of stealing vegetables from their garden. The victim died on the spot, added Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/09071503/VEGETABLE.jpeg",
            "description": "<p>By Staff Reporter THREE Mutare men have been arrested for fatally assaulting a suspected vegetable thief after tying him to a tree. The incident occurred on Tuesday in Mutare’s Dangamvura suburb. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the incident. “Police in Mutare arrested Brighton Kaisa (27), Oliver Kaisa (28) and Garikai</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trio-arrested-for-torturing-suspected-vegetable-thief-to-death/\">Trio arrested for torturing suspected vegetable thief to death</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "Govt still struggling to revive ZISCO Steel",
            "url": "https://www.newzimbabwe.com/govt-still-struggling-to-revive-zisco-steel/",
            "content": "By Alois Vinga\n\nYEARS after promising theresuscitation of ZISCO Steel, the government is struggling to proffer a once-off solution to bring back the firm to its hey days.\n\nZISCO Steel was once a major steel producer in Zimbabwe, but it faced financial difficulties, mismanagement, and a lack of investment, leading to its closure in 2008.\n\nSpeaking in Parliament recently, Industry and Commerce Minister, Mangaliso Ndlovu struggled to point outany tangible progress made to revive the entity, tabling sketchy plans.\n\nNdlovu was being quizzed by Mbizo legislator, Corban Madziwanyika.\n\nThe coming on board of Dinson Iron and Steel Company currently presents a unique opportunity to build synergies with the existing ZISCO Company plant and other downstream industries such as Lancashire, hence promoting the revival of the local iron and steel sector, said Ndlovu.\n\nHe said currently, there are three key initiatives being undertaken by the government in resuscitating ZISCO and supporting Lancashire Steel. The first one, he said, is the reviving of the wire mill plant at Lancashire Steel whichwill see the manufacturing of wire rods, drawn wire, weld wire and brick force, barbed wire as well as galvanised wire.\n\nThe Industry Minister said the initiative is expected to create more than 20 jobs and provide wire-related products to both up and downstream industries and generate revenue for the company.\n\nThe second one is the establishment of a limestone beneficiation plant at BIMCO. The plant will manufacture burnt lime, aggregate stones for construction and mill limestone into different products. As the House might be aware, we had Kuvimba which had a management contract that has since been terminated owing to non-performance by the contractor.\n\nThis therefore means that the ZISCO board and management have regained urgency to manage and control its own affairs and we welcome this development at this critical juncture, he said.\n\nNdlovu said the government is now closer to inking an MOU that ensures that companies in the steel sector do not compete in producing the same products but rather, complement each other.\n\nDinson produces pig iron and steel billets for exports and will soon be producing the second stage of hot rolled wires and rolling bars. They have agreed in principle to leave certain types to be produced by ZISCO Steel and these are the shafts, the wire, the beams, the angles and the flat sections.\n\nThe entire sector will leverage the emergence of Dinson Company, which has started production of pig irons and steel billets. I want to submit by concluding that for their part, ZISCO Steel is currently mobilising resources to revive one of their kins for limestone beneficiation into burnt lime or what we call quick lime, which is used to remove impurities in steel making and is also used in construction such as cement manufacturing, added Ndlovu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/01182954/Ziscosteel.jpg",
            "description": "<p>By Alois Vinga YEARS after promising the resuscitation of ZISCO Steel, the government is struggling to proffer a once-off solution to bring back the firm to its hey days. ZISCO Steel was once a major steel producer in Zimbabwe, but it faced financial difficulties, mismanagement, and a lack of investment, leading to its closure in 2008.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-still-struggling-to-revive-zisco-steel/\">Govt still struggling to revive ZISCO Steel</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "Trump calls election of first American pope a ‘great honour’",
            "url": "https://www.newzimbabwe.com/trump-calls-election-of-first-american-pope-a-great-honour/",
            "content": "BBC\n\nUS President Donald Trump has called the election of the first American pope a great honour for the country and said he looks forward to meeting him.\n\nTrump is among the many American political figures applauding the historic appointment of Robert Francis Prevost, who will be known as Pope Leo XIV, to lead the Catholic Church.\n\nTo have the Pope from America is a great honour, Trump said when asked for reaction to the news.\n\nPope Leo, 69, was born in Chicago and attended university outside Philadelphia, before becoming a missionary in Peru.\n\nThe US has the fourth largest number of Catholics in the world, and congratulations started pouring in soon after the first American popes name was announced.\n\nVice-President JD Vance, who converted to Catholicism in 2019, praised the popes election.\n\nIm sure millions of American Catholics and other Christians will pray for his successful work leading the Church, Vance wrote on X.\n\nFormer President Joe Biden, a devout Catholic who has spoken about his warm relationship with Pope Francis, also offered his congratulations.\n\nHabemus papam  May God bless Pope Leo XIV of Illinois, Biden, the second Catholic president in US history, wrote on social media.\n\nFormer President Barack Obama, who launched his political career in Chicago, wrote on X: Michelle and I send our congratulations to a fellow Chicagoan, His Holiness Pope Leo XIV.\n\nThis is a historic day for the United States, and we will pray for him as he begins the sacred work of leading the Catholic Church and setting an example for so many, regardless of faith.\n\nFormer President George Bush issued a statement, saying that he and his wife Laura were delighted by the news.\n\nThis an historic and hopeful moment for Catholics in America and for the faithful around the world, he said.\n\nWe join those praying for the success of Pope Leo XIV as he prepares to lead the Catholic church, serve the neediest, and share Gods love.\n\nRepublican House Speaker Mike Johnson also congratulated the new pope and wrote on social media: May God bless the first American papacy in these historic days.\n\nSecretary of State Marco Rubio, a Catholic, also extended his congratulations.\n\nThis is a moment of profound significance for the Catholic Church, offering renewed hope and continuity amid the 2025 Jubilee Year to over a billion faithful worldwide, Rubio said.\n\nThe United States looks forward to deepening our enduring relationship with the Holy See with the first American pontiff.\n\nAs cardinal, it appears Prevost did not shy away from occasionally challenging the views of the Trump administration.\n\nAn account under his name reposted a post on social media platform X which was critical of the Trump administrations deportation of a US resident to El Salvador, and shared a critical comment piece written about a TV interview given by Vance to Fox News.\n\nJD Vance is wrong: Jesus doesnt ask us to rank our love for others, read the post, repeating the headline from the commentary on the National Catholic Reporter website.\n\nThe BBC has contacted the Vatican but has not independently confirmed the account, which was created in 2011, belongs to the new pontiff.\n\nMeanwhile, in Prevosts hometown, Chicago Mayor Brandon Johnson offered a note of congratulations.\n\nEverything dope, including the Pope, comes from Chicago! Congratulations to the first American Pope Leo XIV! We hope to welcome you back home soon, he wrote.\n\nIllinois Governor JB Pritzker called the moment historic.\n\nHailing from Chicago, Pope Leo XIV ushers in a new chapter that I join those in our state welcoming in at a time when we need compassion, unity, and peace, he wrote on social media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/15233156/Donald-Trump.jpg",
            "description": "<p>BBC US President Donald Trump has called the election of the first American pope a “great honour” for the country and said he looks forward to meeting him. Trump is among the many American political figures applauding the historic appointment of Robert Francis Prevost, who will be known as Pope Leo XIV, to lead the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-calls-election-of-first-american-pope-a-great-honour/\">Trump calls election of first American pope a ‘great honour’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "When sorry isn’t enough: Scotts Maphuma’s apology falls flat with fans",
            "url": "https://www.newzimbabwe.com/when-sorry-isnt-enough-scotts-maphumas-apology-falls-flat-with-fans/",
            "content": "IOL\n\nScotts Maphuma, the amapiano sensation known for chart-topping hits like ShayiMoto, is entangled in controversy as fans express outrage over what they perceive as disrespectful behaviour.\n\nFacing mounting criticism, Maphuma openly apologised to supporters this week following accusations of arrogance during fan interactions.\n\nThe issue began earlier this year when Maphuma opened up on social media about the pressures of fame and the relentless public scrutiny he faces.\n\nIn March, he candidly addressed these struggles, stating, Im tired of being judged for not always being in the mood to take pictures or interact with fans.\n\nThe artist articulated his frustrations at being unable to enjoy normal life experiences without being bombarded with requests for photos, adding, I cant even go to the mall without being asked for a picture.\n\nHis sentiments sparked a backlash, leading many to label him as rude, particularly after videos went viral showcasing seemingly dismissive interactions with fans.\n\nMaphumas insistence that he has no obligation to his followers culminated in a controversial appearance on the L-TidoPodcast, where he proclaimed, If I dont want to take a picture, then I dont want to.\n\nHis assertion that he has every right to prioritise his personal space divided a significant portion of his fan base.\n\nThe discontent escalated following his lukewarm performances at recent events like Cotton Fest and Coyotes Lounge in Mbombela, where audience reactions ranged from uninterested to indifferent.\n\nIt felt like the audience didnt care, remarked one user online, as videos showcased Maphuma dancing energetically to disinterested faces staring back at him.\n\nIn a desperate bid to mend fractures with his supporters, Maphuma took to social media again, this time to apologise sincerely.\n\nThose who are angry with me, Im sorry. Its a misunderstanding, he stated in a live video with renowned producerDJ Maphorisa.\n\nHe continued on Facebook to convey his remorse, saying, I want to take a moment to sincerely apologise to all my supporters. Ive let some of you down, and I take full responsibility. Growth comes with owning your mistakes, and Im committed to doing better, for myself and for you. Thank you for still believing in me.\n\nHis heartfelt message revealed his commitment to rectifying his mistakes and becoming a better artist for his fans.\n\nIn response to the backlash, many fans called for venues to cancel Maphumas upcoming performances, leading to Vogue Lounge 014 in Rustenburg announcing the withdrawal of his set due to public demand.\n\nWeve made the call, with your voices in mind, they stated on their social channels.\n\nWith his latest comments potentially falling on deaf ears, the biggest question remains: Is it too late for Maphumas apology?\n\nAs fans grapple with their feelings of disappointment, only time will tell if he can regain their loyalty and make a triumphant return to the stage.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/09064854/scotts.webp",
            "description": "<p>IOL Scotts Maphuma, the amapiano sensation known for chart-topping hits like “Shayi’Moto”, is entangled in controversy as fans express outrage over what they perceive as disrespectful behaviour. Facing mounting criticism, Maphuma openly apologised to supporters this week following accusations of arrogance during fan interactions. The issue began earlier this year when Maphuma opened up on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/when-sorry-isnt-enough-scotts-maphumas-apology-falls-flat-with-fans/\">When sorry isn’t enough: Scotts Maphuma’s apology falls flat with fans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "Could the Black Market Become the Only Market in Zimbabwe?",
            "url": "https://www.newzimbabwe.com/could-the-black-market-become-the-only-market-in-zimbabwe/",
            "content": "By Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  A year ago, all 16 checkout lanes were packed at OK Zimbabwe supermarket in Harare, one of the major retailers in the country. Customers queued shoulder to shoulder, their carts filled with Zimbabwes pantry essentials. Today, just two tills are open. They serve only a handful of customers who pick from whats available on half-empty shelves.\n\nAcross Zimbabwe, the situation is the same in many retail shops. While some are still holding on, their shelves are increasingly empty, with branches closing one by one. Others have folded operations entirely, unable to compete with informal traders.\n\nIt never used to be like this, says Mercy, who has worked for OK Zimbabwe for over 10 years and asked not to be referred to by her full name for fear of losing her job. People are not coming to buy from us.\n\nZimbabwes formal retail sector struggles to hang on due to a combination of factors that have been gradually escalating. At the heart of the issue is the countrys unstable currency system. In 2024, the government introduced Zimbabwean gold, or ZiG, meant to be a stable successor to the unreliable Zimbabwean dollar. The ZiG, which is tied to gold and foreign reserves, would  the government hoped  curb inflation and restore confidence in a local currency, which has long been in competition with the much-preferred United States dollar.\n\nZimbabwean gold surpassed many peoples expectations,but it was no magic cure for the countrys economic turmoil.In the black market, whose unofficial exchange rates most people use, the currency was in short supply and struggled to hold value. Six months after its introduction, the Reserve Bank of Zimbabwe slashed the official exchange rate by more than 40%, trying to bring it closer to the black market rate.\n\nMeanwhile, the government also put restrictions on formal retailers. It required them to price their goods within the official exchange rate and criminalized selling above the rate. This led to price hikes.\n\nRetail customers turned to informal markets where they could pay in the US dollars they still preferred, and at the more reasonable black market exchange rate.\n\nOnce busy, many formal retailers across Zimbabwe have folded operations amid economic turmoil, an unstable currency system, and increased competition from the informal sector.Photo credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nInstability is likely to continue, as US dollars become scarce following the pullout of aid from the United States, much of it funnelled through the US Agency for International Development,which has been a key source of foreign currency inflows in Zimbabwe.\n\nMirriam Masikati, who once preferred supermarkets for their quality of goods, says she gets more value at these informal markets. It is worrying that I might buy fake products without knowing, but the prices are pushing us to these informal markets, says the mother of three.\n\nAlthough the government in April repealed the requirement that formal retailers price their goods within the official exchange rate, after nearly one year the damage had already been done. Major retailers like Spar Zimbabwe and N Richards Group folded some branches in parts of the capital. A statement by the Confederation of Zimbabwean Retailers in January indicated that some shops had reduced their space by 60%.\n\nAnd in April, OK Zimbabwe issued a loss warning, laying out a goal to raise US$30 million and explaining the financial challenges it has experienced in the last six months, including difficulty maintaining stock, paying suppliers and meeting other financial obligations.\n\nIn contrast, business is booming for informal traders  who are a significant part of the informal sector that makes up an estimated 65% of Zimbabwes economy and contributed about 72% to the countrys gross domestic product in 2024. They already had a good slice of the market. They now capture a larger share.\n\nThat share could grow further. Informal traders often sell out due to high demand, says Admire Musa, a cashier at one such shop in Harare. The success has attracted other Zimbabweans to open similar shops, he says.\n\nManufacturers, who once supplied formal retailers on credit, also are turning to informal traders, who pay in US cash, according to a 2024 report by the Zimbabwe National Chamber of Commerce.\n\nThis also allows manufacturers to bypass the banking system and avoid taxes, says Brains Muchemwa, an economist. Such high levels of back-channel commerce could be a problem for the country, he says. It significantly reduces the governments tax revenue, as informal traders do not comply with regulations, he adds.\n\nA 2022 report by the Zimbabwe Revenue Authority indicates that less than 0.5% of the money made in the informal sector is collected as tax revenue.\n\nIt is worrying that I might buy fake products without knowing, but the prices are pushing us to these informal markets. Mirriam Masikati\n\nThe government has tried to address the growing levels of informalization. In February, it issued a monetary policy requiring that all businesses use point-of-sale machines. This would bring informal trade into regular banking channels.\n\nBut Muchemwa is skeptical. The informal sector thrives because it can avoid the burdens of regulations, he says. Without stable policies and an encouraging trading environment, the governments efforts will not yield anything, he says.\n\nProsper Chitambara, also an economist, says the country needs tax reforms that make it easier and cheaper for businesses to formalize. He points to Brazil and Uruguay as successful examples where simplified tax regimes and supportive laws have reduced informality.\n\nFor Muchemwa, the solution is simple. As long as we defy the logic in terms of managing the economy, in particular printing money and coming up with policies that are not sensible, it will continue to present challenges for this economy, he says.\n\nThe countrys struggling economy is a chance for retailers to adapt, says Mthandazo Mlotshwa, chief operating officer for Zapalala Supermarkets. Though Zapalala closed some of its branches, Mlotshwa remains optimistic and doesnt see the informal market as a threat. Still, regulation and stable currency rates are needed, he adds, and the government is taking steps in that direction.\n\nMeanwhile, Mercy and other workers in retail remain anxious about their future. Everyone is demotivated, some have lost their jobs, and for us who remain the salaries are not coming on time and sometimes you get a portion of your salary, she says, her voice lowered in frustration.\n\nGamuchirai Masiyiwais a Reporter-in-Residence based in Harare, Zimbabwe.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08160022/02_GPJNews_Zim_GM_ZimEcono_-25_Above.JPG_web.jpg",
            "description": "<p>The price of doing business in Zimbabwean gold — the country’s latest currency — is too steep for many retailers, who can’t compete with an informal market still churning on US dollars. By Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — A year ago, all 16 checkout</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/could-the-black-market-become-the-only-market-in-zimbabwe/\">Could the Black Market Become the Only Market in Zimbabwe?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "UZ students push for exams postponement amid ongoing lecturers’ strike",
            "url": "https://www.newzimbabwe.com/uz-students-push-for-exams-postponement-amid-ongoing-lecturers-strike/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe (UZ) Students Representative Council (SRC) has written to the dean of students requesting a postponement of their end-of-semester examinations, citing the ongoing lecturers strike.\n\nUZ lecturers announced a job actionlast month and have staged demonstrations at the learning institution over paltry salaries and poor working conditions.\n\nThe lecturers are demanding a return to their pre-2018 salaries when a junior lecturer earned US$2,250. Currently, they earn as little as US$230.\n\nIn a letter seen by NewZimbabwe.com,the SRCsaid the ongoing strike has negatively affected them.\n\nIt is no longer a secret to us and hopefully to you that the institution has been adversely affected by the recent lecturers strike.\n\nThe disruption has significantly hindered our ability to prepare adequately for these assessments, as we have not received the necessary instructional materials and subject expert guidance from our lecturers during this period.\n\nGiven the circumstances, I propose that we consider extending the examination period for affected students or, alternatively, combining the examinations for Block C and Block D.\n\nThis would provide a more equitable opportunity for students to demonstrate their understanding of the course material, despite the interruptions to their learning, the letter reads.\n\nOver a week ago, Presidential Spokesperson George Charamba assured the lecturers that the government would address their grievances, but the Association of University Teachers (AUT) UZ says there has been no engagement from the government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe (UZ) Students Representative Council (SRC) has written to the dean of students requesting a postponement of their end-of-semester examinations, citing the ongoing lecturers’ strike. UZ lecturers announced a job action last month and have staged demonstrations at the learning institution over paltry salaries and poor working conditions. The lecturers</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-students-push-for-exams-postponement-amid-ongoing-lecturers-strike/\">UZ students push for exams postponement amid ongoing lecturers’ strike</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "63 police detectives undergo training to combat specialised crimes",
            "url": "https://www.newzimbabwe.com/63-police-detectives-undergo-training-to-combat-specialised-crimes/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Republic Police (ZRP) has heightened the fight against specialised crimes by equipping a cohort of detectives to deal with sophisticated criminals.\n\nA total of 63 detectives this Wednesday completed a skills development course at Shamva Battle Camp, Mashonaland Central province.\n\nIn a statement following the official closing ceremony, ZRP national spokesperson, Commissioner Paul Nyathi, said his organisation has intensified capacity building and skills development of members of the Criminal Investigations Department (CID) crack teams.\n\nThe ZRP has intensified the capacitation and skills development of CID crack teams in the fight against armed robbery, theft of motor vehicles, murder and other criminal acts in the country, said Nyathi.\n\nThis was revealed by Commissioner-General of Police, Stephen Mutamba, at the Shamva Battle Camp at the official closing ceremony of the CID Crack Teams Intermediate Investigations Course for 63 detectives.\n\nThe members underwent a 45-day skills development course on tracking, conducting responses and investigations on high-profile cases, which include armed robbery, murder, theft of motor vehicles, cyber crime, among other high-profile cases, he added.\n\nThe police spokesman said Commissioner-General Mutamba has taken it upon himself to improve the protocols, tactical preparedness and overall capability of ZRP specialised units, which are tasked with performing high-risk duties such as tracking armed robbery syndicates.\n\nIn a bid to improve operational efficiency, police say it is embracing the use of technology in attending and responding to scenes of crime and investigations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08200330/police-training-.png",
            "description": "<p>By Staff Reporter THE Zimbabwe Republic Police (ZRP) has heightened the fight against specialised crimes by equipping a cohort of detectives to deal with sophisticated criminals. A total of 63 detectives this Wednesday completed a skills development course at Shamva Battle Camp, Mashonaland Central province. In a statement following the official closing ceremony, ZRP national</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/63-police-detectives-undergo-training-to-combat-specialised-crimes/\">63 police detectives undergo training to combat specialised crimes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "Robert Prevost of the United States is named Pope Leo XIV",
            "url": "https://www.newzimbabwe.com/robert-prevost-of-the-united-states-is-named-pope-leo-xiv/",
            "content": "AP News\n\nCardinalRobert Prevost, an American missionary who spent his career ministering in Peru and leads the Vaticans powerful office of bishops, was elected the first American pope in the 2,000-year history of the Catholic Church. Prevost, 69, took the name Leo XIV.\n\nWhite smoke poured out of the Sistine Chapel chimney Thursday at 6:07 p.m. local time, signaling that a pontiff had been elected to leadthe Catholic Church.\n\nWhat to know\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08184352/pope-leo.jpg",
            "description": "<p>AP News Cardinal Robert Prevost, an American missionary who spent his career ministering in Peru and leads the Vatican’s powerful office of bishops, was elected the first American pope in the 2,000-year history of the Catholic Church. Prevost, 69, took the name Leo XIV. White smoke poured out of the Sistine Chapel chimney Thursday at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-prevost-of-the-united-states-is-named-pope-leo-xiv/\">Robert Prevost of the United States is named Pope Leo XIV</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        },
        {
            "title": "Jailed Moses Mpofu’s co-directors nabbed by ZACC for defrauding Harare City Council of US$415,000",
            "url": "https://www.newzimbabwe.com/jailed-moses-mpofus-co-directors-nabbed-by-zacc-for-defrauding-harare-city-council-of-us415000/",
            "content": "By Staff Reporter\n\nCONTROVERSIAL businessman Moses Mpofus two co-directors in Synlak (Private) Limited have been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) on allegations of having defrauded Harare City Council of over US$400,000.\n\nVusumuzi James Mpofu and Nobukhosi Mpofu are alleged to have misrepresented their capacity, falsified documents to the effect that they were authorised resellers of a key requirement of the 2015 tender conditions whose purpose was to purchase a 100KVA generator and build biogas digesters in Mbare.\n\nZACC has arrested Vusumuzi James Mpofu and Nobukhosi Mpofu of Synlak (Private) Limited on allegations of defrauding the City of Harare over US$415 000.00 (350 000.00) earmarked for the ill-fated Mbare biogas project, read a statement shared by ZACC on Thursday.\n\nThey are set to appear in court on Friday.\n\nThe two are said to have colluded with two council officials Phillip Pfukwa the former Director of Works and former Chamber Secretary Josephine Ncube to have payment made before commencement of work.\n\nAdded the statement: Investigations proved that Synlak Pvt Ltd secured the contract through misrepresentation, falsely claiming to be authorised resellers of Camda New Energy Technology Co. Ltd, a key requirement under the tender conditions.\n\nThe accused, in collusion with City of Harare officials ex-Director of Works Phillip Pfukwa and former Chamber Secretary Josephine Ncube, both already in remand on related charges, allegedly manipulated payment processes to receive funds before completing the project.\n\nThe funds were deposited into Synlaks CABS and BancABC accounts, from which Vusumuzi and Nobukhosi, as signatories, made cash withdrawals.\n\nPfukwa and Ncube were arrested earlier last month and remanded out of custody.\n\nThey also stand accused of bypassing procedure, falsifying council memos, misrepresenting Synlaks capacity and awarding it the tender despite having received four other bids.\n\nThe matter came to light after acting Town Clerk Mabhena Moyo reported the matter to ZACC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Staff Reporter CONTROVERSIAL businessman Moses Mpofu’s two co-directors in Synlak (Private) Limited have been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) on allegations of having defrauded Harare City Council of over US$400,000. Vusumuzi James Mpofu and Nobukhosi Mpofu are alleged to have misrepresented their capacity, falsified documents to the effect that they were authorised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jailed-moses-mpofus-co-directors-nabbed-by-zacc-for-defrauding-harare-city-council-of-us415000/\">Jailed Moses Mpofu’s co-directors nabbed by ZACC for defrauding Harare City Council of US$415,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "09 May 2025"
        }
    ]
}