{
    "news": [
        {
            "title": "Remembering AKA: Exploring the South African rapper’s most streamed songs",
            "url": "https://www.newzimbabwe.com/remembering-aka-exploring-the-south-african-rappers-most-streamed-songs/",
            "content": "IOL\n\nAs South Africa continues to mourn the loss of one of its most profound musical voices,Kiernan Jarryd Forbes,better known to the Megacy as AKA, remains an indelible part of the nations cultural fabric.\n\nThecelebrated rapperand songwriter, tragically taken from us on February 10, 2023, left behind a legacy transcending mere entertainment; his music captures universal themes of love, ambition, and resilience.\n\nIn remembering AKA, we take a closer look at some of his most YouTube-streamed songs, which not only showcase his artistic brilliance but also define an era in SA hip hop.\n\nAmong his most iconic tracks is the pulsating anthem Fela in Versace, featuring Nigerian producer Kiddominant. With a staggering 17 million views, this track draws inspiration from the legendary Nigerian music icon, Fela Kuti.\n\nThe accompanying music video is a visual feast, capturing the very essence of the song  energetic beats matched by compelling visuals.\n\nIts no wonder that Fela in Versace has found its place as a significant milestone in AKAs career, resonating widely with fans both locally and across the continent.\n\nAnother standout hit is All Eyes on Me, featuring a stellar lineup that includes Burna Boy, JR, and Da L.E.S.\n\nWith 13 million views, this dynamic collaboration reflects AKAs distinct flair for uniting diverse artistic voices within the African music landscape.\n\nThe song encapsulates the essence of a house party, offering listeners a vivid portrayal of the vibrant and celebratory spirit of Mzansi culture.\n\nIn a recent interview with podcast hosts Mac G and Sol Phenduka, JR shared insights into the creation process, relaying how AKAs vision evolved into a track that danced between hip hop and dancehall influences.\n\nNot to be overlooked is Victory Lap, a testament to perseverance with a relatively modest 140,000 views.\n\nThis powerful anthem, featured on his acclaimed album Altar Ego, speaks not just to his journey as an artist, but serves as a beacon of hope for many listeners facing their own challenges.\n\nIt showcases AKAs ability to transform personal trials into relatable experiences, encouraging fans to chase their dreams with determination.\n\nThis track marked a pivotal moment, announcing AKA as a formidable force in the music industry and launching him fully into the mainstream consciousness.\n\nIt captures a sense of aspiration as AKA reflects on his own journey and the desire to reach similar heights  an intimate glimpse into the mind of an artist deeply rooted in personal experiences.\n\nAs we track AKAs extensive catalogue, its clear that his music does more than simply entertain  it profoundly impacts lives, prompting listeners to confront their own emotions and experiences.\n\nHis talent for blending diverse genres, including hip hop, kwaito, and Afrobeat, set AKA apart as a unique force wielding significant influence on the music scene in SA and beyond.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/04030512/AKA-Profile.jpeg",
            "description": "<p>IOL As South Africa continues to mourn the loss of one of its most profound musical voices, Kiernan Jarryd Forbes, better known to the Megacy as AKA, remains an indelible part of the nation’s cultural fabric. The celebrated rapper and songwriter, tragically taken from us on February 10, 2023, left behind a legacy transcending mere entertainment; his music captures</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/remembering-aka-exploring-the-south-african-rappers-most-streamed-songs/\">Remembering AKA: Exploring the South African rapper’s most streamed songs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Rival Zanu PF factions clash at Heroes Acre as succession fight intensifies",
            "url": "https://www.newzimbabwe.com/rival-zanu-pf-factions-clash-at-heroes-acre-as-succession-fight-intensifies/",
            "content": "By Staff Reporter\n\nRIVAL Zanu PF supporters Monday clashed at the Heroes Acre where songs calling for President Emmerson Mnangagwa were drowned in chants that favour his deputy Constantino Chiwenga.\n\n2030 ndeya Emmerson, siyanai naye Mnangagwa, sang hundreds of supporters at the burial of national hero Tinaye Chigudu.\n\nChigudu was one of the first combatants trained under the Zimbabwe Peoples Revolutionary Army (ZPRA) in North Korea.\n\nHe spent 12 years in prison during the fight for liberation and continued with the fight for independence after his release.\n\nThe 2030 statement chanted at Zimbabwes national shrine was in reference to efforts by sections within Zanu PF which want Mnangagwa to stay in power beyond his constitutionally mandated two terms.\n\nAlthough his second term ends in 2028, some within the party want to delay Chiwengas ascent by extending Mnangagwas term by two years.\n\nAs Mnangagwas supporters sang, another section chanted: Siyanai naye Mukanya.\n\nMukanya is Chiwengas totem.\n\nThe clash had been anticipated seeing as the succession battle in Zimbabwes ruling party continues to heat up.\n\nDespite his conspicuous silence, Chiwenga is reportedly eyeing the Presidency.\n\nHe has however publicly denigrated some of Mnangagwas allies, much recently when he seemed to attack controversial tenderprenuer Wicknell Chivayo whom he described as a Chigananda.\n\nMnangagwa on the other hand has already made inroads toward achieving the term extension with provinces and leagues in Zanu PF having already started endorsing him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13054207/Chiwenga-Mnangagwa.png",
            "description": "<p>By Staff Reporter RIVAL Zanu PF supporters Monday clashed at the Heroes Acre where songs calling for President Emmerson Mnangagwa were drowned in chants that favour his deputy Constantino Chiwenga. “2030 ndeya Emmerson, siyanai naye Mnangagwa,” sang hundreds of supporters at the burial of national hero Tinaye Chigudu. Chigudu was one of the first combatants</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rival-zanu-pf-factions-clash-at-heroes-acre-as-succession-fight-intensifies/\">Rival Zanu PF factions clash at Heroes Acre as succession fight intensifies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Fraud-accused Mpofu, Chimombe’s trial fails to take off",
            "url": "https://www.newzimbabwe.com/fraud-accused-mpofu-chimombes-trial-fails-to-take-off/",
            "content": "By Staff Reporter\n\nThe trial in which businessmen Moses Mpofu and Mike Chimombe are accused of duping the state of US$7 million in a botched goat tender has failed to commence as one of the lawyers is currently attending a family bereavement.\n\nOne of the lawyers, Advocate Tapson Dzvetero, lost his brother-in-law last night, High Court judge Justice PisirayiKwenda was told.\n\nMr Dzvetero is attending the funeral of his brother-in-law who was electrocuted at the Support Unit last night.\n\nBurial is expected on Wednesday or Thursday and my principal, Mr Dzvetero will not be availablebut I received instructions that he might be available on the 19th /20th of February going forward,said Chapeta who was standing in for Dzvetero.\n\nThe trial which was initially set for this entire week on a continuous roll is now expected to commence on February 20.\n\nWitness Mabhaudhi confirmed that he had been informed of the funeral.\n\nWe are left with only one month to complete the term, the judge said, noting that the matter should be finalised before the term ends.\n\nSeven witnesses were in attendance.\n\nThe first to testify will be Titus Mbambi, Fungai Kapfunde and Beverly Mutsikamahwe.\n\nMpofu and Chimombe face allegations of corruptionin which the State alleges they defrauded the Ministry of Lands of US$7 million after applying and securing a tender using a non-existent firm.\n\nThe two have been in jail since June last year.\n\nAll their efforts to secure freedom have failed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Staff Reporter The trial in which businessmen Moses Mpofu and Mike Chimombe are accused of duping the state of US$7 million in a botched goat tender has failed to commence as one of the lawyers is currently attending a family bereavement. One of the lawyers, Advocate Tapson Dzvetero, lost his brother-in-law last night, High</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fraud-accused-mpofu-chimombes-trial-fails-to-take-off/\">Fraud-accused Mpofu, Chimombe’s trial fails to take off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Kendrick Lamar’s Super Bowl show was one big tease",
            "url": "https://www.newzimbabwe.com/kendrick-lamars-super-bowl-show-was-one-big-tease/",
            "content": "BBC\n\nI want to play their favourite song but you know they love to sue, said Kendrick Lamar, a couple of minutes into his Super Bowl half-time show.\n\nEveryone knew what he was referring to. Not Like Us, his brutal takedown of rap rival Drake, was one of last years breakout hits, earning one billion streams on Spotify and five Grammy Awards, including song of the year.\n\nBut there were questions over whether Lamar would play it  or even could play it  at the Super Bowl, afterDrake filed a defamation lawsuitfor lyrics that branded him a sexual predator, which he denies.\n\nLamar leaned into the dilemma, teasing the song over and over during his set, before finally giving the audience what they wanted.\n\nWhen the song finally played, Kendrick self-censored the most contentious lyric, in which he calls Drake a certified paedophile.\n\nBut he looked directly into the camera with a mischievous grin as he called out Drakes name; and left intact the songs notorious double-entendre: Tryin to strike a chord and its probablyA minor.\n\nThat lyric echoed around the Caesars Superdome in Louisiana, indicating that no amount of legal action could ever hope to diminish the songs popularity.\n\nIn playing it, Lamar was expected to have reached more than 120 million TV viewers who had tuned in to see the game in which thePhiladelphia Eagles defeated the Kansas City Chiefs 40-22to deny them an unprecedented third straight Super Bowl.\n\nThe performance was further heightened by the surprise appearance of tennis star Serena Williams, who performed the Crip Walk  a notorious Los Angeles dance move  as Lamar prowled the stage.\n\nDrakes lawyers are suing Lamars record label Universal Music Group over the track, accusing it of trying to create a viral hit out of a song that made false factual allegations about the star.\n\nGetty Images Serena Williams was the only unannounced guest star during the set\n\nSunday marked the first time that a solo rapper had headlined the Super Bowl, and Lamar brought an elaborate stage show, full of dancers, fireworks and special guests.\n\nBut the rappers lyrics have always explored the contradictions between ego and self-doubt, and his Super Bowl set put that conflict in the spotlight.\n\nHe performed on a giant noughts and crosses board, flipping between introspective deep cuts (typically staged inside the Xs) and crowd-pleasing chart hits (which took place in the Os).\n\nActor Samuel L Jackson, dressed as Uncle Sam, acted as emcee  berating Lamar when he became too self-indulgent, and praising his duets with R&B singer SZA.\n\nThats what Im talking about, Jackson said, after the duo performed All The Stars, a ballad from the soundtrack to Marvels Black Panther movie.\n\nThats what America wants, nice and calm.\n\nGetty Images Kendrick arrived on stage atop a black Buick GNX car  the same model his father drove home from hospital after he was born in 1987\n\nBut whatever Lamar performed, the energy was electrifying.\n\nEarly highlights included Humble and DNA, both taken from the rappers Pulitzer Prize-winning album DAMN, and whose tectonic beats rattled around the stadium.\n\nThe set,which is available to watch on YouTube, also included Squabble Up, Man At The Garden and another Drake diss track, Euphoria.\n\nUnlike most Super Bowl performers, Lamar isnt much of a mover, but he had a charismatic swagger as he walked in step with his dancers; and clever staging gave the show momentum  especially on nervy, angular tracks like Peekaboo.\n\nSZA also gave the set a lift, with supple vocals and improbably flexible choreography that helped soften Lamars edgier instincts.\n\nGetty Images SZA and Lamar have been frequent collaborators, appearing on each others albums since 2017\n\nReuters Samuel L Jackson was the ringleader of Lamars elaborate Super Bowl set\n\nNot Like Us was the undoubted climax, but Lamar took a victory lap on the bouncy West Coast anthem TV Off, where he boasted, yeah, somebody gotta do it.\n\nHe was joined on stage by the songs producer, Mustard, who clutched a football while sporting the worlds baggiest jeans  before Lamar pointed an imaginary remote control at the camera and intoned, Game Over.\n\nFor fans, it was a powerful performance, full of Easter eggs  including a snippet of the unreleased song Bodies.\n\nCasual viewers might have agreed more with Samuel L Jacksons plea for Lamar to keep it light; especially as some of his more densely-written lyrics were rendered unintelligible by the stadiums cavernous echo.\n\nAnd it was noticeable that Lamar omitted to play his civil rights anthem Alright, in a year where the NFL chose to remove the phrase end racism from the end zone of the football field.\n\nThe phrase had been present at the Super Bowl since 2020, amid the Black Lives Matter protests  for which Alright had become the unofficial soundtrack.\n\nMany had expected Lamar to make a bigger statement, especially with President Donald Trump in attendance, but the stars performance remained resolutely uncontroversial  unless, of course, your name is Drake.\n\nGetty Images A protester unveiled a flag during Not Like Us\n\nNonetheless, Lamars show was sleek and streamlined  as many fans had expected, afteraudio of the backing track leakedon Thursday.\n\nThe only interruption came at the climax of the 13-minute set, when a protester climbed on top of Lamars black Buick GNX car and unfurled a combined Palestinian and Sudanese flag, before being tackled by security officers.\n\nThe NFL later said in a statement that the protester was part of the 400-member cast who took part in the show.\n\nGetty Images\n\nThe career-spanning set crammed 11 songs into 13 minutes. Heres what Kendrick played.\n\nReuters Taylor Swift was there to support her boyfriend Travis Kelce, whose team were in the final for the third consecutive year\n\nBefore the show, it had been rumoured that Taylor Swift might swoop down from her VIP suite to join Lamar on stage.\n\nThe pair duetted on a remix of her single Bad Blood in 2015  and fans hoped they might perform it live for the first time at the Super Bowl.\n\nIn the end, Swift opted just to watch the show, along with other celebrity attendees including Paul McCartney, Stormzy, Lady Gaga, Jay-Z, Ice Spice, Doechii, Paul Rudd, Bradley Cooper and Winnie Harlow.\n\nMaybe it was for the best: Some reports suggested that Swift had been booed at the stadium, where almost 80% of fans supported the Philadelphia Eagles, rather than her boyfriend Travis Kelces team.\n\nFox Lady Gaga taped her segment earlier in the week\n\nBefore kick-off, Lady Gaga made a surprise appearance on Bourbon Street, in the middle of New Orleans historic French Quarter.\n\nThe star, who played her own Super Bowl half-time show in 2017, played a touching rendition of her song Hold My Hand, honouring the victims of the New Years Day terror attack that claimed the lives of 14 people in the city.\n\nGaga was surrounded by first responders as she played a black baby grand piano in the middle of the road.\n\nHere on Bourbon Street, always the heart and soul of New Orleans, this year began with a terror attack that tried to shatter its spirit, said former American footballer Michael Strahan during the pre-filmed segment.\n\nBut the resilience of New Orleans is matched by the resolve of our country.\n\nGetty Images Jon Batiste became the first musician to perform the US National Anthem at the Super Bowl in front of a sitting president\n\nMusical performances before the game also included R&B artist Ledisi, who performed Lift Every Voice and Sing, often referred to as the Black National anthem, joined by 125 youth choir members.\n\nMusician Troy Andrews, popularly known as Trombone Shorty, and Christian singer-songwriter Lauren Daigle played America the Beautiful  giving the track a feel-good New Orleans vibe.\n\nAnd just before the game began, New Orleans native Jon Batiste sang the American National Anthem, adding a few jazz flourishes from his multi-coloured grand piano.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10071528/kendrick-super-bowl.webp",
            "description": "<p>BBC “I want to play their favourite song… but you know they love to sue,” said Kendrick Lamar, a couple of minutes into his Super Bowl half-time show. Everyone knew what he was referring to. Not Like Us, his brutal takedown of rap rival Drake, was one of last year’s breakout hits, earning one billion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kendrick-lamars-super-bowl-show-was-one-big-tease/\">Kendrick Lamar’s Super Bowl show was one big tease</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "This is the player I appreciate – Vitor Pereira gives verdict on Marshall Munetsi after debut for Wolves in Blackburn win",
            "url": "https://www.newzimbabwe.com/this-is-the-player-i-appreciate-vitor-pereira-gives-verdict-on-marshall-munetsi-after-debut-for-wolves-in-blackburn-win/",
            "content": "Molineux\n\nWolves are into the fifth round of the FA Cup after beating Blackburn Rovers  and fans got their first look at new signing Marshall Munetsi.\n\nWolveswon 2-0 at Ewood Park courtesy of goals from Joao Gomes and Matheus Cunha.\n\nIt was ultimately a great day at the office for Wolves having started the game a little slowly, and there were several top individual performances at Ewood Park.\n\nVitor Pereirawent strong with his team selection, just as he did against Bristol City.\n\nNew signingMarshall Munetsiwas named on the bench, as was Nasser Djiga  and the Zimbabwean was called into action midway through the second-half.\n\nWolves fans enjoyed Munetsis display against Blackburn, after the game, Pereira gave his thoughts about the new Wolves number 5.\n\nPereira started Gomes and Jean-Ricner Bellegarde as a midfield two against Blackburn, and the pair did a great job.\n\nJust after the hour mark, Munetsi came on in place of Bellegarde, and it was a lively debut from the former Reims ace.\n\nMunetsi played in midfield but regularly pushed up high and even found himself in the box a few times.\n\nHe had a few chances to score, including a headed opportunity after a delicious cross from the magnificent Rodrigo Gomes.\n\nMunetsi is a holding midfielder by trade, but did actually have a good goalscoring record at Reims.\n\nAnd seemingly, Pereira wont be afraid to use him higher in games.\n\nHe said of his new signing after todays game (as quoted by Nathan Judah): Hes a transition midfielder with the physicality to break & score & then be defending, this is the player I appreciate Hes a midfielder that score goals, its normal for him, he has a good record.\n\nFurther quotes from Pereira on Munetsi and the other newbies have appeared on theWolves official websitesaying: Hes a strong player. The three players that we brought in this window, they are strong  physically strong, and they can add a lot. They can help us a lot in this long season that we have to face.\n\nIt was a positive debut for Munetsi against Blackburn and fans will hope he can soon push the likes of Gomes, Andre and Bellegarde for a starting spot.\n\nHe looks like he will add physicality for Wolves, but clearly, he does also have an eye for goal as well, and Pereira looked like he wanted to take advantage of Munetsis attacking prowess against Blackburn.\n\nThe star has come from the same team as Emmanuel Agbadou, and fans will hope Munetsi can have a similar impact to that of the Ivorian.\n\nAll of a sudden, this Wolves squad feels much more competitive, and hopefully, the second half of the season will be radically different to the first.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070129/munetsi-debut.webp",
            "description": "<p>Molineux Wolves are into the fifth round of the FA Cup after beating Blackburn Rovers – and fans got their first look at new signing Marshall Munetsi. Wolves won 2-0 at Ewood Park courtesy of goals from Joao Gomes and Matheus Cunha. It was ultimately a great day at the office for Wolves having started</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/this-is-the-player-i-appreciate-vitor-pereira-gives-verdict-on-marshall-munetsi-after-debut-for-wolves-in-blackburn-win/\">This is the player I appreciate – Vitor Pereira gives verdict on Marshall Munetsi after debut for Wolves in Blackburn win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "A fitness club in Zimbabwe cemetery aims to outpace death one step at a time",
            "url": "https://www.newzimbabwe.com/a-fitness-club-in-zimbabwe-cemetery-aims-to-outpace-death-one-step-at-a-time/",
            "content": "By VOA\n\nHARARE  At dawn, 65-year-old Nelly Mutandwa swapped her pajamas for leggings, a T-shirt and sneakers. She grabbed a bottle of water before heading to an unconventional workout spot: a cemetery in Zimbabwes capital, Harare.\n\nSurrounded by rows of graves, she joined other members of the Commandos Fitness Club in an hour-long session of squats, lunges and stretches as upbeat music blared. For Mutandwa, the daily routine is more than exercise. Its her lifeline in managing diabetes.\n\nThey are resting, she said, pointing to the graves. I just dont want to join them yet. That means I have to do the hard work here.\n\nWith limited fitness facilities such as gyms in their neighborhoods, older Zimbabweans are exercising wherever they can to combat Africas growing problem of non-communicable diseases like heart problems, high blood pressure and diabetes. Other groups exercise along highways or disused railway lines.\n\nGlobally, non-communicable diseases, which are conditions that cannot be directly passed from person to person, are the leading cause of death, responsible for 41 million, or 74%, of annual fatalities, according to the World Health Organization.\n\nNon-communicable diseases currently account for about 40% of deaths annually in Zimbabwe, according to its ministry of health and child care.\n\nIn Zimbabwe and the rest of sub-Saharan Africa, non-communicable diseases are set to overtake communicable diseases such as HIV, tuberculosis, malaria and cholera as the leading cause of death or illness by 2030, according to WHO.\n\nPreviously associated with older people, non-communicable diseases are increasingly spreading to children and young adults due to smoking, frequent alcohol use, unhealthy diets and lack of physical activity.\n\nThis has sparked huge concern among experts and governments on a continent that is experiencing the worlds fastest population growth and is home to its youngest population.\n\nDr. Johannes Marisa, a public health specialist in Harare and president of the Medical and Dental Private Practitioners of Zimbabwe Association, said doctors are witnessing a rapid change as more children and young people are diagnosed with NCDs.\n\nHe attributed it partly to sedentary lifestyles as many people spend much of their time glued to their smartphone screens at the expense of physical movement, as well as growing substance abuse and unhealthy diets.\n\nWhile climate change-induced droughts have left many rural people in Zimbabwe scrounging for food, traders in urban areas are racing to get a piece of the fast food market thats widely blamed for obesity.\n\nIn Harare and other urban areas, franchises such as KFC compete with a mushrooming number of cheaper local restaurants and informal roadside stalls, public markets and even homes where one can grab a fried piece of chicken, a burger or a fries-and-sausage combo for a dollar.\n\nIn response, Finance Minister Mthuli Ncube in the 2025 national budget imposed a modest 0.5% tax on sales of doughnuts and other foods including tacos, pizza, hot dogs, shawarma, fries, chicken and burgers by retailers to encourage healthier dietary choices and mitigate the prevalence of non-communicable diseases.\n\nMeanwhile, some older Zimbabweans are taking up physical exercise.\n\nFor Mutandwa and her Commandos Fitness Club crew, the surroundings of the cemetery suffice. Coached by Joseph Nekati, whose mothers stroke in 2023 inspired him to help others, the free club has become a sanctuary for older fitness buffs. Eight of the clubs roughly 20 members are older people, Nekati said.\n\nI weighed 86 kilograms (189 pounds) and struggled to stand up. I would struggle to breathe just walking in my house. Now, Im down to 76 kilograms (167 pounds) and I can walk long distances, said Susan Gomo, a 64-year-old grandmother managing high blood pressure and arthritis.\n\nThe group exercise is also meant to encourage other older people to work out. Some of my age mates are reluctant, Gomo said. They end up just eating and sitting at home. They might change their minds when they see me in great shape.\n\nMutandwa said she picked up the habit of power walks when she visited her daughter in the United Kingdom in 2022. She decided to try it back home in Zimbabwe, but the roads in her township were potholed and crowded. She went for solo walks on a nearby hill, but she felt unsafe.\n\nLast year, she noticed the fitness club in the cemetery, where a wide and well-maintained path provides a convenient workout spot. With three of her neighbors, she approached the coach, who happily took them in.\n\nNow the cemetery has come to symbolize Mutandwa and others quest to live healthier and outpace death  one step at a time.\n\nIts serene, its safe and we have a lot of space with minimal disturbances. Hopefully the (local) council can build proper facilities for us, she said, preparing to stroll back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10065303/VOA.jpg",
            "description": "<p>By VOA HARARE — At dawn, 65-year-old Nelly Mutandwa swapped her pajamas for leggings, a T-shirt and sneakers. She grabbed a bottle of water before heading to an unconventional workout spot: a cemetery in Zimbabwe’s capital, Harare. Surrounded by rows of graves, she joined other members of the Commandos Fitness Club in an hour-long session</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-fitness-club-in-zimbabwe-cemetery-aims-to-outpace-death-one-step-at-a-time/\">A fitness club in Zimbabwe cemetery aims to outpace death one step at a time</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Africa knew Trump’s ‘America First’ pledge meant it might be last. Then came the freeze on aid",
            "url": "https://www.newzimbabwe.com/africa-knew-trumps-america-first-pledge-meant-it-might-be-last-then-came-the-freeze-on-aid/",
            "content": "By VOA\n\nJOHANNESBURG Four days after President Donald Trump signed an executive order freezing almost all U.S foreign aid, an email landed in Claris Madhukus inbox in rural Zimbabwe. Stop all activities immediately, it said.\n\nThe message confirmed Madhukus fears that Trumps return to office might affect his organizations efforts to save African girls from child marriages.\n\nMany Africans had known that Trumps America First outlook meant their continent was likely to be last among his priorities. But they hadnt expected the abrupt halt to foreign aid from the worlds largest donor that stops money flowing for wide-ranging projects like disease response, girls education and free school lunches.\n\nEven after global outrage prompted some exemptions to Trumps order, sub-Saharan Africa could suffer more than any other region as most global aid pauses 90 days for a spending review. The U.S. gave the region more than $6.5 billion in humanitarian assistance last year.\n\nFor Madhuku and countless others, the damage has been done. His Platform For Youth and Community Development is one of hundreds of small non-governmental organizations in Africa that receive assistance from the U.S. government  and ultimately from the American people  to do good work.\n\nWithout U.S. aid, Madhukus group cant give around 100 volunteers allowances for food and public transport as they do outreach seeking to keep girls in school and out of early marriages.\n\nWe had to stop everything, no warning, no time to adjust, Madhuku said. I appreciate that Trump might have some justification in trying to account for American taxpayers money  but it has caused disaster here.\n\nThe worlds most successful foreign aid program\n\nFor many in Africa, thoughts immediately turned to arguably the worlds most successful foreign aid program, the Presidents Emergency Plan for AIDS Relief, or PEPFAR.\n\nOver two decades, the program with bipartisan support has been credited with saving more than 25 million lives, the vast majority in Africa, the continent it was designed to help most.\n\nThe world is baffled, the health minister of South Africa, the country with the most people living with HIV, said after the U.S. freeze on aid.\n\nThe minister, Aaron Motsoaledi, said the U.S. funds nearly 20% of South Africas $2.3 billion annual HIV/AIDS program through PEPFAR, and now the biggest response to a single disease in history is under threat.\n\nMore than 8 million in South Africa live with HIV, and authorities say PEPFAR helps provide life-saving antiretroviral treatment to 5.5 million people every day.\n\nHIV patients are turned away\n\nU.S. Secretary of State Marco Rubio has announced that programs offering life-saving assistance including medicine, medical services, food and shelter would be exempted from the aid freeze, though what qualifies is not immediately clear.\n\nThe United Nations AIDS program said many organizations receiving PEPFAR funding had closed due to the aid pause and there was lack of clarity and great uncertainty about the future. More than 20 million people globally receive HIV treatment with PEPFAR support, UNAIDS said.\n\nIn South Africas largest city, Johannesburg, and elsewhere, PEPFAR-funded facilities were still shut days after the exemptions were announced and HIV patients were referred to government hospitals and clinics.\n\nIn Johannesburgs largest township, Soweto, two workers at the PEPFAR-funded HIVSA center turned patients away. And a notice at the renowned Wits RHI Key Populations Clinic, which serves adults and children living with HIV, read: We apologize for the inconvenience this causes.\n\nDelays could be dangerous\n\nExperts said the effects on HIV programs remain unclear but the consequences could be swift, even dangerous.\n\nWe need to know a lot more before we can say people wont die directly because of the pause to funding, said Charles Kenny, a senior fellow at the Center for Global Development in Washington, noting that while the waiver should cover HIV drugs, HIV diagnostic tests are also critical to ensure treatment gets to those who need it.\n\nKenny said even short interruptions to antiretroviral treatment  which stops the virus replicating in the body  are risky.\n\nHIV viral loads rebound in about three weeks if you go off antiretrovirals, he said.\n\nOverall, even senior officials in the aid community are not sure which U.S.-funded programs are allowed to at least briefly continue operations.\n\nThe Trump administration has warned contractors and staffers with USAID  the agency responsible for dispersing Americas foreign aid  they could be disciplined if they speak to anyone outside the agency without top-level approval, and aid groups fear they may permanently lose funds if they speak publicly.\n\nStopping aid in war zones\n\nA humanitarian official told The Associated Press that at least 1.2 million people in Congo could lose life-saving support because of the aid freeze. The official, who spoke on condition of anonymity because they were not authorized to speak publicly on the matter, said almost half of their organizations funding is from USAID.\n\nOverall, more than $100 million for the organizations humanitarian programs in more than 30 countries worldwide has been halted, according to the official.\n\nThe block on aid came during a major escalation in fighting in eastern Congo, where millions of people were already displaced and where outbreaks of the mpox virus were declared a global health emergency last year.\n\nIn civil-war-torn Sudan, which is grappling with cholera, malaria, and measles, the aid freeze means 600,000 people will be at grave risk of catching and spreading those diseases, the official said.\n\nEven with the exemption for life-saving services, the official said their organization had been told they should not resume any USAID-funded activities until they received notification that the waiver applies to them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070700/USAID-office.jpg",
            "description": "<p>By VOA JOHANNESBURG— Four days after President Donald Trump signed an executive order freezing almost all U.S foreign aid, an email landed in Claris Madhuku’s inbox in rural Zimbabwe. Stop all activities immediately, it said. The message confirmed Madhuku’s fears that Trump’s return to office might affect his organization’s efforts to save African girls from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africa-knew-trumps-america-first-pledge-meant-it-might-be-last-then-came-the-freeze-on-aid/\">Africa knew Trump’s ‘America First’ pledge meant it might be last. Then came the freeze on aid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Humphreys spins Ireland to brink of victory over Chevrons",
            "url": "https://www.newzimbabwe.com/humphreys-spins-ireland-to-brink-of-victory-over-chevrons/",
            "content": "By Associated Press\n\nSPINNER Matthew Humphreys took four wickets as Ireland reduced Zimbabwe to 183-7 on a rain-hit fourth day, leaving them well-poised for victory in Bulawayo.\n\nHe shared the individual honours with Zimbabwe all-rounder Wessly Madhevere, who struck his first half-century in Test cricket and was unbeaten on 61 at the close.\n\nMore than four hours were lost due to two rain interruptions before bad light stopped play 12 minutes ahead of schedule.\n\nZimbabwe need 109 runs to win on the final day, with a forecast of scattered thunderstorms again threatening to restrict play.\n\nTwenty-two-year-old Humphreys dismissed first-innings star Nick Welch for five late on Saturday and added the prize wickets of Brian Bennett (45) and Johnathan Campbell (33) on Sunday.\n\nThe left-arm spinner also claimed the wicket of Nyasha Mayavo (eight) to finish with 4-41 at the Queens Sports Club.\n\nHis dismissal of Bennett ended a battling 65-run fifth-wicket partnership with Madhevere. A thick edge proved the undoing of the Zimbabwean as wicketkeeper Lorcan Tucker reacted sharply to make the catch.\n\nMadhevere then combined with Campbell to add 56 for the sixth wicket before the stand-in captain drove a full toss firmly back at Humphreys, who reacted quickly by sticking out his left hand and clinging on to the catch.\n\nMadhevere, who only came into the team shortly before the match began when captain Craig Ervine withdrew for the birth of his child, played an assured innings striking seven fours in his undefeated 61 which came from 147 deliveries.\n\nIt was a pleasing change of fortunes for the 25-year-old, who has scored 87 runs in this match after ducks in his three previous Test innings.\n\nAfter the Bulawayo Test, the teams travel north to Harare for three ODIs and three T20Is.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10044825/Matthew-Humphreys-9-Feb-2025-Zimbabwe-Cricket-1024x632-1.jpg",
            "description": "<p>By Associated Press  SPINNER Matthew Humphreys took four wickets as Ireland reduced Zimbabwe to 183-7 on a rain-hit fourth day, leaving them well-poised for victory in Bulawayo. He shared the individual honours with Zimbabwe all-rounder Wessly Madhevere, who struck his first half-century in Test cricket and was unbeaten on 61 at the close. More than</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/humphreys-spins-ireland-to-brink-of-victory-over-chevrons/\">Humphreys spins Ireland to brink of victory over Chevrons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Julius Malema an international criminal, Elon Musk an enemy of South Africa, bitter spat intensifies",
            "url": "https://www.newzimbabwe.com/julius-malema-an-international-criminal-elon-musk-an-enemy-of-south-africa-bitter-spat-intensifies/",
            "content": "By IOL\n\nECONOMIC Freedom Fighters leader Julius Malema has told the South Africa-born US billionaire Elon Musk to go to hell after he made calls on X for the red berets chief to be declared an international criminal.\n\nThis comes after Musk retweeted old clips of Malema making comments about cutting the throat of whiteness.\n\nMusk called for immediate sanctions for Malema and for the former ANC Youth League leader to be declared as an international criminal.\n\nIn response, Malema tweeted: I really think you have entirely lost your left brain: a typical spoiled brat and direct beneficiary of Apartheid whiteness.\n\nI know black people look the same to you, typical racist. Look closer, and you will realise those are two different people. America is exposing us to its stupidity. I dont care about your sanctions; I will never stop fighting for black people to be equal to white people, and if that makes me an international criminal, I am proud to be one.\n\nTrump, Musk turn heat on SA\n\nMusk and US president Donald Trump have intensified tensions against South Africa in recent weeks after President Cyril Ramaphosa signed into the law the Expropriation Act.\n\nOn Friday, Trump announced that he had signed executive orders which would see USAID no longer funding any HIV/Aids programmes in South Africa and that white Afrikaners would be given priority status for the US refugee programme.\n\nThe EFF has called for the Ramaphosa government to strengthen ties with Brics partners amid the aggression from the US, saying the Trump administration was punishing Pretoria for backing the people of Palestine after South Africa took Israel to the International Court of Justice.\n\nIn a statement, EFF spokesperson Sinawo Thambo said they were not concerned by the comments by Musk.\n\nAs part of the general hysteria that has overtaken governance in the USA, Musk has assumed the role of a global billionaire maniac, whose grotesque wealth has overwhelmed him and made him think of himself as a supreme ruler of not only the Oval Office, but of all nations of the world, he said.\n\nThe EFF takes this opportunity to tell Elon Musk and all of his allies, in the USA, in Israel and the right wing groups in South Africa which have mobilized Musk, to collectively go to hell.\n\nThe principle remains that equality in South Africa is rooted in the return of the land to African people, and this will be achieved through expropriation without compensation, said Thambo.\n\nNo Starlink favours for Musk in SA\n\nThe EFF said it was also making a firm commitment that Musks Starlink will never operate in South Africa without complying to local legislation which demands that there must be 30% local ownership.\n\nThe offense that Musk has made against the leader of the EFF constitutes a meddling in our domestic affairs which we do not take lightly, and he must be viewed as an imperialist who seeks to undermine the economic and political sovereignty of South Africa through sanctions, and is part of mischievous attempts to severe relations between South Africa and the US.\n\nThe EFF declare Elon Musk as an enemy of South Africa, and a capturer of governance in the USA who will lead to that nations downfall.\n\nAll progressive nations, including Russia, China, India, and all African states ought to isolate and reject all enterprises pursued by Elon Musk in their nations.\n\nElon Musk has captured the Presidency of the USA and has weaponized his office as an instrument to pursue his business interests globally.\n\nHis nefarious influence must be opposed and undermined by all nations which respect their sovereignty and seek to maintain independence.\n\nThe EFF will not be cowed into submission, retreat nor capitulation from its principled and unwavering commitment to confront imperialism and its surrogates like Elon Musk anywhere and everywhere it rises its ugly head, said Thambo.\n\nAs tensions between Washington and Pretoria spill over, Afriforum announced at the weekend that they would not be taking up Trumps offer for refuge in the US.\n\nAfriforum is seeking an audience with Ramaphosa to resolve the current impasse over the Expropriation Act and other policies, including the Basic Education Laws Amendment Act.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10042353/Musk-vs-Malema.webp",
            "description": "<p>By IOL ECONOMIC Freedom Fighters leader Julius Malema has told the South Africa-born US billionaire Elon Musk to “go to hell” after he made calls on X for the red berets chief to be declared an international criminal. This comes after Musk retweeted old clips of Malema making comments about cutting the throat of whiteness.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/julius-malema-an-international-criminal-elon-musk-an-enemy-of-south-africa-bitter-spat-intensifies/\">Julius Malema an international criminal, Elon Musk an enemy of South Africa, bitter spat intensifies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Chivayo to rescue Highlanders from FIFA ban, pledges to offset fees owed to former coach Brito",
            "url": "https://www.newzimbabwe.com/chivayo-to-rescue-highlanders-from-fifa-ban-pledges-to-offset-fees-owed-to-former-coach-brito/",
            "content": "By Sport Reporter\n\nCONTROVERSIAL businessman Wicknell Chivayo has pledged to bail out Castle Lager Premier Soccer League (PSL) giants Highlanders from a FIFA transfer ban.\n\nBosso was slapped with a FIFA transfer ban after failing to pay outstanding salaries to former coach Baltermar Brito together with his assistant Torres.\n\nThe Brazilian gaffer left Bosso in December 2023 after the club opted not to renew his contract.\n\nIn total, Highlanders owes Brito US$14 778, with the debt accruing an additional US$237,71 in interest as of October 17, 2024, while Torres is owed US$11 788 plus interest of $193,74 as at October 17, 2024.\n\nPosting on his X account , Chivhayo pledged to settle the debt for Highlanders.\n\nBosso ngenkani! Iteam yezwe lonke. Babethi ayibulawe, ayisoze ibulawe sikhona.\n\nI will gladly pay this outstanding debt directly to the former coach tomorrow without fail. Someone please inbox and share the banking details with the exact amount due ASAP, read Chivayos post.\n\nMeanwhile, Ngezi Platinum has also been slapped with FIFA transfer sanction for failing to settle former coach Bongani Mafus debt.\n\nWith additional interest, FIFA has ordered Ngezi to pay Mafu US$200,000 for unfair dismissal and other charges.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/25061755/Baltemar-Brito-2.jpeg",
            "description": "<p>By Sport Reporter  CONTROVERSIAL businessman Wicknell Chivayo has pledged to bail out Castle Lager Premier Soccer League (PSL) giants Highlanders from a FIFA transfer ban. Bosso was slapped with a FIFA transfer ban after failing to pay outstanding salaries to former coach Baltermar Brito together with his assistant Torres. The Brazilian gaffer left Bosso in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chivayo-to-rescue-highlanders-from-fifa-ban-pledges-to-offset-fees-owed-to-former-coach-brito/\">Chivayo to rescue Highlanders from FIFA ban, pledges to offset fees owed to former coach Brito</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "10 Feb 2025"
        }
    ]
}