{
    "news": [
        {
            "title": "High Court quashes Rusape councillors’ malicious prosecution damages award",
            "url": "https://www.newzimbabwe.com/high-court-quashes-rusape-councillors-malicious-prosecution-damages-award/",
            "content": "By Mary Taruvinga\n\nThe High Court has overturned a ruling that had awarded damages to six Rusape councillors who sued the town council for malicious prosecution, finding that the council never instigated their arrest and that their claims for legal fees and lost business were unsupported.\n\nJustices Sijabuliso Siziba and Isaac Muzenda allowed Rusape Town Councils appeal and dismissed the councillors claims, which had each been pegged at US$7,500.\n\nThe court a quo erred in finding the appellant liable for the delict of malicious prosecution, ruled Justice Siziba. There was no evidence that the council, as a legal persona, took a resolution to set the law in motion against the respondents. Without such resolution, the council cannot be said to have instigated prosecution.\n\nThe case stemmed from a 2020 tender row over the provision of legal services. The six councillors Lyton Sithole, Elizabeth Chidza, Joseph Nyamupera, Ndabaningi Mataga, Preference Chigwede and Peter Kwesha were arrested and charged by the Zimbabwe Anti-Corruption Commission (ZACC) with criminal abuse of duty after the tender was cancelled.\n\nHowever, at their criminal trial, State witnesses, including then Acting Town Secretary Fansen Shuwa, cleared them of wrongdoing, testifying that they had not been part of the committee handling the tender. The councillors were acquitted at the close of the States case.\n\nIn 2023, the six sued the council for malicious prosecution, demanding US$40,000 collectively in damages. The magistrates court later awarded them each US$5,500 for legal fees and US$2,000 for lost business opportunities.\n\nThe High Court said those awards had no evidentiary basis.\n\nMalicious prosecution requires more than merely reporting a case to the police, Justice Siziba said. A party can only be found liable if it acted in a manner that tended to overbear on the police to institute proceedings which they would not otherwise commence. That was not the case here.\n\nThe court noted that ZACC had independently approached town officials and obtained statements while the councillors were away, with no council resolution authorising or directing such action.\n\nOn the issue of damages, the judges stressed that special damages must be strictly proven. No receipts were produced to show that any payment was made to lawyers, Justice Siziba wrote. It was a misdirection for the trial court to rely on the Law Society tariff in the absence of proof of actual payment.\n\nThe judges also dismissed the claims for lost business opportunities as unsubstantiated.\n\nThe councillors victory in the lower court has now been nullified. Rusape Town Council will not be liable for any damages.\n\nIn the result, we found merit in the appeal by the appellant and thereby upheld the appeal, the judgment concluded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29191212/rusape.jpg",
            "description": "<p>By Mary Taruvinga The High Court has overturned a ruling that had awarded damages to six Rusape councillors who sued the town council for malicious prosecution, finding that the council never instigated their arrest and that their claims for legal fees and lost business were unsupported. Justices Sijabuliso Siziba and Isaac Muzenda allowed Rusape Town</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-quashes-rusape-councillors-malicious-prosecution-damages-award/\">High Court quashes Rusape councillors’ malicious prosecution damages award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "29 Sep 2025"
        },
        {
            "title": "NoViolet Bulawayo wins the 2025 Best of Caine Award for ‘Hitting Budapest’",
            "url": "https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-2025-best-of-caine-award-for-hitting-budapest/",
            "content": "IOL\n\nThe Caine Prize for African Writing has a reason to celebrate as it marks its 25th anniversary with the announcement of Zimbabwean author NoViolet Bulawayo as the recipient of the prestigious 2025 Best of Caine Award. This accolade is bestowed upon her gripping short story, Hitting Budapest, which originally earned her the Caine Prize in 2011.\n\nThe announcement was made during the inauguralWords Across Waters Afro Lit Festivalon Saturday, by Ellah Wakatama OBE, Chair of the Caine Prize. This years judging panel, presided over by Nobel Laureate Prof. Abdulrazak Gurnah, included acclaimed authors and cultural figures such as Jennifer Nansubuga Makumbi and film producer Tony Tagoe.\n\nProf. Gurnah said, It was a tremendously impressive collection of stories to read through, but the decision to award the Best of Caine Prize to NoViolet Bulawayo was unanimous and swift. The judges were impressed with the control of voice the story demonstrated and the superb evocation of a childhood vision.\n\nExpressing her gratitude upon accepting the award, NoViolet Bulawayo reflected on her journey as a writer, stating, Winning the Caine Prize as an unpublished writer back in 2011 was truly the kind of defining highlight to jumpstart a career, it brought my work to a global audience, affirmed my literary path, and strengthened my confidence and commitment to writing.\n\nBulawayo further highlighted the significance of the Best of Caine Award as a moment of reflection on her literary evolution: Now, receiving the Best of Caine Award these many years later feels like a moment to reflect on the journey. I warmly congratulate the twenty-four remarkable winning authors and finalists whose works have helped define the prize up to this moment.\n\nSince its inception, the Caine Prize has been instrumental in nurturing and promoting African literature, offering writers unparalleled opportunities for visibility and professional development, including publishing deals and writing fellowships. Bulawayos own story is a testament to this legacy, as she has emerged as a voice of significant impact within the global literary community.\n\nThis is twenty-five years of consistency, excellence, and vision  our present is vibrant, and the future promises even more, Bulawayo remarked, dedicating her award to the emerging voices that will shape the future of African literature.\n\nI am truly excited to read you all and witness how you continue to shape the landscape of African literature.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/27013711/NoViolet-Bulawayo.png",
            "description": "<p>IOL The Caine Prize for African Writing has a reason to celebrate as it marks its 25th anniversary with the announcement of Zimbabwean author NoViolet Bulawayo as the recipient of the prestigious 2025 Best of Caine Award. This accolade is bestowed upon her gripping short story, “Hitting Budapest,” which originally earned her the Caine Prize</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-2025-best-of-caine-award-for-hitting-budapest/\">NoViolet Bulawayo wins the 2025 Best of Caine Award for ‘Hitting Budapest’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "29 Sep 2025"
        },
        {
            "title": "Tyla stops the show for a fan and shuts down critics with ‘Not Sorry’ at Global Citizen Festival",
            "url": "https://www.newzimbabwe.com/tyla-stops-the-show-for-a-fan-and-shuts-down-critics-with-not-sorry-at-global-citizen-festival/",
            "content": "IOL\n\nSouth African star Tyla had a powerful moment of humanity during her set at the2025 Global Citizen Festivalin New York.\n\nWhile performing her Grammy-winning hit Water, she stopped mid-song after noticing a fan who had fainted in the crowd.\n\nThe 23-year-old asked production to pause as she called for staff to assist an audience member.\n\nThe music came to a halt, and silence filled Central Parks Great Lawn as the fan received attention. Tyla kept her focus on the situation, later checking in with concertgoers who were nearby to make sure everything was under control\n\nWhen they signalled that all was well, she smiled warmly before asking the crowd whether she should continue where she left off or restart the song. The question led to the audience erupting in excitement, choosing the restart option.\n\nThe popiano star showed care for her fans in the middle of what was already a vibrant night of performances.\n\nLater in the night, Tyla brought a different kind of energy when she performed Mr Media, a song where she directly responds to her critics.\n\nThe song is one of her sassiest, with lyrics that carry a sharp none of your concern message, shutting down outside noise.\n\nAt one point, she sings: Remember when I used to fight with words? Really, I should be worse, I should be meaner What I? None of your concern.\n\nIts essentially a mic drop with Tyla reminding everyone that she can clap back, but often chooses not to.\n\nThat context made it all the more fitting when, mid-performance, she told the Global Citizen audience she is not sorry.\n\nThe statement comes after Nigerian star Tiwa Savageweighed in on Tylas ongoing coloured identity controversyduring an interview on The Breakfast Club, causing online outrage.\n\nSavage said she understood why the term is offensive in America, but also expressed sympathy for Tyla.\n\nI would get why that would be such a huge thing here, because of the history behind that name, she said. I think I felt for her a little bit because she is young and I do not think she means to come across like that.\n\nSavage went further by apologising on Tylas behalf, saying, So if that was not communicated, I would like to say on behalf of her, we apologise. We did not mean it, forgive us. I do not think it came from a bad place.\n\nShakira and Cardi B were among the stars who lit up the 2025 Global Citizen festival, joined by Ayra Starr and Mariah the Scientist.\n\nThis years festival, which took place on September 27, was hosted once again by Hugh Jackman, placing a strong emphasis on African voices and global issues.\n\nThe event is part of the Global Citizen movement, which blends music and activism to fight poverty, inequality, and climate change.\n\nOne of the key initiatives this year focused on bringing energy access to one million people across Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29161553/tyla-global-citizen-festival-2025-perfomance.jpg",
            "description": "<p>IOL South African star Tyla had a powerful moment of humanity during her set at the 2025 Global Citizen Festival in New York. While performing her Grammy-winning hit “Water”, she stopped mid-song after noticing a fan who had fainted in the crowd. The 23-year-old asked production to pause as she called for staff to assist an audience</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tyla-stops-the-show-for-a-fan-and-shuts-down-critics-with-not-sorry-at-global-citizen-festival/\">Tyla stops the show for a fan and shuts down critics with ‘Not Sorry’ at Global Citizen Festival</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "29 Sep 2025"
        },
        {
            "title": "Seychelles presidential vote going to runoff, electoral commission says",
            "url": "https://www.newzimbabwe.com/seychelles-presidential-vote-going-to-runoff-electoral-commission-says/",
            "content": "By Gabriel Robert-Gironcelle I Reuters\n\nTHE Seychelles presidential election will go to a runoff between opposition leader Patrick Herminie and incumbent President Wavel Ramkalawan after no clear winner emerged in the first round of voting, the electoral commission said on Sunday.\n\nRamkalawan had been looking to block a comeback by the party that previously dominated politics for four decades in Africas wealthiest country per capita.The western Indian Ocean archipelago is a magnet for investment and security cooperation with China, Gulf nations and India.Herminie, head of the United Seychelles (US) party, secured 48.8% of the vote, while Ramkalawan, of the Linyon Demokratik Seselwa (LDS), followed closely with 46.4%, the electoral commission said.Neither candidate surpassed the 50% threshold required for an outright victory in the first round.The US party also made significant gains in the National Assembly, winning 15 constituency seats and an additional four seats through proportional representation, giving it a clear parliamentary majority.LDS won 11 constituency seats and four proportional seats, leaving the ruling party behind its main rival in the legislative chamber.In the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.Nearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nRamkalawan had been looking to block a comeback by the party that previously dominated politics for four decades in Africas wealthiest country per capita.\n\nThe western Indian Ocean archipelago is a magnet for investment and security cooperation with China, Gulf nations and India.Herminie, head of the United Seychelles (US) party, secured 48.8% of the vote, while Ramkalawan, of the Linyon Demokratik Seselwa (LDS), followed closely with 46.4%, the electoral commission said.Neither candidate surpassed the 50% threshold required for an outright victory in the first round.The US party also made significant gains in the National Assembly, winning 15 constituency seats and an additional four seats through proportional representation, giving it a clear parliamentary majority.LDS won 11 constituency seats and four proportional seats, leaving the ruling party behind its main rival in the legislative chamber.In the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.Nearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nThe western Indian Ocean archipelago is a magnet for investment and security cooperation with China, Gulf nations and India.\n\nHerminie, head of the United Seychelles (US) party, secured 48.8% of the vote, while Ramkalawan, of the Linyon Demokratik Seselwa (LDS), followed closely with 46.4%, the electoral commission said.Neither candidate surpassed the 50% threshold required for an outright victory in the first round.The US party also made significant gains in the National Assembly, winning 15 constituency seats and an additional four seats through proportional representation, giving it a clear parliamentary majority.LDS won 11 constituency seats and four proportional seats, leaving the ruling party behind its main rival in the legislative chamber.In the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.Nearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nHerminie, head of the United Seychelles (US) party, secured 48.8% of the vote, while Ramkalawan, of the Linyon Demokratik Seselwa (LDS), followed closely with 46.4%, the electoral commission said.\n\nNeither candidate surpassed the 50% threshold required for an outright victory in the first round.The US party also made significant gains in the National Assembly, winning 15 constituency seats and an additional four seats through proportional representation, giving it a clear parliamentary majority.LDS won 11 constituency seats and four proportional seats, leaving the ruling party behind its main rival in the legislative chamber.In the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.Nearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nNeither candidate surpassed the 50% threshold required for an outright victory in the first round.\n\nThe US party also made significant gains in the National Assembly, winning 15 constituency seats and an additional four seats through proportional representation, giving it a clear parliamentary majority.LDS won 11 constituency seats and four proportional seats, leaving the ruling party behind its main rival in the legislative chamber.In the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.Nearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nThe US party also made significant gains in the National Assembly, winning 15 constituency seats and an additional four seats through proportional representation, giving it a clear parliamentary majority.\n\nLDS won 11 constituency seats and four proportional seats, leaving the ruling party behind its main rival in the legislative chamber.In the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.Nearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nLDS won 11 constituency seats and four proportional seats, leaving the ruling party behind its main rival in the legislative chamber.\n\nIn the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.Nearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nIn the presidential race, the two front-runners will now face off in a decisive second round scheduled to be held from October 9 to 11. The winner will be handed a five-year mandate.\n\nNearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.Reporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\nNearly 82% of registered voters participated in the first round, which was held from Thursday to Saturday, the electoral commission said.\n\nReporting by Gabriel Robert-Gironcelle; Writing by Portia Crowe; Editing by Andrew Cawthorne\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29053933/Screenshot_20250929-055010_1.jpg",
            "description": "<p>By Gabriel Robert-Gironcelle I Reuters THE Seychelles presidential election will go to a runoff between opposition leader Patrick Herminie and incumbent President Wavel Ramkalawan after no clear winner emerged in the first round of voting, the electoral commission said on Sunday. Ramkalawan had been looking to block a comeback by the party that previously dominated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seychelles-presidential-vote-going-to-runoff-electoral-commission-says/\">Seychelles presidential vote going to runoff, electoral commission says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "29 Sep 2025"
        }
    ]
}