{
    "news": [
        {
            "title": "Warriors’ World Cup dream shattered after loss to Benin",
            "url": "https://www.newzimbabwe.com/warriors-world-cup-dream-shattered-after-loss-to-benin/",
            "content": "By Sports Reporter\n\nTHE Zimbabwe senior mens national team, the Warriors, lost 1-0 to Benin on Friday evening at the Alassane Ouattara Ebimp Olympic Stadium in Ivory Coast in a Group C Africa World Cup Qualifier match.\n\nThe Warriors had a poor outing, with nothing to write home about.Tinotenda Kadeweres 12th minute attempt in the first half was Zimbabwes only shot on target during the entire match.After playing a 0-0 first half, the match seemed to be settling for a draw, only for Benin to break the deadlock in the 80th minute through striker Steve Mounie, who struck in a free header following poor marking by Warriors defender Teenage Hadebe.Having conceded a goal, Warriors coach Michael Nees made a triple substitution in the 82nd minute when he brought in Tymon Machope, Terrence Dzvukamanja, and Bill Antonio for Emmanuel Jalai, Tawanda Maswanhise, and Tawanda Chirewa, but it was to no avail as the trio failed to make a mark.Fridays result shattered Zimbabwes thin hope of making it to next stage as they remained bottom on the log with four points after seven games, while group leaders South Africa stretched their lead to 16 points after a 3-0 win over Lesotho.Zimbabwe remains the only team yet to win in the group. They take on Rwanda on Tuesday at Orlando Stadium in South Africa.Group Log StandingsSouth Africa -16 pointsBenin  11 pointsRwanda  8 pointsNigeria  7 pointsLesotho  6 pointsZimbabwe  4 points.\n\nThe Warriors had a poor outing, with nothing to write home about.\n\nTinotenda Kadeweres 12th minute attempt in the first half was Zimbabwes only shot on target during the entire match.After playing a 0-0 first half, the match seemed to be settling for a draw, only for Benin to break the deadlock in the 80th minute through striker Steve Mounie, who struck in a free header following poor marking by Warriors defender Teenage Hadebe.Having conceded a goal, Warriors coach Michael Nees made a triple substitution in the 82nd minute when he brought in Tymon Machope, Terrence Dzvukamanja, and Bill Antonio for Emmanuel Jalai, Tawanda Maswanhise, and Tawanda Chirewa, but it was to no avail as the trio failed to make a mark.Fridays result shattered Zimbabwes thin hope of making it to next stage as they remained bottom on the log with four points after seven games, while group leaders South Africa stretched their lead to 16 points after a 3-0 win over Lesotho.Zimbabwe remains the only team yet to win in the group. They take on Rwanda on Tuesday at Orlando Stadium in South Africa.Group Log StandingsSouth Africa -16 pointsBenin  11 pointsRwanda  8 pointsNigeria  7 pointsLesotho  6 pointsZimbabwe  4 points.\n\nTinotenda Kadeweres 12th minute attempt in the first half was Zimbabwes only shot on target during the entire match.\n\nAfter playing a 0-0 first half, the match seemed to be settling for a draw, only for Benin to break the deadlock in the 80th minute through striker Steve Mounie, who struck in a free header following poor marking by Warriors defender Teenage Hadebe.Having conceded a goal, Warriors coach Michael Nees made a triple substitution in the 82nd minute when he brought in Tymon Machope, Terrence Dzvukamanja, and Bill Antonio for Emmanuel Jalai, Tawanda Maswanhise, and Tawanda Chirewa, but it was to no avail as the trio failed to make a mark.Fridays result shattered Zimbabwes thin hope of making it to next stage as they remained bottom on the log with four points after seven games, while group leaders South Africa stretched their lead to 16 points after a 3-0 win over Lesotho.Zimbabwe remains the only team yet to win in the group. They take on Rwanda on Tuesday at Orlando Stadium in South Africa.Group Log StandingsSouth Africa -16 pointsBenin  11 pointsRwanda  8 pointsNigeria  7 pointsLesotho  6 pointsZimbabwe  4 points.\n\nAfter playing a 0-0 first half, the match seemed to be settling for a draw, only for Benin to break the deadlock in the 80th minute through striker Steve Mounie, who struck in a free header following poor marking by Warriors defender Teenage Hadebe.\n\nHaving conceded a goal, Warriors coach Michael Nees made a triple substitution in the 82nd minute when he brought in Tymon Machope, Terrence Dzvukamanja, and Bill Antonio for Emmanuel Jalai, Tawanda Maswanhise, and Tawanda Chirewa, but it was to no avail as the trio failed to make a mark.Fridays result shattered Zimbabwes thin hope of making it to next stage as they remained bottom on the log with four points after seven games, while group leaders South Africa stretched their lead to 16 points after a 3-0 win over Lesotho.Zimbabwe remains the only team yet to win in the group. They take on Rwanda on Tuesday at Orlando Stadium in South Africa.Group Log StandingsSouth Africa -16 pointsBenin  11 pointsRwanda  8 pointsNigeria  7 pointsLesotho  6 pointsZimbabwe  4 points.\n\nHaving conceded a goal, Warriors coach Michael Nees made a triple substitution in the 82nd minute when he brought in Tymon Machope, Terrence Dzvukamanja, and Bill Antonio for Emmanuel Jalai, Tawanda Maswanhise, and Tawanda Chirewa, but it was to no avail as the trio failed to make a mark.\n\nFridays result shattered Zimbabwes thin hope of making it to next stage as they remained bottom on the log with four points after seven games, while group leaders South Africa stretched their lead to 16 points after a 3-0 win over Lesotho.Zimbabwe remains the only team yet to win in the group. They take on Rwanda on Tuesday at Orlando Stadium in South Africa.Group Log StandingsSouth Africa -16 pointsBenin  11 pointsRwanda  8 pointsNigeria  7 pointsLesotho  6 pointsZimbabwe  4 points.\n\nFridays result shattered Zimbabwes thin hope of making it to next stage as they remained bottom on the log with four points after seven games, while group leaders South Africa stretched their lead to 16 points after a 3-0 win over Lesotho.\n\nZimbabwe remains the only team yet to win in the group. They take on Rwanda on Tuesday at Orlando Stadium in South Africa.Group Log StandingsSouth Africa -16 pointsBenin  11 pointsRwanda  8 pointsNigeria  7 pointsLesotho  6 pointsZimbabwe  4 points.\n\nZimbabwe remains the only team yet to win in the group. They take on Rwanda on Tuesday at Orlando Stadium in South Africa.\n\nGroup Log StandingsSouth Africa -16 pointsBenin  11 pointsRwanda  8 pointsNigeria  7 pointsLesotho  6 pointsZimbabwe  4 points.\n\nGroup Log Standings\n\nSouth Africa -16 points\n\nBenin  11 points\n\nRwanda  8 points\n\nNigeria  7 points\n\nLesotho  6 points\n\nZimbabwe  4 points.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/30194141/Warriors.jpeg",
            "description": "<p>By Sports Reporter THE Zimbabwe senior men’s national team, the Warriors, lost 1-0 to Benin on Friday evening at the Alassane Ouattara Ebimpé Olympic Stadium in Ivory Coast in a Group C Africa World Cup Qualifier match. The Warriors had a poor outing, with nothing to write home about. Tinotenda Kadewere’s 12th minute attempt in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-world-cup-dream-shattered-after-loss-to-benin/\">Warriors’ World Cup dream shattered after loss to Benin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        },
        {
            "title": "Mark Zuckerberg – no, not that one – sues Facebook for account shutdowns",
            "url": "https://www.newzimbabwe.com/mark-zuckerberg-no-not-that-one-sues-facebook-for-account-shutdowns/",
            "content": "BBC\n\nA US lawyer with the same name as Facebook founder Mark Zuckerberg is suing the social media platform, arguing it keeps suspending his account while falsely accusing him of impersonating a celebrity.\n\nMark S Zuckerberg says his account has been disabled five times over the past eight years, and it has cost him thousands of dollars in lost business.\n\nThe Indiana bankruptcy attorneys lawsuit states that he has been practising law for 38 years  ever since Mark E Zuckerberg, now one of the richest men in the world, was a toddler.\n\nMeta said it had reinstated the lawyers account and was taking steps to prevent the mistake recurring.\n\nIts not funny, Mr Zuckerbergtold WTHR-TVin Indianapolis, Indiana. Not when they take my money.\n\nThe lawsuit, filed in Marion Superior Court, argues that Facebook parent company Meta is in breach of contract because he paid $11,000 (8,200) for advertising that was improperly taken down.\n\nIts like buying a billboard on the side of the highway, paying the people for the billboard and then they come and put a giant blanket over it and you dont get the benefit of what you paid for, he told WTHR.\n\nMark S Zuckerberg is an Indiana bankruptcy attorney\n\nEmails with Facebook that Mr Zuckerberg shared with local media indicate the company had accused him of not using his authentic name.\n\nHe said that he has submitted his photo ID, his credit cards, and multiple images of his face in order to prove his identity.\n\nIm Mark Steven. And hes Mark Elliot, Mr Zuckerberg told WTHR.\n\nHis account was shut down in May, and only restored after his lawsuit was filed.\n\nIn a statement, the company said it had reinstated Mark Zuckerbergs account, after finding it had been disabled in error.\n\nWe appreciate Mr Zuckerbergs continued patience on this issue and are working to try and prevent this from happening in the future.\n\nMr Zuckerberg, who specialises in bankruptcy law, starteda websiteto track mix-ups over his name, including the time he was inadvertently sued by the state of Washington for abuse.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/05060057/mark-zuckerberg.webp",
            "description": "<p>BBC A US lawyer with the same name as Facebook founder Mark Zuckerberg is suing the social media platform, arguing it keeps suspending his account while falsely accusing him of “impersonating a celebrity”. Mark S Zuckerberg says his account has been disabled five times over the past eight years, and it has cost him thousands</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mark-zuckerberg-no-not-that-one-sues-facebook-for-account-shutdowns/\">Mark Zuckerberg – no, not that one – sues Facebook for account shutdowns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        },
        {
            "title": "Ebola outbreak kills 15 in DR Congo",
            "url": "https://www.newzimbabwe.com/ebola-outbreak-kills-15-in-dr-congo/",
            "content": "BBC\n\nAt least 15 people have died in a new outbreak of the Ebola virus in the Democratic Republic of Congo, the countrys health ministry has said.\n\nThe presence of the virus had been confirmed in a 34-year-old pregnant woman who was admitted to hospital last month after showing symptoms that included a high fever and repeated vomiting, the ministry added.\n\nShe died a few hours later from multiple organ failure.\n\nThis will be the 16th outbreak of the deadly virus in the vast central African state that has poor health services, and is hit by conflict in the east.\n\nThe latest outbreak is in central Kasai province, with 28 suspected cases recorded, the ministry said.\n\nOfficials have urged strict adherence to preventive measures, including frequent handwashing and social distancing in high-risk areas.\n\nTests identified the Zaire strain of Ebola, a rare but often deadly disease, officials said.\n\nThe World Health Organization (WHO) said it was acting with determination to rapidly halt the spread of the virus and protect communities.\n\nFour health workers were among the 15 people who had died, it said.\n\nCase numbers are likely to increase as the transmission is ongoing. Response teams and local teams will work to find the people who may be infected and need to receive care, to ensure everyone is protected as quickly as possible,WHO added in a statement.\n\nDR Congo had a stockpile of treatments, including 2,000 doses of the Ervebo vaccine, effective to protect against this type of Ebola, the global health body said.\n\nThe last Ebola outbreak in DR Congo was three years ago, killing six people.\n\nAn outbreak in 2018-20 was far deadlier, claiming more than 2,000 lives.\n\nThe virus, which is thought to have originated in fruit bats, was first detected in 1976 near the Ebola River in what is now DR Congo.\n\nPeople are infected when they have direct contact through broken skin, or the mouth and nose, with the blood, vomit, faeces or bodily fluids of someone with Ebola.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/05055746/ebola.webp",
            "description": "<p>BBC At least 15 people have died in a new outbreak of the Ebola virus in the Democratic Republic of Congo, the country’s health ministry has said. The presence of the virus had been confirmed in a 34-year-old pregnant woman who was admitted to hospital last month after showing symptoms that included a high fever</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ebola-outbreak-kills-15-in-dr-congo/\">Ebola outbreak kills 15 in DR Congo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        },
        {
            "title": "US mulls curbs on Zimbabwean, Iranian, Brazilian, Sudanese delegations at UNGA",
            "url": "https://www.newzimbabwe.com/us-mulls-curbs-on-zimbabwean-iranian-brazilian-sudanese-delegations-at-unga/",
            "content": "AP\n\nThe Trump administration already hasdenied visas for Palestinian leader Mahmoud Abbasand his large delegation to attend a high-level U.N. meeting this month and is now considering ramping up restrictions on several other delegations, including Zimbabwes, that would severely limit their ability to travel outside New York City.\n\nPotential travel and other restrictions could soon be imposed on the delegations from Iran, Sudan, Zimbabwe and, perhaps surprisingly, Brazil, which has held a traditional place of honor during the high-level leaders gathering at the U.N. General Assembly that begins Sept. 22, according to an internal State Department memo seen by The Associated Press.\n\nWhile the potential restrictions are still under consideration and the circumstances could change, the proposals would be another step in the Trump administrationscrackdown on visas, including a wide-ranging review of those already holding legal permissions to come to the U.S. and those seeking entry to head to the U.N. meeting.\n\nThe movements of Iranian diplomats are severely limited in New York, but one proposal being floated would bar them from shopping at big, members-only wholesale stores like Costco and Sams Club without first receiving the express permission of the State Department.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/21195348/mnangagwa-at-unga.webp",
            "description": "<p>AP The Trump administration already has denied visas for Palestinian leader Mahmoud Abbas and his large delegation to attend a high-level U.N. meeting this month and is now considering ramping up restrictions on several other delegations, including Zimbabwe’s, that would severely limit their ability to travel outside New York City. Potential travel and other restrictions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-mulls-curbs-on-zimbabwean-iranian-brazilian-sudanese-delegations-at-unga/\">US mulls curbs on Zimbabwean, Iranian, Brazilian, Sudanese delegations at UNGA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        },
        {
            "title": "Govt sets deadline for issuance of title deeds to 384 000 resettled farmers",
            "url": "https://www.newzimbabwe.com/govt-sets-deadline-for-issuance-of-title-deeds-to-384-000-resettled-farmers/",
            "content": "By Anna Chibamu\n\nAgriculture Minister Anxious Masuka has urged resettled farmers to prepare for the issuance of title deeds, which he said will be completed by June 30, 2026.\n\nMasuka announced this during an address to the National Assembly on Wednesday, outlining the governments commitment to strengthening land tenure security under the fast-track land reform programme.\n\nAll resettled farmers with valid tenure documents undoubtedly qualify for the issuance of title deeds. This is a pivotal moment for our farmers, who have waited long for formal recognition of their land rights, Masuka said.\n\nAgriculture Minister Anxious Masuka\n\nHe revealed that around 360,000 Model A1 farmers and 24,000 Model A2 farmers stand to benefit. However, he admitted that logistical challenges remain. Of the 24,000 Model A2 farmers, only about 12,000 have surveyed units ready for processing, with the remainder requiring surveying  a major bottleneck in the process.\n\nTo address this, Masuka said government had engaged the private sector to speed up surveying using modern technology. He also announced the establishment of a one-stop centre at Makombe Complex to streamline title deed processing.\n\nThe centre operates with seven workstations, covering everything from verifying tenure documents to finalising agreements for title deeds, he explained.\n\nOn financing, Masuka said farmers would have several options, including cash purchase, credit facilities, and mortgage arrangements through local banks. To incentivise quick payments, a 15% discount will be offered for cash transactions made within 90 days.\n\nDespite these measures, Masuka acknowledged ongoing challenges, particularly with land surveys and bureaucratic delays, but pledged that government remains committed to ensuring all qualifying farmers receive their title deeds within the set timeframe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/16155649/farm.jpg",
            "description": "<p>By Anna Chibamu Agriculture Minister Anxious Masuka has urged resettled farmers to prepare for the issuance of title deeds, which he said will be completed by June 30, 2026. Masuka announced this during an address to the National Assembly on Wednesday, outlining the government’s commitment to strengthening land tenure security under the fast-track land reform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-sets-deadline-for-issuance-of-title-deeds-to-384-000-resettled-farmers/\">Govt sets deadline for issuance of title deeds to 384 000 resettled farmers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        },
        {
            "title": "Minister professes ignorance on surge in gun crimes",
            "url": "https://www.newzimbabwe.com/minister-professes-ignorance-on-surge-in-gun-crimes/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT has professed ignorance over recent cases of gun killings in the country, which appear to be targeting influential people and businessmen.\n\nDuring a sitting in the National Assembly, the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, was taken to task by the Citizens Coalition for Change (CCC) Member of Parliament, Johnson Matambo, on the spike in gun killings and the action being taken by the government to end the murders.\n\nIn response, Ziyambi said he was not aware of the murders.\n\nI want to say that the prevalence of killings is something that I am hearing from this august House. What I request is that the Hon. Member should bring the paperwork which talks about the prevalence of homicide cases.\n\nIf we respond to such a question without evidence that this is happening, this is an issue which does not augur well, said Ziyambi.\n\nIn recent months, the country has been witnessing murder cases related to gun violence. They have been attributed to the proliferation and ownership of guns by individuals.\n\nIn May this year, the Zimbabwe Republic Police raised concern about the increase in illegal firearms, which is in contravention of the Firearms Act Chapter 10.09.\n\nZiyambi further said the government does not tolerate homicide cases.\n\nGovernment does not want to see homicide cases happening because it is a criminal offence. It is one offence which had a capital punishment life in jail. In the past, it used a death sentence which was given to an offender.\n\nSo, when we look at the issues to do with homicide, you would find that when criminals hear that there are punitive penalties that have been given to perpetrators of homicide, then this would discourage others.\n\nI want to urge the Hon. Member to put in writing his question so that we get clarity and that we also clarify, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Darlington Gatsi GOVERNMENT has professed ignorance over recent cases of gun killings in the country, which appear to be targeting influential people and businessmen. During a sitting in the National Assembly, the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, was taken to task by the Citizens Coalition for Change (CCC) Member of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-professes-ignorance-on-surge-in-gun-crimes/\">Minister professes ignorance on surge in gun crimes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        },
        {
            "title": "Warriors Coach braces for tough World Cup Qualifier against Benin",
            "url": "https://www.newzimbabwe.com/warriors-coach-braces-for-tough-world-cup-qualifier-against-benin/",
            "content": "By Sports Reporter\n\nWarriors coach Michael Nees says Benin will be a tough opponent in their Group C Africa World Cup Qualifier, Friday evening at the Alassane Ouattara Ebimp Olympic Stadium in Ivory Coast.\n\nNees made the remarks while addressing a pre-match press conference.\n\nZimbabwe is yet to register a win in the ongoing World Cup Qualifiers, having recorded four draws and two defeats in six matches. The Warriors sit bottom of Group C with four points, nine behind leaders South Africa, who have 13.\n\nA victory against Benin would keep Zimbabwes hopes of progressing to the next round faintly alive, depending on the results of other teams.\n\nSpeaking about the challenge ahead, Nees said:\n\nThey will take this match very seriously. Benin is a very stubborn and disciplined team, and they usually dont concede. So its going to be a very tough encounter for us, but we have to grind out a positive result.\n\nThe Warriors will be without vice-captain Marshall Munetsi for the Benin clash. However, the Wolverhampton midfielder is expected to return to action on Tuesday when Zimbabwe faces Rwanda at Orlando Stadium in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sports Reporter Warriors coach Michael Nees says Benin will be a tough opponent in their Group C Africa World Cup Qualifier, Friday evening at the Alassane Ouattara Ebimpé Olympic Stadium in Ivory Coast. Nees made the remarks while addressing a pre-match press conference. Zimbabwe is yet to register a win in the ongoing World</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-coach-braces-for-tough-world-cup-qualifier-against-benin/\">Warriors Coach braces for tough World Cup Qualifier against Benin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        },
        {
            "title": "Zimbabwean brothers remanded in jail after deadly fight over a Limpopo woman",
            "url": "https://www.newzimbabwe.com/zimbabwean-brothers-remanded-in-jail-after-deadly-fight-over-a-limpopo-woman/",
            "content": "IOL\n\nTwo Zimbabwean brothers accused ofhacking a man to death with an axe and severely injuring a woman in a Limpopo villagehave appeared in court and were remanded in custody.\n\nThe brothers,Johannes Makhura, 20, and his elder brother, Jonas Makhura,55, were arrested after a bloody altercation in Wegdraai Village, Maleboho, reportedly sparked by a fight over a woman.\n\nProvincial police spokesperson Colonel Malesela Ledwaba confirmed the charges facing the pair.\n\nThe younger brother, Johannes Makhura, has been charged with murder, defeating the ends of justice, and contravening the Immigration Act, said Ledwaba. His elder brother, Jonas Makhura, is facing charges of murder, attempted murder, and contravening the Immigration Act.\n\nThe younger sibling was arrested shortly after the attack, and police recovered the axe allegedly used in the crime. The elder brother was later tracked down in the Alldays policing area, allegedly attempting to flee the country.\n\nHe was found hiding inside a truck headed towards Zimbabwe and carrying a bag of clothes in an attempt to escape, Ledwaba said.\n\nBoth suspects appeared before the Senwabarwana Magistrates Court on Wednesday. They were remanded in custody until 15 September 2025, when the matter will be heard at the Maleboho Periodical Court.\n\nMeanwhile,Limpopos provincial police commissioner, Lieutenant General Thembi Hadebe,welcomed the swift arrest of the brothers and applauded community members for helping police track down the alleged killers.\n\nThis was a brutal act of violence. We call upon communities to continue working closely with the police. We will not tolerate such despicable behaviour, and no one is above the law, said Hadebe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/04162742/Johannes-makura.png",
            "description": "<p>IOL Two Zimbabwean brothers accused of hacking a man to death with an axe and severely injuring a woman in a Limpopo village have appeared in court and were remanded in custody. The brothers, Johannes Makhura, 20, and his elder brother, Jonas Makhura, 55, were arrested after a bloody altercation in Wegdraai Village, Maleboho, reportedly sparked by a fight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-brothers-remanded-in-jail-after-deadly-fight-over-a-limpopo-woman/\">Zimbabwean brothers remanded in jail after deadly fight over a Limpopo woman</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "05 Sep 2025"
        }
    ]
}