{
    "news": [
        {
            "title": "WATCH: Mawarire says Mnangagwa now part of the criminals that were said to be surrounding him – claims ZACC is investigating Tagwirei, Guvamatanga",
            "url": "https://www.newzimbabwe.com/watch-mawarire-says-mnangagwa-now-part-of-the-criminals-that-were-said-to-be-surrounding-him-claims-zacc-is-investigating-tagwirei-guvamatanga/",
            "content": "By Staff Reporter\n\nLATE President Robert Mugabes former spokesperson Jealousy Mawarire has labelled President Emmerson Mnangagwa a criminal who is allowing his family and business associates to assume executive power so as to facilitate looting and gross corruption in the country.\n\nSpeaking to SABC News, Mawarire described businessmen such as Kudakwashe Tagwirei, George Guvamatanga, Simbarashe Chinyemba, Varaidzo Zifudzi and John Mangudya as surrogates who were now making decisions on Mnangagwas behalf.\n\nHe went on to claim that the Zimbabwe Anti-Corruption Commission (ZACC) was investigating the five individuals for their part in the partial sale of Kuvimba Mining House.\n\nAsked about Zimbabwes political situation in the context of recent stay-aways called for by outspoken war veteran Blessed Geza, Mawarire said Zimbabweans were agitated.\n\nThe people are generally agitated because there is a lot of looting, a lot of corruption going around and this corruption has become so pervasive it affects everyone, said Mawarire.\n\nIt is to an extent that victims of road traffic accidents do not have basic things like plasters and bandages. Our hospitals are using cardboard boxes and cello tapes as bandages.\n\nIt is that dire. We have a situation where almost everything is not functional and this is purely because of the corruption happening around the President.\n\nMawarire told SABC News that Mnangagwas close associates were taking advantage of him and siphoning as much from the state as possible.\n\nGeza made startling allegations that Mnangagwa had been diagnosed with vascular dementia, and now easily forgot decisions he would have made.\n\nThose people around him, including his family, his wife, children and business associates, have taken advantage of his mental condition to get into corrupt deals using his name and signature, to some extent moving military personnel from one department to the other and firing ministers in his stead.\n\nWhat we have now is that executive powers are now being exercised by surrogates. We have surrogate presidents making surrogate presidential and executive decisions.\n\nThe criminals are no longer around the President, the President is part of the criminals, and these criminals have been wreaking havoc in the financial market, looting state-owned enterprises.\n\nThe biggest sanction in Zimbabwe is the President of the country, who has allowed rampant looting, who has allowed those around him to exercise executive powers and make executive decisions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/15180901/ED.jpg",
            "description": "<p>By Staff Reporter LATE President Robert Mugabe’s former spokesperson Jealousy Mawarire has labelled President Emmerson Mnangagwa a criminal who is allowing his family and business associates to assume executive power so as to facilitate looting and gross corruption in the country. Speaking to SABC News, Mawarire described businessmen such as Kudakwashe Tagwirei, George Guvamatanga, Simbarashe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-mawarire-says-mnangagwa-now-part-of-the-criminals-that-were-said-to-be-surrounding-him-claims-zacc-is-investigating-tagwirei-guvamatanga/\">WATCH: Mawarire says Mnangagwa now part of the criminals that were said to be surrounding him – claims ZACC is investigating Tagwirei, Guvamatanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "Journalist Mhlanga’s trial in false start as State requests to merge case with HSTV’s",
            "url": "https://www.newzimbabwe.com/journalist-mhlangas-trial-in-false-start-as-state-requests-to-merge-case-with-hstvs/",
            "content": "By Staff Reporter\n\nThe trial in which Alpha Media Holdings (AMH) journalist Blessed Mhlanga is accused of transmitting data messages inciting violence failed to start on Wednesday after the prosecution requested to merge his case with that of his employer.\n\nMhlanga is facing the same charges with his employer Heart & Soul TV (HSTV) under Section 164 of the Criminal Law (Codification and Reform) Act, but were arrested separately.\n\nThe journalist was arrested in February this while HSTV was only charged a week ago.\n\nOn Wednesday, prosecutor Anesu Chirenje made an application for the records to be merged, adding that evidence in both cases warranted a joint trial.\n\nThe application was challenged by both Mhlangas lawyer, Chris Mhike and HSTV lawyer Beatrice Mtetwa.\n\nThe defence said joining the two at this stage was prejudicial to their trial.\n\nMhike said it was illogical for the State to make this suggestion now when it initially refused to charge HSTV.\n\nThe State initially refused to charge HSTV in our pursuit of bail.\n\nNow, on the date the trial was supposed to begin, it wants to merge the cases. If the State cannot proceed today, then my client should be removed from remand as previously promised, Mhike said.\n\nMtetwa supported Mhikes position and insisted Mhlangas trial should move forward as scheduled.\n\nMtetwa said from the onset, Mhlanga indicated that he is not HSTV.\n\nSo why are they bringing up HSTV now. Do they want to defeat his defence?\n\nOur position is that there is no legal provision forcing two parties to be jointly tried if they do not consent, she submitted.\n\nMhlanga is ready to be tried today, while HSTV is appearing for routine remand. Forcing a marriage between the two cases would prejudice our clients, she said.\n\nHe said the State had previously refused to charge HSTV when the defence requested it during Mhlangas bail application.\n\nShe added that HSTV was pursuing a constitutional challenge and seeking direct access to the Constitutional Court, further complicating the proposed consolidation.\n\nHarare magistrate Learnmore Mapiye is expected to hand down her ruling on the application on Thursday.\n\nMhlanga was granted US$500 bail by High Court Judge Justice Gibson Mandaza on his third freedom bid.\n\nHe had spent 72 days in jail.\n\nThe journalist landed in the dock after HSTV published a press conference by Zanu PF war veteran Blessed Geza, who is calling for President Emmerson Mnangagwas resignation. Geza is currently in hiding.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26061950/Blessed-Mhlanga.png",
            "description": "<p>By Staff Reporter The trial in which Alpha Media Holdings (AMH) journalist Blessed Mhlanga is accused of transmitting data messages inciting violence failed to start on Wednesday after the prosecution requested to merge his case with that of his employer. Mhlanga is facing the same charges with his employer Heart & Soul TV (HSTV) under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-mhlangas-trial-in-false-start-as-state-requests-to-merge-case-with-hstvs/\">Journalist Mhlanga’s trial in false start as State requests to merge case with HSTV’s</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "Five killed, 18 injured in road traffic accident",
            "url": "https://www.newzimbabwe.com/five-killed-18-injured-in-road-traffic-accident/",
            "content": "By James Muonwa\n\nFIVE people perished while 18 others were injured after the driver of a truck they were aboard failed to negotiate a steep descent along the Mvurwi-Kanyemba road.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy, which occurred Monday evening.\n\nThe ZRP confirms a fatal road traffic accident in which five people were killed while 18 others were injured at the 101 kilometre peg along Mvurwi-Kanyemba Road, Mahuwe on May 12, 2025 at around 1700 hours, said Nyathi.\n\nHe said a Hino Dutro truck with 35 passengers on board veered off the road and overturned before landing on its wheels.\n\nThe accident occurred while the truck was descending a steep slope and approaching a sharp curve, he added.\n\nMeanwhile, in another fatal road traffic accident which occurred in Mazowe, four people were killed while eight others were injured when a Nissan NV350 kombi veered off the road and overturned before landing on its roof at the 52 kilometre peg along Harare-Mukumbura Road this Tuesday at around mid-morning.\n\nThe bodies of the victims were taken to the Concession Hospital mortuary for post-mortem, while the injured were admitted at the same hospital.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By James Muonwa FIVE people perished while 18 others were injured after the driver of a truck they were aboard failed to negotiate a steep descent along the Mvurwi-Kanyemba road. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy, which occurred Monday evening. “The ZRP confirms a fatal road traffic accident in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/five-killed-18-injured-in-road-traffic-accident/\">Five killed, 18 injured in road traffic accident </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "One-year-old baby dies after falling into 9 metres deep open well",
            "url": "https://www.newzimbabwe.com/one-year-old-baby-dies-after-falling-into-9-metres-deep-open-well/",
            "content": "By Staff Reporter\n\nA one-year-old baby died in Komboniyatsva, Epworth, after falling into a nine metres deep open well on Monday.\n\nThe toddler had been playing outside while the mother was doing chores inside the house.\n\nThe ZRP reports a sad incident in which a toddler (one year, three months) died after falling into an open well about nine metres deep at Komboniyatsva, Epworth, Harare on 12/05/25.\n\nThe incident occurred while the mother of the victim was doing household chores in the house and the victim was playing with other children outside, reads a statement released by the police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/14115950/zimbabwe-clean-water-3-open-well-690-rev.jpg",
            "description": "<p>By Staff Reporter A one-year-old baby died in Komboniyatsva, Epworth, after falling into a nine metres deep open well on Monday. The toddler had been playing outside while the mother was doing chores inside the house. “The ZRP reports a sad incident in which a toddler (one year, three months) died after falling into an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-year-old-baby-dies-after-falling-into-9-metres-deep-open-well/\">One-year-old baby dies after falling into 9 metres deep open well </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "Tigere hails RBZ’s tight grip on inflation",
            "url": "https://www.newzimbabwe.com/tigere-hails-rbzs-tight-grip-on-inflation/",
            "content": "By Alois Vinga\n\nLISTED Real Estate Investment Trust (REIT), TIGERE, has commended the Reserve Bank of Zimbabwe (RBZ) for implementing inflation-easing policies to enable value preservation in the property sector.\n\nThe countrys first listed REIT portfolio comprises retail properties in strategic locations with a diversified tenant mix. The initial portfolio includes two properties, namely Highland Park (Harare), Pick n Pay & Chinamano Corner (Harare), anchored by Puma Energy and Simbisa Brands, which has a total gross lettable area (GLA) of 8,435 m2 (meters squared).\n\nPresenting a trading update for the quarter ended March 31 2025, TIGERE hailed the unwavering support extended by the central bank.\n\nThe first quarter of 2025 was characterised by notable currency stability, and this was anchored by an unwavering commitment by the Reserve Bank Governor to keep inflation in check. This stability was exemplified by a paltry 3.6% depreciation in the local currency unit, Zimbabwe Gold (ZWG), during the period under review (vs 256% in Q1 of 2024).\n\nWe conjecture that the recent policy pronouncements in SI 34 of 2025 will cushion formal retailers during the remainder of the year, attributable to improved price competitiveness and a gradual liberalisation of the exchange rate, the company said.\n\nThe company said the property market remains the favoured option for investors looking to shield their investments from currency shocks, and foresees a continued bias towards this asset class by individuals, corporates, and pension funds, who are keen on providing a tangible exit option for their members.\n\nWe opine that concerns of widespread price overheating within the sector are overstated, with pervasive supply-side gaps noted in key sub-segments such as warehousing, affordable housing, quality retail infrastructure and office space, said Tigere.\n\nDuring the period, the company maintained a 100% occupancy across its existing portfolio, which includes Highland Park Phase 1, Chinamano Corner, and the recently added Highland Park Phase 2 asset.\n\nThe REIT aims to add two new assets in Q3 of this financial year, as part of its pre-emptive right to acquire completed assets developed by the REIT Sponsor. Details of the Proposed Transaction will be made available in due course.\n\nThe Net Asset value of US$34,2 million was maintained during the period with a Net Property Income of US$535 632 up from US$ 376,404. Total comprehensive income of US$451,249 up from US$257,670.\n\nIn line with our ongoing commitment to pay quarterly distributions, the REIT is proud to declare its 10 consecutive dividend. The declared value for dividend 10 being USD 507,250 (USD 0,0474 cents per unit) in respect of the quarter ended 31 March 2025, added Tigere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/08061347/Tigere-REIT.jpeg",
            "description": "<p>By Alois Vinga LISTED Real Estate Investment Trust (REIT), TIGERE, has commended the  Reserve Bank of Zimbabwe (RBZ) for implementing inflation-easing policies to enable value preservation in the property sector. The country’s first listed REIT portfolio comprises retail properties in strategic locations with a diversified tenant mix. The initial portfolio includes two properties, namely Highland</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-hails-rbzs-tight-grip-on-inflation/\">Tigere hails RBZ’s tight grip on inflation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "Artisanal miner killed in fight over sadza",
            "url": "https://www.newzimbabwe.com/artisanal-miner-killed-in-fight-over-sadza/",
            "content": "By Staff Reporter\n\nAn artisanal miner has been arrested in Shurugwi for murder after allegedly stabbing a colleague during a dispute over the sharing of sadza.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Shurugwi arrested an artisanal miner, Nicholas Matanda (19) in connection with a case of murder in which another artisanal miner, Tanaka Sithole (26) died on May 11, 2025, after being stabbed with a knife in the armpit following an argument over sharing of sadza on May 9, 2025 at Dollar Farm, Flamingo Turn-off, said Nyathi.\n\nIn a separate case, police in Zezani acted on received information and arrested Quinton Sibanda (18) and Kamuelo Moyo (20) in connection with a case of murder, which occurred at a bush near Dombolidenje Village.\n\nThe suspects allegedly attacked the victim, Marvellous Tlou (21), before stealing her cellphone. They then allegedly took turns to sexually abuse the victim before strangling her and stabbing her with an okapi knife all over the body.\n\nSubsequently, they hid the body in the bush. The arrest led to the recovery of the stolen cellphone and the okapi knife.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/14060137/sadza-e1747198921194.webp",
            "description": "<p>By Staff Reporter An artisanal miner has been arrested in Shurugwi for murder after allegedly stabbing a colleague during a dispute over the sharing of sadza. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in Shurugwi arrested an artisanal miner, Nicholas Matanda (19) in connection with a case of murder</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/artisanal-miner-killed-in-fight-over-sadza/\">Artisanal miner killed in fight over sadza</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "A gross constitutional violation – Biti condemns arrest of UZ students",
            "url": "https://www.newzimbabwe.com/a-gross-constitutional-violation-biti-condemns-arrest-of-uz-students/",
            "content": "By Staff Reporter\n\nFORMER cabinet minister and lawyer Tendai Biti has strongly condemned the arrest of six University of Zimbabwe (UZ) students who were detained Monday during a flash protest in support of their striking lecturers, describing it as a gross abuse of the constitution.\n\nThe students staged a demonstration demandingan urgent resolution to the grievances of their lecturers, who have been on strike for over a month. The lecturers are demanding a salary increase and improved working conditions.\n\nThe students were also calling onUZ authorities to postpone end-of-semester examinations, citing the ongoing industrial action, which has disrupted learning.\n\nSix students were then apprehended by campus and state security officers, who later handed them over to the Avondale Police Station.\n\nThe arrest of several students at the University of Zimbabwe in peaceful solidarity with their underpaid lecturers is a gross abuse of the Constitution.\n\nThis regime has no care nor respect for constitutionalism and the rule of law. It is a pariah tin-pot republic without shame or honour, Biti wrote on his official X account.\n\nTendai Biti\n\nThe six students were released after being charged with disorderly conduct and have vowed to challenge the charges in court, describing them as baseless.\n\nThey took us to the police station, where we were released after being charged with disorderly conduct.\n\nWe are going to challenge these baseless charges in the courts of law. The reason for our arrest is that we were demanding access to quality education from the UZ administration, which collected full tuition fees from students yet cannot provide learning services in return, read a statement from the Zimbabwe National Students Union (ZINASU).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181226/Zinasu-3.png",
            "description": "<p>By Staff Reporter FORMER cabinet minister and lawyer Tendai Biti has strongly condemned the arrest of six University of Zimbabwe (UZ) students who were detained Monday during a flash protest in support of their striking lecturers, describing it as a gross abuse of the constitution. The students staged a demonstration demanding an urgent resolution to the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-gross-constitutional-violation-biti-condemns-arrest-of-uz-students/\">A gross constitutional violation – Biti condemns arrest of UZ students</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "Police appeal for help in locating relatives of 20 Zimbabweans killed in South Africa’s Operation Vala Umgodi",
            "url": "https://www.newzimbabwe.com/police-appeal-for-help-in-locating-relatives-of-20-zimbabweans-killed-in-south-africas-operation-vala-umgodi/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Republic Police (ZRP) is appealing for help inlocatingthe relatives of 20Zimbabweans who died during the Operation Vala Umgodi in South Africa.\n\nThebodiesof the victimsremain unclaimed and await repatriation.\n\nIn August last year, the South African government, through Operation Vala Umgodi, cut off food or water supplies for illegal miners at Stilfontein Mine to force them to resurface so that they could be arrested.\n\nWhen some resurfaced, others remained underground, and many eventually died.\n\nAccording to police, the deceased are: Bothwell Mlambo, Bobo Sithole, Gladman Mlambo, Blessing Mlambo, Shepherd, Kenisa Majoni, Benard Mamombe, Trust Makitisa, Jairosi Pasa, Moses Chidumba, Thomas Chipanza, Jack Mlambo Maeza, Edzai Mlambo Maeza, Make Mlambo, Pindirai Dumbarimwe, Tendai Mubaiba, Mebishengs Mutubuki, Tinashe Shangure, Tafadzwa Ndlovu and Justice Mwapinda.\n\nIn a statement Tuesday, ZRP spokesperson Commissioner Paul Nyathi confirmed it had received a formal request from South African authorities through the Ministry of Foreign Affairs and International Trade to help in the identification and repatriation of the deceased.\n\nZRPhas received a request through theMinistry of Foreign Affairs and International Trade from authorities in SouthAfrica to assist in the location and identification of relatives ofZimbabweans who sadly perished in a mine duringOperation ValaUmgodi recently.\n\nThe bodies are yet to be claimed bythe next of kin.\n\nThe cooperation of relatives will assist in the identification of the victims and repatriation of the bodies for burial in Zimbabwe, Nyathi said.\n\nPolice appealed to relatives and friends of the victims to report to any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Republic Police (ZRP) is appealing for help in locating the relatives of 20 Zimbabweans who died during the “Operation Vala Umgodi” in South Africa. The bodies of the victims remain unclaimed and await repatriation. In August last year, the South African government, through  “Operation Vala Umgodi”, cut off food or water supplies for illegal miners at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-appeal-for-help-in-locating-relatives-of-20-zimbabweans-killed-in-south-africas-operation-vala-umgodi/\">Police appeal for help in locating relatives of 20 Zimbabweans killed in South Africa’s Operation Vala Umgodi</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "Harare Municipal Medical Aid Society loses US$138K claim against ex-convict Kereke",
            "url": "https://www.newzimbabwe.com/harare-municipal-medical-aid-society-loses-us138k-claim-against-ex-convict-kereke/",
            "content": "By Mary Taruvinga\n\nThe Harare Municipal MedicalAidSociety (HMMAS) has lost a case in which it was claiming a refund of US$138,000 from former Zanu PF legislator Munyaradzi Kereke following a failed purchase of his Fortress Hospital in Ruwa.\n\nHigh Court judge Justice Jacob Mafusire dismissed the application by HMMAS, describing the demand as opportunistic.\n\nThe plaintiff has failed to prove any aspect of its case.\n\nThe first defendant destroyed the plaintiffs case completely. The plaintiff has no case. This suit is manifestly opportunistic. The defendants are entitled to judgment, he said before throwing out the claim.\n\nHMMAS had sued Kereke and Briward Trading (PVT) seeking a refund in the sum of US$138,000 plus interest.\n\nThe plaintiff also sought anorder confirming the cancellation of anagreement of sale between itself andKereke.\n\nIt also wanted the court to declare that itpaid the full purchase price forthemedical institution,Fortress Hospital.\n\nHMMAS had claimed that in November 2014, it purchased Fortress Hospital from the defendants via two agreements.\n\nIt said one was for the immovable property, Stand 9653 Ruwa Township, upon which the hospital is built.\n\nThe other, on the same day, granted the plaintiff the right of first refusal for the movables and other assets associated with the hospital.\n\nThe defendants (Kereke and Briward Trading) were represented by their agent, Newton Madzika\n\nThe plaintiff was represented by its former Chief Executive Officer, Evaristo Rukasha.\n\nThe purchase price for the immovable property was US$800,000. The purchase price for the equipment and fittings was US$650,000.\n\nHMMAS said itduly paid the purchase prices.\n\nThe US$800,000 was paid in two tranches, US$700,000 through a bank then known as Kingdom/Afrasia, now defunct, and the balance through a firm of legal practitioners, Muza & Nyapadi, the conveyancers appointed to transfer title in the immovable property, reads court papers.\n\nThe US$650,000 for the assets was subsequently paid through Madzika.\n\nIt was alleged that on 21 March 2022, Kereke connived with Rukasha, who, in an act of abuse of office, signed an acknowledgement of debt on behalf of the plaintiff for US$400,000 in favour of the defendants, allegedly as outstanding amounts for Fortress Hospital.\n\nRukasha, it was alleged, caused some payments to be made in terms of the acknowledgement of debt.\n\nThe payments were irregular because the plaintiff had fully paid for the hospital.\n\nFollowing disciplinary proceedings, Rukasha was dismissed from employment.\n\nRelying on the acknowledgement of debt aforesaid, the first defendant, through threats, fraudulent misrepresentations and intimidation, coerced or manipulated the plaintiff into signing an agreement on 31 August 2023.\n\nAccording to the 31 August 2023 agreement, the purchase price was US$1,138,900, of which US$866,900 was acknowledged to have been paid, leaving a balance of US$272,000 outstanding.\n\nHMMAS said it had since paid US$138,000 in various instalments before its newly reconstituted Board, led by one Zacharia Murerwa, considered that the 31 August 2023 agreement was unlawful and unenforceable by reason of the fact that it had been induced by fraud or duress\n\nThus, initssuit the plaintiffsoughtconfirmation that it bought and paid for Fortress Hospital long back in 2014, that it is entitled to get transfer of the immovable property and all the assets associated with the hospital, and that the payment of US$138,000 aforesaid that it had made to the defendants allegedly under an unlawful agreement, should be refunded.\n\nKereke challenged the claim.\n\nHe said it took more than 8  years for the defendants to finally have access to the deposit of US$700,000 aforesaid.\n\nHe also said the defendants have never received the balance of US$100,000.\n\nHe said on the plaintiffs instructions, Muza andNyapadi diverted the plaintiffs payment for something else.\n\nKereke also said the amount of $650,000 allegedly paid by the plaintiff through Madzika, or his trusts, allegedly towards the assets for Fortress Hospital, was never received by the defendants.\n\nKereke said the pleadings are inelegant.\n\nHe also said it has been quite a mission to stitch together a coherent narrative from the divergent versions of the facts as presented by the parties.\n\nThe High Court found no favour with the plaintiff, ruling that Kereke had managed to defend himself well.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/19153647/Munyaradzi-Kereke-1.jpg",
            "description": "<p>By Mary Taruvinga The Harare Municipal Medical Aid Society (HMMAS) has lost a case in which it was claiming a refund of US$138,000 from former Zanu PF legislator Munyaradzi Kereke following a failed purchase of his Fortress Hospital in Ruwa. High Court judge Justice Jacob Mafusire dismissed the application by HMMAS, describing the demand as opportunistic. “The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-municipal-medical-aid-society-loses-us138k-claim-against-ex-convict-kereke/\">Harare Municipal Medical Aid Society loses US$138K claim against ex-convict Kereke</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        },
        {
            "title": "Teachers accuse govt of neglect as schools turn away pupils over unpaid fees",
            "url": "https://www.newzimbabwe.com/teachers-accuse-govt-of-neglect-as-schools-turn-away-pupils-over-unpaid-fees/",
            "content": "By Staff Reporter\n\nDespite President Emmerson Mnangagwas repeated promises to provide free basic education, dozens of pupils were turned away from government schools for failing to pay fees as the second term kicked off.\n\nThe Information Ministry Permanent Secretary, Nick Mangwana, on Tuesday reported that some schools in Chegutu were going against government policy and sending pupils home over unpaid fees.\n\nContrary to Govt policy, some schools in Chegutu are sending students home over non-payment of fees. Some parents struggle with recent fee hikes and added expenses for winter uniforms. Govt directive is clear: no child should be sent home due to fee non-payment, Mangwana wrote.\n\nMangwana added that while the government recognises that the fees contract is between the school and the parent, schools should not exploit this position.\n\nSchools cannot use a childs future to extort money out of a parent, much to the detriment of the learner. Schools have other means of debt recovery at their disposal, the same way as any other creditor, he said.\n\nThe issue was not only confined to Chegutu, as the same was noted in some government schools nationwide.\n\nIn an interview with NewZimbabwe.com, Obert Msaraure, President of the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) said that the government was failing the education system.As we predicted, our schools are once again opening to chaos. Chaos born out of policy inconsistencies, neglect of education, corruption and incompetence. It is strange for the government to be complaining about learners being sent back home for failing to pay fees, Masaraure said.\n\nMasaraure reminded the government of its constitutional duties, adding that even Zanu PFs previous election manifestos were predicated on free education for learners.Government is responsible for providing state-funded education in line with s75 of the constitution and our more elaborate Education Act. The election manifesto of the ruling ZANU PF party for two thousand and twenty-three spoke to state-funded education.\n\nGovernment should be releasing education grants to all learners across the country on an equity basis. Issuing instructions to heads not to send back learners is cynical, cruel and hypocritical. Public schools do not operate in the air. Just like the elite schools where ministers children get elite education, our public schools need teaching and learning materials.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13190041/Back-to-school-6-scaled.jpg",
            "description": "<p>By Staff Reporter Despite President Emmerson Mnangagwa’s repeated promises to provide free basic education, dozens of pupils were turned away from government schools for failing to pay fees as the second term kicked off. The Information Ministry Permanent Secretary, Nick Mangwana, on Tuesday reported that some schools in Chegutu were going against government policy and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teachers-accuse-govt-of-neglect-as-schools-turn-away-pupils-over-unpaid-fees/\">Teachers accuse govt of neglect as schools turn away pupils over unpaid fees   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "14 May 2025"
        }
    ]
}