{
    "news": [
        {
            "title": "Zimbabwe among 43 countries on Trump’s draft list for new U.S travel ban",
            "url": "https://www.newzimbabwe.com/zimbabwe-among-43-countries-on-trumps-draft-list-for-new-u-s-travel-ban/",
            "content": "By The New York Times\n\nA DRAFT circulating inside the administration lists three tiers of countries whose citizens may face restrictions on entering the United States.\n\nThe most stringent restriction level would flatly bar citizens from 11 countries from entering the United States.\n\nThe Trump administration is considering targeting the citizens of as many as 43 countries as part of a new ban on travel to the United States that would be broader than the restrictions imposed during President Trumps first term, according to officials familiar with the matter.\n\nA draft list of recommendations developed by diplomatic and security officials suggests a red list of 11 countries whose citizens would be flatly barred from entering the United States. They are Afghanistan, Bhutan, Cuba, Iran, Libya, North Korea, Somalia, Sudan, Syria, Venezuela and Yemen, the officials said.\n\nDraft List of Proposed Travel Ban Countries\n\nAn internal Trump administration proposal lists the following countries whose citizens could face restrictions on entering the U.S. Some countries may change in any final order.\n\nRed\n\nAll travel banned\n\nOrange\n\nVisas sharply restricted\n\nYellow\n\n60 days to address concerns\n\nThe officials, who spoke on the condition of anonymity to discuss the sensitive internal deliberations, cautioned that the list had been developed by the State Department several weeks ago, and that changes were likely by the time it reached the White House.\n\nOfficials at embassies and in regional bureaus at the State Department, and security specialists at other departments and intelligence agencies, have been reviewing the draft. They are providing comment about whether descriptions of deficiencies in particular countries are accurate or whether there are policy reasons  like not risking disruption to cooperation on some other priority  to reconsider including some.\n\nThe draft proposal also included an orange list of 10 countries for which travel would be restricted but not cut off. In those cases, affluent business travelers might be allowed to enter, but not people traveling on immigrant or tourist visas.\n\nCitizens on that list would also be subjected to mandatory in-person interviews in order to receive a visa. It included Belarus, Eritrea, Haiti, Laos, Myanmar, Pakistan, Russia, Sierra Leone, South Sudan and Turkmenistan.\n\nWhen he took office on Jan. 20, Mr. Trump issued an executive order requiring the State Department to identify countries for which vetting and screening information is so deficient as to warrant a partial or full suspension on the admission of nationals from those countries.\n\nHe gave the department 60 days to finish a report for the White House with that list, meaning it is due next week. The State Departments Bureau of Consular Affairs has taken the lead, and the order said the Justice and Homeland Security Departments and the Office of the Director of National Intelligence were to assist with the effort.\n\nSpokespeople at several agencies declined to comment or did not respond to a request for comment. But the State Department previously said it was following Mr. Trumps order and was committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, while declining to specifically discuss internal deliberations.\n\nThe Times and other news outlets reported this month that Afghanistan, which was not part of Mr. Trumps first-term travel bans but fell to the Taliban when the U.S. withdrew its forces in 2021, was likely to be part of the second-term ban. But the other countries under consideration had been unclear.\n\nIt is also not clear whether people with existing visas would be exempted from the ban, or if their visas would be canceled. Nor is it clear whether the administration intends to exempt existing green card holders, who are already approved for lawful permanent residency.\n\nThe Trump administration this past week said it had canceled the green card of a Syrian-born former Columbia University graduate student of Palestinian descent, Mahmoud Khalil, because he had led high-profile campus protests against Israels war in Gaza that the government says were antisemitic, setting off a court fight over the legality of that move.\n\nSome of the countries on the draft red and orange lists were sanctioned by Mr. Trump in his first-term travel bans, but many are new. Some share characteristics with the earlier lists  they are generally Muslim-majority or otherwise nonwhite, poor and have governments that are considered weak or corrupt.\n\nBut the reason several others were included was not immediately clear. Bhutan, for example, was proposed for an absolute ban on entry. The small Buddhist and Hindu country is sandwiched between China and India, neither of which were on any of the draft lists.\n\nThe proposal to sharply restrict, if not outright ban, visitors from Russia raises a different issue. While the Russian government has a reputation for corruption, Mr. Trump has been trying to reorient U.S. foreign policy in a more Russia-friendly direction.\n\nA decision to include Venezuela could also disrupt a nascent thaw in relations that has been useful to Mr. Trumps separate efforts to deport undocumented migrants.\n\nThe proposal also includes a draft yellow list of 22 countries that would be given 60 days to clear up perceived deficiencies, with the threat of being moved onto one of the other lists if they did not comply.\n\nSuch issues could include failing to share with the United States information about incoming travelers, purportedly inadequate security practices for issuing passports, or the selling of citizenship to people from banned countries, which could serve as a loophole around the restrictions.\n\nThat list, the officials said, included Angola, Antigua and Barbuda, Benin, Burkina Faso, Cambodia, Cameroon, Cape Verde, Chad, the Republic of Congo, the Democratic Republic of Congo, Dominica, Equatorial Guinea, Gambia, Liberia, Malawi, Mali, Mauritania, St. Kitts and Nevis, St. Lucia, So Tom and Prncipe, Vanuatu and Zimbabwe.\n\nDuring Mr. Trumps first term, courts blocked the government from enforcing the first two versions of his travel ban, but the Supreme Court eventually permitted a rewritten ban  one that banned citizens from eight nations, six of them predominantly Muslim  to take effect. The list later evolved.\n\nSoon after he became president in January 2021, Joseph R. Biden Jr. issued a proclamation revoking Mr. Trumps travel bans, calling them a stain on our national conscience and inconsistent with our long history of welcoming people of all faiths and no faith at all.\n\nMr. Trumps executive order in January said he would revive the bans in order to protect American citizens from aliens who intend to commit terrorist attacks, threaten our national security, espouse hateful ideology or otherwise exploit the immigration laws for malevolent purposes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/10155043/Donald-Trump1.jpg",
            "description": "<p>By The New York Times A DRAFT circulating inside the administration lists three tiers of countries whose citizens may face restrictions on entering the United States. The most stringent restriction level would flatly bar citizens from 11 countries from entering the United States. The Trump administration is considering targeting the citizens of as many as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-among-43-countries-on-trumps-draft-list-for-new-u-s-travel-ban/\">Zimbabwe among 43 countries on Trump’s draft list for new U.S travel ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Motorist robbed of handbag containing US$14,100",
            "url": "https://www.newzimbabwe.com/motorist-robbed-of-handbag-containing-us14100/",
            "content": "By Staff Reporter\n\nA THREE-man robbery gang this Friday pounced on a motorist in Mvurwi, Mashonaland Central, smashed the vehicles windshield before snatching a handbag containing US$14,100.\n\nThe Zimbabwe Republic Police (ZRP) confirmed the incident, which is now underinvestigation.\n\nThe ZRP is investigating a case of robbery which occurred in Mvurwi on March 14, 2025, said ZRP national spokesperson, Commissioner Paul Nyathi.\n\nThree suspects who were travelling in a black Toyota Probox vehicle, intercepted the complainant who was travelling in a Honda Fit Hybrid vehicle along GMB Road near Mbizi location Turn-off, Mvurwi.\n\nThe suspects smashed the complainants vehicle before taking a handbag which contained US$14,100 cash, Ecocash Debit Card and Innbucks Visa card.\n\nZRP appealed to anyone with information that may lead to the arrest of the suspects to report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/26064246/US-dollars.jpg",
            "description": "<p>By Staff Reporter  A THREE-man robbery gang this Friday pounced on a motorist in Mvurwi, Mashonaland Central, smashed the vehicle’s windshield before snatching a handbag containing US$14,100. The Zimbabwe Republic Police (ZRP) confirmed the incident, which is now under investigation. “The ZRP is investigating a case of robbery which occurred in Mvurwi on March 14, 2025,”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-robbed-of-handbag-containing-us14100/\">Motorist robbed of handbag containing US$14,100</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Trio steals US$25,000, spends loot on Honda Fit, iPhones",
            "url": "https://www.newzimbabwe.com/trio-steals-us25000-spend-loot-on-honda-fit-iphones/",
            "content": "By Staff Reporter\n\nA MUTARE trio, including two 16-year-olds, has been arrested for stealing US$25,000 which they used to buy a motor vehicle and high-end smartphones.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms the arrest of Munyararadzi Madzure (39) and two juveniles (16) in connection with a case of theft which occurred in Chikanga, Mutare on March 14, 2025, Nyathi said.\n\nThe suspects allegedly stole US$25 000 cash from the complainant and used the money to buy a Honda Fit vehicle and three iPhones.\n\nThe police have since recovered the motor vehicle and cell phones.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/17163132/Honda-Fit.jpg",
            "description": "<p>By Staff Reporter  A MUTARE trio, including two 16-year-olds, has been arrested for stealing US$25,000 which they used to buy a motor vehicle and high-end smartphones. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms the arrest of Munyararadzi Madzure (39) and two juveniles (16) in connection with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trio-steals-us25000-spend-loot-on-honda-fit-iphones/\">Trio steals US$25,000, spends loot on Honda Fit, iPhones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Former deputy minister ups freedom bid as trial resumes",
            "url": "https://www.newzimbabwe.com/former-deputy-minister-ups-freedom-bid-as-trial-resumes/",
            "content": "By Staff Reporter\n\nFORMER Deputy Minister of Agriculture Douglas Karoro believes his political rivals fabricated allegations that he illegally siphoned vegetable seeds on the guise of distributing them to the needy in his Mbire constituency.\n\nIt is alleged Karoro received 5 000 vegetable combo kits from Valley Seed Private Limited, which were to be handed over to Grain Marketing Board (GMB) Mushumbi under the Presidential Input Programme but converted the seed to his own use.\n\nAs his trial continues, Karoro has maintained his innocence saying he is a victim of name-dropping by actual thieves of the inputs.\n\nHe said his political foes were determined to have him lose his parliamentary seat in Mbire by raising false allegations.\n\nThe trial continued with a State witness Tichaona Maponga telling Regional Magistrate Taurai Manuwere that he cannot say it was Karoro who collected the combo seeds because he was not there.\n\nThe seeds were dispatched by a temporary worker unknown to him because they hire new people every season, he said.\n\nMaponga said he has no evidence to show that the deputy minister phoned him regarding the seeds.\n\nKaroros lawyer Admire Rubaya has challenged all documents being attributed to him saying they could have been doctored.\n\nThis came after the State produced a delivery note inscribed D.Karoro, which they said referred to the deputy minister.\n\nIt could have been another person being referred to adding that there are many people with such initials, Rubaya said.\n\nThe State witness, Tichaona Maponga who is in charge at the depot told the court that he cannot corroborate the allegation that Karoro collected the seed at the depot because he was not on the ground.\n\nHe said it was not conclusive to say it his him being referred to as D.Karoro after the lawyer suggested it could have been a Dhuvai or a Doto Karoro.\n\nMaponga also denied being the author of a delivery note that was produced in court stating that they hire seasonal employees who could have signed the seeds out.\n\nThe matter will continue on April 4.\n\nIt is alleged Karoro received 5 000 vegetable combo kits from Valley Seed Private Limited which were to be handed over to GMB Mushumbi under the Presidential Input Programme but converted the seed to their own use.\n\nIt is alleged that acting in connivance with one Ngowe, they ordered the GMB Mushumbi inputs clerk, Honesty Nyathi and security guard, Manyara Manuwere to fraudulently book the consignment in the goods received voucher, goods dispatch voucher, gate book and stack register to appear as if the consignment had been received and despatched to Karoro, prejudicing GMB of US$25 000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Staff Reporter FORMER Deputy Minister of Agriculture Douglas Karoro believes his political rivals fabricated allegations that he illegally siphoned vegetable seeds on the guise of distributing them to the needy in his Mbire constituency. It is alleged Karoro received 5 000 vegetable combo kits from Valley Seed Private Limited, which were to be handed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-deputy-minister-ups-freedom-bid-as-trial-resumes/\">Former deputy minister ups freedom bid as trial resumes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "ZMC Executive Secretary Phiri in court over fuel scandal",
            "url": "https://www.newzimbabwe.com/zmc-executive-secretary-phiri-in-court-over-fuel-scandal/",
            "content": "By Staff Reporter\n\nZIMBABWE Media Commission (ZMC) Executive Secretary Godwin Phiri Friday appeared in court charged with fraud after he allegedly misappropriated fuel worth millions of dollars.\n\nPhiri appeared before Harare Magistrate Marewanazvo Gofa jointly charged with other ZMC officials Tafadzwa Chikwiti an accountant, Revai Madire and administrator Mercy Hondo.\n\nThey are facing two fraud counts. The four were not asked to plead and were all remanded out of custody on US$600 bail each. They will be back in court on April 28 for routine remand.\n\nAppearing for the State, Lancelot Mutsokoti alleged that alleged that during the period extending from May 2023 to February 2024 and on diverse occasions, the accused acting in connivance with Petros Mudhokwani, still at large, hatched a plan to steal from the commission.\n\nPursuant of their plan, Mudhokwani allegedly raised requisitions for the purchase of fuel from PetroTrade, and Chikwiti uploaded the requisition on an online procurement platform, which was adopted by the commission known as the Systems Application and Products (SAP).\n\nSecretary approved the release of funds for the purchase of the coupons. Tawanda Hlomai, who is also still at large, collected 104 976 litres of fuel from PetroTrade in form of coupons and four issued goods received vouchers purporting that all the fuel had been received by the commission, when in actual fact, only 45 120 litres of fuel were recorded.\n\nThough the misrepresentation the accused defrauded the commission of 59 856 litres of fuel and the complainant suffered a prejudice of ZWL 54 836 704, 95 and nothing was recovered, the court heard.\n\nOn the second account, the accused persons also used the same method to defraud their employer and Phiri approved the release of another ZWL51 million into various accounts and collected proceeds in foreign currency.\n\nThe offence came to light when an audit was carried out and the complainant reported the matter to the police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/15090622/F_7dXYbWMAA4nZA.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE Media Commission (ZMC) Executive Secretary Godwin Phiri Friday appeared in court charged with fraud after he allegedly misappropriated fuel worth millions of dollars. Phiri appeared before Harare Magistrate Marewanazvo Gofa jointly charged with other ZMC officials Tafadzwa Chikwiti an accountant, Revai Madire and administrator Mercy Hondo. They are facing two fraud</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zmc-executive-secretary-phiri-in-court-over-fuel-scandal/\">ZMC Executive Secretary Phiri in court over fuel scandal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "ZimParks ranger killed in jumbo attack",
            "url": "https://www.newzimbabwe.com/zimparks-ranger-killed-in-jumbo-attack/",
            "content": "By Costa Nkomo\n\nA ZIMBABWE Parks and Wildlife Management Authority (ZimParks) ranger, Josphat Mandishara, died Thursday after he was trampled by an elephant.\n\nThe now deceaseds colleagues were a short distance away when Mandishara met his demise, the authority announced Friday.\n\nZimParks spokesperson, Tinashe Farawo stated that the deceased met his fate during a routine night patrol. He had momentarily separated from his colleagues to check on their boat, when the incident occurred.\n\nThe Zimbabwe Parks and Wildlife Management Authority is deeply saddened to announce the untimely death of 62-year-old Ranger Josphat Mandishara, who tragically lost his life after being trampled by an elephant in Kariba, Farawo said.\n\nThe incident took place on 13 March 2025, around 2200 hours, during a routine extended patrol in the Gatche-Gatche area. The deceased was accompanied by two fellow ZimParks Rangers and a detail from the Zimbabwe Republic Police (ZRP) when they went to resupply at the Gatche-Gatche Irrigation Scheme, the authority added.\n\nThe authority further elaborated: While his colleagues were otherwise engaged, Ranger Mandishara returned to the harbour where their boat was docked. It was during this short trip that he encountered a charging elephant, which emerged unexpectedly and fatally injured him, the authority said in a statement Friday.\n\nThe authority said Mandisharas remains were taken to Kariba District Hospital for a post-mortem examination, and the incident has been reported to the police.\n\nZimParks further confirmed that it has taken steps to safeguard its rangers and has dispatched rangers from Charara Safari Area to deal with the rogue elephant and other animals.\n\nMeanwhile, ZimParks spokesperson Tinashe Farawo told NewZimbabwe.com that human-wildlife conflict cases are frequently reported in Kariba, due to the increasing populations of both animals and people.\n\nThis, Farawo explained, has a knock-on effect on the resources shared by both animals and people.\n\nHe added that the majority of victims of human-wildlife conflict survive, albeit with injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/17155123/elephant-bull.jpg",
            "description": "<p>By Costa Nkomo A ZIMBABWE Parks and Wildlife Management Authority (ZimParks) ranger, Josphat Mandishara, died Thursday after he was trampled by an elephant. The now deceased’s colleagues were a short distance away when Mandishara met his demise, the authority announced Friday. ZimParks spokesperson, Tinashe Farawo stated that the deceased met his fate during a routine</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-ranger-killed-in-jumbo-attack/\">ZimParks ranger killed in jumbo attack</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "US says South African ambassador ‘no longer welcome’",
            "url": "https://www.newzimbabwe.com/us-says-south-african-ambassador-no-longer-welcome/",
            "content": "By Al Jazeera\n\nTHE administration of President Donald Trump has declared South African Ambassador Ebrahim Rasool a persona non grata in the United States.\n\nIn a social media post on Friday, US Secretary of State Marco Rubio said that Rasool was no longer welcome in our great country.\n\nEbrahim Rasool is a race-baiting politician who hates America and hates POTUS, Rubio wrote, using the acronym for President of the United States.\n\nWe have nothing to discuss with him and so he is considered PERSONA NON GRATA.\n\nRubio linked his remarks to an article by the right-wing media outlet Breitbart, wherein Rasool is quoted as saying Trump mobilised a supremacist instinct and white victimhood as a dog whistle during the 2024 elections.\n\nRasools expulsion is the latest in a series of moves by the Trump administration castigating South Africa, a country that has supported Palestinian rights and helped spearhead a case at the International Court of Justice (ICJ) accusing Israel, a US ally, of genocidal acts in Gaza.\n\nEarlier this week, the news outlet Semafor reported that Rasool, a veteran diplomat, has been denied what are typically routine opportunities to speak with officials at the US State Department, as well as with high-level Republicans, since Trumps inauguration.\n\nRasool returned to his post as South Africas ambassador to the US in January. He previously served in the role from 2010 to 2015, during the presidency of Barack Obama.\n\nSouth Africa is governed by the African National Congress (ANC), a party that emerged out of the anti-apartheid struggle that ended white minority rule in that country.\n\nBut its government has been a target of particular ire for the Trump administration and allies like right-wing billionaire Elon Musk, who is of South African origin.\n\nTrumps government has accused the ANC government of discriminating against its white population.\n\nTrump has nixed aid to South Africa and, in February  at a time when the White House had almost entirely shuttered refugee admissions for people fleeing violence and repression around the world  Trump offered expedited citizenship for white Afrikaners escaping government-sponsored race-based discrimination.\n\nThe announcement was a response to a land distribution law meant to address inequalities that have continued since the apartheid era. The South African government says that Trump is misinformed about the law, which has not been used to confiscate any land.\n\nVincent Magwenya, a spokesperson for South African President Cyril Ramaphosa, told the Reuters news agency that his country was not going to partake in a counterproductive megaphone diplomacy  referring to Trumps propensity for issuing missives about South Africa on social media.\n\nDespite Trumps portrayal of Afrikaners as a besieged minority, South African authorities say that the economic legacy of apartheid, during which white South Africans exercised near-total control over the economy, persists in continued levels of economic inequality between Black and white residents.\n\nA 2017 government audit found that while Black people make up 80 percent of the population of South Africa, they own just 4 percent of privately held farmland.\n\nThe white Afrikaners who own the vast majority of South Africas farmland comprise a mere 8 percent of the population.\n\nRasool and his family were themselves expelled from their home in Cape Town during the apartheid period, when Black people were forcibly relocated to designated non-white areas with almost no resources or economic opportunities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/15063806/AP263550497445-1742013681.webp",
            "description": "<p>By Al Jazeera  THE administration of President Donald Trump has declared South African Ambassador Ebrahim Rasool a persona non grata in the United States. In a social media post on Friday, US Secretary of State Marco Rubio said that Rasool was “no longer welcome in our great country”. “Ebrahim Rasool is a race-baiting politician who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-says-south-african-ambassador-no-longer-welcome/\">US says South African ambassador ‘no longer welcome’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Vice President Chiwenga reeks of cruelty – says Mutsvangwa in secret recording of comments on former general’s aspirations to succeed Mnangagwa",
            "url": "https://www.newzimbabwe.com/vice-president-chiwenga-reeks-of-cruelty-says-mutsvangwa-in-secret-recording-of-comments-on-former-generals-aspirations-to-succeed-mnangagwa/",
            "content": "By Staff Reporter\n\nZANU PF spokesperson Christopher Mutsvangwa has been secretly recorded laying into Vice President Constantino Chiwenga, whom he argues is a cruel, unelectable and uneducated leader who has failed to grasp the difference between letters R and L.\n\nThe audio, part of United Kingdom-based investigative unit Dug Ups latest effort, opens a window into worsening factional fights between President Emmerson Mnangagwa and Chiwenga.\n\nA former army general and arguably the most loved man in Zimbabwe after toppling late President Robert Mugabe in November 2017, Chiwengas presidential aspirations have set him on a collision course with his former allies, who include Mutsvangwa and Mnangagwa.\n\nAccording to Mutsvangwa, Chiwenga and Mnangagwas tiff is centred on the next Zanu PF elective congress at which Chiwenga seemingly does not want to be challenged for the position of party first secretary and President.\n\nZanu PF national spokesperson Christopher Mutsvangwa\n\nHe wants to be endorsed, whereas Mnangagwa is maintaining that he should enter into a popularity contest against any other individual who might be interested in leading the party and standing as its candidate in 2028.\n\nThis guy wants to be anointed as the Presidents successor. He wants to remove him but while in the process of removing him he is saying the President should anoint him. How do you do that? Mutsvangwa can be heard speaking over the phone.\n\nMugabe used to nominate his deputies but this time number one is saying we must go for elections and that is normal for a democratic party.\n\nAn endorsement by Mnangagwa will all but quash any hopes of successfully contesting the seat against him.\n\nAll this is based on assumptions that Mnangagwa himself does not choose to extend his tenure beyond the 2028 constitutional limit as is being called for by various chapters within the party.\n\nOne of the stains on Chiwengas ambitious plans of leading the country, according to Mutsvangwa, is how he has handled his ex-wife Marry Mubaiwa.\n\nMubaiwa, who suffers from acute lymphoedema and has had some limbs cut off, stands accused of attempting to kill the former army commander.\n\nShe has been in and out of court for over three years, her passport held at the courts as she is being denied an opportunity to undergo life saving treatment outside the country.\n\nAdded Mutsvangwa: Can you imagine, half of the electorate are women in this country and you have decapitated the limbs of your former wife through cruelty and you are refusing her to see the children, including the ones she came to you with.\n\nWhen Number One tries to pardon her, you refuse. He reeks of cruelty against all women in the country, he cannot win so he does not want elections, but the president has upended him and told him to sell himself to the electorate.\n\nUnconfirmed reports have always referred to an unwritten pact between Mnangagwa and Chiwenga wherein the latter was promised State leadership after the former.\n\nThis plan, reportedly hampered in 2023, looks more likely to be fought again as 2028 approaches.\n\nMutsvangwa, a learned diplomat, clearly does not rate Chiwenga in the audio. Besides that he is relatively new to the party, his lack of academic wit, according to the former Presidential advisor, is a sign of ignorance.\n\nIf you want to know that a Shona speaking person did not go to school ask that they pronounce the letter L, Mutsvangwa goes on.\n\nThe letter R comes from the mother, the L comes from a teacher, that is the basic litmus test of an illiterate Shona person.\n\nHe never managed to graduate from the mothers alphabet. Going to war is no substitute for illiteracy and ignorance, we went to war from universities.\n\nThe full investigation, presented by journalist Maynard Manyowa is available on YouTube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13054207/Chiwenga-Mnangagwa.png",
            "description": "<p>By Staff Reporter ZANU PF spokesperson Christopher Mutsvangwa has been secretly recorded laying into Vice President Constantino Chiwenga, whom he argues is a cruel, unelectable and uneducated leader who ‘has failed to grasp the difference between letters R and L.’ The audio, part of United Kingdom-based investigative unit Dug Up’s latest effort, opens a window</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vice-president-chiwenga-reeks-of-cruelty-says-mutsvangwa-in-secret-recording-of-comments-on-former-generals-aspirations-to-succeed-mnangagwa/\">Vice President Chiwenga reeks of cruelty – says Mutsvangwa in secret recording of comments on former general’s aspirations to succeed Mnangagwa </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Vendors defy ban, go about their business on Harare streets",
            "url": "https://www.newzimbabwe.com/vendors-defy-ban-go-about-their-business-on-harare-streets/",
            "content": "By Staff Reporter\n\nVENDORS in Harare went about their business without hindrance Friday afternoon and evening despite a recent government backed directive by council to have them cleared off the streets.\n\nThe Copa Cabana area, a hub for informal traders of food stuffs, phones and second-hand clothes was operational, with vendors seemingly oblivious to Harare Mayor Jacob Mafume and Local Government Minister Daniel Garwes statements that they had become a nuisance.\n\nAt the corner of Julius Nyerere and Nelson Mandela where traders of chocolates and biscuits are now congested, business continued as usual.\n\nThere was also no notable change at the Simon Muzenda (formerly Fourth Street) rank and Market Square.\n\nCouncil this week announced a blitz to flush out illegal vending in conjunction with the Zimbabwe Republic Police (ZRP).\n\nThe move was supported by government, with Garwe blaming the informal traders for a rise in crime, drug abuse and filth in central business districts (CBDs) across most urban areas.\n\nWe will cross that bridge when we get there, at the moment we are just having to deal with the usual council officers who raid us and leave either after we pay them or after collecting enough, said one vendor at Copa Cabana who refused to be identified.\n\nNumerous past attempts by council and the police to rid capital Harare of vendors have failed.\n\nAt one point Health Services Director Prosper Chonzi admitted that City of Harare had lost the battle against illegal vendors, citing Zimbabwes biting economy as a major cause.\n\nThe high unemployment rate has seen even the learned opting to buy and resell in CBDs.\n\nForeigners, mainly from war torn regions of Mozambique have also joined the trade, focusing mainly on cigarettes and sweets. These youngmen, commonly referred to as Mano (Elder Brother) have added onto the growing list of illegal vendors on Harares streets.\n\nThe general economy is playing against us; we have been playing hide-and-seek after vendors, and it is not working, said Chonzi.\n\nHeavy handedness is expected as has been evident in past operations such as Operation Murambatsvina in the early 2000s when slums, illegal structures and vending stalls were razed down by both government and council.\n\nBecause of this expectation, National Peace and Reconciliation Commission (NPRC) Commissioner Obert Gutu preached restraint, urging enforcers to realise that those on the streets were not there out of their own will but circumstances.\n\nBy late Friday evening, there was no evidence that municipal police and the ZRP had started their programme.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/27040018/Zimbabwe-vendors.jpeg",
            "description": "<p>By Staff Reporter VENDORS in Harare went about their business without hindrance Friday afternoon and evening despite a recent government backed directive by council to have them cleared off the streets. The Copa Cabana area, a hub for informal traders of food stuffs, phones and second-hand clothes was operational, with vendors seemingly oblivious to Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vendors-defy-ban-go-about-their-business-on-harare-streets/\">Vendors defy ban, go about their business on Harare streets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Government’s US$44m medicines budget for 2025, a drop in the ocean for Zimbabwe’s healthcare needs of about US$17m monthly— Health minister",
            "url": "https://www.newzimbabwe.com/governments-us44m-medicines-budget-for-2025-a-drop-in-the-ocean-for-zimbabwes-healthcare-needs-of-about-us17m-monthly-health-minister/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEs 2025 budget allocation of US$44 million for medicines is deplorably insufficient, as the country requires at least US$17 million per month.\n\nFor years, the government has been struggling to provide basic supplies at public hospitals, with health professionals receiving poor salaries.\n\nThe healthcare crisis is expected to worsen as international donors like the USAID and UKAID, may withdraw their funding.\n\nUSAID has already suspended funding for all activities pending review, while UKAID announced a significant budget cut to its international assistance.\n\nAddressing a press conference Friday on his ministrys achievements, Health and Child Care Minister Douglas Mombeshora revealed that the US$17 million required is still inadequate, as it only covers the most essential supplies.\n\nAccording to the minister the whole year budget only covers about three months if the required budget is to be met.\n\nMombeshora stated that the ministry is in negotiations with the Treasury to increase the budget amid declining external assistance.\n\nThe country requires approximately US$17 million worth of medicines monthly. The figure only covers the most essential medicines.\n\nThe availability of essential medicines increased from 22% in 2023 to around 50% in 2024. The increase in availability has largely been due to greater investment in medicines.\n\nFor instance, there are currently two main medicine supply contracts: Intrapharma (around US$24 million) and Clean Planet (around US$17 million).\n\nIn 2023, the government allocated about US$52 million for medicines. In 2025, the government committed approximately US$44 million toward medicines.\n\nThere are ongoing negotiations with the Treasury to increase the health budget in light of dwindling external support, Mombeshora said.\n\nZimbabwes health sector is generally underfunded and relies heavily on the benevolence of Western development partners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/15022128/Douglas-Mombeshora.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE’s 2025 budget allocation of US$44 million for medicines is deplorably insufficient, as the country requires at least US$17 million per month. For years, the government has been struggling to provide basic supplies at public hospitals, with health professionals receiving poor salaries. The healthcare crisis is expected to worsen as international donors</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/governments-us44m-medicines-budget-for-2025-a-drop-in-the-ocean-for-zimbabwes-healthcare-needs-of-about-us17m-monthly-health-minister/\">Government’s US$44m medicines budget for 2025, a drop in the ocean for Zimbabwe’s healthcare needs of about US$17m monthly— Health minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:28",
            "date": "15 Mar 2025"
        }
    ]
}