{
    "news": [
        {
            "title": "APEX Travel Zimbabwe: A decade of grit, growth, and guts in entrepreneurship",
            "url": "https://www.newzimbabwe.com/apex-travel-zimbabwe-a-decade-of-grit-growth-and-guts-in-entrepreneurship/",
            "content": "By Anna Chibamu\n\nBorn in 1991 as the youngest and only son in a family of three, Tanaka Tank Mupfurutsa has remained steadfast in his pursuit of business success, undeterred by the unpredictable highs and lows of entrepreneurship.\n\nWhile his siblings have sought opportunities abroad, Mupfurutsa chose to stay in Zimbabwe, founding Apex Travel Zimbabwe, a premier travel and tours operator among other business ventures.\n\nHe continues to navigate the countrys challenging economic terrain with courage and determination, all while supporting his family and building a name for himself in the local business landscape.\n\nAt just 19 years old, he launched Black Bean Investments, a candle and maputi (puffed maize snack) manufacturing company  laying the foundation for a bigger vision.\n\nIn an interview withNewZimbabwe.com, Mupfurutsa shares his successes and sorrows, highlighting the guiding principle behind his resilience: Keep changing. Nothing will work without God in it.\n\nIt was not easy, he said, recalling his encounters with the police after overloading his car with maputi but this did not deter him from achieving his goals.\n\nInstead, they became anecdotes of persistence and hustle.\n\nMupfurutsa invested in his own maputi machines. Scaling up, he was processing tonnes of maize and supplying major retailers.\n\nA milestone came when he landed a contract with Afro Foods, distributing 10,000 packets three times a week to over 15 retail outlets around Harare City. The business later suffered due to the collapse of Afro Foods but he remained undeterred.\n\nWhile pursuing a Business Studies and Computing Science degree at the University of Zimbabwe (graduated 2013), Mupfurutsa co-founded Campus Culture, where he served as finance director.\n\nThe student-led enterprise published magazines, hosted events, and even represented the university in a national ICT innovation competition.\n\nDespite multiple job offers, including from Delta Beverages and Document Support Centre, he chose entrepreneurship  the less-travelled path, and that was the birth of Apex Travel.\n\nApex Travel was formally registered in 2014 as an educational tours company.With unwavering zeal, Mupfurutsa and his team visited over ten schools daily, earning the trust of clients one handshake at a time.\n\nApex Travel grew into a leading brand, known for luxurious and unforgettable school trips. The company revolutionised the industry by offering high-end experiences to studentsluxury coach rides, five-star hotel stays, and fully guided educational experiences.\n\nOne of Apex Travels historic achievements was chartering a full Boeing aircraft through Fly Africa, taking 140 students from Haig Park Primary School to Victoria Falls.\n\nAnother proud moment came when Apex Travel booked out the entire Caribbea Bay Hotel for a school tour. Apex became a household name in schools across Zimbabwe and was known for setting industry trends.\n\nThe business expanded rapidly: Apex now included car rental, vehicle tracking, and eventually roadside assistance.\n\nTheir custom vehicle tracking system became a unique product in Zimbabwe. Developed in collaboration with Chinese manufacturers, Apex Trackers now provide features such as live tracking, remote vehicle immobilisation, driver behaviour analytics, geo-fencing, playback history, and microphone surveillance.\n\nApex Travelenforces strict client verification, including fingerprinting and ID capture, which has helped maintain a clean fleet and high customer integrity.\n\nThe car rental fleet grew to include sedans, mid-range SUVs, double cabs, fuel savers, luxury SUVs like the 300 series, and Mercedes-Benz S-Class models.\n\nInterestingly, COVID-19 became a defining period for Apex Travel. Though the travel business paused, car rental surged as companies sought vehicles for restricted local movement.\n\nMupfurutsa reallocated funds from his home construction to fleet expansion, turning a crisis into an opportunity. It was during this time that Apex Travel solidified car rental as its flagship division.\n\nIn addition to that, Mupfurutsa acquired haulage trucks from a distressed seller, further diversifying his assets. With no initial plan, he instinctively knew it was a strategic purchase and it proved fruitful.\n\nHis late father was always the first to test-drive any new vehicle and validate each major acquisition. His passing in February 2023 from cancer was a deep personal loss, but his legacy remains central to Mupfurutsas journey.\n\nMupfurutsas personal resilience was again tested when their nearly completed family home caught fire due to negligence by a caretaker.\n\nDespite the destruction, his father encouraged him to finish the project, calling it the test of time. With support from loyal contractors, some whom refused payment, he rebuilt the house.\n\nToday, Tanaka Mupfurutsa stands tall as a visionary entrepreneur, husband, father, and innovator who continues to grow Apex Travel into one of Zimbabwes most dynamic service providers across travel, logistics, and tech-enabled fleet services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10192849/Apex-Tanaka.png",
            "description": "<p>By Anna Chibamu Born in 1991 as the youngest and only son in a family of three, Tanaka “Tank” Mupfurutsa has remained steadfast in his pursuit of business success, undeterred by the unpredictable highs and lows of entrepreneurship. While his siblings have sought opportunities abroad, Mupfurutsa chose to stay in Zimbabwe, founding Apex Travel Zimbabwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/apex-travel-zimbabwe-a-decade-of-grit-growth-and-guts-in-entrepreneurship/\">APEX Travel Zimbabwe: A decade of grit, growth, and guts in entrepreneurship</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "11 Jul 2025"
        },
        {
            "title": "U.S Embassy orders visa applicants to make social media accounts public",
            "url": "https://www.newzimbabwe.com/u-s-embassy-orders-visa-applicants-to-make-social-media-accounts-public/",
            "content": "By Thandiwe Garusa\n\nTHE United States (U.S) Embassy in Harare has issued a fresh directive to all individuals applying for the F, M, and J nonimmigrant visas, mandating that applicants adjust the privacy settings of their personal social media accounts to public.\n\nF, M, and J, non-immigrant visas, allow foreign nationals to enter the U.S. for academic study, vocational training, or cultural and educational exchange programs, respectively.\n\nThe announcement was made in a statement posted on the embassys official social media accounts on Thursday.\n\nEvery visa adjudication is a national security decision.\n\nEffective immediately, all individuals applying for an F, M, or J non-immigrant visa are requested to adjust the privacy settings on all of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility to the United States, the statement reads.\n\nThis revised screening policy is part of wider U.S. measures to protect national interests and ensure that visa holders comply with the permitted activities under their non-immigrant status.\n\nEarlier this month, the Embassy also warned against using visas to give birth in the U.S. for citizenship purposes and said that consular officers will deny applications if they suspect such intent.\n\nThe Embassy also added that visa misuse can lead to denial or future bans, especially if public funds are involved.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/06020401/US-Embassy-Harare.png",
            "description": "<p>By Thandiwe Garusa THE United States (U.S) Embassy in Harare has issued a fresh directive to all individuals applying for the F, M, and J nonimmigrant visas, mandating that applicants adjust the privacy settings of their personal social media accounts to “public”. F, M, and J, non-immigrant visas, allow foreign nationals to enter the U.S.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-embassy-orders-visa-applicants-to-make-social-media-accounts-public/\">U.S Embassy orders visa applicants to make social media accounts public</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "11 Jul 2025"
        }
    ]
}