{
    "news": [
        {
            "title": "Mines and Minerals Bill to be finalised during current Parliamentary session",
            "url": "https://www.newzimbabwe.com/mines-and-minerals-bill-to-be-finalised-during-current-parliamentary-session/",
            "content": "By Alois Vinga\n\nPresident Emmerson Mnangagwa on Tuesday reaffirmed his governments commitment to finalising the Mines and Minerals Bill during the current session of Parliament.\n\nThe government gazetted the Bill in June this year, bringing relief to communities that have long endured hardships caused by mining-related activities.\n\nAmong other provisions, the Bill seeks to replace the Mines and Minerals Act (Chapter 21:05) of 1961, establish a Mining Affairs Board to guide decision-making processes, and introduce clearer rules on the management of mining titles, particularly with regard to the cadastre system and exploration rights.\n\nOnce enacted, the legislation is expected to strengthen environmental compliance and land rehabilitation obligations, enhance governance through transparency and accountability mechanisms in the allocation of mining rights, and define and protect community rights, including benefit-sharing and land access protocols.\n\nResponding to long-standing calls from organisations such as Silveira House, which has worked tirelessly to promote human rights in mining communities, Mnangagwa reassured the nation of the Bills expeditious finalisation.\n\nThe Mines and Minerals Amendment Bill has been gazetted and is expected to be finalised during the current session of Parliament. My Government is committed to weeding out irresponsible mining stakeholders who cause pollution, environmental degradation, and damage to critical infrastructure.\n\nAs we welcome investors into our jurisdiction, we expect them to adhere to the Constitution and laws of our country, while also respecting our people, customs, and culture, he said.\n\nHowever, citizens have urged the government to make the Mines and Minerals Bill available in vernacular languages to ensure easier understanding and interpretation, especially within mining communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga President Emmerson Mnangagwa on Tuesday reaffirmed his government’s commitment to finalising the Mines and Minerals Bill during the current session of Parliament. The government gazetted the Bill in June this year, bringing relief to communities that have long endured hardships caused by mining-related activities. Among other provisions, the Bill seeks to replace</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mines-and-minerals-bill-to-be-finalised-during-current-parliamentary-session/\">Mines and Minerals Bill to be finalised during current Parliamentary session</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "29 Oct 2025"
        },
        {
            "title": "It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa",
            "url": "https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/",
            "content": " claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga\n\nBy Leopold Munhende\n\nZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed.\n\nSpeaking to journalist Violet Gonda, Mliswa likened Tagwireis fast-track promotion to opposition leader Nelson Chamisa, describing it in similar terms that were used when the latter took over after the passing of pro-democracy icon Morgan Tsvangirai a generational consensus.\n\nAn ongoing factional fight within Zanu PF has pitted President Emmerson Mnangagwas deputy, Constantino Chiwenga with Tagwirei.\n\nThe two are in a race to succeed Mnangagwa, either in 2028 or beyond, if his term is illegally extended as is being rallied for by sections in the party.\n\nThat Tagwirei has become a strong contender is no longer secret, even hardline critics of the businessman such as Zanu PF spokesperson Christopher Mutsvangwa, have changed their stance.\n\nMliswa said it was time senior party members allowed younger members to take over.\n\nIt is a generational consensus just like when we had national consensus in making sure that people marched (in 2017). It is the generational consensus that Tagwirei must make it because he is young, said Mliswa.\n\nWe have given our liberators time to liberate us from an economic point of view but they have not done what we expected them to do, they have done their best but it is about time that we took over.\n\nWe do not have liberation history but we have economic ability to be able to transform the country and equally transform its fortunes.\n\nMliswa, who was fired from Zanu PF in 2015, has emerged as one of Tagwireis fervent supporters, frequently laying into Chiwenga.\n\nChiwenga is pushing for Tagwireis arrest on a string of corruption allegations. His attempts to get the partys stamp, however, fell by the wayside as he was advised to report all of the alleged graft to Zimbabwe Anti-Corruption Commission (ZACC) or the police.\n\nTagwireis meteoric rise is being supported by claims that he financed the 2017 coup that toppled late leader Robert Mugabe and governments agriculture programme, Command Agriculture.\n\nAdded Mliswa: It is a generational consensus which you cannot stop.\n\nThat is the reason why the opposition moved from the late Morgan Tsvangirai to Nelson Chamisa. Now Zanu PF has moved to Tagwirei.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>–  claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga By Leopold Munhende ZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed. Speaking to journalist Violet Gonda, Mliswa likened Tagwirei’s fast-track promotion to opposition leader Nelson Chamisa, describing it in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/\">It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mnangagwa warns foreign investors over pollution, labour abuses",
            "url": "https://www.newzimbabwe.com/mnangagwa-warns-foreign-investors-over-pollution-labour-abuses/",
            "content": "By Anna Chibamu\n\nPresident Emmerson Mnangagwa has issued a stern warning to foreign investors, particularly those in the mining sector, adding that government is finalising measures to hold polluters and labour rights violators accountable.\n\nDelivering his State of the Nation Address (SONA) at the new Parliament Building in Mt Hampden on Tuesday, Mnangagwa said authorities will no longer tolerate companies that exploit workers or degrade the environment.\n\nWe expect that they will adhere to the Constitution and laws of our country while respecting our people and our culture, Mnangagwa said.\n\nHis remarks come amid growing public outrage over the conduct of some foreign-owned mining firms, especially from China, accused of flouting labour laws, underpaying local workers, and causing extensive environmental damage.\n\nIn recent years, Zimbabwes investment drive has drawn criticism from communities who say many investors operate with impunity, polluting rivers, creating unsafe working conditions, and offering little benefit to surrounding areas.\n\nMnangagwas warning signals mounting government pressure on errant investors amid increasing calls for tighter regulation and enforcement in the mining sector, a key pillar of Zimbabwes struggling economy.\n\nMeanwhile, the President said the long-awaited Mines and Minerals Amendment Bill should be completed during the third session of the 10th Parliament.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164746/Mnangagwa-SONA.jpg",
            "description": "<p>By Anna Chibamu President Emmerson Mnangagwa has issued a stern warning to foreign investors, particularly those in the mining sector, adding that government is finalising measures to hold polluters and labour rights violators accountable. Delivering his State of the Nation Address (SONA) at the new Parliament Building in Mt Hampden on Tuesday, Mnangagwa said authorities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-warns-foreign-investors-over-pollution-labour-abuses/\">Mnangagwa warns foreign investors over pollution, labour abuses</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/",
            "content": "By Thandiwe Garusa\n\nThe Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwas State of the Nation Address (SONA) was disrupted by a power outage,NewZimbabwe.comhas learnt.\n\nMnangagwa was concluding his SONA when the power outage occurred, forcing him to use a torchlight to finish his speech.\n\nSpeaker of Parliament Jacob Mudenda was visibly angered by the incident, saying, We shall go beyond what happened, trace the culprit, and deal with them accordingly. Those found wanting will regret the day of their existence.\n\nAccording to Parliament, the generator had been activated at midday, with ZESA engineers on site to monitor proceedings.\n\nHowever, the backup system reportedly developed a technical fault approximately two and a half hours into the address, causing the blackout while Mnangagwa was still delivering his speech.\n\nA letter from Acting Clerk of Parliament Nomasonto Sunga to Local Government Permanent Secretary John Bhasera, dated October 21, had requested a serviced, fully tested and fit generator for the SONA, citing previous blackouts during important sessions.\n\nWATCH : President Emmerson Mnangagwa was on Tuesday forced to complete his State of the Nation Address (SONA) using a torchlightafter the New Parliament Building was plunged into darkness.\n\n\"The person who switched off electricity while the President was speaking will regrethttps://t.co/TqTPubyuMxpic.twitter.com/IIlyQncs8O\n\n NewZimbabwe.com (@NewZimbabweCom)October 28, 2025\n\nThis is the second time a blackout has occurred at the Parliament Building in Mnangagwas presence, following a similar incident in November 2024 during Finance Minister Mthuli Ncubes 2025 National Budget presentation.\n\nWe request your ministrys coordination and oversight in ensuring uninterrupted power supply during the State of the Nation Address (SONA), which has been tentatively scheduled for 28 October 2025 at Parliament Building.\n\nIt is noted that there is an approved arrangement to run the event using the generator as the primary source of power, with ZETDC on standby, following previous power disruptions experienced during important sessions, Sunga wrote.\n\nIn view of this, the generator must be serviced, fully tested, and confirmed fit for uninterrupted operation during the event. ZETDC technical staff should be physically on standby throughout the proceedings to provide an immediate response if required.\n\nParliament also assured that it would promptly pay the company contracted to provide generator services and supply sufficient fuel to ensure smooth power supply throughout the event.\n\nParliament will ensure timely payment to the service provider contracted for the generator service, as well as the provision of adequate fuel to power the system throughout the duration of the event, added Sunga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130416/ED-SONA-torch-1.jpeg",
            "description": "<p>By Thandiwe Garusa The Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwa’s State of the Nation Address (SONA) was disrupted by a power outage, NewZimbabwe.com has learnt. Mnangagwa was concluding his SONA when the power outage occurred, forcing him to use a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/\">Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "29 Oct 2025"
        },
        {
            "title": "In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight",
            "url": "https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/",
            "content": "A power outage plunged parliament into darkness during President Emmerson Mnangagwas State of the Nation Address (SONA), forcing him to complete his speech using a torchlight.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>A power outage plunged parliament into darkness during President Emmerson Mnangagwa’s State of the Nation Address (SONA), forcing him to complete his speech using a torchlight. Below are some images captured during the address. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/\">In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "29 Oct 2025"
        },
        {
            "title": "Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid",
            "url": "https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/",
            "content": "By Staff Reporter\n\nA planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue.\n\nOpposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU PF to extend President Emmerson Mnangagwas term beyond 2028.\n\nIn the early hours of Tuesday, the SAPES Trust premises were reportedly petrol-bombed and a guard on duty was abducted, in what is believed to be a coordinated attempt to stop the discussion.\n\nSAPES Trust Director Ibbo Mandaza said there appeared to be a clear link between the arson attack and the subsequent police disruption.\n\nIt is not surprising at all. There is a correlation between what happened after midnight,the arson, the abduction of the security guard.\n\nIt was done by people who know the job of fear. They seem to have forgotten that we have endured such harassment for the past two years, said Mandaza.\n\nThe ruling party has endorsed a resolution seeking to extend Mnangagwas presidency to 2030, which would require amending Section 91(2) of the Constitution, which limits a president to two terms, and Section 328(7), which bars incumbents from benefiting from constitutional amendments.\n\nAccording to party insiders, ZANU PF intends to use its parliamentary majority to push through the proposed changes.\n\nSpeaking at the disrupted event, Biti condemned the attacks and reaffirmed the groups commitment to defending the Constitution.\n\nWe are very sorry to Dr. Mandaza over the arson, and to Gilbert Mbwende, whose house was also attacked.\n\nThis is a new initiative by concerned citizens to resist the mutilation of the Constitution. It is not a political effort, but a civic one, to defend the rule of law, Biti said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164119/biti-sikhala-sapes.jpg",
            "description": "<p>By Staff Reporter A planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue. Opposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/\">Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "29 Oct 2025"
        }
    ]
}