{
    "news": [
        {
            "title": "Legal Discussions with Vengai Madzima: Public Private Partnerships In Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-public-private-partnerships-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss public-private partnerships in Zimbabwe, what they are and whether they are a goodconsiderationin theinvestment area.\n\nVM: Thank you.\n\nAs the name suggests, it is a partnership between the government on behalf of its people and a private player in the development of a particular project. Potential projects capable of investment vary and may range from projects like dam construction, road and rail infrastructure development, power generation and so forth. The opportunities are vast.\n\nThe motivation for the government is to provide its people with the necessary infrastructure at an affordable cost, including in projects where charges are defrayed directly to the public, for example, toll fees, while the motivation of the private sector is to maximise profits.\n\nThese motivations are the underlying guide to the contract negotiation process.\n\nSo in short, a typical Public Private Partnership will have the private company designing, funding, constructing and even implementing the project while the government monitors compliance with the undertakings made in the contract and in some instances allows for concessions within its capacity, like tax incentives to assist in expediting project implementation.\n\nReporter:Are PPPs in Zimbabwe a good area for investment in light of the potential economic risks?\n\nVM: The first thing to consider is that Zimbabwe is a developing country. That being said, it follows that there is a lot of scope where private players can partner up with the government to deliver necessary infrastructure at a profit.\n\nThe issue of risk, which is critical in all negotiations with all governments around the world, can be mitigated by understanding our economic model and laws. Our law makes it a condition precedent before entering any public-private partnership that the company or private party intending to enter into a Public-Private Partnership must undertake a thorough feasibility study of the project.\n\nThis feasibility study will highlight all the potential risks that may emanate from the project and such risks are then allocated to the best party capable of managing or mitigating them in the partnership contract.\n\nReporter: Where will a person contemplating a PPP go in the government to get assistance?\n\nVM: The Zimbabwe Investment and Development Agency (ZIDA) and specifically the Public Private Partnership Unit within the agency, is responsible for the examination and review of the project, including its risk allocation. For a project to proceed to implementation, it requires the approval of the PPP unit and the Minister of Finance, Economic Development and Investment Promotion.\n\nIn unsolicited projects, where for instance, a private player has land that can be utilized in PPP to unlock value, the first port of call will obviously be the local council or responsible ministry with a comprehensive proposal outlining its value to the state and corresponding implementation requirements, be it legal, financial or technical.\n\nShould the government body responsible be satisfied with the proposal, it will then refer it to the PPP unit for evaluation. If the PPP unit gives the go-ahead, then the government body can enter negotiations with the private party for a mutually beneficial operating contract.\n\nReporter: What are the main considerations when negotiating a PPP?\n\nVM: It is critical to understand that PPPs are not a one-size-fits-all. Each PPP will address unique issues in a manner appropriate for that particular transaction. The underlying motivation for the parties remaining, as I stated earlier, the government intends to provide infrastructure at the best cost, and the private player intends to maximise as much profit. It is always best to allocate a portion of the profit as a buffer against unforeseen events like an increase in costs, delays in the project, which also have cost consequences, technical defects etc.\n\nAnother key consideration will be the model of the PPP, whether a Build Transfer PPP, a Build Operate and Transfer, Build Lease and Transfer. The type of structure should be one most suited to address projects particular risks.\n\nThe private partner on the other hand, may also be interested in achieving as many fiscal benefits as possible, which may include duty exemptions on capital goods, investment allowances, tax breaks or special rates et cetera.\n\nSpecial attention should also be afforded to the general contract clauses, like your dispute resolution clauses. They should allow provision for negotiated settlements as a first step in this type of contract, then consider alternative methods when negotiation fails. Other key clauses are your step-in, force majeure, and termination clauses as read with the undertakings clauses.\n\nReporter: Thank you, Mr. Madzima, we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/15171050/ppp-1.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss public-private</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-public-private-partnerships-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Public Private Partnerships In Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "16 Jun 2025"
        },
        {
            "title": "Labour MP Butler distances herself from summit with Zimbabwe’s First Lady as activists threaten protests",
            "url": "https://www.newzimbabwe.com/labour-mp-butler-distances-herself-from-summit-with-zimbabwes-first-lady-as-activists-threaten-protests/",
            "content": "By UK Correspondent\n\nLabour MP Dawn Butler has withdrawn from an international summit in London after learning she was advertised as a speaker alongsideAuxilliaMnangagwa, Zimbabwes First Lady, who is under US sanctions for alleged corruption and gold smuggling. The decision follows fierce backlash from Zimbabwean activists, who accuse Mnangagwa of hypocrisy and have pledged to disrupt the event with protests.\n\nThe First Ladies of African Impact & Resilience (FLAIR) Summit, due to take place on 17-18 June at the Leonardo Royal Hotelin London, aims to spotlight female leadership and investment in Africa. But Mnangagwas inclusion has ignited controversy, prompting Butlers exit and raising questions about the participation of two other British politicians, Labour MP Diane Abbott and Conservative peer Baroness Sandip Verma.\n\nLabour MP Dawn Butler\n\nIn a statement, Butlers office said: We have never agreed to speaking at this event, so are rightly concerned that Dawn is being advertised as a speaker at this summit. We have contacted the organisers and asked them to remove her name from their programme immediately. The move came after Zimbabwean diaspora activists delivered a petition to 10 Downing Street, calling for Mnangagwa to be barred from the UK.\n\nA Controversial Guest\n\nAuxilliaMnangagwa, married to Zimbabwes President Emmerson Mnangagwa, was sanctioned by the US in 2023 under the Global Magnitsky Act. An Al Jazeera investigation,Gold Mafia, alleged she played a key role in smuggling gold and diamonds, funnelling profits to the ruling elite while Zimbabwes economy crumbled. Over 80% of Zimbabweans are unemployed, and 5.6 million face food insecurity, according to the World Food Programme. Last years elections, widely criticised as fraudulent by the EU, SADCand others, further entrenched the regimes grip on power.\n\nDespite this, Mnangagwa has cast herself as an advocate for womens empowermenta claim activists dismiss as a sham. On 4 June, campaigner JosephineJenje-Mudimbuled a protest outside Downing Street, delivering a petition to block Mnangagwas entry. In a video on X, she said: Charity begins at home.Auxilliashould clean up the mess she and her husband are creating in Zimbabwe. There is no room forAuxilliato come to the UK to present herself at FLAIR.\n\nIve got a message for Auxillia Mnangagwa, the illegitimate First Lady.\n\nThese were the first few words by Josephine Jenje-Mudimbu as she started. She was standing in front of 10 Downing Street in London, on the 4th of June 2025 as part of a protest that was also handing in apic.twitter.com/SbPCPvghXA\n\n Zimbabwe Freedom of Expression (@ZimbabweFreedo1)June 12, 2025\n\nThe outrage has spilled onto social media. X user @MilMillazwrote: AuxilliaMnangagwa must not be given a platform at the #FLAIRSummit. She represents a brutal regime responsible for abductions, mass corruption, and human rights abuses.\n\nPolitical Fallout\n\nButlers withdrawal has turned the spotlight on Abbott and Verma, both still listed as speakers. Abbott, a veteran Labour MP, and Verma, the UKs Ministerial Champion for Tackling Violence Against Women and Girls Overseas, have yet to clarify their stances. For Verma, the stakes are high: her role puts her at odds with sharing a stage with the spouse of a leader linked to state violence. Neither responded to inquiriesemailed to their offices last week.\n\nThe silence has fuelled criticism. Would these MPs sit with the spouse of a Russian oligarch? asked @ChirevoChamisaon X. If not, what makes Zimbabwe different? Activists argue that hosting Mnangagwa undermines the summits stated mission and sends a dangerous signal to Zimbabwean women enduring repression.\n\nThe FLAIR Summits organisers have remained tight-lipped, though sources suggest Mnangagwas participation could be reconsidered as protests mount. With just days until the event, the row exposes a broader dilemma: how to balance diplomatic engagement with accountability for human rights abuses.\n\nAs activists prepare to shut it down, the summits future hangs in the balance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/08033118/Auxilia-Mnangagwa.jpeg",
            "description": "<p>By UK Correspondent Labour MP Dawn Butler has withdrawn from an international summit in London after learning she was advertised as a speaker alongside Auxillia Mnangagwa, Zimbabwe’s First Lady, who is under US sanctions for alleged corruption and gold smuggling. The decision follows fierce backlash from Zimbabwean activists, who accuse Mnangagwa of hypocrisy and have pledged to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-mp-butler-distances-herself-from-summit-with-zimbabwes-first-lady-as-activists-threaten-protests/\">Labour MP Butler distances herself from summit with Zimbabwe’s First Lady as activists threaten protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "16 Jun 2025"
        },
        {
            "title": "Zimbabwe hearings over Gukurahundi massacres to start on June 26",
            "url": "https://www.newzimbabwe.com/zimbabwe-hearings-over-gukurahundi-massacres-to-start-on-june-26/",
            "content": "AFP\n\nLong-awaited hearings on notorious 1980s massacres by troops in Zimbabwe will commence on June 26, a panel of chiefs set up by the countrys President Emmerson Mnangagwa announced on Sunday.\n\nTens of thousands of people were killed over several years in the so-called Gukurahundi massacres under former leader Robert Mugabe, a few years after Zimbabwes independence from Britain.\n\nLast year, Mnangagwa announced that survivors would be interviewed in a series of village hearings, in a bid to settle longstanding grievances and tensions.\n\nThe hearings are starting on June 26, 2025 and will be presided by traditional chiefs and a panel of community members, Chief Fortune Charumbira told a press conference in Bulawayo, in the Matabeleland region where the massacres were committed.\n\nVictim-centred\n\nOur approach is victim-centred, Charumbira said, adding the hearings would be closed to the media because of the sensitivity and private nature of some of the stories.\n\nA report would be submitted to the president and financial compensation would be considered, he said, but added that the modalities and amounts could not be predetermined before the hearings.\n\nStarting in 1983, Mugabe deployed an elite North Korean-trained army unit to crack down on a revolt in the western Matabeleland region, the heartland of the Ndebele minority.\n\nThey killed an estimated 20,000 people over several years, according to the Catholic Commission for Justice and Peace in Zimbabwe, a toll supported by Amnesty International.\n\nTargeted minority Ndebele tribe\n\nThe operation was namedGukurahundi, a term in the majority Shona language that loosely translates as the early rain that washes away the chaff.\n\nCritics say it targeted dissidents loyal to Mugabes rival, fellow revolutionary leader Joshua Nkomo. Most of the victims belonged to the minority Ndebele tribe.\n\nMugabe, who died in 2019, never acknowledged responsibility for the massacres, dismissing evidence gathered by Amnesty International as a heap of lies.\n\nAfter taking power in 2017, Mnangagwa promised a resolution and set up a panel of chiefs to probe the massacres.\n\nFlawed process\n\nBut activists said the process was flawed as there had been no official government apology and victims were not consulted.\n\nActivist Mbuso Fuzwayo on Sunday dismissed the initiative as a sham from the start.\n\nThis is being dealt with from the position of the perpetrator and not the victims, he told AFP.\n\nSome of the known perpetrators are people in positions of power and they are the ones who led the initiative from the start, Fuzwayo said.\n\nMnangagwa, who has previously described the massacres as a bad patch in Zimbabwes history, was security minister at the time but has always denied any responsibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10153513/Gukurahundi.jpg",
            "description": "<p>AFP Long-awaited hearings on notorious 1980s massacres by troops in Zimbabwe will commence on June 26, a panel of chiefs set up by the country’s President Emmerson Mnangagwa announced on Sunday. Tens of thousands of people were killed over several years in the so-called Gukurahundi massacres under former leader Robert Mugabe, a few years after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hearings-over-gukurahundi-massacres-to-start-on-june-26/\">Zimbabwe hearings over Gukurahundi massacres to start on June 26</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "16 Jun 2025"
        },
        {
            "title": "Trump administration weighs adding 36 countries, including Zimbabwe, to travel ban, memo says",
            "url": "https://www.newzimbabwe.com/trump-administration-weighs-adding-36-countries-including-zimbabwe-to-travel-ban-memo-says/",
            "content": "By Humeyra Pamuk I Reuters\n\nU.S. President Donald Trumps administration is considering significantly expanding its travel restrictions by potentially banning citizens of 36 additional countries from entering the United States, according to an internal State Department cable seen by Reuters.\n\nEarlier this month, the Republican president signed a proclamation that banned the entry of citizens from 12 countries, saying the move was needed to protect the United States against foreign terrorists and other national security threats.The directive was part of an immigration crackdown Trump launched this year at the start of his second term, which has included the deportation to El Salvador of hundreds of Venezuelans suspected of being gang members, as well as efforts to deny enrollments of some foreign students from U.S. universities and deport others.In an internal diplomatic cable signed by U.S. Secretary of State Marco Rubio, the State Department outlined a dozen concerns about the countries in question and sought corrective action.The Department has identified 36 countries of concern that might be recommended for full or partial suspension of entry if they do not meet established benchmarks and requirements within 60 days, the cable sent out over the weekend said.The cable was first reported by the Washington Post.Among the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said.Another was questionable security of that countrys passport.Some countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nEarlier this month, the Republican president signed a proclamation that banned the entry of citizens from 12 countries, saying the move was needed to protect the United States against foreign terrorists and other national security threats.\n\nThe directive was part of an immigration crackdown Trump launched this year at the start of his second term, which has included the deportation to El Salvador of hundreds of Venezuelans suspected of being gang members, as well as efforts to deny enrollments of some foreign students from U.S. universities and deport others.In an internal diplomatic cable signed by U.S. Secretary of State Marco Rubio, the State Department outlined a dozen concerns about the countries in question and sought corrective action.The Department has identified 36 countries of concern that might be recommended for full or partial suspension of entry if they do not meet established benchmarks and requirements within 60 days, the cable sent out over the weekend said.The cable was first reported by the Washington Post.Among the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said.Another was questionable security of that countrys passport.Some countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThe directive was part of an immigration crackdown Trump launched this year at the start of his second term, which has included the deportation to El Salvador of hundreds of Venezuelans suspected of being gang members, as well as efforts to deny enrollments of some foreign students from U.S. universities and deport others.\n\nIn an internal diplomatic cable signed by U.S. Secretary of State Marco Rubio, the State Department outlined a dozen concerns about the countries in question and sought corrective action.The Department has identified 36 countries of concern that might be recommended for full or partial suspension of entry if they do not meet established benchmarks and requirements within 60 days, the cable sent out over the weekend said.The cable was first reported by the Washington Post.Among the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said.Another was questionable security of that countrys passport.Some countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nIn an internal diplomatic cable signed by U.S. Secretary of State Marco Rubio, the State Department outlined a dozen concerns about the countries in question and sought corrective action.\n\nThe Department has identified 36 countries of concern that might be recommended for full or partial suspension of entry if they do not meet established benchmarks and requirements within 60 days, the cable sent out over the weekend said.The cable was first reported by the Washington Post.Among the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said.Another was questionable security of that countrys passport.Some countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThe Department has identified 36 countries of concern that might be recommended for full or partial suspension of entry if they do not meet established benchmarks and requirements within 60 days, the cable sent out over the weekend said.\n\nThe cable was first reported by the Washington Post.Among the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said.Another was questionable security of that countrys passport.Some countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThe cable was first reported by the Washington Post.\n\nAmong the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said.Another was questionable security of that countrys passport.Some countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nAmong the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said.\n\nAnother was questionable security of that countrys passport.Some countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nAnother was questionable security of that countrys passport.\n\nSome countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.Other reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nSome countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the U.S. visas their citizens were being granted.\n\nOther reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.The cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nOther reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or antisemitic and anti-American activity.\n\nThe cable noted that not all of these concerns pertained to every country listed.We are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThe cable noted that not all of these concerns pertained to every country listed.\n\nWe are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.The Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nWe are constantly reevaluating policies to ensure the safety of Americans and that foreign nationals follow our laws, a senior State Department official said, declining to comment on specific internal deliberations and communications.\n\nThe Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.The countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThe Department of State is committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, the official said.\n\nThe countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.That would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThe countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote DIvoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.\n\nThat would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.The entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThat would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nThe entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.During his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nThe entry of people from seven other countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  has also been partially restricted.\n\nDuring his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.Reporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nDuring his first in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.\n\nReporting by Humeyra Pamuk Editing by Bill Berkrot.\n\nReporting by Humeyra Pamuk Editing by Bill Berkrot.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/26074320/donald_trump.jpg",
            "description": "<p>By Humeyra Pamuk I Reuters U.S. President Donald Trump’s administration is considering significantly expanding its travel restrictions by potentially banning citizens of 36 additional countries from entering the United States, according to an internal State Department cable seen by Reuters. Earlier this month, the Republican president signed a proclamation that banned the entry of citizens</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-administration-weighs-adding-36-countries-including-zimbabwe-to-travel-ban-memo-says/\">Trump administration weighs adding 36 countries, including Zimbabwe, to travel ban, memo says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "16 Jun 2025"
        },
        {
            "title": "Health lobby group urges government to subsidise blood services for affordable access",
            "url": "https://www.newzimbabwe.com/health-lobby-group-urges-government-to-subsidise-blood-services-for-affordable-access/",
            "content": "By Thandiwe Garusa\n\nCOMMUNITY Working Group on Health (CWGH) has called on the government to urgently subsidise blood services and ensure affordable access for all Zimbabweans.\n\nAlthough the government claims blood is freely available in public hospitals, patients have to buy it themselves at a high cost of at least US$250 a pint which at some private institutions can go up to US$1,000.\n\nIn a statement following the recently held World Blood Donor day, the health advocacy group urged authorities to invest in sustainable national blood programmes to ensure all Zimbabweans can access affordable and essential blood products.\n\nWe urge the government to take decisive action by significantly subsidizing blood services.\n\nEvery Zimbabwean, regardless of economic status, must be able to access this essential component of healthcare.\n\nWe also call for increased investment in sustainable national blood programmes to ensure both the affordability and accessibility of blood and blood products, wrote CWGH.\n\nCurrently the National Blood Services of Zimbabwe (NBSZ) has been criticised for collecting free blood from donors whom if they need it will be sold to them at a high cost.\n\nNBSZ maintains that the money it charges is for the necessary processes involved in preparing it for safe use like testing, grouping, storage and distribution.\n\nCWGH also demanded transparency and accountability in the use of the Health Levy Fund, which was established to support public health institutions and reduce the cost of blood.\n\nThe Health Levy Fund of 5% tax on airtime and mobile data was set up to specifically subsidise the cost of blood and assist public health institutions to replace obsolete equipment and address the perennial drug shortages in our public institutions and that money should be ring-fenced and used for its intended purpose.\n\nUnfortunately, there is lack of transparency and accountability on the use of the Levy.\n\nWe call upon the government to utilise the Levy for its intended purpose in a more accountable and transparent manner.\n\nZimbabwe faces a high demand for blood transfusion due to bleeding related to pregnancy and childbirth, high road traffic accidents and other types of injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09214516/blood-donor.jpg",
            "description": "<p>By Thandiwe Garusa COMMUNITY Working Group on Health (CWGH) has called on the government to urgently subsidise blood services and ensure affordable access for all Zimbabweans. Although the government claims blood is freely available in public hospitals, patients have to buy it themselves at a high cost of at least US$250 a pint which at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/health-lobby-group-urges-government-to-subsidise-blood-services-for-affordable-access/\">Health lobby group urges government to subsidise blood services for affordable access</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "16 Jun 2025"
        },
        {
            "title": "Carlie Makarawu breaks Zimbabwe 200m sprint record, sweeps event in the 2025 NCAA Championships",
            "url": "https://www.newzimbabwe.com/carlie-makarawu-breaks-zimbabwe-200m-sprint-record-sweeps-event-in-the-2025-ncaa-championships/",
            "content": "Kentucky Kernel\n\nOn March 15, Tapiwanashe Carlie Makarawu ran a blistering 20.13 seconds in the 200m dash at the 2025 Indoor NCAA Indoor Track and Field Championships, winning the gold and tying the Zimbabwean record in the event.\n\nThree months later, the Kentucky Wildcat lined up for the event once again in the NCAA Outdoor Track and Field Championships.\n\nRacing from lane nine at Hayward Field in Eugene, Oregon, the Kentucky sprinter flew out of the blocks and surged through the curve, holding off a late charge from Zimbabwean Olympian Makanakaishe Charamba to claim the national title in 19.84 seconds.\n\nThe win came as a shock, with many unsure how Makarawu would bounce back after suffering an injury at the Tom Jones Memorial meet in April.\n\nHowever, against all odds, Makarawu cut his previous time by a mere 0.29 seconds, not only setting a personal best but also shattering the school record and the Zimbabwean national record.\n\nHe is now No. 2 in the world this year, which is tied for the ninth-fastest time in NCAA history and ranks as the seventh-fastest collegiate performer ever.\n\nIf that wasnt enough, he is now 11th all-time in Africa and owns this years national record for the event.\n\nCharamba, representing Auburn, finished close behind with a time of 19.92 seconds. The Zimbabwe sprinting duo took the top two spots on the podium.\n\nTrailing the Zimbabweans was Garrett Kaalund of USC, who broke the 20-second barrier for the first time to claim third in 19.96 seconds.\n\nJust missing the podium was a name that may sound familiar to Big Blue Nation: Jordan Anthony.The former Kentucky wide receiver and sprinter, now competing for Arkansas, finished fourth in 20.01 seconds.\n\nThe dual-sport athlete has continued both his football and track careers with the Razorbacks since transferring in 2022.\n\nTMars McCallum, the early-season world leader from Tennessee, finished fifth in 20.16 seconds.\n\nUSCs Max Thomas followed in sixth with 20.23, Xavier Butler of Texas ran 20.39 to place seventh and Abdul-Rasheed Saminu of South Florida rounded out the heat in 20.55 seconds.\n\nAfter successfully sweeping the event in Nationals this year, he added 10 points to the team total.\n\nMakarawu helped Kentucky finish tied for eighth in the team standings with 22 total points.\n\nThe Harare native will now set his sights on the 2025 World Championships in Tokyo this September, where he will represent his native country alongside some of the NCAAs best to compete against the best athletes the sport has ever seen.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/15174510/makarawu.jpg",
            "description": "<p>Kentucky Kernel On March 15, Tapiwanashe “Carlie” Makarawu ran a blistering 20.13 seconds in the 200m dash at the 2025 Indoor NCAA Indoor Track and Field Championships, winning the gold and tying the Zimbabwean record in the event. Three months later, the Kentucky Wildcat lined up for the event once again in the NCAA Outdoor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/carlie-makarawu-breaks-zimbabwe-200m-sprint-record-sweeps-event-in-the-2025-ncaa-championships/\">Carlie Makarawu breaks Zimbabwe 200m sprint record, sweeps event in the 2025 NCAA Championships</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "16 Jun 2025"
        },
        {
            "title": "Ndiraya salutes Kwekwe United despite Scottland FC’s 1-0 win",
            "url": "https://www.newzimbabwe.com/ndiraya-salutes-kwekwe-united-despite-scottland-fcs-1-0-win/",
            "content": "By Sports Reporter\n\nTYMON Machopes first half strike was all Scottland needed to register a 1-0 win against Kwekwe United at Rufaro Stadium at the weekend.\n\nThe victory saw Tonderai Ndirayas side bouncing back to winning ways after suffering a 1-0 defeat to MWOS a fortnight ago.Scottland could have scored a minimum of three goals in Sundays game but youngster Tadiwanashe Chakuchichi failed to bury two clear chances that were created for him.Besides Chakuchichi, substitute Nathan Mutasa had a final minute clear opportunity after benefitting from Khama Billiats brilliant through pass in the box only for him to directly fire in the goalkeepers hands.In a post match interview, Scottland FC coach Tonderai Ndiraya praised his counterparts for giving them a competitive game.I think it was a very competitive game, I must admit that the new coaches at Kwekwe (United) are doing a very good job.Its a very different team from the one that I watched before, good work from coach Paul Chimalezeni and his backroom staff.We started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said NdirayaScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nThe victory saw Tonderai Ndirayas side bouncing back to winning ways after suffering a 1-0 defeat to MWOS a fortnight ago.\n\nScottland could have scored a minimum of three goals in Sundays game but youngster Tadiwanashe Chakuchichi failed to bury two clear chances that were created for him.Besides Chakuchichi, substitute Nathan Mutasa had a final minute clear opportunity after benefitting from Khama Billiats brilliant through pass in the box only for him to directly fire in the goalkeepers hands.In a post match interview, Scottland FC coach Tonderai Ndiraya praised his counterparts for giving them a competitive game.I think it was a very competitive game, I must admit that the new coaches at Kwekwe (United) are doing a very good job.Its a very different team from the one that I watched before, good work from coach Paul Chimalezeni and his backroom staff.We started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said NdirayaScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nScottland could have scored a minimum of three goals in Sundays game but youngster Tadiwanashe Chakuchichi failed to bury two clear chances that were created for him.\n\nBesides Chakuchichi, substitute Nathan Mutasa had a final minute clear opportunity after benefitting from Khama Billiats brilliant through pass in the box only for him to directly fire in the goalkeepers hands.In a post match interview, Scottland FC coach Tonderai Ndiraya praised his counterparts for giving them a competitive game.I think it was a very competitive game, I must admit that the new coaches at Kwekwe (United) are doing a very good job.Its a very different team from the one that I watched before, good work from coach Paul Chimalezeni and his backroom staff.We started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said NdirayaScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nBesides Chakuchichi, substitute Nathan Mutasa had a final minute clear opportunity after benefitting from Khama Billiats brilliant through pass in the box only for him to directly fire in the goalkeepers hands.\n\nIn a post match interview, Scottland FC coach Tonderai Ndiraya praised his counterparts for giving them a competitive game.I think it was a very competitive game, I must admit that the new coaches at Kwekwe (United) are doing a very good job.Its a very different team from the one that I watched before, good work from coach Paul Chimalezeni and his backroom staff.We started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said NdirayaScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nIn a post match interview, Scottland FC coach Tonderai Ndiraya praised his counterparts for giving them a competitive game.\n\nI think it was a very competitive game, I must admit that the new coaches at Kwekwe (United) are doing a very good job.Its a very different team from the one that I watched before, good work from coach Paul Chimalezeni and his backroom staff.We started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said NdirayaScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nI think it was a very competitive game, I must admit that the new coaches at Kwekwe (United) are doing a very good job.\n\nIts a very different team from the one that I watched before, good work from coach Paul Chimalezeni and his backroom staff.We started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said NdirayaScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nIts a very different team from the one that I watched before, good work from coach Paul Chimalezeni and his backroom staff.\n\nWe started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said NdirayaScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nWe started very well in the early moments of the game until we scored that goal, we then took a backseat and allowed Kwekwe to come back into the game. But still it was a very good game, said Ndiraya\n\nScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.Meanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nScottland is now on 26 points, five points behind log leaders MWOS, who are now on 31 points after salvaging a 2-2 draw at Gibbo Stadium against Triangle.\n\nMeanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.I am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nMeanwhile, Kwekwe United coach Paul Chimalizeni saluted his boys for the performance despite losing 1-0.\n\nI am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.I hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nI am happy with the guys, they played very well. Given the quality of players I have, they are inexperienced and looking at how they played against Scottland, l am pleased.\n\nI hope we will take it from here and improve going forward, he said.Kwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nI hope we will take it from here and improve going forward, he said.\n\nKwekwe United remains bottom on the log with eight points after 15 games.The league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nKwekwe United remains bottom on the log with eight points after 15 games.\n\nThe league debutants have only won one match this season and remain a favourite candidate for relegation.Matchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nThe league debutants have only won one match this season and remain a favourite candidate for relegation.\n\nMatchday 15 resultsScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nMatchday 15 results\n\nScottland 1-0 Kwekwe UnitedHighlanders 2-3 Simba BhoraTriangle United 2-2 MWOSScottland 1-0 Kwekwe UnitedGreen Fuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaBikita 1-1 DynamosYadah 1-0 HerentalsCAPS United 1-0 Chicken InnNgexi Platinum 1-1 Manica Diamonds.\n\nScottland 1-0 Kwekwe United\n\nHighlanders 2-3 Simba Bhora\n\nTriangle United 2-2 MWOS\n\nScottland 1-0 Kwekwe United\n\nGreen Fuel 0-1 Tel One\n\nFC Platinum 4-0 ZPC Kariba\n\nBikita 1-1 Dynamos\n\nYadah 1-0 Herentals\n\nCAPS United 1-0 Chicken Inn\n\nNgexi Platinum 1-1 Manica Diamonds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/20055726/Dynamos-coach-Tonderai-Ndiraya.jpg",
            "description": "<p>By Sports Reporter TYMON Machope’s first half strike was all Scottland needed to register a 1-0 win against Kwekwe United at Rufaro Stadium at the weekend. The victory saw Tonderai Ndiraya’s side bouncing back to winning ways after suffering a 1-0 defeat to MWOS a fortnight ago. Scottland could have scored a minimum of three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ndiraya-salutes-kwekwe-united-despite-scottland-fcs-1-0-win/\">Ndiraya salutes Kwekwe United despite Scottland FC’s 1-0 win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "16 Jun 2025"
        }
    ]
}