{
    "news": [
        {
            "title": "Govt footing Geo Pomona refuse collection bill, not council –  Harare Mayor Mafume says",
            "url": "https://www.newzimbabwe.com/govt-footing-geo-pomona-refuse-collection-bill-not-council-harare-mayor-mafume-says/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor, Jacob Mafume, has said the City Council is not remitting funds to Geo Pomona, despite the company taking over the municipalitys refuse collection mandate under controversial circumstances.\n\nGeo Pomona Waste Management is now responsible for garbage collection in Harare under a deal spearheaded by the Ministry of Local Government and Public Works.\n\nAccording to the initial agreement, the City Council was to pay US$40 per tonne to Geo Pomona for waste disposal, raising questions about the usurping of municipal functions by a private company.\n\nHowever, Mafume has disclosed that the local authority is not paying Geo Pomona, with the government instead footing the costs of refuse collection in Harare.\n\nThe City is not paying anything to Geo Pomona. It has not paid anything. The government is the one that is paying. The issue is, I manage the City, and the City is not paying, and my mandate, as we speak, is to manage City affairs, said Mafume.\n\nThe takeover of refuse collection has drawn criticism towards the Harare City Council, which residents accuse of privatising public services, thereby shifting the payment burden onto them.\n\nMafume, who was once opposed to private partnerships but now appears to be warming up to the idea, is actively seeking organisations or individuals to partner with, as the City Council struggles to fulfil its mandate in Harare.\n\nThe HCC has failed to construct and maintain existing infrastructure, leaving it in a state of dilapidation.\n\nHowever, questions have been raised about the councils sincerity in pursuing public-private partnerships, particularly after a fallout last year with Roadport Private Limited, which nearly led to the company being barred from operating long-distance bus terminals.\n\nMafume attempted to downplay the incident as he embarks on a charm offensive to woo potential partners.\n\nWhen you have a dispute with your partner, it does not mean your marriage is not producing fruits. A Roadport was built and is used by thousands of Harare residents. So, if we have a dispute on one or two issues, it does not mean that everything is lost.\n\nThere is a tendency to highlight the problems you would have faced in an agreement while ignoring everything that has been beneficial, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10172141/geo-pomona.png",
            "description": "<p>By Darlington Gatsi HARARE Mayor, Jacob Mafume, has said the City Council is not remitting funds to Geo Pomona, despite the company taking over the municipality’s refuse collection mandate under controversial circumstances. Geo Pomona Waste Management is now responsible for garbage collection in Harare under a deal spearheaded by the Ministry of Local Government and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-footing-geo-pomona-refuse-collection-bill-not-council-harare-mayor-mafume-says/\">Govt footing Geo Pomona refuse collection bill, not council –  Harare Mayor Mafume says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:26",
            "date": "11 Jul 2025"
        },
        {
            "title": "CZI commends easing ZWG inflation rates",
            "url": "https://www.newzimbabwe.com/czi-commends-easing-zwg-inflation-rates/",
            "content": "By Alois Vinga\n\nTHE Confederation of Zimbabwe Industries (CZI) says easing ZWG rates are indicative of the local currencys economic stabilising effect.\n\nThe ZiG month-on-month inflation slightly decreased to settle at 0.3% in the month of June 2025 from 0.9% recorded in the month of May 2025.\n\nThe prolonged period of inflation at rates below 1% since February 2025 generally reflect a ZiG price stabilising economy. In addition, this may also indicate success of monetary policy in restoring price discipline as compared to past experiences with the Zimbabwean dollar (ZWL), said CZI.\n\nThe industry lobby group said the low levels of inflation will help build trust in the currency, which might also encourage greater usage of ZiG in transactions and could also boost the likelihood of a gradual de-dollarisation process leading to a ZiG mono currency regime by 2030.\n\nThe ZiG year-on-year inflation rate slightly increased to settle at 92.5% in the month of June 2025 (Figure 2), gaining 0.4 percentage points from a rate of 92.1% recorded in May 2025. While the month-on-month inflation is showing that inflation is currently under control, the high annual inflation rate reflects historical price instability legacies whose effects are still at play, said CZI.\n\nThe industry lobby group said the high annual inflation level creates pricing uncertainty, making it difficult for businesses to set prices, forecast costs, or even to negotiate contracts.\n\nTherefore, sustaining month-on-month inflation at the current low rates is crucial for eliminating this high annual inflation, which is expected to only start falling in October 2025. Only then will restoring confidence in the ZiG, protecting real incomes, and supporting sustainable economic recovery become more realistic, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>By Alois Vinga THE Confederation of Zimbabwe Industries (CZI) says easing ZWG rates are indicative of the local currency’s economic stabilising effect. The ZiG month-on-month inflation slightly decreased to settle at 0.3% in the month of June 2025 from 0.9% recorded in the month of May 2025. “The prolonged period of inflation at rates below</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/czi-commends-easing-zwg-inflation-rates/\">CZI commends easing ZWG inflation rates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:26",
            "date": "11 Jul 2025"
        },
        {
            "title": "Zimbabwe undertakes second Joint External Evaluation to strengthen National Health Security",
            "url": "https://www.newzimbabwe.com/zimbabwe-undertakes-second-joint-external-evaluation-to-strengthen-national-health-security/",
            "content": "UNICEF\n\nFrom 29 June to 4 July 2025, Zimbabwe conducted its second Joint External Evaluation (JEE) to assess the countrys capacity to prevent, detect, and respond to public health threats under the International Health Regulations (2005). The JEE, coordinated by the Ministry of Health and Child Care (MoHCC) with support from WHO and partners, marks a critical milestone in strengthening Zimbabwes public health emergency preparedness and response systems.\n\nThe JEE is a voluntary, collaborative process used globally to assess a countrys readiness to manage infectious disease outbreaks and other health emergencies. It is conducted every five years, with the countrys first evaluation completed in 2018.\n\nThe JEE gives us a structured opportunity to check how ready we are to detect and respond to public health threats and we thank all the partners who have made this possible, said Dr Wenceslaus Nyamayaro, MoHCC Acting Chief Director, Public Health.\n\nThe internal self-assessment, the first phase of the JEE, was completed in July 2025 with over 100 participants from across sectors including health, environment, veterinary services, defense, disaster management, civil society, and development partners including WHO, UNICEF, FAO, Africa CDC and others. This participatory process assessed 19 technical areas ranging from biosafety and surveillance to legislation and points of entry.\n\nKey areas that emerged as requiring urgent attention include outdated or poorly implemented legal instruments, coupled with limited availability of legal support at subnational levels. Gender equity in emergencies remains a concern, with notable gaps in funding for gender-based violence (GBV) prevention and response, as well as low representation of women in emergency preparedness and decision-making processes. Funding for emergency response activities was also highlighted as inadequate.Surveillance systems for foodborne illnesses and healthcare-associated infections (HAIs) are still fragmented, highlighting the need for stronger cross-sector coordination. Coordination between the human, animal and environmental health sectors is still weak, showing the need to improve how these groups work together. Biosafety and biosecurity capacities also require strengthening, particularly in terms of laboratory infrastructure and staff training. Additionally, readiness at points of entry remains limited, with gaps in the ability to detect and respond to public health threats at borders and airports.\n\nZimbabwe also assessed its progress in tackling antimicrobial resistance (AMR), a growing global threat. While the country has developed a robust One Health AMR National Action Plan and established 14 multisectoral surveillance sites, challenges remain in laboratory capacity, integration of data systems and containment of multidrug-resistant organisms (MDROs).\n\nThe next phase of the JEE will involve an external validation mission scheduled for 613 September 2025. A team of international subject matter experts, coordinated by WHOs Regional Office for Africa, will work with technical teams in Zimbabwe to validate scores, review documentation and conduct site visits to key health facilities including laboratories and points of entry. Following the mission, Zimbabwe will develop or update its National Action Plan for Health Security (NAPHS). This plan will consolidate findings from the JEE, past outbreak reviews, and risk assessments to guide future investments and reforms in public health preparedness.\n\nThe evaluation is about continuous improvement. It reflects Zimbabwes commitment to protect the health of its people through stronger systems, better data, and broader collaboration, said Dr. Desta Tiruneh, WHO Representative to Zimbabwe.\n\nThe evaluation was made possible with funding from the Health Resilience Fund (HRF) through WHO, with additional support mobilised by MoHCC from Africa CDC and UNICEF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10163709/WHO-100.jpeg",
            "description": "<p>UNICEF From 29 June to 4 July 2025, Zimbabwe conducted its second Joint External Evaluation (JEE) to assess the country’s capacity to prevent, detect, and respond to public health threats under the International Health Regulations (2005). The JEE, coordinated by the Ministry of Health and Child Care (MoHCC) with support from WHO and partners, marks</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-undertakes-second-joint-external-evaluation-to-strengthen-national-health-security/\">Zimbabwe undertakes second Joint External Evaluation to strengthen National Health Security</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:26",
            "date": "11 Jul 2025"
        },
        {
            "title": "No Covid-19 variants in Zimbabwe – govt says",
            "url": "https://www.newzimbabwe.com/no-covid-19-variants-in-zimbabwe-govt-says/",
            "content": "By Anna Chibamu\n\nThe government has dismissed reports of any Covid-19 variants currently circulating in Zimbabwe.\n\nSpeaking during a Question and Answer session in Parliament on Wednesday, Deputy Minister of Health and Child Care, Sleiman Timios Kwidini said the deadly variants being reported in other countries had not yet been detected locally.\n\nThe country is currently battling a viral infection outbreak that authorities havesaid is just an ordinary flu bug.\n\nMashonaland West proportional representation MP Mutsa Murombedzi posed a question to Kwidini regarding Zimbabwes situation on the suspected outbreak of a Covid 19 deadly strain reported in other countries.\n\nThe whole world is preparing for another threatening variant COVID. What has the government put in place to curb the spread of this virus? Murombedzi said.\n\nWe are aware that COVID comes with different variants but at the moment, the variants that are being found in other countries have not yet been found in Zimbabwe.\n\nHowever, the government is actively working to prevent the spread of the virus and has acquired additional test kits to enhance detection capabilities, building on previous experiences with testing for variants like Omicron.\n\nWe anticipate receiving some new medicines that are going to be used to cure this virus, Kwidini said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/09152417/covid-19-test-e1641884205477.jpg",
            "description": "<p>By Anna Chibamu The government has dismissed reports of any Covid-19 variants currently circulating in Zimbabwe. Speaking during a Question and Answer session in Parliament on Wednesday, Deputy Minister of Health and Child Care, Sleiman Timios Kwidini said the deadly variants being reported in other countries had not yet been detected locally. The country is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-covid-19-variants-in-zimbabwe-govt-says/\">No Covid-19 variants in Zimbabwe – govt says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:26",
            "date": "11 Jul 2025"
        },
        {
            "title": "U.S Embassy orders visa applicants to make social media accounts public",
            "url": "https://www.newzimbabwe.com/u-s-embassy-orders-visa-applicants-to-make-social-media-accounts-public/",
            "content": "By Thandiwe Garusa\n\nTHE United States (U.S) Embassy in Harare has issued a fresh directive to all individuals applying for the F, M, and J nonimmigrant visas, mandating that applicants adjust the privacy settings of their personal social media accounts to public.\n\nF, M, and J, non-immigrant visas, allow foreign nationals to enter the U.S. for academic study, vocational training, or cultural and educational exchange programs, respectively.\n\nThe announcement was made in a statement posted on the embassys official social media accounts on Thursday.\n\nEvery visa adjudication is a national security decision.\n\nEffective immediately, all individuals applying for an F, M, or J non-immigrant visa are requested to adjust the privacy settings on all of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility to the United States, the statement reads.\n\nThis revised screening policy is part of wider U.S. measures to protect national interests and ensure that visa holders comply with the permitted activities under their non-immigrant status.\n\nEarlier this month, the Embassy also warned against using visas to give birth in the U.S. for citizenship purposes and said that consular officers will deny applications if they suspect such intent.\n\nThe Embassy also added that visa misuse can lead to denial or future bans, especially if public funds are involved.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/06020401/US-Embassy-Harare.png",
            "description": "<p>By Thandiwe Garusa THE United States (U.S) Embassy in Harare has issued a fresh directive to all individuals applying for the F, M, and J nonimmigrant visas, mandating that applicants adjust the privacy settings of their personal social media accounts to “public”. F, M, and J, non-immigrant visas, allow foreign nationals to enter the U.S.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-embassy-orders-visa-applicants-to-make-social-media-accounts-public/\">U.S Embassy orders visa applicants to make social media accounts public</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:26",
            "date": "11 Jul 2025"
        },
        {
            "title": "President Mnangagwa donates US$100,000 towards Sables’ bid to defend Rugby Africa Cup title",
            "url": "https://www.newzimbabwe.com/president-mnangagwa-donates-us100000-towards-sables-bid-to-defend-rugby-africa-cup-title/",
            "content": "By James Muonwa\n\nPRESIDENT Emmerson Mnangagwa has donated US$100,000 to the senior mens rugby team, the Sables, bid to defend their title atthe ongoing Rugby Africa Cup tournament.\n\nThe Sables were invited to State House on Thursday evening, where Mnangagwa presented themoneyto aid the teams campaign in the tourney, while challenging the team to conquer at the tournament and beyond.\n\nI want to congratulate you, the Sables, for the victory against Morocco. The achievement is pivotal as we embark on our journey to reposition and refocus our sporting delivery systems on the critical path of an excelling sporting nation that Zimbabwe is becoming, said Mnangagwa.\n\nYour participation in the international arena, as the Sables, automatically makes you brand ambassadors of Zimbabwe. I, therefore, challenge you to utilise this role as sports diplomats to promote our countrys imagine, our tourism and investment prospects under our engagement and re-engagement policy.\n\nBe assured that our nation is behind you. Government will continue to support you, and l, your President, am confident of your dedication and sporting capabilities\n\nAs you embark on your journey to qualify for the World Cup, may your resurgence yield great success for our country. Go out there and make Zimbabwe proud, Mnangagwa told the guests.\n\nSpeaking to journalists after the event, Zimbabwe Rugby Union (ZRU) Chief Executive Officer Sifiso Made noted that Mnangagwas gesture came as a surprise, but was well-timed to incentivise the players to retain the trophy and proceed to the prestigious World Rugby Jamboree.\n\nZimbabwe are the current holder of the Africa Rugby Cup trophy, which they are defending in the ongoing 2025 tournament scheduled from the 8th to 19th of July in Uganda.\n\nThe Zimbabwe Sables have secured a spot in the semi-finals of the Rugby Africa Cup, following a dominant 43-8 victory over Morocco in the quarter-final match held in Uganda. They will now face Kenya in the semi-final this coming Sunday.\n\nThe winner of the Rugby Africa Cup will earn Africas sole ticket to the 2027 World Cup to be held in Australia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10204235/IMG-20250710-WA0069.jpg",
            "description": "<p>By James Muonwa PRESIDENT Emmerson Mnangagwa has donated US$100,000 to the senior men’s rugby team, the Sables, bid to defend their title at the ongoing Rugby Africa Cup tournament. The Sables were invited to State House on Thursday evening, where Mnangagwa presented the money to aid the team’s campaign in the tourney, while challenging the team to conquer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-mnangagwa-donates-us100000-towards-sables-bid-to-defend-rugby-africa-cup-title/\">President Mnangagwa donates US$100,000 towards Sables’ bid to defend Rugby Africa Cup title </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:26",
            "date": "11 Jul 2025"
        }
    ]
}