{
    "news": [
        {
            "title": "Men jailed for witchcraft murder plot against Zambia’s president",
            "url": "https://www.newzimbabwe.com/men-jailed-for-witchcraft-murder-plot-against-zambias-president/",
            "content": "BBC\n\nA court in Zambia has sentenced two men to two years in prison for attempting to use witchcraft to kill President Hakainde Hichilema.\n\nZambian Leonard Phiri and Mozambican Jasten Mabulesse Candunde were convicted under the Witchcraft Act after being arrested in December with charms in their possession, including a live chameleon.\n\nIt is my considered view that the convicts were not only the enemy of the head of state but were also enemies of all Zambians, magistrate Fine Mayambu said in his ruling.\n\nThe case has been closely followed in Zambia, as this was the first time anyone was put on trial for attempting to use witchcraft against a president.\n\nThe prosecution alleged that Phiri and Candunde were hired by a fugitive former MP to bewitch Hichilema.\n\nDespite their insistence that they were bona fide traditional healers, the court found them guilty on two counts under the Witchcraft Act.\n\nThe two accepted ownership of the charms. Phiri further demonstrated that the chameleons tail, once pricked and used in the ritual, would cause death to occur within five days, Magistrate Mayambu said.\n\nThe lawyer for the two men, Agrippa Malando, said his clients pleaded for leniency as they were first-time offenders.\n\nHe urged the court to fine them, but the request was rejected.\n\nMagistrate Mayambu noted that many people in Zambia, like in other African countries, believed in witchcraft, even though it was not scientifically proven.\n\nThe law was designed to protect society from fear and harm caused by those claiming to have the power to carry out acts of witchcraft, he said.\n\nThe question is not whether the accused are wizards or actually possess supernatural powers. It is whether they represented themselves as such, and the evidence clearly shows they did, Magistrate Mayambu said.\n\nIn addition to the two-year sentence they were given for professing witchcraft, the men were sentenced to six months in prison for possessing charms.\n\nAs the sentences will run concurrently, they will serve only two years in prison, effective from the date of their arrest in December 2024.\n\nHichilema has previously said he does not believe in witchcraft. He has not commented on the case.\n\nLawyer Dickson Jere told the BBC that the Witchcraft Act was passed during colonial rule in 1914.\n\nHe said people were very rarely prosecuted for practising witchcraft, but it helped protect elderly women who faced mob justice in villages after being accused of bewitching someone and causing their death.\n\nWitchcraft has also featured prominently in conversations over the protracted dispute between the government and the family of the late President Edgar Lungu over his funeral.\n\nSome people believe that the governments insistence that he should be buried in Zambia, contrary to his familys wishes, may be for occult reasons.\n\nThe government has denied the accusation.\n\nLungu died in South Africa in June, and his body is still in a morgue there because of the failure to reach agreement over his burial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/30203305/licensed-image-3.jpeg",
            "description": "<p>BBC A court in Zambia has sentenced two men to two years in prison for attempting to use witchcraft to kill President Hakainde Hichilema. Zambian Leonard Phiri and Mozambican Jasten Mabulesse Candunde were convicted under the Witchcraft Act after being arrested in December with charms in their possession, including a live chameleon. “It is my</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/men-jailed-for-witchcraft-murder-plot-against-zambias-president/\">Men jailed for witchcraft murder plot against Zambia’s president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Sep 2025"
        },
        {
            "title": "Fuel better, run better: What to consume before, during and after your run",
            "url": "https://www.newzimbabwe.com/fuel-better-run-better-what-to-consume-before-during-and-after-your-run/",
            "content": "UAB News\n\nPeople are running. Running to exercise. Running to socialize. Running to achieve personal goals with every mile completed.\n\nWhen all one needs is a good pair of shoes, running seems like an easy activity to start. However, running requires preparation and training, both physically and mentally.\n\nAn avid runner herself, Camille Worthington, Ph.D., assistant professor and registered dietitian in theUniversity of Alabama at BirminghamDivision of General Internal Medicine and Population Science,discusses an important aspect to ones running success  how to fuel the body.\n\nWhen fueling your body, it is easy to fall behind and hard to catch up, Worthington said. However, proper fueling before, during and after a run is essential to hitting your goals while keeping your body safe and healthy.\n\nProper fueling before, during and after running is essential to hitting goals and keeping your body safe and healthy.\n\nKnow your fuels\n\nComplex carbohydrates have slow digestion and absorption rates. They are a good source for sustained energy, which is needed for longer runs. Complex carbs include whole wheat breads, whole grain crackers and vegetables.\n\nSimple carbs are quickly digested and absorbed. They are sources of quick but short-term energy, which is beneficial during runs when one needs an energy boost. Simple carbs include pasta, white bread, chips, cookies and candy.\n\nProtein offers many benefits for the body. For runners, it plays a crucial role in muscle recovery and helps reduce hunger. Proteins include lean meats, dairy products, eggs, yogurt and nuts.\n\nElectrolytes, such as sodium,help maintain fluid and hydration levels in the body. Electrolytes are lost through sweat during exercise. Low levels can lead to muscle cramps, dehydration and dizziness. Electrolytes are naturally found in such foods as leafy greens, avocados, pickles, nuts and bananas.\n\nProducts such as gels, gummies, water, electrolyte packets, bars and salt tabs are popular fuel sources for runners. They often contain higher concentrations of carbs and electrolytes, such as sodium.\n\nTime it out\n\nProperly timing the intake of the fuels is as important as knowing what fuels to consume, Worthington says.\n\nFuel recommendations prior to a run depend on when one wants to eat. If you eat several hours before, focus on a mix of complex and simple carbs to increase different types of energy within the body. If you prefer eating closer to the run, prioritize simple carbs the body can quickly digest.\n\nStay hydrated with water before the run. For runs longer than an hour or in hot weather, preload with electrolytes.\n\nDuring a run, focus on simple carbs for bursts of energy. Complex carbs during a run can lead to sluggishness and gastrointestinal issues due to their slow digestion rate. Maintaining hydration levels with water, electrolytes and sodium is also a priority.\n\nStay hydrated with water before the run.\n\nFor runs longer than an hour or in hot weather, preload with electrolytes.After a run, mix complex carbs with protein. The carbs restore glucose stores in your liver and muscles that were used during your run. Protein helps with muscle recovery and can satiate hunger. Replenish hydration levels with electrolytes and water.\n\nWorthington suggests post-run snacks such as:\n\nUltimately, the perfect fuel routine comes down to the runners preference. When experimenting, Worthington suggests changing only one fuel source at a time to understand what specific foods and products work best with ones body.\n\nIt is a lot of trial and error. Worry less about the specific product, and more about the fuel source and ingredients, Worthington said. Find what you like, what makes sense for your body and training, and what works best for your budget.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16051346/run.jpg",
            "description": "<p>UAB News People are running. Running to exercise. Running to socialize. Running to achieve personal goals with every mile completed. When all one needs is a good pair of shoes, running seems like an easy activity to start. However, running requires preparation and training, both physically and mentally. An avid runner herself, Camille Worthington, Ph.D.,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fuel-better-run-better-what-to-consume-before-during-and-after-your-run/\">Fuel better, run better: What to consume before, during and after your run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Sep 2025"
        },
        {
            "title": "Tanganda Tea posts 65% revenue growth in third quarter despite decline in export volumes",
            "url": "https://www.newzimbabwe.com/tanganda-tea-posts-65-revenue-growth-in-third-quarter-despite-decline-in-export-volumes/",
            "content": "By Alois Vinga\n\nTanganda Tea Company Limited has reported a 65% surge in revenue for the third quarter ended June 30, 2025, though the company continues to grapple with lower export volumes, adverse weather conditions, and exchange rate disparities.\n\nRevenue for the quarter stood at US$5.6 million, up from US$3.4 million recorded during the same period last year. However, cumulative earnings for the nine months to June 2025 fell 6% to US$13.7 million, compared to US$14.5 million in 2024.\n\nThe company attributed the quarterly growth to improved pricing but warned that inconsistent rainfall patterns and persistent currency volatility remain a drag on overall performance.\n\nDuring the period, bulk tea production fell 6% to 6,826 tonnes, down from 7,293 tonnes last year, largely due to late rains. Export volumes declined by 19% to 3,646 tonnes. In contrast, packed tea and coffee sales volumes rose 11% during the quarter, although they were 8% lower than last years total of 1,310 tonnes.\n\nAvocado output dropped 47% to 2,121 tonnes from 3,976 tonnes, following a November 2024 hailstorm and the biennial bearing effect. Macadamia nut harvests also decreased 43% to 849 tonnes due to extreme heat during the nut-set period, though exports of 520 tonnes were 5% higher than the previous year.\n\nThe company said the operating environment remained relatively stable, supported by exchange rate liberalisation, but noted ongoing challenges including weak demand in the formal retail sector, tight liquidity, and intermittent power supply.\n\nManagement confirmed plans to raise US$8 million through a Rights offer to support operations. Future performance, it added, will depend on exchange rate stability, policy coordination, and cost management.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15182653/tanganda-tea-scaled.jpg",
            "description": "<p>By Alois Vinga Tanganda Tea Company Limited has reported a 65% surge in revenue for the third quarter ended June 30, 2025, though the company continues to grapple with lower export volumes, adverse weather conditions, and exchange rate disparities. Revenue for the quarter stood at US$5.6 million, up from US$3.4 million recorded during the same</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanganda-tea-posts-65-revenue-growth-in-third-quarter-despite-decline-in-export-volumes/\">Tanganda Tea posts 65% revenue growth in third quarter despite decline in export volumes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Sep 2025"
        },
        {
            "title": "US cuts leave Zimbabwe sex workers scrambling for alternatives",
            "url": "https://www.newzimbabwe.com/us-cuts-leave-zimbabwe-sex-workers-scrambling-for-alternatives/",
            "content": "AFP\n\nThis was the work station for the women, who say their trade turned perilous after US President Donald Trump abruptly cut foreign health aid earlier this year.\n\nOne of them, Sharon Mukakanhanga, reached into her bag and pulled out a pair of baby socks she used when there was nothing else between her and risk.\n\nThese little socks served as condoms when I became so desperate after the American government withdrew its support from my all-time go-to safe haven, the 43-year-old told AFP, referring to her preferred clinic.\n\nMukakanhanga is among thousands of sex workers in Zimbabwe who have struggled to access HIV prevention tools since the US cuts gutted centres that once provided free condoms, antiretrovirals and basic care.\n\nFor nearly two decades, the US programmes including PEPFAR, the worlds largest HIV initiative, formed a critical safety net for Zimbabwes fragile health system.\n\nThe first half of 2025 has seen 5,932 AIDS-related deaths, a rise from 5,712 in the same period last year, according to official government figures.\n\nThe impact of the withdrawals was immediate, said 47-year-old HIV-positive sex worker Cecilia Ruzvidzo.\n\nIt was a very difficult period. I literally lost my mind, said the mother of four who has been in the trade for nearly two decades.\n\nShe recalled leaving her most recent visit to the clinic with only 10 days worth of antiretrovirals.\n\nI could not get condoms, which are a necessity for my work. I was at risk of contracting more infections. My clients were also exposed, she said quickly.\n\nWith US-funded facilities shuttered or empty, the few remaining providers say they are buckling under the pressure.\n\nMedical charity Doctors Without Borders (MSF), which operates independently of US government funding, said its clinics in Harare suburbs like Epworth and Mbare were stretched thin.\n\nThey dont know where to go. They dont know where to seek services, said project lead Charlotte Pignon, referring to patients and especially sex workers.\n\nWhile she did not directly link the rising deaths to the funding cuts, she said the impact of the withdrawal could not be ignored.\n\nIt is difficult to know all the factors that are impacting those numbers but its impossible to say that its not impacted by the US cuts either, she said.\n\nThe scale of the fallout was still coming into focus, said Wonder Mufunda, chief executive of the Harare-headquartered think-tank Centre for Humanitarian Analytics (CHA).\n\nMufunda said US support had previously amounted to about $522 million, with roughly $90 million directed to HIV programmes.\n\nYou wake up and you have lost such funding, there were serious disruptions, he said, warning that deaths could rise.\n\nIts quite a big blow we are talking about, he told AFP.\n\nBeyond overstretched clinics, Zimbabwes economic freefall is pushing more people into sex work with an estimated 40,500 women already engaged in sex work nationwide, according to CHA.\n\nCompetition had eroded the power to insist on safer sex, said 20-year-old Cleopatra Katsande. Some workers were charging as little as 50 US cents per client, far less than the cost of a box of condoms, she said.\n\nFor veteran Ruzvidzo, there was no real choice.\n\nWe knew it wasnt safe, she said of using baby socks as condoms. But I had to feed my children.\n\nThe clients did not seem to mind, she said. When it comes to this moment, men dont think straight.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15133232/Zimbabwes-economic-freefall-is-pushing-more-people-into-sex-work-%C2%A9-Jekesai-NJIKIZANA-AFP-1.png",
            "description": "<p>AFP This was the work station for the women, who say their trade turned perilous after US President Donald Trump abruptly cut foreign health aid earlier this year. One of them, Sharon Mukakanhanga, reached into her bag and pulled out a pair of baby socks she used when there was nothing else between her and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-cuts-leave-zimbabwe-sex-workers-scrambling-for-alternatives/\">US cuts leave Zimbabwe sex workers scrambling for alternatives</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Sep 2025"
        },
        {
            "title": "Northamptonshire family move 5,000 miles to Zimbabwe and say they now have a better standard of living",
            "url": "https://www.newzimbabwe.com/northamptonshire-family-move-5000-miles-to-zimbabwe-and-say-they-now-have-a-better-standard-of-living/",
            "content": "Northampton Chronicle\n\nANorthamptonshirefamilyworking to survive in the UK say they now have a better standard of living after moving 5,000 miles toZimbabwe.\n\nNatalie Furk, 35, and her husband, James, 37, made the move to live in James childhood home in March 2024 after they felt their work life balance was off.\n\nJames had a full-time job in the automotive industry and Natalies bakerybusinesshad taken off well over thepandemicbut it left her working 18 hours every day.\n\nThey decided to make the leap and move to southernAfrica selling their four-bed house in Ringstead,Northamptonshirefor 500k in December 2023.\n\nThe couple  who have two children, Isabella, nine, and Harvey, seven  sent the rest of their belongings over in a 40ft shipping container for 8k and have now settled in to life in Harare, Zimbabwe.\n\nThe children now attend privateschoolfor 8,750 each per year.\n\nThey have sent one of their maids on a cookery course and she now cooks most of their meals.\n\nNatalie, a content creator, originally fromLeicester,Leicestershire, said: With James job and my business it was just so busy and we had no time with the kids.\n\nAll we were doing was surviving.\n\nDue to bills, a high mortgage and electricity at the end of the month we had nothing.\n\nLike a lot of people in the UK it was just a rat race and we were working to survive.\n\nI just knew if we moved to Zimbabwe everything would change.\n\nWe just got home one day from the unit where I worked  it had been a stressful day  and I just looked across at my husband and said what are we doing?\n\nI love theweatherits a top thing about living here.\n\nEverything here is organic here its so fresh.\n\nI love that we have so much free time because we have staff, it allows me to spend more time with the kids  its amazing.\n\nThe family have moved into a home owned by James mum, Lynn, 67, and have built an annex adjoining the building where she now stays.\n\nJames works remotely in the same job he had in the UK and only has to travel back four times per year.\n\nWith water bills USD $27.11 per month (20) and all the electricity powered by solar panels, Natalie says they pay just 90 altogether for utilities.\n\nIn the UK, water alone was costing the family 70 per month.\n\nHealthcarecalled medical aid is USD $620 (457.33) per month for the entire family, which Natalie says is really good  claiming its a much quicker treatment process than in the UK.\n\nWe said if we dont try we wont ever know or regret not trying, Natalie said.\n\nIn the UK kids grow up quickly and with social media theres a pressure to look a certain way or use certain products.\n\nOver here theres not really any of that  kids are just kids.\n\nTheschoolsare expensive but not in comparison to the UK.\n\nWe dont pay really for electricity of water thats two big bills gone.\n\nAnd because we moved into James mums house were not paying a mortgage either so that takes away a big cost.\n\nThe childrens school days are so different to the UK and runs from 7am to 1pm, with after school sports compulsory.\n\nWe definitely have a really better way of living and eating here, Natalie said.\n\nThe maids will clean the house every single day, mop and clean.\n\nIts a huge difference.\n\nI sent my main maid  the reason I say this is because we have one set of maids for the house, and one for the annex  I sent her on a cooking course so she can cook for us.\n\nThey get a salary increase too.\n\nShe cooks most of our meals for us  like tonight were having homemade pizza.\n\nTheres no chemicals in any of thefoodits all just pumped with sun and water.\n\nWe dont really eat too much of the traditional food.\n\nMy husband loves sadza  a cross between rice and mashed potatoes  and we have it once a week.\n\nThe barbecues here are amazing  they dont have burgers or sausages like the Brits do they have full fat steak or boerewors.\n\nDespite being settled into her new home, Natalie admits she found the first year in Zimbabwe difficult.\n\nShe said: When we first moved it felt like a holiday but as the months were going on and I realised I wasnt near my family anymore I panicked and thought what have we done?\n\nIts hard to make friends.\n\nMost of my friends are foreigners from other countries who are in the same boat as me.\n\nId have the odd cry, but I only went back to the UK in August to see my family.\n\nIt was only when I came back from the UK trip I realised this was home now.\n\nIt hit me that I had made the right decision.\n\nUK\n\nMortgage and bills (council tax, water and electricity) combined  3,000\n\nEducation  Free\n\nFood  600 per month (minimum)\n\nZimbabwe\n\nMortgage  $0 (0)\n\nBills (water, council tax and electricity)  $338.92\n\nEducation  private school  $17,500 for the year\n\nFood  $1,000 (maximum)\n\nHired help  maid to cook meals, gardener etc\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15132824/northampton.png",
            "description": "<p>Northampton Chronicle A Northamptonshire family “working to survive in the UK” say they now have a “better standard of living” after moving 5,000 miles to Zimbabwe. Natalie Furk, 35, and her husband, James, 37, made the move to live in James’ childhood home in March 2024 after they felt their work life balance was off. James had a full-time</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/northamptonshire-family-move-5000-miles-to-zimbabwe-and-say-they-now-have-a-better-standard-of-living/\">Northamptonshire family move 5,000 miles to Zimbabwe and say they now have a better standard of living</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Sep 2025"
        },
        {
            "title": "‘For little Shayna:’ Rifle artist connects to Zimbabwe roots through whimsical creations",
            "url": "https://www.newzimbabwe.com/for-little-shayna-rifle-artist-connects-to-zimbabwe-roots-through-whimsical-creations/",
            "content": "Post Independent\n\nLike many asylum seekers, immigrants and refugees, Shayna Oosthuysens childhood was split between two worlds  the wild beauty of Southern Africa and the disorienting unknown of a new life in America.\n\nThe Rifle-based artist was raised on a multi-generational family farm in Zimbabwe. With no fences separating her home from the wild African bush, Oosthuysen spent her childhood immersed in nature and building fairy gardens from rocks, flowers and shells in her familys sprawling yard.\n\nWe lived on a farm where there are no fences or anything, and theres just African bush, Oosthuysen said. My mom had these gardens of flowers and rocks and vines and huge trees and a lot of my childhood was spent down, deep in the garden.\n\n(My mom) was always creating or painting and embracing her own creative world, Oosthuysen said, explaining how her mother would use unique canvases like ostrich eggs. Im a lot like her and so she just inspires me\n\nBut in 2006, a changing political climate in Zimbabwe forced Oosthuysens family to seek asylum in the United States. At just 11 years old, she was uprooted from the only world she had ever known.\n\nWe lost everything pretty traumatically, Oosthuysen said. Six months later, we came to the U.S. with a suitcase and started entirely from scratch.\n\nCaught between her identity in Africa and her new life in America, Oosthuysen struggled to adjust. Assimilation was difficult. She was bullied for her accent and eventually worked to shed it.\n\nIm really thankful to be here and we have a lot of opportunities that we otherwise would never have had, Oosthuysen said. But immigration, no matter where you go or immigrate from or to, its just really, really hard.\n\nThroughout the transition, art became her compass. As a teenager, Oosthuysen used her canvases like visual diaries full of vibrant colors and abstract swirls, each piece captured feelings she couldnt always put into words. Today, free-form paintings remain a way for Oosthuysen, who was recently diagnosed with autism, to express emotions she cant verbalize.\n\nThough her creative pursuits have come in waves throughout adulthood, Oosthuysen made a life-changing decision in June: she quit her job to pursue art full time.\n\nGetting my art out there has been something Ive been wanting to do for 10 years, Oosthuysen said. There are always better artists, but then, I was just like, why not?\n\nShe launched her art under the name Flame Lily Works, inspired by Zimbabwes national flower. The flame lily is more than a symbol of home to Oosthuysen  its a metaphor for resilience.\n\nIt actually looks like a flame and its very beautiful, but its also known to be able to grow in some really harsh environments and be able to bloom through drought and things like that,Oosthuysen said. I love flowers, they are one of my most favorite things, but also its one thing that connects me to where Im from, and then I feel like its very symbolic of me as a person.\n\nIn recent months, Oosthuysen has sold her work at markets in Rifle and Carbondale and launched an Etsy shop under the nameFlameLilyFairy.\n\nFor Oosthuysen, art is more than just a passion its a way of connecting back to the child she once was and the home in Zimbabwe she abruptly lost.\n\nMy art now mostly is for little Shayna  that little gal who grew up in the bush and had all these different kinds of wild African animals around her and her family, Oosthuysen said. Its my way of connecting back to her and for her.\n\nHer artwork full of color, whimsy and the childlike sense of wonder that accompanied Oosthuysen during her adventures in the Zimbabwe bush  is for anyone who needs a little extra sparkle in their life.\n\nOosthuysens work is also a celebration of neurodivergence. She hopes to build a sense of belonging and community with other neurodivergent people through her abstract, emotive paintings in a collection titled All Brains Are Beautiful\n\nIts nerve wracking, being a neurodivergent person, Oosthuysen said. It takes a lot of energy for me to get (to markets), but once Im there, its really cool to be able to see people find joy or be inspired by my art.\n\nThats really rewarding  to share it with the world knowing that the right people will find it who need it, she added. Thats the part that I really enjoy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15134707/rifle.jpg",
            "description": "<p>Post Independent Like many asylum seekers, immigrants and refugees, Shayna Oosthuysen’s childhood was split between two worlds — the wild beauty of Southern Africa and the disorienting unknown of a new life in America. The Rifle-based artist was raised on a multi-generational family farm in Zimbabwe. With no fences separating her home from the wild</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/for-little-shayna-rifle-artist-connects-to-zimbabwe-roots-through-whimsical-creations/\">‘For little Shayna:’ Rifle artist connects to Zimbabwe roots through whimsical creations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Sep 2025"
        }
    ]
}