{
    "news": [
        {
            "title": "Rodwell Dhlakama bounces back at Greenfuel",
            "url": "https://www.newzimbabwe.com/rodwell-dhlakama-bounces-back-at-greenfuel/",
            "content": "By Sports Reporter\n\nNomadic gaffer Rodwell Dhlakama has bounced back at Greenfuel as club head coach.\n\nDhlakamas return was confirmed by the club.\n\nRodwell Dhlakama has been appointed as Head Coach of GreenFuel Football Club with immediate effect.\n\nHis contract will run until the end of the 2025 PSL Football Season, read part of Greenfuels statement.\n\nThe former Ngezi Platinum Stars coach is joining Greenfuel, coming from the Southern Region Division One League side Hwange FC.\n\nDhlakama parted with Greenfuel last year in April after a series of poor results.\n\nMeanwhile, the club has promoted Dhlakamas predecessor, Tawurayi Mangwiro, to be the clubs technical director.\n\nTawurayi Mangwiro, who was previously serving as Head Coach, has been elevated to the role of Technical Director, also effective immediately, until the conclusion of the 2025 PSL Football Season.\n\nAll other members of the technical team will continue in their current roles and will continue to serve the club with the same dedication and professionalism, further read the statement.\n\nGreenfuel is currently sitting in position 12 on the log with 19 points, which is 16 behind log leaders Simba Bhora.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/12232010/Rodwell-Dhlakama.png",
            "description": "<p>By Sports Reporter Nomadic gaffer Rodwell Dhlakama has bounced back at Greenfuel as club head coach. Dhlakama’s return was confirmed by the club. “Rodwell Dhlakama has been appointed as Head Coach of GreenFuel Football Club with immediate effect. “His contract will run until the end of the 2025 PSL Football Season,” read part of Greenfuel’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rodwell-dhlakama-bounces-back-at-greenfuel/\">Rodwell Dhlakama bounces back at Greenfuel</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "Killer pitbull owner denied bail",
            "url": "https://www.newzimbabwe.com/killer-pitbull-owner-denied-bail/",
            "content": "By Staff Reporter\n\nA Harare man, Mike Mpinga, whose pitbull fatally attacked a passerby, will remain locked up after he was denied bail by Harare Magistrate Marewanazvo Gofa.\n\nThe State is accusing Mike Mupinga of negligence, which resulted in the death of Samuel Machara.\n\nMupinga (40) of Blufhill is charged with culpable homicide.\n\nAccording to the State, on May 31 2025, during the night, the accused person, being the owner of four vicious dogs comprising three pit bulls and a Rottweiler, negligently left the vicious dogs unmuzzled in the yard of his rented house.\n\nThe accused person then went into his bedroom, leaving the dogs roaming around his yard, which is secured by a short perimeter wall built of bricks and mortar.\n\nThe accused persons vicious dogs then scaled over the short perimeter wall and met the now deceased Samuel Machara who was walking along the nearby street, said prosecutor Rufaro Chonzi.\n\nThe dogs then bit the now deceased all over the body.\n\nMachara sustained some deep wounds on the neck and lacerations on hands, legs and the stomach before he succumbed to the injuries.\n\nThe State saidthe dogs were positively identified to be the accuseds by both the witnesses and the accused.\n\nMupingas white pit bull dog had blood stains all over its body.\n\nThe dogs were recovered from the accused persons home by the police and members of the Society of the Prevention of Cruelty to Animals [SPCA] after the discovery of the now deceaseds remains on the nearby roadside.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04031421/mike-mupinga.jpg",
            "description": "<p>By Staff Reporter A Harare man, Mike Mpinga, whose pitbull fatally attacked a passerby, will remain locked up after he was denied bail by Harare Magistrate Marewanazvo Gofa. The State is accusing Mike Mupinga of negligence, which resulted in the death of Samuel Machara. Mupinga (40) of Blufhill is charged with culpable homicide. According to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/killer-pitbull-owner-denied-bail/\">Killer pitbull owner denied bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "What we know about Iran’s attack on US base in Qatar",
            "url": "https://www.newzimbabwe.com/what-we-know-about-irans-attack-on-us-base-in-qatar/",
            "content": "BBC\n\nIran has launched missiles at a US military base in Qatar, in what it said was retaliation for American strikes against its nuclear sites over the weekend.\n\nWitnesses reported hearing loud bangs in the sky above the capital, Doha, while videos showed bright flashes in the sky as air defence systems attempted to intercept missiles.\n\nIt is the latest escalation in a conflict involving Iran, Israel and the US which has seen tensions in the Middle East soar to unprecedented levels in recent days.\n\nHere is what we know.\n\nIranian missiles targeted the largest US military base in the Middle East, Al-Udeid, in what it said was a response to the US bombing three of its nuclear programme facilities on Saturday evening.\n\nAl-Udeid is home to the US militarys headquarters for all air operations in the region. Some British military personnel also serve there on rotation.\n\nThe attack was first confirmed by Iranian state media, and later by the military.\n\nA statement from the IRGC, the most powerful branch of the Iranian military, said that Iran will not leave any attack on its sovereignty unanswered, and added: US bases in the region are not strengths but vulnerabilities.\n\nThe US had previously warned Iran not to respond to its strikes on nuclear facilities and urged leaders in Tehran to agree to a diplomatic end to hostilities in the region.\n\nThere were differing reports about how many missiles were fired. Iran said six, the US said 14, and Qatar was reported by Reuters as saying 19  all of which, it added, were intercepted.\n\nNo one has been reported killed or injured.\n\nIn the hours before the attack, both the US and UK had advised their citizens in Qatar to shelter in place. About 8,000 US citizens live in Qatar, according to the State Department, as well as several thousand British citizens.\n\nIt became apparent soon afterwards that Iran had given warning that it was preparing to launch missiles. Three Iranian officials quoted by the New York Times said that Tehran had told Doha of its intentions, as a way to minimise casualties.\n\nIn his first comments in the aftermath, President Donald Trump thanked Iran for giving us early notice, which made it possible for no lives to be lost, and nobody to be injured.\n\nHe branded the attack very weak  no Americans were harmed and very little damage was done, he said. Theyve gotten it all out of their system, he added and said there was now a chance for peace.\n\nNevertheless, a spokesman for Qatars foreign ministry said the attack was a surprise and a flagrant violation of its sovereignty, and added that Qatar was one of the first countries to warn against the dangers of Israeli escalation in the region.\n\nIrans supreme leader Ayatollah Ali Khamenei meanwhile said that Iran did not harm anyone in the attack but that his country would not submit to anyones violation.\n\nWe have not violated anyone, and we will in no way accept being violated by anyone. We will not submit to anyones violation; this is the logic of the Iranian nation, he said on X (as translated by BBC Persian).\n\nThere were indications on Monday that the US suspected Iran was preparing to launch missiles into Qatar.\n\nHours before the attack, Qatar said it was temporarily closing its airspace, shortly after the US and UK told citizens in Qatar to shelter in place.\n\nThose warnings did not give a clear indication an attack was imminent: the US said it issued the order out of an abundance of caution, while the UK said it was following the lead of the Americans.\n\nHowever, around an hour before the attack, the BBC learned of a credible threat to the base.\n\nSeparately, some US media outlets quoted anonymous US officials as saying Iranian missile launchers had been positioned for a potential launch towards Qatar.\n\nFlight tracking websites showed planes had already started diverting to other airports before the launch. According to Flightradar24, there were 100 flights bound for Doha shortly before missile launches were detected.\n\nHamad International Airport is one of the worlds top 10 busiest for international traffic, with around 140,000 passengers passing through per day.\n\nOther countries in the region, including Bahrain and Kuwait, also closed their airspace for a brief period.\n\nThe US launched massive strikes against three nuclear facilities inside Iran on Saturday.\n\nThat came after days of uncertainty over whether the US would join Israels military action against Iran, which started on 13 June.\n\nIsrael has been launching daily missile strikes against nuclear and military facilities inside Iran, which its government says are necessary to prevent Iran from imminently building a nuclear weapon.\n\nSuccessive Israeli and American governments have sought to prevent Iran from acquiring a nuclear weapon. Iran has always maintained its extensive nuclear programme is for civilian purposes.\n\nThe US claimed its strikes badly damaged Irans nuclear programme, though the full extent of their impact remains unclear.\n\nAttacks between Iran and Israel also continued on Sunday and Monday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24091723/AFP__20250623__63HC4G2__v2__HighRes__TopshotQatarIranIsraelUsConflict-1750714228.webp",
            "description": "<p>BBC Iran has launched missiles at a US military base in Qatar, in what it said was retaliation for American strikes against its nuclear sites over the weekend. Witnesses reported hearing loud bangs in the sky above the capital, Doha, while videos showed bright flashes in the sky as air defence systems attempted to intercept</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-we-know-about-irans-attack-on-us-base-in-qatar/\">What we know about Iran’s attack on US base in Qatar</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "Man jailed 10 years for unlawful possession of dagga",
            "url": "https://www.newzimbabwe.com/man-jailed-10-years-for-unlawful-possession-of-dagga/",
            "content": "By Staff Reporter\n\nA 27-year-old Bulawayo man has been slapped with a 10-year jail term after he was convicted of unlawful possession of dagga.\n\nObvious Ngwenya was caught with 19.01 kilograms of dagga.\n\nThe state proved that on the 20thof May 2025, Ngwenya boarded a pirate taxi from Beitbridge to Bulawayo.\n\nHe carried a suspicious parcel wrapped in a light blue comforter, which he paid the driver to transport separately.\n\nAt the 129km peg along the Bulawayo-Beitbridge Road, the vehicle was stopped at a routine police roadblock.\n\nThe offender tried to block police officers from searching the vehicles boot and refused to identify his parcel, said prosecutors.\n\nHowever, after interviewing the driver and other passengers, police established that the parcel belonged to him.\n\nInside the parcel, the police found 33 cobs of dagga hidden in black plastic bags.\n\nThe total weight of the seized dagga was confirmed to be 19.01 kg.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A 27-year-old Bulawayo man has been slapped with a 10-year jail term after he was convicted of unlawful possession of dagga. Obvious Ngwenya was caught with 19.01 kilograms of dagga. The state proved that on the 20th of May 2025, Ngwenya boarded a pirate taxi from Beitbridge to Bulawayo. He carried a suspicious</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-10-years-for-unlawful-possession-of-dagga/\">Man jailed 10 years for unlawful possession of dagga </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "Inmate gets more jail time for drug dealing while locked up",
            "url": "https://www.newzimbabwe.com/inmate-gets-more-jail-time-for-drug-dealing-while-locked-up/",
            "content": "By Staff Reporter\n\nAn inmate at Gwanda Prison, Tiisetso Ngulube (56), who is serving time for assault, had a year added to his jail time after he was convicted for drug dealing while in prison.\n\nNgulube was jointly charged with Hloniphani Mkwananzi (42), an inmate serving for illegal gold prospecting and Etsang Mdlongwa (30) of Hampden Farm, Gwanda.\n\nHis co-accused denied the allegations and now await trial.\n\nThe three were charged with unlawful drug dealing at Gwanda Prisons.\n\nAccording to the State, on June 13 2025, at Gwanda Prisons / Hampden Plots, the two convicts were working in a prison garden.\n\nUpon returning to the cells, prison officers searched a bucket in Ngulubes possession and discovered 19 sachets of dagga (0.07kg) and four 200ml bottles of cane spirit.\n\nThey confessed and implicated Etsang Mdlongwa as the supplier.\n\nThey admitted to trading food items they had received from relatives, 4 packs of 2kg sugar and 3 packs of instant porridge for the dagga, the court heard.\n\nPolice detectives recovered from Mdlongwas home: dagga seeds, the exchanged foodstuffs, 22 bottles of cane spirit, empty sachets similar to those found on the inmates with a street value of dagga: ZWG $1,400.00.\n\nNgulube pleaded guilty and was sentenced to 12 months in prison.\n\nThe trial of his co-accused is expected to start on June 27.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Staff Reporter An inmate at Gwanda Prison, Tiisetso Ngulube (56), who is serving time for assault, had a year added to his jail time after he was convicted for drug dealing while in prison. Ngulube was jointly charged with Hloniphani Mkwananzi (42), an inmate serving for illegal gold prospecting and Etsang Mdlongwa (30) of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/inmate-gets-more-jail-time-for-drug-dealing-while-locked-up/\">Inmate gets more jail time for drug dealing while locked up</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "Striking UZ lecturers make fresh demands as students sit for exams",
            "url": "https://www.newzimbabwe.com/striking-uz-lecturers-make-fresh-demands-as-students-sit-for-exams/",
            "content": "By Darlington Gatsi\n\nSTRIKING lecturers have revised their demands, issuing an ultimatum to the University of Zimbabwe (UZ)to provide incentives to end their 70-day industrial action.\n\nThe lecturers have been on strike for three months, demanding an increase in their salaries. They are seeking wages of US$2,250, up from their current US$230.\n\nThe lecturers have refused to oversee ongoing examinations, instead picketing outside the university.\n\nThe Association of University Teachers (AUT) Obvious Vengeyi spokesperson stated that the revised demands give the government room to explore other avenues of addressing their grievances while negotiations for the US$2,250 continue.\n\nWe have put across our demand for salaries. We are demanding regional parity, which is the pre-October 2018 salary. We have added non-monetary incentives in case the government cannot provide the US$2,250 immediately.\n\nThis means we have also put in place a roadmap whereby, after every four months, we should be able to discuss a review so that within one year, we should reach regional parity. We have included non-monetary incentives, residential stands, commercial stands, and agricultural land. We have also added a demand for free education.\n\nLecturers here at the University of Zimbabwe were previously required to pay fees if they wished to further their education. We demand that all University of Zimbabwe employees be exempt from paying fees, said Vengeyi.\n\nWATCH | UZ lecturers strike continues, now on day 69\n\n\"Part-final students who are doing dissertations are now being told to bring whatever they have so they can be given marks,\" says AUT spokesperson Obvious Vengei.pic.twitter.com/KLg8rDO934\n\n NewZimbabwe.com (@NewZimbabweCom)June 23, 2025\n\nThe UZ has responded to the strike by suspending the lecturers and replacing them with temporary teachers to oversee examinations.\n\nThe government recently offered a 20 percent increase, a move rejected by the AUT.\n\nThe UZ has not made any response. They have not made any offer, which is why todays picketing emphasised the need for, and demand of, an offer from UZ.\n\nThe Ministry of Higher and Tertiary Education has made an offer of 20% across the board and 35% to the Vice-Chancellor, the very people responsible for this mess have been rewarded, which is quite unfair.\n\nSo, we have put forward our counter-demand in response to the ministrys offer. First and foremost, we reject this 20% as meaningless because if you give someone 20% of US$230, that is essentially nothing, said Vengeyi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled-e1748490385375.jpg",
            "description": "<p>By Darlington Gatsi STRIKING lecturers have revised their demands, issuing an ultimatum to the University of Zimbabwe (UZ) to provide incentives to end their 70-day industrial action. The lecturers have been on strike for three months, demanding an increase in their salaries. They are seeking wages of US$2,250, up from their current US$230. The lecturers have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/striking-uz-lecturers-make-fresh-demands-as-students-sit-for-exams/\">Striking UZ lecturers make fresh demands as students sit for exams </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "IOC is in ‘best of hands’, says Bach as he hands over to Zimbabwe’s Coventry",
            "url": "https://www.newzimbabwe.com/ioc-is-in-best-of-hands-says-bach-as-he-hands-over-to-zimbabwes-coventry/",
            "content": "AFP\n\nKirsty Coventrybecamethe president of the International Olympic Committee (IOC), the most powerful person in sport, on Monday in a handover ceremony with her predecessor Thomas Bach.\n\nThe Zimbabwean is the first woman and African to head the body, and at 41, the youngest since Baron Pierre de Coubertin, who is credited with founding the modern-day Olympics.\n\nCoventry accepted the Olympic key from Bach, who like her, is an Olympic champion, winning a team fencing gold in 1976, and earning two swimming golds in 2004 and 2008.\n\nStepping down after a turbulent 12-yeartenure, Bach expressed his confidence that the Olympic movement was in the best of hands and Coventry would bring conviction, integrity and a dynamic perspective to the role.\n\nCoventry, who swept to a crushing first-round victory in the election in Greece in March, leans heavily on her family.\n\nAside from her parents, who were present at the ceremony in Lausanne, there is her husband Tyrone Seward, who was effectively her campaign manager, and two daughters, six-year-old Ella, who Bach addresses as princess, and Lily, just seven months old.\n\nElla saw this spider web in the garden and I pointed out how it is made, and how strong and resilient it is to bad weather and little critters, said Coventry.\n\nBut if one little bit breaks, it becomes weaker. That spider web is our movement, it is complex, beautiful and strong, but it only works if we remain together and united.\n\nCoventry said she could not believe how her life had evolved since she first dreamt of Olympic glory in 1992.\n\nHow lucky are we creating a platform for generations to come to reach their dreams, she said to a packed audience in a marquee in the Olympic House garden, which comprised IOC members, including those she defeated, and dignitaries.\n\nIt is amazing and incredible, indeed I cannot believe that from my dream in 1992 of going to the Olympic Games and winning a medal, I would be standing here with you to make dreams for more young children round the world.\n\nCoventry, who served in the Zimbabwean government as sports and arts minister from 2019 to this year, said the Olympic movement was much more than a multi-sport event platform.\n\nWe (IOC members) are guardians of this movement, which is also about inspiring and changing lives and bringing hope, she said.\n\nThese things are not to be taken lightly, and I will be working with each and every one of you to continue to change lives and be a beacon of hope in a divided world.\n\nI am really honoured to walk this journey with you.\n\nBach, who during his tenure had to grapple withRussian dopingand their invasions of the Crimea andUkraineas well as theCovid pandemic, said he was standing down filled with gratitude, joy and confidence in his successor.\n\nWith her election, it sends out a powerful message that the IOC continues to evolve, said the 71-year-old German, who was named honorary lifetime president in Greece in March.\n\nIt has its first female and African to hold this position, and the youngest president since Pierre de Coubertin. She represents the truly global and youthful spirit of our community.\n\nBach, who choked back tears at one point during his valedictory speech, was praised to the rafters by Coventry, who was widely seen as his preferred candidate of the seven vying for his post.\n\nAfter a warm embrace, she credited him with teaching her to listen to people and to respect them, and praised him for leading the movement with pure passion and purpose.\n\nYou have kept us united through the most turbulent times.\n\nYou left us with many legacies and hope, thank you from the bottom of my heart for leading us with passion and never wavering from our values.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/23214130/ioc-bach-kirsty.jpg",
            "description": "<p>AFP Kirsty Coventry became the president of the International Olympic Committee (IOC), the most powerful person in sport, on Monday in a handover ceremony with her predecessor Thomas Bach. The Zimbabwean is the first woman and African to head the body, and at 41, the youngest since Baron Pierre de Coubertin, who is credited with founding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ioc-is-in-best-of-hands-says-bach-as-he-hands-over-to-zimbabwes-coventry/\">IOC is in ‘best of hands’, says Bach as he hands over to Zimbabwe’s Coventry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "Nadia Nakai not returning for season 4 of Netflix’s Young, Famous and African?",
            "url": "https://www.newzimbabwe.com/nadia-nakai-not-returning-for-season-4-of-netflixs-young-famous-and-african/",
            "content": "By Tapiwa Svondo\n\nRAPPER Nadai Nakai has hinted that she has not been recast and will not be returning for the fourth season of Netflix hit reality series Young, Famous and African.\n\nNadia who has been part of the show since it hit screens in 2022 revealed this in a Tik Tok video.\n\nBragga posted a video mouthing that was rude, captioned when YFA didnt ask you to come back for the new season because they would rather have drama than realness.\n\nThe reality series shot in Johannesburg, South African features African celebrities such as Zari, Diamond Platinumz, Naked DJ, Khanyi Mbau, Swanky Jerry and Annie Macaulay.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/20062705/Nadia-Nakai-opens-up-about-her-new-reality-show-Picture-X.webp",
            "description": "<p>By Tapiwa Svondo RAPPER Nadai Nakai has hinted that she has not been recast and will not be returning for the fourth season of Netflix hit reality series Young, Famous and African. Nadia who has been part of the show since it hit screens in 2022 revealed this in a Tik Tok video. Bragga posted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nadia-nakai-not-returning-for-season-4-of-netflixs-young-famous-and-african/\">Nadia Nakai not returning for season 4 of Netflix’s Young, Famous and African?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        },
        {
            "title": "317 malaria deaths recorded during 2025 peak season",
            "url": "https://www.newzimbabwe.com/317-malaria-deaths-recorded-during-2025-peak-season/",
            "content": "By Mary Taruvinga\n\nZimbabwe recorded a surge in malaria deaths, killing 317 during the 2025 peak malaria transmission season compared to the same period last year, according to the Health Ministry.\n\nLast year, 51 died during the same period, which is from week one to week 23 of 2025.\n\nThe health ministry attributed the rise to increased rainfall amounts received this year.\n\nFrom week 1 to week 23 of 2025, the country recorded 126 cumulative malaria outbreaks, of which 121 have been successfully controlled, while five remain active.\n\nThe decline in cases is attributed to the end of the rainy season and the onset of winter, which limits mosquito breeding due to lower temperatures and drier conditions.\n\nHowever, the surge in outbreaks earlier in the year was fuelled by increased rainfall, fluctuating temperatures, and a rise in outdoor economic activities-such as artisanal mining, tobacco curing, market gardening, and cross-border trading that heightened exposure to mosquito bites.\n\nAs a result, cumulative malaria cases increased from 29,085 in 2024 to 111,998 in 2025. Malaria-related deaths also surged from 51 in 2024 to 317 in 2025. The increase in deaths is largely due to delays in accessing treatment, as many cases occurred in remote locations far from health facilities.\n\nAccording to the Ministry of Health, the majority of these were concentrated in just three provinces.\n\nHarare reported 685 cases and Bulawayo reported 67 cases, mainly due to complicated or referred cases.\n\nMalaria also continues to disproportionately affect rural communities in Mashonaland Central, Manicaland, and Mashonaland West.\n\nMeanwhile, government has urged all citizens, especially those in high-risk zones as well as artisanal miners, to take preventive measures such as wearing clothing that covers most of your body when outdoors between sunset and sunrise, use mosquito repellents, sleep in sprayed rooms in districts that receive Indoor Residual Spraying and sleep under an Insecticide Treated Net (ITN) every day. Seek treatment within 24 hours from the Village Health Worker or from the nearest health facility, to prevent progression to severe disease that can lead to death.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/23184924/Malaria-mosquito.jpg",
            "description": "<p>By Mary Taruvinga Zimbabwe recorded a surge in malaria deaths, killing 317 during the 2025 peak malaria transmission season compared to the same period last year, according to the Health Ministry. Last year, 51 died during the same period, which is from week one to week 23 of 2025. The health ministry attributed the rise</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/317-malaria-deaths-recorded-during-2025-peak-season/\">317 malaria deaths recorded during 2025 peak season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "24 Jun 2025"
        }
    ]
}