{
    "news": [
        {
            "title": "Mighty Warriors forward Ruvimbo Mucherera signs contract with Polish club",
            "url": "https://www.newzimbabwe.com/mighty-warriors-forward-ruvimbo-mucherera-signs-contract-with-polish-club/",
            "content": "By Sports Reporter\n\nAFTER making her first international debut for Zimbanwe last month, national senior womens football team Mighty Warriors striker Ruvimbo Muchere has completed a move to Poland, where she has joined Energa Stomilanki Olsztyn.\n\nThe 28-year-old was plying her trade in Israel for Maccabi Haddera, a club she has parted ways with after serving more than two seasons.\n\nAnnouncing Muchereras arrival, Olsztyn posted, Ruvimbo Mucherera is a footballer for Stomilanek. Ruvimbo signed a contract with our club.\n\nRu is a Zimbabwean national team player who holds an American passport, she is an offensive player.\n\nRu welcome to Stomilanki, we are glad you have joined us.\n\nMucherera joins Olsztyn as an exprienced player as she has featured for several clubs across the globe, amongst them FS Damiense in Portugal, Gintra in Lithuana, San Diego Wave in the United States.\n\nHaving impressed during her debut with the Mighty Warriors last month, Mucherera is the only Zimbabwean female player to have featured in the prestigious Womens UEFA Champions League.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08054722/Ruvimbo-Mucherera.webp",
            "description": "<p>By Sports Reporter    AFTER making her first international debut for Zimbanwe last month, national senior women’s football team Mighty Warriors striker Ruvimbo Muchere has completed a move to Poland, where she has joined Energa Stomilanki Olsztyn. The 28-year-old was plying her trade in Israel for Maccabi Haddera, a club she has parted ways with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-forward-ruvimbo-mucherera-signs-contract-with-polish-club/\">Mighty Warriors forward Ruvimbo Mucherera signs contract with Polish club</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "Yadah F.C. feel FIFA sanctions heat but salvage a draw against Chicken Inn",
            "url": "https://www.newzimbabwe.com/yadah-f-c-feel-fifa-sanctions-heat-but-salvage-a-draw-against-chicken-inn/",
            "content": "By Sports Reporter\n\nSANCTIONED Yadah Football Club braved 90 minutes to salvage a 0-0 draw against Chicken Inn at Heart Stadium in Harare Friday afternoon.\n\nThe Miracle boys are being haunted by a FIFA transfer ban, which was imposed last year after they failed to pay three Brazilian players salaries and unfairly dismissed them.\n\nAs part of the sanctions, Yadah is not supposed to make any new signing until they have settled their debt with the Brazilians.\n\nCurrently, the prophet Walter Magaya-owned side has 13 registered players to compete in the league, of which Anotidaishe Gwatidzo was red carded last week in a match against Manica Diamonds, trimming the squad to 12 for the Chicken Inn match.\n\nFridays match had nothing much to write home about as both side were average, although Yadah proved to be the better team despite their limitation of having a one man substitute on the bench.\n\nPicking a point against Chicken Inn was a positive step going forwad for Yadah, who suffered a last minute 1-0 defeat last week away at Sakubva Stadium in Mutare.\n\nMeanwhile, Castle Lager Premier Soccer League action continues Saturday as Manica Diamonds travel to Zvishavanes Mandava Stadium for a date against FC Platinum, as Bikita Minerals host newcomers MWOS at Sakubva Stadium.\n\nElsewhere, Tel One welcome league returnees Triangle at Bata Stadium in Gweru, while Herentals squares off with Dynamos in a Harare derby.\n\nDefending league champions Simba Bhora will be out for a hunt in Kariba against ZPC Kariba while Ngezi Platinum Stars host Green Fuel.\n\nMatchday two action continues Sunday as CAPS United entertain money bags Scottland F.C while Highlanders welcome Kwekwe United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08054432/TgbCjE3qVgzJCKGnR9mxTo9Aii9WbnCAC02HvZjm.jpg",
            "description": "<p>By Sports Reporter SANCTIONED Yadah Football Club braved 90 minutes to salvage a 0-0 draw against Chicken Inn at Heart Stadium in Harare Friday afternoon. The Miracle boys are being haunted by a FIFA transfer ban, which was imposed last year after they failed to pay three Brazilian players’ salaries and unfairly dismissed them. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/yadah-f-c-feel-fifa-sanctions-heat-but-salvage-a-draw-against-chicken-inn/\">Yadah F.C. feel FIFA sanctions heat but salvage a draw against Chicken Inn</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "VPs, Cabinet ministers continue absconding Parliament, deny citizens critical updates on government policies and programmes",
            "url": "https://www.newzimbabwe.com/vps-cabinet-ministers-continue-absconding-parliament-deny-citizens-critical-updates-on-government-policies-and-programmes/",
            "content": "By Staff Reporter\n\nDEPUTY President of Senate Michael Nyambuya has described as sad the propensity of absconding Question-and-Answer sessions by the countrys two vice presidents and Cabinet ministers.\n\nThe worrisome trend denies citizens vital information about government policies, programmes and projects.\n\nSpeaker of Parliament, Jacob Mudenda has, on several occasions, noted the undesirable trend and ordered punitive action to be taken against errant top government officials skipping parliamentary Q and A sessions.\n\nThis Thursday, Hon Nyambuya was unassumed by the absence of Vice President Constantino Chiwenga and his counterpart, Kembo Mohadi, and a huge chunk of Cabinet ministers and their deputies, who missed the important deliberations in the Upper House.\n\nToday is Thursday and following the Standing Orders, we start with Questions Without Notice. As usual, I have a very long list of apologies, sadly, said Nyambuya, before reading the list of absentee office bearers.\n\nThe list of apologies is as follows; Hon. General Rtd. Dr. C. D. G. N. Chiwenga, the Vice President; Hon. Colonel Rtd. K. C. D Mohadi, the Vice President; Hon. M. Ncube, Minister of Finance, Economic Development and Investment Promotion; Hon. Machakaire, the Minister of Youth Empowerment, Development and Vocational Training; Hon. Murwira, Minister of Foreign Affairs and International Trade; Hon. Kazembe, Minister of Home Affairs and Cultural Heritage; Hon. Mavetera, the Minister of ICT, Postal and Courier Services; Hon. M. Ndlovu, the Minister of Industry and Commerce; Hon. F. Mhona, Minister of Transport and Infrastructural Development.\n\nHe went further, Hon. J.G, Moyo, Minister of Energy and Power Development; Hon. K. D. Mnangagwa, the Deputy Minister of Finance, Economic Development and Investment Promotion; Hon. E. Jesaya, Deputy Minister of Sports, Recreation, Arts and Culture; Hon. J. Mhlanga, Deputy Minister of Women Affairs, Community, Small and Medium Enterprises Development; Hon. C. Sanyatwe, Deputy Minister of Home Affairs and Cultural Heritage; Hon. Mazungunye, Deputy Minister of Justice, Legal and Parliamentary Affairs; Hon. A.\n\nGata, Deputy Minister of Primary and Secondary Education; Hon. R. Modi, Deputy Minister of Industry and Commerce; Hon. Y. Simbanegavi, Deputy Minister of Energy and Power Development; Hon. M. Ncube, Deputy Minister of National Housing and Social Amenities and Hon. D. Marapira, Deputy Minister of Lands, Agriculture, Fisheries, Water and Rural Resettlement.\n\nOnly Primary and Secondary Education minister, Torerai Moyo and two deputies were in the august House, which is emblematic of a skewed work ethic.\n\nIn the Chamber today, we have Hon. T. Moyo, Minister of Primary and Secondary Education; Hon. O. Marupi, Deputy Minister of Information, Publicity and Broadcasting Services and Hon. D. Phuti, Deputy Minister of ICT.\n\nCan we then start with those ministers who are present and hopefully, we will be joined by other ministers as we progress? said the Senate deputy president.\n\nA number of Cabinet ministers are under fire for not attending Parliament business, a development that has incensed Mudenda.\n\nRecently, the Speaker revealed that most Cabinet ministers give apologies on the pretext of being on national duty, something he said should be investigated.\n\nThe Q & A session is one of the most important Parliament business schedules where the public gets answers to policy questions asked by their constituency representatives (MPs) from Cabinet ministers.\n\nIn recent years, the two VPs and ministers have evaded the session, leaving citizens starved of crucial information needed to track progress of elected officials.\n\nSeveral MPs have raised their concerns since the previous Parliament until now (10th Parliament), with the Speaker at one point threatening to report culprits to President Emmerson Mnangagwa.\n\nAfter listening to this, there are quite clear apologies that have been very consistent to you. And my suspicion is that these ministers who make apologies cannot be on national duty every week, Mudenda lamented.\n\nMnangagwa has also issued a stern warning to Cabinet ministers, who habitually skip his weekly Cabinet meetings, delegating their deputies to attend in their place.\n\nWhile chairing his final cabinet meeting of 2024 at State House, December 17, Mnangagwa warned that such delegation would not be tolerated in 2025.\n\nHe said in the 2025 calendar year, the Chief Secretary is directed to strictly monitor attendance and ensure that errant ministers and officials toe the line, or face dire consequences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29152545/new-parliament-5.png",
            "description": "<p>By Staff Reporter  DEPUTY President of Senate Michael Nyambuya has described as “sad” the propensity of absconding Question-and-Answer sessions by the country’s two vice presidents and Cabinet ministers. The worrisome trend denies citizens vital information about government policies, programmes and projects. Speaker of Parliament, Jacob Mudenda has, on several occasions, noted the undesirable trend and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vps-cabinet-ministers-continue-absconding-parliament-deny-citizens-critical-updates-on-government-policies-and-programmes/\">VPs, Cabinet ministers continue absconding Parliament, deny citizens critical updates on government policies and programmes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "Simbisa’s recipe to deal with Mthuli’s new taxes",
            "url": "https://www.newzimbabwe.com/simbisas-recipe-to-deal-with-mthulis-new-taxes/",
            "content": "By newZWire\n\nRUNNING a business in Zimbabwe means dealing with the unexpected. For Simbisa, the countrys largest fast-food company, the year began with fresh taxes that could bite into sales.\n\nFinance Minister Mthuli Ncube initially proposed a 0.5% tax in his budget statement, only to bump it up to 1% for implementation in January. He also threw in a new 20% tax on plastic bags.\n\nThis came as consumer spending in Simbisa outlets dipped. Average spend per customer fell by 3% in the last half-year, even though customer numbers rose by 7% to 24.8 million. This means the company has had to absorb the costs while finding ways to bridge the gap. Its strategy? Open more outlets, sell more chicken, and manage costs better.\n\nWere adapting to the 1% fast-food tax, says CEO Basil Dionisio.\n\nOn January 1, we all woke up to a lovely new year, and we were told its half a percent. Then the SI came out, and its 1%. We havent raised prices. Were absorbing itby growing our customer base, increasing volume, and passing that benefit to consumers.\n\nSimbisa opened a net of 38 new outlets between December 2023 and the end of 2024, with 16 of those in the last half of the year. By June, another 10 outlets will be added. Over the next 18 months, the company plans to launch 81 new counters and refurbish 60 existing ones.\n\nAnd what about the plastic bags tax?\n\nWe want to transition to 100% paper packagingno more little plastic carrier bags, Dionisio says.\n\nThis shift aligns with global industry trends. The company is also exploring new sustainable packaging solutions for its Creamy Inn ice creams.\n\nAfter that, we should have no more plastic in our operations.\n\nBeyond opening new outlets, Simbisa is also betting on increased adoption of its delivery services, which remain low in Zimbabwe compared to other markets.\n\nThe company is increasing cost containment, including pushing energy savings, while working with suppliers to negotiate better terms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/29041917/Simbisa-Brands.png",
            "description": "<p>By newZWire  RUNNING a business in Zimbabwe means dealing with the unexpected. For Simbisa, the country’s largest fast-food company, the year began with fresh taxes that could bite into sales. Finance Minister Mthuli Ncube initially proposed a 0.5% tax in his budget statement, only to bump it up to 1% for implementation in January. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/simbisas-recipe-to-deal-with-mthulis-new-taxes/\">Simbisa’s recipe to deal with Mthuli’s new taxes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "Elon Musk lies again: ‘Starlink not allowed to operate in South Africa because I’m not black’",
            "url": "https://www.newzimbabwe.com/elon-musk-lies-again-starlink-not-allowed-to-operate-in-south-africa-because-im-not-black/",
            "content": "By Xolile Mtembu l IOL\n\nTHE worlds richest man, South African-born Elon Musk is once again spewing disinformation on his platform X.\n\nXs generative AI, Grok, identified Musk, a member of the US Department of Government Efficiency (DOGE), as the leading spreader of lies and misinformation on the social media platform he acquired for a staggering $44 billion.\n\nIn a recent post, Musk claimed that his satellite internet constellation, Starlink, is not allowed in South Africa because he is not black.\n\nThe Tesla owner was responding to another misinformation claim that there are 140 race-based laws in the country, which are all anti-white.\n\nStarlink is not allowed to operate in South Africa, because Im not black.\n\nIn actuality, Musks Starlink plans to expand into South Africa have been halted, as the business withdrew from regulatory hearings held by the Independent Communications Authority of South Africa (ICASA), according to Techpoint.\n\nICASA reportedly organised these hearings to get industry feedback on its proposed South African satellite services licensing system. Setting up a registration procedure is an important goal for multinational satellite operators that want to offer services directly or through partnerships with approved local suppliers.\n\nWhen asked by IOL about the biggest spreader of misinformation on X, Grok said:  Based on available reports, analyses, and sentiment on X as of March 07, 2025, Elon Musk is frequently identified as one of the most significant spreaders of misinformation on the platform.\n\nGrok added that this assessment comes from various sources, including studies by organisations like the Center for Countering Digital Hate, which found that Musks posts promoting false or misleading claims about topics like the US election have amassed billions of views in 2024 alone.\n\nHis large followingover 200 million as of recent countsamplifies the reach of such content, often related to politics, health issues like Covid-19, and conspiracy theories.\n\nThe AI further elaborated, noting that Musks interactions with accounts known for spreading misinformation have been highlighted as contributing factors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/26043006/esla-and-SpaceX-CEO-Elon-Musk.jpeg",
            "description": "<p>By Xolile Mtembu l IOL THE world’s richest man, South African-born Elon Musk is once again spewing disinformation on his platform X. X’s generative AI, Grok, identified Musk, a member of the US Department of Government Efficiency (DOGE), as the leading spreader of lies and misinformation on the social media platform he acquired for a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elon-musk-lies-again-starlink-not-allowed-to-operate-in-south-africa-because-im-not-black/\">Elon Musk lies again: ‘Starlink not allowed to operate in South Africa because I’m not black’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "China, Zimbabwe celebrate 40th anniversary of medical cooperation",
            "url": "https://www.newzimbabwe.com/china-zimbabwe-celebrate-40th-anniversary-of-medical-cooperation/",
            "content": "By Xinhua\n\nTHE Chinese Embassy in Zimbabwe held a reception on Thursday to mark the 40th anniversary of the Chinese medical teams presence in Zimbabwe.\n\nThe event also saw the bidding of farewell to the 21st batch of the Chinese medical team, who were awarded medals in recognition of their dedicated service to the country, and the welcoming of the 22nd batch.\n\nZimbabwean Deputy Minister of Health and Child Care Sleiman Kwidini said the partnership between Zimbabwe and China in the health sector is a shining example of what nations can achieve when they work together with mutual respect and friendship.\n\nFor the past 40 years, these teams have been at the forefront of delivering quality healthcare to our people, often in the most remote and underserved areas, he said.\n\nNot only have they healed bodies, but they have also strengthened the bonds of friendship between our two nations. The enduring legacy of their work will be felt for generations, both in the lives of those they have helped and in the healthcare system they have contributed to building.\n\nKwidini added that Chinese medical teams exemplify the power of compassion, collaboration, and dedication.\n\nCheng Yan, charge daffaires of the Chinese Embassy in Zimbabwe, said the milestone not only marks four decades of unwavering dedication and service to Zimbabwe by Chinese medical teams, but is also a testament to the enduring friendship between the two countries.\n\nTheir efforts embody the spirit of Chinas vision for a global community of health for all, and demonstrate that their mission is not just about treating illness, but about building bridges of friendship between our peoples, he said.\n\nCheng said China and Zimbabwe maintain close exchanges in medical personnel training, adding that China will invite more than 60 Zimbabwean hospital staff and medical officials to visit China this year.\n\nOver the past year, the 21st batch of the Chinese medical team has treated over 14,000 patients, trained more than 1,000 local health workers, and established critical health facilities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08042611/GlbUJhfWMAAKdZu.jpeg",
            "description": "<p>By Xinhua THE Chinese Embassy in Zimbabwe held a reception on Thursday to mark the 40th anniversary of the Chinese medical team’s presence in Zimbabwe. The event also saw the bidding of farewell to the 21st batch of the Chinese medical team, who were awarded medals in recognition of their dedicated service to the country,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-zimbabwe-celebrate-40th-anniversary-of-medical-cooperation/\">China, Zimbabwe celebrate 40th anniversary of medical cooperation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "Chief hails Freda Rebecca reforestation programme, calls on mining companies to take a leaf",
            "url": "https://www.newzimbabwe.com/chief-hails-freda-rebecca-reforestation-programme-calls-on-mining-companies-to-take-a-leaf/",
            "content": "By Staff Reporter\n\nA TRADITIONAL leader from Mashonaland Central, Chief Chipadze has urged mining companies to take environmental conservation seriously by planting indigenous trees to counter deforestation and land degradation caused by mining activities.\n\nThe traditional leader was giving remarks at a sustainability campaign launch event, which was held by Freda Rebecca Gold Mine (FRGM) Friday where he commended efforts to rehabilitate the environment.\n\nThe campaign focuses on restoring and rebuilding sustainable communities through developmental and preservation of green spaces using native plants, dust suppression initiatives, and local infrastructure rehabilitation and these include planting trees and lawn.\n\nThis tree planting exercise we are witnessing today is a great initiative as we are using our own indigenous trees which can survive in this environment.\n\nWe wish and urge all mining companies to do the same to avoid environmental damages to the surrounding communities, Chipadze said.\n\nThese initiatives are done at the Tailing Storage Facility (TSF), a mining structure used to store waste materials after mineral extraction which can cause significant damage to local communities if not managed properly.\n\nTSFs can cause water and air pollution, soil erosion, dust pollution, landscape alteration, and potential disasters like dam failures, impacting ecosystems and human health.\n\nThis year alone, FRGM, a subsidiary of Kuvimba Mining House (KMH) has already planted over 10 000 trees under the theme restoring nature and securing tomorrow.\n\nSince the beginning of this year, FRGM has already planted more than 10 000 trees and we planted another 900 trees here today.\n\nWe are replanting specifically indigenous trees but a few exotics which will be planted for very specific reasons like some of them will be able to restore the soil quality and assist the indigenous trees to grow as well, added KMH CEO Trevor Barnard.\n\nThe campaign will be rolled out across all KMH mines in Zimbabwe.\n\nThis will go to all our other operations, we cleared vegetation, we removed crop soil, we disturbed the natural environment, even though we can never completely restore this area to what it was before, that would have been an effort to restore the vegetation, said FRGM managing director Patrick Shayawabaya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08041457/Chief-Chipadze-scaled.jpg",
            "description": "<p>By Staff Reporter A TRADITIONAL leader from Mashonaland Central, Chief Chipadze has urged mining companies to take environmental conservation seriously by planting indigenous trees to counter deforestation and land degradation caused by mining activities. The traditional leader was giving remarks at a sustainability campaign launch event, which was held by Freda Rebecca Gold Mine (FRGM)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chief-hails-freda-rebecca-reforestation-programme-calls-on-mining-companies-to-take-a-leaf/\">Chief hails Freda Rebecca reforestation programme, calls on mining companies to take a leaf</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "Supreme Court throws out Chimombe’s appeal in US$7 million Presidential Goat Scheme fraud case",
            "url": "https://www.newzimbabwe.com/supreme-court-throws-out-chimombes-appeal-in-us7-million-presidential-goat-scheme-fraud-case/",
            "content": "By Staff Reporter\n\nTHE Supreme Court has thrown out an appeal by controversial businessman Mike Chimombe, who was challenging denial of bail by the High Court.\n\nChimombe is facing high profile fraud allegations after he allegedly duped the Ministry of Lands US$7 million by securing a tender to supply goats using a non-existent company.\n\nHe is jointly charged with his partner Moses Mpofu, whose appeal is yet to be finalised by the Supreme Court.\n\nThe two were denied bail by High Court Judge Justice Pisirayi Kwenda who ruled that they were likely to abscond given the offence they were facing that attracts 20 years imprisonment if convicted.\n\nThe Supreme Court concurred with Kwenda ruling that his decision cannot be faulted.\n\nThe court found that the State had established compelling reasons for his continued detention, including the likelihood of absconding, the seriousness of the charges and the risk of interfering with witnesses, said the State after the ruling.\n\nChimombe has been at the centre of a high-profile fraud case involving allegations of misusing funds related to Presidential Goat Pass-On Scheme.\n\nAlong with his co-accused he was arrested in 2024 Chimombe was initially denied bail by the magistrates court in July 2024, with the court citing concerns that he was likely to abscond and interfere with witnesses.\n\nHe appealed this decision at the High Court, but the appeal was overtaken by events when he and his co-accused were indicted for trial at the same court.\n\nIn January 2025, Chimombe filed a further bail application at the High Court, which was also denied.\n\nChimombe then took his case to the Supreme Court, arguing that the High Court erred by relying on the magistrates earlier findings instead of applying a fresh mind to his bail application.\n\nHe maintained that the State failed to prove compelling reasons for his continued detention.\n\nHe is represented by Ashiel Mugiya, who is instructing Lovemore Madhuku.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Staff Reporter  THE Supreme Court has thrown out an appeal by controversial businessman Mike Chimombe, who was challenging denial of bail by the High Court. Chimombe is facing high profile fraud allegations after he allegedly duped the Ministry of Lands US$7 million by securing a tender to supply goats using a non-existent company. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-throws-out-chimombes-appeal-in-us7-million-presidential-goat-scheme-fraud-case/\">Supreme Court throws out Chimombe’s appeal in US$7 million Presidential Goat Scheme fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "Jailed AMH journalist Blessed Mhlanga files High Court appeal against decision denying him bail",
            "url": "https://www.newzimbabwe.com/jailed-amh-journalist-blessed-mhlanga-files-high-court-appeal-against-decision-denying-him-bail/",
            "content": "By Staff Reporter\n\nALPHA Media Holdings senior journalist Blessed Mhlanga, who is currently locked up in remand prison on allegations of transmitting information that incites violence, has filed an appeal at the High Court challenging magistrate Farai Gwitimas decison to deny him bail.\n\nThe journalist has been behind bars for close to two weeks now.\n\nHis arrest followed interviews he allegedly had with Blessed Geza, a war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nGeza is currently being sought by the police to answer to incitement, undermining the authority of the President and theft charges.\n\nIn denying him bail, Gwitima ruled that Mhlanga was likely to interfere with witnesses who are his subordinates.\n\nThe magistrate also said his release has potential to spark unrest in Zimbabwe.\n\nThrough his lawyer, Chris Mhike, the AMH senior scribe told the High Court that Gwitima was wrong in denying him bail.\n\nWe have amplified our efforts to secure freedom for Mhlanga by filing an appeal at High Court against Harare Magistrate Farai Gwitimas decision to deny bail to the senior journalist.\n\nIn the appeal, our lawyer Chris Mhike, argued that Magistrate Gwitima grossly erred and misdirected himself in denying bail to Mhlanga late last month as there were no compelling reasons to justify Mhlangas continued incarceration, said ZLHR.\n\nThe appeal is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26062142/Mhlanga-Blessed.png",
            "description": "<p>By Staff Reporter  ALPHA Media Holdings senior journalist Blessed Mhlanga, who is currently locked up in remand prison on allegations of transmitting information that incites violence, has filed an appeal at the High Court challenging magistrate Farai Gwitima’s decison to deny him bail. The journalist has been behind bars for close to two weeks now.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jailed-amh-journalist-blessed-mhlanga-files-high-court-appeal-against-decision-denying-him-bail/\">Jailed AMH journalist Blessed Mhlanga files High Court appeal against decision denying him bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        },
        {
            "title": "Zanu PF crafts digital media policy to rein in rogue members",
            "url": "https://www.newzimbabwe.com/zanu-pf-crafts-digital-media-policy-to-rein-in-rogue-members/",
            "content": "By Darlington Gatsi\n\nZIMBABWES governing party, Zanu PF is in the process of crafting a digital media policy to rein in its members and affiliates, who have been at loggerheads with some leaders as internal conflicts persist.\n\nThe envisaged policy was submitted to the Politburo Wednesday for consideration as the party frets over members abusing social media.\n\nAddressing the media at the party headquarters recently, Zanu PF secretary for legal affairs, Patrick Chinamasa, said there are members who are using social media to cause instability within the party.\n\nThe national political commissar is chairing a committee to come up a Zanu PF social media management policy. We found that the party has suffered a lot of harm from what goes on on social media.\n\nWhat we do not approve is a Zanu PF cadre, a member of Zanu PF from the cell right up to the president, use social media to criticise colleagues. The channels are there. We are hopeful the social media policy that is to be crafted will assist not entirely or help assist put order and discipline and unity within our party, said Chinamasa.\n\nZanu PF has been struggling to contain its members and affiliates, some of which were ostensibly created to support President Emmerson Mnangagwa. One of the affiliates, Varakashi for ED, recently criticised Chinamasa after he warned them about bringing the party into disrepute.\n\nThey have been accused of fanning factionalism, going against President Mnangagwas public declaration of not seeking re-election.\n\nDespite some of the affiliates having been established to counter the narrative of the opposition using digital media, some have reflected Zanu PFs divisions, with members split between supporting Mnangagwa and his deputy, Constantino Chiwenga, who is touted to be next in the partys succession plan.\n\nChinamasa said once the digital media policy has been approved, Zanu PF will nip in the bud any members going against the party.\n\nThe party is going to put its foot down on issues to do with WhatsApp exchanges. We have developed technology to detect who are the ghost people. A lot of people have been masquerading under ghost accounts. We have technology to tell who is a ghost. This time we will be able to uncover who are the ghosts doing all these things, he said.\n\nZanu PF recently purged and suspended members who were accused of spreading divisive messages using social media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/02192657/Social-media.jpg",
            "description": "<p>By Darlington Gatsi  ZIMBABWE’S governing party, Zanu PF is in the process of crafting a digital media policy to rein in its members and affiliates, who have been at loggerheads with some leaders as internal conflicts persist. The envisaged policy was submitted to the Politburo Wednesday for consideration as the party frets over members abusing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-crafts-digital-media-policy-to-rein-in-rogue-members/\">Zanu PF crafts digital media policy to rein in rogue members </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Mar 2025"
        }
    ]
}