{
    "news": [
        {
            "title": "Takesure Chinyama bounces back at Dynamos as strikers coach",
            "url": "https://www.newzimbabwe.com/takesure-chinyama-bounces-back-at-dynamos-as-strikers-coach/",
            "content": "By Sports Reporter\n\nFormer Dynamos striker Takesure Chinyama has bounced back at the club as striker coach.\n\nThis was revealed by the club on Tuesday morning via a statement.\n\nChinyama will work under the current technical team led by Lloyd Mablanyo Chigowe.\n\nDynamos Football Club is committed to continuous improvement and addressing the challenges the Club is currently facing in the league.\n\nAs part of a strategic step-by-step approach to enhance our technical department, the club is pleased to announce the appointment of Takesure Chinyama as the new Strikers Development Coach/Assistant Coach, read part of Dynamos statement.\n\nChinyama played for Dembare in 2012 before leaving mid-season to join South African giants Orlando Pirates.\n\nHe then returned to the club in 2015 before making another move to Poland the following year.\n\nHis appointment is part of Dembares move to ease the clubs goal drought.\n\nTakesure Chinyama, a prolific striker during his playing days, played for Dynamos FC among other clubs locally, then Poland and South Africa with a career spanning almost two decades.\n\nChinyama, a holder of UEFA B License, transitioned into coaching after an illustrious career.\n\nHis expertise and experience will be a valuable addition to the team as we work towards turning around our performances.\n\nThis appointment is part of the clubs broader plan to reinforce the technical setup while maintaining stability within the squad.\n\nDembare has only managed to score two goals in 10 games, making themselves the lowest scoring team in the league at the present moment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07041056/Takesure-Chinyama.webp",
            "description": "<p>By Sports Reporter Former Dynamos striker Takesure Chinyama has bounced back at the club as striker coach. This was revealed by the club on Tuesday morning via a statement. Chinyama will work under the current technical team led by Lloyd “Mablanyo” Chigowe. “Dynamos Football Club is committed to continuous improvement and addressing the challenges the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/takesure-chinyama-bounces-back-at-dynamos-as-strikers-coach/\">Takesure Chinyama bounces back at Dynamos as strikers coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Conservation under threat as Mines Ministry continues to entertain applications to mine in protected areas – ZimParks",
            "url": "https://www.newzimbabwe.com/conservation-under-threat-as-mines-ministry-continues-to-entertain-applications-to-mine-in-protected-areas-zimparks/",
            "content": "By Anna Chibamu\n\nCONSERVATION is under serious threat from mining activities in protected areas countrywide, puttingwild animals at risk of extinction, a Zimbabwe Parks and Wildlife ManagementAuthority (ZimParks) official has said.\n\nGiving oral evidence to the Tourism and Hospitality Industry Parliamentary Portfolio Committee this Monday, ZimParks Corporate Secretary Nyasha Mutyambizi said the Mines ministry continued to accept applications for mining purposes in the restricted areas meant for conservation and tourism.\n\nMutyambizi said tourists were no longer keen to visitZimbabwe due to the rampant mining activities in tourist attraction areas.\n\nAccording to the World Wildlife Fund (WWF), Zimbabwe has the second largest elephant population and third largest total numbers of rhinos in Southern Africa (excluding South Africa) and the third largest individual black rhino population in the world.\n\nOur international market of tourists is now questioning how conservation and mining coexist.\n\nThey are asking: Why should we come to Zimbabwe when your laws do not protect animals?\n\nBecause there are people who are very passionate about animals, and they believe that as a government, as an authority, we should be able to stop mining in areas such as Matopos National Park, Mutyambizi said.\n\nMost people believe that the richest mining deposits are within these areas.\n\nEverybody wants to come and mine in these areas and this is putting a lot of pressure on the department as we struggle to conserve the areas.\n\nEven though the government has put in place some cabinet resolutions, ZimParks has had two or three mining in the proxy state.\n\nWe are constantly surprised to continue seeing applications going through our colleagues at Ministry of Mines.\n\nLast week, we had some public hearings with the Mines Board where there was such a request.\n\nAnd despite everybody being optimistic, we could still hear them requesting to explore 16 hectares. The Mines Ministryand the client were saying, okay, we will not do the 16 hectares, allow us to do one hectare, she told the Parly committee.\n\nShe continued: We do not understand why these applications are being entertained with a similar problem for Matopos, one of our flagships.\n\nWe received hundreds of complaints and petitions from all over the world, from embassies, but we seem not to really have that much value for conservation.\n\nBut we know that conservation, if we look after our animals, if we look after our areas, we have the potential to generate more money. Conservation preserves the environment and generations will continue to come and see these areas.\n\nMutyambizi, however, highlighted that there was conflicting legislation on mining and conservation in Zimbabwe, making it difficult to take full control of the protected areas.\n\nWe do have a serious problem but as ZimParks, all we can do is to try and use our own legislation, but we have got conflicting legislation that is also coming into our areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26171635/Hwange-National-Park_11.jpg",
            "description": "<p>By Anna Chibamu CONSERVATION is under serious threat from mining activities in protected areas countrywide, putting wild animals at risk of extinction, a Zimbabwe Parks and Wildlife Management Authority (ZimParks) official has said. Giving oral evidence to the Tourism and Hospitality Industry Parliamentary Portfolio Committee this Monday, ZimParks Corporate Secretary Nyasha Mutyambizi said the Mines ministry continued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/conservation-under-threat-as-mines-ministry-continues-to-entertain-applications-to-mine-in-protected-areas-zimparks/\">Conservation under threat as Mines Ministry continues to entertain applications to mine in protected areas – ZimParks </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Tour guide’s quick thinking saves tourists from charging rhino encounter",
            "url": "https://www.newzimbabwe.com/tour-guides-quick-thinking-saves-tourists-from-charging-rhino-encounter/",
            "content": "IOL\n\nIn the heart of Zimbabwes unspoiledwilderness, an electrifying encounter between campers and a pair of rhinos has reignited interest in safari camping across Africa.\n\nA video that trended on TikTok depicted atour guidedemonstrating a remarkable display of composure as he carefully pacified a female rhino and her calf during aguided safariwalk, shedding light on the delicate balance of human interactions with wildlife.\n\nThe video, shared by @kierakalmanguest, showcased a tense moment as the female rhino, protective of her young, appeared ready to charge at a group of intrigued tourists.\n\nHowever, the quick-thinking tour guides experience and calm demeanour managed to defusethe situation.\n\nStand still. They will come and investigate, but stand still, he whispered, showcasing the wisdom that comes with navigating the unpredictable instincts of one of Africas most formidable creatures.\n\nAs the mother rhino approached, tensions mounted.\n\nHey, hey, hamba, the guide firmly commanded, prompting the rhino to retreat.\n\nThis interaction illuminated the nuanced understanding required to coexist with wildlife.\n\nDo you understand why we say stand still? The moment you start moving, it will draw their attention, the guide explained, highlighting the rhinos unique physical characteristics.\n\nThis encounter encapsulated both the allure and the dangers of wildlife safari camping.\n\nThough rhinos are generally non-aggressive unless feeling threatened or provoked, their sheer size and strength mean that caution must always be exercised.\n\nWhile incidents of attacks remain infrequent, the potential for bodily harm can be severe, underscoring the need for professional guidance and respect for these majestic animals.\n\nAs safari camping continues to gain popularity on the continent, its important to appreciate the myriad offerings that such experiences provide.\n\nUnlike traditional lodges, which can sometimes separate visitors from the raw essence of nature, camping safaris immerse guests in the heart of the African landscape.\n\nThese adventures afford the unique flexibility to traverse diverse ecosystems, enabling travellers to follow animal migrations based on real-time sightings.\n\nFrom the thrilling sights and sounds of nearby animals to the majestic backdrop of the African night sky, camping safaris present an enriching experience that transcends conventional tourism.\n\nAs the popularity of safari camping rises, its evident that such experiences go beyond mere leisure.\n\nThey foster a profound connection to nature that encourages both conservation and appreciation for the unique environments of the continent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/31171735/Zimbabwe-Rhino.png",
            "description": "<p>IOL In the heart of Zimbabwe’s unspoiled wilderness, an electrifying encounter between campers and a pair of rhinos has reignited interest in safari camping across Africa. A video that trended on TikTok depicted a tour guide demonstrating a remarkable display of composure as he carefully pacified a female rhino and her calf during a guided safari walk, shedding light</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tour-guides-quick-thinking-saves-tourists-from-charging-rhino-encounter/\">Tour guide’s quick thinking saves tourists from charging rhino encounter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Finance Ministry using unauthorised public funds, mishandling tender processes and payments to service providers – Parliament",
            "url": "https://www.newzimbabwe.com/finance-ministry-using-unauthorised-public-funds-mishandling-tender-processes-and-payments-to-service-providers-parliament/",
            "content": "By Staff Reporter\n\nPARLIAMENTARY Public Accounts Committee (PAC) chairperson Charlton Hwende says the Finance ministry has, over the years, continued to use unauthorised public funds.\n\nThe Ministry officials were supposed to appear before the PAC committee Monday but did not show up due to other commitments.\n\nHwende told journalists thatithad also failed to submit treasury minutes to Parliament for quite some time, with no explanation.\n\nFinance Ministry continues to spend way more than what Parliament appropriates without coming back to Parliament.\n\nWe have not entertained any condemnation views from the ministry for quite some time, and the most worrying thing is that they have not been submitting Treasury Minutes to Parliament, Hwende said.\n\nPAC chairperson Chalton Hwende\n\nHwende highlighted that the ministry was obliged by the laws of the country to respond to the recommendations through treasury minutes, and it had not submitted any.\n\nThose are the issues that we want to deal with, apart from the general issues that the auditor general raised.\n\nThey have got several companies that they have been paying to supply, but they failed to get them to deliver.\n\nThere are a lot of issues that have been raised, and they need the accounting officer himself to be there, so that he can explain, because this is the Minister of Finance, and we are talking about,an auditor general report that deals with public expenditures, the budget itself, Hwende added.\n\nWe have now resolved that they must appear next week on Monday.\n\nThe Permanent Secretary has committed that he would appear, so well be meeting them on Monday.\n\nAs a committee, we are interested mainly in the way the ministry has been running its affairs. As you see, we have not yet supplemented budgets over the years.\n\nIssues of tender renewals, direct payments to service providers have been mishandled, according to the PAC chairperson.\n\nIts like they are running a separate budget outside Parliament.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Staff Reporter PARLIAMENTARY Public Accounts Committee (PAC) chairperson Charlton Hwende says the Finance ministry has, over the years, continued to use unauthorised public funds. The Ministry officials were supposed to appear before the PAC committee Monday but did not show up due to other commitments. Hwende told journalists that it had also failed to submit treasury</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/finance-ministry-using-unauthorised-public-funds-mishandling-tender-processes-and-payments-to-service-providers-parliament/\">Finance Ministry using unauthorised public funds, mishandling tender processes and payments to service providers – Parliament   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Garry Ballance roped in as Chevrons’ consultant coach for England Test",
            "url": "https://www.newzimbabwe.com/garry-ballance-roped-in-as-chevrons-consultant-coach-for-england-test/",
            "content": "By Sports Reporter\n\nFormer Zimbabwe senior mens cricket team player Garry Ballance has been appointed coaching consultant for the Chevrons landmark Test match against England.\n\nThe historical Test match will be played from May 22 to 25 at Trent Bridge in Nottingham.\n\nBallance, 35, boasts of an international cricket career which saw him featuring for England between 2013-2017 and Zimbabwe in 2023 before he retired.\n\nHe was named the ICC Mens Emerging Cricketer of the Year in 2014 and was honoured as one of Wisdens Cricketers of the Year in 2015.\n\nCommenting on Ballances appointment, Zimbabwe Cricket managing director said, We are thrilled to welcome Gary Ballance to our coaching set-up for this historic tour.\n\nHis deep understanding of English conditions, gained over years of playing at the highest level, will be a valuable asset to our teams tactical preparation.\n\nThe upcoming test match is the first in 22 years since the last clash between the two sides in 2003.\n\nZimbabwe walks into the coming Test match against England with confidence after playing a 1-1 draw against Bangladesh in a two-match series.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/08062236/Gary-Balance.png",
            "description": "<p>By Sports Reporter Former Zimbabwe senior men’s cricket team player Garry Ballance has been appointed coaching consultant for the Chevrons’ landmark Test match against England. The historical Test match will be played from May 22 to 25 at Trent Bridge in Nottingham. Ballance, 35,  boasts of an international cricket career which saw him featuring for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/garry-ballance-roped-in-as-chevrons-consultant-coach-for-england-test/\">Garry Ballance roped in as Chevrons’ consultant coach for England Test</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Emergency outage at Hwange Power Station caused by acidic water contamination",
            "url": "https://www.newzimbabwe.com/emergency-outage-at-hwange-power-station-caused-by-acidic-water-contamination/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Electricity Supply Authority (ZETDC) has said the recent technical fault at Hwange Power Station Unit was caused by a tube leak, which affected all units.\n\nThis follows a notice issued Sunday, by the power utility stating that the fault would necessitate increased load-shedding.\n\nIn a statement, ZETDC said the acidic water caused fractures to boiler tubes, leading to severe damage to five units.\n\nAround the same time, abnormal water chemistry was detected, with the water exhibiting elevated conductivity and significantly low pH levels, indicating possible contamination by acidic material. This led to all units at the station being affected, causing an emergency outage at the plant.\n\nSubsequent investigations have identified the water treatment plant as the source of the contamination. Immediate corrective actions were taken, including isolation of the treatment plant and flushing out of all affected systems. The water supply has since been stabilized and is now adequate for plant operations.\n\nHowever, the acidic water has caused fractures to boiler tubes on the units. Significant tube leaks were identified on Units 1 and 2, while Units 3, 4 and 6, which were also online on the day, are being assessed, reads the statement.\n\nZETDC has said that the affected 5 units are expected to be fully operational by Friday.\n\nRepairs are now in progress on units 1 and 2. The first unit is expected to return to service at midnight Tuesday into morning of Wednesday, 7 May 2025, reads the statement.\n\nPressure testing and repairs on Units 3, 4 and 6 are ongoing. This will be followed by requisite repairs. All five affected units are projected to be fully operational by the end of day on Friday, 9 May 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/09033305/Hwange-Power-Station.png",
            "description": "<p>By Staff Reporter The Zimbabwe Electricity Supply Authority (ZETDC) has said the recent technical fault at Hwange Power Station Unit was caused by a tube leak, which affected all units. This follows a notice issued Sunday, by the power utility stating that the fault would necessitate increased load-shedding. In a statement, ZETDC said the acidic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/emergency-outage-at-hwange-power-station-caused-by-acidic-water-contamination/\">Emergency outage at Hwange Power Station caused by acidic water contamination </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Jah Prayzah receives latest vehicle, US$150k from controversial Chivayo",
            "url": "https://www.newzimbabwe.com/jah-prayzah-receives-latest-vehicle-us150k-from-controversial-chivayo/",
            "content": "By Darlington Gatsi\n\nBARELY a week after releasing his 14th studio album Jah Prayzah has received the latest Range Rover Autobiography and money from controversy-ridden tenderpreneur Wicknell Chivayo.\n\nJah Prayzah, who has never hidden his affinity for the ruling party, Zanu PF, has become a beneficiary of Chivayos generosity yet again.\n\nThe latest gift, a Range Rover Autobiography, is worth over US$200,000, along with US$150,000 in cash.\n\nThe gift comes as the Zanu PF government faces backlash over the deteriorating state of the health system, which is characterised by a lack of medical supplies.\n\nAmid the dire state of healthcare, Zanu PF has been accused of lavishing gifts on its supporters while neglecting the general populace.\n\nAnnouncing the gift, Chivayo said it was in recognition of Jah Prayzahs achievements following the launch of his album Ndini Mukudzei at Old Hararians Club.\n\nAs I promised before, and in celebration of your unstoppable progress and the major success of the launch of Ndini Mukudzei last Saturday, please go and see Victor at Exquisite Motorsyour brand-new 2025 Range Rover Autobiography is fully paid for and ready for collection.\n\nA GOAT like you deserves to drive nothing but the highest luxury. In addition, please collect your US$150,000 in cash as promised.\n\nThis is just a small token of my gratitude for your immense contribution to Zimbabwean music and your patriotism in uniting thousands of people through music, preaching peace, love, and unity in every song, posted Chivayo on social media.\n\nChivayo was last month implicated by South African financial institutions in receiving money from Ren-Form CC, which was awarded a tender by the Zimbabwe Electoral Commission (ZEC) during the 2023 elections. Ren-Form CC allegedly charged inflated prices for the goods.\n\nFunds amounting to R800 million were traced to accounts linked to Chivayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/06145611/WhatsApp-Image-2025-05-06-at-15.30.25.jpeg",
            "description": "<p>By Darlington Gatsi BARELY a week after releasing his 14th studio album Jah Prayzah has received the latest Range Rover Autobiography and money from controversy-ridden tenderpreneur Wicknell Chivayo. Jah Prayzah, who has never hidden his affinity for the ruling party, Zanu PF, has become a beneficiary of Chivayo’s generosity yet again. The latest gift, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jah-prayzah-receives-latest-vehicle-us150k-from-controversial-chivayo/\">Jah Prayzah receives latest vehicle, US$150k from controversial Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Journalist Mhlanga granted US$500 bail",
            "url": "https://www.newzimbabwe.com/journalist-mhlanga-granted-us500-bail/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga bail.\n\nThis followed his successful appeal through his lawyers, Advocate Thabani Mpofu and Chris Mhike.\n\nThe accused be and is hereby granted bail. He is to deposit US$500 bail with the clerk of court, said the judge.\n\nThere are indeed changed circumstances. Im of the view that the court a quo misdirected itself. The appellant is a permanent resident of this country.\n\nTo allay the fears, the state can place conditions to ensure that he does not interfere and abscond.\n\nThe judge said the fear of interference does not stand because the docket is now complete.\n\nThe appeal was his second before the High Court.\n\nMhlanga had been denied bail thrice.\n\nHis lawyer, Advocate Thabani Mpofu, who is taking instructions from Chris Mhike, urged the judge to grant the journalist freedom, submitting that there have been changed circumstances.\n\nMpofu said Mhlanga was locked up following calls for protests by war veteran Blessed Geza, but people did not flood the streets as called for.\n\nThe lawyer also said that when Geza called for a national shutdown, people went on with their business.\n\nWe submit that there was an obvious change in circumstances and the court a quo misdirected itself in dealing with a question that was placed before it.\n\nThere have been changes that serve to address the concerns that were initially raised by the courts in denying the appellant bail.\n\nThe charge is transmitting material with the intention of inciting violence. It is critical to consider the importance of the charge.\n\nIt was transmission linked to an event or events and this said, the appellant is a journalist, he asked questions in an interview and answers were given, so if there is an allegation that material meant to incite violence was transmittedthe time of the protests has come and gone.\n\nMay this court take judicial notice that the first call of protest was made and there were no people who flooded the streets.\n\nThere was a call for a national shutdown, but people went on with their business.\n\nWhat is alleged by the state to be the transmission of inciting messages has come and gone. What has not come and gone is the continuity of the incarceration of the appellant in jail.\n\nPart of the reasons for denying bail was that there might be disturbance of peacedisturbance in connection with the event.\n\nMpofu said there was no violence in the country, adding that even the judge, being a Zimbabwean, has noticed this.\n\nMhlanga has filed an application seeking direct access to the Constitutional Court, arguing that he was unlawfully arrested and charged.\n\nThe passage of time in this matter must constitute a changed circumstance. It constitutes a change in circumstance that entitles the appellant to bail.\n\nIf there is no evidence that links him to the crime, he should not be in jail, Mpofu said.\n\nIn challenging the granting of bail to Mhlanga, the state said there is electronic and video evidence.\n\nThe police said they have overwhelming evidence. This means they have gathered the evidence. They have assessed it and came to the conclusion that it is overwhelming. Under those circumstances, there has been a passage of time, and all the witnesses have been interviewed.\n\nSo, My Lord, there is no longer evidence to be interfered with.\n\nThe protests have come and gone.\n\nThat has to have changed circumstances, he said.\n\nFungai Nyahunzvi, representing the state, said prosecution is still opposed to bail.\n\nHe said the argument that Mhlanga has not interfered with witnesses and evidence does not stand and does not change the complexion of the case.\n\nThe fear is still being held. The trial date has now been given.\n\nOne circumstance that has changed is that there has been passage of time, which has given the state time to prepare for trial, and now we are saying we are now ready for trial.\n\nIf we had not done so may be the argument that they have failed to give us a trial date would have helped their case, he said.\n\nHe also said that if granted bail, he might influence witnesses not to testify.\n\nAs we speak, there are people who are appearing in this court after taking heed of the calls to protests so we still have that fear, said the prosecutor.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga bail. This followed his successful appeal through his lawyers, Advocate Thabani Mpofu and Chris Mhike. “The accused be and is hereby granted bail. He is to deposit US$500 bail with the clerk of court,” said the judge. “There</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-mhlanga-granted-us500-bail/\">Journalist Mhlanga granted US$500 bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Unwarranted mischievous attacks – Health Ministry dismisses Machakaire’s plea for redress of deteriorating public health care system",
            "url": "https://www.newzimbabwe.com/unwarranted-mischievous-attacks-health-ministry-dismisses-machakaires-plea-for-redress-of-deteriorating-public-health-care-system/",
            "content": "By Thandiwe Garusa\n\nThe Ministry of Health and Child Care has dismissed Youth Empowerment Minister Tinoda Machakaires call for President Emmerson Mnangagwa to urgently address the dire situation in public hospitals.\n\nMachakaire took to social media to lament the deteriorating conditions in public hospitals after his relative sought medical attention at one such facility.He urged President Mnangagwa to visit public hospitals personally to witness the crisis firsthand.\n\nHowever, in a statement Tuesday, the Ministry of Health dismissed Machakaires remarks as unwarranted and mischievous attacks that deliberately ignore the critical services being provided despite limited resources.\n\nThe Ministry of Health and Child Care has taken note of recent negative remarks circulating on social media, which appear to form part of a broader pattern of unwarranted and mischievous attacks.\n\nThese comments seem to be well-orchestrated efforts aimed at selectively highlighting challenges within the public healthcare system, while deliberately overlooking the critical services still being providedoften under resource-constrained conditionsand the significant progress made in recent years, reads the statement.\n\nZimbabwes public hospitals suffer from dilapidated infrastructure and an inadequate supply of medicines, with patients often required to pay for essentials such as blood, drugs, and diagnostic services.\n\nAdditionally, healthcare workers remain poorly paid.\n\nRecently, a South African had to be airlifted back home from Bulawayo, where he had fallen ill and could not get adequate medical treatment.\n\nDespite all these concerns, the Health Ministry did not acknowledge that the healthcare system is in crisis and instead made vague claims that notable improvements have been made under Mnangagwas leadership.\n\nWhile we recognise and respect the publics right to express concerns, and we welcome constructive engagement from all citizens and leaders, it is vital that such discourse remains fair, balanced, and based on verified facts.\n\nThe Ministry is open to meaningful dialogue and informed critique; however, we strongly reject narratives that unfairly undermine the tireless efforts of our healthcare professionals and ignore the notable achievements underway across the country.\n\nWe therefore call upon all public officials, civil society actors, the private sector, and development partners to work together in good faith to address challenges within the health sector. Collaboration, not confrontation, is the path to sustainable progress.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/08044936/mombeshora.webp",
            "description": "<p>By Thandiwe Garusa The Ministry of Health and Child Care has dismissed Youth Empowerment Minister Tinoda Machakaire’s call for President Emmerson Mnangagwa to urgently address the dire situation in public hospitals. Machakaire took to social media to lament the deteriorating conditions in public hospitals after his relative sought medical attention at one such facility. He urged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unwarranted-mischievous-attacks-health-ministry-dismisses-machakaires-plea-for-redress-of-deteriorating-public-health-care-system/\">Unwarranted mischievous attacks – Health Ministry dismisses Machakaire’s plea for redress of deteriorating public health care system</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        },
        {
            "title": "Proplastics slams tight policy inducing ZWG scarcity",
            "url": "https://www.newzimbabwe.com/proplastics-slams-tight-policy-inducing-zwg-scarcity/",
            "content": "By Alois Vinga\n\nLISTED pipes and fittings manufacturers, Proplastics Limited, have blamed the implementation of tight Monetary Policy for ZWG shortages, which have hit the business flows.\n\nWhile credited for relative exchange rate stability, which has seen exchange rates hovering between ZWG26 to ZWG32, experts believe the current stability is stage-managed and risks going haywire in the event of the Treasury removing the tight grip on money supply.\n\nEchoing similar sentiments this week, despite a promising start to the quarter, the environment remains constrained by liquidity issues, low economic activity and increasing power disruptions.\n\nThe tight monetary policy measures currently in place have resulted in the scarcity of the local currency, with the resulting slowing in Government projects. Whilst the exchange rate and inflation have been brought under control, the availability of ZWG remains limited, thereby negatively impacting potential revenue streams, the company said.\n\nProplastics said the increase in the foreign currency surrender requirement from 25% to 30% for exports has not only eroded the competitiveness of our exports but has also negatively impacted overall market positioning and exporting viability.\n\nRevenue for the first quarter was primarily received in US$, with US$ payments dominating transactions throughout the period.\n\nIn the current quarter, the formal market, particularly the retail sector, the company made appeals for a reduction in the cost of doing business and the removal of informal sector advantages.\n\nDespite the prevailing liquidity issues, the quarterly sales volumes grew by 11% over the prior period. Revenue grew by 3% to US$4,263 million against US$4,123 million achieved in the prior period, without any export contribution recorded in the current quarter.\n\nProduction volumes also increased by 11% against the previous period, as the business cleared supply backlogs and replenished stocks for high-demand products. The raw material supply remained consistent throughout the quarter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/26072344/Proplastics.jpg",
            "description": "<p>By Alois Vinga LISTED pipes and fittings manufacturers, Proplastics Limited, have blamed the implementation of tight Monetary Policy for ZWG shortages, which have hit the business flows. While credited for relative exchange rate stability, which has seen exchange rates hovering between ZWG26 to ZWG32, experts believe the current stability is stage-managed and risks going haywire</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/proplastics-slams-tight-policy-inducing-zwg-scarcity/\">Proplastics slams tight policy inducing ZWG scarcity </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "07 May 2025"
        }
    ]
}