{
    "news": [
        {
            "title": "Cyclone Chido leaves death, damage from Mauritius to Mozambique",
            "url": "https://www.newzimbabwe.com/cyclone-chido-leaves-death-damage-from-mauritius-to-mozambique/",
            "content": "Bloomberg\n\nRescue workers are racing to save lives and repair damage wrought by Tropical Cyclone Chido in a string of islands across the southwestern Indian Ocean.\n\nThe official death toll in the French territory of Mayotte, an archipelago off the coast of Mozambique that was hit the hardest, was 22 as of Tuesday morning, along with 1 400 injuries, local official Ambdilwahedou Soumaila told Radio France Internationale. But authorities say the number of dead is likely to rise into the hundreds in the worst storm to hit the area in nearly a century.\n\nFrance instituted a curfew from 10 pm to 4 am local time starting Tuesday and President Emmanuel Macron said he would travel to Mayotte in coming days and decree a day of national mourning, while the US State Department has said its ready to offer assistance.\n\nFrances interior minister, Bruno Retailleau, arrived in the capital Mamoudzou on Monday, as the nation rushed hundreds of soldiers and firefighters to assist in recovery efforts. He said the island is totally devastated\n\nThe storm developed in the Indian Ocean from Dec. 7 to 8, hitting Agalega, a dependency located 1,000 kilometers north of Mauritius on December 11, before intensifying north of Madagascar, slamming into the French territory of Mayotte and making landfall in Mozambique on Sunday.\n\nChido hit Mauritius Agalega atoll last Wednesday at more than 200 kilometers per hour, a force that damaged equipment designed to record wind speed, Mauritius Prime Minister Navinchandra Ramgoolam told lawmakers Tuesday. The islands are home to an India-financed and constructed airstrip and jetty.\n\nApproximately 95% of buildings including homes, the hospital, the police and the national coast guards facilities in the north island have been destroyed, he said in response to a parliamentary question. Around 98% of the infrastructure are completely damaged in the south of the island.\n\nThere were no casualties, he said.\n\nThe storm then hit the densely populated Mayotte. Around one-third of the territorys 320,000 residents live in shantytowns, whose sheet-metal roofs are vulnerable to high winds. Mayotte is Frances poorest territory and is heavily dependent on aid from Paris.\n\nChido made landfall in northern Mozambique on Dec. 15 south of Pemba port, dumping more than 250 millimeters of rain in 24 hours. At least 34 people died, with more than 35,000 houses completely or partially destroyed, according to a preliminary assessment from the southeast African nations disaster management institute on Tuesday.\n\nThe storm weakened as it moved inland and will dissipate near Zimbabwe later on Tuesday, the United Nations Office for the Coordination of Humanitarian Affairs said in a report.\n\nMozambique has been rocked by weeks of protests against what opposition leader Venncio Mondlane said were fraudulent elections on Oct. 9. Mondlane was set to announce a new round of demonstrations on Monday, but Chidos wreckage prompted him to postpone these until December 23, by when the Constitutional Council is due to validate the election results.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18064241/chido.jpg",
            "description": "<p>Bloomberg Rescue workers are racing to save lives and repair damage wrought by Tropical Cyclone Chido in a string of islands across the southwestern Indian Ocean. The official death toll in the French territory of Mayotte, an archipelago off the coast of Mozambique that was hit the hardest, was 22 as of Tuesday morning, along</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cyclone-chido-leaves-death-damage-from-mauritius-to-mozambique/\">Cyclone Chido leaves death, damage from Mauritius to Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Amalgamated Regional Trading suffers a 15% export volume decline",
            "url": "https://www.newzimbabwe.com/amalgamated-regional-trading-suffers-a-15-export-volume-decline/",
            "content": "By Alois Vinga\n\nAMALGAMATED Regional Trading (ART) has suffered a 15% export volume decline on the back of acute foreign currency shortages affecting the region.\n\nPresenting the groups performance for the period ended September 30 2024, Art chairman, Dr Thomas Wushe said export volumes during the period were depressed.\n\nExport volumes declined by 15% compared to the prior year. The foreign currency shortages in the region continued resulting in significant payment delays in Zambia and Malawi, he said.\n\nHe said during the period, the group had a difficult year and was not able to deliver the expected level of financial performance as the ongoing transformation of the business was severely impacted by the changes in the economic environment.\n\nThe bold and defensive decisions taken to scale back investment in the Paper segment during the year resulted in significant losses in the Paper divisions after taking into account once-off restructuring costs and under-recoveries.\n\nThe energy storage, timber and stationery businesses delivered resilient performances as they remain foundationally strong but power shortages during the period exacerbated product availability challenges in the peak season.\n\nRevenue for the year decreased by 11% from the prior year due to product availability challenges and the deliberate scaling down of Paper production.\n\nGross profit margins at 44% improved by 2 percentage points benefiting from the change in sales mix with the slowdown of the low-margin paper volumes. Operating expenses increased as currency movements drove service providers to move to hard currency and hedge against further value loss.\n\nThe Group was relentless in its drive to fix, strengthen and reposition the business. Overall short-term bank debt was reduced substantially as proceeds from property disposals were applied towards loans. Finance costs remained relatively high, reducing by 6% from the prior year.\n\nWe anticipate that the market conditions will remain unpredictable and challenging as the underlying economic problems are being addressed.\n\nThe Board remains confident that the ongoing restructuring efforts and decisions taken will see the gradual strengthening of the Group and increased agility in taking of opportunities identified in all our business units, added Wushe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18061320/Dr-Wushe.png",
            "description": "<p>By Alois Vinga AMALGAMATED Regional Trading (ART) has suffered a 15% export volume decline on the back of acute foreign currency shortages affecting the region. Presenting the group’s performance for the period ended September 30 2024, Art chairman, Dr Thomas Wushe said export volumes during the period were depressed. “Export volumes declined by 15% compared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amalgamated-regional-trading-suffers-a-15-export-volume-decline/\">Amalgamated Regional Trading suffers a 15% export volume decline</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Harare Mayor Mafume blames informal settlements, obsolete equipment for Lake Chivero disaster",
            "url": "https://www.newzimbabwe.com/harare-mayor-mafume-blames-informal-settlements-obsolete-equipment-for-lake-chivero-disaster/",
            "content": "By Mary Taruvinga\n\nHarare Mayor Jacob Mafume has blamed informal settlements for compounding the contamination crisis in Lake Chivero stating that there is a need to stop or regulate them.\n\nMafume was addressing journalists at a press briefing held to give an update regarding the ecological disaster unearthed last weekend.\n\nThe mayor also said Harare is relying on obsolete infrastructure which is now failing to cope with the growing population in the city.\n\nWe have sewer works but they are not at full capacity because they were designed many years ago and cannot deal with the effluent and the quantities that go there and the natural growth of the city.\n\nThere are informal settlements that have been formed in and around Lake Chivero that then create a situation where there are too much pollution levels.\n\nWe are also concerned about the pollution. As the pollution increases,\n\nMafume said they need resources to build new water sources and upgrade the water system.\n\nHe said these are early days to say much about the situation evolving at Chivero, however indicating that experts, city officials, government officials and other stakeholders willsoonbe visiting the lake to get an understanding.\n\nTests will guide us on what needs to be done, he said.\n\nThe City of Harare was blamed for causing contamination of Lake Chivero by discharging raw sewage into the water body.\n\nThis followed the deaths of four rhinos, fish and wildlife in a contamination scare that has pushed authorities into action.\n\nLake Chivero serves as the primary source of water for Harare residents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Mary Taruvinga Harare Mayor Jacob Mafume has blamed informal settlements for compounding the contamination crisis in Lake Chivero stating that there is a need to stop or regulate them. Mafume was addressing journalists at a press briefing held to give an update regarding the ecological disaster unearthed last weekend. The mayor also said Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-mayor-mafume-blames-informal-settlements-obsolete-equipment-for-lake-chivero-disaster/\">Harare Mayor Mafume blames informal settlements, obsolete equipment for Lake Chivero disaster</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "NPA enlists 34 new prosecutors, move set to improve justice delivery system",
            "url": "https://www.newzimbabwe.com/npa-enlists-34-new-prosecutors-move-set-to-improve-justice-delivery-system-2/",
            "content": "By Staff Reporter\n\nTHE National Prosecuting Authority (NPA) has recruited 34 new public prosecutors in a bid to enhance the justice delivery system saddled by case backlogs due to short-staffing.\n\nThe cohort of rookie prosecutors recently underwent a week-long induction workshop to acquaint them with the needs of their profession.\n\nAddressing the group of recruits, Deputy Prosecutor-General, Nelson Mutsonziwa said continuous learning, diligence and integrity were key to remaining relevant in the job.\n\nBe well-read, apply yourselves diligently, be sensitive to the needs of the victims of crime, and always shy away from corruption, said Mutsonziwa.\n\nThe induction course focussed on the structure of the NPAZ, standard operating procedures, ethics and the statutes governing their profession.\n\nWe wish them all the best in their new roles, he added.\n\nThe shortage of public prosecutors, just like magistrates, has witnessed the delay in the kick-off of trials, thereby denying citizens timely justice.\n\nThe 34 new public prosecutors are set to be deployed to various stations across the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18042034/GeWHZLWWsAAzW80.jpeg",
            "description": "<p>By Staff Reporter THE National Prosecuting Authority (NPA) has recruited 34 new public prosecutors in a bid to enhance the justice delivery system saddled by case backlogs due to short-staffing. The cohort of rookie prosecutors recently underwent a week-long induction workshop to acquaint them with the needs of their profession. Addressing the group of recruits,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/npa-enlists-34-new-prosecutors-move-set-to-improve-justice-delivery-system-2/\">NPA enlists 34 new prosecutors, move set to improve justice delivery system </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Botswana President rubbishes “baseless claims” he was given 10 Ankole cattle by Mnangagwa; opposition calls it a “dirty gift”",
            "url": "https://www.newzimbabwe.com/botswana-president-rubbishes-baseless-claims-he-was-given-10-ankole-cattle-by-mnangagwa-opposition-calls-it-a-dirty-gift/",
            "content": "By Staff Reporter\n\nBotswana President Duma Boko has rubbished claims that he was given 10 cattle of the elite Ankole breed by his Zimbabwean counterpart, President Emmerson Mnangagwa, during a recent SADC meeting in Harare.\n\nThe big-horned cattle breed which is becoming increasingly popular among Africas Heads of State is also owned by Ugandan President Yoweri Museveni, South Africas Cyril Ramphosa breeds them at his Phala Phala Farm and Mnangagwa at his Precabe Farm in Kwekwe.\n\nThis follows a report by a Botswana publication, Tuesday Grill, which revealed that Boko had accepted the gift out of courtesy, despite historical disagreements with Mnangagwa on issues like human rights and was yet to take the herd to Botswana.\n\nThe Ankole cattle\n\nIn a statement, Boko, through his press secretary, Emang Mutapati, said he has no farming experience and has not received any cattle from Mnangagwa.\n\nThe Office of the President categorically refutes false allegations that President Duma Boko has received any breed of cows or similar gifts from His Excellency President Emmerson Mnangagwa of the Republic of Zimbabwe.\n\nPresident Boko has never been involved in farming, either as a cattle rancher or any other manner, reads the statement.\n\nThese baseless and unfounded claims are therefore a deliberate act of propaganda designed to mislead the public, detract from the critical work of the administration, and tarnish the strong diplomatic relations between Botswana and Zimbabwe. We urge the public to dismiss these misleading allegations with the contempt they deserve, reads the statement.\n\nMutapati added, The relationship between President Boko and President Mnangagwa remains diplomatic, focused solely on strengthening cooperation and fostering mutual development between the two nations.\n\nTuesday Grill, however, maintains its story is factual saying Mutapati was trying to discredit the paper.\n\nOpposition leader Job Sikhala said the dirty gift from Mnangagwa was to lure Boko after former President Mokwetsi Masisi,the candidate Zanu PF was backing in the recent Botswana elections lost.\n\nTo spin their embarrassment they are doing everything possible to soil and destroy the public image and trust of the new government in Botswana by going there and start throwing such gifts as announced in the story by the Tuesday Grill to tarnish the image of the new sheriff in Botswana, said Sikhala\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18035757/duma-boko-mnangagwa.jpg",
            "description": "<p>By Staff Reporter Botswana President Duma Boko has rubbished claims that he was given 10 cattle of the elite Ankole breed by his Zimbabwean counterpart, President Emmerson Mnangagwa, during a recent SADC meeting in Harare. The big-horned cattle breed which is becoming increasingly popular among Africa’s Heads of State is also owned by Ugandan President</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/botswana-president-rubbishes-baseless-claims-he-was-given-10-ankole-cattle-by-mnangagwa-opposition-calls-it-a-dirty-gift/\">Botswana President rubbishes “baseless claims” he was given 10 Ankole cattle by Mnangagwa; opposition calls it a “dirty gift”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Mbudzi Interchange renamed Trabablas after Mnangagwa’s nickname",
            "url": "https://www.newzimbabwe.com/mbudzi-interchange-renamed-trabablas-after-mnangagwas-nickname/",
            "content": "By Staff Reporter\n\nThe Zanu PF-led government has dropped the original name of Mbudzi roundabout and retitled it Trabablas Interchange, President Emmerson Mngangagwas nom-de-guerre during the countrys liberation war.\n\nIn recent years, government has renamed streets and roads after Mnangagwa, who is rumoured to harbour ambitions of running for a third presidential term, although he has publicly spurned overtures by party organs to stay beyond his second and final term that ends in 2028.\n\nThe government argues renaming the roadworks Trabablas after Mnangagwas liberation war name was a gesture of recognising the unmatched development trajectory on which he has put Zimbabwe.\n\nAddressing journalists in Harare at a post-Cabinet briefing Tuesday, Information Minister, Jenfan Muswere said that the name change, proposed by Justice Minister Ziyambi Ziyambi as the acting chairperson of the Cabinet Committee on Place Names, had beenapproved.\n\nCabinet wishes to advise that upon completion, the Mbudzi Interchange will be named Trabablas Interchange in recognition of the visionary leadership of His Excellency the President Cde Dr Emmerson Dambudzo Mnangagwa, Muswere said.\n\n\"Cabinet wishes to advise that upon completion, the Mbudzi Inter-change will be named \"Trabablas Inter-change,\" in recognition of the visionary leadership of His Excellency, the President Cde Dr. Emmerson Dambudzo Mnangagwa,\" said Minister Muswerepic.twitter.com/7MfM2bKtmn\n\n NewZimbabwe.com (@NewZimbabweCom)December 17, 2024\n\nBefore its upgrade, the Mbudzi roundabout was notorious for traffic congestion, particularly during peak hours, as motorists struggled to navigate past the intersection, which is yet to be completed.\n\nHe said the Cabinet also received and approved the renaming of Headquarters 1 Infantry Brigade, Headquarters Bulawayo District and Zimbabwe School of Infantry Army Barracks, which was presented by Ziyambi.\n\nFollowing the promulgation of a Defence Cantonment Notice of 2017 and the subsequent renaming of Headquarters 1 Infantry Brigade, Headquarters Bulawayo District and the Zimbabwe School of Infantry, Cabinet has now directed that the Army Barracks should retain their original names.\n\nAccordingly, Headquarters1 now retains the name Khumalo Barracks; Headquarters Bulawayo District retains the name Imbizo Barracks; and the Zimbabwe School of Infantry be renamed Lookout Masuku Barracks, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/13102416/Jenfan-Muswere-scaled.jpg",
            "description": "<p>By Staff Reporter The Zanu PF-led government has dropped the original name of Mbudzi roundabout and retitled it Trabablas Interchange, President Emmerson Mngangagwa’s nom-de-guerre during the country’s liberation war. In recent years, government has renamed streets and roads after Mnangagwa, who is rumoured to harbour ambitions of running for a third presidential term, although he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mbudzi-interchange-renamed-trabablas-after-mnangagwas-nickname/\">Mbudzi Interchange renamed Trabablas after Mnangagwa’s nickname</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Govt says Presidential solarisation project for rural communities will benefit 200,000 in 2025",
            "url": "https://www.newzimbabwe.com/govt-says-presidential-solarisation-project-for-rural-communities-will-benefit-200000-in-2025/",
            "content": "By Thandiwe Garusa\n\nTHE government says in 2025 it will implement a highly ambitious Presidential Solarisation project that will benefit 200,000 people every year in rural areas nationwide.\n\nAddressing journalists during a post-cabinet media briefing Tuesday, Information Minister Jenfan Muswere said the project which will run for five years will benefit 200 000 beneficiaries.\n\nThe government-backed initiative will provide rural communities with affordable, state-of-the-art solar energy systems to power various appliances and devices.\n\nCabinet approved the Presidential Solarisation Project which is a livelihoods initiative aimed at providing sustainable renewable solar energy to household beneficiaries across the eight rural provinces of the country.\n\nThe project targets approximately 200,000 beneficiaries a year and will run for a period of five years starting from 2025.\n\nThe Rural Infrastructural Development Agency (RIDA) will oversee the implementation of the Project through an Inter-Ministerial Steering Committee architecture incorporating experts from local universities.\n\nThe Project will be financed by the government and other stakeholders and will provide affordable but advanced solar technologies (batteries, inverters, solar panels and cables) to power gadgets such as light bulbs, radios, televisions, phone chargers, laptops, small refrigerators, submersible pumps and WiFi.\n\nLocal youths and women will be trained to participate in the installation programmes implemented in the districts and villages across the eight rural provinces of the country, Muswere said.\n\nFor the past few years, Zimbabwe has been grappling with extensive load shedding and most of its urban areas are currently experiencing power outages lasting more than 18 hours a day.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/01/29093058/Solar.jpg",
            "description": "<p>By Thandiwe Garusa THE government says in 2025 it will implement a highly ambitious Presidential Solarisation project that will benefit 200,000 people every year in rural areas nationwide. Addressing journalists during a post-cabinet media briefing Tuesday, Information Minister Jenfan Muswere said the project which will run for five years will benefit 200 000 beneficiaries. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-says-presidential-solarisation-project-for-rural-communities-will-benefit-200000-in-2025/\">Govt says Presidential solarisation project for rural communities will benefit 200,000 in 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "219 pregnancies aborted daily in Zimbabwe – study",
            "url": "https://www.newzimbabwe.com/219-pregnancies-aborted-daily-in-zimbabwe-study/",
            "content": "By Mary Taruvinga\n\nThe Women and Law in Southern Africa (WILSA) is concerned with maternal mortality and other complications arising from unsafe abortions among adolescents and women which has seen them celebrating a recent landmark ruling outlawing the prohibition of safe abortions.\n\nAddressing the media in Harare on Tuesday WILSA National Director Isheanesu Chirisa disclosed alarming statistics that studies from 2019 show that 219 abortions take place daily in Zimbabwe.\n\nChirisa also said studies have revealed that 40% of pregnancies in Zimbabwe between 2016 and 2017 were unintended.\n\nShe said 25% of such unwanted pregnancies end up in illegal abortion that also takes place in unsafe and unhealthy conditions.\n\nIn 2019 according to Parliament, there were 80,000 abortions in Zimbabwe and of the 80 000 abortions they translated to 219 abortions per day or nine abortions every hour.\n\nOf these abortions, about 185 are abortions that take place within adolescents.\n\nWithout safe abortions being allowed under the law, adolescents often find themselves resorting to backstreet abortions.\n\nChirisa said at times this is due to the medical costs involved.\n\nRecently, WILSA won a case in which they sued the Health Minister, Douglas Mombeshora, the Parliament of Zimbabwe and Attorney General Prince Machaya seeking to overturn the existing laws.\n\nThe applicants were represented by their lawyer Tendai Biti.\n\nIn his ruling High Court judge Maxwell Takuva noted that the matter was significant in light of the massive instances of teenage pregnancies in Zimbabwe, and consequently illegal teen abortions and teenage mortalities.\n\nWILSA had also mentioned that marital rape having been criminalised, the victims should also have access to legal abortion.\n\nBiti said it is their hope that the Constitutional Court confirms the judgement so that it becomes operational.\n\nThe lawyer said it is unfortunate that children are dying during these unsafe abortions.\n\nHe said children should be protected by the law however noting that more still needs to be done since the law works against women only who are victims in most cases while silent about men.\n\nThe Termination of Pregnancy Act is a very harsh law because it imposes custodial sentences for women who choose to abort. It is a fundamentally discriminatory law. It criminalises the victim and that on its own is problematic so you (women) must grab the bull by the horns and confront the courts on a real argument, he said.\n\nEdna Masiiwa the director of Women Action Group said the law is outdated having been enacted in 1977.\n\nIt is a law that does not serve todays woman, she said.\n\nZimbabwean abortion law is currently highly restrictive, with stringent requirements for the limited grounds on which abortion is allowed, based on very archaic legislation enacted in Rhodesia with no contemporary proven benefit for women and society at large.\n\nDespite the existence of permissible circumstances for abortion outlined in the Termination of Pregnancy Act, access to safe and legal abortion remains a challenge for many women, especially the rural and poor given the strenuous legal and administrative barriers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/01034132/Abortion.jpg",
            "description": "<p>By Mary Taruvinga The Women and Law in Southern Africa (WILSA) is concerned with maternal mortality and other complications arising from unsafe abortions among adolescents and women which has seen them celebrating a recent landmark ruling outlawing the prohibition of safe abortions. Addressing the media in Harare on Tuesday WILSA National Director Isheanesu Chirisa disclosed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/219-pregnancies-aborted-daily-in-zimbabwe-study/\">219 pregnancies aborted daily in Zimbabwe – study   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Biti says fight against Mnangagwa’s bid for illegal third term must dominate 2025",
            "url": "https://www.newzimbabwe.com/biti-says-fight-against-mnangagwas-bid-for-illegal-third-term-must-dominate-2025/",
            "content": "By Leopold Munhende\n\nFORMER opposition Citizens Coalition for Change (CCC) top official Tendai Biti believes the fight against President Emmerson Mnangagwas illegal bid for a third term in office must dominate next year.\n\nMnangagwa, who has been at the helm of Zimbabwes government since 2017, is reportedly eyeing a third term despite the countrys constitution limiting him to only two terms.\n\nRuling Zanu PF provinces, starting with his home town of Masvingo, have already started canvassing for support to have him stay on until 2030.\n\nBiti, who announced a sabbatical from politics following the demise of a once powerful CCC, warned that Zanu PF will do everything in its power to ensure Mnangagwa stays in power.\n\nThe biggest fight we face in 2025 is the unlawful unconstitutional attempts to force march an extension of the Presidential Term Limit, wrote Biti on X.\n\nThey will pull no stops to achieve this nefarious agenda. We have to be ready to say no to fascism &authoritarian consolidation #NoToA3Term\n\nMnangagwa is reportedly in a cold war with his deputy Constantino Chiwenga whom he promised the post at the height of a 2017 coup that toppled late President Robert Mugabe.\n\nMuch like in 2017 and the period before their coup, Zanu PF is riddled with factionalism most fear might result in a repeat of the forceful transfer of power, this time from Mnangagwa to Chiwenga with the militarys assistance.\n\nSupporters have ignored orders to stop chanting slogans advocating for Mnangagwa to remain in power beyond 2028 when elections are due.\n\nED 2030 has dominated most of the partys gatherings with no repercussions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/06045739/Tendai-Biti1.jpg",
            "description": "<p>By Leopold Munhende FORMER opposition Citizens Coalition for Change (CCC) top official Tendai Biti believes the fight against President Emmerson Mnangagwa’s illegal bid for a third term in office must dominate next year. Mnangagwa, who has been at the helm of Zimbabwe’s government since 2017, is reportedly eyeing a third term despite the country’s constitution</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/biti-says-fight-against-mnangagwas-bid-for-illegal-third-term-must-dominate-2025/\">Biti says fight against Mnangagwa’s bid for illegal third term must dominate 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        },
        {
            "title": "Fishing activities suspended at Lake Chivero following contamination exposè",
            "url": "https://www.newzimbabwe.com/fishing-activities-suspended-at-lake-chivero-following-contamination-expose/",
            "content": "By Staff Reporter\n\nFishing activities have been suspended with immediate effect in Lake Chivero following a shocking expos by NewZimbabwe.coms Investigative Journalist Mary Taruvinga that the lake has become infested with cyanobacteria which is killing thousands of fish, wildlife and livestock.\n\nThe Harare City Council was blamed for discharging raw effluents into the lake.\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) said preliminary investigations indicated that sewage runoff from the Marimba area has forced contaminated water into multiple bays, creating hazardous conditions for aquatic life.\n\nZimParks spokesperson Tinashe Farawo said the suspension is aimed at protecting the public while mapping the way forward.\n\nThe suspension serves as a precautionary measure and will pave the way for relevant government departments and our Research and Scientific Services team to investigate more and determine whether the consumption of the fish poses a risk to humans.\n\nDuring this time, we are increasing anti-poaching patrols and law enforcement in areas around the lake to prevent any fish from reaching the market, he said in a statement.\n\nFour white rhinos and other wildlife died after consuming the contaminated water.\n\nThousands of fish are also dying from the contamination.\n\nOn Monday ZimParks said 1,000 fish had died.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17055042/chivero-2.png",
            "description": "<p>By Staff Reporter Fishing activities have been suspended with immediate effect in Lake Chivero following a shocking exposè by NewZimbabwe.com’s Investigative Journalist Mary Taruvinga that the lake has become infested with cyanobacteria which is killing thousands of fish, wildlife and livestock. The Harare City Council was blamed for discharging raw effluents into the lake. Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fishing-activities-suspended-at-lake-chivero-following-contamination-expose/\">Fishing activities suspended at Lake Chivero following contamination exposè</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Dec 2024"
        }
    ]
}