{
    "news": [
        {
            "title": "Diaspora Insurance CEO nominated for another business gong",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-ceo-nominated-for-another-business-gong/",
            "content": "By UK Correspondent\n\nBIRMINGHAM:Diaspora InsuranceCEO, Jeff Madzingo, has been nominated for male entrepreneur of the year award at the Zimbabweans in Diaspora Homecoming Ceremony and Business Summit.\n\nWe are thrilled to congratulate on your nomination for the Male Entrepreneur Award! This is a remarkable achievement, and we are honoured to recognize your outstanding work, said the event organisers Zimbabweans in Diaspora Organisation (ZIDO.\n\nDiaspora Insurance CEO Jeff Madzingo\n\nSet to be held at the Golden Conifer Conference Centre in Harare this Friday and now its second year, the event brings together key stakeholders from the diaspora and local communities to foster networking, collaboration, and investment opportunities.\n\nKey speakers include Zimbabwes tourism and hospitality minister Barbara Rwodzi, CBZ Holdings CEO Lawrence Nyazema as well as WestProp head Ken Sharp.\n\nThis Diaspora Homecoming Dinner provides an invaluable opportunity for diasporans returning home for the holidays to connect, share their experiences of living abroad, and exchange notes on how to expand their business portfolios, said ZIDO chief executive officer Blessed Kapesa.\n\nHe added: The event is more than just a festive gathering, but serves as a strategic platform for exploring investment opportunities and recognising the diasporas significant contributions to Zimbabwes economy.\n\nMeanwhile, Madzingos nomination becomes his second major business recognition after he was named among the contenders for Top 1OO African Business Leaders and Entrepreneurs in the United Kingdom (UK) for 2024 by theAfrican Business Chamber (AfBC).\n\nLast monthMadzingowas also honoured by the Zim-UK business chamber, winning the Business Driver accolade for his significant contribution to supporting businesses and bringing people together.\n\nMadzingo has headed the UK-basedDiaspora Insurancesince its launch in 2012, overseeing the companys phenomenal growth from covering just two African countries to nineteen at present including new additions Cameroon, the Democratic Republic of Congo, Nigeria, Sierra Leone and Rwanda.\n\nFrom its recently acquired global headquarters in Birmingham, the company provides specialist and bespoke insurance products to African diasporans wherever they are based in the world.\n\nAfrican expatriates and transnationals worldwide can cover themselves in the diaspora as well as family members back home, guaranteeing peace of mind and ensuring theres no grieving and begging in times of bereavement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/16181635/Jeff-Madzingo-CEO.png",
            "description": "<p>By UK Correspondent BIRMINGHAM: Diaspora Insurance CEO, Jeff Madzingo, has been nominated for male entrepreneur of the year award at the Zimbabweans in Diaspora Homecoming Ceremony and Business Summit. “We are thrilled to congratulate on your nomination for the Male Entrepreneur Award! This is a remarkable achievement, and we are honoured to recognize your outstanding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-ceo-nominated-for-another-business-gong/\">Diaspora Insurance CEO nominated for another business gong</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "AOD 9604 Peptide: Properties and Hypothetical Functions",
            "url": "https://www.newzimbabwe.com/aod-9604-peptide-properties-and-hypothetical-functions/",
            "content": "Peptides are short chains of amino acids that play vital roles in the human body, acting as signaling molecules or mimicking natural hormones. Among the various peptides gaining traction in research and therapeutic settings is AOD 9604, a modified fragment of human growth hormone (HGH). This peptide is renowned for its potential fat-reducing properties without triggering the typical growth effects associated with HGH. In this article, well explore the properties, hypothetical functions, and potential applications of AOD 9604, while discussing where you canbuy AOD 9604from reliable sources like EnhancedPeptides.\n\nAOD 9604 is a synthetic peptide derived from the C-terminal fragment of HGH. Specifically, it includes amino acids 176191 of the HGH molecule. By isolating this fragment, researchers focused on retaining the fat-burning benefits of HGH without its broader effects on growth, making it a unique and targeted therapeutic candidate.\n\nDeveloped initially as an anti-obesity agent, AOD 9604 mimics the fat-burning properties of natural growth hormone by stimulating lipolysis (fat breakdown) and inhibiting lipogenesis (fat storage). Unlike full-length HGH, it does not bind to growth hormone receptors, minimizing unwanted side effects such as increased insulin resistance or elevated IGF-1 levels.\n\nWhile AOD 9604 is not yet FDA-approved for medical use, ongoing studies and anecdotal reports suggest several potential benefits:\n\nThe most researched function of AOD 9604 is its ability to aid in weight loss by promoting fat breakdown. For individuals struggling with obesity, it could provide a targeted solution to reduce fat deposits, particularly in stubborn areas like the abdomen or thighs.\n\nSome studies hypothesize that AOD 9604 may benefit joint repair and cartilage health. Though this area requires further investigation, its anti-inflammatory properties could make it a useful tool for athletes or individuals dealing with joint issues.\n\nBy supporting fat metabolism and potentially reducing inflammation, AOD 9604 might help individuals recover faster from physical exertion. This could make it appealing for fitness enthusiasts or athletes looking to optimize performance.\n\nAs part of HGH-derived peptides, AOD 9604 is being studied for potential anti-aging effects. These benefits may include improved metabolism, energy levels, and overall vitality.\n\nFor those interested in purchasing AOD 9604 for research purposes, its crucial to choose reliable vendors.PeptideSourceis a trusted platform offering high-quality peptides for laboratory research. They ensure purity, authenticity, and compliance with industry standards. Whether youre a researcher or medical professional, sourcing peptides like AOD 9604 fromPeptideSourceguarantees youre getting a product that meets the necessary specifications.\n\nIn many regions, AOD 9604 is available for research purposes but is not approved for human consumption or as a therapeutic drug. Individuals considering its use should consult local regulations and understand its experimental status. Additionally, its advisable to seek guidance from medical professionals before considering peptides for personal use.\n\nSeveral studies highlight AOD 9604s effectiveness in promoting fat loss. For instance, preclinical trials in rodents demonstrated significant reductions in body fat without affecting lean body mass. Human trials also showed promising results, with participants reporting fat loss without the metabolic side effects typically associated with HGH.\n\nDespite these findings, more robust clinical trials are needed to confirm its efficacy and safety in broader populations. Researchers continue to investigate its mechanisms and potential applications in obesity management and other metabolic conditions.\n\nThe appeal of AOD 9604 lies in its targeted action. Unlike traditional weight-loss solutions that can have systemic effects or require lifestyle overhauls, AOD 9604 focuses specifically on fat metabolism. Its ability to trigger lipolysis while inhibiting fat storage could make it a game-changer for obesity treatments in the future.\n\nAdditionally, the peptides favorable safety profile and minimal side effects compared to HGH add to its promise as a therapeutic agent.\n\nAOD 9604 aligns with the growing trend of using peptides for targeted therapies. Researchers are increasingly exploring peptides like AOD 9604 as alternatives to traditional pharmaceuticals, thanks to their specificity and reduced risk of systemic side effects.\n\nAOD 9604 is a peptide with immense potential in the fields of weight management, joint health, and anti-aging. Its ability to promote fat loss without the growth-related effects of HGH has made it a focus of ongoing research. While it is not yet approved for therapeutic use, its promising safety profile and targeted functions make it an exciting candidate for future developments in peptide therapy.\n\n",
            "image_url": null,
            "description": "<p>Peptides are short chains of amino acids that play vital roles in the human body, acting as signaling molecules or mimicking natural hormones. Among the various peptides gaining traction in research and therapeutic settings is AOD 9604, a modified fragment of human growth hormone (HGH). This peptide is renowned for its potential fat-reducing properties without</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/aod-9604-peptide-properties-and-hypothetical-functions/\">AOD 9604 Peptide: Properties and Hypothetical Functions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Mpox cases in Africa surpass 65,000 mark: Africa CDC",
            "url": "https://www.newzimbabwe.com/mpox-cases-in-africa-surpass-65000-mark-africa-cdc/",
            "content": "Xinhua\n\nThe number of Mpox cases reported so far this year in Africa has surpassed 65,000, as the death toll surged to over 1,200, according to the Africa Centers for Disease Control and Prevention (Africa CDC).\n\nThe African continent had reported 65,711 Mpox cases since the start of this year, of which 14,241 were confirmed, and over 1,237 deaths, according to Africa CDC Director-General Jean Kaseya.\n\nDuring last week alone, the continent reported 3,545 new cases, including 467 confirmed ones, and 37 new deaths, according to data from the African Unions specialised healthcare agency.\n\nThe Africa CDC said six African countries, namely Gabon, Guinea, South Africa, Morocco, Zambia, and Zimbabwe, have moved from active transmission to a controlled stage. The African continent is still losing people due to the ongoing Mpox outbreak, which has so far affected 20 countries, Kaseya said, calling for concerted efforts against the outbreak.\n\nIn mid-August, the Africa CDC declared the ongoing Mpox outbreak in Africa a Public Health Emergency of Continental Security. Soon after, the World Health Organization also declared Mpox a public health emergency of international concern, activating its highest level of global alert for Mpox for the second time in two years.\n\nMpox, known as monkeypox, was first detected in laboratory monkeys in 1958. It is a rare viral disease typically spread through body fluids, respiratory droplets, and other contaminated materials. The infection usually causes fever, rash, and swollen lymph nodes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14052550/mpox.jpg",
            "description": "<p>Xinhua The number of Mpox cases reported so far this year in Africa has surpassed 65,000, as the death toll surged to over 1,200, according to the Africa Centers for Disease Control and Prevention (Africa CDC). The African continent had reported 65,711 Mpox cases since the start of this year, of which 14,241 were confirmed,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mpox-cases-in-africa-surpass-65000-mark-africa-cdc/\">Mpox cases in Africa surpass 65,000 mark: Africa CDC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Anglican Church hit by new abuse claims",
            "url": "https://www.newzimbabwe.com/anglican-church-hit-by-new-abuse-claims/",
            "content": "AFP\n\nA senior Anglican bishop, who will soon take temporary charge of the scandal-hit Church, faced calls to quit on Monday over his own handling of a sexual abuse case.\n\nArchbishop of York Stephen Cottrell, the Anglican Churchs second most senior cleric, will take charge for a few months in the New Year following the resignation of Archbishop of Canterbury Justin Welby last month.\n\nWelby stepped down after an independent probe found he could and should have formally reported decades of abuse by a Church-linked lawyer to authorities in 2013.\n\nThe report found the Church of England  the mother church of Anglicanism  covered up the traumatic physical, sexual, psychological and spiritual attacks, which occurred in Britain, Zimbabwe and South Africa over several decades.\n\nNow the Bishop of Newcastle, Helen-Ann Hartley, has called for Cottrell to stand down over claims he too mishandled a sexual abuse case during his time as the Bishop of Chelmsford.\n\nCottrell let priest David Tudor stay in his post despite knowing that the Church had banned him from being alone with children and paid compensation to a sexual abuse claimant, the BBC reported.\n\nCottrells spokesperson told the BBC that he had been in an invidious situation as he did not have the legal power to sack the priest as all the complaints had already been dealt with.\n\nAccording to the spokesperson, there were no grounds to act until a fresh complaint was made in 2019.\n\nIt completely undermines his credibility that this case was not acted on, she told the BBC.\n\nHow can you have the moral and ethical authority to lead an institution with that?\n\nOn becoming Bishop of Chelmsford in 2010, Cottrell was told that Tudor had been a defendant in two criminal trials in 1988, according to the BBC investigation.\n\nHe was acquitted in the first trial of indecently assaulting a 15-year-old girl but admitted having sex with her when she was 16.\n\nTudor was found guilty of indecently assaulting three girls and jailed for six months in the second case, but had the conviction quashed on technical grounds.\n\nThe Church banned Tudor but allowed him to return to ministry after five years.\n\nDespite working under an agreement that prevented him from being alone with children or entering schools in Essex in Chelmsford, he went on to become an area dean in charge of 12 parishes.\n\nAny action that could have been taken should have been vastly stronger than simply to try and manage a risk, particularly if the priest in question is already banned from working with children or entering schools, Hartley said.\n\nTudor was only banned for life from ministry two months agoafter a Church diciplinary tribunal found his previous sexual relations with two girls were an abuse of trust amounting to grooming.\n\nAccording to the BBC, at least seven women say they were abused by Tudor.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/16145700/A-senior-Anglican-bishop-who-will-soon-take-temporary-charge-of-the-scandal-hit-Church-faced-calls-to-quit-on-Monday-over-his-own-handling-of-a-sexual-abuse-case.webp",
            "description": "<p>AFP A senior Anglican bishop, who will soon take temporary charge of the scandal-hit Church, faced calls to quit on Monday over his own handling of a sexual abuse case. Archbishop of York Stephen Cottrell, the Anglican Church’s second most senior cleric, will take charge for a few months in the New Year following the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/anglican-church-hit-by-new-abuse-claims/\">Anglican Church hit by new abuse claims</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Zanu PF Senator Prisca Mupfumira’s driver kidnapped, Isuzu double cab carjacked",
            "url": "https://www.newzimbabwe.com/zanu-pf-senator-prisca-mupfumiras-driver-kidnapped-isuzu-double-cab-carjacked/",
            "content": "By Staff Reporter\n\nMASHONALAND West Senator and former Cabinet minister, Prisca Mupfumiras driver was last week kidnapped at gunpoint and dispossessed of a double-cab vehicle he was driving while on an errand.\n\nThe incident occurred in Harares Avondale West at around 7am December 11, 2024, after the top Zanu PF official sent her driver Edmore Mashasha to collect church uniforms from tailors at an address on Ascot Road.\n\nThe Isuzu is valued at US$70,000 and the Criminal Investigations Department (CID) Vehicle Theft Squad is hunting down the suspects.\n\nMashasha, who was driving a royal blue Isuzu double cab, registration AGA 6969, was waiting for the gate to be opened when assailants armed with pistols circled the car.\n\nThe accused persons pointed at the complainants head ordering him to shift from the drivers seat and he complied.\n\nOne of the accused persons took charge of the vehicle while the other accused person blindfolded the complainant, tied his hands and pushed the complainant to the back seat, police said.\n\nThe accused person drove off at high speed and later dumped the complainant at an unknown location along Mutoko road.\n\nMashasha managed to free himself and was assisted by a passerby who gave him a phone to call Mupfumira. The matter was later reported to police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/16063334/2023-Isuzu-D-Max-03.jpg",
            "description": "<p>By Staff Reporter  MASHONALAND West Senator and former Cabinet minister, Prisca Mupfumira’s driver was last week kidnapped at gunpoint and dispossessed of a double-cab vehicle he was driving while on an errand. The incident occurred in Harare’s Avondale West at around 7am December 11, 2024, after the top Zanu PF official sent her driver Edmore</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-senator-prisca-mupfumiras-driver-kidnapped-isuzu-double-cab-carjacked/\">Zanu PF Senator Prisca Mupfumira’s driver kidnapped, Isuzu double cab carjacked</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Several hundreds, maybe thousands, may have died in Mayotte cyclone",
            "url": "https://www.newzimbabwe.com/several-hundreds-maybe-thousands-may-have-died-in-mayotte-cyclone/",
            "content": "By Reuters\n\nPARIS/MORONISeveral hundred people and possibly even thousands may have been killed when the most powerful cyclone in nearly a century hit the French Indian Ocean archipelago of Mayotte, a senior local French official said on Sunday.\n\nI think there will certainly be several hundreds, maybe we will reach a thousand, even several thousands, prefect Francois-Xavier Bieuville said on local media channel Mayotte La 1ere.Asked about the death toll from Cyclone Chido, the French interior ministry said it will be difficult to account for all victims and a figure could not be determined at this stage.Cyclone Chido hit Mayotte overnight, Meteo-France said, with winds of more than 200 kph (124 mph), damaging housing, government buildings and a hospital. It was the strongest storm in more than 90 years to hit the islands, the forecaster said.Honestly, what we are experiencing is a tragedy, you feel like you are in the aftermath of a nuclear war I saw an entire neighborhood disappear, Mohamed Ishmael, a resident of Mayottes capital Mamoudzou, told Reuters by phone.Aerial footage shared by the French gendarmerie showed the wreckage of hundreds of makeshift houses strewn across the hills of one of Mayottes islands, which have been a focal point for illegal immigration from nearby Comoros.Local media images showed a mother pushing a newborn babys crib along the flooded corridor of Mayottes hospital.Capsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.My thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nI think there will certainly be several hundreds, maybe we will reach a thousand, even several thousands, prefect Francois-Xavier Bieuville said on local media channel Mayotte La 1ere.\n\nAsked about the death toll from Cyclone Chido, the French interior ministry said it will be difficult to account for all victims and a figure could not be determined at this stage.Cyclone Chido hit Mayotte overnight, Meteo-France said, with winds of more than 200 kph (124 mph), damaging housing, government buildings and a hospital. It was the strongest storm in more than 90 years to hit the islands, the forecaster said.Honestly, what we are experiencing is a tragedy, you feel like you are in the aftermath of a nuclear war I saw an entire neighborhood disappear, Mohamed Ishmael, a resident of Mayottes capital Mamoudzou, told Reuters by phone.Aerial footage shared by the French gendarmerie showed the wreckage of hundreds of makeshift houses strewn across the hills of one of Mayottes islands, which have been a focal point for illegal immigration from nearby Comoros.Local media images showed a mother pushing a newborn babys crib along the flooded corridor of Mayottes hospital.Capsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.My thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nAsked about the death toll from Cyclone Chido, the French interior ministry said it will be difficult to account for all victims and a figure could not be determined at this stage.\n\nCyclone Chido hit Mayotte overnight, Meteo-France said, with winds of more than 200 kph (124 mph), damaging housing, government buildings and a hospital. It was the strongest storm in more than 90 years to hit the islands, the forecaster said.Honestly, what we are experiencing is a tragedy, you feel like you are in the aftermath of a nuclear war I saw an entire neighborhood disappear, Mohamed Ishmael, a resident of Mayottes capital Mamoudzou, told Reuters by phone.Aerial footage shared by the French gendarmerie showed the wreckage of hundreds of makeshift houses strewn across the hills of one of Mayottes islands, which have been a focal point for illegal immigration from nearby Comoros.Local media images showed a mother pushing a newborn babys crib along the flooded corridor of Mayottes hospital.Capsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.My thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nCyclone Chido hit Mayotte overnight, Meteo-France said, with winds of more than 200 kph (124 mph), damaging housing, government buildings and a hospital. It was the strongest storm in more than 90 years to hit the islands, the forecaster said.\n\nHonestly, what we are experiencing is a tragedy, you feel like you are in the aftermath of a nuclear war I saw an entire neighborhood disappear, Mohamed Ishmael, a resident of Mayottes capital Mamoudzou, told Reuters by phone.Aerial footage shared by the French gendarmerie showed the wreckage of hundreds of makeshift houses strewn across the hills of one of Mayottes islands, which have been a focal point for illegal immigration from nearby Comoros.Local media images showed a mother pushing a newborn babys crib along the flooded corridor of Mayottes hospital.Capsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.My thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nHonestly, what we are experiencing is a tragedy, you feel like you are in the aftermath of a nuclear war I saw an entire neighborhood disappear, Mohamed Ishmael, a resident of Mayottes capital Mamoudzou, told Reuters by phone.\n\nAerial footage shared by the French gendarmerie showed the wreckage of hundreds of makeshift houses strewn across the hills of one of Mayottes islands, which have been a focal point for illegal immigration from nearby Comoros.Local media images showed a mother pushing a newborn babys crib along the flooded corridor of Mayottes hospital.Capsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.My thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nAerial footage shared by the French gendarmerie showed the wreckage of hundreds of makeshift houses strewn across the hills of one of Mayottes islands, which have been a focal point for illegal immigration from nearby Comoros.\n\nLocal media images showed a mother pushing a newborn babys crib along the flooded corridor of Mayottes hospital.Capsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.My thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nLocal media images showed a mother pushing a newborn babys crib along the flooded corridor of Mayottes hospital.\n\nCapsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.My thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nCapsized police boats lay onshore while coconut trees had crashed through the roofs of many buildings.\n\nMy thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.In the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nMy thoughts are with our compatriots in Mayotte, who have gone through the most horrific few hours, and who have, for some, lost everything, lost their lives, French President Emmanuel Macron said.\n\nIn the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.Over 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nIn the last few decades thousands of people have attempted to make the crossing from Comoros, off the coast of East Africa, to Mayotte, which has a higher standard of living and access to the French welfare system.\n\nOver 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.It was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nOver 100,000 undocumented migrants live in Mayotte, according to the French interior ministry.\n\nIt was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.For the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nIt was difficult to ascertain the precise death toll after the cyclone, which also raised concerns about access to food, water and sanitation, authorities said.\n\nFor the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.Located nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nFor the toll, its going to be complicated, because Mayotte is a Muslim land where the dead are buried within 24 hours, a French interior ministry official said earlier.\n\nLocated nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.More than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nLocated nearly 8,000 km (5,000 miles) from Paris, Mayotte is significantly poorer than the rest of France and has grappled with gang violence and social unrest for decades.\n\nMore than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.An air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nMore than three-quarters of the people in Mayotte live below the French poverty line. Tensions were stoked earlier this year by a water shortage.\n\nAn air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.The disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nAn air bridge was being put in place from Reunion island, another French overseas territory on the other side of Madagascar, the government said.\n\nThe disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.The cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nThe disaster is the first challenge faced by Prime Minister Francois Bayrou, days after he was named by Macron following the collapse of the previous government.\n\nThe cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.Internet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nThe cyclone went on to hit northern Mozambique on Sunday, but the full extent of the impact was not clear.\n\nInternet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.In Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nInternet monitor NetBlocks said on X that heavy rain and winds had damaged power and telecommunications infrastructure.\n\nIn Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.France colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nIn Comoros, two people were slightly injured, 24 displaced, and 21 homes were destroyed, authorities said.\n\nFrance colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.In a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nFrance colonised Mayotte in 1843 and annexed the whole archipelago, including Comoros, in 1904.\n\nIn a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\nIn a 1974 referendum, 95% backed separation but 63% on Mayotte voted to stay French. Grande Comore, Anjouan and Moheli declared independence in 1975. Mayotte is still ruled from Paris.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/16055634/ap2675ec476a6aed.jpg",
            "description": "<p>By Reuters  PARIS/MORONI—Several hundred people and possibly even thousands may have been killed when the most powerful cyclone in nearly a century hit the French Indian Ocean archipelago of Mayotte, a senior local French official said on Sunday. “I think there will certainly be several hundreds, maybe we will reach a thousand, even several thousands,”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/several-hundreds-maybe-thousands-may-have-died-in-mayotte-cyclone/\">Several hundreds, maybe thousands, may have died in Mayotte cyclone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Doctors demand government to provide inventory of cancer machines, drugs bought from US$30.8 million raised through sugar tax",
            "url": "https://www.newzimbabwe.com/doctors-demand-government-to-provide-inventory-of-cancer-machines-drugs-bought-from-us30-8-million-raised-through-sugar-tax/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Association of Doctors for Human Rights (ZADHR) has challenged government to provide an acquittal of how it expended money derived from the recently introduced sugar tax.\n\nPresident Emmerson Mnangagwas administration reportedly collected a staggering US$30.8 million of special surtax on sugar content in beverages ostensibly to raise funds to buy critical cancer management machines in public hospitals.In a letter, ZADHR demanded to know how Treasury led by Finance Minister, Mthuli Ncube and permanent secretary George Guvamatanga used the money.In its letter, which was written on November 21, 2024 to Treasury, ZADHR, which was represented by human rights lawyer, Precious Chakasikwa of Zimbabwe Lawyers for Human Rights asked Ncubes ministry to provide it with an account of how much special surtax on sugar content in beverages had been collected from February 9, 2024, when government gazetted the Customs and Excise (Tariff) (Amendment) Notice, 2024 (No. 5), which was published in Statutory Instrument 16 of 2024.ZADHR also requested the Ministry of Finance, Economic Development and Investment Promotion to furnish it with an account of which cancer drugs and equipment had been procured since the introduction of the sugar tax and the list of hospitals to which these had been distributed to.The ZLHR doctors association made the request for access to the information in terms of the provisions of section 7 of the Freedom of Information Act and its request was aimed at promoting transparency and accountability in the use of public funds.In response to ZADHRs letter, Guvamatanga on Friday December 13, 2024, disclosed that US$30.8 million of special surtax on sugar content in beverages has been collected as of November 2024.Guvamatanga, however, told ZADHR that the procurement of drugs and medical equipment is done under the purview of the Ministry of Health and Child Care and referred the doctors association to the responsible minister, Douglas Mombeshora, saying his ministry is not a competent authority to give information about such a request.In February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.Ncube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nPresident Emmerson Mnangagwas administration reportedly collected a staggering US$30.8 million of special surtax on sugar content in beverages ostensibly to raise funds to buy critical cancer management machines in public hospitals.\n\nIn a letter, ZADHR demanded to know how Treasury led by Finance Minister, Mthuli Ncube and permanent secretary George Guvamatanga used the money.In its letter, which was written on November 21, 2024 to Treasury, ZADHR, which was represented by human rights lawyer, Precious Chakasikwa of Zimbabwe Lawyers for Human Rights asked Ncubes ministry to provide it with an account of how much special surtax on sugar content in beverages had been collected from February 9, 2024, when government gazetted the Customs and Excise (Tariff) (Amendment) Notice, 2024 (No. 5), which was published in Statutory Instrument 16 of 2024.ZADHR also requested the Ministry of Finance, Economic Development and Investment Promotion to furnish it with an account of which cancer drugs and equipment had been procured since the introduction of the sugar tax and the list of hospitals to which these had been distributed to.The ZLHR doctors association made the request for access to the information in terms of the provisions of section 7 of the Freedom of Information Act and its request was aimed at promoting transparency and accountability in the use of public funds.In response to ZADHRs letter, Guvamatanga on Friday December 13, 2024, disclosed that US$30.8 million of special surtax on sugar content in beverages has been collected as of November 2024.Guvamatanga, however, told ZADHR that the procurement of drugs and medical equipment is done under the purview of the Ministry of Health and Child Care and referred the doctors association to the responsible minister, Douglas Mombeshora, saying his ministry is not a competent authority to give information about such a request.In February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.Ncube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nIn a letter, ZADHR demanded to know how Treasury led by Finance Minister, Mthuli Ncube and permanent secretary George Guvamatanga used the money.\n\nIn its letter, which was written on November 21, 2024 to Treasury, ZADHR, which was represented by human rights lawyer, Precious Chakasikwa of Zimbabwe Lawyers for Human Rights asked Ncubes ministry to provide it with an account of how much special surtax on sugar content in beverages had been collected from February 9, 2024, when government gazetted the Customs and Excise (Tariff) (Amendment) Notice, 2024 (No. 5), which was published in Statutory Instrument 16 of 2024.ZADHR also requested the Ministry of Finance, Economic Development and Investment Promotion to furnish it with an account of which cancer drugs and equipment had been procured since the introduction of the sugar tax and the list of hospitals to which these had been distributed to.The ZLHR doctors association made the request for access to the information in terms of the provisions of section 7 of the Freedom of Information Act and its request was aimed at promoting transparency and accountability in the use of public funds.In response to ZADHRs letter, Guvamatanga on Friday December 13, 2024, disclosed that US$30.8 million of special surtax on sugar content in beverages has been collected as of November 2024.Guvamatanga, however, told ZADHR that the procurement of drugs and medical equipment is done under the purview of the Ministry of Health and Child Care and referred the doctors association to the responsible minister, Douglas Mombeshora, saying his ministry is not a competent authority to give information about such a request.In February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.Ncube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nZADHR also requested the Ministry of Finance, Economic Development and Investment Promotion to furnish it with an account of which cancer drugs and equipment had been procured since the introduction of the sugar tax and the list of hospitals to which these had been distributed to.\n\nThe ZLHR doctors association made the request for access to the information in terms of the provisions of section 7 of the Freedom of Information Act and its request was aimed at promoting transparency and accountability in the use of public funds.In response to ZADHRs letter, Guvamatanga on Friday December 13, 2024, disclosed that US$30.8 million of special surtax on sugar content in beverages has been collected as of November 2024.Guvamatanga, however, told ZADHR that the procurement of drugs and medical equipment is done under the purview of the Ministry of Health and Child Care and referred the doctors association to the responsible minister, Douglas Mombeshora, saying his ministry is not a competent authority to give information about such a request.In February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.Ncube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nThe ZLHR doctors association made the request for access to the information in terms of the provisions of section 7 of the Freedom of Information Act and its request was aimed at promoting transparency and accountability in the use of public funds.\n\nIn response to ZADHRs letter, Guvamatanga on Friday December 13, 2024, disclosed that US$30.8 million of special surtax on sugar content in beverages has been collected as of November 2024.Guvamatanga, however, told ZADHR that the procurement of drugs and medical equipment is done under the purview of the Ministry of Health and Child Care and referred the doctors association to the responsible minister, Douglas Mombeshora, saying his ministry is not a competent authority to give information about such a request.In February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.Ncube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nIn response to ZADHRs letter, Guvamatanga on Friday December 13, 2024, disclosed that US$30.8 million of special surtax on sugar content in beverages has been collected as of November 2024.\n\nGuvamatanga, however, told ZADHR that the procurement of drugs and medical equipment is done under the purview of the Ministry of Health and Child Care and referred the doctors association to the responsible minister, Douglas Mombeshora, saying his ministry is not a competent authority to give information about such a request.In February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.Ncube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nGuvamatanga, however, told ZADHR that the procurement of drugs and medical equipment is done under the purview of the Ministry of Health and Child Care and referred the doctors association to the responsible minister, Douglas Mombeshora, saying his ministry is not a competent authority to give information about such a request.\n\nIn February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.Ncube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nIn February 2024, government introduced a levy on sugary beverages claiming that this was aimed at discouraging people from consuming too much sugar, which it blamed for causing some forms of cancer.\n\nNcube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\nNcube justified the introduction of the sugar tax as a response to growing concerns on the adverse effects of consumption of sugar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/16071625/Broken-down-cancer-machine-1.png",
            "description": "<p>By Staff Reporter  THE Zimbabwe Association of Doctors for Human Rights (ZADHR) has challenged government to provide an acquittal of how it expended money derived from the recently introduced sugar tax. President Emmerson Mnangagwa’s administration reportedly collected a staggering US$30.8 million of special surtax on sugar content in beverages ostensibly to raise funds to buy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/doctors-demand-government-to-provide-inventory-of-cancer-machines-drugs-bought-from-us30-8-million-raised-through-sugar-tax/\">Doctors demand government to provide inventory of cancer machines, drugs bought from US$30.8 million raised through sugar tax </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Chamisa takes aim at greedy opposition leaders, says they cannot liberate Zimbabwe; claims current hunger facing citizens is man-made",
            "url": "https://www.newzimbabwe.com/chamisa-takes-aim-at-greedy-opposition-leaders-says-they-cannot-liberate-zimbabwe-alleges-current-hunger-facing-citizens-is-man-made/",
            "content": "By Alois Vinga\n\nOPPOSITION politician, Nelson Chamisa says greedy opposition leaders lack the gravitas to liberate Zimbabwe from its current hardships just by merely criticizing the government for poor planning and inducing hunger ravaging the nation.\n\nThe popular politician was speaking to NewZimbabwe.com shortly after hosting the Charity Fund Raising Dinner held at a local hotel Saturday night.\n\nOver the years, Chamisa has taken advantage of the event to mobilise resources for onward transmission to targeted families across Zimbabwe every festive season.\n\nAsked to share his views against a background where some opposition leaders have defected to the ruling party while a section of citizens are getting weary of the countrys prolonged struggle, the opposition leader reiterated that the journey to freedom is not meant for self serving people.\n\nThe struggle to liberate the country is neither a one-day wonder nor instant coffee affair. Its not a walk in the park or a fly-by-night task. One needs to be consistent, conscious and strong. The fight is not a fight for opportunities, but a fight for values.\n\nWe need strong leaders. Leaders who are not after serving themselves but who serve others. Leaders who are not motivated or driven by a galloping appetite for material gains. Leaders must be driven by the broader and collective objective of making a difference, he said.\n\nHe decried the fact that this years fundraising dinner comes at a time when more people are increasingly in need of food aid, a situation which he blamed on poor foresight on the part of the countrys leadership.\n\nThe 47-year-old opposition leader said there is an urgent need to utilise technologies and water harvesting techniques to avert the impact of current drought crises.\n\nOur loss must be compensated for in a lot of planning and building of Citizens Relief Services Programme. But also, being able to harvest and harness water. Rains fall and when they come water flows right into the oceans, we are not harnessing and harvesting the water. We need to come up with green belts and the Green Zimbabwe Programme, he said.\n\nChamisa underscored that hardships have crossed all boundaries leaving many struggling despite political affiliation. He said the problems had forced many citizens to relocate to other countries in search of a better life.\n\nThis situation, he said, cannot be treated as a Zanu-PF party issue alone but rather a Zimbabwean issue requiring citizens to join hands in crafting a lasting solution.\n\nQuizzed on whether he would compromise if President Emmerson Mnangagwa was going to extend an olive branch and pave the way for working together with citizens at the centre of the priorities, the opposition leader said sticking issues have to be resolved first.\n\nA conversation, yes. Compromise perhaps not because the issue is to first identify the problem and the solution. We will then need to engage the people of Zimbabwe in their totality.\n\nRight now we are a divided people. We are a divided country. We are a divided government because the people are ultimately the government, but the government is divided because people do not agree on how the government must function or be constituted.\n\nThe 2023 dispute is a case in point and that is the starting point of our conversation and resolution in this country. An ostrich mentality of burying its head in the sand thinking it will save the back when the marauding fire spreads around is not of any help, Chamisa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/16051254/Chamisa-at-Charity-Dinner-2.jpeg",
            "description": "<p>By Alois Vinga OPPOSITION politician, Nelson Chamisa says greedy opposition leaders lack the gravitas to liberate Zimbabwe from its current hardships just by merely criticizing the government for poor planning and inducing hunger ravaging the nation. The popular politician was speaking to NewZimbabwe.com shortly after hosting the Charity Fund Raising Dinner held at a local</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chamisa-takes-aim-at-greedy-opposition-leaders-says-they-cannot-liberate-zimbabwe-alleges-current-hunger-facing-citizens-is-man-made/\">Chamisa takes aim at greedy opposition leaders, says they cannot liberate Zimbabwe; claims current hunger facing citizens is man-made</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Mutapa spurs productivity in ‘reluctant’ State Owned Enterprises",
            "url": "https://www.newzimbabwe.com/mutapa-spurs-productivity-in-reluctant-state-owned-enterprises/",
            "content": "By Alois Vinga\n\nTHE Mutapa Investment Fund (MIF) has to date undertaken a structural overhaul on a number of ailing State-Owned Enterprises (SOEs), realigning them for a swift return to productivity in the countrys key economic sectors.\n\nZimbabwes first Sovereign Wealth Funds (SWF) origins can be traced back to a mining sector policy study conducted in 2012 that recommended the establishment of the fund to drive long-term investment leveraging on mining, natural and other resources that would anchor inclusive economic growth and development.Formerly the SWF, the MIF was established by an Act of Parliament in 2014 called Sovereign Wealth Fund Act (Chapter 22:20) and is currently led by John Mangudya as its chief executive officer.In September 2023 it was renamed to Mutapa Investment Fund through Statutory Instrument 156 of 2023, by President Emmerson Mnangagwa using the Presidential Powers (Temporary Measures Act).Since kick starting operations around April 2024, the MIF has undertaken work aimed repositioning SOEs to productivity.For instance, new board members for Air Zimbabwe and Allied Timbers were appointed as part of its efforts to revitalise these SOEs.Silvanos Gwarinda has been appointed as the chairperson of the national airline, with Precious Sibiya serving as his deputy.Other notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.Within a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nZimbabwes first Sovereign Wealth Funds (SWF) origins can be traced back to a mining sector policy study conducted in 2012 that recommended the establishment of the fund to drive long-term investment leveraging on mining, natural and other resources that would anchor inclusive economic growth and development.\n\nFormerly the SWF, the MIF was established by an Act of Parliament in 2014 called Sovereign Wealth Fund Act (Chapter 22:20) and is currently led by John Mangudya as its chief executive officer.In September 2023 it was renamed to Mutapa Investment Fund through Statutory Instrument 156 of 2023, by President Emmerson Mnangagwa using the Presidential Powers (Temporary Measures Act).Since kick starting operations around April 2024, the MIF has undertaken work aimed repositioning SOEs to productivity.For instance, new board members for Air Zimbabwe and Allied Timbers were appointed as part of its efforts to revitalise these SOEs.Silvanos Gwarinda has been appointed as the chairperson of the national airline, with Precious Sibiya serving as his deputy.Other notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.Within a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nFormerly the SWF, the MIF was established by an Act of Parliament in 2014 called Sovereign Wealth Fund Act (Chapter 22:20) and is currently led by John Mangudya as its chief executive officer.\n\nIn September 2023 it was renamed to Mutapa Investment Fund through Statutory Instrument 156 of 2023, by President Emmerson Mnangagwa using the Presidential Powers (Temporary Measures Act).Since kick starting operations around April 2024, the MIF has undertaken work aimed repositioning SOEs to productivity.For instance, new board members for Air Zimbabwe and Allied Timbers were appointed as part of its efforts to revitalise these SOEs.Silvanos Gwarinda has been appointed as the chairperson of the national airline, with Precious Sibiya serving as his deputy.Other notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.Within a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nIn September 2023 it was renamed to Mutapa Investment Fund through Statutory Instrument 156 of 2023, by President Emmerson Mnangagwa using the Presidential Powers (Temporary Measures Act).\n\nSince kick starting operations around April 2024, the MIF has undertaken work aimed repositioning SOEs to productivity.For instance, new board members for Air Zimbabwe and Allied Timbers were appointed as part of its efforts to revitalise these SOEs.Silvanos Gwarinda has been appointed as the chairperson of the national airline, with Precious Sibiya serving as his deputy.Other notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.Within a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nSince kick starting operations around April 2024, the MIF has undertaken work aimed repositioning SOEs to productivity.\n\nFor instance, new board members for Air Zimbabwe and Allied Timbers were appointed as part of its efforts to revitalise these SOEs.Silvanos Gwarinda has been appointed as the chairperson of the national airline, with Precious Sibiya serving as his deputy.Other notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.Within a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nFor instance, new board members for Air Zimbabwe and Allied Timbers were appointed as part of its efforts to revitalise these SOEs.\n\nSilvanos Gwarinda has been appointed as the chairperson of the national airline, with Precious Sibiya serving as his deputy.Other notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.Within a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nSilvanos Gwarinda has been appointed as the chairperson of the national airline, with Precious Sibiya serving as his deputy.\n\nOther notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.Within a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nOther notable board members include veteran banker Onesemo Mukumba, Lilina Chigodora, and Farai Mpofu.\n\nWithin a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.The energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nWithin a short space of time, the MIF has organized 66 companies into five clusters to optimise benefits. For instance, under the natural resources cluster are entities such as Kuvimba Mining House.\n\nThe energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).Other clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nThe energy and trading cluster includes Zimbabwe Electricity Supply Authority (ZESA), the countrys power utility and the National Oil Company of Zimbabwe while the infrastructure has entities such as the National Railways of Zimbabwe (NRZ).\n\nOther clusters include industrials, financial services and real estate.Speaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nOther clusters include industrials, financial services and real estate.\n\nSpeaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.We have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nSpeaking during a panel discussion recently, Mutapa deputy chief investment officer, Ernest Denhere said more work to attain full scale efficiency is still in the pipeline.\n\nWe have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.To achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nWe have developed an investment strategy and clustered the fund into five main sectors: natural resources, energy and trading, infrastructure, industrials and financial services and real estate. We are focusing on infrastructure, mining and energy as enablers for economic growth, aligning with the governments Vision 2030 aspirations.\n\nTo achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.He said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nTo achieve this, we need to address governance issues, upskill and train board members, and ensure the portfolio companies are fit for purpose, Denhere said.\n\nHe said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.The fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nHe said going forward, the funds strategy will be underpinned by giving the portfolio companies autonomy to make commercial decisions, unwind legacy debt, and embrace innovation.\n\nThe fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.Sources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nThe fund has undertaken an aggregated assets valuation exercise placing the consolidated value at US$16 billion.\n\nSources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.The fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nSources confirm that behind the scenes, work is currently underway to extract indebted companies from the doldrums and find a lasting solution towards clean balance sheets.\n\nThe fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.Recently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nThe fund has since commenced negotiations with Cold Storage Commission (CSC) creditors, who include the ZESA Holdings, the National Social Security Authority (NSSA), and urban councils in Bulawayo, Harare, and Chinhoyi in a bid to inject capital into the concern and help it to spur operations.\n\nRecently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.Financial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nRecently, the MIF also approved a significant joint venture valued at US$350 million between Indian firm Jindal Africa Investments and ZESA to refurbish six units at Hwange Thermal Power Station.\n\nFinancial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.In the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nFinancial analyst, Owen Mavengere said MIF is approaching the tasks ahead through the right procedure.\n\nIn the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.In the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nIn the short-term period 6-12 months, the MIF has to begin with immediate actions such as implementing transparency measures, conducting audits, and setting up the oversight bodies in the subsidiaries. Initial steps in digitising processes and reducing red tape can also start in this period.\n\nIn the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\nIn the Medium-term (1-3 years): Focus on deeper structural changes, including full digitisation of processes, comprehensive workforce optimisation, and instilling a culture of accountability and efficiency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/21044343/Mangudya-2.jpg",
            "description": "<p>By Alois Vinga THE Mutapa Investment Fund (MIF) has to date undertaken a structural overhaul on a number of ailing State-Owned Enterprises (SOEs), realigning them for a swift return to productivity in the country’s key economic sectors. Zimbabwe’s first Sovereign Wealth Fund’s (SWF) origins can be traced back to a mining sector policy study conducted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-spurs-productivity-in-reluctant-state-owned-enterprises/\">Mutapa spurs productivity in ‘reluctant’ State Owned Enterprises</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        },
        {
            "title": "Burglar gets away with US$20,000 loot after breaking into Harare property",
            "url": "https://www.newzimbabwe.com/burglar-gets-away-with-us20000-loot-after-breaking-into-harare-property/",
            "content": "By Staff Reporter\n\nFRIDAY the 13th is associated with horror and the day was unforgettable for a Harare family, which lost US$20,000 cash following a burglary.\n\nThe Zimbabwe Republic Police (ZRP) confirmed the robbery that occurred in Harares upmarket suburb of Newlands.Police in Harare are investigating a case of unlawful entry into premises and theft which occurred on December 13, 2024, at a house along Abyone Drive, Newlands.An unknown suspect broke the dining room door and gained entry into the house before stealing a cash box containing US$20 000 and a laptop. Anyone with information to report at any nearest police station, said ZRP national spokesperson, Commissioner Paul Nyathi.Meanwhile, police in Marondera are investigating a case of unlawful entry into premises and theft which occurred at a farm house at Rakodzi Estate on December 12, 2024.Unknown suspects broke the main entrance door and gained entry into the house where they stole a Farbam shotgun, Brno shotgun and BSA rifle. The incident occurred while the complainant was away in Harare.ZRP is appealing to anyone with information to report at any nearest police station.\n\nThe Zimbabwe Republic Police (ZRP) confirmed the robbery that occurred in Harares upmarket suburb of Newlands.\n\nPolice in Harare are investigating a case of unlawful entry into premises and theft which occurred on December 13, 2024, at a house along Abyone Drive, Newlands.An unknown suspect broke the dining room door and gained entry into the house before stealing a cash box containing US$20 000 and a laptop. Anyone with information to report at any nearest police station, said ZRP national spokesperson, Commissioner Paul Nyathi.Meanwhile, police in Marondera are investigating a case of unlawful entry into premises and theft which occurred at a farm house at Rakodzi Estate on December 12, 2024.Unknown suspects broke the main entrance door and gained entry into the house where they stole a Farbam shotgun, Brno shotgun and BSA rifle. The incident occurred while the complainant was away in Harare.ZRP is appealing to anyone with information to report at any nearest police station.\n\nPolice in Harare are investigating a case of unlawful entry into premises and theft which occurred on December 13, 2024, at a house along Abyone Drive, Newlands.\n\nAn unknown suspect broke the dining room door and gained entry into the house before stealing a cash box containing US$20 000 and a laptop. Anyone with information to report at any nearest police station, said ZRP national spokesperson, Commissioner Paul Nyathi.Meanwhile, police in Marondera are investigating a case of unlawful entry into premises and theft which occurred at a farm house at Rakodzi Estate on December 12, 2024.Unknown suspects broke the main entrance door and gained entry into the house where they stole a Farbam shotgun, Brno shotgun and BSA rifle. The incident occurred while the complainant was away in Harare.ZRP is appealing to anyone with information to report at any nearest police station.\n\nAn unknown suspect broke the dining room door and gained entry into the house before stealing a cash box containing US$20 000 and a laptop. Anyone with information to report at any nearest police station, said ZRP national spokesperson, Commissioner Paul Nyathi.\n\nMeanwhile, police in Marondera are investigating a case of unlawful entry into premises and theft which occurred at a farm house at Rakodzi Estate on December 12, 2024.Unknown suspects broke the main entrance door and gained entry into the house where they stole a Farbam shotgun, Brno shotgun and BSA rifle. The incident occurred while the complainant was away in Harare.ZRP is appealing to anyone with information to report at any nearest police station.\n\nMeanwhile, police in Marondera are investigating a case of unlawful entry into premises and theft which occurred at a farm house at Rakodzi Estate on December 12, 2024.\n\nUnknown suspects broke the main entrance door and gained entry into the house where they stole a Farbam shotgun, Brno shotgun and BSA rifle. The incident occurred while the complainant was away in Harare.ZRP is appealing to anyone with information to report at any nearest police station.\n\nUnknown suspects broke the main entrance door and gained entry into the house where they stole a Farbam shotgun, Brno shotgun and BSA rifle. The incident occurred while the complainant was away in Harare.\n\nZRP is appealing to anyone with information to report at any nearest police station.\n\nZRP is appealing to anyone with information to report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  FRIDAY the 13th is associated with horror and the day was unforgettable for a Harare family, which lost US$20,000 cash following a burglary. The Zimbabwe Republic Police (ZRP) confirmed the robbery that occurred in Harare’s upmarket suburb of Newlands. “Police in Harare are investigating a case of unlawful entry into premises and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/burglar-gets-away-with-us20000-loot-after-breaking-into-harare-property/\">Burglar gets away with US$20,000 loot after breaking into Harare property </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "16 Dec 2024"
        }
    ]
}