{
    "news": [
        {
            "title": "Legal Discussions With Vengai Madzima: Foreign Visa Applications",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-foreign-visa-applications/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima and compliments of the new season, we want to continue our discussion on Immigration Law, specifically focusing on foreign Visa applications which we understand you can also assist people with. What are the common requirements in Visa applications to foreign destinations from Zimbabwe?\n\nVM: Compliments of the new season.\n\nGenerally, most preferred destinations for Zimbabweans that require visas before entry commonly require the applicants to possess a passport valid for at least 6 months beyond the intended stay. Applicants are naturally required to complete application forms which will list the varying requirements of the country of interest. These requirements commonly include passport-sized photos, proof of financial means, your bank statement or sponsorship letterset ceteraand invitation letters or hotel bookings for tourists.\n\nReporter: What are the common red flags for visa denial in Zimbabwe\n\nVM: The issue of red flags has to be analyzed in totality. Zimbabwe was and to an extent remains under sanctions as some members of its leadership are still under sanctions. I say this intentionally because our visa applications are looked at carefully as a result of this background.\n\nFurther, a lot of our citizens left Zimbabwe to seek greener pastures under different guises in their applications which has a bearing on current and future applications to visa-requiring countries.\n\nThis has to be balanced against the visa officers duty to protect his or her country against undesirables when considering your application.\n\nIt therefore behoves an applicant to be circumspect when drafting applications. You cannot have incomplete applications with missing information, documents or inconsistencies. Your proof of financial means should align with your intended purpose of visit, where it raises suspicion, such visas are generally denied.\n\nIt is important to understand that the visa application is considered as a whole, so your reason for the visit, previous immigration violations and the reasons for such violations, criminal records, inadequate travel insurance, suspicion of intent to overstay, inconsistent travel history and no ties to home country are all considerations which may raise red flags when considering an application.\n\nReporter:You mention criminal records as a potential red flag, is an arrest without conviction in such applications a criminal record and are ex-convicts able to get visa?\n\nVM: Normally the applications require applicants to only state convictions. However, where the application provides for issues to do with fingerprints having been recorded after arrest, then the production of a certificate of acquittal will be useful.\n\nAs regards ex-convicts, visas may still be granted depending on the nature of the conviction and the policies of the destination country.\n\nHowever, it is helpful for applicants to be comprehensive and transparent in disclosing their legal history.\n\nReporter: You also mentioned ties with the home country, how do you prove these ties?\n\nVM: For certain applications, especially tourist visas, you must be able to show and prove that you will be returning to Zimbabwe after the visit. With this in mind, you can include your current employment, professional or economic ties to Zimbabwe, family and social ties, property and financial ties, community and cultural ties and any other ties that you may consider to be relevant for the visa officer considering your application. I always say that being granted on first application is better than on appeal\n\nReporter: The dreaded word, appeal, what steps should I take when appealing a visa denial?\n\nVM: The first and critical step is to understand the reason for the denial.\n\nEmbassies normally provide a detailed written response outlining the grounds for the refusal. Having understood the grounds for denial, if the grounds are capable of remedy, then the appeal has to address the grounds, providing further evidence and explanations as to why the initial application failed to address the issues raised on denial properly.\n\nThis may include gathering and providing further documentation and proof to satisfy the visa officer from his or her previous misgivings.\n\nThe appeal will also have to be submitted within time and if there are prescribed rules on how the appeal should be submitted, those rules will have to be followed to the letter.\n\nAlternatively, it may be more practical to submit a new application instead of pursuing an appeal. The circumstances dictate the best option.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRelated:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima and compliments of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-foreign-visa-applications/\">Legal Discussions With Vengai Madzima: Foreign Visa Applications</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Venezuela’s Nicolas Maduro sworn in for third presidential term as opposition decries ‘coup’",
            "url": "https://www.newzimbabwe.com/venezuelas-nicolas-maduro-sworn-in-for-third-presidential-term-as-opposition-decries-coup/",
            "content": "By CNN\n\nVENEZUELAS Nicolas Maduro has been sworn in for a third presidential term in what the countrys opposition movement has decried as coup detat, culminating more than five months of dispute over last summers contested election.\n\nThe ceremony took place on Friday in a small room of the National Assembly, a marked difference from previous ceremonies held in the buildings main hall.\n\nMaduro was sworn in by National Assembly leader, Jorge Rodrguez, who placed the presidential sash on him, prompting thunderous applause from those in attendance.\n\nWeve achieved what we knew we would achieve, Maduro said during his first speech after being sworn in.\n\nThe power given to me was not given by a foreign government, a foreign president or a gringo government, Maduro said at the event, which saw Nicaraguan President Daniel Ortega and Cubas Miguel Diaz-Canel in attendance.\n\nNo one in this world can impose a president in Venezuela.\n\nChina and Russia also sent representatives, with Russias State Duma Chairman Vyacheslav Volodin seen arriving late on a state media broadcast after the ceremony began ahead of schedule.\n\nMaduro was proclaimed winner of the countrys presidential election on July 28, by electoral authorities under the tight control of the ruling Socialist Party.\n\nBut Venezuelas opposition has published thousands of voting tallies claiming that their candidate, Edmundo Gonzalez, had actually won the vote with 67% against Maduros 30%.\n\nIndependent observers such as the Carter Center and the Colombian Electoral Mission, as well as CNNs own analysis, have found the opposition tallies to be legitimate. And several nations, including the United States, have since recognized Gonzalez as Venezuelas rightful president-elect.\n\nAnd in a speech Friday afternoon, opposition leader Maria Corina Machado remained defiant, accusing Maduros government of trampling on Venezuelas constitution. Going forward, the pressure will increase even more until Maduro understands that this is over, she pledged.\n\nMaduro violates the constitution, also flanked by the dictators of Cuba and Nicaragua, this says it all, she added.\n\nWhite House National Security Council spokesman John Kirby accused Maduro of a complete disregard for democratic norms, describing Fridays swearing-in as an illegitimate inauguration in remarks to reporters.\n\nGonzlez, who has been in exile since September with a bounty on his head by Venezuelan authorities, had pledged to return to Caracas this week in a potential last challenge to Maduros inauguration. But his planned return on Friday was called off due to security concerns, Paraguayan President Santiago Pea told CNNs Isa Soares.\n\nI continue to work on the conditions for my entry into Venezuela and assume, as mandated by the Constitution and ordered by the people, the presidency of the republic and as commander in chief of the national armed forces, Gonzlez said in a statement Friday.\n\nGonzlezs last known location on Friday was the Dominican Republic, where he had recently met with regional leaders.\n\nCriticism and new sanctions\n\nShortly after the inauguration, the US announced an 18-month extension of Temporary Protected Status for eligible Venezuelan nationals, and new rewards for information leading to the arrest of Maduro and his closest officials, including Interior Minister Diosdado Cabello.\n\nThe rewards for Maduro and for Cabello  now amounting to $25 million each  are the maximum rewards allowed under the State Departments narcotics reward program, an official said.\n\nThe US also announced new visa restrictions for Maduro-aligned officials whom the administration says are responsible for undermining Venezuelas electoral process, and individual sanctions on eight Maduro-aligned officials overseeing economic and security agencies in Venezuela, including a state-owned oil company and Maduros transportation minister.\n\nOn a call previewing the announcement, the official told reporters that Maduro stands mostly alone at this juncture, with few friends in the region and the world, noting statements from countries throughout the region and across the globe since July 28th to call on Maduro to respect democratic norms.\n\nMeanwhile, the United Kingdom on Friday sanctioned 15 people associated with Maduro and what it called his contested regime, including leaders from Venezuelas Armed Forces and members of the Supreme Justice Tribunal.\n\nThe European Union also issued sanctions against 15 people affiliated with Maduro, who have been accused of undermining democracy, rule of law or human rights in Venezuela. And Canada sanctioned 14 current and former senior officials who it said engaged in activities that supported human rights violations in the country.\n\nThe G7 also criticized the inauguration, saying it lacked democratic legitimacy. We reject Maduros continued and repressive grasp at power at the expense of the Venezuelan people, a statement from the group read.\n\nA new phase begins today\n\nMaduro did not name any of Venezuelas opposition leaders in his speech, but referred to the movement currently led by Machado and Gonzalez as Guaid 2.0  a reference to Juan Guaid, who in 2019 proclaimed himself interim president of Venezuela and was recognized by 50 countries, including the US.\n\nA Guaid 2.0 talks to the people in the streets, a new Guaid, and comes with the same baggage, we saw it, we saw their plans, we saw them yesterday, Maduro said, apparently referring to an opposition rally attended by Machado on Thursday.\n\nGuaid also condemned the inauguration, writing on X that the president of Venezuela is Edmundo Gonzlez Urrutia.\n\nMaduro only confirms his usurpation and the coup dtat they carried out on July 28, Guaid added. Venezuelan opposition coalition Plataforma de la Unidad Democrtica echoed Guaids remarks, saying, a new phase begins today in this fight for the freedom of Venezuela throughout the national territory and in all sectors that form our nation.\n\nAnd Human Rights Watch Americas director Juanita Goebertus criticized Maduros swearing-in as the culmination of an election that blatantly disregarded the peoples will and consolidates a dictatorship only sustained by brutal repression.\n\nOpposition leader Maria Corina Machado greets supporters during a protest against Venezuelan President Nicolas Maduro the day before his inauguration for a third term in Caracas, Venezuela, on January 9.\n\nAhead of the inauguration, Venezuela closed its land border and suspended flights to Colombia  a move that Freddie Bernal, the governor of the Venezuelan border state of Tachira, claimed was in reaction to a international conspiracy against Venezuela, in an Instagram post. He did not provide proof for his claim.\n\nThe border closure came just hours after Colombia broke its silence on the issue and announced it would not recognize the results of last summers elections, stating they were not free.\n\nProtests erupted in Caracas and other Venezuelan cities ahead of the inauguration, with Machado emerging from hiding to speak at one event on Thursday.\n\nMachado was later violently intercepted at the event, according to her team, which said that during the period of her kidnapping she was forced to record several videos and was later released. The Venezuelan government has denied detaining Machado.\n\nMachado said that despite attempts to quell dissent, Venezuelans had defeated fear with Thursdays rallies.\n\nYesterday, hundreds of thousands of Venezuelans went to the streets with civility, courage and profound love, Machado said in her video message Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/21124645/Nicholas-Maduro.jpg",
            "description": "<p>By CNN VENEZUELA’S Nicolas Maduro has been sworn in for a third presidential term in what the country’s opposition movement has decried as “coup d’etat,” culminating more than five months of dispute over last summer’s contested election. The ceremony took place on Friday in a small room of the National Assembly, a marked difference from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/venezuelas-nicolas-maduro-sworn-in-for-third-presidential-term-as-opposition-decries-coup/\">Venezuela’s Nicolas Maduro sworn in for third presidential term as opposition decries ‘coup’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Fight against Tyson Fury has to happen this year— says heavyweight boxer Anthony Joshua",
            "url": "https://www.newzimbabwe.com/fight-against-tyson-fury-has-to-happen-this-year-says-heavyweight-boxer-anthony-joshua/",
            "content": "By BBC\n\nHEAVYWEIGHT boxer, Anthony Joshua says a fight with Tyson Fury has to happen this year as he looks to book his next bout.\n\nA fight between the two British rivals has been spoken about for years but has never come to fruition.\n\nBut with both men coming back from defeats in world title fights, Joshua confirmed Fury was the opponent he wanted to face next.\n\nIts a fight I want to see because I am a fan of boxing. When I am in the gym, everyone is asking me [about this fight].\n\nI aint got many years ahead of me. I want to leave the game with a bang and make an impact, Joshua said.\n\nEveryone is asking me the same question. Its up to me to deliver, thats why Im saying it has to happen this year.\n\nI think we can make this fight happen.\n\nJoshua was speaking at the Ring Magazine awards in London, where Oleksandr Usyk was also in attendance.\n\nWhile speaking about Fury, Joshua admitted no talks had yet taken place with Furys team about a potential fight.\n\nFury lost to unified world champion Usyk in December while Joshua was stopped by IBF title holder Daniel Dubois in his most recent outing in September.\n\nMeanwhile, Benn and Eubank Jr have held lengthy talks about their fight ever since Benns anti-doping suspension was officially lifted in November.\n\nThe camps have disagreed about the purse split, but Eubank Jr says the bout remains on track to happen in 2025.\n\nThat fight will happen, Eubank Jr said.\n\nWere in negotiations and they are going very well. Were at the last few things weve got to smooth out and then the fight will get announced. So yeah, big things are happening very soon.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/12055347/OQ-SPORT-PREVIEW-FURY-AJ.jpg",
            "description": "<p>By BBC  HEAVYWEIGHT boxer, Anthony Joshua says a fight with Tyson Fury “has to happen this year” as he looks to book his next bout. A fight between the two British rivals has been spoken about for years but has never come to fruition. But with both men coming back from defeats in world title</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fight-against-tyson-fury-has-to-happen-this-year-says-heavyweight-boxer-anthony-joshua/\">Fight against Tyson Fury has to happen this year— says heavyweight boxer Anthony Joshua</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Comedian Trevor Noah’s ex-lover comes under fire: ‘The audacity!’",
            "url": "https://www.newzimbabwe.com/comedian-trevor-noahs-ex-lover-comes-under-fire-the-audacity/",
            "content": "By The South African\n\nSOUTH Africans have fiercely defended Trevor Noah after his ex, Jordyn Taylor called him a nobody on an episode of Selling The City.\n\nSouth Africans have dragged Noahs ex-girlfriend on social media over her comments about their relationship.\n\nThe singer-turned-real estate agent shared her controversial views on the Netflix reality TV series Selling The City.\n\nThe new production takes a look at hotshot agents who sell multi-million dollar properties in New York City.\n\nTREVOR NOAHS EX: WHAT DID SHE SAY?\n\nIn episode two of Selling The City, made several bombshell comments about her relationship with Noah. The couple dated from 2015 to 2018\n\nRevealing that they had met on Twitter (now X), Jordyn teased: At the time, he was a nobody. No one knew who he was.\n\nShe added: I was the funnier one in the relationship.\n\nIn a diary confession, she later accused Noah of plagiarising comedic material.\n\nShe said: Trevor borrowed me for material all the time. But he would also steal my material, a 100%.\n\nJordyn also admitted that Noah was her first high-profile client after she facilitated his $10 million (R187 million) New York apartment purchase.\n\nSOUTH AFRICANS ARE ENRAGED\n\nNeedless to say, many South Africans felt offended at an American calling Noah a nobody.\n\nUnder her social media posts, Jordyn has been attacked by angry fans of the comedian.\n\n@simpsmtshali: Your audacity is appalling.\n\n@therealwandlekunene: Look at the real nobody trying to be somebody.\n\n@vumilesibande: We are still waiting for you to crack a joke.\n\n@gtz_design: You are a nobodythe billboard you are on is for the show, in which you are just an extra.\n\n@NoContextSadc: Oh, please, he was already known as Trevor Noah while she, well, is still known as Trevors Ex. That should tell who is who.\n\n@TKwazi: Yet he bought a 10 million dollar home and was on The Daily Show at the time.\n\nSeveral more left profanities about Jordyn disrespecting Trevor Noah.\n\nJORDYN TAYLOR: I GAVE HIM A HEADS UP\n\nSpeaking to Page Six, Taylor claimed she gave her ex, Trevor Noah, a heads up about her comments about him before the show aired.\n\nHe is one of the more private people when it comes to the celebrity sphere. I did give him a little heads-up. But that relationship was six years ago, so its not recent, or I am emotionally dealing with it.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/12052027/South-Africans-have-dragged-Joryn-Taylor-over-her-comments-about-ex-boyfriend-Trevor-Noah-750x531.jpg.webp",
            "description": "<p>By The South African SOUTH Africans have fiercely defended Trevor Noah after his ex, Jordyn Taylor called him a ‘nobody’ on an episode of ‘Selling The City’. South Africans have dragged Noah’s ex-girlfriend on social media over her comments about their relationship. The singer-turned-real estate agent shared her controversial views on the Netflix reality TV</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/comedian-trevor-noahs-ex-lover-comes-under-fire-the-audacity/\">Comedian Trevor Noah’s ex-lover comes under fire: ‘The audacity!’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Investor says liquidity crunch, high taxes affecting ease of doing business despite a favourable market",
            "url": "https://www.newzimbabwe.com/investor-says-liquidity-crunch-high-taxes-affecting-ease-of-doing-business-despite-a-favourable-market/",
            "content": "By Anna Chibamu\n\nMEGA MARKET, markers of a range of wheat products have hailed the warm hospitality they have received from government ever since establishing their manufacturing plant in Mutare, Manicaland province.\n\nHowever, despite having a lucrative market for their wheat products in Zimbabwe, the company is facing a liquidity crunch that has affected its business operations.\n\nMega Market managing director, Shiraan Ahmed told government officials and journalists during a provincial tour of its premises last Thursday that the company supports governments path, but high production costs and the liquidity crunch issues must be reviewed.\n\nI think it is important that government must try to level the playing field between the informal and the formal sector. I think the formal sectors costs are very high at the moment.\n\nThe cost of power, labour and various statutory costs. It is critical that we grow the base. And once we grow the formal base, the tax revenues will grow automatically.\n\nSo, I think it is important at this moment in time to level the playing field, reduce taxes, reduce compliance costs, make compliance easy, so we can grow the formal market for the future of the economy, Ahmed said.\n\nThe company is producing 300 tonnes of wheat products per day and prefers to supply direct to huge retailers, avoiding the middleman in order to avoid counterfeit products on the market.\n\nWe have always been very strong with our big retailers, your Pick and Pay, your OK, your N. Richards and Gain. That has always been our traditional route to markets.\n\nWe enjoy that market because it gives us a good shelf presence, we ensure that the products that we produce actually get to the retailer. It avoids counterfeit products. So, were very pro the formal market,\n\nThe managing director highlighted that the market had shifted forcing most companies to cover every segment of the consumer.\n\nWe are forced to be both in the informal and formal market. Generally, the liquidity in the country is tight.\n\nThe formal retailers are struggling at the moment. I think the informal sector has become very strong. And given the overhead structure thats in the formal sector, they are struggling. And this is translating into cash flow which has an impact in our ability to supply the retailers., added Ahmed.\n\nHowever, he said the milling company, one of the largest in Africa, will not tire but adjust to current business environment.\n\nWe are navigating, we are looking for solutions with them, looking for payment solutions that are flexible.\n\nWe take local currency, we take ZIG, we take US dollars, we take Rand. Were trying to make it as easy as possible for the retailers. From our point of view, it is important that the retail sector survives in the country for the future of the economy, for the benefit of the fiscus, and for the general economic growth, he added.\n\nAhmed projected a high demand for Mega Market products.\n\n If you produce a good quality product and you have availability of product, I think there is demand out there.\n\nSo, were continuing to grow. Were continuing to go at full speed. Were looking at various projects of value addition and beneficiation.\n\nWe are looking at setting up a noodles line. Were looking at cereal lines, pasta lines, and various other projects that are currently in the feasibility stage. Weve all focus on the economy, and we continue to grow as a business.\n\nHigh production costs have led to closure of many companies in Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/12043955/1736656680977.jpg",
            "description": "<p>By Anna Chibamu MEGA MARKET, markers of a range of wheat products have hailed the warm hospitality they have received from government ever since establishing their manufacturing plant in Mutare, Manicaland province. However, despite having a lucrative market for their wheat products in Zimbabwe, the company is facing a liquidity crunch that has affected its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/investor-says-liquidity-crunch-high-taxes-affecting-ease-of-doing-business-despite-a-favourable-market/\">Investor says liquidity crunch, high taxes affecting ease of doing business despite a favourable market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Public transporters in ‘rain-induced’ bus fare hikes; passengers complain of unfair treatment",
            "url": "https://www.newzimbabwe.com/public-transporters-in-rain-induced-bus-fare-hikes-passengers-complain-of-unfair-treatment/",
            "content": "By Staff Reporter\n\nTHE incessant rains witnessed across the country have triggered unilateral increases in bus fares by public transporters, particularly in urban areas.\n\nIn some instances, commuters are being asked to fork out US$1 up from US$0.50c for short routes of less than 10 kilometres.\n\nFor routes such as Harare central business district to Chitungwiza, Glen View, Budiriro, Hopley, Norton, Hatcliffe, Mabvuku and Domboshava and other outlying areas where commuters pay an average of US$1, when it rains bus conductors demand US$3 per person.\n\nWhile the rains signal good tidings for everyone because they bring bountiful harvests, they are a bad omen for commuting urbanites who bear the brunt of unilateral fare hikes, said Hillary Zvoushe of Harare.\n\nAnother commuter, Ashleigh Shoriwa of St Marys in Chitungwiza raised concern over the increases in fares when it rains.\n\nCongestion during peak hours, and lately the rains are motivating the rank marshalls, conniving with conductors, to raise the fares willy-nilly. It is take-it-or-leave it, said Shoriwa.\n\nAfter a long tiring day at work, you wouldnt want to be standing at the congested ranks risking being robbed and unsure when you will get home to your children.\n\nYou end up paying whatever amount, US$1 or US$2 for a trip that normally costs half that fare, she added.\n\nA commuter omnibus conductor, Munyaradzi Chogugudza said kombi crews take advantage of the rain season to increase daily takings.\n\nIt is time for us to cash in on the rains. We give the vehicle owner the agreed daily target, say US$40, and we pocket the difference from hiked faresevery dog has its day, chuckled Chogugudza, who plies the Hatcliffe route.\n\nThe Passengers Association of Zimbabwe (PAZ) told NewZimbabwe.com that its members had raised concerns over the unexplained fare hikes.\n\nAs the rainy season persists, the PAZ continues to receive complaints about exorbitant fares charged by transport operators, said PAZ president, Tafadzwa Goliath.\n\nDue to the rains, the poor state of roads has created a situation where passengers are being taken advantage of.\n\nPassengers are being charged excessive fares for short distances, supposedly due to the poor road conditions. Some roads, although trafficable, are being used as an excuse to inflate fares.\n\nPAZ is demanding fair bus fares pricing and transparency.\n\nTransport operators must charge fares that reflect the actual distance travelled and the conditions of roads.\n\nOperators should clearly display their fare structures and provide explanations for any price increases.\n\nGoliath said relevant authorities must intervene and regulate fares and ensure that passengers are not exploited.\n\nTogether, we can fight for fair and affordable transportation, said the PAZ president.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10145359/Kombi.jpg",
            "description": "<p>By Staff Reporter THE incessant rains witnessed across the country have triggered unilateral increases in bus fares by public transporters, particularly in urban areas. In some instances, commuters are being asked to fork out US$1 up from US$0.50c for short routes of less than 10 kilometres. For routes such as Harare central business district to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/public-transporters-in-rain-induced-bus-fare-hikes-passengers-complain-of-unfair-treatment/\">Public transporters in ‘rain-induced’ bus fare hikes; passengers complain of unfair treatment </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "“Flush out illegal Zimbabwean immigrants’ children from our schools”— says Mashaba, alleges they overstretch resources in South Africa’s education sector",
            "url": "https://www.newzimbabwe.com/flush-out-illegal-zimbabwean-immigrants-children-from-our-schools-says-mashaba-alleges-they-overstretch-resources-in-south-africas-education-sector/",
            "content": "By Staff Reporter\n\nSOUTH African opposition leader, Herman Mashaba has condemned his governments directive to allow children of undocumented foreigners, including Zimbabweans, to attend schools in that country.\n\nFor the 2025 academic year, South Africas Department of Basic Education (DBE) ordered schools to admit all learners, regardless of their documentation status.\n\nAccording to the memo, those set to benefit include students who fail to provide identification for the countrys matric years and undocumented foreign pupils.\n\nA significant portion of these children are Zimbabweans, often trafficked across the border to parents working illegally in South Africa.\n\nMashaba, who leads Action SA, said had he been in authority he would not allow any undocumented individual or learner to benefit from South Africas already strained resources.\n\nHe was speaking on South Africas national broadcaster SABC.\n\nWe live in a country where a huge percentage of our public schools particularly in poor areas are dilapidated, in an environment where we do not have teachers, where our education system is dire, said Mashaba.\n\nHe said governments decision to allow children of undocumented immigrants to learn without proper documentation encourages more unregistered learners from various countries to come for subsidised education.\n\nThis is because South Africa now seems to be a country where you do not need passports or VISAs, they just have to walk through our porous borders. Our sovereignty is not there anymore.\n\nAn unquantifiable number of Zimbabweans work in South Africa illegally.\n\nThey were forced to brave trekking down south, passing through a crocodile-infested Limpopo river, by Zimbabwes continuously worsening economy that has destroyed hopes of finding jobs.\n\nZimbabweans form a unit of foreigners that include Mozambicans, Malawians and Somalis, which has over the past decades fallen victim to xenophobic vigilante groups chasing them out of South Africa. This includes the infamous Dudula militia.\n\nAdded Mashaba: I do not understand the logic behind this. The people who made this decision want to make sure that South Africans are as poor as possible.\n\nWe know our neighbouring countries are dysfunctional as a result of South Africa also not assisting but we are making matters worse.\n\nI am not sure who they are trying to satisfy. If I had my way, there was no way we would allow anyone without documentation in our country.\n\nAllowing them to use services when we cannot afford them for our own people (does not make sense). You even find in some schools children numbering 90 in a class.\n\nThis is not the first time a senior official has questioned the use of public resources by illegal immigrants in the rainbow nation.\n\nIn 2022, a health official, Phophi Ramathuba, was recorded chastising a Zimbabwean woman who had travelled to South Africa for medical attention after being involved in a car accident.\n\nYou are killing my health system, is what Ramathuba told the woman on video.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/12041618/Herman-Mashaba-jpg.webp",
            "description": "<p>By Staff Reporter SOUTH African opposition leader, Herman Mashaba has condemned his government’s directive to allow children of undocumented foreigners, including Zimbabweans, to attend schools in that country. For the 2025 academic year, South Africa’s Department of Basic Education (DBE) ordered schools to admit all learners, regardless of their documentation status. According to the memo,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/flush-out-illegal-zimbabwean-immigrants-children-from-our-schools-says-mashaba-alleges-they-overstretch-resources-in-south-africas-education-sector/\">“Flush out illegal Zimbabwean immigrants’ children from our schools”— says Mashaba, alleges they overstretch resources in South Africa’s education sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Overwhelmed City of Harare hires trucks from three councils to collect mounting garbage",
            "url": "https://www.newzimbabwe.com/overwhelmed-city-of-harare-hires-trucks-from-three-councils-to-collect-mounting-garbage/",
            "content": "By Tapiwa Svondo\n\nCITY of Harare (CoH) had to outsource refuse collection trucks from three local authorities to augment its fleet in the wake of mounting garbage during the just-ended festive season, NewZimbabwe.com has learnt.\n\nHarare hired refuse collection trucks from City of Mutare, Municipality of Chegutu, and Murehwa Town Council to cope with the solid waste crisis.\n\nCoH spokesperson, Stanley Gama admitted through a residents WhatsApp group that the situation had become desperate hence the move to outsource vehicles.\n\nFrom time to time when we need assistance, we request equipment from other local authorities who are not as busy as us and in this case, we had trucks from Mutare, Chegutu, and Murehwa to assist with the huge garbage over the Christmas period, said Gama.\n\nGamas admission raises serious questions about the citys waste management capacity amid the much-hyped procurement of tractors for refuse collection last year.\n\nIn January last year, CoH, through central government, procured 31 out of an envisaged 52 multipurpose tractors from Belarus, which were to be put in every ward in Harare under Operation Chenesa Harare. The whereabouts of the new vehicles remained a mystery.\n\nResponding to images of a fleet of parked refuse trucks, Gama admitted the local authority didnt have adequate trucks to collect garbage.\n\nThose are old broken-down trucks, some which will be auctioned to scrap metal dealers while a few will be rehabilitated, said Gama\n\nEfforts by NewZimbabwe.com to seek clarification from Gama regarding the specifics of the truck hires were fruitless by time of publishing.\n\nCharles Sadondo, Mutare acting corporate communications officer, confirmed his organisation provided services for Harare.\n\nWhat we can share at the moment is that we hired out our trucks to the CoH after a request by the central government requesting us to assist them in the clean-up campaign spearheaded by the government, said Sadondo\n\nChegutus town clerk, Jacob Chikuruwo, also confirmed the hiring of a truck during the festive season.\n\nYes, they hired one truck from us during the Christmas period. We didnt charge them; they only gave us fuel. The ministry (Local Government) had directed us to help them, said Chikuruwo.\n\nMurehwa town administrator, Farai Mutambatuwi said Harare hired one of their refuse collection vehicles.\n\nFrom us, it (Harare) hired one truck, said Mutabatuwi.\n\nMayor Jacob Mafume, when contacted, indicated that the council still needs more trucks as it only acquired five trucks last year.\n\nWe bought about five trucks last year, but we need more.\n\nIm not sure if those trucks are hired. There are those that the government helps us with by taking from departments or any city and we then assist with fuel, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/12045825/00380580_7f22637754911bca6408e5884c8c8c42_arc614x376_w735_us1.jpg",
            "description": "<p>By Tapiwa Svondo CITY of Harare (CoH) had to outsource refuse collection trucks from three local authorities to augment its fleet in the wake of mounting garbage during the just-ended festive season, NewZimbabwe.com has learnt. Harare hired refuse collection trucks from City of Mutare, Municipality of Chegutu, and Murehwa Town Council to cope with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/overwhelmed-city-of-harare-hires-trucks-from-three-councils-to-collect-mounting-garbage/\">Overwhelmed City of Harare hires trucks from three councils to collect mounting garbage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Father chops off son’s head; Murder suspect had just returned from church shrine— Police",
            "url": "https://www.newzimbabwe.com/father-chops-off-teenage-sons-head-murder-suspect-had-just-returned-from-church-shrine-police/",
            "content": "By Staff Reporter\n\nIN a gory murder that has shaken the Buhera community of Manicaland province, a 32-year-old man hacked off his tween sons head using an axe during an unprovoked attack.\n\nAs if the dismemberment wasnt enough, the assailant repeatedly struck the victim all over his body resulting in instant death.\n\nZimbabwe Republic Police (ZRP) confirmed the arrest of suspect, Tawanda Magoso (32) of Daakoni village, Buhera.\n\nThe ZRP reports that Tawanda Magoso (32) was arrested in connection with a case of murder which occurred at his house in Daakoni Village, Buhera on January 10, 2025, in which his son, Taonga Magoso (11) died, said ZRP national spokesperson, Commissioner Paul Nyathi.\n\nThe suspect allegedly returned home from a shrine where he had gone for prayers and took an axe from his bedroom which he used to strike the victim indiscriminately all over the body.\n\nThe victims head separated from its torso and sustained multiple injuries on the back. Resultantly, the victim succumbed to the injuries, Nyathi added.\n\nThe suspect was later apprehended with the help of members of the community and handed over to police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  IN a gory murder that has shaken the Buhera community of Manicaland province, a 32-year-old man hacked off his tween son’s head using an axe during an unprovoked attack. As if the dismemberment wasn’t enough, the assailant repeatedly struck the victim all over his body resulting in instant death. Zimbabwe Republic Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/father-chops-off-teenage-sons-head-murder-suspect-had-just-returned-from-church-shrine-police/\">Father chops off son’s head; Murder suspect had just returned from church shrine— Police </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        },
        {
            "title": "Government publishes ‘dubious’ list of Mbare Musika Market beneficiaries replete with duplicated names of fire victims",
            "url": "https://www.newzimbabwe.com/government-publishes-dubious-list-of-mbare-musika-market-beneficiaries-replete-with-duplicated-names-of-fire-victims/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwas administration is in the eye of a storm following the recent publication of a dubious list of would-be beneficiaries of the rehabilitated Mbare Musika Market in Harare.\n\nThe list, which was flighted in a local newspaper, is questionable as it bears duplicated names of those set to get vending spaces at the rehabilitated Mbare Musika while other awkward-sounding names have found room on the beneficiaries roll.\n\nThe release of names of beneficiaries earmarked to take up space at the popular fruit and vegetable market follows completion of reconstruction in the aftermath of a devastating fire that razed infrastructure and wares, last year.\n\nBoth farmers and vendors suffered losses of huge proportions prompting government to intervene to restore affected livelihoods.\n\nGovernments list contains names such as Clemence Azngwe (782), Clemence Anzangwe (783), Collen Hoetl (797), Collen Hotel (798), Collen Hotera (799) and Brighton Kusikwenyu (430) and Brighton Kusikwenyi (431).\n\nMore questionable duplications such as two entries for Concillia Madzime which are followed by a Concillia Madzima (808), Clara Manzvimbo (774) and Clara Nzvimbo (775) have been highlighted.\n\nSocial media users, who have been sharing images of the list published in a local state paper, say it is a reflection of how electoral body, Zimbabwe Electoral Commission (ZEC), handled the voters roll in the 2023 polls whose results were later disputed.\n\nSomeone downloaded a ZEC version 2.0, said a user identified as Constantine of Matobo in response to a post by Crime Watch Zimbabwe on the matter.\n\nMore commented dismissing the dubious beneficiaries list.\n\nWe saw this on the voters roll and thought we could do anything. Is it high time tabvuma? said another.\n\nZEC released a voters roll riddled with mistakes, which it said it would correct headed into Zimbabwes 2023 general elections whose results were heavily contested.\n\nThe electoral body was accused of rigging the plebiscites in favour of incumbent President Emmerson Mnangagwa and his Zanu PF party.\n\nI can bet my last dollar that there is noone called Clayposy Kamwaya in Zimbabwe, said one Dzvovani.\n\nAccording to a notice, those with queries can present them on or before the 19th of January.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/09132158/Mbare-9.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa’s administration is in the eye of a storm following the recent publication of a dubious list of would-be beneficiaries of the rehabilitated Mbare Musika Market in Harare. The list, which was flighted in a local newspaper, is questionable as it bears duplicated names of those set to get vending</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-publishes-dubious-list-of-mbare-musika-market-beneficiaries-replete-with-duplicated-names-of-fire-victims/\">Government publishes ‘dubious’ list of Mbare Musika Market beneficiaries replete with duplicated names of fire victims</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "13 Jan 2025"
        }
    ]
}