{
    "news": [
        {
            "title": "Intersex persons drag government to court in historic rights case",
            "url": "https://www.newzimbabwe.com/intersex-persons-drag-government-to-court-in-historic-rights-case/",
            "content": "By Mary Taruvinga\n\nFor the first time in Zimbabwes history, intersex persons have taken the government to court, demanding legal recognition of their rights and protection from decades of systemic exclusion.\n\nThe High Court application, filed under case number HCH4743/25, seeks a declaratory order compelling the state to officially recognise intersex people as a distinct category under Zimbabwean law.\n\nAmong their demands are the introduction of a third sex marker on birth certificates, IDs, and passports, procedures to amend sex markers on documents, and a ban on non-consensual, non-essential surgeries on intersex minors. They also want full access to rights such as dignity, education, healthcare, and equality under the Constitution.\n\nThe case has seven applicants, including two minors denied education and social services because their documents did not reflect their lived realities. One adult applicant was subjected to irreversible surgery as a child, leaving them with lifelong health complications and mismatched identity papers.\n\nThe minors are being represented by their legal guardians.\n\nThe Health Law and Policy Consortium (HLPC) and the Intersex Community of Zimbabwe (ICoZ) have also joined the case as institutional applicants. Cited as respondents are the Registrar-General, the Ministers of Home Affairs, Health, and Justice, and the Attorney General.\n\nIn his founding affidavit, Tinashe Mundawarara, HLPC board chairperson, argued that failure to issue accurate identity documents violates childrens constitutional rights.\n\nSection 81 (1)(c) specifically guarantees every child the right to a birth certificate, he said. By failing to ensure that intersex children are issued birth certificates that reflect their unique biological reality, the respondents deny them a fundamental right and create barriers to accessing essential services such as healthcare and education.\n\nHLPC programs coordinator Dorcas Chitiyo added: This case seeks to address the systematic legal and administrative failures that have perpetuated exclusion, discrimination and harm against intersex persons in Zimbabwe.\n\nICoZ director Kudakwashe Murisa said intersex people have endured silence and invisibility for too long.\n\nThis case is historic. For the first time, the Zimbabwean legal system is being challenged to recognise the rights of intersex individuals as equal human beings under the Constitution, they said.\n\nMurisa stressed that the matter goes beyond individual struggles.\n\nThis case is not just about one individual. It is about an entire community that has been made invisible for too long. It is about ensuring that no intersex child will endure what so many others have suffered in silence.\n\nAs an intersex person, Murisa described the personal toll of mismatched documents: Being intersex, I have to explain myself each time I want to use my identity documents. This is because they dont match with the sex I was assigned at birth.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29182429/INTERSEX.png",
            "description": "<p>By Mary Taruvinga For the first time in Zimbabwe’s history, intersex persons have taken the government to court, demanding legal recognition of their rights and “protection from decades of systemic exclusion.” The High Court application, filed under case number HCH4743/25, seeks a declaratory order compelling the state to officially recognise intersex people as a distinct</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/intersex-persons-drag-government-to-court-in-historic-rights-case/\">Intersex persons drag government to court in historic rights case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "30 Sep 2025"
        },
        {
            "title": "Mnangagwa moves to shield himself from coup threat with army vehicle handout",
            "url": "https://www.newzimbabwe.com/mnangagwa-moves-to-shield-himself-from-coup-threat-with-army-vehicle-handout/",
            "content": "By Staff Reporter\n\nAs the succession battle within Zanu-PF intensifies, President Emmerson Mnangagwa has moved to stave off any potential coup by awarding more than 700 senior army officers top-of-the-range, all-terrain vehicles, his spokesperson George Charamba has confirmed.\n\nMnangagwas decision follows his absence from the United Nations General Assembly amid intelligence reports suggesting the possible arrest of his loyalists, controversial business tycoons Kudakwashe Tagwirei, Wicknell Chivayo, Delish Nguwaya, and Paul Tungwarara.\n\nThe four were reportedly named in a corruption dossier Vice President Constantino Chiwenga presented at the recent Zanu-PF politburo meeting in Harare.\n\nHaunted by the spectre of November 2017, Mnangagwa appears to be taking no chances, seeking to appease the military, the traditional kingmakers in Zimbabwean politics.\n\nHis Excellency the President today handed over 102 vehicles to the ZDF in order to capacitate the Defence Force. All told, the ZDF will get over 700 vehicles, the first ever time that ZDF has received such a consignment within a short-time bracket, Charamba announced on his X account on Monday.\n\nThe timing has raised eyebrows, with many viewing the gesture as a clear coup-proofing strategy.\n\nCharamba defended the move, framing it as a fulfilment of service conditions for senior officers: The vehicles, which are part of the conditions of service for senior army officers, plug a gap in conditions of service for officers, some of whom had gone for a couple of years without a full set of their entitlements.\n\nHowever, he also revealed the allocation is structured as a loan. In public sector parlance, these vehicles are called personal issue service vehicles. What that means is that the vehicle is personal to the haver, who is also allowed to buy the vehicle after a stipulated time.\n\nThe development has already sparked public scrutiny, with critics demanding clarity on the source of funds and whether the purchase was accounted for in the 2025 national budget.\n\nObservers warn Zimbabwe is increasingly resembling a mafia-style economy where political elites distribute vehicles and perks like candy to loyalists and strategic allies in order to cling to power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29181705/army-ED.jpeg",
            "description": "<p>By Staff Reporter As the succession battle within Zanu-PF intensifies, President Emmerson Mnangagwa has moved to stave off any potential coup by awarding more than 700 senior army officers top-of-the-range, all-terrain vehicles, his spokesperson George Charamba has confirmed. Mnangagwa’s decision follows his absence from the United Nations General Assembly amid intelligence reports suggesting the possible</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-moves-to-shield-himself-from-coup-threat-with-army-vehicle-handout/\">Mnangagwa moves to shield himself from coup threat with army vehicle handout   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "30 Sep 2025"
        },
        {
            "title": "Zimbabwe to host IATF permanent secretariat",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/",
            "content": "APA News\n\nThe Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO).\n\nThe move, announced during IATF2025 in Algiers, marks a major milestone in Africas push for economic integration under the African Continental Free Trade Area (AfCFTA).\n\nThe decision to base the headquarters in Zimbabwe followed a competitive bidding process involving Burkina Faso, Cameroon, Malawi, Zambia, South Africa and Zimbabwe.\n\nFormer Nigerian President Olusegun Obasanjo, chairperson of the IATF Advisory Council, said Zimbabwe was selected for its strong conferencing infrastructure, air connectivity, accommodation capacity and commitment to land provision for future expansion.\n\nThis opens a new chapter for IATF as it continues powering growth in intra-African trade and playing its role as the most important trade and investment gathering on the continent, Obasanjo said.\n\nBacked by an initial capitalisation of $28 million approved by the African Export-Import Bank (Afreximbank), IATFCO will serve as the institutional anchor for the biennial trade fair, which has grown into the continents largest marketplace for intra-African commerce.\n\nAfreximbank president Benedict Oramah hailed the development as a huge milestone, urging African governments, corporations and financial institutions to support the institution during its formative phase.\n\nIATF is co-convened by Afreximbank, the African Union Commission and the AfCFTA Secretariat.\n\nIt provides a platform for businesses to showcase goods and services, forge partnerships and tap into AfCFTAs single market of over 1.4 billion people and a combined gross domestic product exceeding $3.5 trillion.\n\nThe 2025 edition of the fair, held from 4 to 10 September in Algiers, attracted over 112,000 visitors from 132 countries, hosted 2,148 exhibitors and generated $48.3 billion in trade and investment deals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>APA News The Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO). The move, announced during IATF2025 in Algiers, marks a major milestone in Africa’s push for economic integration under the African Continental Free Trade Area</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/\">Zimbabwe to host IATF permanent secretariat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "30 Sep 2025"
        },
        {
            "title": "ZWG inflation rate slips to a negative 0,2%",
            "url": "https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/",
            "content": "By Alois Vinga\n\nThe Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to 0.2%, raising hopes that annual inflation,still in double digits,will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday.\n\nAccording to the latest data, the ZWG has maintained notable stability against the US dollar since September 2024, when it last registered a major dip.\n\nThe ZWG month-on-month inflation rate was 0.2% in September 2025, shedding 0.6 percentage points from the August 2025 rate of 0.4%. This means that prices, as measured by the all-items ZWG Consumer Price Index (CPI), decreased by an average of 0.2% between August and September 2025, Zimstat said.\n\nFood and Non-Alcoholic Beverages recorded a month-on-month inflation rate of 0.2% in September, up from 0.1% in August. In contrast, non-food inflation fell to 0.5%, down from 0.6% in the previous month.\n\nYear-on-year, however, inflation remains elevated. The ZWG year-on-year inflation rate for September 2025 was 82.7%, meaning prices increased by an average of 82.7% compared to September 2024, Zimstat added.\n\nThe Reserve Bank of Zimbabwe (RBZ) has continued to pursue a tight monetary policy to safeguard the ZiG currency introduced in April 2024. This has included maintaining a high policy rate to curb speculative borrowing and anchor both inflation and exchange rate expectations.\n\nMeanwhile, Zimstat reported that US dollar inflation remained steady, with the September 2025 month-on-month rate unchanged at 0%, while year-on-year inflation stood at 13.4%.\n\nOn the poverty benchmarks, the Food Poverty Line (FPL) for one person in September was ZWG 877.03, while the Total Consumption Poverty Line (TCPL) stood at ZWG 1,292.80,the minimum needed per person to cover both food and non-food requirements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to –0.2%, raising hopes that annual inflation, still in double digits, will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday. According to the latest data, the ZWG has maintained notable stability</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/\">ZWG inflation rate slips to a negative 0,2%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "30 Sep 2025"
        },
        {
            "title": "Armed robbery cases rise by 4% as police struggle with resource shortages",
            "url": "https://www.newzimbabwe.com/armed-robbery-cases-rise-by-4-as-police-struggle-with-resource-shortages/",
            "content": "By Anna Chibamu\n\nThe Zimbabwe Republic Police (ZRP) has reported a 4% increase in armed robbery cases between January and August this year, a rise officials partly attribute to the forces acute shortage of vehicles, equipment, and manpower needed to effectively combat crime.\n\nDeputy Police Commissioner for Administration Leny Ncube told the Defence, Security and Home Affairs Parliamentary Portfolio Committee during an oral evidence hearing on Tuesday that while general robbery cases fell by 8% over the same period, armed robberies  the most violent category  remain a growing concern.\n\nOur analysis of crime statistics for the period January to August 2025, compared to the same period in 2024, reveals a different picture. We have recorded an overall 8% decrease in total robbery cases. However, there is a concerning 4% increase in the most violent category,robberies committed using firearms, Ncube said.\n\nHe added that the ZRP was fully alert to the threat and taking action within its means, but warned that the shortage of resources was undermining the polices ability to respond effectively.\n\nWhile government has over the past years availed operational vehicles, we continue to experience shortages as our ageing fleet is susceptible to breakdowns, hampering rapid response to crime scenes. The sad reality is that we are often outpaced by criminals using high-powered vehicles, Ncube said.\n\nOf the ZRPs required 9,320 vehicles, the force currently has 2,830, of which 1,007 are grounded due to breakdowns,leaving only 1,823 operational, roughly 20% of its needs.\n\nThe Deputy Commissioner also highlighted that criminal syndicates were becoming increasingly sophisticated, with some involving former security service members who brought expertise to their operations. These groups, he said, were using cloned vehicles, counter-intelligence tactics, and advanced technologies, leaving the ZRP ill-equipped.\n\nWe lack advanced technology to monitor the movement of sophisticated and transnational criminals. In todays environment, where criminal activity is being propelled by technology, technology-driven policing ceases to be a luxury,it is now essential if we are to remain relevant, Ncube stressed.\n\nTo mitigate the surge in armed robberies, the police are encouraging businesses to invest in functional CCTV systems and alarm technologies.\n\nThe ZRP is steadily advancing its capabilities through the strategic adoption of technology to combat armed robberies. Our focus is on both prevention and investigation, and we are championing the adoption of security technologies within the business community, Ncube said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/07065619/Armed-robberry.jpg",
            "description": "<p>By Anna Chibamu The Zimbabwe Republic Police (ZRP) has reported a 4% increase in armed robbery cases between January and August this year, a rise officials partly attribute to the force’s acute shortage of vehicles, equipment, and manpower needed to effectively combat crime. Deputy Police Commissioner for Administration Leny Ncube told the Defence, Security and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/armed-robbery-cases-rise-by-4-as-police-struggle-with-resource-shortages/\">Armed robbery cases rise by 4% as police struggle with resource shortages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "30 Sep 2025"
        },
        {
            "title": "China opens world’s highest bridge, breaking its own record",
            "url": "https://www.newzimbabwe.com/china-opens-worlds-highest-bridge-breaking-its-own-record/",
            "content": "NBC News\n\nThe worlds highest bridge opened inChinaon Sunday, taking the crown from another bridge in the same province.\n\nThe Huajiang Grand Canyon Bridge soars about 2,050 feet above a river and gorge in the southern Chinese province ofGuizhou.It is more than twice as high as the Royal Gorge Bridge, which is suspended 956 feet above the Arkansas River in Colorado and is the highest in the United States.\n\nAccording to Chinese state media, the new Guizhou bridge also sets a record as the worlds longest bridge in a mountainous region, spanning 4,600 feet across.\n\nHailed as Chinas latest infrastructure miracle, the bridge is designed to spur tourism and economic growth in one of the countrys least developed regions.\n\nThe mega project, constructed over three years and eight months, will cut travel time between the two sides of the canyon from two hours to two minutes and connect major tourist spots, officials said.\n\nTian Hongrui, a technician for the Huajiang Grand Canyon Bridge, said he felt proud to have left a mark.\n\nLeaving now is bittersweet, but this isnt the end, Tian told state-run broadcaster CCTV News. Its the start of a new chapter.\n\nThe bridge has a high-speed glass elevator that can send visitors to a coffee spot 2,600 feet above the river. Visitors can also try bungee jumping or a 1,900-foot-high glass walkway.\n\nThe province of Guizhou, which is home to about 40 million people, has undergone an infrastructure campaign in recent decades as part of theChinese governments war on poverty. It now has more than 32,000 bridges that are either completed or under construction, compared with about 2,900 in the 1980s.\n\nGuizhou is also home to what is now the worlds second-highest bridge, Duge Bridge, which opened in 2016.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29192519/china-bridge.png",
            "description": "<p>NBC News The world’s highest bridge opened in China on Sunday, taking the crown from another bridge in the same province. The Huajiang Grand Canyon Bridge soars about 2,050 feet above a river and gorge in the southern Chinese province of Guizhou. It is more than twice as high as the Royal Gorge Bridge, which is suspended 956</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-opens-worlds-highest-bridge-breaking-its-own-record/\">China opens world’s highest bridge, breaking its own record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "30 Sep 2025"
        },
        {
            "title": "High Court quashes Rusape councillors’ malicious prosecution damages award",
            "url": "https://www.newzimbabwe.com/high-court-quashes-rusape-councillors-malicious-prosecution-damages-award/",
            "content": "By Mary Taruvinga\n\nThe High Court has overturned a ruling that had awarded damages to six Rusape councillors who sued the town council for malicious prosecution, finding that the council never instigated their arrest and that their claims for legal fees and lost business were unsupported.\n\nJustices Sijabuliso Siziba and Isaac Muzenda allowed Rusape Town Councils appeal and dismissed the councillors claims, which had each been pegged at US$7,500.\n\nThe court a quo erred in finding the appellant liable for the delict of malicious prosecution, ruled Justice Siziba. There was no evidence that the council, as a legal persona, took a resolution to set the law in motion against the respondents. Without such resolution, the council cannot be said to have instigated prosecution.\n\nThe case stemmed from a 2020 tender row over the provision of legal services. The six councillors Lyton Sithole, Elizabeth Chidza, Joseph Nyamupera, Ndabaningi Mataga, Preference Chigwede and Peter Kwesha were arrested and charged by the Zimbabwe Anti-Corruption Commission (ZACC) with criminal abuse of duty after the tender was cancelled.\n\nHowever, at their criminal trial, State witnesses, including then Acting Town Secretary Fansen Shuwa, cleared them of wrongdoing, testifying that they had not been part of the committee handling the tender. The councillors were acquitted at the close of the States case.\n\nIn 2023, the six sued the council for malicious prosecution, demanding US$40,000 collectively in damages. The magistrates court later awarded them each US$5,500 for legal fees and US$2,000 for lost business opportunities.\n\nThe High Court said those awards had no evidentiary basis.\n\nMalicious prosecution requires more than merely reporting a case to the police, Justice Siziba said. A party can only be found liable if it acted in a manner that tended to overbear on the police to institute proceedings which they would not otherwise commence. That was not the case here.\n\nThe court noted that ZACC had independently approached town officials and obtained statements while the councillors were away, with no council resolution authorising or directing such action.\n\nOn the issue of damages, the judges stressed that special damages must be strictly proven. No receipts were produced to show that any payment was made to lawyers, Justice Siziba wrote. It was a misdirection for the trial court to rely on the Law Society tariff in the absence of proof of actual payment.\n\nThe judges also dismissed the claims for lost business opportunities as unsubstantiated.\n\nThe councillors victory in the lower court has now been nullified. Rusape Town Council will not be liable for any damages.\n\nIn the result, we found merit in the appeal by the appellant and thereby upheld the appeal, the judgment concluded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29191212/rusape.jpg",
            "description": "<p>By Mary Taruvinga The High Court has overturned a ruling that had awarded damages to six Rusape councillors who sued the town council for malicious prosecution, finding that the council never instigated their arrest and that their claims for legal fees and lost business were unsupported. Justices Sijabuliso Siziba and Isaac Muzenda allowed Rusape Town</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-quashes-rusape-councillors-malicious-prosecution-damages-award/\">High Court quashes Rusape councillors’ malicious prosecution damages award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "30 Sep 2025"
        }
    ]
}