{
    "news": [
        {
            "title": "Life’s journey leads Zimbabwean accountant to farming in Central Otago",
            "url": "https://www.newzimbabwe.com/lifes-journey-leads-zimbabwean-accountant-to-farming-in-central-otago/",
            "content": "Otago Daily Times\n\nFrom rural Zimbabwe to the rolling hills of Central Otago, Conrad Kamotas journey has come full circle  from finance professional to aspiring farmer.\n\nRaised in a family deeply rooted in agriculture, Mr Kamotas story began in Guruve, Northern Zimbabwe, where his father, a former soldier, returned to farming life alongside his wife.\n\nThe family grew cotton and maize and kept goats and cattle, with one of their proudest moments being Mr Kamotas father receiving a regional award for excellence in cotton farming.\n\nHowever, Mr Kamota took a different initial path.\n\nA standout student, he earned scholarships through high school and later graduated with a degree in finance from the National University of Science and Technology in Bulawayo.\n\nHis qualifications launched a successful career as a chartered accountant, working across sectors including aviation, health, hospitality and education in Zimbabwe, Malawi and South Africa.\n\nIn 2023, Mr Kamota and his wife Karen, a qualified early childhood education (ECE) teacher, migrated to New Zealand under the skilled migrant category. After initially settling in Auckland with their two children, the family moved south to Central Otago.\n\nMr Kamota took on the role of financial director at Central Otago Health Services Ltd and now serves as financial manager for Dunedin Kindergartens, splitting his time between Central Otago and Dunedin.\n\nDespite a thriving career in finance, his passion for farming remains strong.\n\nOutside of work, I have a passion for farming.\n\nI have Boer goats, and the plan is to get a farm and continue to grow and increase the herd for export, he said.\n\nTo help turn this vision into a viable business, Mr Kamota applied for a mentor through the Newcomers Business Mentorship Programme.\n\nHis goal was clear: To build confidence in business in a developed structure, with someone who can help me network, give me practical advice and provide a safe space to share mistakes and understand the context of New Zealand.\n\nThe programme, a collaboration between Business Mentors NZ, Business South and Central Otagos Welcoming Communities initiative, has paired Mr Kamota with a mentor for a year-long journey.\n\nOrganisers say they are thrilled to support his agricultural ambitions.\n\nWere excited to see where Mr Kamota takes his farming venture and look forward to following his progress, a spokesperson said.  Allied Media\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24052213/kamota.png",
            "description": "<p>Otago Daily Times From rural Zimbabwe to the rolling hills of Central Otago, Conrad Kamota’s journey has come full circle — from finance professional to aspiring farmer. Raised in a family deeply rooted in agriculture, Mr Kamota’s story began in Guruve, Northern Zimbabwe, where his father, a former soldier, returned to farming life alongside his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lifes-journey-leads-zimbabwean-accountant-to-farming-in-central-otago/\">Life’s journey leads Zimbabwean accountant to farming in Central Otago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "24 Sep 2025"
        },
        {
            "title": "‘I was born in Soweto, not Zimbabwe’: Zandile Dabula responds to questions about her identity",
            "url": "https://www.newzimbabwe.com/i-was-born-in-soweto-not-zimbabwe-zandile-dabula-responds-to-questions-about-her-identity/",
            "content": "TimesLive\n\nOperation Dudula leader Zandile Dabula has responded to critics who called for her deportation, as they claim she is from Zimbabwe.\n\nKnown for her anti-immigrant stance, Dabula has found herself in the middle of controversy, with some accusing her of promoting xenophobia and violating human rights while others have questioned her identity on social media.\n\nSpeaking to the media on Monday, Dabula clarified that she is South African.\n\nIm abona fidecitizen of this country. I was born and bred in Diepkloof in Soweto and not in Zimbabwe. Thats the only reason I want to put my fellow South Africans first, because I know their struggles.\n\nShe said the smear campaign was initiated by EFF members.\n\nWe are aware of the plottings and they are coming from those red berets. I know there were campaigns launched to decampaign me but its not working.\n\nOperation Dudula was launched in 2021 and was in the spotlight recently when members blocked illegal foreigners from accessing public healthcare facilities, saying they are putting pressure on the overburdened health system.\n\nOrganisations, including the health department and the South African Human Rights Commission, have condemned Operation Dudulas actions.\n\nOn Monday the group took its immigration fight to state schools, saying it would block foreign children from accessing schools, prompting the Gauteng education department to intervene.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10045549/Operation-Dudula-leader-Zandile-Dabula.jpeg",
            "description": "<p>TimesLive Operation Dudula leader Zandile Dabula has responded to critics who called for her deportation, as they claim she is from Zimbabwe. Known for her anti-immigrant stance, Dabula has found herself in the middle of controversy, with some accusing her of promoting xenophobia and violating human rights while others have questioned her identity on social</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-was-born-in-soweto-not-zimbabwe-zandile-dabula-responds-to-questions-about-her-identity/\">‘I was born in Soweto, not Zimbabwe’: Zandile Dabula responds to questions about her identity</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "24 Sep 2025"
        },
        {
            "title": "Dairibord milk intake surpasses 20 million litres",
            "url": "https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/",
            "content": "By Alois Vinga\n\nListed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges.\n\nPresenting the companys half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3 million litres, which accounts for 38% of national production.\n\nThe milk supply development unit continues to recruit new producers, including small and medium-scale farmers, to meet growing demand. The group achieved an 18% growth in overall sales volume, with food sales up 18%, driven by strong yoghurt and tomato sauce sales, Chiromo said.\n\nNational raw milk production also increased by 3.9% year-on-year, from 55.1 million litres to 57.3 million litres.\n\nDZLs beverages segment surged by 28%, buoyed by exceptional performances from Pfuko and Cascade, alongside a recovery in tea due to improved availability. Liquid milk volumes posted modest growth of 1%.\n\nAs of 30 June 2025, DZL reported total assets of US$53.84 million, compared to US$53.49 million in December 2024, while total liabilities stood at US$27.67 million, down from US$28.54 million in the previous period.\n\nEquity attributable to ordinary shareholders rose to US$26.16 million, up from US$24.95 million.\n\nRevenue for the period reached US$64.32 million, an 18% increase compared to the same period in 2024. Profit before tax jumped 51% year-on-year to US$2.08 million, boosted by lower finance costs. Basic and diluted earnings per share stood at US$0.34 cents.\n\nRetained earnings climbed to US$16.28 million, from US$15.07 million as of December 2024, largely driven by profit growth. No dividend was declared for the period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/22172046/Dairibord.jpg",
            "description": "<p>By Alois Vinga Listed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges. Presenting the company’s half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/\">Dairibord milk intake surpasses 20 million litres</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "24 Sep 2025"
        },
        {
            "title": "High Court joins developer Arosume to upmarket Carrick Creagh land dispute",
            "url": "https://www.newzimbabwe.com/high-court-joins-developer-arosume-to-upmarket-carrick-creagh-land-dispute/",
            "content": "By Mary Taruvinga\n\nThe High Court has ordered Arosume Property Development (Pvt) Ltd to be joined in a bitter property dispute involving businesswoman Farai Olivia Mashonganyika and the Minister of Local Government, ruling that the developer has a direct and substantial interest in the contested Carrick Creagh land.\n\nDelivering judgment on September 5, 2025, Justice Siyabona Musithu said, The applicant not only has a substantial interest in the issues raised in HCH 884/24 concerning the property, but the applicants rights in the said property will be affected by any judgment that may be rendered without its involvement.\n\nHe said that excluding Arosume from the ongoing litigation would risk an incomplete determination of the matter.\n\nRule 32(12) bestows upon the court the discretion to order any person whose presence before the court is necessary to ensure that all issues in dispute may be effectually and completely determined, he said.\n\nThe case centres on stand 91 Kidron Valley Road, Carrick Creagh Estate, Borrowdale, transferred to Mashonganyika under Deed of Transfer 5690/2011. In 2022, the Ministry of Local Government moved to cancel her title deed, accusing her of failing to pay over US$520,195 in development costs and claiming she was not a member of the Sally Mugabe Housing Cooperative, which was part of the project.\n\nArosume, the developer in a Public-Private Partnership (PPP) with the State and the cooperative, argued it was deliberately excluded when Mashonganyika filed a review application challenging the ministrys cancellation order. The firm alleged that the deed was fraudulently obtained and that it had already filed an urgent application to block Mashonganyika from building on the land.\n\nMashonganyika, however, insists she bought the property legitimately in 2011, paying US$4,000 directly to the ministry after previously being misled by Arosume to part with US$10,000. She maintains the government acted unlawfully by cancelling her deed without a court order.\n\nA deed of transfer confers real rights of ownership which cannot be terminated without a court order, she argued in her opposing affidavit.\n\nShe further accused the ministry of acting at Arosumes behest, alleging connivance between the developer and government to wrestle away her property.\n\nJustice Musithu dismissed her objections, finding that Arosumes interest arose from the tripartite PPP agreement governing Carrick Creagh. He noted that Mashonganyika herself had acknowledged the existence of a dispute with the developer in earlier court filings.\n\nThe dispute is much broader than the mere administrative process that the first respondent claims she wants regularised, the judge said. Any judgment affecting the property will also impact the developers rights under the tripartite arrangement.\n\nThe court granted Arosumes joinder, directing the company to file its opposing papers in the main matter (HCH 884/24) within five days. The question of costs was deferred to that case.\n\nThe ruling paves the way for a full trial in which the High Court will weigh competing claims of fraud, non-payment, and unlawful cancellation in one of Harares most high-profile land battles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/23072643/carrick-creagh.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ordered Arosume Property Development (Pvt) Ltd to be joined in a bitter property dispute involving businesswoman Farai Olivia Mashonganyika and the Minister of Local Government, ruling that the developer has a “direct and substantial interest” in the contested Carrick Creagh land. Delivering judgment on September 5, 2025, Justice</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-joins-developer-arosume-to-upmarket-carrick-creagh-land-dispute/\">High Court joins developer Arosume to upmarket Carrick Creagh land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "24 Sep 2025"
        },
        {
            "title": "Developer Felix Munyaradzi loses legal battle in Sandton property dispute",
            "url": "https://www.newzimbabwe.com/developer-felix-munyaradzi-loses-legal-battle-in-sandton-property-dispute/",
            "content": "By Mary Taruvinga\n\nThe High Court has ruled in favour of Harare resident Cephas Tapiwa Muneri, declaring him the rightful holder of rights and interests in a contested Haydon Park stand, after a protracted legal battle with Delatfin Civil Engineering and controversial land developer Felix Munyaradzi.\n\nIn a judgment delivered on September 8, Justice Siyabona Musithu declared that Muneri is the lawful owner of Stand 1650, Haydon Park, Sandton, measuring 1,097 square metres, and blocked attempts by Munyaradzis firm to repossess the property.\n\nThe applicant is hereby declared the lawful holder of rights and interests in Stand Number 1650 Haydon Park, Sandton, ruled Justice Musithu. The attempt by the first and second respondents to repossess the stand from the applicant is hereby declared unlawful.\n\nMuneri bought the property in 2017 through Rawson Properties, later formalising the deal directly with Delatfin Civil Engineering, represented by Munyaradzi. He paid all fees, including a US$650 regularisation charge to Zvimba Rural District Council, and had been living at the property since 2017.\n\nBut in December 2024, Muneri was shocked to see a public notice threatening repossession unless he paid for the land again, this time at US$55 per square metre.\n\nDelatfin argued it had never received the original purchase price, claiming the money was misappropriated by rogue employees, including convicted fraudster Saymore Mutakura.\n\nMuneri insisted he had done his due diligence and dealt directly with Munyaradzi, who personally signed off on the agreements. He accused the company of trying to extort him, telling the court: The alleged fraud was an internal matter to be resolved between the first respondent and its employee. I cannot be made to pay for the property twice.\n\nJustice Musithu rejected Delatfins defence, noting that Munyaradzi had signed the agreements himself and never moved to invalidate them.\n\nMerely denying their legality in an opposing affidavit did not have the desired effect of nullifying them, the judge said. The first respondents arguments were ill-conceived for as long as no attempt was made to have the agreements declared null and void.\n\nThe court found Muneri had demonstrated a direct and substantial interest in the property, and that his rights were under threat from what it described as unlawful attempts to repossess.\n\nThe High Court ordered Zvimba Rural District Council to officially register Muneri as the lawful rights holder, and directed Delatfin to pay his legal costs.\n\nThe ruling is the latest twist in Zimbabwes long-running land disputes involving private developers and residents who often face double allocations, fraudulent sales, or threats of repossession years after purchase.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ruled in favour of Harare resident Cephas Tapiwa Muneri, declaring him the rightful holder of rights and interests in a contested Haydon Park stand, after a protracted legal battle with Delatfin Civil Engineering and controversial land developer Felix Munyaradzi. In a judgment delivered on September 8, Justice Siyabona</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/developer-felix-munyaradzi-loses-legal-battle-in-sandton-property-dispute/\">Developer Felix Munyaradzi loses legal battle in Sandton property dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "24 Sep 2025"
        },
        {
            "title": "Munetsi on target as Wolves beat Everton in Carabao Cup",
            "url": "https://www.newzimbabwe.com/munetsi-on-target-as-wolves-beat-everton-in-carabao-cup/",
            "content": "By Sports Reporter\n\nWarriors vice-captain Marshall Munetsi was on target for Wolverhampton Wanderers in their 2-0 Carabao Cup victory over Everton on Tuesday night.\n\nMunetsi broke the deadlock in the 28th minute, pouncing on a rebound to hand Wolves a 1-0 halftime lead. His effort was later complemented by Tolu Akodares 87th-minute strike, which sealed the win.\n\nThe goal was Munetsis first of the season and his third since joining Wolves in January. The midfielder has become a key figure at Molineux, particularly following the departure of last seasons star man, Matheus Cunha, to Manchester United.\n\nDespite the cup success, Wolves have endured one of their worst starts in Premier League history, losing all five of their opening league matches. They now turn their attention to a tough weekend fixture away to Tottenham in London.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24044639/marshall-munetsi-celebrates-carabao-cup-goal-for-wolves-e1758659846671-1.jpg",
            "description": "<p>By Sports Reporter Warriors vice-captain Marshall Munetsi was on target for Wolverhampton Wanderers in their 2-0 Carabao Cup victory over Everton on Tuesday night. Munetsi broke the deadlock in the 28th minute, pouncing on a rebound to hand Wolves a 1-0 halftime lead. His effort was later complemented by Tolu Akodare’s 87th-minute strike, which sealed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/munetsi-on-target-as-wolves-beat-everton-in-carabao-cup/\">Munetsi on target as Wolves beat Everton in Carabao Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "24 Sep 2025"
        },
        {
            "title": "Bank staffer, security guard steal US$58,000 from National Building Society",
            "url": "https://www.newzimbabwe.com/bank-staffer-security-guard-steal-us58000-from-national-building-society/",
            "content": "By Staff Reporter\n\nA BANK teller and a security guard have appeared at the Harare Magistrates Court facing charges of stealing US$58,417 from the National Building Society (NBS).\n\nThe duo of Smith Mativenga Chigwagwa (45), who is employed by the bank as a cash deposit teller, allegedly connived to commit theft with Stalin Rundora (30), who is employed by Atharvan Investments (Pvt) Limited as a security guard responsible for collecting cash.\n\nCourt heard that between September 5 and 10, 2025, the two, in pursuance of their plan, withdrew cash amounting to US$58,417 from Atharvan Investments NBS account and converted part of it to their personal use.\n\nIt was further heard that an alert security manager at the bank, identified as Michael Smoko, observed anomalies in the transaction and checked with the company, which confirmed it had not received any cash.\n\nThe matter was then reported to police and on September 21, 2025, detectives from the Criminal Investigations Department (CID) Commercial Crimes Division in Harare conducted a probe, which prompted Chigwagwa to surrender US$51,420 to the bank.\n\nThe accused persons were subsequently arrested and of the stolen cash, US$6,997 was not recovered.\n\nAccused persons were remanded in custody until October 23, 2025 for trial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24050559/nbs_bank.jpg",
            "description": "<p>By Staff Reporter A BANK teller and a security guard have appeared at the Harare Magistrates Court facing charges of stealing US$58,417 from the National Building Society (NBS). The duo of Smith Mativenga Chigwagwa (45), who is employed by the bank as a cash deposit teller, allegedly connived to commit theft with Stalin Rundora (30),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bank-staffer-security-guard-steal-us58000-from-national-building-society/\">Bank staffer, security guard steal US$58,000 from National Building Society </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "24 Sep 2025"
        }
    ]
}