{
    "news": [
        {
            "title": "CCC MP Chidziva acquitted of rape",
            "url": "https://www.newzimbabwe.com/ccc-mp-chidziva-acquitted-of-rape/",
            "content": "By Staff Reporter\n\nOpposition lawmaker for Glenview South, Happymore Chidziva who was accused of raping his wifes 16 year old relative has been acquitted.\n\nChidziva, also known as Bvondo, was accused of sexually abusing the minor on three occasions, twice at a local hotel and at a lodge in Waterfalls.\n\nProsecutors alleged that the legislator sweet-talked the girl into believing that he would secure employment for her before raping her.\n\nAt one time, heallegedly told the girl that he would secure employment for her abroad and change her life.\n\nHowever, Harare Magistrate Letwin Rwodzi cleared Chidziva of wrongdoing after a full trial, ruling that the prosecution failed to prove its case.\n\nThe magistrate also said the state failed to prove that Chidziva ever tried to secure employment for the minor.\n\nThe NPA was alleging that sometime in April 2024, Chidziva called the complainant and asked her to meet at Zanu PF Headquarters traffic lights, where he picked her up.\n\nIt was alleged that the MP told the girl that his car had broken down and drove her to a hotel in Harare CBD, where he asked her for sex.\n\nThe girl allegedly refused and told Chidziva that she was not ready.\n\nThe state alleged that Chidziva however took the girl to a room where he raped her without protection before giving her US$25.\n\nThe prosecution said after the alleged rape, the MP hired a taxi before he disembarked at a service station along Willowvale Road while the complainant proceeded to Glen View.\n\nThe following morning the accused person sent a message instructing her to buy some morning-after pills with the money he gave her, and her cousin was holding her phone and she saw the message, the MPs trial was told.\n\nThe complainant then told her cousin that she slept with the accused person and he was telling her to buy morning-after pills.\n\nIt was alleged that sometime in July 2024, the complainant told her aunt that Chidziva had found a job for her in Marimba as a domestic worker.\n\nOn that same day, it was alleged that Chidziva took the girl to a guesthouse in Waterfalls where he raped heragain.\n\nAfter the abuse, the teen did not return home but went to stay in Ushewokunze with her friend and her parents.\n\nIt was further alleged that on August 9, 2024, around 5PM, the MP called the teenager whilst she was in town and asked her to meet him at Cresta Lodge in Masasa.\n\nThe complainant then hired a taxi to Cresta Lodge, where she met the accused person. They then went into a room and the accused person then went out and returned at around midnight.\n\nThe accused person asked her to have sexual intercourse with him, and she refused and told him that she was tired.\n\nProsecutors alleged Chidziva then pleaded with the teen, promising her a job outside Zimbabwe and she complied.\n\nThe 16-year-old then returned to Ushewokunze, where she was chased away by her friends mother because she had not slept at home the previous night.\n\nThe court heard that she then went and stayed with her cousin in Budiriro 1, but her aunt had already filed a missing persons report at Budiriro Police Station.\n\nShe later presented herself to the police, where she narrated her ordeal leading to Chidzivas arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/31061449/Happymore-Bvondo-Chidziva.webp",
            "description": "<p>By Staff Reporter Opposition lawmaker for Glenview South, Happymore Chidziva who was accused of raping his wife’s 16 year old relative has been acquitted. Chidziva, also known as Bvondo, was accused of sexually abusing the minor on three occasions, twice at a local hotel and at a lodge in Waterfalls. Prosecutors alleged that the legislator</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-mp-chidziva-acquitted-of-rape/\">CCC MP Chidziva acquitted of rape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "‘Skeem Saam’ stars Tiisetso Thoka and Mogau Keebine discuss the impact of their affair storyline",
            "url": "https://www.newzimbabwe.com/skeem-saam-stars-tiisetso-thoka-and-mogau-keebine-discuss-the-impact-of-their-affair-storyline/",
            "content": "IOL\n\nSkeem Saam knows how to grip viewers with a storyline and the latest revolving around the adulterous affair of DJ Thomas and Mapitsi Maputla has been no different.\n\nThe pair, both radio presenters at Berry FM, have been entangled in an illicit relationship. The twist? Mapitsi is a married woman and her husband, Tbose, has no idea whats been going on behind the scenes.\n\nThat is, until the affair was accidentally exposed, live on air, thanks to Kamos meddling.\n\nIn an interview with IOL Entertainment, the actors behind the characters Tiisetso Thoka andMogau Keebine, shared that when they first read the script of how their characters secret would be exposed, had quite a reaction.\n\nI immediately had goosebumps thinking of the aftermath, said Thoka.\n\nIt meant the whole of Turf would know about the affair and the chances of Thomas losing his radio gig were high.\n\nKeebine was just as shocked and worried about how the characters would recover from such a huge blow, being exposed on the whole community radio station.\n\nIt was a very exciting time to be reading the script I was shocked and I was also very proud of how the writers just didnt go the conventional route of, you know, them being caught in the act, they exposed themselves, said Keebine.\n\nThe storyline was a challenge for both actors and they both prepared for it by reading up on scenarios on how people felt or reacted when they were caught cheating or when they caught their partner cheating.\n\nFor Keebine, who is married in real life, the storyline brought personal challenges. She had to prepare her family ahead of the episodes, reassuring them that it was all just a role. She also admitted she disagreed with her characters actions.\n\nI had to put my feelings about what Mapitsi and Thomas were doing aside and play the role of a broken-hearted, lonely, married woman with two kids who was finding affection from someone else.\n\nThe radio station setting added an element of pressure on the characters they had to act professionally when on air, even on days they were not getting along off-air. Eventually it put so much pressure on the affair because of our fights, said Thoka.\n\nMapitsi is already dealing with the pressures of her personal life. When herhusband Tbosecame back from overseas, it wasnt all smooth sailing, he didnt find her attractive, her wardrobe choices.\n\nHe was kind of almost borderline agreeing with the listenership of the radio station, and you put that together with having just been pregnant and having had a baby, explains Keebine.\n\nTheres insecurities about weight and physical appearance, and theres obviously like a disconnect between Mapitsi and Tbose an emotional disconnect between them at the time.\n\nI guess, you know, Thomas came in at a time when Mapitsi was very emotionally vulnerable and feeling lonely in her relationship.\n\nThe radio stations audiences emphasise on appearance after having a baby was an added pressure.\n\nI think the main pressure came from what was happening in her personal life because I think if Mapitsi had felt more reassured and more connected to Tbose as her husband, things probably wouldnt have gotten to where they did, said Keebine.\n\nAudiences have been loving the storyline, many have been waiting for the day DJ Thomas and Mapitsi get caught.\n\nOn Facebook, posts about the storyline have been flooded with comments, and on the week of the big expose May 12  16, the median rating pull was around 3.7 million viewers and Fridays fiery episode pulled around 4.3 million.\n\nThoka reveals that the real-life audience reactions have been crazy. Its funny how most people take this seriously and think its real life. More than 50 people have approached him and told him how disgusted they are by what he is doing with Mapitsi.\n\nIm used to handling such situations because its not the first time it has happened. Mostly, I avoid going out in the public, he said.\n\nThrough social media, Keebine got mixed reactions to Mapitsi cheating, from women understanding where the character was coming from and disappointment from men, who were hurt by their respectable Makotis change of ways.\n\nThere was a huge group of other women who were like, we cannot wait to see Mapitsis downfall when all of this is revealed, because I am not representing women well.\n\nI liked that as much as, you know, its not nice to hear about the character that youre playing, but I like that women are standing up for their character as women and saying that, no, we are not like this. This is a bad representation of most of us, even though it is what happens.\n\nThe adulterous storyline is not without lessons, Keebine says it reminds us that it will always end in tears.\n\nBe careful, tread lightly, and also be aware of your emotional state, so that you dont fall into the trap of unintentionally catching feelings for someone who youre not supposed to be looking at in that kind of way, from Mapitsis perspective, said Keebine.\n\nYou cant expect a person to be the way you envision them to be according to your expectations. Human beings have feelings and make mistakes too, adds Thoka. But it also tells us about the results of those mistakes. How your decisions can alter your life so drastically.\n\nAs the scandal continues to unfold, viewers remain glued to their screens, wondering: Will Mapitsi andTbosereconcile? Will DJ Thomas still go through with paying Lobola for his girlfriend? And will the listeners of Berry FM and the people of Turfloop, ever forget what happened live on air?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21053234/Screenshot-2025-05-21-at-06.31.56.png",
            "description": "<p>IOL “Skeem Saam” knows how to grip viewers with a storyline and the latest revolving around the adulterous affair of DJ Thomas and Mapitsi Maputla has been no different. The pair, both radio presenters at Berry FM, have been entangled in an illicit relationship. The twist? Mapitsi is a married woman and her husband, T’bose,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/skeem-saam-stars-tiisetso-thoka-and-mogau-keebine-discuss-the-impact-of-their-affair-storyline/\">‘Skeem Saam’ stars Tiisetso Thoka and Mogau Keebine discuss the impact of their affair storyline</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe",
            "url": "https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/",
            "content": "IOL\n\nA 31-year-old man has appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted another stolenToyota Corolla Crosssport utility vehicle which was apparently being driven towards the Beitbridge port of entry.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody, and the court postponed the matter to Monday next week.\n\nMashaba said the matter was postponed for profiling of the arrested man. Police have since established that Mlambo is a South African national.\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen earlier this month, around Pretoria Central.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nOn Friday, 16 May 2025, members of provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\nThe police immediately commenced an intensive search for the stolen vehicle until it was positively spotted driving outside Polokwane.\n\nPolice officers attempted to stop the speeding vehicle, but the driver refused to yield.\n\nA car chase ensued until the vehicle was intercepted at Nirvana robots. It was searched and police suddenly discovered a damaged tracking device removed from the vehicle, said Mashaba.\n\nThe 31-year-old man driving the stolen vehicle could not produce authentic documentation proving ownership, and he was immediately placed under arrest.\n\nThe arrested driver was charged for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has saluted the law enforcement team which intercepted and recovered the vehicle.\n\nShe urged the team to continue in their concerted efforts to combat cross border crimes.\n\nEarlier on Tuesday,IOL reported that police in Limpopo announced a significant breakthrough with the recovery of two vehicles, a Toyota Corolla Cross and a Toyota Hilux GD-6valued at approximately R1.4 million, which were destined to be smuggled out of South Africa.\n\nMashaba said the two vehicles were meant to be driven across the Beitbridge port of entry, into the neighbouring Zimbabwe on Sunday.\n\nIn a co-ordinated anti-smuggling operation involving SAPS Anti-Smuggling Team, Tshimollo Security and Investigation, and Reflex Anti-Hijacking Security, the officers intercepted a Toyota Hilux GD-6 double cab on the R101 near Polokwane weighbridge. During the stop, one male suspect fled into nearby bushes, while two female suspects attempted to escape but were apprehended after a foot chase, said Mashaba.\n\nThe women aged 19 and 20 were arrested, and are facing charges of possession of a suspected stolen motor vehicle.\n\nA man escaped on foot, evading arrest while two women aged 19 and 20 were arrested for possession of a Toyota Hilux GD-6 double cab bakkie. Image: SAPS\n\nPreliminary investigations confirmed that the vehicle was stolen on 16 May 2025 in the Garsfontein policing area in Pretoria East, Gauteng.\n\nIn a separate but related intelligence-driven operation, Mashaba said officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101 road, which was also en route to the Beitbridge port of entry.\n\nInvestigations revealed that this vehicle had been reported stolen at the Wierdabrug (City of Tshwane) policing area on Friday. The driver, a 34-year-old undocumented foreign national, was arrested, said Mashaba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21052738/Screenshot-2025-05-21-at-06.26.54.png",
            "description": "<p>IOL A 31-year-old man has appeared before the Polokwane Magistrate’s Court in Limpopo after he was arrested when police intercepted another stolen Toyota Corolla Cross sport utility vehicle which was apparently being driven towards the Beitbridge port of entry. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/\">More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "Zimbabwe in another deal with China to revamp dilapidated Parirenyatwa hospital",
            "url": "https://www.newzimbabwe.com/zimbabwe-in-another-deal-with-china-to-revamp-dilapidated-parirenyatwa-hospital/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has signed a Memorandum of Understanding (MoU) with China aimed at strengthening cooperation in health, specifically in respiratory and critical care medicine.\n\nThe MoU establishes a partnership between Zimbabwes ailing Parirenyatwa Group of Hospitals and Chinas Hunan Provincial Peoples Hospital.\n\nThis comes barely a week after Zimbabwe signed another MoU with Belarus to refurbish Parirenyatwa, which has been failing to cater for its patients owing to a shortage of basic medical supplies.\n\nIn return, Belarus gets an opportunity to extract vast mineral reserves in Zimbabwe.\n\nAddressing the media during a post-cabinet briefing, Information Minister Jenfan Muswere said the agreement seeks to boost Zimbabwes capacity in the prevention, diagnosis, and treatment of COVID-19 and enhance critical care services.\n\nUnder the Legislative Programme, cabinet considered and approved the Memorandum of Understanding between the Republic of Zimbabwe and the Peoples Republic of China on the Paired Hospital Cooperation Mechanism.\n\nThe Memorandum of Understanding seeks to promote cooperation in the fields of health.\n\nMore specifically, the MoU will establish a cooperativerelationship between the Parirenyatwa Group of Hospitals and the HumanProvincial Peoples Hospital of the Peoples Republic of China in the field ofrespiratory and critical care medicine.\n\nThe objective is to strengthenconstruction of respiratory and critical care medicine facilities in Zimbabweand improve local capacity on prevention, control, diagnosis and treatmentof COVID-19 as well as airway management and respiratory support forcritical patients, Muswere said.\n\nMost general hospitals in Zimbabwe are failing to meet the needs of patients, as they lack basic medical supplies, forcing patients to purchase their own.\n\nIn addition to this, the hospitals suffer from dilapidated infrastructure, while their workers receive poor remuneration, which has led to a massive brain drain and low staff morale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/30041701/Parirenyatwa-Hospital.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has signed a Memorandum of Understanding (MoU) with China aimed at strengthening cooperation in health, specifically in respiratory and critical care medicine. The MoU establishes a partnership between Zimbabwe’s ailing Parirenyatwa Group of Hospitals and China’s Hunan Provincial People’s Hospital. This comes barely a week after Zimbabwe signed another MoU with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-in-another-deal-with-china-to-revamp-dilapidated-parirenyatwa-hospital/\">Zimbabwe in another deal with China to revamp dilapidated Parirenyatwa hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "Parliament: Private sector practising modern slavery, hiring interns for cheap labour",
            "url": "https://www.newzimbabwe.com/parliament-private-sector-practising-modern-slavery-hiring-interns-for-cheap-labour/",
            "content": "By Anna Chibamu\n\nTHE private sector has been accused of practising modern slavery, with companies employing mostly interns and underpaying them to save on costs.\n\nMarondera Central MP Caston Matewu raised this issue on a point of national interest in Parliament this Tuesday, describing the situation as new day modern slavery.\n\nMatewu told Speaker Jacob Mudenda that the private sector, particularly in the hospitality and tourism industry, was not rewarding interns.\n\nThe legislator alleged that most private companies have interns constituting 70% of their staff, and this is done to cut costs.\n\nMy point of national interest arises from the new day modern slavery, which is happening in the private sector.\n\nYou find that especially in the hospitality and tourism industry, most of the institutions are employing at least 70% interns who are not paid.\n\nSome who are given less than US$50 but have to work 12-hour shifts, and most of these institutions are doing this to save costs, Matewu said.\n\nNow that has two impacts, this means that those in such industries and qualified do not have jobs and that brings our unemployment rate high.\n\nIt is also slavery to those who are being made to work on the basis that they are being trained, yet they are actually covering for the profits of these institutions.\n\nMatewu called upon Parliament to come up with laws that help deal with the challenge.\n\nI think this August House must come up with policies and solutions to ensure that we curb this scourge that is going on in the private sector, Matewu told the Speaker.\n\nIn his response, Mudenda urged the MP to bring the matter as a motion to allow the responsible ministry to come up with answers and solutions.\n\nWhy do you not come up with a motion to address the issue in detail so that it covers the responsible ministry to respond accordingly? Mudenda said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21043603/Caston-Matewu.webp",
            "description": "<p>By Anna Chibamu THE private sector has been accused of practising “modern slavery”, with companies employing mostly interns and underpaying them to save on costs. Marondera Central MP Caston Matewu raised this issue on a point of national interest in Parliament this Tuesday, describing the situation as “new day modern slavery”. Matewu told Speaker Jacob</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-private-sector-practising-modern-slavery-hiring-interns-for-cheap-labour/\">Parliament: Private sector practising modern slavery, hiring interns for cheap labour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "Zimbabwe ready to cause an upset in historical Test match against England",
            "url": "https://www.newzimbabwe.com/zimbabwe-ready-to-cause-an-upset-in-historical-test-match-against-england/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens cricket team will on Thursday kick off their historical once-off Test match against England at Trent Bridge in Nottingham.\n\nThe match marks Zimbabwes first test against England since 2003.\n\nZimbabwe is yet to win a test match against England, as it has lost all six matches they have played in history.\n\nDespite the odds stacked against his side, Chevrons coach Justin Sammons on Tuesday evening told the media that they are capable of winning the match.\n\nWe know we are playing one of the best teams in the world, and our skills are going to be challenged.\n\nBut certainly if we bring our best, I feel we can compete and then, you know, anything can happen.\n\nWe all know the game of cricket. So we back ourselves 100% and we look forward to the challenge because thats what it is and thats test cricket.\n\nSo we always have that belief within us. And we know were capable of an upset, but we also know to do that, weve got to be at our very best, said Sammons.\n\nZimbabwe walks into Thursdays match coming from a one-all draw against Bangladesh in a two-match series played last month.\n\nWe have come off quite a bit of test cricket, obviously just being in Bangladesh.\n\nYou know, there were back-to-back tests there, and it was a quick turnaround.\n\nSo I think the preparations been really good, we cant complain about that.\n\nI think the guys are ready, they have sort of acclimatised, added Sammons.\n\nThe Chevrons arrived in England last week and had more than a week of preparations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21051044/justin-sammons.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s cricket team will on Thursday kick off their historical once-off Test match against England at Trent Bridge in Nottingham. The match marks Zimbabwe’s first test against England since 2003. Zimbabwe is yet to win a test match against England, as it has lost all six matches they have played</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ready-to-cause-an-upset-in-historical-test-match-against-england/\">Zimbabwe ready to cause an upset in historical Test match against England</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "Chikafa bounces back at CAPS United as team manager",
            "url": "https://www.newzimbabwe.com/chikafa-bounces-back-at-caps-united-as-team-manager/",
            "content": "By Sports Reporter\n\nCAPS United has appointed Limited Chikafa as the new team manager.\n\nChikafas appointment marks his return to the club, which he previously served as a player.\n\nThe CAPS United legend played for the famous 2004 and 2005 back-to-back championship-winning side, which was led by Charles Mhlauri.\n\nHis latest appointment marks his reunion with new gaffer Ian Bakala, whom he played with back then at CAPS United.\n\nChikafa joins CAPS United from financially struggling Kwekwe United, which is currently stuck at the bottom of the log.\n\nThe new development is part of CAPS United club president Farai Jeres mission to return all former players as technical team members.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21051041/chikafa-caps.jpeg",
            "description": "<p>By Sports Reporter CAPS United has appointed Limited Chikafa as the new team manager. Chikafa’s appointment marks his return to the club, which he previously served as a player. The CAPS United legend played for the famous 2004 and 2005 back-to-back championship-winning side, which was led by Charles Mhlauri. His latest appointment marks his reunion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chikafa-bounces-back-at-caps-united-as-team-manager/\">Chikafa bounces back at CAPS United as team manager</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "Rights lawyers petition High Court over “vague, badly drafted” PVO Act",
            "url": "https://www.newzimbabwe.com/rights-lawyers-petition-high-court-over-vague-badly-drafted-pvo-act/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR) has filed an application at the High Court seeking an order to declare some repressive provisions of the Private Voluntary Organisations (PVO) Amendment Act as unconstitutional and set them aside.\n\nThe ZLHR said some of the provisions criminalise legitimate critical development and human rights work and over-regulate PVOs.\n\nThe PVO Amendment Act, which was enacted and published in the Government Gazette on 11 April 2025, according to the application, constitutes a fundamental encroachment of rights of members of their organisation, which is an independent universitas established by law.\n\nZLHR opines that the impugned amendments contained in the PVO Amendment Act constitute unconstitutional over-regulation, over-legislation and criminalisation of innocent important charitable, developmental and human rights work.\n\nThe provisions of the PVO Amendment Act, ZLHR argues, overreach by violating the freedom of assembly and association guaranteed under section 58(1) of the Constitution, the freedom of expression under section 61 of the Constitution, the right to administrative justice guaranteed under section 68(1) and (2) of the Constitution, the right to a fair hearing under section 69(1), (2) and (3) of the Constitution and section 71 of the Constitution, which provides for property rights. ZLHR further argues that the impugned provisions of the PVO Amendment Act were vague and badly drafted and contained arbitrary powers and over-regulation of PVOs, said ZLHR.\n\nZLHR also said the PVO Amendment Act has the effect of concentrating arbitrary powers in the Minister of Public Service, Labour and Social Welfare and the Registrars office and contains excessive executive interference in the internal affairs of PVOs.\n\nIt said the impugned provisions of the PVO Amendment Act have the net effect of effectively allowing the Executive to run PVOs and to deregister those that authorities dislike on very nebulous grounds.\n\nTo this end ZLHR is seeking a High Court order of constitutional invalidity, declaring section 4, section 5 as read with section 9(5), section 6, section 13A, section 14, and section 21, of the Private Voluntary Organisations Act (as amended by the PVO Amendment Act) to be ultra vires the Constitution and to be set aside.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/21073523/pvo.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Lawyers for Human Rights (ZLHR) has filed an application at the High Court seeking an order to declare some “repressive” provisions of the Private Voluntary Organisations (PVO) Amendment Act as unconstitutional and set them aside. The ZLHR said some of the provisions criminalise legitimate critical development and human rights work</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-lawyers-petition-high-court-over-vague-badly-drafted-pvo-act/\">Rights lawyers petition High Court over “vague, badly drafted” PVO Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        },
        {
            "title": "Makate High Flyers leaves for COSANA tournament",
            "url": "https://www.newzimbabwe.com/makate-high-flyers-leaves-for-cosana-tournament/",
            "content": "By Sports Reporter\n\nMurehwa-based Makate High Flyers on Monday left the country for Namibia, where they will represent Zimbabwe at the Confederation of Southern Africa Netball Association (COSANA) tournament, which kicks off, Thursday.\n\nMakate will be representing the country together with defending Premier Netball League champions ZDF Queens.\n\nThe inaugural regional netball club tournament will run for five days with clubs from Zimbabwe, Botswana, Lesotho, Eswatini and the host nation, Namibia.\n\nMakate were drawn in group A with Namibia Correctional Services and Wanderers Queens, Lesothos Royal Flames, Mauneng Queens and Jwaneng Queens from Botswana.\n\nZDF Queens will be battling in group B with Botswana Defence Force team, Lesotho Correctional Services, the Navy Army team and Mighty Gunners from Namibia.\n\nSpeaking ahead of their departure, Makate High Flyers captain Felistus Murigwa said the team is targeting to attain a good position.\n\nWe are looking forward to this tournament, we believe we are ready to showcase our talent.\n\nOur target is very simple, we want to bring back home a medal, so one way or the other we have to attain a podium finish, she said.\n\nMakate High Flyers is marking its debut in the Premier Netball League after gaining promotion from the Division One League last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21051047/makate.jpeg",
            "description": "<p>By Sports Reporter Murehwa-based Makate High Flyers on Monday left the country for Namibia, where they will represent Zimbabwe at the Confederation of Southern Africa Netball Association (COSANA) tournament, which kicks off, Thursday. Makate will be representing the country together with defending Premier Netball League champions ZDF Queens. The inaugural regional netball club tournament will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/makate-high-flyers-leaves-for-cosana-tournament/\">Makate High Flyers leaves for COSANA tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "21 May 2025"
        }
    ]
}