{
    "news": [
        {
            "title": "‘It was just a joke’: Zimbabwean TikTok sensation Ndoyisile Sibindi apologises after Mall of Africa rant backlash",
            "url": "https://www.newzimbabwe.com/it-was-just-a-joke-zimbabwean-tiktok-sensation-ndoyisile-sibindi-apologises-after-mall-of-africa-rant-backlash/",
            "content": "The Citizen\n\nContent creator Ndoyisile Sibindi faced backlash after a video of him ranting about overcrowding at the Mall of Africa went viral on social media.\n\nThe TikTok sensation, originally from Zimbabwe, has since apologised for his remarks, saying he did not mean to offend anyone.\n\nIn the video, Ndoyisile expressed his frustrations about people from Tembisa overcrowding the Mall of Africa.\n\nYou want to tell me that you guys leave your mall in Tembisa, if there is a mall in Tembisa, to come and overcrowd Mall of Africa?\n\nPeople are just gallivanting and occupying the mall for no reason. Its so uncomfortable for us who are claustrophobic.\n\nNdoyisiles remarks ruffled many feathers on social media, with some netizens even suggesting that he should be deported if he is in South Africa illegally.\n\nNdoyisile released another video apologising, adding that his initial video was intended to be humorous.\n\nThis video is mainly to apologise to people from Tembisa who got offended by the video that is currently circulating. First things first, Im sorry if I offended you, it was not my intention, it was just a joke.\n\nThat video was pre-recorded from my YouTube channel, from a vlog that I posted two weeks ago, he said in a now-deleted apology video.\n\nThe content creator said he recorded the video to let his followers know why he could not vlog at the mall as planned, explaining that it was due to overcrowding.\n\nHe also acknowledged the importance of respecting privacy laws, specifically the POPI Act, which prohibits recording individuals without their consent.\n\nThose words did not come from a place of being classist or suggesting that people shouldnt go to the mall. Its a mall, after all, people are bound to go there.\n\nIf you follow my content, you know that its often filled with dry humour and sarcasm, which my audience enjoys. If people didnt like my content, I wouldnt be nearing a million followers.\n\nNdoyisile also addressed questions about his nationality and the legitimacy of his documents.\n\nIve never been ashamed of where I come from. I was born and raised in Havana township in Zimbabwe. Im proud of my roots, and Im not hiding anything.\n\nShowing his passport, he added: I dont understand the narrative that people are trying to push on social media, and this is my passport with my last travel, which was to Swaziland. When talking about documentation, we are not talking about a bunch of papers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13151124/Ndoyisile-mall-of-africa-apology.jpg",
            "description": "<p>The Citizen Content creator Ndoyisile Sibindi faced backlash after a video of him ranting about overcrowding at the Mall of Africa went viral on social media. The TikTok sensation, originally from Zimbabwe, has since apologised for his remarks, saying he did not mean to offend anyone. In the video, Ndoyisile expressed his frustrations about people</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-was-just-a-joke-zimbabwean-tiktok-sensation-ndoyisile-sibindi-apologises-after-mall-of-africa-rant-backlash/\">‘It was just a joke’: Zimbabwean TikTok sensation Ndoyisile Sibindi apologises after Mall of Africa rant backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "Diaspora Marriages  –  Can Counselling Keep Couples Connected?",
            "url": "https://www.newzimbabwe.com/diaspora-marriages-can-counselling-keep-couples-connected/",
            "content": "Zimbabwe has long been shaped by migration. Many families are split between those who remain at home and those who seek better opportunities abroad. These separations often lead to long-distance marriages that face unique challenges. While remittances can ease financial burdens, the emotional cost of separation is more challenging to address.\n\nDiaspora marriages often struggle with trust, communication, and maintaining emotional intimacy. Partners in different countries experience life differently, leading to a growing gap in shared experiences. For some, cultural adjustments in new countries create conflicts as values shift, often without the other partners knowledge. Time zone differences, work pressures, and the lack of physical presence compound these issues, leaving both partners isolated.\n\nInfidelity, mistrust, and financial disagreements are common problems. One partner may suspect the other of infidelity or feel neglected due to reduced communication. On the other hand, the partner abroad may feel unappreciated despite their efforts to support the family financially. These tensions can cause resentment, making the relationship increasingly fragile.\n\nHow Marriage Counselling Can Help\n\nIncreasingly, especially in our online world, marriage counselling, offers a solution for couples facing these challenges. It provides a neutral platform where both partners can express their concerns without fear of judgment. Counsellors help couples rebuild trust and develop strategies for managing long-distance relationships. They focus on improving communication and helping partners understand each others needs and expectations.\n\nOnline counselling has become particularly relevant for diaspora marriages. Virtual sessions offer flexibility, allowing couples in different time zones to participate without disrupting their schedules. Platforms likeTherapyRoutethat connect individuals with trained professionals experienced in diaspora marriage issues make this more accessible.\n\nLocal support is also available. Organizations such as theChristian Counselling Centre in Harareprovide faith-based guidance that aligns with cultural and religious values.\n\nPractical Steps for Strengthening Diaspora Marriages\n\nAddressing the challenges of a long-distance marriage starts with honest communication.\n\nPartners must commit to regular check-ins, whether through video calls, voice notes, or written messages. Setting aside time to connect emotionallyeven with tight scheduleshelps keep the relationship alive.\n\nTrust is often key to successful long-distance relationships. Counsellors guide couples in rebuilding trust by addressing underlying insecurities and agreeing on boundaries. This process might include setting expectations around finances, social interactions, or how decisions are made while apart. Clear agreements reduce misunderstandings and help both partners feel secure.\n\nAnother critical aspect is maintaining a shared vision for the future. Partners should discuss their long-term goals: Will the family reunite? What sacrifices are necessary to achieve financial or career objectives? Counsellors often encourage couples to keep these conversations ongoing, ensuring both feel involved in shaping their future.\n\nWhile counselling sessions are key, couples must also take practical steps outside therapy. Shared rituals, such as watching the same movie from different locations or praying together over the phone, can foster emotional closeness. Sending thoughtful messages or small gifts can remind a partner they are valued and appreciated.\n\nA Final Word on Diaspora Marriages\n\nDiaspora marriages are a testament to resilience and sacrifice. They endure long distances, cultural adjustments, and financial pressures, all in pursuit of better opportunities. But these challenges can strain even the strongest relationships.\n\nMarriage counselling, when approached with an open mind, equips couples with the tools to communicate better, resolve conflicts, and maintain emotional intimacy. The journey is not easy, but with effort, patience, and the right support, it can lead to stronger, more fulfilling relationships.\n\nIf you or someone you know is navigating the complexities of a diaspora marriage, take that first step and reach out to trusted community leaders or professionals, and commit to investing in the future of your partnership.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/05001007/Marriage.png",
            "description": "<p>Zimbabwe has long been shaped by migration. Many families are split between those who remain at home and those who seek better opportunities abroad. These separations often lead to long-distance marriages that face unique challenges. While remittances can ease financial burdens, the emotional cost of separation is more challenging to address. Diaspora marriages often struggle</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-marriages-can-counselling-keep-couples-connected/\">Diaspora Marriages  –  Can Counselling Keep Couples Connected?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "In Pictures: South African police thwart major smuggling operation along Limpopo river, seizing goods worth R500,000",
            "url": "https://www.newzimbabwe.com/in-pictures-south-african-police-thwart-major-smuggling-operation-along-limpopo-river-seizing-goods-worth-r500000/",
            "content": "IOL\n\nA gangs attempt to smuggle goods into South Africa hit a major snag after the South African Police Service (SAPS) thwarted their operations and seized their goods.\n\nPolice said the confiscated items, which were likely being smuggled across the border, include alcoholic beverages, energy drinks, baked goods, flour, and other consumer goods, along with a chest fridge.\n\nLimpopo police spokesperson, Lieutenant Colonel Stephen Thakeng, said the items were confiscated along the Limpopo River, in the Musina policing area in Saturday morning.\n\nAt around 11.20am, the SAPS Operations Vala Umgodi National Prevention team was conducting a routine patrol near the Tshirundu village when they received a tip-off about eight boats loading goods, Thakeng said.\n\nHe said when the gang saw police, they got back into the boats and fled back to Zimbabwe, abandoning their loot.\n\nThe teams efforts were hailed by provincial police commissioner, Lieutenant General Thembi Hadebe.\n\nWell done to the team for their swift and decisive action, noting that the success of the operation highlights the SAPSs ongoing commitment to combating cross-border crimes and illegal trade activities, Hadebe said.\n\nAll seized items have been registered at the Musina SAPS for further investigation and processing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13073421/The-South-African-Police-Service-Operation-Vala-Umgodi-National-Intervention-team-has-successfully-thwarted-a-major-smuggling-operation-along-the-Limpopo-River-in-Musina.webp",
            "description": "<p>IOL A gang’s attempt to smuggle goods into South Africa hit a major snag after the South African Police Service (SAPS) thwarted their operations and seized their goods. Police said the confiscated items, which were likely being smuggled across the border, include alcoholic beverages, energy drinks, baked goods, flour, and other consumer goods, along with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-south-african-police-thwart-major-smuggling-operation-along-limpopo-river-seizing-goods-worth-r500000/\">In Pictures: South African police thwart major smuggling operation along Limpopo river, seizing goods worth R500,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "Stilfontein: Five illegal miners deported to Zimbabwe after getting wholly suspended sentences",
            "url": "https://www.newzimbabwe.com/stilfontein-five-illegal-miners-deported-to-zimbabwe-after-getting-wholly-suspended-sentences/",
            "content": "IOL\n\nIllegal miners, who were arrested after being rescued from disused mines at Stilfontein, North West, have appeared before in court where they received wholly suspended sentences.\n\nThe second batch of illegal miners, colloquially known as zama zamas, appeared before the Stilfontein Magistrates Court on December 31 where they were sentenced for illicit mining and contravention of the Immigration Act.\n\nThe accused include 10 Lesotho nationals, four Mozambican and five Zimbabwean undocumented foreign nationals with ages between 20 and 43, said North West provincial police spokesperson, Brigadier Sabata Mokgwabone.\n\nThe court handed down six months imprisonment or R12,000 fine to each of the accused for illegal mining.\n\nThe sentences are wholly suspended for a period of five years on condition that the miners are not convicted again for illegal mining committed during the period of suspension.\n\nThe illegal miners were further sentenced to three months imprisonment or R6,000 fine which is wholly suspended for five years on condition that they are not convicted for contravention of South Africas Immigration Act.\n\nFollowing the sentences, the accused were on January 7, 2025, deported to their countries of origin by Department of Home Affairs. The accused were arrested at Margaret Shaft where they resurfaced in November 2024, said Mokgwabone.\n\nIn an update, Mokgwabone said five illegal miners have also resurfaced at Margaret Shaft on Tuesday morning.\n\nThis brings the total number of illegal miners arrested between August 18, 2024, and January 7, 2025, to 1,567, said Mokgwabone.\n\nMeanwhile, acting provincial commissioner of police in North West, Major General Patrick Asaneng has welcomed the conviction and subsequent deportation of the zama zamas.\n\nAsaneng reiterated that the ongoing operation Vala Umgodi will continue to ensure that those who commit crime are dealt with in accordance of the law.\n\nIn December,IOL reported that police said that more than 1,500 illegal miners had emergedfrom the Stilfontein mines, and majority of them had been deported to their home countries.\n\njonisayi.maromo@iol.co.za\n\nIOL\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13073016/Morweng-said-the-resurfacing-of-illegal-miners-is-a-police-operation-The-proposal-for-resurfacing-of-the-zama-zamas-is-broken-into-three-phases-Picture-Dumisani-Sibeko-Independent-Newspapers.webp",
            "description": "<p>IOL Illegal miners, who were arrested after being rescued from disused mines at Stilfontein, North West, have appeared before in court where they received wholly suspended sentences. The second batch of illegal miners, colloquially known as zama zamas, appeared before the Stilfontein Magistrate’s Court on December 31 where they were sentenced for illicit mining and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stilfontein-five-illegal-miners-deported-to-zimbabwe-after-getting-wholly-suspended-sentences/\">Stilfontein: Five illegal miners deported to Zimbabwe after getting wholly suspended sentences</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "Dynamos releases two Yadah FC players following expiry of loan contract",
            "url": "https://www.newzimbabwe.com/dynamos-releases-two-yadah-fc-players-following-expiry-of-loan-contract/",
            "content": "By Staff Reporter\n\nHARARE football giants, Dynamos have confirmed the departures of Issa Sadiki and Tanaka Shandirwa, who were on loan at the side.\n\nThe duo will return to their parent club Yadah FC owned by cleric Walter Magaya following the end of their loan stint at the Glamour Boys.\n\nDynamos confirmed the departures of the midfielder and winger in a recent statement.\n\nWe can confirm that midfielder Tanaka Shandirwa and winger Issah Sadiki have returned to their parent club Yadah FC after the end of their loan spell with the Glamour Boys.\n\nWe would like to wish Issah and Tanaka well in their future endeavours.\n\nShandirwas return to Yadah comes after he controversially signed a pre-contract with CAPS United at end of November.\n\nThe Green Machine were hoping to snap up the player on a free transfer at the start of 2025.\n\nHowever, the pre-contract was rubbished by Yadah who claimed that the player still has a running contract with them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13055843/IMG_20250112_132235.jpg",
            "description": "<p>By Staff Reporter HARARE football giants, Dynamos have confirmed the departures of Issa Sadiki and Tanaka Shandirwa, who were on loan at the side. The duo will return to their parent club Yadah FC owned by cleric Walter Magaya following the end of their loan stint at the Glamour Boys. Dynamos confirmed the departures of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-releases-two-yadah-fc-players-following-expiry-of-loan-contract/\">Dynamos releases two Yadah FC players following expiry of loan contract</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "Legal Discussions With Vengai Madzima: Foreign Visa Applications",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-foreign-visa-applications/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima and compliments of the new season, we want to continue our discussion on Immigration Law, specifically focusing on foreign Visa applications which we understand you can also assist people with. What are the common requirements in Visa applications to foreign destinations from Zimbabwe?\n\nVM: Compliments of the new season.\n\nGenerally, most preferred destinations for Zimbabweans that require visas before entry commonly require the applicants to possess a passport valid for at least 6 months beyond the intended stay. Applicants are naturally required to complete application forms which will list the varying requirements of the country of interest. These requirements commonly include passport-sized photos, proof of financial means, your bank statement or sponsorship letterset ceteraand invitation letters or hotel bookings for tourists.\n\nReporter: What are the common red flags for visa denial in Zimbabwe\n\nVM: The issue of red flags has to be analyzed in totality. Zimbabwe was and to an extent remains under sanctions as some members of its leadership are still under sanctions. I say this intentionally because our visa applications are looked at carefully as a result of this background.\n\nFurther, a lot of our citizens left Zimbabwe to seek greener pastures under different guises in their applications which has a bearing on current and future applications to visa-requiring countries.\n\nThis has to be balanced against the visa officers duty to protect his or her country against undesirables when considering your application.\n\nIt therefore behoves an applicant to be circumspect when drafting applications. You cannot have incomplete applications with missing information, documents or inconsistencies. Your proof of financial means should align with your intended purpose of visit, where it raises suspicion, such visas are generally denied.\n\nIt is important to understand that the visa application is considered as a whole, so your reason for the visit, previous immigration violations and the reasons for such violations, criminal records, inadequate travel insurance, suspicion of intent to overstay, inconsistent travel history and no ties to home country are all considerations which may raise red flags when considering an application.\n\nReporter:You mention criminal records as a potential red flag, is an arrest without conviction in such applications a criminal record and are ex-convicts able to get visa?\n\nVM: Normally the applications require applicants to only state convictions. However, where the application provides for issues to do with fingerprints having been recorded after arrest, then the production of a certificate of acquittal will be useful.\n\nAs regards ex-convicts, visas may still be granted depending on the nature of the conviction and the policies of the destination country.\n\nHowever, it is helpful for applicants to be comprehensive and transparent in disclosing their legal history.\n\nReporter: You also mentioned ties with the home country, how do you prove these ties?\n\nVM: For certain applications, especially tourist visas, you must be able to show and prove that you will be returning to Zimbabwe after the visit. With this in mind, you can include your current employment, professional or economic ties to Zimbabwe, family and social ties, property and financial ties, community and cultural ties and any other ties that you may consider to be relevant for the visa officer considering your application. I always say that being granted on first application is better than on appeal\n\nReporter: The dreaded word, appeal, what steps should I take when appealing a visa denial?\n\nVM: The first and critical step is to understand the reason for the denial.\n\nEmbassies normally provide a detailed written response outlining the grounds for the refusal. Having understood the grounds for denial, if the grounds are capable of remedy, then the appeal has to address the grounds, providing further evidence and explanations as to why the initial application failed to address the issues raised on denial properly.\n\nThis may include gathering and providing further documentation and proof to satisfy the visa officer from his or her previous misgivings.\n\nThe appeal will also have to be submitted within time and if there are prescribed rules on how the appeal should be submitted, those rules will have to be followed to the letter.\n\nAlternatively, it may be more practical to submit a new application instead of pursuing an appeal. The circumstances dictate the best option.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRelated:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima and compliments of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-foreign-visa-applications/\">Legal Discussions With Vengai Madzima: Foreign Visa Applications</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "‘It’s the only way’: Migrants, army face-off along South Africa-Zimbabwe border",
            "url": "https://www.newzimbabwe.com/its-the-only-way-migrants-army-face-off-along-south-africa-zimbabwe-border/",
            "content": "By Al Jazeera\n\nEVERYDAY, Fadzai Musindo walks across the border between Zimbabwe and South Africa  sometimes via the official border post but usually by taking the more dangerous informal route.\n\nStreams of men, women and children regularly cross the bridge separating the two countries, but for the 43-year-old mother of three, it is a necessity so she can earn enough to fend for her children.\n\nMusindo works as a runner, physically carrying goods into Zimbabwe for people who shop in South Africa and need their wares transported to the other side. Amid Zimbabwes ailing economy and scarcity of certain items, the job has become popular.\n\nBut using the formal Beitbridge border post presents more challenges and expenses than solutions for Musindo.\n\nI need to save the pages on my passport so I cant stamp every day. If I did that, I would have to buy a passport every year, I cant do that, she said, determined to put off paying the $150 fee for a replacement travel document for as long as possible.\n\nSo, to make it across to South Africa and back, Musindo walks to the banks of the Limpopo River, one of the largest in Africa, where groups of young men known as guma-gumas smuggle people over for a small fee.\n\nThe crossing is technically illegal, and dangerous  with irregular migrants at risk of being raped or robbed. But Musindo says she walks with other women to avoid the risks.\n\nIf we walk as a group, nothing will happen to us because we are many, she explained about her daily journeys made with a bundled-up cloth on her head, carrying groceries and household items for her clients.\n\nPeople dont bother us because we work here every day. The soldiers know who we are so when they see us passing, they let us go, she claimed.\n\nOnce across, Musindo uses the legal walkways. But through the bush and across the crocodile-infested Limpopo, the 5km (3-mile) stretch is uncertain terrain.\n\nThe guma-gumas promise they can evade the police and soldiers patrolling the bushes along the river, but since South Africas army (SANDF) launched a new border safeguarding operation last year, many are more worried than before.\n\nOn patrol\n\nDeployed under the SANDFs Operation Corona, groups of soldiers with rifles in hand, patrol along the 233km (145-mile) Limpopo border on the lookout for smugglers and people crossing illegally.\n\nOn a patrol in late November, the soldiers camouflaged themselves in the surrounding grassland, waiting to see who would cross.\n\nEventually, two young men passed by, leading a group of three women and a child through the bush; not far behind, a few more young men followed their bush guides into South Africa.\n\nBut as the soldiers appeared from the tall grass, the young men ran away, leaving the group at the armys mercy.\n\nA pregnant woman was caught and taken into custody by the soldiers. The mother of the young boy managed to flee back to the no mans land between Zimbabwe and South Africa, but her son and friend were apprehended and made to sit on the surrounding rocks until a car came to escort them to the border.\n\nFor those who ran away on foot, Major Shihlangoma Mahlahlane, who leads the joint technical operation for Operation Corona, explained that the SANDF cannot pursue them.\n\nIn the middle of the river, its no mans land thats where it divides Zimbabwe and South Africa so when we chase them away they know we cant do anything, Mahlahlane said.\n\nWe need to stop and come back otherwise we will engage with the Zimbabwean authorities. There is nothing we can do about it.\n\nThe enhanced border operation, which began in September and will run until the end of April, covers South Africas borders with Botswana, Mozambique and Zimbabwe.\n\nThe SANDF says since it started, fewer undocumented travellers have been taking the risk of crossing through informal means, even though smuggled goods remain a problem. However, many still take a chance.\n\nTechnical challenges for law enforcement have also created opportunities for smugglers.\n\nIn 2020, a 40km (25-mile) fence was erected between South Africa and Zimbabwe at a cost of $2.1m  but sections have since been cut. Despite efforts to reinstall the boundary, there are gaping holes in the stretch of barbed wire. A holey fence, combined with a seasonally dry river allows people to brave crossing, officials say.\n\nCausing distress\n\ncross Limpopos sandy banks at night, the guma-gumas light fires to keep warm and send signals to other crossers about where to come and wait. They bide their time until the next chance to make the crossing with more people emerges.\n\nBut those taken into custody by the army face a different fate. Immigration officials will send them back to Zimbabwe, but Major Mahlahlane fears that even if they get deported, they may come back again in the hope of seeking better opportunities.\n\nPregnant women cross into South Africa and after they give birth they try to have their child registered as a South African, so they can try to obtain the child grant, he said.\n\nBut, while public hospital facilities in South Africa are far better than those in Zimbabwe, accessing the monthly grant of 530 rand ($29) per child in South Africa is not an automatic process even for single South African mothers.\n\nThe South African Border Management Authority (BMA), set up in April 2023 to improve border control, has deported and arrested more than 410,000 people at different sites since a new coalition government came to power in May last year. The government, made up of 11 parties that campaigned on curbing migration, has promised to speed up deportations as some cases take months to resolve.\n\nHowever, Loren Landau, a professor at the African Centre for Migration and Society at the University of Witwatersrand in Johannesburg, which produces academic research on migration trends across the continent, cautions that the fast-track removals of irregular migrants could create other problems.\n\nPart of the BMAs mandate is to ensure people move out of South Africa quickly and when they are deported quickly they dont have access to social workers or lawyers, families get separated and it causes more distress.\n\nOften people come back and instead of using the trusted routes people tend to go underground which could be far more dangerous for vulnerable people and minors, Landau told Al Jazeera.\n\nA bus-to-bus, car-to-car operation\n\nOn the other side of the Limpopo, the Zimbabwean government has launched a crackdown on smugglers and illicit goods brought in by buses, private cars and trucks.\n\nAccording to Tafadzwa Muguti, the secretary for presidential affairs and devolution, a task force which includes the Zimbabwe Revenue Authority (ZIMRA), immigration and the police will search all vehicles crossing.\n\nAnyone who cannot account for their goods will have them confiscated and penalties for those who contravene import regulations.\n\nHe said the operation intensified over the recent festive season, a period when smuggling activity often peaks as Zimbabwean expatriates returning home are known to bring goods that evade customs duty, exacerbating the challenges faced by local manufacturers.\n\nThe Beitbridge border, one of Africas busiest, sees more than 13,000 travellers and more than 400 buses crossing daily. Alongside the regular movement, people and goods are smuggled in and out of South Africa daily.\n\nZIMRA estimates Zimbabwe has lost up to $1bn in undeclared import revenue, so the tax agency officials search each border transporter. But the operation has caused lengthy delays at the busy border, frustrating those travelling for the festive season.\n\nAlways another way\n\nFor Musindo, however, the border operation has meant further delays to her work as a runner, as it has cut off the possibility of using faster, alternative means to make the crossing.\n\nWhen its like this, I can wait more than five hours in the queue [at the border post] with someones luggage; on some days it can be even longer, so even though the border can be full with people, in a day I can get 200 rand [$11] if Im lucky to carry for two customers, she lamented.\n\nBeing stuck in long queues can be frustrating for travellers, but for Musindo, waiting for hours while people wade through the queues to get their passports stamped means she earns less money as more time is spent waiting. Though crossing via the Limpopo River is riskier, it takes just 45 minutes, she says.\n\nAware of the dangers, Musindo does not always use the informal route but says when the border is full, she can go back and forth across the river three times a day, instead of only once at the official post.\n\nIts better when there are no delays, I get much more [money]; but for now there is no other way, she explained.\n\nMeanwhile, in the bushes of the Limpopo, more South African forces are on patrol, clamping down on movement.\n\nBecause the river is dry, people are exploiting the gaps. They will not focus on the point of entry, but they would rather come and exploit a gap, said Major Mahlahlane. At times, the river is seasonally dry and more so due to the drought, but the onset of the rains has not deterred people.\n\nHe added that the army is not concerned about Zimbabweans who are in South Africa legally. There will be more security forces along the border  but we are focusing on illegal activity.\n\nSome South African villages along the Limpopo River are also complicit in the illegal ferrying of goods using donkey carts, he said. Cigarettes are common contraband that goes into the South African market. The steep import levies charged by South Africa make smuggling a lucrative option for those looking to evade duties. Since Operation Corona began, more than 8 million rand ($500,000) worth of cigarettes have been seized along border settlements, officials said.\n\nThe issue is not at the border\n\nHowever, permanently clamping down on illicit trade could be difficult for South Africa as the runners and guma-gumas who have crossed the river route for decades could find other paths.\n\nWhenever we invest in more border security there is a race with smugglers, the more we securitise, the more sophisticated people become in getting their goods across, they will always find other means, Landau told Al Jazeera.\n\nReducing irregular migration in the long term requires a multifaceted approach, according to James Chapman, head of advocacy at the Scalabrini Center, a non-profit organisation that protects migrants and refugee rights.\n\nBorder management requires a sustainable, multipronged approach  in a manner that is in keeping with fundamental human rights and South Africas legal framework.\n\nHowever, Landau maintains border control is a political issue, with xenophobia having spurred waves of attacks on foreigners in the past. He argues the main challenge is not migration, but the state of South Africas poor urban areas.\n\nA long-term solution depends on what the problem is and where it is, the issue is not at the border, the problem is in the cities, in townships that have been overtaken by criminal gangs and addressing that issue is key, he said.\n\nCrime and inequality are pervasive issues in post-apartheid South Africa and in marginalised communities, African foreigners are often the target of public frustration.\n\nespite the xenophobic backlash, many Africans still see the continents most industrialised economy as their potential path to a better life.\n\nDespite army patrols heightened along Limpopos sandy marshes and the high risk of being caught as an undocumented person, with the start of another year, new groups of Zimbabweans are considering going to South Africa to escape their countrys economic woes.\n\nMeanwhile, for daily border workers, Musindo feels taking a chance to cross under the bridge is better than waiting in the long queues that cut down the amount of money she is able to earn for her family.\n\nI need to work as much as I can because in January my children need to go back to school. The soldiers might try to stop people, but what can I do? This is the only way I can use, she said, before disappearing back into the moving crowds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13051809/SAZIM-BORDER-5-1736230410.webp",
            "description": "<p>By Al Jazeera  EVERYDAY, Fadzai Musindo walks across the border between Zimbabwe and South Africa – sometimes via the official border post but usually by taking the more dangerous informal route. Streams of men, women and children regularly cross the bridge separating the two countries, but for the 43-year-old mother of three, it is a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-the-only-way-migrants-army-face-off-along-south-africa-zimbabwe-border/\">‘It’s the only way’: Migrants, army face-off along South Africa-Zimbabwe border</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "Zimbabwe Cricket selectors accused of ‘bias’ as bowler raves and rants in leaked audio recording",
            "url": "https://www.newzimbabwe.com/zimbabwe-cricket-selectors-accused-of-bias-as-bowler-raves-and-rants-in-leaked-audio-recording/",
            "content": "By Sport Reporter\n\nZIMBABWE senior mens cricket team, Chevrons bowler, Tendai Chatara has come out guns blazing over alleged favouritism and cronyism at the cricket mother body.\n\nIn a leaked audio recording that recently went viral, the 33-year-old cricketer accused Zimbabwe Cricket (ZC) for unfair selection of national team players, blaming Elton Chigumbura and chief selector David Mutendera for the malpractice.\n\nChatara was omitted for the just-ended tour by visiting Afghanistan in which Zimbabwe played three ODIs and as many T20s, before rounding up with two Test matches.\n\nIn the audio, Chatara complained about how inexperienced players were making it into the first team at the expense of more experienced ones.\n\nIn making the accusations, he largely apportioned blame on Chigumbura, who is part of the selectors, saying he systematically pushes for players from his academy into the Chevrons line-up at the expense of more deserving players.\n\nFollowing the leak, Chatara issued an apology alleging he was drunk at the time of making the rants.\n\nI am writing to sincerely apologise for the hurt caused by my comments in a leaked audio that has been circulating via WhatsApp and other social media platforms.\n\nI deeply regret my poor judgment in that moment, particularly after having a few drinks.\n\nI also regret the reputational damage this may cause to you as individuals and to Zimbabwe Cricket as an organisation. This was never my intention, and I take full responsibility for my actions, read part of his apology statement.\n\nChatara also profusely apologised to Chigumbura, a former player turned selector.\n\nMr Chigumbura, I have immense respect for you, not only for your contributions to Zimbabwean cricket as players but also for the trail you have blazed for many black children from disadvantaged backgrounds, including myself.\n\nYour achievements on the international stage inspired many of us to believe that we could reach the highest level of cricket despite the challenges we faced.\n\nYour continued dedication to nurturing young talent is something I greatly admire, and I am truly sorry for any suggestion that questioned your integrity or commitment.\n\nI also want to acknowledge that my frustration stemmed from not being selected when I felt I still had much to offer in the national team.\n\nHowever, I fully regret the way that frustration came out. My comments were disrespectful and hurtful, and for that, I take full responsibility.\n\nThe selection of players has perennially been a contentious issue within local cricket.\n\nRecently, the Chevrons played its Test match against Afghanistan with a number of greehorns, a move which was criticised by analysts.\n\nSelectors have been overlooking good players in first-class cricket like top batsman Nick Welch, spinner Vincent Masekesa, among others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13051150/363323.jpg",
            "description": "<p>By Sport Reporter  ZIMBABWE senior men’s cricket team, Chevrons bowler, Tendai Chatara has come out guns blazing over alleged favouritism and cronyism at the cricket mother body. In a leaked audio recording that recently went viral, the 33-year-old cricketer accused Zimbabwe Cricket (ZC) for unfair selection of national team players, blaming Elton Chigumbura and chief</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-cricket-selectors-accused-of-bias-as-bowler-raves-and-rants-in-leaked-audio-recording/\">Zimbabwe Cricket selectors accused of ‘bias’ as bowler raves and rants in leaked audio recording </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "‘Sellout’ CCC Members of Parliament visit Mnangagwa farm, brazenly support his ‘2030 agenda’ to cling to power",
            "url": "https://www.newzimbabwe.com/sellout-ccc-members-of-parliament-visit-mnangagwa-farm-brazenly-support-his-2030-agenda-to-cling-to-power/",
            "content": "By Staff Reporter\n\nIN what has been described as the greatest betrayal of the electorate, a clique of opposition Citizens Coalition for Change (CCC) lawmakers this Sunday attended a field tour of President Emmerson Mnangagwas farm, where they openly chanted Zanu PF slogans and endorsed the octogenarians bid to extend his stay in office beyond 2028.\n\nLed by self-styled CCC interim secretary general Sengezo Tshabangu, a Senator, the sizeable number of Members of Parliament (MPs) travelled to Mnangagwas Precabe farm situated on the outskirts of Kwekwe, Midlands province.\n\nNotable CCC faction members in attendance included, Thokozani Khupe, Kucaca Phulu, Juliana Makuvire, Nonhlanhla Mhlotswa, Charles Moyo, Bridget Nyandoro, Samantha Mureyanj, Otillia Sibanda, Lillian Sibanda and Constance Chiota.\n\nSpeaking during the event, Tshabangu rubber-stamped Mnangagwas bid to remain in office beyond his constitutionally permissible two terms, which end in 2028. The 2030 agenda, now dubbed Resolution #1 will come through constitutional amendments to defer 2028 polls to 2030, thereby automatically extending the MPs tenure.\n\nIf our presence here improves your stay in power and makes the people of Zimbabwe happy, then let it be, Tshabangu said, amid deafening applause from Zanu PF legislators and members of his sellout CCC faction.\n\nParliament of Zimbabwe said the field tour of the 82-year-old Zanu leaders property was the first time that all MPs gathered for a familiarisation tour in a show of political and democratic maturity in the countrys politics.\n\nPresident Mnangagwa and part of the touring parliamentarians and other guests chanting Zanu PF slogans while in a maize field\n\nFormer CCC MP, Fadzayi Mahere took aim at Tshabangu describing his actions as a mockery to democracy.\n\nWriting on social media, Mahere said, This is no longer Parliament. Its a crime scene Mahumbwe chaiwo (a joke). We need new leaders.\n\nThis is the biggest scandal in the history of Zimbabwean politics. It makes a mockery of the effort that sincere opposition politicians made to run in the last elections and its a slap in the face to the electorate that made their will known.\n\nMahere decried the farce that has become Parliament composed of opposition lawmakers captured by Mnangagwa and his cabal.\n\nThey have no idea what their constitutional role is. A sheer waste of taxpayer money. In the end, we will only have one lawmaker, if we arent there already. They are in the guys pocket and its a shame.\n\nThe Sunday event was supposedly a parliamentary tour to familiarise legislators with the Mnangagwa familys farming operations but turned out to be a political gathering to endorse Mnangagwas 2030 agenda, which another faction of his party loyal to Vice President Constantino Chiwenga is strongly opposed to. Chiwenga and his co-deputy president Kembo Mohadi were not present at the controversial event.\n\nTshabangu defended CCC legislators who toured Mnangagwas farm, labelling them as progressive and walking steps toward national unity amid the countrys politically polarized environment.\n\nIn the midst of our toxic and often polarizing political environment, our attendance here demonstrates the indivisibility of Zimbabwe, he said.\n\nSelf-exiled former Cabinet minister Saviour Kasukuwere, who at one time served as the Zanu PF national political commissar, said the Precabe farm meet-up was rubbish.\n\nLet him call for a referendum on this rubbish. We will land in Harare and defeat this satanic arrangement. We have enough forces to defeat this nonsense.\n\nThese are desperate acts of criminals who think they can hoodwink the masses of our people, said Kasukuwere.\n\nThe structures from Zambezi to Limpopo are more than ready to retire these criminals before the end of 2025.\n\nWe have to sack these cheats as a matter of urgency. Zimbabweans unite and send these criminals packing. Enough Is Enough, he added.\n\nOpposition political activist, Job Sikhala said legislators who went to Mnangagwas joint had aligned themselves with the oppressor.\n\nFrom the day you visit Precabe Farm, pretending to be opposition must be the day you must know that we will treat you the way we treat Zanu PF. You are the enemy of the people, and you must be treated as such!!!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13043124/GhGPSa6WgAAfThe.jpeg",
            "description": "<p>By Staff Reporter  IN what has been described as the greatest betrayal of the electorate, a clique of opposition Citizens’ Coalition for Change (CCC) lawmakers this Sunday attended a field tour of President Emmerson Mnangagwa’s farm, where they openly chanted Zanu PF slogans and endorsed the octogenarian’s bid to extend his stay in office beyond</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sellout-ccc-members-of-parliament-visit-mnangagwa-farm-brazenly-support-his-2030-agenda-to-cling-to-power/\">‘Sellout’ CCC Members of Parliament visit Mnangagwa farm, brazenly support his ‘2030 agenda’ to cling to power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        },
        {
            "title": "ZEP holders face uncertainty as some bank accounts are frozen",
            "url": "https://www.newzimbabwe.com/zep-holders-face-uncertainty-as-some-bank-accounts-are-frozen/",
            "content": "MoneyWeb\n\nNumerous Zimbabwe Exemption Permit (ZEP) holders report that their bank accounts were frozen in early January, preventing them from making transactions.\n\nSome banks are reportedly still imposing a freeze on ZEP holders bank accounts, but this seems to be a system error as the Department of Home Affairs extended the validity of the ZEP system until November 2025. These permits allow Zimbabweans to live and work in SA.\n\nRead:Last-minute reprieve for Zimbabwe Exemption Permit holders\n\nThe hold on ZEP accounts appears to be a system error rather than the result of any malice on the part of the banks, says Simba Chitando, a human rights lawyer representing the ZEP Holders Association.\n\nWe urge the banks to address this issue urgently and unblock these accounts so that we can avoid having to go to court to force them to do it, he says.\n\nMany ZEP holders say their accounts at Capitec were frozen, but the bank responded quickly, saying the system issue had been resolved and account holders could transact as usual.\n\nUncertainty\n\nMost of those reporting their accounts being frozen received no prior notification.\n\nLast year, FNB sent text messages to its ZEP clients asking them to renew their permits. ZEP holders took this to mean they needed to apply for a permit waiver or a work visa. Soon after, Minister of Home Affairs Leon Schreiber issued a one-year ZEP extension.\n\nThis still leaves ZEP holders facing the uncertainty of having their banking facilities terminated at the end of 2025 should they fail to receive an alternative visa allowing them to continue working in SA.\n\nChitando says the banks that had frozen the accounts of ZEP holders had not updated their systems to reflect the ZEP extension.\n\nAffected ZEP holders should take a copy of their ID or passport along with a printout of theGovernment Gazette noticeextending the validity of the ZEPs to their banks.\n\nThe ball is in the court of the ZEP holders. If the banks refuse, only then can we consider legal action, says Chitando.\n\nNot the first time\n\nThis is not the first time ZEP holders have had their bank accounts frozen, though on prior occasions the hold was lifted  often under threat of legal action.\n\nThe latest freeze caused panic among many in the ZEP community, numbering some 178 000 people. Debit orders were not processed, and they were unable to buy food, pay school fees, or make other essential transactions.\n\nIf the banks do not remove the hold, we will approach the courts. We cant go [to] the courts without exhausting other remedies. Its an issue that affects all the banks. Obviously, it would be preferable for the banks to fix this situation themselves without forcing ZEP holders to approach the banks, which could involve thousands of customers, says Chitando.\n\nBanks respond\n\nMoneyweb asked FNB for comment and received this response from Stanton Govender, FNB head for Foreign Nationals and Non-Resident Banking: FNB has noted the announcement from the Department of Home Affairs to extend the Zimbabwean Exemption Permit (ZEP) deadline to 28 November 2025. The bank is in the process of assessing any impact to customers and any updates will be communicated to them.\n\nWe are committed to helping our customers to ensure that their bank accounts are used and managed in accordance with the relevant laws and complying with the latest announcement.\n\nOur customers can also contact us directly if they have any questions or need assistance with their bank accounts.\n\nNedbank also said it was looking into the matter but had not responded to Moneyweb at the time of prior publication. The article will be updated once a response is received.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13073950/bank-card.jpg",
            "description": "<p>MoneyWeb Numerous Zimbabwe Exemption Permit (ZEP) holders report that their bank accounts were frozen in early January, preventing them from making transactions. Some banks are reportedly still imposing a freeze on ZEP holders’ bank accounts, but this seems to be a system error as the Department of Home Affairs extended the validity of the ZEP</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zep-holders-face-uncertainty-as-some-bank-accounts-are-frozen/\">ZEP holders face uncertainty as some bank accounts are frozen</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "13 Jan 2025"
        }
    ]
}