{
    "news": [
        {
            "title": "US$4 million Ecobank armed robbery: Police arrest two suspects in SA",
            "url": "https://www.newzimbabwe.com/us4-million-ecobank-armed-robbery-police-arrest-two-suspects-in-sa/",
            "content": "By Staff Reporter\n\nTWO suspects have been arrested in connection with the infamous US$4.4 million bank heist at an Ecobank branch in Bulawayo last year.\n\nIn a statement this Sunday, Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the latest arrests of two Zimbabweans, who were holed up in neighbouring SouthAfrica.\n\nZRP confirms the arrest of Abraham Tendayi Vumbunu and Elijah Temayi Vumbunu in connection with the US$4 million Bulawayo Ecobank robbery heist which occurred on 3rd October 2024, said Nyathi.\n\nThe pair was nabbed on July 5, 2025, in the Republic of South Africa.\n\nDue processes of the law are now taking effect for the suspects extradition to Zimbabwe, the police spokesman added.\n\nHe said detectives are pursuing other suspects linked to the fiery daylight robbery that shocked the world.\n\nThe crime was orchestrated by a gang of six armed robbers, brandishing AK-47 rifles and pistols, who ambushed a Safeguard Security cash-in-transit van outside the Ecobank branch at the NRZ Building on the corner of Fife Street and 9th Avenue.\n\nThe security guards had just collected several metal cash boxes when they were confronted by the robbers, who swiftly overpowered them and vanished with the cash, using a white Ford Ranger single-cab getaway truck.\n\nInvestigations later revealed that the number plate on the getaway car had been stripped from a Mazda Demio.\n\nCCTV footage and bystander videos of the heist circulated widely on social media, capturing the robbers executing the operation with shocking ease.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06111120/img_1751796074305.jpg",
            "description": "<p>By Staff Reporter  TWO suspects have been arrested in connection with the infamous US$4.4 million bank heist at an Ecobank branch in Bulawayo last year. In a statement this Sunday, Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the latest arrests of two Zimbabweans, who were holed up in neighbouring South Africa. “ZRP confirms</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us4-million-ecobank-armed-robbery-police-arrest-two-suspects-in-sa/\">US$4 million Ecobank armed robbery: Police arrest two suspects in SA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "06 Jul 2025"
        },
        {
            "title": "Cricketer Masvaure ruled out of second Test against South Africa",
            "url": "https://www.newzimbabwe.com/cricketer-masvaure-ruled-out-of-second-test-against-south-africa/",
            "content": "By James Muonwa\n\nZIMBABWEs Chevrons opening batter Prince Masvaure will miss the second Test match against South Africa, which gets underway at Queens Sports Club in Bulawayo this Sunday morning.\n\nMasvaure is suffering from a respiratory tract infection and was deemed unfit to feature in the battle against the world champions.\n\nZimbabwe Cricket (ZC) Media and Communications Manager Darlington Majonga confirmed the latest development in a statement.He (Masvaure) had come into the team as a concussion replacement for Brian Bennett during the first Test played last week.Bennett himself remains unavailable for selection as he continues to recover from the concussion he sustained in that match, said Majonga.Dion Myers has been named as Masvaures replacement in one of two changes made to the Zimbabwe playing XI for the second Test.The other change sees Kundai Matigimu making his Test debut, coming in for Vincent Masekesa.ZIMBABWE PLAYING XI FOR SECOND TEST VS SOUTH AFRICA:Takudzwanashe Kaitano, Nick Welch, Dion Myers, Sean Williams, Craig Ervine, Wessly Madhevere, Tafadzwa Tsiga, Wellington Masakadza, Blessing Muzarabani, Tanaka Chivanga, Kundai Matigimu.\n\nZimbabwe Cricket (ZC) Media and Communications Manager Darlington Majonga confirmed the latest development in a statement.\n\nHe (Masvaure) had come into the team as a concussion replacement for Brian Bennett during the first Test played last week.\n\nBennett himself remains unavailable for selection as he continues to recover from the concussion he sustained in that match, said Majonga.\n\nDion Myers has been named as Masvaures replacement in one of two changes made to the Zimbabwe playing XI for the second Test.\n\nThe other change sees Kundai Matigimu making his Test debut, coming in for Vincent Masekesa.\n\nZIMBABWE PLAYING XI FOR SECOND TEST VS SOUTH AFRICA:\n\nTakudzwanashe Kaitano, Nick Welch, Dion Myers, Sean Williams, Craig Ervine, Wessly Madhevere, Tafadzwa Tsiga, Wellington Masakadza, Blessing Muzarabani, Tanaka Chivanga, Kundai Matigimu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06092240/385286.jpg",
            "description": "<p>By James Muonwa  ZIMBABWE”s Chevrons opening batter Prince Masvaure will miss the second Test match against South Africa, which gets underway at Queens Sports Club in Bulawayo this Sunday morning. Masvaure is suffering from a respiratory tract infection and was deemed unfit to feature in the battle against the world champions. Zimbabwe Cricket (ZC) Media</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cricketer-masvaure-ruled-out-of-second-test-against-south-africa/\">Cricketer Masvaure ruled out of second Test against South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "06 Jul 2025"
        },
        {
            "title": "Zimbabwe’s Sables in Uganda to defend Africa Rugby Cup title",
            "url": "https://www.newzimbabwe.com/sables-in-uganda-to-defend-africa-rugby-cup-title/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens rugby team arrived in Uganda on Saturday for the 2025 Rugby Africa Cup.\n\nFondly known as the Sables, the local side walks into this years edition with aspirations to defend the title which they won last year.\n\nThis years Rugby Africa Cup will see eight countries battling for honours, namely Zimbabwe, Tunisia, Kenya, Namibia, Algeria, Senegal, Ivory Coast and hosts Uganda.\n\nZimbabwe will open its campaign with a clash against Tunisia on Tuesday at Mandela National Stadium.\n\nTeam head coach Piet Benade is banking on continuity going into the match.\n\nWe are fortunate to get a lot of the boys back who were here last year.\n\nSo hopefully, as I said, the continuity and the spirit of the guys, the good memories from last year, hopefully will keep us spirit high, Benade said.\n\nWinner between Zimbabwe and Tunisia will face victor between Kenya and hosts Uganda in the semi-finals.\n\nThis years Rugby Africa Cup winner will automatically qualify for the 2027 Rugby World Cup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06071412/IMG-20250706-WA0000.jpg",
            "description": "<p>By Sports Reporter  ZIMBABWE senior men’s rugby team arrived in Uganda on Saturday for the 2025 Rugby Africa Cup. Fondly known as the ‘Sables’, the local side walks into this year’s edition with aspirations to defend the title which they won last year. This year’s Rugby Africa Cup will see eight countries battling for honours,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-in-uganda-to-defend-africa-rugby-cup-title/\">Zimbabwe’s Sables in Uganda to defend Africa Rugby Cup title</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "06 Jul 2025"
        },
        {
            "title": "Zimbabwe launches wildlife translocation programme to restore biodiversity at national park",
            "url": "https://www.newzimbabwe.com/zimbabwe-launches-wildlife-translocation-programme-to-restore-biodiversity-at-national-park/",
            "content": "By Mary Taruvinga\n\nZIMBABWE Parks and Wildlife Management Authority (ZimParks) has announced the implementation of a comprehensive wildlife transformation programme.\n\nThe exercise is aimed at improving the biodiversity in one of its major game reserves, the Matusadonha National Park (MNP).\n\nZimParks spokesperson Tinashe Farawo said the multi-year initiative will be rolled out in partnership with the African Parks Network and The Matusadona Conservation Trust.\n\nThis will be done to restore biodiversity, enhance ecological resilience, and support sustainable natural resource management within MNP and its broader landscape.\n\nThe authority issued permits to translocate 10 eland (Taurotragus oryx) and 50 buffalos (Syncerus caffer) from Tsetse Island, part of the Lake Kariba Recreational Park, to Matusadona.\n\nAdditionally, 20 sable antelope (Hippotragus niger) will be relocated from Sibilobilo Safari Area, alongside other key herbivores-including sable, eland, and roan antelope (Hippotragus equinus) sourced from carefully selected populations across the country.\n\nThis strategic intervention aims to re-establish viable, self-sustaining herbivore populations, contributing to ecosystem restoration and the rewilding of Matusadona as part of the larger Sebungwe landscape, Farawo said in a Friday statement.\n\nAccording to Farawo these efforts are underpinned by scientific ecological assessments to safeguard the health and sustainability of source populations.\n\nHe said throughout the duration of this multi-year programme, additional measures will be implemented to strengthen conservation outcomes.\n\nThese include enhanced law enforcement, biodiversity monitoring, and community development initiatives aimed at improving local livelihoods, boosting anti-poaching efforts, and generating tangible conservation benefits for communities living adjacent to the national park.\n\nSuch integrated approaches are essential to promoting coexistence and ensuring the long-term sustainability of conservation efforts.\n\nMatusadona National Park is currently undergoing a transformative phase, driven by substantial investments in infrastructure, ecological restoration, and stakeholder engagement, these initiatives are positioning the park once again as a key national conservation asset.\n\nThe translocation programme is a vital component of this broader strategy, ensuring that wildlife populations thrive and that the ecological, cultural, and economic benefits are preserved for present and future generations.\n\nFarawo said ZimParks and its partners remain committed to responsible, evidence-based conservation practices that uphold biodiversity integrity, ecosystem health, and community well-being.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/08134815/Hwange-National-Park.jpg",
            "description": "<p>By Mary Taruvinga  ZIMBABWE Parks and Wildlife Management Authority (ZimParks) has announced the implementation of a comprehensive wildlife transformation programme. The exercise is aimed at improving the biodiversity in one of its major game reserves, the Matusadonha National Park (MNP). ZimParks spokesperson Tinashe Farawo said the multi-year initiative will be rolled out in partnership with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-launches-wildlife-translocation-programme-to-restore-biodiversity-at-national-park/\">Zimbabwe launches wildlife translocation programme to restore biodiversity at national park</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "06 Jul 2025"
        },
        {
            "title": "Woman imprisoned 15 years for bizarre sexual act on girl (7)",
            "url": "https://www.newzimbabwe.com/woman-imprisoned-15-years-for-bizarre-sexual-act-on-girl-7/",
            "content": "By Mary Taruvinga\n\nA 19-year-old woman from Chirumanzu in Midlands province has been slapped with a 15-year jail term for indecent assault on a seven-year-old girl.\n\nTatenda Madanhire of Munetsi village in Chirumazu, Midlands province, was convicted by Gweru Magistrate Christopher Maturure after pleading guilty to the charge.\n\nThe court heard she violated the minor on the pretext of teaching her a game.\n\nThe accused and the complainant are not related.\n\nThe State proved that the incident occurred on June 21, 2025, at around 1500 hours.\n\nThe complainant was walking from school with her schoolmate also aged seven.\n\nThey then met Madanhire, who was gathering firewood in a bush in the riverbanks of dry stream near the village.\n\nThe accused walked for a distance of approximately 500 metres with the two and she grabbed the complainants hand and told that she wanted to play a game with her.\n\nShe scolded the other child and instructed her to proceed home.\n\nThe accused took the complainant to a secluded place where she undressed her before sexually assaulting her using her enlarged genitalia, which bizarrely resembles a male persons private organ.\n\nWhen the complainant arrived home, she told her aunt that she was sexually abused by a male person who was wearing a skirt.\n\nThe matter was reported to the police and investigations were carried out leading to the arrest of the accused.\n\nThe complainant and accused were sent to St Theresas Hospital for medical examination, and they were medically examined.\n\nMonica Mungwena prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Mary Taruvinga A 19-year-old woman from Chirumanzu in Midlands province has been slapped with a 15-year jail term for indecent assault on a seven-year-old girl. Tatenda Madanhire of Munetsi village in Chirumazu, Midlands province, was convicted by Gweru Magistrate Christopher Maturure after pleading guilty to the charge. The court heard she violated the minor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-imprisoned-15-years-for-bizarre-sexual-act-on-girl-7/\">Woman imprisoned 15 years for bizarre sexual act on girl (7)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "06 Jul 2025"
        }
    ]
}