{
    "news": [
        {
            "title": "Grammy-winning Afropop star Tems: ‘Women are not respected in the industry’",
            "url": "https://www.newzimbabwe.com/grammy-winning-afropop-star-tems-women-are-not-respected-in-the-industry/",
            "content": "BBC\n\nNigerian Afropop star Tems has told the BBC people dont really respect women in her industry.\n\nThe two-time Grammy award-winner told the BBC that at the start of her career, she struggled to be taken seriously.\n\nI realised that theres always a cost. Theres always a price that you pay. And a lot of those prices I wasnt willing to pay and there wasnt a lot of options, Tems said.\n\nAfropop has gained immense global popularity over the past decade, but despite this growth it remains notoriously male-dominated.\n\nThe industrys so-called Big Three  Burna Boy, Davido and Wizkid  are all male  while their female counterparts, such asTiwa SavageandYemi Alade, have spoken out about the barriers they face because of their gender.\n\nEarlier this year, Tems hit out following negative comments about her body, which were made online after a video of her performing was posted onto X.\n\nShe wrote on the social media platform: Its just a body, I will add and lose weight. I never once hid my body, I just didnt feel the need to prove or disprove anyone. The more you dont like my body the better for me actually.\n\nTems told the BBC she wants to change the way women see themselves in music, and hopes to achieve this through her new platform, The Leading Vibe Initiative.\n\nThe project aims to provide opportunities for young women throughout Africas music industries.\n\nI promised myself that if I get to a place where I can do more, I will make this initiative for women like me and maybe make it easier for women to access platforms and access a wider audience and success, Tems said.\n\nThe initiative kicked off on Friday in Tems hometown, Lagos. Vocalists, songwriters and producers were invited to a series of workshops, masterclasses and panel discussions, all with the aim of developing skills and connections.\n\nAsked what advice she would give to young women wanting to crack the industry, she said: I think its important to have an idea of what you want for yourself, what your brand is, whats your boundary.\n\nWhat are the things that you wouldnt do for fame and the things that you would do?\n\nTems, who has scored hits with the likes ofLove Me JejeandFree Mind, said anyone trying to break into the industry must be passionate about their craft.\n\nIts not everybody that sings that loves music. If I wasnt famous, I would still be doing music. I would be in some kind of jazz club randomly on a Friday night, she said.\n\nBut this is far from Tems reality. Five years on from her debut EP, she has collaborated with the likes of Beyonc and Rihanna, racked up more than 17m monthly listeners on Spotify and headlined international festivals.\n\nAnd next month, she will be supporting British band Coldplay during their sold-out run of gigs at the UKs Wembley Stadium.\n\nTems puts her success down to being authentic and audacious.\n\nEven when people tell you to change your sound, change your style, you look at them and you say: No. If it meant me not being signed, I was okay not being signed. I went to a couple of places that didnt sign me and I was okay with that, she said.\n\nMusic is not Tems only passion  she is an avid football fan and recently became part-owner of US football club San Diego FC.\n\nI never imagined myself owning or being in an ownership of any football team, she said, adding that her brother initially got her into the sport.\n\nTems joined San Diegos ownership with Pave Investments, a West African private investment firm which also helped raise funds for theNBA-linked African Basketball League.\n\nTems involvement with San Diego gives her hope that people can be bold enough to try things that nobody ever thought was possible.\n\nShe said: I dont see myself as just a singer, just a musician, just an artist. Im much more than that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13091413/tems.webp",
            "description": "<p>BBC Nigerian Afropop star Tems has told the BBC “people don’t really respect women” in her industry. The two-time Grammy award-winner told the BBC that at the start of her career, she struggled to be taken seriously. “I realised that there’s always a cost. There’s always a price that you pay. And a lot of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/grammy-winning-afropop-star-tems-women-are-not-respected-in-the-industry/\">Grammy-winning Afropop star Tems: ‘Women are not respected in the industry’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "13 Aug 2025"
        },
        {
            "title": "All-in-One iGaming Easy: Choose DSTGAMING Turnkey Platform",
            "url": "https://www.newzimbabwe.com/all-in-one-igaming-easy-choose-dstgaming-turnkey-platform/",
            "content": "An increasing number of operators are pivoting to turnkey casino and sportsbook services  with good reason. These solutions take care of legal, financial, and technical challenges related to creating a casino outfit from scratch. Plus, the software is easy to manage and offers impressive flexibility. Turnkey refers to being available for use. And DSTGAMING is a preferred choice for operators. This blog post explores why turnkey casino and sportsbook solutions, especially DSTGAMING, are gaining traction.\n\nSeven Reasons Why More Operators Prefer Turnkey Platforms\n\nHere are seven reasons whyturnkey casinos and sportsbooksare becoming popular:\n\nLower Upfront Costs\n\nDeveloping a sportsbook or casino from scratch requires a significant capital investment. Operators would channel resources toward certified software development, website design, legal fees, testing, security, and other essential components before going live. As expected, the total cost can run up to several hundred thousand dollars. In contrast, turnkey solutions are ready-to-use and cost-effective alternatives.\n\nChoosingDSTGAMINGturnkey packages reduces the financial burden and stress of starting from scratch. Operators get a ready-made platform with total control over functionality and customization. Most of the groundwork required has already been done, which helps reduce ownership costs significantly.\n\nFaster Market Entry: Launches in Weeks\n\nWhile building a custom platform could take a year or more, turnkey solutions can be up and running in a couple of weeks. Timing plays a vital role in developing a casino or sportsbook. A considerable benefit of a turnkey platform is the speed at which an operator can get into the market.\n\nFor example, DSTGAMING assembles all essential systems  payments, tech, permits, game collections, and operational tools- in weeks. This momentum gives operators a competitive edge, allowing quick entry and the possibility of market domination early in their launch period.\n\nHigher Level of Customisation\n\nUnlike white-label solutions, turnkey solutions provide a much higher level of customization. You can kickstart with a basic setup to test the market and progressively add more features based on user feedback and receptiveness. This flexibility is a significant factor in why turnkey solutions appeal to more operators. It also gives your brand an edge in a crowded niche where users are always seeking fresh and innovative experiences. You can easily shape your platform appearance, add new games, make UI/UX changes, and expand bonus offerings.\n\nRobust Compliance and Security Tools\n\nTurnkey solution providers are equipped with the expertise to provide robust compliance and security features and tools. These tools and features include:\n\nBefore being launched into the markets, these solutions are backed by KYC/AML requirements, licensing, and secure payment solutions. In jurisdictions like Latin America and Europe, you need the necessary licensing to avoid regulatory issues. DSTGAMING offers aids to help navigate these regions. This way, operators focus on building their brand without worrying about legal hurdles. Hence, a smoother and better entry into multiple markets.Offers Long-term ScalabilityThe tech space leaves no room for chance; experts are being intentional about providing solutions. These solutions get absorbed by iGaming operators, especially with products like AI, blockchain, and microgames. That being the case, operators must evolve or risk falling behind. One of the reasons turnkey software continues gaining traction is its capacity for possible adaptation. These solutions support frequent updates, offer scalable APIs, and can take on new features. Your brand can stay ahead of the curve without any costly redevelopment.Mobile Optimisation & App IntegrationTurnkey solution software is designed with mobile devices in view. Hence, compatibility with iOS and Android platforms is prioritized  a responsive and polished UI/UX design. Focusing on mobile usability offers an edge in the competitive industry as more gambling platforms are becoming mobile-friendly.After-service SupportCasino and sportsbook platforms like DSTGAMING dont only provide a ready-made iGaming platform and walk away  they continue to support you post-launch. Support includes 24/7 tech assistance, onboarding guidelines, and maintenance. The aim is to carry these burdens so you can focus more on running your business. Also, there are built-in tools that track players behavior so operators can stay ahead of customers.Is Choosing Turnkey Casino and Sportsbook Platforms the Right Choice for You?Yes, in todays fast-paced world, a turnkey solution is a smart move. While it offers more authority over functionality, branding, and players data, it is also cost-effective and leans towards long-term scalability. That said, when selecting a provider, DSTGAMING should be your top choice. They help you set up with ease, offering exceptional value through the development process.Key TakeawayThe iGaming space is gradually turning towards turnkey solutions for their flexibility, security measures, and compliance. Without a doubt, choosing a turnkey casino and sportsbook solution is a strategic investment. However, the provider you select is equally important. DSTGAMING stands out for obvious reasons, as it is a renowned brand that offers white-label, turnkey, and crypto solutions. Ready to launch into the iGaming market today? ExploreDSTGAMING websiteto know more and start building your next-gen iGaming brand.\n\nBefore being launched into the markets, these solutions are backed by KYC/AML requirements, licensing, and secure payment solutions. In jurisdictions like Latin America and Europe, you need the necessary licensing to avoid regulatory issues. DSTGAMING offers aids to help navigate these regions. This way, operators focus on building their brand without worrying about legal hurdles. Hence, a smoother and better entry into multiple markets.\n\nOffers Long-term Scalability\n\nThe tech space leaves no room for chance; experts are being intentional about providing solutions. These solutions get absorbed by iGaming operators, especially with products like AI, blockchain, and microgames. That being the case, operators must evolve or risk falling behind. One of the reasons turnkey software continues gaining traction is its capacity for possible adaptation. These solutions support frequent updates, offer scalable APIs, and can take on new features. Your brand can stay ahead of the curve without any costly redevelopment.\n\nMobile Optimisation & App Integration\n\nTurnkey solution software is designed with mobile devices in view. Hence, compatibility with iOS and Android platforms is prioritized  a responsive and polished UI/UX design. Focusing on mobile usability offers an edge in the competitive industry as more gambling platforms are becoming mobile-friendly.\n\nAfter-service Support\n\nCasino and sportsbook platforms like DSTGAMING dont only provide a ready-made iGaming platform and walk away  they continue to support you post-launch. Support includes 24/7 tech assistance, onboarding guidelines, and maintenance. The aim is to carry these burdens so you can focus more on running your business. Also, there are built-in tools that track players behavior so operators can stay ahead of customers.\n\nIs Choosing Turnkey Casino and Sportsbook Platforms the Right Choice for You?\n\nYes, in todays fast-paced world, a turnkey solution is a smart move. While it offers more authority over functionality, branding, and players data, it is also cost-effective and leans towards long-term scalability. That said, when selecting a provider, DSTGAMING should be your top choice. They help you set up with ease, offering exceptional value through the development process.\n\nKey Takeaway\n\nThe iGaming space is gradually turning towards turnkey solutions for their flexibility, security measures, and compliance. Without a doubt, choosing a turnkey casino and sportsbook solution is a strategic investment. However, the provider you select is equally important. DSTGAMING stands out for obvious reasons, as it is a renowned brand that offers white-label, turnkey, and crypto solutions. Ready to launch into the iGaming market today? ExploreDSTGAMING websiteto know more and start building your next-gen iGaming brand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13090641/Screenshot-2025-08-13-at-10.04.54.png",
            "description": "<p>An increasing number of operators are pivoting to turnkey casino and sportsbook services – with good reason. These solutions take care of legal, financial, and technical challenges related to creating a casino outfit from scratch. Plus, the software is easy to manage and offers impressive flexibility. Turnkey refers to being available for use. And DSTGAMING</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/all-in-one-igaming-easy-choose-dstgaming-turnkey-platform/\">All-in-One iGaming Easy: Choose DSTGAMING Turnkey Platform</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "13 Aug 2025"
        },
        {
            "title": "South Africa unperturbed by US visa policies affecting Zimbabwe",
            "url": "https://www.newzimbabwe.com/south-africa-unperturbed-by-us-visa-policies-affecting-zimbabwe/",
            "content": "IOL\n\nThe South African government appears unmoved by the recent visa ban imposed by the US embassy in Harare, Zimbabwe, even as US President Donald Trump continues to disrupt global diplomacy with tariff increases and immigration policies seven months into his second term.\n\nThe US has suspended all routine immigrant and non-immigrant visa services to Zimbabwe due to concerns about misuse and overstays. However, the issuance of other visa types remains unaffected.\n\nAlthough South Africa was exempt from new Trump visa restrictions on SADC countries, a new policy has been implemented for Malawi and Zambia.\n\nCitizens of these nations are now required to pay a bond of $5,000 (R88,656) to $15,000 (R265,967) to travel to the United States.\n\nAdditionally, the citizens are required to use one of three airportsBostons Logan International, New Yorks JFK International, or Dulles International near Washington D.C.for both arrival and departure.\n\nWhen asked whether South African citizens should be worried, Department of International Relations and Cooperation (Dirco) spokesperson Chrispin Phiri gave a brief response: We do not provide commentary on other countries visa regimes, and this is our general position, its not specific to the US.\n\nA senior government official, however, downplayed the likelihood of South Africans being affected by the US visa restrictions.\n\nRemember Trump is only in our case because of the International Court of Justice case against Israel and our involvement in BRICS. Nothing more and nothing less, the official said.\n\nSouth Africans visiting the US are mostly professionals who either go for business or a holiday. We seldom have citizens wanting to immigrate to the USwe should have nothing to worry about, he said.\n\nThe US embassy explained that the reasons for the restrictions was because the administration was working to prevent visa overstay and misuse as part of national security.\n\nThe Trump administration is protecting our nation and citizens by upholding the highest standards of national security and public safety through our visa process, the embassy said.\n\nWe are always working to prevent visa overstay and misuse.\n\nIn June, the US imposed travel bans on citizens from 12 countries, with seven of them located in Africa. Additionally, heightened restrictions were applied to seven other nations, three of which are African.\n\nThe US has issued a demand to 36 countries, predominantly in Africa, to enhance their traveler vetting procedures. Failure to comply could result in a ban on their citizens visiting the US.\n\nInternational Relations analyst Rejoice Ngwenya said it was unfortunate that the US had an obsession with immigration issues.\n\nAll democratic countries must encourage international country movements. However it is incumbent upon citizens that they dont abuse regulations. But one thing to acknowledge in terms of implementation of immigration laws globally is not to interfere and dissuade inter country movements of students because knowledge sharing and education is a universal right, Ngwenya said.\n\nInternational Relations expert Dr Noluthando Phungula said Trump continues to shake global diplomacy as he feels threatened, especially by BRICS countries.\n\nAs a head of stateand a representative of the unipolar super power bloc, Trump was threatened especially by BRICS, which South Africa is a part of.\n\nThe BRICS expansion and growth speaks to a clearer call from the Global South towards multilateralism. This inadvertently challenges Western dominance and calls for a reformation of international power structures. This is certainly an uncomfortable reality for Trump.\n\nWhile the formation may not be directly competing with the US, it directly challenges the unipolar global power dynamic, in which the United States is regarded as the lead superpower. The BRICS are a representation of a significant and needed transition towards a multipolar power setting, in which various countries lead global cooperation efforts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>IOL The South African government appears unmoved by the recent visa ban imposed by the US embassy in Harare, Zimbabwe, even as US President Donald Trump continues to disrupt global diplomacy with tariff increases and immigration policies seven months into his second term. The US has suspended all routine immigrant and non-immigrant visa services to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-unperturbed-by-us-visa-policies-affecting-zimbabwe/\">South Africa unperturbed by US visa policies affecting Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "13 Aug 2025"
        },
        {
            "title": "Ronaldo engaged to long-term partner Georgina Rodríguez",
            "url": "https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/",
            "content": "By BBC News\n\nFOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodrguez.\n\nShe announced the news on social media alongside a picture of a large ring, writing Yes I do. In this and in all my lives in her native Spanish.\n\nNo further details have been shared. Ronaldo, who is the most followed person on Instagram, has not yet made a comment about their engagement.\n\nThe couple have been together for nine years, after they met at a Gucci shop in Madrid where Rodrguez was working. He was playing at the Spanish club Real Madrid at the time.\n\nShe said siu! was one of the top comments, a nod to the footballers famous goal celebration where he shouts yes in Portuguese or Spanish.\n\nThe Portugal and Al-Nassr player has five children in total, two of whom he shares with Rodrguez.\n\nTheir youngest daughter Bella was born in April 2022, alongside a baby boy who was stillborn.\n\nRodrguez has also helped to raise Ronaldos other three children.\n\nThe 31-year-old, who starred in her own Netflix reality show I Am Georgina, previously addressed speculation around her engagement status. On the programme, she said her friends were always joking about the wedding.\n\nSince Jennifer Lopezs song The Ring Or When came out, they started singing it to me. And well, this is not up to me, she added.\n\nFamous faces including Kim Kardashian have liked the engagement announcement on social media. Piers Morgan, who interviewed Ronaldo in 2022, wished them as much success in their marriage as hes had on the football pitch!\n\nCelebrity make-up artist Charlotte Tilbury commented that it was fabulous news. Lauren Sanchez-Bezos, who married Amazon founder Jeff Bezos in June, said she was so happy for the couple.\n\nThe family currently live in the Saudi Arabian capital Riyadh, where Ronaldo plays for Al-Nassr. He joined the club in December 2022 for a reported annual salary of 177m ($238m).\n\nIn June 2025, it was announced that the 40-year-olds contract had been extended until 2027 after speculation that he was preparing to retire.\n\nIn a post on X, Ronaldo wrote: A new chapter begins. Same passion, same dream. Lets make history together.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13045909/cristiano-ronaldo-wife-1.webp",
            "description": "<p>By BBC News FOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodríguez. She announced the news on social media alongside a picture of a large ring, writing “Yes I do. In this and in all my lives” in her native Spanish. No further details have been shared. Ronaldo, who is the most</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/\">Ronaldo engaged to long-term partner Georgina Rodríguez</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "13 Aug 2025"
        },
        {
            "title": "Daniel Msendami opens Betway Premiership scoring account as Marumo beat Pirates",
            "url": "https://www.newzimbabwe.com/daniel-msendami-opens-betway-premiership-scoring-account-as-marumo-beat-pirates/",
            "content": "By Sports Reporter\n\nWARRIORS midfielder Daniel Msendami was on target Tuesday evening when Marumo Gallants beat Orlando Pirates 2-1 in the second game of South Africas Betway Premiership.\n\nMsendami struck in the 45th minute to cancel Orlando Pirates lead level the game at 1-1 going for the break.\n\nMarumo Gallants came back in the second half and sealed victory through Jaisen Clifford in the 90th minute to record a 2-1 win over Pirates.\n\nTuesdays goal was the first of the season for Zimbabwean striker, who joined the side in July last year from Botswanas Jwaneng Galaxy.\n\nMarumo Gallants is home two three Zimbabweans, the other two being Warriors first choice goalkeeper Washington Arubi and striker Junior Zindoga.\n\nArubi also had a good day in the office as he denied Orlando Pirates several attempts to score a second goal through his super saves.\n\nTuesdays win saw Marumo Gallants going on top of the Betway Premiership with six points after managing two wins in two games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/29053013/Daniel-Msendami-12-scaled-1.webp",
            "description": "<p>By Sports Reporter WARRIORS midfielder Daniel Msendami was on target Tuesday evening when Marumo Gallants beat Orlando Pirates 2-1 in the second game of South Africa’s Betway Premiership. Msendami struck in the 45th minute to cancel Orlando Pirates’ lead level the game at 1-1 going for the break. Marumo Gallants came back in the second</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/daniel-msendami-opens-betway-premiership-scoring-account-as-marumo-beat-pirates/\">Daniel Msendami opens Betway Premiership scoring account as Marumo beat Pirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "13 Aug 2025"
        }
    ]
}