{
    "news": [
        {
            "title": "Warriors in friendly draw against Niger",
            "url": "https://www.newzimbabwe.com/warriors-in-friendly-draw-against-niger/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens team played a one-all draw against Niger in a friendly match played Tuesday at Stade Pere Jego stadium in Morocco.\n\nZimbabwe fielded a new look of the first eleven, different from the one which played Burkina Faso.\n\nMagesi FC goalkeeper, Elvis Chipezeze, made his debut under coach Michael Nees.\n\nYoungster Jonah Fabisch and Tawanda Macheke also enjoyed starting berths in the Warriors lineup.\n\nDesperate to redeem themselves from Fridays 2-0 defeat against Burkina Faso, Zimbabwe managed to find the back of the net in the 9th minute, thanks to Gerald Takwara, who tapped in from the six-yard box.\n\nThe Warriors made several efforts to cushion their lead, but they failed to break Nigers defence, and thus went to the break leading 1-0.\n\nComing back from the break, Nees substituted Chipezeze for third-choice goalkeeper Marley Tavaziva, who marked his international debut.\n\nTavaziva failed to record a clean sheet on debut after conceeding from the spot in the 71stminute as Niger equalised.\n\nThe Warriors could have restored their lead in the 80thminute, but unfortunately, Walter Musonas effort hit the crossbar.\n\nTuesdays draw was the fifth for Michael Nees, who marked his 10thgame in charge of the Warriors.\n\nOf the ten games, Nees has only managed two wins, while the other three ended in defeats.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/11064248/warriors-niger-scaled.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s team played a one-all draw against Niger in a friendly match played Tuesday at Stade Pere Jego stadium in Morocco. Zimbabwe fielded a new look of the first eleven, different from the one which played Burkina Faso. Magesi FC goalkeeper, Elvis Chipezeze, made his debut under coach Michael Nees.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-in-friendly-draw-against-niger/\">Warriors in friendly draw against Niger</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:43",
            "date": "11 Jun 2025"
        },
        {
            "title": "Serial rapist who preyed on female job seekers jailed 80 years",
            "url": "https://www.newzimbabwe.com/serial-rapist-who-preyed-on-female-job-seekers-jailed-80-years/",
            "content": "By Staff Reporter\n\nArapist who targeted female job seekers has been convicted and sentenced to 80 years imprisonment on four counts of rape.\n\nAaron Sanyamahwe (36) of Unit N, Seke, Chitungwiza appeared at Chitungwiza Regional Magistrates Court this week.\n\nIn passing sentence, the court imposed a severe penalty of 20 years per count, with the sentences to run consecutively.\n\nIt was the States case that on diverse occasions, the offender targeted vulnerable young women seeking jobs, posing as an employment agent in order to gain their trust.\n\nCourt heard that Sanyamahwe would lure his victims to secluded locations in the Dema area, where he would blindfold them before moving them to another location, strangulating and violently sexually assaulting them.\n\nIn a statement following Sanyamahwes sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) noted that the jail term sends a clear message that sexual violence will be met with the full force of the law.\n\nNPA further highlighted the devastating impact of rape on survivors while urging job seekers to be vigilant and desist from putting their trust in strangers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter A rapist who targeted female job seekers has been convicted and sentenced to 80 years imprisonment on four counts of rape. Aaron Sanyamahwe (36) of Unit N, Seke, Chitungwiza appeared at Chitungwiza Regional Magistrates Court this week. In passing sentence, the court imposed a severe penalty of 20 years per count, with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/serial-rapist-who-preyed-on-female-job-seekers-jailed-80-years/\">Serial rapist who preyed on female job seekers jailed 80 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:43",
            "date": "11 Jun 2025"
        },
        {
            "title": "Zimbabwe to ban export of lithium concentrates",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-ban-export-of-lithium-concentrates/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE will ban the export of lithium concentrates effective January 2027, as part of efforts to push foreign mining companies to establish processing and refining facilities within the country, cabinet has announced.\n\nIn 2022, Zimbabwe, which has Africas largest lithium reserves, banned the export of unprocessed lithium ore, and since then, only lithium concentrates have been permitted for export.\n\nLithium producers are mandated to process ore into concentrates before export to increase mineral value, create local jobs and boost revenue.\n\nSpeaking during a post-cabinet media briefing Tuesday, Mines Minister Winston Chitando said the government has moved a step further and from January 2027, exporting lithium concentrates will no longer be allowed; only lithium sulphates (a higher level of value addition) will be permitted for export.\n\nWe do have two major players being Bikita and Prospect Lithium Zimbabwe who are in the process of establishing lithium sulphate plants.\n\nThese are value addition facilities which will add value from lithium concentrate to lithium sulphate.\n\nWe are moving to a stage where we are upgrading our lithium production to lithium sulphate which, among other uses, is a direct input into battery making.\n\nSo because of that capacity which is now in the country, the export of all lithium concentrates will be banned from January 2027, Chitando said.\n\nChitando also urged players in the lithium sector to invest in lithium sulphate facilities or collaborate by signing toll treatment agreements ahead of the January 2027 ban on lithium concentrate exports.\n\nSo we would like to take this opportunity to call upon the players in the lithium sector to come together and collaborate so that those who are not undertaking investing in lithium sulphate value addition facilities, sign respective agreements for toll treatment because come January 2027 exports of lithium concentrates will no longer be allowed, he added.\n\nMany African nations have been aiming to make foreign mining firms increase value to their economies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/24130533/Lithium-Mining.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE will ban the export of lithium concentrates effective January 2027, as part of efforts to push foreign mining companies to establish processing and refining facilities within the country, cabinet has announced. In 2022, Zimbabwe, which has Africa’s largest lithium reserves,  banned the export of unprocessed lithium ore, and since then, only</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-ban-export-of-lithium-concentrates/\">Zimbabwe to ban export of lithium concentrates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:43",
            "date": "11 Jun 2025"
        },
        {
            "title": "ZACC arrests three Rusape town council officials",
            "url": "https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers.\n\nThe three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former Council Engineer.\n\nThe trio is charged with violating Section 174 of the Criminal Law (Codification and Reform) Act [Chapter 9:23] after unlawfully reviving and processing a rejected application from Texas Energy Pvt Ltd for a solar power plant in Tsanzaguru.\n\nIn 2018, Texas Energy Pvt Ltd proposed developing a solar power plant in Tsanzaguru, Rusape, but the Ministry of Local Government rejected the proposal due to insufficient land and existing residential zoning.\n\nBetween September and December 2022, the accused unlawfully revived and reprocessed the previously rejected application without adhering to required legal procedures.\n\nOn 28 December 2022, Togarepi Nerwande illegally signed a 99-year lease with Texas Energy, misrepresenting the land as open space suitable for development, despite its designation for residential use.\n\nThe accused deliberately bypassed statutory procedures, including public notification and ministerial approval required for land-use changes, reads ZACCs statement.\n\nThe three appeared at the Mutare Magistrate Court on Tuesday for their initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers. The three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/\">ZACC arrests three Rusape town council officials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:43",
            "date": "11 Jun 2025"
        }
    ]
}