{
    "news": [
        {
            "title": "One Direction’s Zayn Malik and Louis Tomlinson embark on emotional road trip series",
            "url": "https://www.newzimbabwe.com/one-directions-zayn-malik-and-louis-tomlinson-embark-on-emotional-road-trip-series/",
            "content": "IOL\n\nOne Directions former band members, Louis Tomlinson and Zayn Malik, are getting back together for a fun and heartfelt road trip series.\n\nThe three-part documentary, which is set to premiere on Netflix, will show the two stars as they explore America while reflecting on their lives and the tough times theyve faced.\n\nAround a year ago, tragic news struck the music world with the passing of their friend and bandmate Liam Payne.\n\nDuring an emotional tribute on stage, Malik called Payne his brother, and Tomlinson described him as the most vital part of One Direction.\n\nThis series is said to give them a chance to talk more about their special bond with Payne, making it a truly touching experience for fans.\n\nThe untitled docuseries will be directed by Nicola Marsh, who recently did Demi Lovatos Child Star documentary.\n\nThe series has reportedly already started filming and is expected to show the duo reconnecting and going on an adventure across America, including to Maliks home in Pennsylvania.\n\nA statement read: The series is a rare look inside the world of two of the most famous, and most private, men on the planet opening up about life, loss and fatherhood.\n\nWhile fans might hope to see other former bandmates like Harry Styles and Niall Horan, it appears they wont be part of this documentary.\n\nInstead, the series aims to captivate the many One Direction fans all over the world, making it another great addition to Netflixs collection of celebrity documentaries like Victoria, which features former Spice Girls band member and fashion icon, Victoria Beckham and Eddie Murphys Eddie.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05065641/one-direction.png",
            "description": "<p>IOL One Direction’s former band members, Louis Tomlinson and Zayn Malik, are getting back together for a fun and heartfelt road trip series. The three-part documentary, which is set to premiere on Netflix, will show the two stars as they explore America while reflecting on their lives and the tough times they’ve faced. Around a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-directions-zayn-malik-and-louis-tomlinson-embark-on-emotional-road-trip-series/\">One Direction’s Zayn Malik and Louis Tomlinson embark on emotional road trip series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "05 Oct 2025"
        },
        {
            "title": "Parirenyatwa, Mpilo Hospitals go without cancer machines as Treasury stalls funding",
            "url": "https://www.newzimbabwe.com/parirenyatwa-mpilo-hospitals-go-without-cancer-machines-as-treasury-stalls-funding/",
            "content": "By Anna Chibamu\n\nTreasury has delayed the release of US$27.5 million earmarked for the purchase of cancer machines, leaving Zimbabwes two largest referral hospitals, Parirenyatwa Group of Hospitals in Harare and Mpilo Central Hospital in Bulawayo, without life-saving equipment for over three years.\n\nHealth and Child Care Minister Douglas Mombeshora told Parliament this week that despite the Health Ministry having completed procurement paperwork and signed contracts with suppliers, Treasury has yet to pay the required deposit.\n\nAs the Health Ministry, we have awarded tenders to two companies for Parirenyatwa and Mpilo hospitals. All in all, we spent US$27.5 million. We submitted to Treasury papers for them to pay the 30% deposit as per the agreement and in accordance with the suppliers instructions. Contracts have since been signed.\n\nIt is now more than two months since we signed the agreements. Therefore, it is now up to the Ministry of Finance, Economic Development and Investment Promotion to pay for the machines so that they can be installed, said Mombeshora.\n\nHe added that suppliers had promised to install the equipment within 36 weeks, raising hopes that the machines would be operational before the end of the year.\n\nZimbabwe has recorded over 3,000 annual cancer deaths since 2014, according to the National Cancer Registry, with cases of colorectal cancer particularly on the rise. Zaka South MP Clemence Chiduwa raised concern over the lack of facilities for diagnosis.\n\nCancer cases are on the increase and one such cancer is colorectal cancer, which affects people who are mainly above the age of 45. What is the government policy on the prevention and early detection of colon cancer? Do we have any public facilities where we can get colonoscopy services (check-up service for diagnosis)? Chiduwa asked.\n\nMombeshora admitted the health system is under strain. Colon cancer is one of the top cancers in the country, maybe in the top four cancers that are affecting our population, he said.\n\nHe also cited shortages of specialists and diagnostic equipment in district hospitals, noting that government has turned to the Sugar Tax for funding.\n\nAs you may be aware, a Sugar Tax has been introduced to help fund cancer-treating and diagnostic equipment. In Phase 1, we have done tenders for the procurement of treatment equipment and in Phase 2, we are now going to procure diagnostic equipment. Every hospital should have a CT scan, an MRI and an ultrasound scan, Mombeshora said.\n\nOpposition MP for Chiredzi Central, Blessing Ropafadzo Makumire, criticised the delays despite government already collecting the Sugar Tax.\n\nThe Sugar Tax which is supposed to be used for the procurement of cancer machines, started being collected last year in January, yet to date, we have not received any machines that have been procured, which suggests that the government lacks urgency in solving this problem. How long will it take for the government to procure this equipment? What is preventing and causing the delay? Makumire said.\n\nMombeshora responded that US$30.3 million was available as of December 2024 and that procurement would begin with Parirenyatwa and Mpilo, where machines have been down for the past three years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/16072343/Parirenyatwa-Cancer-Treatment-Centre-3.png",
            "description": "<p>By Anna Chibamu Treasury has delayed the release of US$27.5 million earmarked for the purchase of cancer machines, leaving Zimbabwe’s two largest referral hospitals, Parirenyatwa Group of Hospitals in Harare and Mpilo Central Hospital in Bulawayo, without life-saving equipment for over three years. Health and Child Care Minister Douglas Mombeshora told Parliament this week that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parirenyatwa-mpilo-hospitals-go-without-cancer-machines-as-treasury-stalls-funding/\">Parirenyatwa, Mpilo Hospitals go without cancer machines as Treasury stalls funding</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "05 Oct 2025"
        },
        {
            "title": "Zimbabwe abuse victims of John Smyth take legal action against Church of England",
            "url": "https://www.newzimbabwe.com/zimbabwe-abuse-victims-of-john-smyth-take-legal-action-against-church-of-england/",
            "content": "Channel 4\n\nJohn Smyth has been described as the most prolific abuserto be associated with theChurch of England.\n\nHis barbaric beatings of more than a hundred boys and young men in three countries werecovered up for decades.\n\nNow his victims in Zimbabwe are taking legal action against the Church of England to get answers and compensation.\n\nSixteen-year-old Guide Nyachuru attended one of Smyths Christian camps in Zimbabwe in 1992. He never came back alive.\n\nWe first spoke to Guides sister, Edith, in 2017 for an investigation exposing John Smyths abuse. Now shes joining with seven of Smyths Zimbabwean victims to demand compensation from the Church of England.\n\nAn official review by Keith Makin last year accused the Church of England of a cover-up, saying leading figures could have stopped Smyth continuing his reign of abuse in the UK in the early 1980s, before he left for Zimbabwe and South Africa.\n\nA secret report by an Anglican clergyman, Mark Ruston, in 1982 gave a detailed account of the beatings meted out by Smyth. But rather than face justice, Smyth was allowed to leave for Zimbabwe in 1984.\n\nEdith Nyachuru told us that she believed her brother would still be alive if Smyth had been stopped in the UK.\n\nWhen Channel 4 News spoke to Rocky Leanders nearly a decade ago, he had no idea about the scale of Smyths abuse.\n\nNow hes furious after learning how the Church covered it up.He told us: Im now angrier, angry at a much wider, bigger group of people that should have known better.\n\nBoth Rocky and his brother endured barbaric beatings from Smyth at one of his Christian camps. They were left bruised and in pain.\n\nSmyth also insisted on the boys being naked at the summer camps.\n\nWe werent encouraged to be naked, we were forced to be, he said.Its as simple as that.\n\nSmyth would watch the boys showering, and he too would be naked.\n\nIm now angrier, angry at a much wider, bigger group of people that should have known better. Rocky Leanders\n\nIn 1995, Smyth was charged with culpable homicide over Guides death, but the prosecution unravelled. Smyth died in 2018, depriving his victims of answers.\n\nMakin recommended an independent review into Smyths abuse in Zimbabwe. But, nearly a year later, that hasnt happened.\n\nMaybe theyre looking down on us as a third world country. Edith Nyachuru\n\nEdith told us she believes the Church was still covering up the truth now.\n\nI think the Zimbabwean victims have been treated unfairly, she said, adding: Maybe theyre looking down on us as a third world country.\n\nRocky told us bluntly that the Church  in failing to stop Smyth in the UK  was ultimately responsible for at least one death and many, many, many other countless trauma to young boys and young adults and its just despicable.\n\nHe added: Its disgusting.\n\nThe Archbishop of Canterbury, Justin Welby, quit after the Makin review accused him personally of failing to do enough to stop Smyth.\n\nLaw firm Leigh Day is making a legal claim against the Cambridge church, St Andrew the Great, formerly the round church, whose vicar compiled the 1982 report.\n\nThe Zimbabwean victims and their families still struggle with the legacy of Smyths barbaric abuse.\n\nRocky told us the emotional toll is now significant and that he had lost trust in religion  and humanity as a whole  because people who were in a position of trust have abused that trust.\n\nGuides family are still haunted by his death. Edith said she believed Smyth was rotting in hell.\n\nThe new Archbishop of Canterbury, Sarah Mullally, was announced yesterday. Nearly a year after Justin Welby quit  leaving the organisation he led in crisis  she will immediately face troubling questions about the way victims have been treated.\n\nWe werent encouraged to be naked, we were forced to be. Rocky Leanders\n\nA Church of England spokesperson said: We are truly sorry for the horrendous abuse carried out by John Smyth and the lifelong effects on survivors, both here and in Africa. The Church in South Africa has already carried out its own review. We have been in contact with the Church in Zimbabwe and offered to support and contribute financially to any review that it might choose to undertake, building on the review undertaken by David Coltart in 1993.\n\nThe Church of England is working through the recommendations in its own learning lessons review. The National Safeguarding Team has taken out complaints under the Clergy Discipline Measure against a number of clergy criticised in the review. That process is ongoing.\n\nA spokesperson for St Andrew the Great Church in Cambridge said: We are full of sorrow about the horrendous abuse carried out by John Smyth which has had lifelong effects on survivors, both here and in Africa, and that he was not stopped sooner.\n\nWhile we are unable to comment on the specifics of this claim, we take the safety and wellbeing of our congregation, staff and volunteers extremely seriously and follow Church of Englands Safeguarding Policy and Practice Guidance designed to protect vulnerable people.\n\nIf anyone has been affected by this issue and wants to talk to someone independently, please call the Safe Spaces helpline on 0300 303 1056 or visit safespacesenglandandwales.org.uk. Further support is also available via contacts on our safeguarding webpage.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14162502/guide-nyachuru.jpg",
            "description": "<p>Channel 4 John Smyth has been described as the most prolific abuser to be associated with the Church of England. His barbaric beatings of more than a hundred boys and young men in three countries were covered up for decades. Now his victims in Zimbabwe are taking legal action against the Church of England to get answers and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-abuse-victims-of-john-smyth-take-legal-action-against-church-of-england/\">Zimbabwe abuse victims of John Smyth take legal action against Church of England</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "05 Oct 2025"
        },
        {
            "title": "Cabinet ministers snub Senate, Question Time abandoned",
            "url": "https://www.newzimbabwe.com/cabinet-ministers-snub-senate-question-time-abandoned/",
            "content": "By Anna Chibamu\n\nSenate business was disrupted Thursday after cabinet ministers failed to turn up for the weekly Question and Answer session, with only one deputy minister present in the chamber.\n\nAccording to Senate Standing Orders, ministers are required to attend the session to respond to questions on government policy. However, Deputy President of the Senate, Retired General Michael Nyambuya, was left with no choice but to cancel the session.\n\nNyambuya ruled that the upper house would proceed with debating motions instead of abandoning the days business altogether.\n\nIt is sad and very unfortunate that this August House is being treated in such a contemptuous manner and yet it is august, it is elected by the people to do our job, but we cannot do our oversight role if we do not have Ministers to question them on policy issues.\n\nThat being the case, I agree that we abandon the Question Time but not go home. Let us debate some of our motions, one or two motions, in lieu of the Question Time.\n\nThe Clerk is going to bring this to the attention of the relevant authorities through a letter, which will be signed by the head of Parliament, again. So, we move away from Questions with Notice and Without Notice, Nyambuya said.\n\nEarlier, he had sought senators views on how to proceed: Hon. Senators, we have one deputy minister. Can I have your proposed way forward? I need not repeat that this is tantamount to treating the Senate with contempt. Any proposed way forward? Do you think we should do away with the question time?\n\nZanu PF Mashonaland East senator Conrad Jericho Gotora expressed frustration, suggesting the sitting be adjourned.\n\nWe have not seen the senior ministers in this august House. Hon. Eng. Makwiranzou and Hon. Phuti are junior Ministers but they do respect this House. They always come in this august House.\n\nMy suggestion is that may we adjourn this House and go home because according to the Order Paper there are questions that date back to many, many days and months. We do not understand why we are sitting here whilst those who are supposed to work with us do not respect us.\n\nYesterday, they were fully present in the National Assembly Chamber but today they are not here. We only have two Deputy Ministers who respect us and always come. May we go and rest like what they are doing? Gotora said.\n\nOpposition senator Nonhlanhla Mlotshwa supported him, while Zanu PFs Irene Zindi fumed: Cabinet ministers are undermining the Senate Chamber because they do not come to the House.\n\nWhen we have questions concerning the development of the country, do not come. We only see Ministers like Hon. Mhona and the deputy ministers.\n\nSo, it is a plea and we are not happy that we cannot go forward. We cannot go on without Ministers in this august House?\n\nChief Ndiweni also urged action to compel ministers to take Senate seriously.\n\nNyambuya later noted that several ministers and deputies had tendered apologies, including Vice Presidents Constantino Chiwenga and Kembo Mohadi, Finance Minister Mthuli Ncube, Defence Minister Oppah Muchinguri-Kashiri, and several others.\n\nThe repeated absence of cabinet ministers from both the National Assembly and Senate has become a growing concern for legislators. Speaker of Parliament Jacob Mudenda has since escalated the matter to the highest office in government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29152508/new-parliament-2.png",
            "description": "<p>By Anna Chibamu Senate business was disrupted Thursday after cabinet ministers failed to turn up for the weekly Question and Answer session, with only one deputy minister present in the chamber. According to Senate Standing Orders, ministers are required to attend the session to respond to questions on government policy. However, Deputy President of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cabinet-ministers-snub-senate-question-time-abandoned/\">Cabinet ministers snub Senate, Question Time abandoned</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "05 Oct 2025"
        },
        {
            "title": "Ngezi Platinum Coach slaps player during Dynamos clash",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-coach-slaps-player-during-dynamos-clash/",
            "content": "By Sports Reporter\n\nNgezi Platinum Stars coach, Takesure Chiragwi, has sparked outrage after he slapped one of his players during Saturdays Castle Lager Premier Soccer League clash against Dynamos at Rufaro Stadium.\n\nThe incident occurred after referee Lawrence Zimondi gave him a red card for protesting his decision.\n\nIn a heated moment, midfielder McDonald Makuwe attempted to calm his coach, only to be struck across the face.\n\nFootage of the altercation has since gone viral on social media, drawing widespread condemnation and raising questions over Chiragwis conduct.\n\nThe Premier Soccer League has since requested an incident report from the club.\n\nNgezi Platinums third red card came three minutes before halftime after a defender was given marching orders for disturbing an obvious goal-scoring opportunity when he fouled striker Jairos Kasondo at the edge of the box.\n\nDespite going one man down, Ngezi Platinum Stars fought through the whole match to salvage a point as it ended 1-1.The coachs actions come just a week after the Premier Soccer League handed Yadah FC board member Spencer Muvadi a suspension for assaulting his clubs goalkeeper, Godknows Gurure, in August.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05054452/takesure-chiragwi.jpeg",
            "description": "<p>By Sports Reporter Ngezi Platinum Stars coach, Takesure Chiragwi, has sparked outrage after he slapped one of his players during Saturday’s Castle Lager Premier Soccer League clash against Dynamos at Rufaro Stadium. The incident occurred after referee Lawrence Zimondi gave him a red card for protesting his decision. In a heated moment, midfielder McDonald Makuwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-coach-slaps-player-during-dynamos-clash/\">Ngezi Platinum Coach slaps player during Dynamos clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "05 Oct 2025"
        }
    ]
}