{
    "news": [
        {
            "title": "Armed robbers make off with US$1 million, gold",
            "url": "https://www.newzimbabwe.com/armed-robbers-make-off-with-us1-million-gold/",
            "content": "By Mary Taruvinga\n\nArmed robbers made off with over US$1 million in separate robberies which took place in Mt Darwin and Bulawayo in the last two days, according to the Zimbabwe Republic Police.\n\nThe first incident occurred at an unnamed bank in Mt. Darwin on June 26, 2025.\n\nThe incident occurred around 0200 hours.\n\nThree unknown suspects, armed with pistols, pounced on the bank, attacked the security guard who was on duty at the premises and then broke into the bank, where they blasted open a safe and stole approximately USD700,000 and 2.4 kilogrammes of gold, said police spokesperson Paul Nyathi in a statement.\n\nIn another case, police in Bulawayo are investigating a robbery that occurred at Old Nick Mine on June 25, 2025.\n\nNyathi said three unknown suspects, who were armed with pistols, pounced on the companys offices and attacked three complainants who were present.\n\nThe suspects stole US$520,000 and two cell phones.\n\nMore detailed information regarding the two cases will be released this Friday, Nyathi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/07065619/Armed-robberry.jpg",
            "description": "<p>By Mary Taruvinga Armed robbers made off with over US$1 million in separate robberies which took place in Mt Darwin and Bulawayo in the last two days, according to the Zimbabwe Republic Police. The first incident occurred at an unnamed bank in Mt. Darwin on June 26, 2025. The incident occurred around 0200 hours. “Three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/armed-robbers-make-off-with-us1-million-gold/\">Armed robbers make off with US$1 million, gold</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "27 Jun 2025"
        },
        {
            "title": "Stigma, discrimination remain the most damaging barriers to Zimbabwe’s HIV response – Health Minister",
            "url": "https://www.newzimbabwe.com/stigma-discrimination-remain-the-most-damaging-barriers-to-zimbabwes-hiv-response-health-minister/",
            "content": "By Anna Chibamu\n\nSTIGMA and discrimination remain the most damaging barriers to the countrys national HIV response, Health and Child Care Minister Douglas Mombeshora has said.\n\nAddressing journalists at a Zimbabwe National Network of People Living with HIV (ZNNP+) breakfast meeting in Harare this Thursday, Mombeshora said stigma discouraged vital actions meant to reduce the spread and treatment of HIV.\n\nThe stigma index 2.0 has risen to 69.7% from 65% between 2018 and 2023.\n\nStigma and discrimination remain among the most damaging barriers to Zimbabwes national HIV response.\n\nFor people living with HIV, the impact goes beyond emotional distress. It is structural and systemic. Stigma, isolated individuals, erode their self-worth and discourage vital actions like HIV testing, disclosure and adherence to treatment.\n\nDiscrimination in families, workplaces, health care settings and communities creates fear and silence that allow the virus to spread unchecked, Mombeshora said.\n\nOur collective commitment must be to build a pathway where every person living with HIV is treated with dignity, respect and compassion, free from judgment and fully supported to live a healthy, productive life.\n\nThe minister reported that the World Health Organisation emphasised that quality health care involved not only medicines, access, but also dignity, equity and inclusivity.\n\nDiscrimination in health care, such as segregated queues, bridges of confrontation or denial of care, atomised public trust, discourages service use and perpetuates inequities.\n\nResearch shows internalised stigma leads to shame, isolation, depression and loss of obesity, which reduce mental wellbeing and deter engagement with HIV services, the minister told the media.\n\nHe warned that fear of judgment causes delayed care, increasing risks of late diagnosis and treatment failure, undermining individual and public health.\n\nMombeshora commended the ZNNP+ for playing a pivotal role in shaping the countrys national HIV response.\n\nYou share public awareness, foster accountability and encourage dialogue that informs everything best decisions. You are not only merely conveyors of information, you are agenda setters, influencers of public sentiment and advocates for justice. Your voices are essential to advancing health equity, dispelling myths and amplifying the resilience of those affected by HIV.\n\nTo date, Zimbabwe has 1.3 million Zimbabweans living with HIV and over 96% are accessing life-saving antiretroviral therapy.\n\nWe have reached the UNAs 95-95-95 targets ahead of schedule, a milestone reflecting our strong infrastructure, committed healthcare workers and effective multi-sector collaboration.\n\nThe countrys gains on HIV remain fragile, according to Mombeshora.\n\nOur gains remain fragile. Between January and June this year, Zimbabwe recorded 5,932 AIDS-related deaths compared to 5,712 in the same period in 2024, an increase of 220 deaths. Reminding us, our work is still not done.\n\nThis rise is not due to partial withdrawal of partner support. By the time key partners like the US government withdrew some funding, our institutions had adequate ARR fees and supplies.\n\nThe minister highlighted that Zimbabwes systems had shown resilience and continued to monitor closely to ensure uninterrupted treatment.\n\nThe government has mobilised domestic resources through SIM taxes on alcohol, tobacco, sugar drinks at the AIDS level to protect ARR fees, stockpiles and maintain service continuity.\n\nThe Finance Ministry is reinforcing but in allocations, while we engage strategic partners to close funding gaps.\n\nWe must, however, be candid. The transition to full domestic financing introduces complex challenges, said the Minister.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Anna Chibamu STIGMA and discrimination remain the most damaging barriers to the country’s national HIV response, Health and Child Care Minister Douglas Mombeshora has said. Addressing journalists at a Zimbabwe National Network of People Living with HIV (ZNNP+) breakfast meeting in Harare this Thursday, Mombeshora said stigma discouraged vital actions meant to reduce the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stigma-discrimination-remain-the-most-damaging-barriers-to-zimbabwes-hiv-response-health-minister/\">Stigma, discrimination remain the most damaging barriers to Zimbabwe’s HIV response – Health Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "27 Jun 2025"
        },
        {
            "title": "Chevrons to host Sri Lanka in white-ball series",
            "url": "https://www.newzimbabwe.com/chevrons-to-host-sri-lanka-in-white-ball-series/",
            "content": "By Sports Reporter\n\nZimbabwe Cricket (ZC) has announced Sri Lanka will be in the countrylater this year for a white-ball series to be played at Harare Sports Club.\n\nThe upcoming tour features two One-Day Internationals scheduled for 29 and 31 August, followed by three Twenty20 Internationals on 3, 6 and 7 September.\n\nWe are delighted to confirm Sri Lankas visit to Zimbabwe for what we expect to be a thrilling and competitive series, said Zimbabwe Cricket managing director Givemore Makoni.\n\nZimbabwe will use the T20I games as part of preparations for the ICC Mens T20 World Cup Africa Regional Finals which they will host from September 19 to October 4.\n\nMatches between our two nations have always produced entertaining cricket and this tour comes at a crucial time for our team as we prepare for the upcoming T20 World Cup qualifying campaign, added Makoni.\n\nThe top two teams from the ICC Mens T20 World Cup Africa Regional Finals will qualify for the 2026 World Cup which will be jointly hosted by India and Sri Lanka.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/15041235/sri-lanka-zim-cricket.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe Cricket (ZC) has announced Sri Lanka will be in the country later this year for a white-ball series to be played at Harare Sports Club. The upcoming tour features two One-Day Internationals scheduled for 29 and 31 August, followed by three Twenty20 Internationals on 3, 6 and 7 September. “We are delighted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-host-sri-lanka-in-white-ball-series/\">Chevrons to host Sri Lanka in white-ball series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "27 Jun 2025"
        },
        {
            "title": "Kirsty Coventry: IOC President says female category has to be protected",
            "url": "https://www.newzimbabwe.com/kirsty-coventry-ioc-president-says-female-category-has-to-be-protected/",
            "content": "BBC Sport\n\nKirsty Coventry, the new president of the International Olympic Committee, says its members have shown overwhelming support to protecting the female category in sport.\n\nIn a significant shift in policy, she said the IOC must play a leading role in discussions on gender eligibility.\n\nAt her first news conference since taking over the role earlier this week, the Zimbabwean revealed a working group on the issue made up of experts and international federations would ensure that we find consensus.\n\nThe IOC has previously left gender regulations to the governing bodies of individual sports rather than applying a universal approach.\n\nBut having become the first woman to hold the IOC presidency, 41 year-old Coventry said its members now wanted to develop a policy to come up with cohesion.\n\nHowever, Coventry also hinted that no retrospective action would be taken over the controversial boxing tournament at last years Paris Olympics, when the IOCs handling of gender rules came under intense scrutiny.\n\nFollowing a first meeting of her executive board, Coventry added, We understand that therell be differences depending on the sport but it was very clear from the members that we have to protect the female category, first and foremost to ensure fairness.\n\nBut we need to do that with a scientific approach and the inclusion of the international federations who have already done a lot of work in this area.\n\nDuring her election campaign, former swimmer Coventry  a seven-time Olympic medalist  pledged to introduce a blanket ban on transgender women competing in female Olympic competition.\n\nIn recent years a growing number of sports federations have barred athletes who have undergone male puberty from competing in elite female competition amid concerns over fairness and safety.\n\nHowever, in other sports, transgender women are still able to compete in womens events at the Olympics.\n\nThe IOC was engulfed in controversy at the Paris Games last summer when Algerias Imane Khelif won the womens welterweight boxing gold medal  a year after being disqualified from the World Championships for reportedly failing a gender eligibility test.\n\nThe IOC cleared the 25-year-old to compete  along with Taiwans Lin Yu-ting  who was also banned by the suspended International Boxing Association (IBA). The IOC said competitors were eligible for the womens division if their passports said they were female.\n\nBoth fighters insist they are women, have always competed in the womens division, and there is no suggestion they are transgender.\n\nSome reports took the IBA stating that Khelif has XY chromosomes to speculate that the fighter might have differences of sexual development (DSD), like runner Caster Semenya. However, the BBC has not been able to confirm whether this is or is not the case.\n\nLast year, the World Boxing Organisation (WBO) said reports it had stripped Khelif of the Paris gold medal for failing gender eligibility tests were obviously false.\n\nWhen asked if her working group could apply any retrospective action, Coventry said, Were not going to be doing anything retrospectively. Were going to be looking forward. From the members [it] was what are we learning from the past, and how are we going to leverage that and move that forward to the future?'\n\nEarlier this month, World Boxing said mandatory sex testing would be introduced in July to ensure the safety of all participants and deliver a competitive level playing field for men and women. It followsWorld Athletics which has also approved the introduction of a swab testto determine if an athlete is biologically female.\n\nWhen asked if she endorsed such a policy, and if the IOC could also adopt it, Coventry said, Its too early to pre-empt the medical experts.\n\nIt was very clear from the membership the discussion around this has to be done with medical and scientific research at the core, so we are looking at the facts and the nuances and the inclusion of the international federations that have done so much of this workhaving a seat at table and sharing with us because every sport is different.\n\nBut it was pretty much unanimously felt that the IOC should take a leading role in bringing everyone together to try and find a broad consensus.\n\nIn February, the president of the International Paralympic Committee told BBC Sport thathe is opposed to blanket solutionsfor transgender participation policies.\n\nAndrew Parsons was speaking after United States president Donald Trump signed an executive order that prevents transgender women from competing in female categories of sports. He said he would deny visas to transgender athletes seeking to compete in female categories at the Los Angeles Olympic Games in 2028.\n\nCoventry said the IOC also planned to set up a second working group looking at when Olympic host cities should be named.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20181137/kirsty-IOC-scaled.jpeg",
            "description": "<p>BBC Sport Kirsty Coventry, the new president of the International Olympic Committee, says its members have shown “overwhelming support” to protecting the female category in sport. In a significant shift in policy, she said the IOC must “play a leading role” in discussions on gender eligibility. At her first news conference since taking over the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kirsty-coventry-ioc-president-says-female-category-has-to-be-protected/\">Kirsty Coventry: IOC President says female category has to be protected</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "27 Jun 2025"
        },
        {
            "title": "Lack of funding dampens elephant conservation efforts – ZimParks",
            "url": "https://www.newzimbabwe.com/lack-of-funding-dampens-elephant-conservation-efforts-zimparks/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has said the lack of funding to manage elephants in its game reserves is negatively impacting elephant conservation efforts, leading to increased human-wildlife conflict.\n\nThe authority is working with a budget of US$500,000 at its biggest game reserve, Hwange National Park, against the required US$21 million to manage the ever-increasing elephant population.\n\nZimParks recently hosted a review and updating workshop on the Zimbabwe Elephant Management Plan (2021-2025) to assess implementation of the plan, emerging issues, evaluate management approaches, and exploring effective strategies from past experiences which was for the first time attended by chiefs from Hwange.\n\nIn a statement issued on Thursday, ZimParks spokesperson Tinashe Farawo said chiefs complained that their affected communities have not benefited from their proximity to the wildlife.\n\nThe chiefs expressed their concerns on the lack of tangible benefits for communities who bear the brunt of sharing borders with elephants and a relief fund for injured community people.\n\nThe traditional leaders expressed concerns over the ongoing poverty faced by these communities, worsened by crop raiding, resource competition, and incidents of injury and property damage caused by elephants, he said.\n\nThe increased elephant populations and localised overabundance have resulted in increased human-elephant conflicts.\n\nAccording to Farawo, while this is happening, ZimParks efforts to curb the crisis are dampened by a lack of resources.\n\nThe countrys elephant conservation efforts are severely under-financed, with the current budget for Hwange National Park falling below US$500,000 annually, compared to the estimated US$21 million required based on management costs in other well-managed protected areas in Southern Africa, he said.\n\nFarawo also said sustainable utilisation is hindered by various factors, including global trade restrictions.\n\nMeanwhile, while elephant poaching for ivory has declined, effective partnerships have played a vital role in enhancing conservation efforts.\n\nFarawo said elephant conservation requires collective efforts from all stakeholders.\n\nZimbabwe has the second-largest elephant population in the world, with an estimated 82,000 elephants.\n\nWhile Zimbabwe is lauded for its conservation efforts, the elephant population is growing faster than the environment can sustain, leading to human-wildlife conflict and habitat degradation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/25193036/Zimbabwe-Elephants.png",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority  (ZimParks) has said the lack of funding to manage elephants in its game reserves is negatively impacting elephant conservation efforts, leading to increased human-wildlife conflict. The authority is working with a budget of US$500,000 at its biggest game reserve, Hwange National Park, against the required</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lack-of-funding-dampens-elephant-conservation-efforts-zimparks/\">Lack of funding dampens elephant conservation efforts – ZimParks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "27 Jun 2025"
        },
        {
            "title": "High Court gives Leengate 30-day ultimatum to vacate encroached land at Rainham Farm",
            "url": "https://www.newzimbabwe.com/high-court-gives-leengate-30-day-ultimatum-to-vacate-encroached-land-at-rainham-farm/",
            "content": "By Mary Taruvinga\n\nLocal property developer Leengate (Private) Limited has been ordered by the High Court to vacate within 30 days land on which quarrying operations were taking place at Rainham Farm after it emerged that the company encroached on someones property.\n\nLeengate was being sued by Mitchell Corporation Private Limited for encroaching on its Stand No 643.\n\nIn the present application, Mitchell Corporation applied for a summary judgment in an action for eviction and removal of structures.\n\nAccording to the applicant, Leengate or its agents erected buildings or other structures on the applicants land without any legal right, permission, or lease agreement.\n\nMitchell Corporation sought a summary order for the ejectment of Leengate and anyone claiming through it from the property, as well as the demolition or removal of all structures erected on the land.\n\nLeengate wanted the matter to go to a full trial.\n\nThe second respondent, Zvimba Rural District Council, is the local authority for the area; it was cited given its administrative interest in the land, though no specific relief beyond its formal citation is sought against it.\n\nLeengate denied having encroached into Mitchell Corporations land and claimed that one LLH Engineering Projects (Pvt) Ltd  is the true occupier/builder on the land in question.\n\nLeengate claimed that the applicant sued the wrong party.\n\nZvimba RDC did not file any opposing affidavit and took a neutral position, indicating it will abide by the Courts decision.\n\nAfter hearing the parties High Court judge, Justice Joel Mambara, ruled in favour of the applicant and ordered Leengate and its agents out before slapping the developer with costs on a legal practitioner-client scale.\n\nThe judge said it was noteworthy that Leengate provided virtually no detail about LLH Engineering Projects (Pvt) Ltd, apart from naming it as the alleged occupier.\n\nThe opposing affidavit does little more than assert the structures belong to LLH, not us. It does not explain the relationship (if any) between the first respondent and LLH Engineering  for example, whether LLH is a completely independent third party that coincidentally built on Stand 643, or perhaps a subcontractor or business partner of the first respondent in the Rainham development project.\n\nThe first respondent did not tender any affidavit from LLH Engineering, nor any documentary proof (such as an agreement, a council lease, or correspondence) indicating that LLH Engineering was authorised by the Council or anyone else to build on Stand 643. One would expect that if LLH Engineering truly and independently moved onto Stand 643, the first respondent could at least describe how that came about  especially since Leengate itself is involved in development projects in the same locale (indeed, the Rainham Park housing development has been linked to Leengate in the background).\n\nThe stark absence of any supporting detail or third-party confirmation raises serious doubt about the genuineness of this defence, said the judge.\n\nMambara said Leengates mere pointing of the finger at a non-party, without more, is arguably the kind of bald or sketchy averment that fails to pass muster as a bona fide defence.\n\nIt is therefore an appropriate exercise of this Courts discretion to order costs against the first respondent on the legal practitioner and client scale.\n\nSuch an order ensures that the applicant is more fully indemnified for the legal expenses it incurred due to the first respondents conduct, and it serves as a rebuke of the first respondents abuse of the court process.\n\nThe applicant should not be out of pocket for having to chase a party that had no valid defence and yet refused to concede.\n\nMambara said the applicant met the requirements for summary judgment, and the first respondent has failed to establish a bona fide defence or triable issue.\n\nThe first respondent, Leengate (Private) Limited, and all persons claiming occupation through the first respondent, be and are hereby ejected from Stand 643 Rainham Farm, Zvimba District, Mashonaland West.\n\nThis eviction encompasses the removal of any employees, contractors, agents, or associates of the first respondent, and includes any other entity (such as LLH Engineering Projects (Pvt) Ltd) or persons who occupy the property under or through the authority of the first respondent.\n\nThe first respondent shall, within 30 days of service of this order upon it, remove all structures, buildings, materials, plant, equipment and installations that it or anyone acting on its behalf (or through it) has erected or placed on Stand 643 Rainham Farm.\n\nThe removal shall be carried out safely and without avoidable damage to the land, and the site shall be restored, as far as reasonably possible, to its original condition prior to the first respondents occupation, said the judge.\n\nMambara also ruled that in the event that Leengate or those claiming occupation through it have not vacated the property or have not fully complied with paragraph 2 within the stipulated 30-day period, the Sheriff of the High Court or his lawful Deputy is hereby authorised and directed to evict the first respondent and any other unlawful occupiers from Stand 643 Rainham Farm.\n\nThe Sheriff was further authorised and directed to demolish, dismantle and/or remove any structures or materials remaining on the property that were erected or placed thereon by the first respondent or its agents, and to restore possession of the property to the applicant.\n\nHe said the Sheriff may enlist the assistance of the Zimbabwe Republic Police and/or the second respondent (Zvimba Rural District Council) to the extent necessary to carry out this order and ensure compliance in a peaceful and safe manner.\n\nThe RDC was ordered to cooperate with and facilitate the enforcement of this order to the extent that any administrative action or permission on its part is required.\n\nDuring the hearing, in support of its claim, the applicant proved that for instance, in mid-2024 when the encroachment was discovered, communications were exchanged involving the council and the first respondent.\n\nNotably, an email dated 15 July 2024 from the Council addressed to the applicant and copied to a representative of the first respondent (one K. Bhunu)  confirmed that a council inspection had found a durawall (boundary wall) built by the occupier of adjacent Stand 179 was indeed encroaching onto the applicants Stand 643.\n\nThe Council in that email reported the encroachment and indicated that the occupier of Stand 179 had been instructed to rectify the anomaly (remove or realign the wall).\n\nThe following day, 16 July 2024, the applicants legal practitioners sent a letter of demand to Leengate formally complaining of the encroachment.\n\nIn response, by 27 July 2024, Leengates legal practitioners replied in writing  effectively acknowledging the encroachment and proposing a resolution.\n\nIn that letter, Leengates lawyers confirmed they also represented LLH Engineering Projects (Pvt) Ltd (a company closely associated with the first respondent) and explained that these two companies held the adjacent Stands 179 and 644, with the applicants Stand 643 lying between them.\n\nThe letter further indicated that those entities were operating a quarry on Stand 179 and proposed a compromise arrangement: they suggested a re-pegging (boundary adjustment) that would reduce the applicants land in order to cure the encroachment, with the first respondent financing the re-survey, or alternatively an outright purchase of Stand 643 from the applicant.\n\nIn essence, Leengate at that stage offered to compensate for or eliminate the encroachment by realigning property boundaries or buying the land, implicitly conceding that an encroachment had occurred.\n\nDespite these discussions and the first respondents written undertakings to rectify the situation, nothing was actually done on the ground to remove the offending structures or resolve the issue.\n\nEventually, frustrated by the lack of concrete remedial action, the applicant issued a summons out of this Court (leading to the present proceedings).\n\nLeengates plea to the summons, however, painted a very different picture.\n\nIn its plea, Leengate denied that it was encroaching on the applicants land  offering little more than bare denials, and notably made no mention of LLH Engineering or the earlier communications and admissions.\n\nAfter the applicant filed this summary judgment application, in its opposing affidavit to the application, Leengate then raised the new defence that LLH Engineering Projects (Pvt) Ltd, not Leengate, was the party responsible for the structures on Stand 643.\n\nThe court said this shift in position  from tacitly acknowledging encroachment and attempting a compromise, to later denying any responsibility and blaming a third party marred Leengates defence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga Local property developer Leengate (Private) Limited has been ordered by the High Court to vacate within 30 days land on which quarrying operations were taking place at Rainham Farm after it emerged that the company encroached on someone’s property. Leengate was being sued by Mitchell Corporation Private Limited for encroaching on its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-gives-leengate-30-day-ultimatum-to-vacate-encroached-land-at-rainham-farm/\">High Court gives Leengate 30-day ultimatum to vacate encroached land at Rainham Farm </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "27 Jun 2025"
        }
    ]
}