{
    "news": [
        {
            "title": "UK gospel singer Chahwanda charged with further offences as part of sexual offences investigation",
            "url": "https://www.newzimbabwe.com/uk-gospel-singer-chahwanda-charged-with-further-offences-as-part-of-sexual-offences-investigation/",
            "content": "UNITED KINGDOM-based gospel musician and pastor Walter Chahwanda has been charged with ten additional offences as part of an ongoing sexual offences investigation.\n\nChahwanda (33) of Plemonstall Court, remains in custody on remand. He was previously arrested by Merseyside Police detectives on 13 March 2025 and 27 February 2024.\n\nHe was initially charged with eleven offences in March 2025, as follows:RapeAssault by penetrationCyber flashingFive offences of Sexual activity with a female aged 13-15yrsSexual communication with a childCause a child to watch an image of sexual activityBlackmail\n\nAs part of this investigation, ten further charges have now been authorised as follows, involving multiple victims:BlackmailTwo counts of engaging in sexual communications with a childSix counts of Malicious communicationsCause a child to view a sexual act\n\nChahwanda will remain in custody to appear on trial in September.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/11152727/Walter-Chahwanda.webp",
            "description": "<p>UNITED KINGDOM-based gospel musician and pastor Walter Chahwanda has been charged with ten additional offences as part of an ongoing sexual offences investigation. Chahwanda (33) of Plemonstall Court, remains in custody on remand. He was previously arrested by Merseyside Police detectives on 13 March 2025 and 27 February 2024. He was initially charged with eleven</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-gospel-singer-chahwanda-charged-with-further-offences-as-part-of-sexual-offences-investigation/\">UK gospel singer Chahwanda charged with further offences as part of sexual offences investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jun 2025"
        },
        {
            "title": "Boy’s mutilated body found with missing parts in suspected ritual killing",
            "url": "https://www.newzimbabwe.com/boys-mutilated-body-found-with-missing-parts-in-suspected-ritual-killing/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland West have arrested a 32-year-old Chinhoyi man for allegedly killing a boy before removing some body parts suspectedly for rituals.\n\nThe mutilated body was found with the stomach ripped open and the genitals were missing.\n\nThe discovery was made on Monday, leading to the arrest of Lloyd Gwenhere of Chogi farm, Inyathi, Chinhoyi.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector Ian Kohwera confirmed the gory incident.\n\nCID Chinhoyi arrested Lloyd Gwenhere aged 32, in connection with a case of murder which occurred at Chogi Farm, Inyathi in Chinhoyi, said Kohwera.\n\nThe victim, Munyaradzi Shumba (9), was found dead with a ripped stomach. The neck and left hand were cut, while the victims private parts were missing.\n\nAccording to police, the suspect was allegedly spotted assaulting the victim for letting cattle stray onto his field.\n\nCircumstances are that on June 8, 2025, the deceased was harvesting grains with his grandfather, Isaac Shumba (70) when he was ordered to take over herding cattle from his sister, aged 10, at around 1500 hours.\n\nAt around 1600hrs, elder Shumba sent his daughter, Vongai Shumba (29), to look for Munyaradzi so that he could bring cattle to pull a cart laden with harvested grains.\n\nVongai failed to locate Munyaradzi, prompting her and her father to collect the grain up to around 1700 hours, but Munyaradzi was still nowhere to be found, leading to a search.\n\nA neighbour, Tariro Kwangwari, later told the family that she had witnessed the accused person assaulting the boy before sunset for letting cattle graze on his field.\n\nSearches were conducted by family members and other villagers around the area where the suspect had been seen assaulting the deceased, but they found only his rafters and a pool of blood, said Kohwera.\n\nA further search the next morning unearthed the grisly find of the mutilated body tucked in the grass about 15 metres from the point where the juvenile was allegedly assaulted.\n\nGwenhere was immediately arrested and is helping police with investigations.\n\nInvestigations are underway to establish the cause of the death in a case suspected to be ritual murder. The general public is urged to respect the sanctity of life, said the police spokesman.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter POLICE in Mashonaland West have arrested a 32-year-old Chinhoyi man for allegedly killing a boy before removing some body parts suspectedly for rituals. The mutilated body was found with the stomach ripped open and the genitals were missing. The discovery was made on Monday, leading to the arrest of Lloyd Gwenhere of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boys-mutilated-body-found-with-missing-parts-in-suspected-ritual-killing/\">Boy’s mutilated body found with missing parts in suspected ritual killing </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jun 2025"
        },
        {
            "title": "State drops charges against Mpofu, Chimombe in US$9 million streetlights scandal",
            "url": "https://www.newzimbabwe.com/state-drops-charges-against-mpofu-chimombe-in-us9-million-streetlights-scandal/",
            "content": "By Mary Taruvinga\n\nThe state on Wednesday dropped charges against businessmen Moses Mpofu and Mike Chimombe who were accused of swindling the Harare City Council US$9 million in a botched streetlights tender.\n\nWhisper Mabhaudhi, representing the National Prosecuting Authority (NPA) withdrew the charges against the two before plea without giving reasons for the States decision.\n\nTrial was due to commence before High Court judge Justice Benjamin Chikowero.\n\nThe state was accusing the two of misrepresenting their credentials to secure the tender.\n\nThe state further alleged that the two submitted that they had the specific required experience by falsely claiming they had undertaken light bulb installations in the Harare CBD.\n\nIt was also alleged that they lied that they had previously installed Christmas lights for the City of Harare.\n\nThe state alleged the two provided unregistered audit documents to bolster their application.\n\nAfter being awarded the tender, Mpofu signed as the managing director of Juluka, their company at the centre of the controversy, while Chimombe validated the documents.\n\nThe action facilitated the release of US$260,000 as part payment for the alleged services.\n\nCommenting on the latest development, their lawyers said the States case was too weak.\n\nIm certain the state just realised that its case against our clients was too weak, said Chimombes lawyer Ashiel Mugiya.\n\nThe withdrawal of the charges by the state is a welcome development.\n\nOur clients are on record regarding the weakness of the state case and that the charges they are facing are trumped up, baseless and unfounded. They have no case to answer.\n\nIt is only unfortunate that such withdrawal happens after all this long and after the long pre-trial incarceration for so long, said Advocate Tapson Dzvetero, representing Mpofu.\n\nThe partners still have one more pending criminal case currently being heard before High Court judge Justice Pisirayi Kwenda.\n\nIn this case, they are accused of defrauding the state of US$7 million in a presidential goats pass on project.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga The state on Wednesday dropped charges against businessmen Moses Mpofu and Mike Chimombe who were accused of swindling the Harare City Council US$9 million in a botched streetlights tender. Whisper Mabhaudhi, representing the National Prosecuting Authority (NPA) withdrew the charges against the two before plea without giving reasons for the State’s decision.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/state-drops-charges-against-mpofu-chimombe-in-us9-million-streetlights-scandal/\">State drops charges against Mpofu, Chimombe in US$9 million streetlights scandal </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jun 2025"
        },
        {
            "title": "Ranger dies after rhino attack",
            "url": "https://www.newzimbabwe.com/ranger-dies-after-rhino-attack/",
            "content": "By Tapiwa Svondo\n\nA Save Valley Conservancy wildlife ranger, Knowledge Mudzimureka, has succumbed to the severe injuries he sustained in a rhino attack.\n\nMudzimureka died on June 8, two weeks after the attack, which happened during a routine patrol.\n\nOn 26th May 2025, Knowledge, accompanied by one other ranger, was on a routine patrol, tracking a different rhino when they unexpectedly encountered a mother black rhino and her calf. The rhino cow severely injured Knowledge, who sustained wounds to his abdomen, particularly his left lung, as well as to his head, shoulder, and knee.\n\nKnowledge was immediately evacuated on an ACE Air Ambulance and received exceptional care from the medical team at a private hospital in Harare, reads a statement by Zimparks spokesperson Tinashe Farawo.\n\nHe underwent two serious operations; on arrival to stabilise him, and a subsequent procedure to address a critical infection in his lungs.\n\nKnowledge had started to turn a corner, and the doctors were expressing optimism and positivity, his passing has shocked our entire community with grief.\n\nThe Zimparks will hold a burial service in honour of Mudzimureka.\n\nAnother Zimparks ranger was trampledto deathby an elephant in Kariba. The fatal accidentsunderscore the increasing risks faced by the frontline conservationworkers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/28022541/Black-Rhinos.png",
            "description": "<p>By Tapiwa Svondo A Save Valley Conservancy wildlife ranger, Knowledge Mudzimureka, has succumbed to the severe injuries he sustained in a rhino attack. Mudzimureka died on June 8, two weeks after the attack, which happened during a routine patrol. “On 26th May 2025, Knowledge, accompanied by one other ranger, was on a routine patrol, tracking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ranger-dies-after-rhino-attack/\">Ranger dies after rhino attack</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jun 2025"
        },
        {
            "title": "University of Zimbabwe withholds salaries of striking lecturers",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-withholdss-salaries-of-striking-lecturers/",
            "content": "By Darlington Gatsi\n\nTHE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution.\n\nThe lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwes soaring cost of living.\n\nWhile UZ has remained silent on the strike, it has retaliated by withholding salaries from the defiant lecturers, who are steadfast in their demand for a return to pre-2018 wages of US$2,250 per month for junior staff  up from the current US$230.\n\nObvious Vengeyi, spokesperson for the Association of University Teachers (AUT), condemned the move as an attempt to force an end to the strike.\n\nOf course, it is an act of trying to force our members to return to work for the US$230 they initially rejected. Its a way of arm-twisting certain members of our community to resume teaching.\n\nMany here who have not been paid have resolved that, whether they receive the US$230 or not, they will not return. The majority of us have not been paid  yes. But we remain committed. Until junior lecturers get US$2,250, we will not go back to class, said Vengeyi.\n\nThe universitys latest move follows its hiring of adjunct lecturers last month to fill gaps left by the striking staff.\n\nHowever, the AUT has dismissed this as futile, claiming most replacements lack the qualifications to teach at a university level.\n\nThere is no teaching happening at the university. No supervision is taking place. A few scabs have been hired to replace sort of  the lecturers on strike, said Vengeyi further.\n\nThe prolonged strike has disrupted examinations, with planned sittings facing further delays, potentially derailing the academic year.\n\nLast month, six students were arrested after staging flash protests demanding the lecturers return, signalling the growing unrest on campus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09165523/1000639185-scaled.jpg",
            "description": "<p>By Darlington Gatsi  THE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution. The lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwe’s soaring cost of living. While UZ has remained silent on the strike, it has retaliated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-withholdss-salaries-of-striking-lecturers/\">University of Zimbabwe withholds salaries of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jun 2025"
        }
    ]
}