{
    "news": [
        {
            "title": "‘Cat and mouse game’: Zimbabwe govt workers moonlight as street vendors",
            "url": "https://www.newzimbabwe.com/cat-and-mouse-game-zimbabwe-govt-workers-moonlight-as-street-vendors/",
            "content": "Al Jazeera\n\nEvery morning, Dumisani Ngara* gets up at dawn to catch a 6:30am bus to work at Zimbabwes Ministry of National Housing and Social Amenities. The government-provided bus is free for civil servants in Harare, and on his $250 monthly salary, he tries to save every cent he can.\n\nOnce at work, Ngara  dressed neatly in a suit and tie  makes sure the days files are all in order before the office opens at 8:30am. In between paperwork and meetings, he takes breaks. At 1pm, he opens a lunchbox packed with rice and meat he prepared at home.\n\nMost of us here, we work to the best of our ability. It is a profession I love. It comes also with job security, said the 48-year-old husband and father of three.\n\nBut by 5pm, as the end of the workday arrives, instead of heading home, Ngara rushes to a restroom in the pub across the street, where he changes into sweatpants and a T-shirt before walking four blocks to join his oldest son at a pavement stall in the city centre. From there, they sell groceries to passers-by.\n\nNgaras side hustle is a secret, as Zimbabwean government workers are restricted from holding other jobs. But he says life is tough on a single-source income.\n\nNgara has been a government worker since 2010, but making ends meet has been especially difficult since 2019, when inflation shot up to 300 percent and the value of his salary eroded.\n\nTo afford rent and other expenses, his family had to make a plan.\n\nMy wife is into vending of fruits and vegetables at home while I do the same after work here in the CBD, Ngara said, referring to the central business district.\n\nBy day, Ngara is a government worker at the Ministry of National Housing and Social Amenities. After hours, he sets up shop vending groceries on the streets [Calvin Manika/Al Jazeera]\n\nThe Ngaras are not alone.\n\nOut on Harares streets, a growing number of civil servants are turning to vending once their official workday ends.\n\nMost work until 9 or 10pm, although Ngara heads home at about 8pm.\n\nMany of those turning to vending work are teachers. Takavafira Zhou is the president of the Progressive Teachers Union of Zimbabwe and says teachers are taking on these extra, informal jobs because salaries are pathetic and families cannot make ends meet.\n\nPeople are failing to pay school fees, to feed their families, to pay medical bills, to pay rentals, he explained. Therefore, government workers have designed methods of survival.\n\nAccording to Zhou, the majority of government workers have now turned to some sort of vending, although there is no data to confirm this.\n\nAccording to ZimStats, the government statistics agency, the informal sector in Zimbabwe contributes 18 percent to the countrys gross domestic product (GDP) and 20 percent of employment. But experts say the government downplays the numbers and that a majority of Zimbabweans work in the informal sector.\n\nIt is a situation where you have a choice to starve or to find survival methods, bearing in mind that the employer is uncaring, Zhou added, accusing the state of offering unreasonable salaries and not improving working conditions for teachers.\n\nBefore November 2018, most Zimbabwean civil servants, including teachers, earned a basic monthly salary of about $540.\n\nHowever, since the economic downturn in 2019, the government stopped offering full US dollar-pegged payments. Salaries are now split into two portions: a US dollar (USD) component  $160 for most civil servants  and an amount in local currency, which equals less than $100 when converted.\n\nLate one afternoon, Ngara and his 21-year-old son spread out their wares on the pavement in front of registered supermarkets and stores selling the same goods they do.\n\nLast year, in a bid to tackle hyperinflation, the government introduced a new gold-backed currency, the ZiG, and imposed stricter regulations on the use of foreign currency. As a result, registered stores must trade in the local currency or use official USD exchange rates.\n\nInformal vendors, meanwhile, use black market exchange rates, meaning their products are cheaper for customers. They also trade in hard USD currency. Most Zimbabweans keep USD notes instead of local bills, as it is more stable, and prefer buying from vendors.\n\nWe do not accept the local currency, explained Tariro Musekiwa, a street vendor sitting on a cardboard box, who only trades in USD.\n\nCurrently, the official exchange rate is $1 to 26.4 ZiG, while the unofficial black-market rate ranges from 36 to 40 ZiG per USD, giving consumers more for less on the informal market.\n\nPeople need to buy goods at a lower cost, said Musekiwa, who sells soaps, cordial drinks and yoghurts. Because the same products are more expensive in stores, he believes the vendors are offering an important service.\n\nNgara agreed. If you look in the streets, all pavements and corners are filled with people selling something. So I try to sell goods which sell quickly at lower prices, he said.\n\nWe are in a jungle, and it is the survival of the fittest.\n\nFor registered store owners, though, the influx of vendors has not been a blessing.\n\nTrymore Chirozva, the manager at Food World, a supermarket retailer in Harare, expressed dismay that vendors sell similar products outside on the pavement.\n\nUnlike before, when vendors would sell fruits and vegetables only, of recent they have become mini-stores, affecting our business, he said.\n\nHarares CBD has just five official vending sites, which accommodate fewer than 200 vendors. Yet, thousands of informal vendors flock to the streets every day.\n\nNgara and many others admit they operate without official permits but say they find ways around the rules. The officers just demand some bribes, or sometimes just pass [us by].\n\nVendor Tariro Musekiwa says she trades only in USD [Calvin Manika/Al Jazeera]\n\nChirozva believes stores like his are negatively affected because vendors are not regulated as strictly as big businesses.\n\nPatience Maodza, an economist, believes vendors are leveraging on the regulation gap.\n\nThe government overregulates shops but not vendors, creating [an] unfair business environment for the registered entities which are tax compliant.\n\nIn the past 12 months, Zimbabwe has witnessed the closure of leading regional chain stores and clothing lines, most citing two reasons: the restrictions on the use of USD and an influx of vendors taking over their business without government intervention.\n\nOne of Zimbabwes largest wholesale hardware companies, N Richards Group, has closed two branches.\n\nSpeaking to Zimbabwes parliament, Archie Dongo, the director of the N Richards Group, said the government is overburdening those who already pay tax.\n\nReduce the taxation level and the tax heads, but collect that tax from as many players as possible. In that way, we will not have a problem of fiscal mobilisation in the economy; we actually believe well get more tax that way, Dongo said.\n\nOK Zimbabwe, the countrys top supermarket retailer, has struggled to restock its branches over the past year  a challenge compounded by the introduction of the ZiG, which disrupted supply chains and pricing structures. The retailer closed five of its supermarkets in January.\n\nEconomist Kajiva believes that the governments economic policies have played a significant role in the business sectors struggles.\n\nThe policy has resulted in a sharp reduction in money supply, placing considerable pressure on businesses, including major retailers like OK Zimbabwe and N Richards, he said.\n\nThese companies have been forced to downsize in response to a challenging economic climate driven by tight fiscal conditions.\n\nStreet vendor Portia Mbano, centre, quit her government job and works full-time, selling groceries on the street [Calvin Manika/Al Jazeera]\n\nAs traditional businesses struggle, so do traditional workers.\n\nWhile many like Ngara are embracing side hustles, some have abandoned their government jobs altogether.\n\nPortia Mbano, 39, left her job as a civil servant to become a full-time vendor.\n\nAt first, she started as a small-time seller after office hours. But she soon realised she was ageing and needs something tangible.\n\nI realised that I was losing a lot by spending time at the offices [rather] than to take this as a full-time job, she said.\n\nShe now sells a variety of groceries and small household items from a pavement stall in the CBD.\n\nSamuel Mangoma, the director of Vendors Initiative for Social and Economic Transformation (VISET), an organisation advancing the rights of informal economy workers across Africa, told Al Jazeera there has been a sharp rise in street vendors in central Harare.\n\nThis is as a result of limited opportunities in the formal job market, he said, with many people now finding refuge in the informal sector.\n\nHowever, he frowns on vendors operating in front of stores, selling the same goods for cheaper prices.\n\nPeople are trying to survive in this very difficult economic environment. But, we dont encourage our members to go and occupy spaces in front of grocery shops and big retailers. We encourage our members to operate from spaces where we dont create conflict unnecessarily with other business players, he said.\n\nNevertheless, out on the streets, government workers continue to set up their informal shops, with Ngara saying he plans to continue until his family is stable enough to survive without it.\n\nI need my son to go to university and at least own a property for my family, so I need both jobs until such a time, Ngara said.\n\nDespite challenges we face in the streets, including the government through the council and police trying to remove us from the CBD, we continue the cat and mouse game  at least for now.\n\n*Name changed to protect privacy\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27183104/Vendor-standing-by-her-cart-1743056370.jpg",
            "description": "<p>Al Jazeera Every morning, Dumisani Ngara* gets up at dawn to catch a 6:30am bus to work at Zimbabwe’s Ministry of National Housing and Social Amenities. The government-provided bus is free for civil servants in Harare, and on his $250 monthly salary, he tries to save every cent he can. Once at work, Ngara –</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cat-and-mouse-game-zimbabwe-govt-workers-moonlight-as-street-vendors/\">‘Cat and mouse game’: Zimbabwe govt workers moonlight as street vendors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Zim monthly inflation rate tumbles to 0% – statistics agency",
            "url": "https://www.newzimbabwe.com/zim-monthly-inflation-rate-tumbles-to-0-statistics-agency/",
            "content": "By Alois Vinga\n\nTHE monthly inflation rate tumbled to 0% in the month of March 2025 on the back of a sustained tight liquidity stance and a cocktail of measures.\n\nLatest data released by the Zimbabwe National Statistics Agency (ZIMSTAT) shows that the weighted month-on-month inflation rate was 0.0 percent in March 2025, shedding 0.3 percentage points on the February 2025 rate of 0.3 percent.\n\nThe USD month-on-month inflation rate was 0.1 percent in March 2025, shedding 0.1 percentage points on the February 2025 rate of 0.2 percent. The USD year-on-year inflation rate (annual percentage change) for the month of March 2025 as measured by the all-items USD Consumer Price Index (CPI), was 15%.\n\nThe ZWG month-on-month inflation rate was -0.1% in March 2025, shedding -0.6 percentage points on the February 2025 rate of 0.5 percent, said ZIMSTAT.\n\nThe Food Poverty Line (FPL) for one person in March 2025 was ZWG864.20. FPL represents the amount of money that an individual requires to afford a daily minimum energy intake of 2,100 calories. ZIMSTAT uses the consumer basket for an individual deemed to be extremely poor to calculate the poverty line.\n\nThe Total Consumption Poverty Line (TCPL) for one person was ZWG 1,260.52 in March 2025. TCPL is derived by adding the non-food consumption expenditures of an individual deemed to be extremely poor and the FPL.\n\nDuring the period, the total value of exported goods in February 2025 was US$ 512.6 million, representing a 21.4% decrease from USD 652.0 million reported in January 2025.\n\nImports for February 2025 amounted to US$730.3 million, a decrease of 2.5 % from US$749.2 million recorded in January 2025. The February 2025 trade deficit for goods was US$ 217.7 million, translating to a 124.2% increase from a deficit of USD 97.1 million recorded in January 2025.\n\nAmong the countrys major export destinations in February 2025 were the United Arab Emirates (42.6%), South Africa (23.3%) and China (19.3%). The three countries accounted for around 85% of the total export value of US$512.6 million.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga THE monthly inflation rate tumbled to 0% in the month of March 2025 on the back of a sustained tight liquidity stance and a cocktail of measures. Latest data released by the Zimbabwe National Statistics Agency (ZIMSTAT) shows that the weighted month-on-month inflation rate was 0.0 percent in March 2025, shedding 0.3</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-monthly-inflation-rate-tumbles-to-0-statistics-agency/\">Zim monthly inflation rate tumbles to 0% – statistics agency   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "High Court judge Mambara accused of attempting to defraud ZIMASCO",
            "url": "https://www.newzimbabwe.com/high-court-judge-mambara-accused-of-attempting-to-defraud-zimasco/",
            "content": "By Staff Reporter\n\nZIMASCO has written to the Judicial Services Commission (JSC) accusing High Court Judge, Justice Joel Mambara, of being an active participant in recent attempts to defraud it.\n\nIn the letter, dated March 21, ZIMASCO, through its Chief Executive Officer (CEO) John Musekiwa, notes that Mambara illegally granted a corporate rescue order on the chromite ore smelting company when they had not been served with the application.\n\nThe order in question was in favour of Kwekwe businessman Shepard Tundiya, who owns Avim Investments and sought to take over its operations and bank accounts with his partner Denny Marandure.\n\nAn initial one had failed to name ZIMASCO, hence the questionable correction that led to Musekiwas complaint.\n\nTogether with their lawyers, Valentine Kwande and Wilson Manase, the two are accused of having colluded with Mambara to raid ZIMASCO accounts.\n\nThe Honourable Judge surely could not correct his own order in the absence of the affected parties, reads Musekiwas letter.\n\nThe acceptance of an application which did not provide for service, the consideration of that application in the absence of affected parties and the breath-taking speed with which this all took place (from filing of the order, allocation to Mambara, reading the papers, grant of the order and issue in three hours) is suggestive of judicial impropriety and that he was not just a passive, but active participant in the fraudulent scheme to defraud ZIMASCO (Private) Limited.\n\nThere is only one possible explanation for the actions of the honourable judge and it is this; honourable Mambara is involved in the fraudulent plot to raid the bank accounts of ZIMASCO (Pvt) Ltd and take over control by fraudulent means in connivance with the two sets of lawyers and their client, hence the grant of two defective court orders.\n\nIn related news, the companys creditors meeting, which had been scheduled for March 26, was postponed by the High Court until a time it would have pronounced itself on the matter above.\n\nAn urgent application to the High Court is expected to be filed against Manase, who continues to present himself as the Corporate Rescue Practitioner for the mining entity despite the current impasse.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Staff Reporter ZIMASCO has written to the Judicial Services Commission (JSC) accusing High Court Judge, Justice Joel Mambara, of being an active participant in recent attempts to defraud it. In the letter, dated March 21, ZIMASCO, through its Chief Executive Officer (CEO) John Musekiwa, notes that Mambara illegally granted a corporate rescue order on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-judge-mambara-accused-of-attempting-to-defraud-zimasco/\">High Court judge Mambara accused of attempting to defraud ZIMASCO</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Parliament slams Zimbabwe’s ‘irresponsible’ mining activities",
            "url": "https://www.newzimbabwe.com/parliament-slams-zimbabwes-irresponsible-mining-activities/",
            "content": "By Alois Vinga\n\nPARLIAMENThas described the majority of mining activities across the country as irresponsible due to the failure to adhere to basic standards thatprotect the environment.\n\nThe remarks come on the backdrop of concerns by stakeholders who argue that although minerals-rich, Zimbabwe is not tapping into its full resource potential to alleviate poverty through value addition and other mechanisms.\n\nOver the years, environmentalists have also criticized the rate at which pollution has spiraled in a development which has seen a number of water bodies defiled, with forests carrying the heavy brunt.\n\nSpeaking at the Silveira House supported Multi-Stakeholder Meeting on Responsible Mining Audit Feedback in Buhera,Wednesday, the Chairperson of Portfolio Committee on Environment, Climate and Wildlife, Sam Matema admitted that mining activities are not in sync with best practices.\n\nMining and environmental issues are human rights-centered. When mining companies produce dust and noise from their machinery, they are somehow interfering with childrens rights during their learning time. So is the case with animals in the event of forests and water bodies being tampered with.\n\nHow responsible have we been as we extract minerals? My answer is a bold NO. We have not been responsible. We have to be responsible. We need to adopt technology on tracking issues like carbon capture and environmental protection, he said.\n\nThe Buhera Central legislator implored the mining sector to balance between human economic interests and the broader socio-environmental well-being.\n\nHe said planting of trees and the obligation to take care of the pertinent needs within the surrounding communities must be placed at the heart of operations.\n\nMost of these investors in mining communities are not respecting indigenous peoples customs. They must also share information on what they are getting from the ventures. Imagine some companies are offering to paint schools as a gesture of appreciation under CSR. Whats that? Mining must provide hope even to future generations. Anything short of that is the same as building a bridge to hopelessness, added Matema.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27183540/sam-matema.jpg",
            "description": "<p>By Alois Vinga PARLIAMENT has described the majority of mining activities across the country as ‘irresponsible’ due to the failure to adhere to basic standards that protect the environment. The remarks come on the backdrop of concerns by stakeholders who argue that although minerals-rich, Zimbabwe is not tapping into its full resource potential to alleviate poverty through</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-slams-zimbabwes-irresponsible-mining-activities/\">Parliament slams Zimbabwe’s ‘irresponsible’ mining activities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Police flood streets to crush anti-government protests",
            "url": "https://www.newzimbabwe.com/police-flood-streets-to-crush-anti-government-protests/",
            "content": "By Darlington Gatsi\n\nZIMBABWE Republic Police (ZRP) has deployed officers in urban and rural areas to thwart the planned 31 March protests against President Emmerson Mnangagwas government.\n\nPolitical tensions are at a boiling point, with ZANU-PF factional battles reaching a peak as disgruntled members push for the ouster of Mnangagwa.\n\nIn a statement, the ZRP said its officers would be deployed to residential areas, ostensibly to maintain peace and order.\n\nThe Zimbabwe Republic Police acknowledges the peaceful environment currently obtaining in the country and urges the public to continue undertaking social and economic activities without any disturbances.\n\nIn the same vein, the Police has deployed members to maintain law and order in both urban and rural set up in all parts of the country, read the statement.\n\nThe deployment comes after the ZRP issued a public ban on carrying machetes and axes in Harare and Bulawayo.\n\nThe planned protests have unsettled the government, which has vowed to suppress the demonstrations, led by expelled senior ZANU PF official Blessed Bombshell Geza.\n\nThe ZRP warned that it would not hesitate to arrest those who instigate protests.\n\nThe law will definitely take its course against individuals and groups who seek to undermine peace and security in the country, including those using social media to cause alarm and despondency among Zimbabweans.\n\nThe public should therefore cooperate with the deployed police officers and report anyone inciting violence and interference with the smooth traffic flow in the country, read further the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/25125149/download.jpeg",
            "description": "<p>By Darlington Gatsi ZIMBABWE Republic Police (ZRP) has deployed officers in urban and rural areas to thwart the planned 31 March protests against President Emmerson Mnangagwa’s government. Political tensions are at a boiling point, with ZANU-PF factional battles reaching a peak as disgruntled members push for the ouster of Mnangagwa. In a statement, the ZRP</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-flood-streets-to-crush-anti-government-protests/\">Police flood streets to crush anti-government protests </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Mnangagwa appoints Lieutenant-General Matatu new army commander",
            "url": "https://www.newzimbabwe.com/mnangagwa-appoints-lieutenant-general-matatu-new-army-commander/",
            "content": "By Staff Reporter\n\nIN his latest power consolidation move, President Emmerson Mnangagwa has promoted Major-General Emmanuel Matatu to the rank of Lieutenant General (Lt-Gen) and Commander of the Zimbabwe National Army (ZNA).\n\nMnangagwa, who is the Commander-in-Chief of the Zimbabwe Defence Forces (ZDF), this week retired Lt-Gen Anselem, who was ZNA Commander, and redeployed him as Sports Minister, replacing Kirsty Coventry, who was recently elected International Olympic Committee (IOC) president.\n\nChief Secretary to the President and Cabinet, Martin Rushwaya, announced the appointment.\n\nHis Excellency, the President of the Republic of Zimbabwe and Commander-ln-Chief of the Zimbabwe Defence Forces, Cde Dr. Emmerson Dambudzo Mnangagwa, acting in terms of section 216(2) as read with section 89 of the Constitution of Zimbabwe and section 11(1)(a) and 11(4) of the Defence Act (Chapter 11:02), has promoted Major-General Emmanuel Matatu to the rank of Lt-Gen and Commander of ZDF with immediate effect, said Rushwaya.\n\nBefore his promotion from Brigadier-General to Major-General, Matatu was ZNA Chief of Staff responsible for administration.\n\nThe new ZNA Commander is a former Zimbabwe Peoples Revolutionary Army (ZIPRA) combatant, having undergone military training at the Zambia Military Academy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27184152/matatu.jpeg",
            "description": "<p>By Staff Reporter IN his latest power consolidation move, President Emmerson Mnangagwa has promoted Major-General Emmanuel Matatu to the rank of Lieutenant General (Lt-Gen) and Commander of the Zimbabwe National Army (ZNA). Mnangagwa, who is the Commander-in-Chief of the Zimbabwe Defence Forces (ZDF), this week retired Lt-Gen Anselem, who was ZNA Commander, and redeployed him</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-appoints-lieutenant-general-matatu-new-army-commander/\">Mnangagwa appoints Lieutenant-General Matatu new army commander</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "ZACC investigating corruption, abuse of office at top Harare school",
            "url": "https://www.newzimbabwe.com/zacc-investigating-corruption-abuse-of-office-at-top-harare-school/",
            "content": "By Staff Reporter\n\nZIMBABWE Anti-Corruption Commission (ZACC) is investigating numerous cases of financial mismanagement, abuse of office and corruption at Alexandra Park Primary School, NewZimbabwe.com has learnt.\n\nAllegations, being placed on the school headmaster identified as Kwari and his deputy Kundishora, are that the two have been conniving to make irregular appointments and promotions that have seen two of their colleagues being given high-paying non-existent offices.\n\nA ZACC officer, who requested anonymity, said the two were being investigated because of questionable contracts they had given Ella Samanga and Nyembesi Matsengauswa.\n\nI can confirm the investigation into both Kundishora and Kwari on allegations of abuse of office and other charges that will be officially shared, said the officer.\n\nSamanga and Matsengauswa were hired as groundsmen before being elevated to positions of Housekeeper and Assistant Housekeeper, respectively.\n\nQuestions on their promotion were raised because those are positions usually found at schools with boarding facilities. Alexandra Park Primary School is a day school.\n\nThe School Development Committee (SDC) chairperson refused to endorse Samanga and Matsengauswas promotions after discovering that the documents were not valid contracts but offer letters masquerading as contracts to legitimise the duos new roles, said a source at the school.\n\nBoth Kundishora and Kwari were summoned by ZACC for questioning.\n\nThis school is suffering because of corruption, added the school source.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27143718/alex.jpeg",
            "description": "<p>By Staff Reporter ZIMBABWE Anti-Corruption Commission (ZACC) is investigating numerous cases of financial mismanagement, abuse of office and corruption at Alexandra Park Primary School, NewZimbabwe.com has learnt. Allegations, being placed on the school headmaster identified as Kwari and his deputy Kundishora, are that the two have been conniving to make irregular appointments and promotions that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-investigating-corruption-abuse-of-office-at-top-harare-school/\">ZACC investigating corruption, abuse of office at top Harare school</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Benyu says time under former Liverpool manager Rogers was a “nightmare”",
            "url": "https://www.newzimbabwe.com/benyu-says-time-under-former-liverpool-manager-rogers-was-a-nightmare/",
            "content": "By Sports Reporter\n\nCAPS United midfielder Kundai Benyu has revealed his nightmare at Scottish league giants Glassglow Celtic FC under former Liverpool manager Brendan Rodgers.\n\nBenyu had a four-year stint at Celtic, a club he joined as a teenager before they parted ways in 2021.\n\nThe 27-year-old midfielder had limited first-team opportunities under Rogers at the side.\n\nWhen he (Brendon Rodgers ) called me, I was happy because he is a big manager, who had managed Coutinho, Sterling and others.\n\nAs an 18-year-old teenager, I couldnt resist that. At first, I was involved in playing games, but all of a sudden I was banished from the first team, I was made to train with the reserves and kicked out of the changing room as well.\n\nIt was a horrible experience, but I will say it helped me to grow, relieved Benyu.\n\nAfter leaving Celtic, Benyu has been nomadic from one club to another, at the same time struggling to adjust.\n\nThe Ipswich academy product had been without a club since July last year, only to resurface at CAPS United.\n\nThe treatment he was given by Rogers at Celtic, Benyu says,was a nightmare he is still trying to recover from.\n\nFor all these years, I have been asking myself the question why he did that to me.\n\nI was not given a reason, and I remember several times I went to his (Rogers) office asking why I was being treated as if I was not liked in the building.\n\nI was ignored all the time I made those efforts, so in the end I accepted and moved on.\n\nUntil now, I always think about it, asking myself what I really did wrong, and I cant think of anything because this is the same team that lured me there at first, said Benyu.\n\nWith five national team caps to his name, Benyu is hoping that he can come back to the local top-flight to recover and regain form.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27141954/benyu.jpg",
            "description": "<p>By Sports Reporter CAPS United midfielder Kundai Benyu has revealed his nightmare at Scottish league giants Glassglow Celtic FC under former Liverpool manager Brendan Rodgers. Benyu had a four-year stint at Celtic, a club he joined as a teenager before they parted ways in 2021. The 27-year-old midfielder had limited first-team opportunities under Rogers at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/benyu-says-time-under-former-liverpool-manager-rogers-was-a-nightmare/\">Benyu says time under former Liverpool manager Rogers was a “nightmare”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Winky D’s hard hitting songs Ibotso, Copyrights being studied at UZ",
            "url": "https://www.newzimbabwe.com/winky-ds-hard-hitting-songs-ibotso-copyrights-being-studied-at-uz/",
            "content": "By Staff Reporter\n\nZIMDANCEHALL artiste Winky Ds two hard hitting songsIbotsoandCopyrightsoff his 2023 and 2015 albums respectively, are being studied at the University of Zimbabwes (UZ) Law Department, NewZimbabwe has learnt.\n\nBoth songs, sent shockwaves in ruling Zanu PF circles when they were released,Ibotsobeing blacklisted on state controlled radio and television stations.\n\nThey highlight social, economic and political ills Zimbabweans are being subjected to at the hands of Zanu PF.\n\nRampant unemployment, abuse at the hands of state and council security agents, poverty and primitive accumulation by cronies either close to or in government are emphasised in both songs.\n\nA 2025 group assignment given to Labour Law class has questions on the two Winky D songs, Hugh Masekelas Stimela, System TazvidasMushandi NdiMambo, Leonard ZhakatasMugove, Leonard Dembos Manager and Lovemore MajaivanasUmoya Wami.\n\nCompare and contrast the following musicians in the nature of the workplace, reads the question paper before listing the named artists and their songs.\n\nWinky D has for long been targeted for his songs. His catalogue is full of songs sung from the ordinary persons view.\n\nVanotora zvevapfupi nekureba, sekutamba sekuseka. Vanonyepa, vanonyepedzera, vanozeza, vanozeza zera, vano-spender, sings Winky D onIbotso, which features Zanu PF member Holy Ten.\n\nIn opposition leader, Nelson Chamisa style, Winky D adds: Ini ndiri muimbi chete. Handina pfumo, handina bakatwa. Musandikande pasi kunge hakata.\n\nVanotora zvevapfupi nekurebais interpreted to mean they take from the poor because of their higher positions. It highlights the effects of corruption and bemoans the plight of the lowly and poor.\n\nIn Copyrights, Winky D seems to laugh at his own poor situation, which metaphorically represents Zimbabweans as a whole.\n\nHe shows how companies are hiring and firing at will, refuses to give attention to Biblical verses that speak on poverty as a good thing or urge prayer instead of action.\n\nIn Copyrights he calls for a Ghetto Voice and promises not to be hoodwinked by anyone.\n\nThe song, which could be used in Zimbabwes current context, also mourns the plight of vendors who are always in running battles with council officers.\n\nTiri kutrier, but hakuna kana chiri kufaya, and hamusati maona, hamusati maona. Vanongoti-hire pavanodira voti-fire.\n\nNdaramba, no disguise. Takuda ghetto voice. Toda kupukunyuka nhamo  Tocky Vibes.\n\nMisodzi yochururuka ari kudzingwa mavendor. Nemari yemusika kugwazh ndakaenda. Ini ndotenda vari kutengesa kuriritira mhuri dzavo 365 days dzecalendar.\n\nNdikafunga zvelife yangu ini!ndazvi-tormentor. Kungondiudza ndine nungo wandi-offender. Ndiri kuzama kuzvibatanidza zvichiramba maghetto youths hatisi kupretender, go some of the lines on Copyrights.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/16133659/winky-4-scaled.jpg",
            "description": "<p>By Staff Reporter ZIMDANCEHALL artiste Winky D’s two hard hitting songs Ibotso and Copyrights off his 2023 and 2015 albums respectively, are being studied at the University of Zimbabwe’s (UZ) Law Department, NewZimbabwe has learnt. Both songs, sent shockwaves in ruling Zanu PF circles when they were released, Ibotso being blacklisted on state controlled radio and television stations. They highlight social,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/winky-ds-hard-hitting-songs-ibotso-copyrights-being-studied-at-uz/\">Winky D’s hard hitting songs Ibotso, Copyrights being studied at UZ</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        },
        {
            "title": "Ex-army commander Sanyatwe sworn-in; says “humbled” to be Sports Minister",
            "url": "https://www.newzimbabwe.com/ex-army-commander-sanyatwe-sworn-in-says-humbled-to-be-sports-minister/",
            "content": "By Staff Reporter\n\nFormerarmy commander General Anselem Sanyatwe says he is humbled to be leading the Ministry of Sports, Recreation, Arts, and Culture.\n\nSanyatwe was retired from his position as army commander on Tuesday and named Sports Minister, replacing Kirsty Coventry, who stepped down to assume her new role as International Olympic Committee (IOC) president.\n\nSpeaking after his swearing-in at State House on Thursday, Sanyatwedescribed his appointment widely viewed as a demotion as a great honor and a mark of special recognition.\n\nIt is indeed a great honor and special recognition from His Excellency. In fact, I am humbled by the confidence and trust that the President has placed in me to lead this important ministry.\n\nIn essence, sports, arts, and culture are powerful tools for national unity, youth empowerment, and economic growth. Through these, our nation is identified, our history and our aspirations are expressed.\n\nGiven this background, I am committed to engaging all stakeholders as I embark on this new journey to lead the ministry, Sanyatwe said.\n\nHis reassignment comes amid growing tensions within the ruling Zanu PF party, with a faction of war veterans led by Blessed Geza planning a protest on March 31 against government corruption and incompetence.\n\nGezas faction, reportedly backed by elements within the military, is pushing for Mnangagwas immediate resignation, while another faction within Zanu PF is advocating for an extension of the presidents term to 2030.\n\nAnalysts suggest that Sanyatwes reassignment was a strategic move to prevent a possible coup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27141224/sanyatwe-minister.jpeg",
            "description": "<p>By Staff Reporter Former army commander General Anselem Sanyatwe says he is humbled to be leading the Ministry of Sports, Recreation, Arts, and Culture. Sanyatwe was retired from his position as army commander on Tuesday and named Sports Minister, replacing Kirsty Coventry, who stepped down to assume her new role as International Olympic Committee (IOC) president.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-army-commander-sanyatwe-sworn-in-says-humbled-to-be-sports-minister/\">Ex-army commander Sanyatwe sworn-in; says “humbled” to be Sports Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "28 Mar 2025"
        }
    ]
}