{
    "news": [
        {
            "title": "Pastor in court for raping in-law on several occasions",
            "url": "https://www.newzimbabwe.com/pastor-in-court-for-raping-in-law-on-several-occasions/",
            "content": "By Staff Reporter\n\nPROMINENT Chinhoyi cleric, Lloyd Kanyangarika Karuru has been arraigned before a local magistrate for allegedly raping, on several occasions, one of his in-laws.\n\nThe 40-year-old is the founding bishop of Followers of Christ Church International, Chinhoyi.\n\nHe appeared at Chinhoyi Magistrates Court this Friday having spent two nights behind bars following his arrest on Christmas Day.\n\nProsecutor Mutsai Mollen Chitsiga argued there was reasonable suspicion the pastor committed the offence and State wanted the complainant to undergo further medical examinations, hence the matter had to be postponed.\n\nDefence counsel, Joshua Mangeyi consented to bail pending trial stating that Karuru is a deserving candidate for bail being of a fixed abode, and had no motive to abscond as he was cooperating with authorities having voluntarily surrendered himself to police.\n\nThe defence lawyer also argued that no one knew the medical status of complainant hence it was unfair to speculate accused persons guilt. Mangeyi also put it that the complainant and accused do not reside at the same residence and prayed for court to grant him US$50 bail, among other reporting conditions.\n\nState did not oppose bail, but proposed a review of the quantum of bail to US$100. The prosecution also averred that stringent bail conditions were only necessary if there were fears an accused person might abscond or interfere with State witnesses.\n\nRegional Magistrate Ignatius Mugova remanded accused person on free bail to January 10, 2025 for routine remand. The ruling sparked frenzied celebrations among the sizeable crowd of Karurus followers, who packed the courtroom in solidarity with the cleric.\n\nCircumstances are that sometime in 2019 complainant was staying at the Staff Quarters section of Chikonohono with the pastors family.\n\nIt is alleged that accused person and complainant would play games on a mobile phone and the former took advantage to fondle and have sexual intercourse with the girl without her consent.\n\nCourt further heard accused person threatened complainant with unspecified action if she disclosed the rape encounters to anyone as this would ruin his marriage and career.\n\nThe sexual violations are said to have continued from 2019 up to September 2024 when the matter came to light.\n\nThe victim was referred to Chinhoyi Provincial Hospital for medical examination and an affidavit can be produced in court as an exhibit.\n\nThe state submitted that the accused person acted unlawfully.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29070725/WhatsApp-Image-2024-12-28-at-05.54.09.jpeg",
            "description": "<p>By Staff Reporter PROMINENT Chinhoyi cleric, Lloyd Kanyangarika Karuru has been arraigned before a local magistrate for allegedly raping, on several occasions, one of his in-laws. The 40-year-old is the founding bishop of Followers of Christ Church International, Chinhoyi. He appeared at Chinhoyi Magistrates’ Court this Friday having spent two nights behind bars following his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-in-court-for-raping-in-law-on-several-occasions/\">Pastor in court for raping in-law on several occasions </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "Govt hails Prospect Lithium Zimbabwe community activities",
            "url": "https://www.newzimbabwe.com/govt-hails-prospect-lithium-zimbabwe-community-activities/",
            "content": "By Alois Vinga\n\nTHE government has saluted Prospect Lithium Zimbabwe (PLZ) for unveiling a series of community projects on the back of calls for deeper engagement with local leaders in charting the development agenda.\n\nPLZ recently tabled a US$1,3 million community projects initiative targeting youth, women and infrastructure development.\n\nTheprojects dubbed,Goromonzi Community Development Project, Launch Ceremony and Public Welfare Experience Daywere launched at a function held recently at Vhuta Primary School in Goromonzi, Zimbabwe.\n\nMinister of State for Mashonaland East Provincial Affairs and Devolution, Dr Apollonia Munzverengwi hailed the company for completing the governments development efforts.\n\nThese community projects initiated by PLZ are designed to uplift and empower our communities and will go a long way in ensuring that there is continuous and sustainable development in Goromonzi district.\n\nThe initiative by Prospect Lithium Zimbabwe resonates well with the desired corporate social responsibility, as we seek to contribute immensely towards the Governments commitment to creating a better life for all. As we traverse in our Presidents mantra ofleaving no one and no place behind she said.\n\nThe top government official said the slated projects by PLZ were aimed at addressing some of the most pressing challenges facing our communities in the Goromonzi district such as the community health project, the vocational training project, the womens empowerment project and energy equity project.\n\nMunzverengwi said these initiatives will help create jobs, and stimulate local economies in the pursuit to improve the provincial GDP and will go a long way in improving the livelihood of our general populace in the district, the province and the nation at large.\n\nI am also delighted that PLZ found it prudent and sensible to also give hampers to eighty-four elderly-headed households from the villages surrounding the PLZ plant. This complimentary gesture is plausible, giving Christmas to the befitting vulnerable elderly beneficiaries.\n\nThe hampers for the elderly are essential in ensuring that our seniors receive the nourishment they need to maintain a healthy well-being. Many elderly individuals experience loneliness and isolation and through programs like food hampers distribution there is a sense of community and social connection, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/22104808/Prospect-Lithium.jpeg",
            "description": "<p>By Alois Vinga THE government has saluted Prospect Lithium Zimbabwe (PLZ) for unveiling a series of community projects on the back of calls for deeper engagement with local leaders in charting the development agenda. PLZ recently tabled a US$1,3 million community projects initiative targeting youth, women and infrastructure development. The projects dubbed, Goromonzi Community Development Project, Launch</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-hails-prospect-lithium-zimbabwe-community-activities/\">Govt hails Prospect Lithium Zimbabwe community activities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "Zimbabwe international Galloway gets a 4 in Plymouth Argyle players ratings after dismal defeat at Coventry City",
            "url": "https://www.newzimbabwe.com/zimbabwe-international-galloway-gets-a-4-in-plymouth-argyle-players-ratings-after-dismal-defeat-at-coventry-city/",
            "content": "PlymouthHerald\n\nHere are the player ratings of Plymouth Lives Argyle reporter Chris Errington from the Pilgrims 4-0 beating by Coventry City on Boxing Day at the Coventry Building Society Arena.\n\nDan Grimshaw 4 Should have saved Coventrys opening goal from Tasuhiro Sakamoto in only the fifth minute. The header was straight at him and although his momentum was carrying him across his line he should have been able to deal with it, not help it into the net. Got his right glove to Josh Eccles shot in the 45th minute which put the Sky Blues 4-0 up but again it was not enough to push the ball wide. Grimshaw did make three good saves in the second half to prevent even more misery for Argyle.\n\nBali Mumba 4 On paper this looked Argyles best available defence but on the pitch they were all over the place in the first half. Mumba was at right-back and struggled whether it was against lively attacker Ephron Mason-Clark or left-back Jake Bidwell as Coventry attacked well and repeatedly down both flanks.\n\nKornel Szucs 4 One of many players whose confidence levels have clearly taken a hit from the Pilgrims recent struggles. He needs to be more aggressive and on the front foot with his defending rather than trying to react to situations.\n\nLewis Gibson 4 Even the captain is finding it difficult at the moment. So often in the past he has blocked shots, made vital interceptions and won headers inside the penalty area but there has been less of all of those in recent matches.\n\nBrendan Galloway 4 It was a surprise he started the Boxing Day match after being substituted in the second half of the 3-3 draw with Middlesbrough because of a tight hamstring. Exactly how fit he was to play is unclear, but the Zimbabwe international will have been disappointed with his part in Coventrys first goal as he could not get a head on the cross swung in by Ben Sheaf and Tatsuhiro Sakamoto was right behind him to apply the finishing touch.\n\nAdam Randell 4 Was deployed as the holding midfield player in a 4-1-4-1 formation to start off with but was unable to give the defence much protection as gaps appeared all over the pitch for Coventry to exploit. Randell was caught in possession when Argyle tried to play out from the back in the 45th minute and Jack Rudoni set up Josh Eccles to score Citys fourth goal.\n\nMustapha Bundu 4 Had been in recent good form for Argyle and some positive play from him led to a chance for Rami Al Hajj, when the score was 2-0 to Coventry, but the Swedish midfielders shot was deflected wide for a corner. Bundu then had to be substituted in the 37th minute after suffering an apparent hamstring injury as he stretched to try to win the ball in a challenge.\n\nDarko Gyabi 4 Has been one of the better Pilgrims players of late but he was well off the pace against Coventry, although to be fair, that was no different to all of his team-mates.\n\nRami Al Hajj 4 Lined up in central midfield alongside Darko Gyabi but had very little influence on the match, apart from the one shot after Mustapha Bundus involvement in the build-up, and was taken off in the 55th minute.\n\nTegan Finn 6 STAR MAN A first start for the 16-year-old academy product and just his second first team appearance. He did as well as you could expect of someone of his age in such challenging circumstances. Was very fortunate not to concede an early penalty for what looked like a clear foul on Josh Eccles but he did have Argyles best scoring chance of the match on the stroke of half-time, a terrific shot as he cut in from the right which was pushed over the bar by the otherwise untroubled Oliver Dovin.\n\nAndre Gray 4 Argyles only fit forward given the injuries to Ryan Hardie, Michael Obafemi and Muhamed Tijani. He saw little of the ball as Coventry took complete control from early on and with the match over as a contest by half-time he did not reappear for the start of the second half, presumably to save him for the trip to Oxford United on Sunday.\n\nSUBSTITUTES\n\nCallum Wright 3 Initially played in the wide left attacking role after replacing the injured Mustapha Bundu, with Tegan Finn switching across to the right side. Wright was then pressed into service as a striker in the second half, which was largely a non-event. He then made a bad day for Argyle even worse by getting sent-off in the 87th minute after a wild tackle on Joel Latibeaudiere. Given how depleted the Pilgrims already is his three-match suspension is the last thing they needed.\n\nFreddie Issaka 4 The 18-year-old was unusually not the youngest Argyle player on the pitch because of the presence of Tegan Finn. Issaka was sent on at the start of the second half for Andre Gray but given the state of the game his role was mainly to try to contain Coventry rather than going on the attack.\n\nAdam Forshaw 4 A 55th minute substitute for Rami Al Hajj. The Sky Blues were largely going through the motions by then and it felt like a pre-season game with the 29,000 crowd inside the Coventry Building Society Arena watching in almost a hush because of their sides total control.\n\nJordan Houghton 4 Replaced Darko Gyabi in central midfield in the 71st minute. It was then all about trying to limit the chances that Coventry had and prevent them from winning by an even wider margin.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/18042712/Brendan-Galloway.png",
            "description": "<p>PlymouthHerald Here are the player ratings of Plymouth Live’s Argyle reporter Chris Errington from the Pilgrims’ 4-0 beating by Coventry City on Boxing Day at the Coventry Building Society Arena. Dan Grimshaw 4 – Should have saved Coventry’s opening goal from Tasuhiro Sakamoto in only the fifth minute. The header was straight at him and although</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-international-galloway-gets-a-4-in-plymouth-argyle-players-ratings-after-dismal-defeat-at-coventry-city/\">Zimbabwe international Galloway gets a 4 in Plymouth Argyle players ratings after dismal defeat at Coventry City</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "UK Prime Minister Keir Starmer accused of ‘behaving like Robert Mugabe’ after considering delaying elections",
            "url": "https://www.newzimbabwe.com/uk-prime-minister-keir-starmer-accused-of-behaving-like-robert-mugabe-after-considering-delaying-elections/",
            "content": "ExpressUK\n\nReform UK leader Nigel Faragehas accused Prime Minister Sir Keir Starmer of behaving like Robert Mugabe amid further claims that the Government is considering postponing local elections scheduled for the Spring.\n\nMugabe, who served as President of Zimbabwe for 30 years, became notorious for putting off democratic elections. He was eventually ousted in 2017 in what was widely regarded as a coup detat.\n\nReports last week suggested that the Labour government, led by Prime Minister SirKeir Starmer, is considering the controversial move as part of a shake-up of local government.\n\nAnd a recent report inThe TimessuggestedEssexCounty Council elections, as well as those in the unitary boroughs of Southend-on-Sea and Thurrock, were almost certain to be postponed.\n\nA leaked Thurrock Council report says that as a consequence of participation in the Government Devolution Priority Programme the Leader and Chief Executive approve a letter to the Secretary of State asking to postpone local elections to be held on May 1, 2025.\n\nThe GB News host, whose own seat, Clacton, is likewise in Essex, wasted little time making his feelings plain as he shared the news on X.\n\nHe commented: This is outrageous.Keir Starmeris behaving like Robert Mugabe.\n\nThe reforms, aimed at restructuring councils and enhancing devolution across England, are being spearheaded by Deputy Prime MinisterAngela Rayner.\n\nWe use your sign-up to provide content in ways youve consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time.\n\nThey involve merging or disbanding existing councils to create more streamlined and efficient local governance structures.\n\nLocal Government Minister Jim McMahon has acknowledged that elections in areas undergoing reorganisation might be deferred.\n\nHe explained that if a council is set to be restructured and will not exist in its current form for the full term following the elections, it is customary to postpone the elections and instead elect a shadow body to oversee the transition.\n\nSuch an approach aims to prevent electing representatives to councils that are on the verge of significant structural changes.\n\nThe Government has not yet provided a definitive list of councils that will be affected by the postponements.\n\nThe situation remains fluid, with further details expected to emerge as the government continues to outline its devolution agenda and local government restructuring plans.\n\nStakeholders and the public await more comprehensive information to understand the full implications of these proposed changes on local democracy.\n\nA Ministry of Housing, Communities and Local Government spokesperson said: No decisions have been taken to postpone elections in specific areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/15084443/Robert-Mugabe-1.jpg",
            "description": "<p>ExpressUK Reform UK leader Nigel Farage has accused Prime Minister Sir Keir Starmer of “behaving like Robert Mugabe” amid further claims that the Government is considering postponing local elections scheduled for the Spring. Mugabe, who served as President of Zimbabwe for 30 years, became notorious for putting off democratic elections. He was eventually ousted in 2017</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-prime-minister-keir-starmer-accused-of-behaving-like-robert-mugabe-after-considering-delaying-elections/\">UK Prime Minister Keir Starmer accused of ‘behaving like Robert Mugabe’ after considering delaying elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "At least 120 killed in South Korea as plane crashes on landing at Muan airport",
            "url": "https://www.newzimbabwe.com/at-least-120-killed-in-south-korea-as-plane-crashes-on-landing-at-muan-airport/",
            "content": "Al Jazeera\n\nAt least 120 people have been killed when a passenger plane caught fire after skidding off a runway and crashing at an airport in South Koreas Muan city, the countrys National Fire Agency said.\n\nThe accident occurred on Sunday at 9.03am local time (00:03 GMT) as the Jeju Air flight, carrying 175 passengers and six crew from the Thai capital Bangkok, landed at Muan International Airport located about 289km (179 miles) southwest of the capital Seoul.\n\nThe National Fire Agency confirmed that 120 people have been killed, and two people have been rescued  both crew members. The fire that engulfed the plane has been extinguished, the agency said.\n\nCiting fire agency officials, South Koreas Yonhap news agency said that hopes are fading for survivors.\n\nThere seems to have been some kind of malfunction with the landing gear and images which have been on the media here do appear to show the plane landing on its belly, skidding along the runway, followed then by a huge explosion, Al Jazeeras Rob McBride, reporting from Seoul, said.\n\nEyewitness accounts have talked then about a series of explosions and certainly images that we have been seeing have shown a catastrophic fire, he said.\n\nThe plane, a 15-year-old Boeing 737-800 jet, was reported to be carrying two Thai passengers and the rest were believed to be South Koreans.\n\nThailands Prime Minister Paetongtarn Shinawatra has expressed deep condolences to the families of the crash victims.\n\nThailands Ministry of Foreign Affairs has been ordered to investigate if Thai passengers were on the plane and to provide assistance immediately, the prime minister said in a post on social media.\n\nOne photo shared by local media showed thick clouds of black smoke coming out of the plane. Another showed the tail section of the jet engulfed in flames on what appeared to be the side of the runway, with firefighters and emergency vehicles nearby.\n\nThe Yonhap news agency reports that the crash is believed to have been caused by contact with birds, resulting in malfunctioning landing gear as the plane attempted to land at the airport.\n\nThe countrys News1 agency reported that a passenger texted a relative to say a bird was stuck in the wing. The persons final message was, Should I say my last words?\n\nAn official from South Koreas Transport Ministrys aviation department said a bird strike was among several theories for the accident that have not been verified and that an investigation was ongoing.\n\nSouth Koreas Acting President Choi Sang-mok, meanwhile, ordered all-out efforts for rescue operations at Muan airport.\n\nAll related agencies must mobilise all available resources to save the personnel, he told officials in a statement.\n\nJeju Air, one of South Koreas largest low-cost carriers, which was set up in 2005, issued an apology for the crash, saying it would do everything in our power in response to this accident.\n\nThe crash is the first fatal accident for Jeju Air, though in August 2007, a Bombardier Q400 operated by the airline and carrying 74 passengers came off the runway due to strong winds at the southern Busan-Gimhae airport, resulting in a dozen injuries.\n\nExperts say that South Koreas aviation industry has a solid track record for safety.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29061022/241229-jeju-air-crash-cc-1214a-f75953.webp",
            "description": "<p>Al Jazeera At least 120 people have been killed when a passenger plane caught fire after skidding off a runway and crashing at an airport in South Korea’s Muan city, the country’s National Fire Agency said. The accident occurred on Sunday at 9.03am local time (00:03 GMT) as the Jeju Air flight, carrying 175 passengers</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/at-least-120-killed-in-south-korea-as-plane-crashes-on-landing-at-muan-airport/\">At least 120 killed in South Korea as plane crashes on landing at Muan airport</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "WATCH | Angry festival attendees burn down stage after Makhadzi’s no-show",
            "url": "https://www.newzimbabwe.com/watch-angry-festival-attendees-burn-down-stage-after-makhadzis-no-show/",
            "content": "TshisaLive\n\nMakhadzi has responded to the controversy surrounding her absence from the Kwaslondon Fun, Games & Musical Festival.\n\nThe event, which took place on the Day of Goodwill, descended into chaos when Makhadzi failed to appear on stage, allegedly prompting fans to react violently which resulted in equipment and the stage being burnt down.\n\nAccording to a statement released by Makhadzis team, the musician was booked to perform at the festival, but the promoter, Ismael, failed to meet the payment terms outlined in the contract.\n\nThe contract specified that a 50% deposit was required before any promotional activities on social media, and the full payment was due 14 days before the event.\n\nMakhadzis team stated that while a deposit was received, along with an additional R3,000 for a promotional video, the balance was not paid within the specified time frame. As a result, Makhadzi and her team were not informed of the event and she did not appear on stage.\n\nWe sincerely apologise to our dedicated fans in Matwasa, read the statement.\n\nWe did not receive the balance within the 14-day period and, as per the terms outlined in the contract, we were not obligated to perform.\n\nThe controversy surrounding Makhadzis no-show has many tongues wagging, with some fans taking to social media to express their disappointment and frustration.\n\nHowever, others have come out in support of the musician, citing the importance of honouring contractual agreements and respecting the value of artists work.\n\nWATCH THE VIDEOS BELOW:\n\nThis is a developing story.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/29122914/Makhadzi-1.png",
            "description": "<p>TshisaLive Makhadzi has responded to the controversy surrounding her absence from the Kwaslondon Fun, Games & Musical Festival. The event, which took place on the Day of Goodwill, descended into chaos when Makhadzi failed to appear on stage, allegedly prompting fans to react violently which resulted in equipment and the stage being burnt down. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-angry-festival-attendees-burn-down-stage-after-makhadzis-no-show/\">WATCH | Angry festival attendees burn down stage after Makhadzi’s no-show</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "SABC employee in hot water after allegedly making racist remarks and disrupting flight",
            "url": "https://www.newzimbabwe.com/sabc-employee-in-hot-water-after-allegedly-making-racist-remarks-and-disrupting-flight/",
            "content": "TimesLive\n\nAn SABC employees festive season has turned sour after she allegedly made racist remarks and disrupted a FlySafair flight.\n\nIn several videos that have gone viral on social media, the woman is seen in a heated altercation with flight attendants who are trying to calm her down.\n\nIn one of the widely circulated videos, she is heard allegedly making racially-sensitive remarks against the coloured community.\n\nYoure a coloured from Mitchells Plain, all these gold rings but no degree. Right now when we land, Im going to take an Uber home. You dont even have a [drivers] licence. You dont even have a car.\n\nThe SABC released a statement on Saturday acknowledging the woman was an employee and condemning her actions.\n\nThe South African Broadcasting Corporation has noted with concern audiovisual material circulating on various social media platforms featuring a staff member travelling on a South African airline.\n\nThe woman also allegedly threatened to get the airline employees fired and the incident broadcast on SABC news channels.\n\nThe SABC distanced itself from her remarks, as it could compromise the organisations editorial integrity.\n\nIn the video clip, this staff member mentions the SABC and states that this incident will be broadcast on SABC News. We would like to reiterate that SABC News is guided by the editorial code and maintains its editorial independence, and the decisions pertaining to all news items are made in the newsroom and not influenced by non-editorial staff members.\n\nThe public broadcaster said it was looking to use the relevant channels in line with its internal procedures to engage the staff member.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29060005/sabc.jpg",
            "description": "<p>TimesLive An SABC employee’s festive season has turned sour after she allegedly made racist remarks and disrupted a FlySafair flight. In several videos that have gone viral on social media, the woman is seen in a heated altercation with flight attendants who are trying to calm her down. In one of the widely circulated videos,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sabc-employee-in-hot-water-after-allegedly-making-racist-remarks-and-disrupting-flight/\">SABC employee in hot water after allegedly making racist remarks and disrupting flight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "Zimborders reviews vehicle toll fees for commercial vehicles",
            "url": "https://www.newzimbabwe.com/zimborders-reviews-vehicle-toll-fees-for-commercial-vehicles/",
            "content": "By Staff Reporter\n\nZimborders Consortium which manages Beitbridge Border Post has announced that it will be reviewing access toll fees for commercial vehicles.\n\nThe planned hike will take effect from February 1, 2025.\n\nAccess toll fees for light vehicles will remain the same according to Zimborders.\n\nWe have worked diligently to keep these increases to a minimum in order to help ease the burden of inflation on our customers while ensuring we can continue to provide the quality service you expect.\n\nIn recognition of our valued relationship with you, we are pleased to announce that there will be no increase in fees for non-commercial vehicles i.e. motorcycles, light vehicles, and minibuses.\n\nWe understand the challenges posed by economic fluctuations, and Zimborders is committed to absorbing the inflationary impacts for these vehicle categories for 2025.\n\nAs we endeavour to keep the fee adjustments to a minimum, we have limited the toll fee increases to commercial vehicles only, said Zimborders in a statement.\n\nA modest increase will apply to light goods vehicles, coaches, heavy vehicles, goods vehicles, abnormal vehicles, and parking bays.\n\nToll fees for motorcycles remain at US$6, light vehicles will be charged US$28, minibuses US$41, and coaches and light goods vehicles at US$85 from US$83.\n\nHeavy vehicle toll fees have been raised from US$119 to US$122, goods vehicles from US$207 to US$213, and abnormal load vehicles will be charged US$365 from US$355.\n\nZimborders is made up of a group of individuals and investors who include Zimbabwean, South African, financial institutions, and international entrepreneurs who provide financial backing for the project.\n\nThe Border Post is running as a public-private partnership between the Zimbabwe government and Zimborders consortium under a long-term concession period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18171804/BB-border-post.jpg",
            "description": "<p>By Staff Reporter Zimborders Consortium which manages Beitbridge Border Post has announced that it will be reviewing access toll fees for commercial vehicles. The planned hike will take effect from February 1, 2025. Access toll fees for light vehicles will remain the same according to Zimborders. “We have worked diligently to keep these increases to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimborders-reviews-vehicle-toll-fees-for-commercial-vehicles/\">Zimborders reviews vehicle toll fees for commercial vehicles </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "Cooperation with China boosts Zimbabwe’s agriculture sector",
            "url": "https://www.newzimbabwe.com/cooperation-with-china-boosts-zimbabwes-agriculture-sector/",
            "content": "Xinhua\n\nThe year 2024 has witnessed significant milestones in China-Zimbabwe cooperation in the agriculture sector, a cornerstone of Zimbabwes economy.\n\nTrade between the two sides increased, while Chinas support for Zimbabwes technical expertise and human resources development in the agriculture sector also expanded.\n\nAccording to the Zimbabwe Investment and Development Agency, a national investment promotion body, the agriculture sector sustains more than 60 percent of Zimbabwes population, provides 63 percent of raw materials for the manufacturing sector, generates 30 percent of export earnings, and contributes 15 percent to gross domestic product.\n\nIn a bid to further open Chinas market to Zimbabwean agricultural products, a trade protocol on the export of Zimbabwean avocados was inked during Zimbabwean President Emmerson Mnangagwas state visit to China in September, ahead of the 2024 Summit of the Forum on China-Africa Cooperation.\n\nRodwell Choto, an avocado farmer from Bindura, Mashonaland Central Province, is among those preparing to meet the expected surge in demand from China.\n\nExports to China will give us foreign currency, our economy will grow, and our livelihoods will improve, Choto told Xinhua in a recent interview, noting that avocado farmers are ramping up production.\n\nAccording to the Horticultural Development Council, an organization representing horticultural exporters in Zimbabwe, the Southeast African country is projected to produce a record 6,000 metric tons of avocados in 2024, with its avocado industry set to expand the growing area from the current 1,500 hectares to 4,000 hectares by 2030.\n\nThis builds on earlier successes, including a 2022 trade agreement enabling the export of fresh citrus to China, which saw its first shipment in 2023.\n\nThis is a chance for African agriculture now to become part of the global food value chain, said Christopher Mutsvangwa, politburo member and secretary for information and publicity at the ruling Zimbabwe African National Union-Patriotic Front (ZANU PF) party.\n\nZimbabwes tobacco sub-sector has also flourished in 2024, bolstered by Chinas market access.\n\nTobacco, an important economic activity and a major foreign currency earner for Zimbabwe, Africas largest tobacco producer, saw exports to China rise 38.3 percent to 790 million U.S. dollars in the first nine months of 2024, accounting for 40.6 percent of Zimbabwes total exports to China, according to data released by the Chinese Embassy in Zimbabwe.\n\nThe overall trade figures between Zimbabwe and China grew 25.6 percent to 3 billion dollars in the same period, the Chinese embassy added.\n\nDespite these significant milestones this year, a severe drought has caused crop failures and livestock losses, greatly undermining the agriculture sector. In response, China launched a project to drill 300 boreholes in four provinces of the country.\n\nThese boreholes will not only provide safe water to the affected community, but will also serve as a stepping stone towards resilience building in view of the current El Nino-induced drought, and will also save the lives of our livestock which is also in dire need of water, said Zimbabwes Minister of National Housing and Social Amenities Daniel Garwe.\n\nChinas support extends beyond infrastructure to human resource development. Collaborative efforts have focused on capacity building and technical assistance to enhance agricultural productivity.\n\nAs part of this initiative, Zimbabwean officials and professionals have attended seminars and workshops in China, equipping them with skills to modernize agriculture.\n\nJotamu Dondofema, director of agricultural education in the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development, is among the officials who attended a seminar on the construction of green, low carbon, and circular economic systems in China this year.\n\nThis program has already yielded significant benefits. We have witnessed large numbers of successfully trained personnel, improved technologies in the agricultural value chains, the establishment of renewable energy sources and systems, and information and technology-sharing platforms anchoring capacity-building initiatives. These efforts have enhanced the employability and competitiveness of Zimbabwean professionals while also promoting the adoption of green technologies and sustainable practices, Dondofema said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29055712/Nyaguse.jpeg",
            "description": "<p>Xinhua The year 2024 has witnessed significant milestones in China-Zimbabwe cooperation in the agriculture sector, a cornerstone of Zimbabwe’s economy. Trade between the two sides increased, while China’s support for Zimbabwe’s technical expertise and human resources development in the agriculture sector also expanded. According to the Zimbabwe Investment and Development Agency, a national investment promotion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cooperation-with-china-boosts-zimbabwes-agriculture-sector/\">Cooperation with China boosts Zimbabwe’s agriculture sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        },
        {
            "title": "Man rapes minor girl in a kombi at Beitbridge Border Post",
            "url": "https://www.newzimbabwe.com/man-rapes-minor-girl-in-a-kombi-at-beitbridge-border-post/",
            "content": "By Staff Reporter\n\nA 27-year-old Beitbridge man allegedly raped a 14 -year old girl in a kombi at a fully packed border post it has emerged.\n\nThe suspect from Mabhidhi village has since been arrested and taken to court where he was remanded in custody to next year awaiting trial.\n\nHe is charged with rape and indecent assault.\n\nIt is alleged that the incident took place on December 23 while the victims parents were busy with clearing agents at Beitbridge Border Post.\n\nOn the 23rd of December 2024, the complainant was traveling with her parents from South Africa to Zimbabwe in a Toyota Hiace.\n\nThe accused person was also a passenger in the same vehicle. They were at the Beitbridge Border Post when the incident occurred.\n\nThe 14-year-old complainant remained in the Toyota Hiace while her parents were processing customs clearance. The accused person was also present in the vehicle.\n\nHe allegedly fondled the complainants breasts, inserted his fingers into her private parts before raping her. The matter came to light when the complainant asked her mother to accompany her to the toilet to change her clothes, the court heard.\n\nThe complainants mother questioned her why she wanted to change her clothes and the complainant revealed what had happened.\n\nThe complainants mother reported the matter to the police at the Beitbridge border post leading to the accused persons arrest.\n\nThe accused person was remanded to 10 January 2025 for trial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/20061106/beitbridge-border-post-1.png",
            "description": "<p>By Staff Reporter A 27-year-old Beitbridge man allegedly raped a 14 -year old girl in a kombi at a fully packed border post it has emerged. The suspect from Mabhidhi village has since been arrested and taken to court where he was remanded in custody to next year awaiting trial. He is charged with rape</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-rapes-minor-girl-in-a-kombi-at-beitbridge-border-post/\">Man rapes minor girl in a kombi at Beitbridge Border Post </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "29 Dec 2024"
        }
    ]
}