{
    "news": [
        {
            "title": "‘It’s as if an atomic bomb fell on Mayotte’: Widespread destruction after 100-year cyclone pummels French territory",
            "url": "https://www.newzimbabwe.com/its-as-if-an-atomic-bomb-fell-on-mayotte-widespread-destruction-after-100-year-cyclone-pummels-french-territory/",
            "content": "Thousands are feared dead after a devastating 100-year cyclone ripped across the French archipelago of Mayotte on Saturday, inflicting destruction that one resident likened to an atomic bomb.\n\nThe situation is catastrophic, apocalyptic, Bruno Garcia, owner of Hotel Caribou in Mamoudzou, Mayottes capital, told CNN-affiliate BFMTV.\n\nWe lost everything. The entire hotel is completely destroyed, Garcia said. There is nothing left. Its as if an atomic bomb fell on Mayotte.\n\nMayotte lies in the Indian Ocean off the east coast of Africa, just west of Madagascar. Made up of two main islands, its land area is about twice the size of Washington DC.\n\nCyclone Chido, a category 4 storm, tore through the southwestern Indian Ocean over the weekend, impacting northern Madagascar before rapidly intensifying and slamming Mayotte with winds above 220 kilometers per hour (136 miles per hour), according to Frances weather service. It was the strongest storm to hit the islands in more than 90 years, Meteo-France said.\n\nChido then continued into northern Mozambique where it continued to cause damage, though the storm has now weakened.\n\nThe cyclone  the worst to hit the territory of just over 300,000 in at least 90 years  flattened neighborhoods, knocked out electrical grids, crushed hospitals and schools and damaged the airports control tower.\n\nHonestly, what we are experiencing is a tragedy, you feel like you are in the aftermath of a nuclear war I saw an entire neighborhood disappear, Mohamed Ishmael, a Mamoudzou resident, told Reuters.\n\nAt least 14 people have been confirmed dead by the French health minister, but the true death toll is expected to be much higher, with local officials predicting the number of victims could be in the hundreds or even thousands, the Associated Press reported.\n\nI think there are some several hundred dead, maybe well get close to a thousand. Even thousands  given the violence of this event, Mayotte Prefect Franois-Xavier Bieuville told TV station Mayotte la 1re.\n\nFrench President Emmanuel Macron said late Monday on X that he planned to travel to Mayotte in the coming days to support our fellow citizens, civil servants and the emergency services that have been mobilized. He added that he would declare a national mourning period.\n\nThe worst damage was to the informal settlements and shacks that are found across Mayotte, both Bieuville and Retailleau said. There is nothing left, Retailleau said.\n\nOf the official death toll, Bieuville said: This figure is not plausible when you see the images of the slums. Aerial footage from Frances military showed villages reduced to rubble.\n\nThese neighborhoods are home to many of the roughly 100,000 undocumented migrants who live in Mayotte, according to Frances interior ministry.\n\nLocated about 5,000 miles from Paris, Mayotte is the poorest place in the European Union and has struggled with unemployment, violence and a deepening migration crisis.\n\nIn recent decades, tens of thousands of people from neighboring Comoros and Madagascar have come to Mayotte seeking better economic conditions and access to the French welfare system.\n\nThe extent of the damage from the storm, which wrecked roads and communications networks, and the prevalence of undocumented migrants living in informal dwellings have hindered search and rescue efforts and made it difficult to ascertain the true death toll.\n\nAbout two thirds of the island is currently unreachable, Estelle Youssouffa, member of parliament for the first constituency of Mayotte told BMFTV.\n\nWe must not confuse the villages that are cut off from communication () and the shanty towns, where there is very little chance of there being survivors. Everything has been razed, Yousouffa said.\n\nAntoine Piacenza, who works in a middle school in Mamoudzou, told BFMTV that many of his students, who are undocumented, chose not to evacuate ahead of the storm out of fear of being caught by the police.\n\nIn recent years, France has flooded the island with thousands of police, tasked with deporting undocumented migrants and dismantling their settlements.\n\nDesperate family members took to social media to search for news of their loved ones after the storm.\n\nAs of Monday morning, Mayotte had been almost entirely offline for over 36 hours, according to the website NetBlocks.\n\nWe have no electricity, no water, weve been in the dark for three days. Its been three days and we havent seen any rescuers, Fahar, a Mamoudzou resident, told BFMTV.\n\nFrances minister for everyday security, Nicolas Daragon, said on social media late Sunday the first military planes providing emergency aid to the cyclone-battered island had landed.\n\nRetailleau said that France had mobilized two naval ships and that they were hopeful that more flights would be able to enter the territory soon, noting that flights cannot land at night yet given how badly the airport was affected by the cyclone.\n\nFrance is standing by their side with a helping hand, Retailleau said of the Mayotte people.\n\nMeanwhile, hundreds of rescuers, firefighters and police have been sent to the territory from France and Reunion, the Associated Press reported.\n\nCyclones, also known as typhoons and called hurricanes in North America, are enormous heat engines of wind and rain that feed on warm ocean water and moist air. Cyclone season in the southwest Indian Ocean typically runs from mid-November to the end of April, according to Frances weather agency.\n\nScientists say climate change, driven by humans burning fossil fuels, is making tropical cyclones more destructive as hotter oceans fuel them with more energy and warmer air can hold more moisture, which is wrung out in the form of torrential rain.\n\nIn 2019, two powerful cyclones,Idai and Kenneth, pummeled Mozambique over a period of two months, killing hundreds and leaving millions in need of humanitarian assistance.\n\nChad Youyou, a resident in Hamjago in the north of Mayotte, posted videos to Facebook showing flattened trees and extensive damage to his village, the Associated Press reported.\n\nMayotte is destroyed  we are destroyed, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17063214/gettyimages-2189400303.webp",
            "description": "<p>CNN Thousands are feared dead after a devastating 100-year cyclone ripped across the French archipelago of Mayotte on Saturday, inflicting destruction that one resident likened to an atomic bomb. “The situation is catastrophic, apocalyptic,” Bruno Garcia, owner of Hotel Caribou in Mamoudzou, Mayotte’s capital, told CNN-affiliate BFMTV. “We lost everything. The entire hotel is completely</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-as-if-an-atomic-bomb-fell-on-mayotte-widespread-destruction-after-100-year-cyclone-pummels-french-territory/\">‘It’s as if an atomic bomb fell on Mayotte’: Widespread destruction after 100-year cyclone pummels French territory</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "ZimParks initiates broad investigations as Lake Chivero becomes deadly for surrounding wildlife and aqua-life; suspects sewage runoff from Marimba area contaminating the water",
            "url": "https://www.newzimbabwe.com/zimparks-initiates-broad-investigations-as-lake-chivero-becomes-deadly-for-surrounding-wildlife-and-aqua-life-suspects-sewage-runoff-from-marimba-area-contaminating-the-water/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced that it has dispatched a team to conduct broader investigations at Lake Chivero after fish and wildlife succumbed to contaminated water over the past week.\n\nFour white rhinos, three zebras, birds and livestock died after drinking cyanobacteria-contaminated water from the lake.\n\nNewZimbabwe.com witnessed thousands of fish dead and dying over the weekend.\n\nZimParks spokesperson Tinashe Farawo in a statement said their first investigations have established that 1,000 fish died adding that sewage runoff from Marimba could be a trigger.\n\nFarawo said even more fish might die.\n\nPreliminary investigations indicate that sewage runoff from the Marimba area has forced contaminated water into multiple bays, creating hazardous conditions for aquatic life.\n\nHigh pollution results in a boom in algae growth, this increases oxygen demand on the water body resulting in high mortality for the fish.\n\nAs wind patterns continue to shift, we anticipate that this issue may further impact fish populations across the lake.\n\nIn response, our team is currently on the ground carrying out further investigations on a broader scale, he said.\n\nThe authority recently blamed Harare City Council for discharging raw sewage into the lake which is a primary source of water and a popular recreational spot for Harare residents and other surrounding communities.\n\nHowever, in an interview withNewZimbabwe.com, Harare Mayor Jacob Mafume said this is not a good time to play the blame game.\n\nMafume however acknowledged that Harare City Council is not solely responsiblefor the sewer which finds its way to the lake.\n\nWe as the city Yes, we have work to do in terms of raw sewage issues.\n\nHowever industry and other informal settlements and other poachers around the area are contributing to the degradation of the quality of water at Lake Chivero.\n\nIt needs all stakeholders approach to look at the number of activities that are happening around that area.\n\nAt this point, we need to stop finger-pointing, we need to find a solution.\n\nThe lake has been polluted over time and therefore it is very critical for us to quickly find a solution and find resources to deal with the contaminants that are affecting the lake, he said.\n\nResponding to questions on X, Mafume seemed not convinced that cyanobacteria caused the deaths of white rhinos.\n\nAs someone who has worked in the criminal justice system. The story is about a bacteria that targets four white rhinos and fish? Do we really need a Sherlock Holmes on this one? Gentlemen four rhinos have died, who killed them? Lake chivero! Really! Yes water is green and some fish died, he wrote.\n\nMafume said they are currently treating their sewer through the waterworks department and also sourcing funds from the government to deal with these issues.\n\nIn a statement issued Monday, Harare City Council said teams are already on the ground to take samples from the particular part of the lake the rhinos drink from.\n\nLake Chivero is abundant in various fish species, including tilapia and catfish.\n\nA number of registered fishing cooperatives and unregistered individual fishermen operate at the lake with their market largely being Harare residents.\n\nLake Chivero Recreational Park accommodates about 400 species.\n\nMeanwhile, according to the World Health Organisation (WHO), Cyanobacterial toxins occur naturally, but human activity influences the extent to which toxic cyanobacteria proliferate.\n\nWHO recommends management of lakes, reservoirs and rivers to prevent cyanobacterial blooms is critical to protect human health.\n\nThe specialised agency of the United Nations responsible for global public health also says marine cyanobacteria can cause severe skin lesions, for which, however, there is still a lack of dose-response information as a basis for estimating tolerable exposure levels.\n\nSome people may experience allergic reactions to cyanobacteria, whereas others may be unaffected.\n\nPeople may be exposed to cyanotoxins through oral, respiratory and dermal routes.\n\nIngestion may occur through drinking water or accidental uptake during water sports, recreational or occupational activities.\n\nIn some settings, contaminated food can be a source of dietary exposure.\n\nThis includes fish collected from bloom-ridden water bodies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17043723/WhatsApp-Image-2024-12-16-at-15.58.17.jpeg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced that it has dispatched a team to conduct “broader” investigations at Lake Chivero after fish and wildlife succumbed to contaminated water over the past week. Four white rhinos, three zebras, birds and livestock died after drinking cyanobacteria-contaminated water from the lake. NewZimbabwe.com</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-initiates-broad-investigations-as-lake-chivero-becomes-deadly-for-surrounding-wildlife-and-aqua-life-suspects-sewage-runoff-from-marimba-area-contaminating-the-water/\">ZimParks initiates broad investigations as Lake Chivero becomes deadly for surrounding wildlife and aqua-life; suspects sewage runoff from Marimba area contaminating the water </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabweans infuriated by proposal to not insure, licence vehicles without radio licences: says it targets motorists",
            "url": "https://www.newzimbabwe.com/zimbabweans-infuriated-by-proposal-to-not-insure-licence-vehicles-without-radio-licences-says-it-targets-motorists/",
            "content": "By Anna Chibamu\n\nZIMBABWEANS have poked holes into the proposed law which will see motorists without radio licences being denied the Zimbabwe National Road Administration (ZINARA) motor vehicle licenses and motor insurance policies.\n\nThe Portfolio Committee on Media, Information and Broadcasting Services held public hearings on the Broadcasting Services Amendment Bill this Monday.\n\nSome citizens who spoke on the proposed clause (15) of the amendment bill said it was improper for the government to push for a law that discriminates against motorists yet even people with phones have access to the radio.\n\nAccording to the amendment of Section 38B (Licencing of Listeners) Clause 15 of the Amendment Bill of the Principle Act is amended by the insertion of a new subsection (3) as follows (4)The Zimbabwe National Road Administration ZINARA and every motor insurance company shall only issue a motor vehicle licence and motor insurance policy respectively to individuals who either hold a current radio licence issued by the Zimbabwe Broadcasting Corporation ZBC or a valid exemption certificate from ZBC unless the vehicle to be insured is not equipped with a radio receiver; provided the licence applicant shall sign a declaration as specified in the Eighth Schedule.\n\nDuring the Public hearings this Monday, many said it was unfair for motorists not to be licenced by ZINARA if they do not own a radio licence.\n\nMost felt motorists were not the only people who listen to the radio because even those who own phones can now listen to the radio so they should not be left out.\n\nNowadays, even my grandmother can access the radio on the phone so why are you targeting motorists only? There must be a re-look on that aspect that mandates motorists. Some people have radios in their homes so they must also be made to pay licences for the radio like any other motorists, Costa Nkomo said.\n\nOne, Pastor Shadhaya asked; But who sponsors ZBC? I want to simplify things here. Let us take for example We have 15 million people, in the population of Zimbabwe. If 12 million own radios, TVs and phones. If we get just a dollar from those 12 million. How much will we raise? If we are honest enough and work together, we stop corruption, we move forward.\n\nHatitye added: On the licencing of motorists, I doubt the move will yield positive results. Ephraim Katiyo said; the fine of not having a licence must be high and not the licencing. Licencing must be as little as possible and be affordable, so I say licencing of radio fees must be very low.\n\nSome of the speakers called for improvement of the national broadcasters poor quality content.\n\nOur broadcaster is not pleasing. Why are people running away from watching ZBC.\n\nAnother contributor said, Focusing on motorists is very discriminatory. Fund the national broadcaster from the fiscus or look for resources from somewhere. Find sustainable and diversified ways to fund the broadcaster.\n\nFormer ZBC employee and Zanu PF representative Robson Mhandu raised issues including that the national broadcaster be governed by just one act.\n\nOn the licencing part, Mhandu told the committee: Zimbabwean citizens who are paying licenses, radio, television, they are paying for ownership of the gadget, it doesnt talk about the services provided, it doesnt talk about other critical issues.\n\nCan we consider changing that to not just ownership of a gadget, you may own a gadget that is not functional, that is not working, and you get harassed for ownership of that gadget.\n\nCan we do something about that? I believe its an old law, passed several years, I believe even before independence.\n\nMedia Monitors representative Green Kunyeda told the committee that, the approach of concentrating on motorists only, is a violation of the rights of those motorists.\n\nIt is my humble submission that the committee and all those behind the crafting of the bill actually find ways to fund the public broadcaster and, by consequence, other broadcasting players to the broadcasting fund. But what has to be done, is we need a more diverse and inclusive model of taping into the sources of, potential sources of revenue identified.\n\nFocusing on motorists alone is discriminating and narrows the net. Why cant we find other models, where, for example, as we import a television station, a television set, people can view the license at the border, they import, there is the television set is sold, another way is found how to generate that money.\n\nHe added that in other countries like Mozambique, they use a system where they view it on the electricity tariff.\n\nHowever, others felt it was justified to licence motorists to reduce time spent on the roads by the ZBC, police and ZINARA officials searching for defaulters who do not have radio licences thereby inconveniencing others.\n\nA member of the Global Alliance for Sustainable Development said, This view is a crucial step towards empowering us in our way of broadcasting cooperation services, to combat these effective global propositions and promote our national interest. By introducing a military license, we will be able to support our national protesters and safeguard our national security.\n\nAs a nation, we have been subjected to many great struggles that distinguished our image on a scale of migration. This bill presents an opportunity for us to take control of our airwaves and promote a narrative that reflects our true history and values.\n\nThe Committee is holding public hearings in all provinces this week and hopes to finalise the bill early next year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17051029/radio.webp",
            "description": "<p>By Anna Chibamu ZIMBABWEANS have poked holes into the proposed law which will see motorists without radio licences being denied the Zimbabwe National Road Administration (ZINARA) motor vehicle licenses and motor insurance policies. The Portfolio Committee on Media, Information and Broadcasting Services held public hearings on the Broadcasting Services Amendment Bill this Monday. Some citizens</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-infuriated-by-proposal-to-not-insure-licence-vehicles-without-radio-licences-says-it-targets-motorists/\">Zimbabweans infuriated by proposal to not insure, licence vehicles without radio licences: says it targets motorists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Harare Wetlands Trust issues 2-day ultimatum for council to resolve Lake Chivero Sewage crisis",
            "url": "https://www.newzimbabwe.com/harare-wetlands-trust-issues-2-day-ultimatum-for-council-to-resolve-lake-chivero-sewage-crisis/",
            "content": "By Thandiwe Garusa\n\nHARARE Wetlands Trust has given Harare City Council (HCC) a 48-hour ultimatum to address raw sewage contaminating Lake Chiveros water.\n\nThousands of fish, and four white rhinos, along with other wildlife and livestock, have perished after consuming water from the lake that was contaminated with cyanobacteria.\n\nIn a letter to the city council, Harare Wetlands Trust called for urgent measures to decontaminate the lake and take other necessary actions.\n\nIf the local authority fails to comply and address the situation, the Wetlands Trust through the Zimbabwe Lawyers for Human Rights (ZLHR) vowed to sue.\n\nFrom our clients professional experience and expertise, our client reasonably believes that the pollution by cyanobacteria in Lake Chivero is caused by the City of Harares conduct of constantly dumping raw sewage effluent in Lake Chivero over the years.\n\nOur client, being a not-for-profit organisation whose main objective, inter alia, is the environmental protection of all water bodies and aqua biodiversity and aqua deeply concerned that this dire situation can lead to the loss of animal life, aqua 1 aqua bio-diversity.\n\nOur client also understands that people carry out fishing activities in Lake Chivero in which they obtain fish for resale and consumption. This has a ripple effect on people consuming contaminated fish,the letter reads.\n\nAccording to the Zimbabwe Parks and Wildlife Management Authority (ZimParks), the water pollution was largely caused by raw sewage, particularly from the Marimba area in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17043748/WhatsApp-Image-2024-12-16-at-15.58.17-1.jpeg",
            "description": "<p>By Thandiwe Garusa HARARE Wetlands Trust has given Harare City Council (HCC) a 48-hour ultimatum to address raw sewage contaminating Lake Chivero’s water. Thousands of fish, and four white rhinos, along with other wildlife and livestock, have perished after consuming water from the lake that was contaminated with cyanobacteria. In a letter to the city</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-wetlands-trust-issues-2-day-ultimatum-for-council-to-resolve-lake-chivero-sewage-crisis/\">Harare Wetlands Trust issues 2-day ultimatum for council to resolve Lake Chivero Sewage crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabwe fined for slow over rate against Afghanistan, ICC says",
            "url": "https://www.newzimbabwe.com/zimbabwe-fined-for-slow-over-rate-against-afghanistan-icc-says/",
            "content": "AmuTv\n\nZimbabwes cricket team has been fined 10 percent of their match fees for maintaining a slow over-rate during the final T20 International against Afghanistan in Harare, the International Cricket Council (ICC) announced on Monday.\n\nAfghanistan won the match, clinching the series with a narrow three-wicket victory. The match concluded the three-game T20I series, which was part of Afghanistans all-format tour of Zimbabwe.\n\nThe charges were filed by on-field umpires Iknow Chabi and Forster Mutizwa, third umpire Percival Sizara, and fourth umpire Langton Rusere. Zimbabwes captain, Sikandar Raza, accepted the penalty and pleaded guilty to the offence, avoiding the need for a formal hearing, the ICC said in a statement.\n\nThe penalty was issued by match referee Andy Pycroft, a member of the Emirates ICC Elite Panel of Match Referees.\n\nThe ICC explained the ruling under its Code of Conduct: The charges were levelled in accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences. Players are fined five percent of their match fee for every over their side fails to bowl in the allotted time.\n\nZimbabwe and Afghanistan are now preparing for the three-match One-Day International series, which begins on Tuesday in Harare. Afghanistans visit to Zimbabwe is part of an all-format tour that will include T20Is, ODIs, and Test matches.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17061815/ZIM-T20-CHEVRONS.jpg",
            "description": "<p>AmuTv Zimbabwe’s cricket team has been fined 10 percent of their match fees for maintaining a slow over-rate during the final T20 International against Afghanistan in Harare, the International Cricket Council (ICC) announced on Monday. Afghanistan won the match, clinching the series with a narrow three-wicket victory. The match concluded the three-game T20I series, which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-fined-for-slow-over-rate-against-afghanistan-icc-says/\">Zimbabwe fined for slow over rate against Afghanistan, ICC says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Zimbabwe’s rural communities increasingly turn to food aid for survival as drought peaks",
            "url": "https://www.newzimbabwe.com/zimbabwes-rural-communities-increasingly-turn-to-food-aid-for-survival-as-drought-peaks/",
            "content": "Xinhua\n\nAmid the sweltering heat, Angela Gotore sits under a huge tent waiting to receive food aid mobilized by the Zimbabwean government in cooperation with aid agencies.\n\nChatting with her neighbor and occasionally casting her eyes on the stacks of grain, legumes, and vegetable oil, Gotore is among drought-stricken villagers of the Madyangove communal area in the Chivi District of Masvingo Province, who have become entirely dependent on food aid for survival.\n\nA devastating El Nino-induced drought in the previous season wiped out all the villagers crops and decimated pastures, leaving the villagers and their livestock grappling with food and water shortages.\n\nThe drought has left me and my fellow villagers scrounging for food and water. We are carrying a heavy burden to ensure that our children have the bare minimum to eat. But I want to thank the government and the donor agencies who have come to our rescue by giving us food, Gotore said at a recent food aid distribution event in Chivi.\n\nFredy Hapazari, head of the village, said the vital food items are an early Christmas present to the drought-weary villagers.\n\nWe are facing a very difficult situation because of the drought. Not only are we struggling with food shortages, but our livestock are also threatened by a lack of water and pasture. We are worried that if the rains do not come early, we may not be able to get a decent harvest in the coming season, he said, adding that the drought has also severely affected economic opportunities for youth in the drought-prone district.\n\nTo mitigate the effects of the drought, which has left more than half of Zimbabwes population food insecure, the Zimbabwean government is working with aid agencies, including the World Food Program (WFP), to distribute food aid to vulnerable people across the country during the lean season from December to March next year.\n\nAccording to the government, at least 7.6 million Zimbabweans are food insecure and will need food aid until March 2025 following the drought, which was declared a state of disaster by Zimbabwean President Emmerson Mnangagwa in April.\n\nThe UN food agency is targeting to provide emergency food aid to approximately 1 million people across Zimbabwe during the lean season, according to Barbara Clemens, country representative and director for the WFP in Zimbabwe.\n\nThe government of Zimbabwe remains committed to working hand in hand with the WFP to ensure that these resources are deployed effectively and reach those most in need  We are confident that we can continue to make meaningful progress in our fight against food insecurity and malnutrition, July Moyo, Zimbabwean minister of public service, labor and social welfare, said in a speech read on his behalf at the event.\n\nThe minister underscored the Zimbabwean governments commitment to ensuring that no one dies of hunger during the most vulnerable months of the lean season despite limited resources.\n\nWith the growing negative impacts of climate change on vulnerable communities in Zimbabwe, Clemens emphasized the need for stronger partnerships to meet immediate food needs and build community resilience to future climate shocks.\n\nOur work is far from over. More resources and cooperation are needed to reach those still in need, she said. We need to strengthen resilience at all levels, and we need to step up our preparedness efforts to be ready when the next shock occurs. This includes investing in climate-smart agriculture, scaling up social protection systems and climate risk insurance, and empowering communities to build sustainable livelihoods.\n\nShe noted that by addressing the root causes of vulnerability and enhancing preparedness, Zimbabwe can reduce the impacts of climate change and help communities withstand future challenges.\n\nAccording to Clemens, funding shortages remain a challenge, as the WFP has received only 50 million U.S. dollars out of the 201 million dollars it needs to respond to the El Nino-induced drought in the southern African country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/04072131/drought.jpg",
            "description": "<p>Xinhua Amid the sweltering heat, Angela Gotore sits under a huge tent waiting to receive food aid mobilized by the Zimbabwean government in cooperation with aid agencies. Chatting with her neighbor and occasionally casting her eyes on the stacks of grain, legumes, and vegetable oil, Gotore is among drought-stricken villagers of the Madyangove communal area</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-rural-communities-increasingly-turn-to-food-aid-for-survival-as-drought-peaks/\">Zimbabwe’s rural communities increasingly turn to food aid for survival as drought peaks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Sikandar Raza shoulders blame for Chevrons’ poor results",
            "url": "https://www.newzimbabwe.com/sikandar-raza-shoulders-blame-for-chevrons-poor-results/",
            "content": "By Sport Reporter\n\nChevrons star Sikandar Raza has taken the blame for the teams poor performance in the ongoing whiteball series against visiting Afghanistan.\n\nThis followed a 2-1 defeat against the visitors in the just-ended three-match T20 series.\n\nThe Chevrons are currently going through a rough patch as they are yet to win a home series this year.\n\nI think my team needs my runs, I am learning because if Im scoring runs, my team would be in a much better place.\n\nSome other guys are doing the roles that I am supposed to be doing, so I think Im short of runs in cricket especially the last four or five games I have had.\n\nIm letting the team down, and Im confident that I can train harder and hopefully win my country games, said Zimbabwe T20 team captain Sikandar Raza.\n\nThe all-rounder has been struggling with his batting form, during the just-ended three-match T20 series, he posted a total of 50 runs in all three games, that is 9 runs in the first game, followed by 35 runs in the second match and 6 runs on the last game.\n\nIn ODI format, the upcoming series against Afghanistan which kicks off on Tuesdaycomes at the back of a 2-1 defeat against Pakistan whom they hosted at Queens Sports Club in Bulawayo last month.\n\nDespite the poor form which was displayed by the team in the last two games of the three-match T20 series, Raza believes that Zimbabwe will pick itself in the ODI format.\n\nWe believe that good results are not too far away from us and this series ( T20) has shown us that.\n\nWe just need to continue working hard and give our best, added Raza.\n\nZimbabwe will round up the three-match ODI series against Afghanistan with two more games scheduled for Thursday and Saturday respectively before playing two test matches at Queens Sports Club in Bulawayo from December 26 up to January 2.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/23145821/raza-t2o.jpeg",
            "description": "<p>By Sport Reporter Chevrons star Sikandar Raza has taken the blame for the team’s poor performance in the ongoing whiteball series against visiting Afghanistan. This followed a 2-1 defeat against the visitors in the just-ended three-match T20 series. The Chevrons are currently going through a rough patch as they are yet to win a home</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikandar-raza-shoulders-blame-for-chevrons-poor-results/\">Sikandar Raza shoulders blame for Chevrons’ poor results</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Diaspora Insurance CEO nominated for another business gong",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-ceo-nominated-for-another-business-gong/",
            "content": "By UK Correspondent\n\nBIRMINGHAM:Diaspora InsuranceCEO, Jeff Madzingo, has been nominated for male entrepreneur of the year award at the Zimbabweans in Diaspora Homecoming Ceremony and Business Summit.\n\nWe are thrilled to congratulate on your nomination for the Male Entrepreneur Award! This is a remarkable achievement, and we are honoured to recognize your outstanding work, said the event organisers Zimbabweans in Diaspora Organisation (ZIDO.\n\nDiaspora Insurance CEO Jeff Madzingo\n\nSet to be held at the Golden Conifer Conference Centre in Harare this Friday and now its second year, the event brings together key stakeholders from the diaspora and local communities to foster networking, collaboration, and investment opportunities.\n\nKey speakers include Zimbabwes tourism and hospitality minister Barbara Rwodzi, CBZ Holdings CEO Lawrence Nyazema as well as WestProp head Ken Sharp.\n\nThis Diaspora Homecoming Dinner provides an invaluable opportunity for diasporans returning home for the holidays to connect, share their experiences of living abroad, and exchange notes on how to expand their business portfolios, said ZIDO chief executive officer Blessed Kapesa.\n\nHe added: The event is more than just a festive gathering, but serves as a strategic platform for exploring investment opportunities and recognising the diasporas significant contributions to Zimbabwes economy.\n\nMeanwhile, Madzingos nomination becomes his second major business recognition after he was named among the contenders for Top 1OO African Business Leaders and Entrepreneurs in the United Kingdom (UK) for 2024 by theAfrican Business Chamber (AfBC).\n\nLast monthMadzingowas also honoured by the Zim-UK business chamber, winning the Business Driver accolade for his significant contribution to supporting businesses and bringing people together.\n\nMadzingo has headed the UK-basedDiaspora Insurancesince its launch in 2012, overseeing the companys phenomenal growth from covering just two African countries to nineteen at present including new additions Cameroon, the Democratic Republic of Congo, Nigeria, Sierra Leone and Rwanda.\n\nFrom its recently acquired global headquarters in Birmingham, the company provides specialist and bespoke insurance products to African diasporans wherever they are based in the world.\n\nAfrican expatriates and transnationals worldwide can cover themselves in the diaspora as well as family members back home, guaranteeing peace of mind and ensuring theres no grieving and begging in times of bereavement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/16181635/Jeff-Madzingo-CEO.png",
            "description": "<p>By UK Correspondent BIRMINGHAM: Diaspora Insurance CEO, Jeff Madzingo, has been nominated for male entrepreneur of the year award at the Zimbabweans in Diaspora Homecoming Ceremony and Business Summit. “We are thrilled to congratulate on your nomination for the Male Entrepreneur Award! This is a remarkable achievement, and we are honoured to recognize your outstanding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-ceo-nominated-for-another-business-gong/\">Diaspora Insurance CEO nominated for another business gong</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "AOD 9604 Peptide: Properties and Hypothetical Functions",
            "url": "https://www.newzimbabwe.com/aod-9604-peptide-properties-and-hypothetical-functions/",
            "content": "Peptides are short chains of amino acids that play vital roles in the human body, acting as signaling molecules or mimicking natural hormones. Among the various peptides gaining traction in research and therapeutic settings is AOD 9604, a modified fragment of human growth hormone (HGH). This peptide is renowned for its potential fat-reducing properties without triggering the typical growth effects associated with HGH. In this article, well explore the properties, hypothetical functions, and potential applications of AOD 9604, while discussing where you canbuy AOD 9604from reliable sources like EnhancedPeptides.\n\nAOD 9604 is a synthetic peptide derived from the C-terminal fragment of HGH. Specifically, it includes amino acids 176191 of the HGH molecule. By isolating this fragment, researchers focused on retaining the fat-burning benefits of HGH without its broader effects on growth, making it a unique and targeted therapeutic candidate.\n\nDeveloped initially as an anti-obesity agent, AOD 9604 mimics the fat-burning properties of natural growth hormone by stimulating lipolysis (fat breakdown) and inhibiting lipogenesis (fat storage). Unlike full-length HGH, it does not bind to growth hormone receptors, minimizing unwanted side effects such as increased insulin resistance or elevated IGF-1 levels.\n\nWhile AOD 9604 is not yet FDA-approved for medical use, ongoing studies and anecdotal reports suggest several potential benefits:\n\nThe most researched function of AOD 9604 is its ability to aid in weight loss by promoting fat breakdown. For individuals struggling with obesity, it could provide a targeted solution to reduce fat deposits, particularly in stubborn areas like the abdomen or thighs.\n\nSome studies hypothesize that AOD 9604 may benefit joint repair and cartilage health. Though this area requires further investigation, its anti-inflammatory properties could make it a useful tool for athletes or individuals dealing with joint issues.\n\nBy supporting fat metabolism and potentially reducing inflammation, AOD 9604 might help individuals recover faster from physical exertion. This could make it appealing for fitness enthusiasts or athletes looking to optimize performance.\n\nAs part of HGH-derived peptides, AOD 9604 is being studied for potential anti-aging effects. These benefits may include improved metabolism, energy levels, and overall vitality.\n\nFor those interested in purchasing AOD 9604 for research purposes, its crucial to choose reliable vendors.PeptideSourceis a trusted platform offering high-quality peptides for laboratory research. They ensure purity, authenticity, and compliance with industry standards. Whether youre a researcher or medical professional, sourcing peptides like AOD 9604 fromPeptideSourceguarantees youre getting a product that meets the necessary specifications.\n\nIn many regions, AOD 9604 is available for research purposes but is not approved for human consumption or as a therapeutic drug. Individuals considering its use should consult local regulations and understand its experimental status. Additionally, its advisable to seek guidance from medical professionals before considering peptides for personal use.\n\nSeveral studies highlight AOD 9604s effectiveness in promoting fat loss. For instance, preclinical trials in rodents demonstrated significant reductions in body fat without affecting lean body mass. Human trials also showed promising results, with participants reporting fat loss without the metabolic side effects typically associated with HGH.\n\nDespite these findings, more robust clinical trials are needed to confirm its efficacy and safety in broader populations. Researchers continue to investigate its mechanisms and potential applications in obesity management and other metabolic conditions.\n\nThe appeal of AOD 9604 lies in its targeted action. Unlike traditional weight-loss solutions that can have systemic effects or require lifestyle overhauls, AOD 9604 focuses specifically on fat metabolism. Its ability to trigger lipolysis while inhibiting fat storage could make it a game-changer for obesity treatments in the future.\n\nAdditionally, the peptides favorable safety profile and minimal side effects compared to HGH add to its promise as a therapeutic agent.\n\nAOD 9604 aligns with the growing trend of using peptides for targeted therapies. Researchers are increasingly exploring peptides like AOD 9604 as alternatives to traditional pharmaceuticals, thanks to their specificity and reduced risk of systemic side effects.\n\nAOD 9604 is a peptide with immense potential in the fields of weight management, joint health, and anti-aging. Its ability to promote fat loss without the growth-related effects of HGH has made it a focus of ongoing research. While it is not yet approved for therapeutic use, its promising safety profile and targeted functions make it an exciting candidate for future developments in peptide therapy.\n\n",
            "image_url": null,
            "description": "<p>Peptides are short chains of amino acids that play vital roles in the human body, acting as signaling molecules or mimicking natural hormones. Among the various peptides gaining traction in research and therapeutic settings is AOD 9604, a modified fragment of human growth hormone (HGH). This peptide is renowned for its potential fat-reducing properties without</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/aod-9604-peptide-properties-and-hypothetical-functions/\">AOD 9604 Peptide: Properties and Hypothetical Functions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Mpox cases in Africa surpass 65,000 mark: Africa CDC",
            "url": "https://www.newzimbabwe.com/mpox-cases-in-africa-surpass-65000-mark-africa-cdc/",
            "content": "Xinhua\n\nThe number of Mpox cases reported so far this year in Africa has surpassed 65,000, as the death toll surged to over 1,200, according to the Africa Centers for Disease Control and Prevention (Africa CDC).\n\nThe African continent had reported 65,711 Mpox cases since the start of this year, of which 14,241 were confirmed, and over 1,237 deaths, according to Africa CDC Director-General Jean Kaseya.\n\nDuring last week alone, the continent reported 3,545 new cases, including 467 confirmed ones, and 37 new deaths, according to data from the African Unions specialised healthcare agency.\n\nThe Africa CDC said six African countries, namely Gabon, Guinea, South Africa, Morocco, Zambia, and Zimbabwe, have moved from active transmission to a controlled stage. The African continent is still losing people due to the ongoing Mpox outbreak, which has so far affected 20 countries, Kaseya said, calling for concerted efforts against the outbreak.\n\nIn mid-August, the Africa CDC declared the ongoing Mpox outbreak in Africa a Public Health Emergency of Continental Security. Soon after, the World Health Organization also declared Mpox a public health emergency of international concern, activating its highest level of global alert for Mpox for the second time in two years.\n\nMpox, known as monkeypox, was first detected in laboratory monkeys in 1958. It is a rare viral disease typically spread through body fluids, respiratory droplets, and other contaminated materials. The infection usually causes fever, rash, and swollen lymph nodes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14052550/mpox.jpg",
            "description": "<p>Xinhua The number of Mpox cases reported so far this year in Africa has surpassed 65,000, as the death toll surged to over 1,200, according to the Africa Centers for Disease Control and Prevention (Africa CDC). The African continent had reported 65,711 Mpox cases since the start of this year, of which 14,241 were confirmed,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mpox-cases-in-africa-surpass-65000-mark-africa-cdc/\">Mpox cases in Africa surpass 65,000 mark: Africa CDC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:38",
            "date": "17 Dec 2024"
        }
    ]
}