{
    "news": [
        {
            "title": "ZIMSEC releases November 2024 ‘O’ Level results",
            "url": "https://www.newzimbabwe.com/zimsec-releases-november-2024-o-level-results/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe School Examinations Council (ZIMSEC) has announced the release of the November 2024 Ordinary Level examinations results.\n\nThe latest results reflect marked improvement in the pass rate, which rose to 33.19% from 29.41% in 2023 and 28.96% in 2022.\n\nAddressing journalists in Harare this Friday, ZIMSEC board chairperson Professor Paul Mapfumo confirmed that the results will be accessible onlinefor the next five days.\n\nThe Zimbabwe School Examinations Council board and management would like to advise the nation of the release of the 2024 November Ordinary Level examination results, Mapfumo said.\n\nExamination centre heads would be able to collect results for their schools or centres from regional offices starting Monday, 20 January 2025, Mapfumo said.\n\nThe timely release of the O Level results followed the announcement of Advanced Level exams results last Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04192721/Zimbabwe-Examination-pupil.jpeg",
            "description": "<p>By Staff Reporter  THE Zimbabwe School Examinations Council (ZIMSEC) has announced the release of the November 2024 Ordinary Level examinations results. The latest results reflect marked improvement in the pass rate, which rose to 33.19% from 29.41% in 2023 and 28.96% in 2022. Addressing journalists in Harare this Friday, ZIMSEC board chairperson Professor Paul Mapfumo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimsec-releases-november-2024-o-level-results/\">ZIMSEC releases November 2024 ‘O’ Level results</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "Magaya ZIFA challenge: Judge reserves judgement to Thursday",
            "url": "https://www.newzimbabwe.com/magaya-zifa-challenge-judge-reserves-judgement-to-thursday/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge, Justice Tawanda Chitapi has reserved to Thursday, his judgement in a matter Yadah Stars founder Walter Magaya is challenging his disqualification to contest as Zimbabwe Football Association (ZIFA) president.\n\nThe cleric-cum-sportsman took Zifa to court after he was disqualified arguing that he was illegally removed from the list.\n\nThis Friday, parties met before Chitapi, with Magayas lawyer Advocate Thabani Mpofu arguing that the decision by the ZIFA ethics committee should be reversed.\n\nThe lawyer also said the ethics committee acted in an abnormal manner which bordered on corruption.\n\nMpofu said their case was simple and carried weight.\n\nWhat brings us to court is a simple and very straightforward issue. The requirement set out in the ZIFA Constitution is clear, it says O Level or an equivalent qualification.\n\nIf a qualification issued by a university is even better than O Level, on that, this application ought to succeed, Mpofu said.\n\nMagaya submitted a diploma from the University of South Africa (UNISA).\n\nThe respondents show that they are alive to a fact that they have to give reasons for the disqualification. But what they have not done is to give reasons to say that the documents they received do not amount to a qualification.\n\nWhat the Constitution establishes is a minimum requirement. The tariff in the statute is a minimum qualification.\n\nThe Electoral Code envisages the candidates may fail to meet requirements by failing to produce certain documentsand when they fail, they dont get disqualified, Mpofu submitted.\n\nMpofu also said Magaya failed to produce an O Level certificate, and this does not mean he doesnt have that certificate.\n\nHe said the ZIFA Constitution says a candidate should be given seven days to do so.\n\nIt gives you time within which to comply. Should there be a dispute on what a candidate would have given them, it will be a time to contest that.\n\nMpofu said none of the respondents have the powers to disqualify prospective candidates.\n\nWe challenge the respondents to identify a provision that allow them to disqualify a candidate, he said.\n\nMpofu said his client had a chat with Lincoln Mutasa, ZIFA normalisation committee chairperson who told him that the issue of qualifications was not the reason they disqualified him.\n\nHe said his client will challenge Mutasa to dispute that.\n\nWhere is Mutasas rebuttal. Where is his affidavit to say this was not the reason why they disqualify him..the decision has to be reviewed and set aside, Mpofu said.\n\nProfessor Lovemore Madhuku representing ZIFA argued that Magayas application was not properly before the court.\n\nThe decisions of the respondent are not reviewable by this court. We dont know the basis on which we as ZIFA we are being brought to court, he said.\n\nMadhuku argued that ZIFA is a non-profit organisation and is not an administrative organisation.\n\nIt is nothing else, it is a private organisation and the law is very clear that you can only review disputes of administrative authorities.\n\nYou should simply strike off this application for not meeting the requirements of the court.\n\nDuring the hearing Chitapi said ZIFA was supposed to bring a record of proceedings, which culminated in Magayas disqualification.\n\nIf that record exist it should be brought before the court to ascertain who took that decision. Without the record there is nothing to talk about. The rules say that they have a duty to ensure that the record should be made available.\n\nThe issue is the law says there should be that record, the submissions should speak on the action which was taken, Chitapi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga  HIGH Court judge, Justice Tawanda Chitapi has reserved to Thursday, his judgement in a matter Yadah Stars founder Walter Magaya is challenging his disqualification to contest as Zimbabwe Football Association (ZIFA) president. The cleric-cum-sportsman took Zifa to court after he was disqualified arguing that he was illegally removed from the list. This</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-zifa-challenge-judge-reserves-judgement-to-thursday/\">Magaya ZIFA challenge: Judge reserves judgement to Thursday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "Man sets hut on fire, strikes wife to death with a hoe",
            "url": "https://www.newzimbabwe.com/man-sets-hut-on-fire-strikes-wife-to-death-with-a-hoe/",
            "content": "By Staff Reporter\n\nPOLICE in Masvingo are investigating a case involving arson, murder and attempted murder after a Mwenezi man set ablaze a hut before striking fleeing occupants with a hoe.\n\nThe assault resulted in the death of the assailants wife while his mother-in-law sustained serious injuries during the attack.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the arrest of 30-year-old Trust Bhonde for the heinous acts.\n\nThe ZRP confirms the arrest of Trust Bhonde (30) in connection with a case of murder and attempted murder which occurred at Sikomo Village, Mwenezi on January 12, 2025 in which his wife, Nollen Rivete (27) died.\n\nThe suspect allegedly set a kitchen hut ablaze in which the victim and his mother-in-law, Manyuke Sasai (50) were sleeping in, said Nyathi.\n\nIn a fit of rage, the suspect armed himself with a hoe and started striking his in-law and wife.\n\nSubsequently, the suspect went on to strike his mother-in-law on the head with a hoe before hitting his wife several times on the head as they escaped from the burning hut.\n\nResultantly, Manyuke Sasai sustained head injuries and became unconscious while Nollen Rivete sustained head injuries and succumbed to the injuries, said Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/17050156/hut-on-fire.jpg",
            "description": "<p>By Staff Reporter POLICE in Masvingo are investigating a case involving arson, murder and attempted murder after a Mwenezi man set ablaze a hut before striking fleeing occupants with a hoe. The assault resulted in the death of the assailant’s wife while his mother-in-law sustained serious injuries during the attack. Zimbabwe Republic Police (ZRP) national</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-sets-hut-on-fire-strikes-wife-to-death-with-a-hoe/\">Man sets hut on fire, strikes wife to death with a hoe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "US envoy reflects on late President Jimmy Carter’s role on Zim",
            "url": "https://www.newzimbabwe.com/us-envoy-reflects-on-late-president-jimmy-carters-role-on-zim/",
            "content": "By Alois Vinga\n\nTHE United States ambassador to Zimbabwe, Pamela Tremont on Thursday dedicated the largest conference room at the Harare chancery to late former President Jimmy Carter.\n\nThe gesture is in honour of the late former US leaders hope for a better Zimbabwe hinged on deeper political stability.\n\nCarter is credited for playing a pivotal role in Zimbabwes peace settlement following the decision by his administration to assemble ahigh-powered negotiating team, led bythen UN Ambassador Andrew YoungandSecretary of State CyrusVance, to coordinate with the British and hammer out a settlement.\n\nThese negotiations, spearheaded by the Americans, led to the Lancaster House talks in Britain, the free elections in 1980 and the black majority rule in an independent Zimbabwe.\n\nSpeaking to guests at the honouring ceremony, Tremont said the late iconic leaders role in Zimbabwe must never go unmentioned.\n\nHis commitment to Zimbabwes future was not just a political decision but a deeply personal conviction that all people should have an opportunity to contribute to the future of their nation. It is fitting that this room, used to bring people together, bears the name of a leader who believed in the power of diplomacy and peace-making, she said.\n\nPresident Jimmy Carter meets with Zimbabwe Prime Minister Robert Mugabe in the Oval Office in Washington, on Aug. 27, 1980. (AP Photo/Barry Thumma, File)\n\nForeign Affairs Minister, Prof Amon Murwira who also graced the event expressed gratitude for the noble gesture.\n\nFormer President Jimmy Carters commitment to human rights and justice was instrumental during Zimbabwes journey to independence. We extend our heartfelt gratitude to all who contributed to Zimbabwes independence  those who fought bravely for freedom and those who supported them from afar, including the late President Carter, he said.\n\nThe event concluded with a video message from former U.S. Ambassador to the United Nations Andrew Young, who was Carters lead negotiator in support of Zimbabwes independence.\n\nNow aged 92, Ambassador Young shared a message about his meetings with independent Zimbabwes first leaders.\n\nWere very proud of our relationship to Zimbabwe. Thank you very much for remembering my boss, Jimmy Carter, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/17045129/Jimmy-Carter-naming-event.jpg",
            "description": "<p>By Alois Vinga THE United States ambassador to Zimbabwe, Pamela Tremont on Thursday dedicated the largest conference room at the Harare chancery to late former President Jimmy Carter. The gesture is in honour of the late former US leader’s hope for a better Zimbabwe hinged on deeper political stability. Carter is credited for playing a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-envoy-reflects-on-late-president-jimmy-carters-role-on-zim/\">US envoy reflects on late President Jimmy Carter’s role on Zim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "Stop this nonsense! Chamisa blasts Zanu PF’s push for Mnangagwa’s third term",
            "url": "https://www.newzimbabwe.com/stop-this-nonsense-chamisa-blasts-zanu-pfs-push-for-mnangagwas-third-term/",
            "content": "By Thandiwe Garusa\n\nOpposition politician Nelson Chamisa has slammed President Emmerson Mnangagwas bid for a third term, describing it as nonsense that will only worsen Zimbabwes problems.\n\nTheruling Zanu-PF party wants to extend Mnangagwas term in officeand delay the 2028 electionsby two years until 2030 and has already started canvassing for support.\n\nZimbabwes constitution limits the presidential office to two five-year terms, and Mnangagwa is currently serving his second and final term.\n\nChamisa who lost the general election that was described by observers as having fallen short of international and regional standards said extending his nemesis Mnangagwas term would be extending electoral fraud.\n\nStop this nonsense!You want to extend pain and suffering,extreme and deadening poverty.\n\nYou want to extend unemployment,hunger and lack,power outages, electricity and water shortages.\n\nYou want to extend this currency crisis and cash shortages,high taxes and skyrocketing prices.You want to extend oppression,fear, hate and intimidation.\n\nYou stole the peoples mandate, hopes and votes. And you want to extend that theft. You cannot extend theft. It cannot. Stop it! Chamisa wrote on his social media pages.\n\nMeanwhile, Zanu PFs Bikita West Member of Parliament Energy Mutodi drafted a motion to initiate constitutional amendments to facilitate the contentious extension of Mnangagwas term, as well as the terms of parliament and local government, beyond 2028.\n\nThe draft motion has drawn widespread criticism, with the ruling elite accused of colluding to undermine the constitution to support Mnangagwas efforts to remain in power.\n\nChamisa said Mnangagwas term cannot be extended as this will fuel Zimbabwes economic crisis.\n\nYou want to extend terror and violence, conflict, the nations isolation, looting and corruption. You want to extend bribery and chicanery, to the dying hospitals and the dying in hospitals.\n\nYou want to extend the chaos in education, the suffering of teachers under squalid conditions, the suffering of workers and civil servants, the suffering of pensioners and the closing down of businesses.\n\nYou want to extend the capital flight and brain drain. You cannot! he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Thandiwe Garusa Opposition politician Nelson Chamisa has slammed President Emmerson Mnangagwa’s bid for a third term, describing it as “nonsense” that will only worsen Zimbabwe’s problems. The ruling Zanu-PF party wants to extend Mnangagwa’s term in office and delay the 2028 elections by two years until 2030 and has already started canvassing for support. Zimbabwe’s constitution limits</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stop-this-nonsense-chamisa-blasts-zanu-pfs-push-for-mnangagwas-third-term/\">Stop this nonsense! Chamisa blasts Zanu PF’s push for Mnangagwa’s third term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "Disappointed by the outcome – Jailed Mpofu, Chimombe to file an appeal following dismissal of bail application",
            "url": "https://www.newzimbabwe.com/disappointed-by-the-outcome-jailed-mpofu-chimombe-to-file-an-appeal-following-dismissal-of-bail-application/",
            "content": "By Mary Taruvinga\n\nEmbattled business partners Moses Mpofu and Mike Chimombe have said they will be approaching the Supreme Court to appeal against a High Court ruling dismissing their application for bail pending appeal.\n\nThe two are accused of siphoning US$7 from the government using a non-existent company which had won a tender to supply goats for the Presidential Goats Scheme.\n\nHigh Court judge Justice Pisirayi Kwenda on Thursday threw out the duosapplication ruling that they are facing a very serious offence which could land them in jail for 20 years if convicted.\n\nThrough their lawyer, the partners said they are not happy with the ruling and do not agree with Kwendas reasoning in denying them bail.\n\nWe respect the judgement of the court, we have taken note of the courts advice but we are clearly disappointed by the outcome,  said Professor Lovemore Madhuku who is representing Chimombe.\n\nHe added, We are also not in agreement with the reasoning of the judge.\n\nOur clients have a right to appeal to the Supreme Court and we have been given instructions to do so, so we will be appealing as soon as we get the full judgment.\n\nThe two have been in jail since their arrest in June last year.\n\nTheir several bail applications were dismissed by both the Magistrates and the High Court.\n\nTheir trial is expected to commence on February 10, running on a continuous roll.\n\nThe two will be back in court this Friday for a bail hearing in another case they are accused of abusing State funds in a botched streetlights tender scandal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga Embattled business partners Moses Mpofu and Mike Chimombe have said they will be approaching the Supreme Court to appeal against a High Court ruling dismissing their application for bail pending appeal. The two are accused of siphoning US$7 from the government using a non-existent company which had won a tender to supply</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/disappointed-by-the-outcome-jailed-mpofu-chimombe-to-file-an-appeal-following-dismissal-of-bail-application/\">Disappointed by the outcome – Jailed Mpofu, Chimombe to file an appeal following dismissal of bail application</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "EcoCash escalates digital platforms’ efficiency",
            "url": "https://www.newzimbabwe.com/ecocash-escalates-digital-platforms-efficiency/",
            "content": "By Alois Vinga\n\nLEADING financial technology firm, EcoCash Holdings has escalated digital platform efficiencies which will go a long way in spurring customer experience.\n\nPresenting a Trading Update for the third quarter period ended November 30 2024, EcoCash company secretary, Charmaine Daniels revealed details on the latest innovative strides.\n\nThe Bank introduced a new and innovative Omni Channel platform; a unified, secure digital platform, enhancing customer experience and security. This platform integrates essential banking services, including account and card management, bill payments, and fund transfers, she said.\n\nDaniels said the Bank also launched a new ZIPIT Fund Transfers service which enables customers to transfer funds from any Foreign Currency Account or Mobile Wallet directly to their Steward Bank VISA card using the ZIPIT platform with speed, convenience, and flexibility.\n\nThe Bank further enhanced its service offerings with the implementation of card-less withdrawals and deposits through its intelligent ATMs, thereby affording customers heightened convenience and flexibility in conducting transactions, she said.\n\nMeanwhile, revenues for the quarter ended 30 November 2024 increased by 80% over the revenues for the previous quarter.\n\nThe Bank maintained its strategy of improving operational efficiencies through leveraging technology. This increased operating profit. The Bank is compliant with Tier 1 Capital requirements as prescribed by the Reserve Bank of Zimbabwe.\n\nEcoCash Holdings continues to focus on identifying and developing opportunities in the market that are consistent with providing convenient digital solutions to the increasing customer demands. The Organisation will continue to adapt to the changes in the operating environment and implement strategies to create shareholder value and maximize returns, added Daniels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/13101737/ecocash-scaled.jpeg",
            "description": "<p>By Alois Vinga LEADING financial technology firm, EcoCash Holdings has escalated digital platform efficiencies which will go a long way in spurring customer experience. Presenting a Trading Update for the third quarter period ended November 30 2024, EcoCash company secretary, Charmaine Daniels revealed details on the latest innovative strides. “The Bank introduced a new and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ecocash-escalates-digital-platforms-efficiency/\">EcoCash escalates digital platforms’ efficiency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "Zimbabwe to assist South Africa to identify Stilfontein illegal miners",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-assist-sa-to-identify-stilfontein-illegal-miners/",
            "content": "eNCA\n\nSTILFONTEIN  The Zimbabwean consulate is prepared to work with the South African government to verify and identify its citizens from Stilfontein mine in North West.\n\nZimbabwean consulate general Eria Phiri says this partnership is to ensure that the whole process is brought to a conclusion and finality.\n\nPhiri says the verification and identification process will also be done for the 465 illegal miners who have been brought to the surface alive.\n\nThe death toll in Stilfontein has risen to 87 with 246 survivors.\n\nIt is believed that nearly 2000 illegal miners were in the mine in August, and over 1000 have since been arrested.\n\nThe rescue operation at Stilfontein has come to an end.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>eNCA STILFONTEIN – The Zimbabwean consulate is prepared to work with the South African government to verify and identify its citizens from Stilfontein mine in North West. Zimbabwean consulate general Eria Phiri says this partnership is to ensure that the whole process is brought to a conclusion and finality. Phiri says the verification and identification</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-assist-sa-to-identify-stilfontein-illegal-miners/\">Zimbabwe to assist South Africa to identify Stilfontein illegal miners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "Zimbabwe’s business sector in survival mode as inflation and currency woes bite",
            "url": "https://www.newzimbabwe.com/zimbabwes-business-sector-in-survival-mode-as-inflation-and-currency-woes-bite/",
            "content": "Business Report\n\nZimbabwean companies are grappling with severe economic challenges, including soaring inflation, a skewed exchange rate, and escalating operational costs, forcing some to retrench workers and others to reduce stock levels.\n\nAmong the hardest hit is Tongaat Huletts Zimbabwean subsidiary, Triangle, which announced job cuts after other cost-saving measures failed. Retailers like OK Zimbabwe are also struggling, with de-stocking becoming a growing concern as businesses navigate the countrys volatile economic landscape.\n\nAn uncertain monetary framework, characterised by run away inflation, a skewed exchange rate and pricing distortions, has left corporates in Zimbabwe battling for survival. Some of them have had to retrench while the retailers are de-stocking.\n\nZimbabwe is already battling a high unemployment rate that has driven droves of locals to seek greener pastures in South Africa and elsewhere on the region and internationally at a time the countrys economic challenges are mounting.\n\nTongaat Huletts Zimbabwean unit, Triangle, said this week that it was facing operational challenges that had forced it to retrench employees after cost cutting measures failed to yield a respite.\n\nThe current economic environment in Zimbabwe has presented unprecedented challenges for Triangle Limited over the past [three] years. After careful deliberation and extensive evaluation of our operational and economic realities, we have made the extremely difficult decision to implement a phased retrenchment process, Tendai Masawi, the managing director of Triangle, said in a note to employees this week.\n\nHe cited escalating operational costs particularly in areas such as fertiliser, fuel, maintenance costs and imported goods/services, combined with inflationary pressures, currency losses, the inability to claim VAT on inputs after sugar was exempted from VAT, and competition from low cost duty-free imported sugar as having severely impacted the companys ability to sustain continued production.\n\nTriangle, which housed Tongaat Huletts Zimbabwean interests that also include Hippo Valley, said it had seen profit margins decline significantly by 55%with manpower costs is spiking by 133% as a proportion of revenue, and debt levels rising to unsustainable levels.\n\nTriangle had thus been unable to generate positive cash flows from its operating activities over the past three years as it had faced a very constrained working capital position.\n\nThese financial realities underscore the urgent need for corrective action so that the business can generate sufficient cash flows to reduce debt and reinvest in its future. This (retrenchment) decision has been taken to protect the long-term sustainability of our organisation and ensure that Triangle Limited continues to play its vital role in Zimbabwes economy, the company said.\n\nTongaat Hulett Limited, is currently preparing to dispose of the Zimbabwe operations to the owners of the Vision Group for about R5.9 billion. The Zimbabwe operations for Tongaat Hulett were among a few stable divisions under the crisis ridden and troubled South African sugar and agro-processing unit that also had operations in Mozambique.\n\nRetailers are equally affected, with OK Zimbabwe and other operators like Choppies reducing stock levels due to policies that mandate local currency transactions despite widespread use of foreign currencies.\n\nDe-stocking levels across most of OK Zimbabwes outlets have raised the alarm and concerns that the company is buckling under Zimbabwes policies that force retailers to trade in local currency against widespread use of foreign currencies in a country battling for currency stability.\n\nIn a statement, OK Zimbabwe acknowledged that it had faced stocking levels over the past few weeks. The company faced intermittent product supply challenges during the festive period. The Company, as well as most of the formal retail sector, has been adversely impacted by a volatile operating environment, said OK Zimbabwe.\n\nMeanwhile, manufacturers like Mega Mart have appealed to government officials for structural reforms to expand the formal sector, which they argue would boost tax revenues and support economic recovery.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>Business Report Zimbabwean companies are grappling with severe economic challenges, including soaring inflation, a skewed exchange rate, and escalating operational costs, forcing some to retrench workers and others to reduce stock levels. Among the hardest hit is Tongaat Hulett’s Zimbabwean subsidiary, Triangle, which announced job cuts after other cost-saving measures failed. Retailers like OK Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-business-sector-in-survival-mode-as-inflation-and-currency-woes-bite/\">Zimbabwe’s business sector in survival mode as inflation and currency woes bite</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        },
        {
            "title": "“You are punished for doing the right thing” – top official who survived two murder attempts says Harare City Council now a ‘Mafia organisation’",
            "url": "https://www.newzimbabwe.com/you-are-punished-for-doing-the-right-thing-top-official-who-survived-two-murder-attempts-says-harare-city-council-now-a-mafia-organisation/",
            "content": "By Darlington Gatsi\n\nHARARE City Councils acting Director of Human Capital, Bosman Matengarufu, who claims there were two attempts on his life after he initiated investigations into some of the local authoritys officials has described the Town House as a mafia-like territory.\n\nMatengarufu said his food was poisoned twice following his attempts to investigate and bring order to the beleaguered Harare City Council.\n\nOn one occasion, his office was broken into, and several importantdocuments implicating some officials in transgressions went missing,prompting Matengarufu to use a briefcaseoffice.\n\nMatengarufu on Monday told the Harare Commission of Inquiry led by retired judge Justice Maphios Cheda that the working environment at the Town House is toxic.\n\nBosman Matengarufu\n\nMy office was broken into in March 2021 and up to now it is not secure. I do not keep records there, I move with my office, he said.\n\nIn 2020, Matengarufu was chased away from a workshop by fellow council officials.\n\nHe also claimed that his home was raided by robbers and his security guard sustained some injuries.\n\nThe situation at the Town House is so chaotic that even suspended officials show up for work in violationof laws governing workers serving suspensions.\n\nHe said bringing normalcy to HCC is impossible as the overtures are thwarted by senior officials with Town Clerk, Hosiah Chisango being fingered.\n\nAdded Matengarufu, You can describe it like that (chaotic) but myself I say it is a toxicenvironment. When you want to do the right thing you are penalised for doing the right thing or you are just ignored like I have written to the Town Clerk. I was like a lone figure in the chaos you are trying to describe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25025158/Harare-Town-House.png",
            "description": "<p>By Darlington Gatsi HARARE City Council’s acting Director of Human Capital, Bosman Matengarufu, who claims there were two attempts on his life after he initiated investigations into some of the local authority’s officials has described the Town House as a “mafia-like territory”. Matengarufu said his food was poisoned twice following his attempts to investigate and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-are-punished-for-doing-the-right-thing-top-official-who-survived-two-murder-attempts-says-harare-city-council-now-a-mafia-organisation/\">“You are punished for doing the right thing” – top official who survived two murder attempts says Harare City Council now a ‘Mafia organisation’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "18 Jan 2025"
        }
    ]
}