{
    "news": [
        {
            "title": "Fuel better, run better: What to consume before, during and after your run",
            "url": "https://www.newzimbabwe.com/fuel-better-run-better-what-to-consume-before-during-and-after-your-run/",
            "content": "UAB News\n\nPeople are running. Running to exercise. Running to socialize. Running to achieve personal goals with every mile completed.\n\nWhen all one needs is a good pair of shoes, running seems like an easy activity to start. However, running requires preparation and training, both physically and mentally.\n\nAn avid runner herself, Camille Worthington, Ph.D., assistant professor and registered dietitian in theUniversity of Alabama at BirminghamDivision of General Internal Medicine and Population Science,discusses an important aspect to ones running success  how to fuel the body.\n\nWhen fueling your body, it is easy to fall behind and hard to catch up, Worthington said. However, proper fueling before, during and after a run is essential to hitting your goals while keeping your body safe and healthy.\n\nProper fueling before, during and after running is essential to hitting goals and keeping your body safe and healthy.\n\nKnow your fuels\n\nComplex carbohydrates have slow digestion and absorption rates. They are a good source for sustained energy, which is needed for longer runs. Complex carbs include whole wheat breads, whole grain crackers and vegetables.\n\nSimple carbs are quickly digested and absorbed. They are sources of quick but short-term energy, which is beneficial during runs when one needs an energy boost. Simple carbs include pasta, white bread, chips, cookies and candy.\n\nProtein offers many benefits for the body. For runners, it plays a crucial role in muscle recovery and helps reduce hunger. Proteins include lean meats, dairy products, eggs, yogurt and nuts.\n\nElectrolytes, such as sodium,help maintain fluid and hydration levels in the body. Electrolytes are lost through sweat during exercise. Low levels can lead to muscle cramps, dehydration and dizziness. Electrolytes are naturally found in such foods as leafy greens, avocados, pickles, nuts and bananas.\n\nProducts such as gels, gummies, water, electrolyte packets, bars and salt tabs are popular fuel sources for runners. They often contain higher concentrations of carbs and electrolytes, such as sodium.\n\nTime it out\n\nProperly timing the intake of the fuels is as important as knowing what fuels to consume, Worthington says.\n\nFuel recommendations prior to a run depend on when one wants to eat. If you eat several hours before, focus on a mix of complex and simple carbs to increase different types of energy within the body. If you prefer eating closer to the run, prioritize simple carbs the body can quickly digest.\n\nStay hydrated with water before the run. For runs longer than an hour or in hot weather, preload with electrolytes.\n\nDuring a run, focus on simple carbs for bursts of energy. Complex carbs during a run can lead to sluggishness and gastrointestinal issues due to their slow digestion rate. Maintaining hydration levels with water, electrolytes and sodium is also a priority.\n\nStay hydrated with water before the run.\n\nFor runs longer than an hour or in hot weather, preload with electrolytes.After a run, mix complex carbs with protein. The carbs restore glucose stores in your liver and muscles that were used during your run. Protein helps with muscle recovery and can satiate hunger. Replenish hydration levels with electrolytes and water.\n\nWorthington suggests post-run snacks such as:\n\nUltimately, the perfect fuel routine comes down to the runners preference. When experimenting, Worthington suggests changing only one fuel source at a time to understand what specific foods and products work best with ones body.\n\nIt is a lot of trial and error. Worry less about the specific product, and more about the fuel source and ingredients, Worthington said. Find what you like, what makes sense for your body and training, and what works best for your budget.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16051346/run.jpg",
            "description": "<p>UAB News People are running. Running to exercise. Running to socialize. Running to achieve personal goals with every mile completed. When all one needs is a good pair of shoes, running seems like an easy activity to start. However, running requires preparation and training, both physically and mentally. An avid runner herself, Camille Worthington, Ph.D.,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fuel-better-run-better-what-to-consume-before-during-and-after-your-run/\">Fuel better, run better: What to consume before, during and after your run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "16 Sep 2025"
        },
        {
            "title": "Long-lost Harare Chieftainship seeks reinstatement – ‘royal’ blames country’s misfortunes on government delays in acknowledging them",
            "url": "https://www.newzimbabwe.com/long-lost-harare-chieftainship-seeks-reinstatement-royal-blames-countrys-misfortunes-on-government-delays-in-acknowledging-them/",
            "content": "By Leopold Munhende\n\nTHE Mbari Clan, which claims historical jurisdiction over Harare and its surrounding areas, has written to government and the Zimbabwe Chiefs Council seeking urgent consultations to begin a process that will lead to the resuscitation of their chieftaincy.\n\nThe letters, shared with NewZimbabwe.com by Princess Eugene Majuru, a descendant of Paramount Chief Mbari, blame Harare and the countrys socio-economic woes on what she describes as cultural injustice.\n\nFor 45 years after independence, the Chiefs Council has remained silent on the most glaring cultural and spiritual injustice in our nation: the absence of the Mbari chieftaincy in Harare, reads one of the letters.\n\nWhile Harare was commercialised under colonial rule, that did not erase the fact that the land remains under the spiritual guardianship of the Mbari clan.\n\nBy ignoring this reality, the Council has allowed a royal family to remain displaced, scattered across the country, unable to perform their own traditional ceremonies on their ancestral land.\n\nThis is not only an injustice to the Mbari people but also a failure to uphold the very traditions and cultural foundations that the Chiefs Council was created to protect.\n\nAlthough some parts of Harare are claimed by Chief Seke, no traditional leader has jurisdiction overthe capital city.\n\nThe Hwata and Chiweshe dynasties historically claimed ownership of some parts of the land under a confederacy that was headed by Chief Seke with its capital at Barapata Hill, present-day Mufakose (suburb of Harare).\n\nAccording to some historical sources, Chief Mbaris territory covered areas south of present-day Harare up to Chief Sekes Manyame river, Chishawasha to the east, which fell under Chief Chinhamora, Zvimba up to Mkwadzi river and to Concession in the north.\n\nFounded as an administrative station for British colonists, traditional leaders under whose authority Harare fell were displaced or completely removed.\n\nAdded Majuru: The Mbari clan demands an immediate and transparent explanation as to why the Chiefs Council has failed to address this issue. We further call for urgent consultations with the Mbari clan and spirit mediums to begin the process of resuscitating the Harare chieftaincy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15180117/chief-badge.png",
            "description": "<p>By Leopold Munhende THE Mbari Clan, which claims historical jurisdiction over Harare and its surrounding areas, has written to government and the Zimbabwe Chiefs’ Council seeking urgent consultations to begin a process that will lead to the resuscitation of their chieftaincy. The letters, shared with NewZimbabwe.com by ‘Princess’ Eugene Majuru, a descendant of Paramount Chief</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/long-lost-harare-chieftainship-seeks-reinstatement-royal-blames-countrys-misfortunes-on-government-delays-in-acknowledging-them/\">Long-lost Harare Chieftainship seeks reinstatement – ‘royal’ blames country’s misfortunes on government delays in acknowledging them</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "16 Sep 2025"
        },
        {
            "title": "US cuts leave Zimbabwe sex workers scrambling for alternatives",
            "url": "https://www.newzimbabwe.com/us-cuts-leave-zimbabwe-sex-workers-scrambling-for-alternatives/",
            "content": "AFP\n\nThis was the work station for the women, who say their trade turned perilous after US President Donald Trump abruptly cut foreign health aid earlier this year.\n\nOne of them, Sharon Mukakanhanga, reached into her bag and pulled out a pair of baby socks she used when there was nothing else between her and risk.\n\nThese little socks served as condoms when I became so desperate after the American government withdrew its support from my all-time go-to safe haven, the 43-year-old told AFP, referring to her preferred clinic.\n\nMukakanhanga is among thousands of sex workers in Zimbabwe who have struggled to access HIV prevention tools since the US cuts gutted centres that once provided free condoms, antiretrovirals and basic care.\n\nFor nearly two decades, the US programmes including PEPFAR, the worlds largest HIV initiative, formed a critical safety net for Zimbabwes fragile health system.\n\nThe first half of 2025 has seen 5,932 AIDS-related deaths, a rise from 5,712 in the same period last year, according to official government figures.\n\nThe impact of the withdrawals was immediate, said 47-year-old HIV-positive sex worker Cecilia Ruzvidzo.\n\nIt was a very difficult period. I literally lost my mind, said the mother of four who has been in the trade for nearly two decades.\n\nShe recalled leaving her most recent visit to the clinic with only 10 days worth of antiretrovirals.\n\nI could not get condoms, which are a necessity for my work. I was at risk of contracting more infections. My clients were also exposed, she said quickly.\n\nWith US-funded facilities shuttered or empty, the few remaining providers say they are buckling under the pressure.\n\nMedical charity Doctors Without Borders (MSF), which operates independently of US government funding, said its clinics in Harare suburbs like Epworth and Mbare were stretched thin.\n\nThey dont know where to go. They dont know where to seek services, said project lead Charlotte Pignon, referring to patients and especially sex workers.\n\nWhile she did not directly link the rising deaths to the funding cuts, she said the impact of the withdrawal could not be ignored.\n\nIt is difficult to know all the factors that are impacting those numbers but its impossible to say that its not impacted by the US cuts either, she said.\n\nThe scale of the fallout was still coming into focus, said Wonder Mufunda, chief executive of the Harare-headquartered think-tank Centre for Humanitarian Analytics (CHA).\n\nMufunda said US support had previously amounted to about $522 million, with roughly $90 million directed to HIV programmes.\n\nYou wake up and you have lost such funding, there were serious disruptions, he said, warning that deaths could rise.\n\nIts quite a big blow we are talking about, he told AFP.\n\nBeyond overstretched clinics, Zimbabwes economic freefall is pushing more people into sex work with an estimated 40,500 women already engaged in sex work nationwide, according to CHA.\n\nCompetition had eroded the power to insist on safer sex, said 20-year-old Cleopatra Katsande. Some workers were charging as little as 50 US cents per client, far less than the cost of a box of condoms, she said.\n\nFor veteran Ruzvidzo, there was no real choice.\n\nWe knew it wasnt safe, she said of using baby socks as condoms. But I had to feed my children.\n\nThe clients did not seem to mind, she said. When it comes to this moment, men dont think straight.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15133232/Zimbabwes-economic-freefall-is-pushing-more-people-into-sex-work-%C2%A9-Jekesai-NJIKIZANA-AFP-1.png",
            "description": "<p>AFP This was the work station for the women, who say their trade turned perilous after US President Donald Trump abruptly cut foreign health aid earlier this year. One of them, Sharon Mukakanhanga, reached into her bag and pulled out a pair of baby socks she used when there was nothing else between her and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-cuts-leave-zimbabwe-sex-workers-scrambling-for-alternatives/\">US cuts leave Zimbabwe sex workers scrambling for alternatives</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "16 Sep 2025"
        },
        {
            "title": "Tanzania, Zimbabwe seek to deepen ties in trade, private sector investment",
            "url": "https://www.newzimbabwe.com/tanzania-zimbabwe-seek-to-deepen-ties-in-trade-private-sector-investment/",
            "content": "Daily News Tanzania\n\nTanzanian envoy to Zimbabwe, Suzan Kaganda, who recently met with Christopher Mugaga, the Chief Executive Officer of the Zimbabwe National Chamber of Commerce (ZNCC) held lengthy discussions focused on exploring opportunities and strategies to enhance economic cooperation between the two nations, particularly in the areas of trade, investment, and private sector collaboration.\n\nDuring the talks, Ambassador Kaganda praised ZNCC for its significant contribution to the promotion of business in Zimbabwe. She also conveyed greetings from Vincent Minja, the President of the Tanzania Chamber of Commerce, Industry, and Agriculture (TCCIA).\n\nAmbassador Kaganda emphasized the critical role of the Port of Dar es Salaam in facilitating regional trade. She highlighted that the port plays a vital part in the transportation of vehicles from Japan to Zimbabwe, a factor that prompted the Tanzania Ports Authority (TPA) to open an office in Zimbabwe to streamline shipping procedures.\n\nOn his part, Christopher Mugaga expressed gratitude to the Tanzanian leaders for the ongoing cooperation and underscored the importance of increasing visits, meetings, and business forums to further boost trade and investment growth between the two countries.\n\nMugaga also announced that ZNCC is ready to organize and bring a delegation of Zimbabwean businesspeople to Tanzania in June 2026, where they will engage with their counterparts from TCCIA and explore various investment opportunities available in Tanzania.\n\nThese discussions have laid a solid foundation for economic cooperation between Tanzania and Zimbabwe. It is also anticipated that prior to the Africa-Nordic Foreign Ministers Meeting scheduled for October 2025 in Victoria Falls, Zimbabwe, leaders from TCCIA and ZNCC will convene again for in-depth talks aimed at promoting trade and investment for the mutual benefit of both nations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15134320/tanzania.jpg",
            "description": "<p>Daily News Tanzania Tanzanian envoy to Zimbabwe, Suzan Kaganda, who recently met with Christopher Mugaga, the Chief Executive Officer of the Zimbabwe National Chamber of Commerce (ZNCC) held lengthy discussions focused on exploring opportunities and strategies to enhance economic cooperation between the two nations, particularly in the areas of trade, investment, and private sector collaboration.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanzania-zimbabwe-seek-to-deepen-ties-in-trade-private-sector-investment/\">Tanzania, Zimbabwe seek to deepen ties in trade, private sector investment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "16 Sep 2025"
        },
        {
            "title": "Young Warriors’ AFCON dream shattered, coach blames players for poor show",
            "url": "https://www.newzimbabwe.com/young-warriors-afcon-dream-shattered-coach-blames-players-for-poor-show/",
            "content": "By Sports Reporter\n\nZimbabwes Under-17 team crashed out of the Africa Cup of Nations (AFCON) COSAFA Qualifiers on Tuesday after a 3-2 defeat to Comoros at Ngoni Stadium.\n\nThe loss capped a dismal campaign for the Young Warriors, who failed to register a single win and exited the tournament at the group stage, their worst performance in the competitions history as hosts.\n\nZimbabwe opened their campaign with a 1-0 loss to Mozambique, followed by a goalless draw against Eswatini, before bowing out against Comoros. Tuesdays match was the first time the Young Warriors found the back of the net, with Tadiwa Chakuchichi scoring, while the second came via an own goal.\n\nAfter the defeat, coach Thulani Sibanda did not mince his words, laying the blame squarely on his players.\n\nYou saw the games and the three goals we conceded during the tournament, even social football players could have defended those.\n\nThe truth is, we were discovering some of these players here, and I cant run away from that fact.\n\nZimbabwe had reached the semifinals last year, but their failure this year highlights the gulf in quality. The country last won the COSAFA U-17 tournament in 2007.\n\nMeanwhile, in the other Group A fixture, Mozambique thrashed Eswatini 4-0 to secure progression.\n\nFinal Group A standings:\n\nMozambique  7 points\n\nComoros  7 points\n\nZimbabwe  1 point\n\nEswatini  1 point\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/15180249/young-warriors1.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe’s Under-17 team crashed out of the Africa Cup of Nations (AFCON) COSAFA Qualifiers on Tuesday after a 3-2 defeat to Comoros at Ngoni Stadium. The loss capped a dismal campaign for the Young Warriors, who failed to register a single win and exited the tournament at the group stage, their worst</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-warriors-afcon-dream-shattered-coach-blames-players-for-poor-show/\">Young Warriors’ AFCON dream shattered, coach blames players for poor show</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "16 Sep 2025"
        }
    ]
}