{
    "news": [
        {
            "title": "UZ students protest against replacement of striking lecturers",
            "url": "https://www.newzimbabwe.com/uz-students-protest-against-replacement-of-striking-lecturers/",
            "content": "By Thandiwe Garusa\n\nUNIVERSITY of Zimbabwe (UZ) students are standing in solidarity with their striking lecturers, vowing to resist any attempts to bring in replacement staff.\n\nThe lecturers have been on an indefinite strike against poor salaries, which began on 16 April.\n\nThey held their third demonstration at UZ, Tuesday, where they vowed to press on with the industrial action until their demands are met.\n\nDelivering a solidarity speech Tuesday during the striking lecturers third demonstration, Zimbabwe National Students Union (ZINASU) representative Darlington Chingwena said their education had been stolen, accusing university authorities of threatening their future by neglecting the plight of academic staff.\n\nOur education was stolen from us and we are going to fight and demand our right to education.\n\nWe are not going to tolerate the hiring of scabs to teach us, our future was robbed, our future is at stake, we are going to pursue and recover our education and no one is going to stop or threaten us because we are even prepared to die for this thing, Chingwena said.\n\nUZ lecturers are demanding a return to their pre-2018 salaries when a junior lecturer earned US$2,250.Currently, they earn US$230.\n\nAbout a week ago, the university announced plans to replace striking lecturers with temporary staff earning just US$5.50 per hour, 40% of which will be paid in local ZWG currency.\n\nThe students vowed they will not accept the replacement of their lecturers with scab lecturers.\n\nThe idea of scabs is going to be met with fire and fury like what the world has never seen before, the students are ready, and we are not going to surrender until the right thing is done, Chingwena said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030519/UZ-strike-9-scaled.jpg",
            "description": "<p>By Thandiwe Garusa UNIVERSITY of Zimbabwe (UZ) students are standing in solidarity with their striking lecturers, vowing to resist any attempts to bring in replacement staff. The lecturers have been on an indefinite strike against poor salaries, which began on 16 April. They held their third demonstration at UZ, Tuesday, where they vowed to press</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-students-protest-against-replacement-of-striking-lecturers/\">UZ students protest against replacement of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "28 May 2025"
        },
        {
            "title": "Zanu PF will winnow out anyone with hidden ambitions – Mutsvangwa says as business tycoon Tagwirei ‘eyes’ presidency",
            "url": "https://www.newzimbabwe.com/zanu-pf-will-winnow-out-anyone-with-hidden-ambitions-mutsvangwa-says-as-business-tycoon-tagwirei-eyes-presidency/",
            "content": "By Tapiwa Svondo\n\nZANU PF will not tolerate businessmen who join the party with hidden ambitions, the party spokesperson Christopher Mutsvangwa has said.\n\nThis follows reports that businessman Kudakwashe Tagwirei, who was recently nominated for the partys Central Committee by Zanu PFs Harare Province, is eyeing the presidency.\n\nThe Central Committee is one of ZANU PFs most powerful organs.\n\nAddressing journalists in Harare, Mutsvangwa said while the ruling ZANUPF welcomes any businessmen who want to join the party, it will not winnow out anyone with secret ambitions of taking over power.\n\nAnybody is free to join ZANU PF whether be a businessman, whether you be a farmer, whatever, so if businessman in their numbers begin to gravitate towards the party we applaud that, we like it because a businessman produces goods and services which make him rich further than an individual person, so there is nothing wrong a businessman coming into the party.\n\nIf certain provinces feel that, that person should become a central committee member and they set their recommendations, the party will consider those resolutions and it will come out with an appropriate decision, said Mutsvangwa.\n\nTagwireis nomination to the Central Committee now awaits the approval of the partys Secretary General, Obert Mpofu. If successful, this will mark his rise in the political sphere and possibly to the presidency.\n\nAdded Mutsvangwa, What will be wrong is to say we are getting into the party so that I can become that and that post, that I can become the president because that is not the purpose of joining the party, the purpose of joining the party is to follow the constitution of the party and see to it that when succession or when the succession is done by votes that you comply with the terms of that party.\n\nBut if you come on a ticket that I want power the people may see through what you want and that becomes a challenge, hopefully all the businessman entrance who will come, they come to say we want to serve the party not to serve themselves, because serving themselves will not take them anywhere in ZANU PF I can vouch for that, just like presidents who went haywire we removed them. ZANU PF will winnow out any people who may have hidden ambitions other than following the structures of the ZANU PF.\n\nWith Mnangagwa serving his final term in office, some sections of ZANU PF are pushing for an extension of his tenure, while others, backing his vice, Constantino Chiwenga, are pushing for him to step aside in 2028.\n\nMnangagwa has stressed that he is a constitutionalist and will leave after his final term, but has not publicly condemned those pushing for his stay.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>By Tapiwa Svondo ZANU PF will not tolerate businessmen who join the party with “hidden ambitions”, the party spokesperson Christopher Mutsvangwa has said. This follows reports that businessman Kudakwashe Tagwirei, who was recently nominated for the party’s Central Committee by Zanu PF’s Harare Province, is eyeing the presidency. The Central Committee is one of ZANU</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-will-winnow-out-anyone-with-hidden-ambitions-mutsvangwa-says-as-business-tycoon-tagwirei-eyes-presidency/\">Zanu PF will winnow out anyone with hidden ambitions – Mutsvangwa says as business tycoon Tagwirei ‘eyes’ presidency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "28 May 2025"
        },
        {
            "title": "US halts student visa appointments and plans expanded social media vetting",
            "url": "https://www.newzimbabwe.com/us-halts-student-visa-appointments-and-plans-expanded-social-media-vetting/",
            "content": "BBC\n\nUS President Donald Trumps administration has ordered embassies to stop scheduling appointments for student visas as it prepares to expand social media vetting of such applicants.\n\nIn a copy of a memo sent to diplomatic posts, Secretary of State Marco Rubio said the pause would last until further guidance is issued.\n\nThe message said social media vetting would be stepped up for student and foreign exchange visas, which would have significant implications for embassies and consulates.\n\nIt comes amid Trumps feud with some of Americas most elite colleges, which he believes are too left-wing. He says some of them have enabled antisemitism on campus and uphold discriminatory admissions policies.\n\nThe state department memo, viewed by the BBCs US partner CBS News, directed US embassies on Tuesday to remove any unfilled appointments from their calendars for students seeking visas, but said those with appointments already scheduled could go ahead.\n\nThe diplomatic cable also said the state department was preparing for an expansion of required social media screening and vetting applicable to all student visa applications.\n\nForeign students who want to study in the US are usually required to schedule interviews at an American embassy in their home country before approval.\n\nMany institutions rely on foreign students for a significant chunk of their funding, as they often pay higher tuition fees.\n\nWhen asked about student visas, state department spokesperson Tammy Bruce told reporters on Tuesday: We take very seriously the process of vetting who it is that comes into the country, and were going to continue to do that.\n\nThe Trump administration has frozen hundreds of millions of dollars in funding for universities and moved to deport students, while revoking thousands of visas for others. Many of these actions have been blocked by the courts.\n\nThe White House has accused some US universities of allowing pro-Palestinian activism on campus to be hijacked by antisemitism.\n\nColleges have accused the Trump administration of trying to infringe upon free speech rights.\n\nHarvard University has been the focal point of President Donald Trumps ire. Last week, the Trump administration revoked Harvards ability to enrol international students or host foreign researchers. A federal judge blocked the policy.\n\nIf the measure is allowed, it could deliver a devastating blow to the university, where more than a quarter of students are foreign.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>BBC US President Donald Trump’s administration has ordered embassies to stop scheduling appointments for student visas as it prepares to expand social media vetting of such applicants. In a copy of a memo sent to diplomatic posts, Secretary of State Marco Rubio said the pause would last “until further guidance is issued”. The message said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-halts-student-visa-appointments-and-plans-expanded-social-media-vetting/\">US halts student visa appointments and plans expanded social media vetting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "28 May 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Investing in Special Economic Zones",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-investing-in-special-economic-zones/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss investing in Special Economic Zones, what does that mean, and what are the general benefits?\n\nVM: A special economic zone is a specified area or location that benefits from or operates under different or special trade laws from those governing businesses operating in the rest of the economy. A specific area may be awarded that designation on application to the government through the responsible body.\n\nLong and short, several countries offer this investment incentive to attract investors and investment. In Zimbabwe, a business operating in a special economic zone may benefit, among other business-specific or tailor-made benefits, from a fiveyear income tax holiday, reduced corporate tax, exemption from customs duty on capital equipment and raw materials.\n\nIt is important to understand that some exemptions may be unique to that business to assist operationalisation or enhance operations. Further to the unique requirements and benefits that may accrue with the status, the business may also enjoy other exemptions available that include exemption on royalties, taxes on management fees etc.\n\nThe purpose and intention are that the long-term benefits of the business outweigh the short-term reprieve in taxes or operational encumbrances and limit set-up costs.\n\nReporter:I notice you mention mainly benefits to the company to the company operating under that status. What benefits accrue to the country or what benefits to the country are critical when considering such applications?\n\nVM: It is my understanding that each business or application to operate under a special economic zone status is looked at in terms of its own unique value proposition. Part of the potential benefits considered by the regulators before issuing special economic zone status, among other things, is the potential export receipts from the business, if it is an exporting business.\n\nThey also look at issues to do with local employment and potential skills development, technology transfer, access to services and community development initiatives by the company that will be operating under a special economic zone status.\n\nIt is useful for such applications to also include other community benefits that will accrue from the granting of the status. Such benefits may include things like rehabilitation of basic infrastructure, building of community service areas like shopping centres, schools, hospitals et cetera so that the local community benefits from the investment project enjoying special economic zone status.\n\nIt is the whole list of benefits considered together that then qualifies or disqualifies a business or area for special economic zone status.\n\nReporter: Do we have areas that benefit from such status already?\n\nVM: Yes, there are areas that have been granted special economic zone status to date. I will mention the most common areas, Sunway City along Mutare road in Harare, before Ruwa, the status is aimed at technology and pharmaceuticals. Bulawayo is targeting industrial manufacturing to recapacitate the area and regain its status as the manufacturing hub of the country, and Victoria Falls on tourism and financial services among others.\n\nReporter: Who designates or assigns special economic zones status?\n\nVM: In a bid to promote the ease of doing business, the mandate to oversee the designation and administration of special economic zones is now directly under the Zimbabwe Investment Development Agency. The previous position under the Special Economic Zones Act, which created the Zimbabwe Economic Zones Authority, was repealed for the purposes of centralising or streamlining investment service provision.\n\nReporter: Thank you, Mr. Madzima, we have run out of time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28033521/Special-Eco-Zone.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss investing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-investing-in-special-economic-zones/\">Legal Discussions with Vengai Madzima: Investing in Special Economic Zones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "28 May 2025"
        },
        {
            "title": "UZ on the brink of collapse – striking lecturers say as students face uncertain future",
            "url": "https://www.newzimbabwe.com/uz-on-the-brink-of-collapse-striking-lecturers-say-as-students-face-uncertain-future/",
            "content": "By Darlington Gatsi\n\nVaforomani by the late System Tazvida blared from the public announcement system at the University of Zimbabwe, encapsulating the struggles of the lecturers on Tuesday morning.\n\nThe yesteryear song, a hard-hitting social commentary, challenges those in authority to acknowledge the plight of the working class by improving their conditions.\n\nThese sentiments mirror the grievances of University of Zimbabwe (UZ) lecturers, who have now spent 42 days on strike, marked by picketing at the institution.\n\nUZ lecturer and renowned author Memory Chirere told NewZimbabwe.com that their current salaries have left them at the mercy of poverty.\n\nOur strike is for the demand of a better salary. An ordinary lecturer is getting less than US$229 a month, which is far too little compared to what we used to receive before 2018. We cannot pay our bills, feed our families, or send our children to school, said Chirere.\n\nThe lecturers, under the Association of University Teachers (AUT), have been locked in a dispute with UZ, demanding that their grievances be addressed.\n\nHowever, the university has remained mum, threatening to abandon academic processes as lecturers remain resolute.\n\nChirere warned that if the situation remains unresolved, UZ risks cancelling graduation due to the ongoing impasse.\n\nWhat this means is, since we have been out for over a month, there will not be exams for the students because they have not been taught. It also means there may well be no graduation this year.\n\nThe exams for Block Two have not been processed. The teaching for Block Three has not taken place, and the teaching for Block Four has not taken place. The university is still at a standstill, said Chirere.\n\nLecturers are demanding salaries of US$2,500, which they argue are in line with other higher education institutions in Southern Africa.\n\nAn AUT spokesperson told NewZimbabwe.com that their situation is worsened by the lack of essential teaching tools, forcing them to use personal equipment.\n\nThe issues are quite numerous. At UZ, from time immemorial, this has been a huge challengeworse under the current vice-chancellor. We have now adopted Education 5.0, which requires a big chunk of online teaching and adapting to global trends.\n\nThey have not provided tools of the trade. For example, we do not have computers issued for work. There are no smartphones, and we do not have data.\n\nThe other issue is the working environment itself. UZ administration is dictatorial. There is no platform for engagement, said Obvious Vengeyi, the AUT spokesperson.\n\nIn response, UZ has taken a heavy-handed approach, suspending striking lecturers and reportedly recruiting replacement staff at US$3 per hour.\n\nAccording to AUT, the newly hired staff are insufficient to cater to the overwhelming number of students enrolled at the institution.\n\nChirere expressed concern over the continued silence from UZ leadership, led by Vice-Chancellor Paul Mapfumo.\n\nWhat worries us is that there seems to be no response from the responsible authorities within the University of Zimbabwe about our plight, said Chirere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27161450/UZ-strike-4-scaled.jpg",
            "description": "<p>By Darlington Gatsi “Vaforomani” by the late System Tazvida blared from the public announcement system at the University of Zimbabwe, encapsulating the struggles of the lecturers on Tuesday morning. The yesteryear song, a hard-hitting social commentary, challenges those in authority to acknowledge the plight of the working class by improving their conditions. These sentiments mirror</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-on-the-brink-of-collapse-striking-lecturers-say-as-students-face-uncertain-future/\">UZ on the brink of collapse – striking lecturers say as students face uncertain future </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "28 May 2025"
        },
        {
            "title": "South Africa in talks with Zimbabwe and Zambia to run Grand Inga transmission line",
            "url": "https://www.newzimbabwe.com/south-africa-in-talks-with-zimbabwe-and-zambia-to-run-grand-inga-transmission-line/",
            "content": "IOL\n\nSouth Africas Minister for Minerals and Petroleum Resources Gwede Mantashe said his country is initiating discussions with Zambia and Zimbabwe on the possibility of running the electricity transmission line from the Democratic Republic of Congo (DRC) under the Grand Inga project, through which 2,500 megawatts are envisaged for the country.\n\nMantashe was responding to questions from members of the Portfolio Committee on Minerals and Petroleum Resources on Tuesday, who had asked about the status of the project and what the country was doing to harness regional collaboration following the decision to postpone participation in the project.\n\nThe Grand Inga project is not ours; its a DRC project, given to the Spanish and Chinese. We have a right to buy equity in it, which would have to be approved by the DRC. We have not bought that equity, so we cant really pretend to be managing the Inga project. It is not our project. We have committed ourselves to a quantity of electricity that will be taken up by South Africa, but the driving of the project is out of our jurisdiction, Mantashe said.\n\nMKP MP Crown Prince Adil Nchabaleng objected to the Ministers stance, indicating that South Africa still considered the project feasible.\n\nYou cant expect to tell us that you are going to power South Africa from the Grand Inga project. Is South Africa talking about a concession to resell in that market with regard to the 2 500 MW as an investment partnership? You cannot power South Africa from the Grand Inga project, he said.\n\nMantashe maintained that there were ongoing discussions.\n\nThe Grand Inga Hydropower Project, a massive dam construction on the Congo River in the DRC, is intended to generate a large amount of electricity, with South Africa being a key off-taker. This project is envisioned as a major source of clean energy for the region and potentially for the entire African continent.\n\nSouth Africa has expressed interest in importing electricity from the Grand Inga project, particularly from Inga 3, the first of the new hydropower facilities.\n\nSouth Africas energy planning assumes the country will import 2500 MW from Inga by 2030, with the potential to double this to 5 000 MW.\n\nA long transmission line, passing through Angola, Namibia, and Botswana, would be needed to deliver power from Inga to Gauteng, South Africas economic heartland.\n\nSouth Africa and the DRC have signed agreements on receiving electricity from Inga, and the project is in the process of finalizing an agreement and securing financing.\n\nMeanwhile, Mantashe clarified that the launch of the South African National Petroleum Corporation (SANPC), which resulted from the restructuring of the department into two entities, may seem like a negative intervention to many, but gave the department space and opportunity to prioritise petroleum appropriately. He noted that petroleum is a source of 80% of the worlds energy but currently plays second fiddle to renewables.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28035019/grand-inga.jpeg",
            "description": "<p>IOL South Africa’s Minister for Minerals and Petroleum Resources Gwede Mantashe said his country is initiating discussions with Zambia and Zimbabwe on the possibility of running the electricity transmission line from the Democratic Republic of Congo (DRC) under the Grand Inga project, through which 2,500 megawatts are envisaged for the country. Mantashe was responding to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-in-talks-with-zimbabwe-and-zambia-to-run-grand-inga-transmission-line/\">South Africa in talks with Zimbabwe and Zambia to run Grand Inga transmission line</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "28 May 2025"
        },
        {
            "title": "In Pictures: UZ lecturers stage third demonstration",
            "url": "https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/",
            "content": "Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled.jpg",
            "description": "<p>Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16. Pictures by Thandiwe Garusa </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/\">In Pictures: UZ lecturers stage third demonstration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "28 May 2025"
        }
    ]
}