{
    "news": [
        {
            "title": "Emergency officials testify in South Africa’s George building collapse that killed 34, including Zimbabweans",
            "url": "https://www.newzimbabwe.com/emergency-officials-testify-in-south-africas-george-building-collapse-that-killed-34-including-zimbabweans/",
            "content": "By IOL News\n\nTHE Western Cape Legislatures Standing Committee on Infrastructure was given a sobering and detailed account of the George building collapse during a live briefing on Friday.\n\nThe Garden Route District Municipality and the George Municipality reflected on the devastating event that claimed lives and injured many more.\n\nThe incident, which occurred just after 2pm on May 6, 2024, saw a multi-storey building under construction on Victoria Street collapse in what responders described as a rare pancake collapse, where floors fall directly atop one another.\n\nSpeaking at the briefing, Head of Disaster Management for the Garden Route District Municipality, Gerard Otto shared the agonising realities of the response operation.\n\nI dont think anything fully prepares you for an incident like this. Having the plan just makes the gap less of what you didnt plan for and what youve got planned.\n\nIt took 260 hours, from 6 to 17 May, for rescue teams to comb through the rubble, searching for survivors among 62 confirmed victims, most of whom were foreign nationals.\n\nOnly 16 of the deceased were South African citizens. The rest were Mozambican, Zimbabwean, Malawian, Lesotho nationals, some undocumented, Otto revealed.\n\nOne of the most remarkable moments came 118 hours into the rescue, when survivor Gabriel Gumba was pulled from the rubble virtually unharmed.\n\nThat lifted the spirit to say, Okay, lets carry on, lets do even more, said Otto.\n\nThe response involved more than a thousand personnel and volunteers, including specialised rescue technicians, emergency medical teams, construction workers, and canine units.\n\nHowever, the operation faced significant logistical and emotional challenges. Response equipment had to be transported from Worcester, resulting in delays of up to five hours for critical tools.\n\nAdditionally, language barriers complicated the provision of psychosocial support for victims, while inaccurate or missing records from contractors made it nearly impossible to track the workers involved.\n\nGeorge Municipality Fire Chief Neels Barnard described the moment he reached the scene.\n\nWas it just a structural collapse of one wall? Or was it the whole building? Its only when you reach the disaster site that you can see what has really happened. Even in the Western Cape, we have never experienced a tragedy of this scale before, said Barnard.\n\nCoordinated through a Multi-Agency Centre (MAC), the operation implemented triage colour-coding, acoustic detection devices, and forensic identification methods including tattoos and social media photos.\n\nNGOs, churches, and the Department of Social Development offered support to grieving families and rescue workers alike.\n\nThis was not just a government response, it was a whole-of-society approach, Otto said.\n\nOfficials also credited past disaster experiences, including the COVID-19 pandemic and the 2017 Knysna fires, for helping establish functional cluster systems.\n\nEveryone knew their roles, Otto added.\n\nThat intergovernmental coordination saved lives.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/04080018/george.jpeg",
            "description": "<p>By IOL News THE Western Cape Legislature’s Standing Committee on Infrastructure was given a sobering and detailed account of the George building collapse during a live briefing on Friday. The Garden Route District Municipality and the George Municipality reflected on the devastating event that claimed lives and injured many more. The incident, which occurred just</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/emergency-officials-testify-in-south-africas-george-building-collapse-that-killed-34-including-zimbabweans/\">Emergency officials testify in South Africa’s George building collapse that killed 34, including Zimbabweans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "Raza returns to Zimbabwe squad for one-off test versus England",
            "url": "https://www.newzimbabwe.com/raza-returns-to-zimbabwe-squad-for-one-off-test-v-england/",
            "content": "By Reuters\n\nKEY all-rounder Sikandar Raza returns to Zimbabwes squad for their one-off four-day test against England in Nottingham later this month, Zimbabwe Cricket said on Saturday.\n\nThe 39-year-old missed Zimbabwes test loss at home to Ireland in February and their two-test series in Bangladesh, which ended 1-1 this week, after being allowed to compete in Twenty20 franchise cricket in both the United Arab Emirates and his native Pakistan.\n\nRaza replaces Johnathan Campbell in one of three changes to the 15-man squad that toured Bangladesh with Clive Madande back from injury to replace Nyasha Mayavo as back-up wicketkeeper to Tafadzwa Tsiga.\n\nLeg-spinner Vincent Masekesa, despite picking up a five-wicket haul on debut in the second test in Bangladesh last month, is replaced by seamer Newman Nyamhuri.\n\nThe clash at Trent Bridge from May 22-25 is Zimbabwes first Test in England for 22 years.\n\nZimbabwe will also play a four-day game against South Africa in Arundel from June 3-6 to help their neighbours prepare for the World Test Championship final against Australia at Lords.\n\nIn terms of performance, I expect us to play to a standard that can compete with one of the best teams in the world, Zimbabwe coach Justin Sammons said.\n\nI really want to see the guys walking out there believing that they belong, embracing and enjoying the moment.\n\nSquad:\n\nCraig Ervine (captain), Brian Bennett, Ben Curran, Trevor Gwandu, Clive Madande (wicketkeeper), Wessly Madhevere, Wellington Masakadza, Blessing Muzarabani, Richard Ngarava, Newman Nyamhuri, Victor Nyauchi, Sikandar Raza, Tafadzwa Tsiga (wicketkeeper), Nick Welch, Sean Williams.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/05050940/sikandar-raza-AFP.webp",
            "description": "<p>By Reuters KEY all-rounder Sikandar Raza returns to Zimbabwe’s squad for their one-off four-day test against England in Nottingham later this month, Zimbabwe Cricket said on Saturday. The 39-year-old missed Zimbabwe’s test loss at home to Ireland in February and their two-test series in Bangladesh, which ended 1-1 this week, after being allowed to compete</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/raza-returns-to-zimbabwe-squad-for-one-off-test-v-england/\">Raza returns to Zimbabwe squad for one-off test versus England</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "Former ‘Generations’ actress Six Nyamane seems to have swapped reading scripts for DJing",
            "url": "https://www.newzimbabwe.com/former-generations-actress-six-nyamane-seems-to-have-swapped-reading-scripts-for-djing/",
            "content": "By TshisaLive\n\nFORMER Generations actress Six Nyamane seems to have swapped reading scripts to spin the decks.\n\nSix, who is popularly known for her role as Nozipho Cele-Moroka on Generations: The Legacy bid the show farewell on April 24.\n\nSocial media was abuzz after she shared images of her behind the turntables, with users suggesting she has shifted her focus to her DJ career. She also added DJ to her biography.\n\nShe looks so happy. Sometimes a new chapter is just what you need, said one user.\n\nAnother said: Shes my favourite face to ever land on our small screens.\n\nI thought she was focusing on her upcoming wedding, wrote one user.\n\nAnother user commented: Natural beauty.\n\nSix is celebrating a new chapter in her career after she recently tied the knot to Mohale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/04064919/Screenshot_20250504-074405_2.jpg",
            "description": "<p>By TshisaLive FORMER Generations actress Six Nyamane seems to have swapped reading scripts to spin the decks. Six, who is popularly known for her role as Nozipho Cele-Moroka on Generations: The Legacy bid the show farewell on April 24. Social media was abuzz after she shared images of her behind the turntables, with users suggesting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-generations-actress-six-nyamane-seems-to-have-swapped-reading-scripts-for-djing/\">Former ‘Generations’ actress Six Nyamane seems to have swapped reading scripts for DJing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "Short-lived marriage ends in tragedy as hubby stabs wife to death over sharing of property",
            "url": "https://www.newzimbabwe.com/short-lived-marriage-ends-in-tragedy-as-hubby-stabs-wife-to-death-over-sharing-of-property/",
            "content": "By Staff Reporter\n\nA WRANGLE over the equitable sharing of household property following a divorce ended in tragedy after a Chegutu man stabbed his estranged wife to death.\n\nThe couple divorced after a short-lived marriage that lasted for only eight months.\n\nThe Zimbabwe Republic Police (ZRP) has since arrested suspect identified as Peter Center over the murder of his wife, 33-year-old Sophia Mackenzie.\n\nZRP national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP is investigating a murder case which occurred in Chegutu on May 2, 2025, in which Sophia Mackenzie (33) was allegedly stabbed in the lower abdomen with a sharp object by her husband, only identified as Peter Center.\n\nThe two, who had been living together for eight months, had a dispute over property sharing after divorce, said Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/14164013/knife-blood.jpg",
            "description": "<p>By Staff Reporter  A WRANGLE over the equitable sharing of household property following a divorce ended in tragedy after a Chegutu man stabbed his estranged wife to death. The couple divorced after a short-lived marriage that lasted for only eight months. The Zimbabwe Republic Police (ZRP) has since arrested suspect identified as Peter Center over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/short-lived-marriage-ends-in-tragedy-as-hubby-stabs-wife-to-death-over-sharing-of-property/\">Short-lived marriage ends in tragedy as hubby stabs wife to death over sharing of property </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "Australia PM Albanese makes stunning comeback with landslide win",
            "url": "https://www.newzimbabwe.com/australia-pm-albanese-makes-stunning-comeback-with-landslide-win/",
            "content": "By BBC News\n\nLABORS Anthony Albanese has defied the so-called incumbency curse to be re-elected Australias prime minister in a landslide.\n\nOfficial vote counting wont finish for days, but Albaneses centre-left government will dramatically increase its majority after the conservative Liberal-National coalition suffered a thumping defeat nationwide.\n\nToday, the Australian people have voted for Australian values: for fairness, aspiration and opportunity for all; for the strength to show courage in adversity and kindness to those in need, Albanese said.\n\nCoalition leader Peter Dutton, who lost his own seat of 24 years, said he accepted full responsibility for his partys loss and apologised to his MPs.\n\nFollowing the result, UK Prime Minister Sir Keir Starmer and US Secretary of State Marco Rubio both said they looked forward to deepening their bilateral relationships with Australia.\n\nCost-of-living concerns  particularly the affordability of healthcare and housing  dominated the five-week campaign, but international relations also reared its head, with the issue of how to deal with Donald Trump looming large over the election.\n\nDutton was seen by many as Australias Trump, which appeared to go down badly with voters, despite his attempts to shake off comparisons made between his policies on immigration, public sector cuts and China, and the Trump administration.\n\nFormer Prime Minister Malcolm Turnbull told BBC Newshour that Dutton ran a very Trumpian campaign, and the US president was the mood music that had a very big influence on how people perceived the Liberal-National opposition.\n\nLabor saw swings towards them right across the country  a rare feat for a second-term government in Australia  and Albanese becomes the first prime minister to win back-to-back elections in over 20 years.\n\nThe partys success has also tempered a trend of voters abandoning the two major parties, which was the big story of the last election in 2022.\n\nLabor is on track to finish with 86 seats, the Coalition about 40, and the Greens Party with one or two, according to projections by the Australian Broadcasting Corporation (ABC). Other minor parties and independents are ahead in nine seats.\n\nThat represents an increase of nine for Labor and a significant drop in support for the Greens. However most teal independents have been returned in their more conservative, inner-city electorates.\n\nIts a remarkable turnaround from the start of the year, when polling put Albaneses popularity at record lows after three years of global economic pain, tense national debate, and growing government dissatisfaction.\n\nAlbanese says his election was a vote for equality and kindess\n\nNuclear v renewables: The coal mining town caught in Australias climate wars\n\nIn his Saturday night victory speech, Albanese addressed some of the elections key issues, which also included migration, climate change and energy.\n\nHe reiterated his promises to make healthcare  most critically GP appointments  more affordable, put buying a house in reach for more Australians, and do more to address climate change and protect the environment.\n\nNotably, he also vowed to advance reconciliation for First Nations people: We will be a stronger nation when we Close the Gap between Indigenous and non-Indigenous Australians.\n\nIts a veiled reference to the biggest moment of Albaneses tenure, the failed Voice referendum of October 2023, which sought to recognise Aboriginal and Torres Strait Islander people in the constitution, and simultaneously establish a parliamentary advisory body for them.\n\nAustralia remains the only Commonwealth country to have never signed a treaty with its Indigenous people.\n\nSoul-searching after emphatic result\n\nThe Voice was one of Albaneses most defining policies, and his most striking setback  it was overwhelmingly rejected after months of often toxic and divisive national debate.\n\nIndigenous Australians have told the BBC they feel like theyve been forgotten by policymakers since.\n\nThe prime minister also found difficulty trying to walk a middle path on the Israel-Gaza war, raised eyebrows after buying a multi-million-dollar beach pad in the midst of a housing crisis and, like other leaders globally, he grappled with tough economic conditions.\n\nWith tanking poll numbers, Albanese was broadly seen as the underdog coming into the election, and was poised to be the next victim of the incumbency curse  a term to explain a global trend where struggling constituents were turfing out governments after a single term.\n\nDutton, on the other hand, looked like he was writing a great political comeback  he was on the edge of bringing his party from its worst loss in 70 years back into office in a single term.\n\nIt has been almost a century since a first-term government has failed to win re-election, but as Australian National University Emeritus Professor John Warhurst said: Dutton entered the campaign [year] in front. It was his to lose.\n\nInstead, Dutton has overseen a party loss so emphatic he has lost his own electorate of Dickson, to Labors Ali France.\n\nI love this country and have fought hard for it, he told supporters in Brisbane, conceding defeat.\n\nWe have been defined by our opponents in this election which is not a true story of who we are, but we will rebuild from here and we will do that because we know our values, we know our beliefs, and we will always stick to them.\n\nHis campaign was marred by unforced errors: including a series of policy backflips which caused confusion, awkward mistakes on important issues like cost of living and, perhaps most memorably, accidentally booting an AFL ball into a cameramans head.\n\nThe opposition has been shambolic, Prof Warhurst says.\n\nBut the government  while resolute and disciplined in its campaign  was timid. Its strategy was largely allowing voters to judge Dutton and his party, rather than advancing bold or convincing policies, analysts say.\n\nAnd thats something we heard from voters throughout the campaign too.\n\nWhile the Coalition turns to licking its wounds and choosing its next leader, it will again have to reckon with its direction.\n\nLast election, analysts and some of the partys own MPs cautioned against a move towards the right. They questioned whether Dutton  a polarising figure considered by many to be a conservative hard man  was the right person to rebuild support, particularly in the moderate areas where they lost a lot of it.\n\nAfter a campaign which in its dying days ventured into culture war territory and what some say are Trumpian politics, the Coalition is going to have to ask those questions again  and if they want to be competitive, perhaps find different answers.\n\nWe have to stop drinking the Kool-Aid from the fire hose and we need to have a serious review we delude ourselves that we are just a few tactical devices away from winning an election, former Liberal strategist Tony Barry told the ABC.\n\nBut meanwhile Labor has to decide what it wants to achieve with the large mandate Australia has handed them.\n\nAlbaneses incumbency curse turned out to be a gift, with international uncertainty appearing to have swayed voters in countries like Canada away from change. Likewise, Australia voted for stability.\n\nLabor struck a middle-of-the-road path with its a policy platform, but can now afford to be braver, says Amy Remeikis, chief politicial analyst at the Australia Institute think tank.\n\nThat was the path that they took to the election, and that is what they are seeing has paid dividends for them. But the question now is: Will Labor actually do something with power?'\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/04053703/grayndler-anthony-albanese.jpg",
            "description": "<p>By BBC News LABOR’S Anthony Albanese has defied the so-called “incumbency curse” to be re-elected Australia’s prime minister in a landslide. Official vote counting won’t finish for days, but Albanese’s centre-left government will dramatically increase its majority after the conservative Liberal-National coalition suffered a thumping defeat nationwide. “Today, the Australian people have voted for Australian</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/australia-pm-albanese-makes-stunning-comeback-with-landslide-win/\">Australia PM Albanese makes stunning comeback with landslide win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "Government stops councils from issuing change of land use permits amid invasion of greenways, mushrooming schools in suburbs",
            "url": "https://www.newzimbabwe.com/government-stops-councils-from-issuing-change-of-land-use-permits-amid-invasion-of-greenways-mushrooming-schools-in-suburbs/",
            "content": "By Staff Reporter\n\nCONCERNED about unregulated infrastructural developments on greenways and the sprouting of private schools and creches in suburbs, government has stopped councils processing applications and issuing permits.\n\nThe moratorium, which takes effect immediately, has been necessitated by an influx of applications to convert residential properties into institutional stands, a trend which Local Government and Public Works Minister Daniel Garwe has put on ice in terms of Section 69 of the Regional Town and Country Planning Act (Chapter 29:12).\n\nThe law provides that the relevant minister may give to any local authority directions, either general or specific, regulating the manner in which any procedures for the carrying out of its functions shall be carriedout.\n\nIn a circular dated May 2, 2025, addressed to mayors and chairpersons of councils, Garwe said the 90-day moratorium prohibits all local authorities from exercising planning powers in respect of change of reservation and change of land use, effective the date of pronouncement, which is May 2.\n\nThe moratorium is conditional in that local authorities are required to undertake specific actions elaborated in it, inorder for the moratorium to be lifted for respective councils, reads the circular.\n\nEach local authority is required to have a whole-of-council approach in ensuring adherence to the conditions set out in this moratorium.\n\nIt was further noted that interpretation of the order rests with the ministrys permanent secretary.\n\nIn an explanatory note accompanying the circular, Garwe said the proliferation of obstructive land uses in residential areas and the heightened public complaints against such developments, had jerked his ministry to stop councils from authorising developments until certain conditions were met.\n\nIn the interest of the public, the Government of Zimbabwe hereby wishes to advise the nation of measures being put in place to enhance the management of the built environment in our rural and urban areas by temporarily suspending the processing of such permits while reviews are conducted by relevant authorities, added Garwe.\n\nDuring the moratorium, councils must strengthen their development control units through staffing and provision of requisite tools of trade, enhance public consultation mechanisms to make them more effective, and enforce legal provisions, including by-laws.\n\nIn addition, the local authorities must strengthen monitoring of compliance with respect of various permits and develop plans for maintenance and beautification of buffers along roads and other public spaces.\n\nThe minister says he will uplift the moratorium for those councils that would have complied with the set conditions and provided proof of compliance by submitting a comprehensive report that shows how they would have fulfilled the criteria.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Staff Reporter  CONCERNED about unregulated infrastructural developments on greenways and the sprouting of private schools and creches in suburbs, government has stopped councils processing applications and issuing permits. The moratorium, which takes effect immediately, has been necessitated by an influx of applications to convert residential properties into institutional stands, a trend which Local Government</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-stops-councils-from-issuing-change-of-land-use-permits-amid-invasion-of-greenways-mushrooming-schools-in-suburbs/\">Government stops councils from issuing change of land use permits amid invasion of greenways, mushrooming schools in suburbs </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "Nakamba’s Luton Town relegated to English League One",
            "url": "https://www.newzimbabwe.com/nakambas-luton-town-relegated-to-english-league-one/",
            "content": "By Sports Reporter\n\nMARVELLOUS Nakambas Luton Town has been relegated from the SkyBet English Championship League after losing 5-3 to West Brom Saturday afternoon.\n\nLutons defeat saw them finishing on position 22 on the log, joining Plymouth and Cardif City as the three relegated teams this season.\n\nA Saturday victory would have seen Luton surviving the chop as it would have propelled them to position 18 on the log.\n\nIts tough to put into words. I feel sorry for the fans and also for the lads with the effort theyve put in recently.\n\nWe gave ourselves too much of a mountain to climb. To go out like that is really frustrating.\n\nWell receive a backlash for todays result and rightfully so to an extent, but the lads have put blood, sweat and tears into the last few weeks, said Luton captain Carlton Morris during a post-match interview.\n\nLuton Town will now compete in the English League One next season, and it remains unknown whether Zimbabwes Nakamba will stay put or leave the club.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/12195255/NAKAMBA.png",
            "description": "<p>By Sports Reporter MARVELLOUS Nakamba’s Luton Town has been relegated from the SkyBet English Championship League after losing 5-3 to West Brom Saturday afternoon. Luton’s defeat saw them finishing on position 22 on the log, joining Plymouth and Cardif City as the three relegated teams this season. A Saturday victory would have seen Luton surviving</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nakambas-luton-town-relegated-to-english-league-one/\">Nakamba’s Luton Town relegated to English League One</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "City of Harare set to remove illegal billboards",
            "url": "https://www.newzimbabwe.com/city-of-harare-set-to-remove-illegal-billboards/",
            "content": "By Staff Reporter\n\nTHE City of Harare (CoH) has announced plans to remove all illegal billboards located on council road verges and private properties.\n\nIn a statement, the CoH has urged illegal billboard owners to regularize their signage within seven working days.The City of Harare would like to inform stakeholders and residents that we will be removing all illegal billboards within Harare.Most of these illegal billboards are on council road verges and private properties. Council is encouraging all property owners who have such billboards to engage council within (seven) 7 working days for possible regularization, reads the statement.Property owners who do not comply will have the costs of removal charged to their rates accounts.Should property owners defy this notice, the Acting Director of Urban Planning shall proceed to evoke the provisions of Section 20 as read with Section 29B of the Harare (Control of Advertising Signs) By law of 1981 as amended 2015, that is to say the City of Harare will remove the said illegal signage(s) billboards or wall murals and charge the cost incurred to the affected property owners rates accounts.Any representations or objections regarding this matter should reach the Director of Urban Planning within seven (7) working days.\n\nIn a statement, the CoH has urged illegal billboard owners to regularize their signage within seven working days.\n\nThe City of Harare would like to inform stakeholders and residents that we will be removing all illegal billboards within Harare.\n\nMost of these illegal billboards are on council road verges and private properties. Council is encouraging all property owners who have such billboards to engage council within (seven) 7 working days for possible regularization, reads the statement.\n\nProperty owners who do not comply will have the costs of removal charged to their rates accounts.\n\nShould property owners defy this notice, the Acting Director of Urban Planning shall proceed to evoke the provisions of Section 20 as read with Section 29B of the Harare (Control of Advertising Signs) By law of 1981 as amended 2015, that is to say the City of Harare will remove the said illegal signage(s) billboards or wall murals and charge the cost incurred to the affected property owners rates accounts.\n\nAny representations or objections regarding this matter should reach the Director of Urban Planning within seven (7) working days.\n\nAny representations or objections regarding this matter should reach the Director of Urban Planning within seven (7) working days.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/04052821/AM_Zimbabwe09.jpg",
            "description": "<p>By Staff Reporter THE City of Harare (CoH) has announced plans to remove all illegal billboards located on council road verges and private properties. In a statement, the CoH has urged illegal billboard owners to regularize their signage within seven working days. “The City of Harare would like to inform stakeholders and residents that we</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-set-to-remove-illegal-billboards/\">City of Harare set to remove illegal billboards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "May’s prophetic declaration: Elevation and endorsement",
            "url": "https://www.newzimbabwe.com/mays-prophetic-declaration-elevation-and-endorsement/",
            "content": "SUNDAY MORNING TABLET\n\nAs the Lord magnified Joshua in the sight of all Israel (Joshua 3:7), this month of May, God will elevate and endorse you on every side, bringing you to the forefront of influence and credibility in Jesus mighty name.\n\nLike David, Joshua, and Esther, God will accelerate your journey, accomplishing in a day what others achieve in years (Psalm 118:17, Esther 4:14).\n\nWith God on your side, youll overcome giants and challenges, and He will right your wrongs, making the impossible possible (Matthew 19:26).\n\nGet ready to be catapulted to new heights of your destiny, just as the five loaves multiplied to feed the five thousand (Matthew 16:9, Matthew 14:13-21).\n\nThis month will be your season of supernatural multiplication and abundance. Whatever eluded you will be restored, and inadequacies will turn to surplus (Joel 2:25-26).\n\nI decree and declare that no more shame, reproach, or secret tears in Jesus name. All thats been lost or stolen is declared restored (Joel 3:1-2). The siege is broken (2 Kings 7:3-4).\n\nExpect supernatural ideas that will change your life forever. As May symbolizes grace, God will overshadow you with His favour and grace (2 Corinthians 12:9). Struggles cease, and divine calmness and favor envelop you now.\n\nWelcome to the month of May, your season of direction, multiplication, and elevation, bringing you to divine setups of opportunities and many testimonies in Jesus mighty name. Shalom.\n\nPRAYER:\n\nFather, in Jesus name, I declare May as a month of divine favour, multiplication, and elevation. Break every siege, restore whats lost, and bring supernatural ideas that will change lives forever.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/07060039/IMG-20240616-WA0009-1.jpg",
            "description": "<p>SUNDAY MORNING TABLET As the Lord magnified Joshua in the sight of all Israel (Joshua 3:7), this month of May, God will elevate and endorse you on every side, bringing you to the forefront of influence and credibility in Jesus’ mighty name. Like David, Joshua, and Esther, God will accelerate your journey, accomplishing in a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mays-prophetic-declaration-elevation-and-endorsement/\">May’s prophetic declaration: Elevation and endorsement </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        },
        {
            "title": "Filmmakers behind BBC’s ‘Blood Parliament’ arrested in Nairobi amid outcry over police killings",
            "url": "https://www.newzimbabwe.com/filmmakers-behind-bbcs-blood-parliament-arrested-in-nairobi-amid-outcry-over-police-killings/",
            "content": "By The Eastleigh Voice\n\nFOUR filmmakers connected to the explosive BBC documentary, Blood Parliament, have been arrested in Nairobi, amid mounting controversy over the governments handling of police killings during last years protests, which were mainly led by Gen Z demonstrators, some of whom were killed by police.\n\nThe filmmakers, Chris Wamae, Nicholas Gichuki, Brian Adagala and Mark Karubiu, were taken into custody early Saturday morning from their studio in Karen.\n\nThe four men are currently being held at Muthaiga and Pangani police stations.\n\nThe arrest follows the release of a 40-minute documentary by BBC Africa Eye, which investigates the killing of peaceful protesters during anti-tax demonstrations outside Parliament in June 2024.\n\nThe film focuses particularly on the death of Eric Shieni, a finance student at the University of Nairobi, who was shot as he was leaving the protest.\n\nIn its documentary, BBC Africa Eye claimed to have reviewed over 150 images and videos taken before and after Shienis death.\n\nThe network said its investigation identified the officer responsible for the killing, who they say is a member of Kenyas armed forces. However, the officers identity has not been officially confirmed, and the Kenya Defence Forces (KDF) has denied any involvement.\n\nThe documentary has generated a significant public outcry, raising questions about the use of force by the Kenyan security forces during the protest.\n\nCritics have demanded accountability for those responsible for the deaths and injuries of unarmed protesters.\n\nOn Monday, Kenyan officials blocked a public screening of the documentary, a move that many view as an attempt to silence the investigation and prevent further scrutiny. BBC confirmed that the screening was abruptly cancelled after intervention by local authorities.\n\nThe screening was stopped at the last minute under pressure from the government, the BBC said in a statement.\n\nThis action appears to be an effort to prevent the public from viewing the documentary and its contents.\n\nThe arrest of the filmmakers is seen as part of a broader effort by the government to suppress information related to police misconduct during the protests.\n\nHuman rights organisations have condemned the arrests, calling them an attack on free speech and press freedom.\n\nThe incident has sparked fears of increased government control over the media, especially regarding sensitive political topics.\n\nMany journalists and filmmakers working on politically sensitive stories have expressed concerns about facing similar reprisals.\n\nThe Blood Parliament documentary has put the spotlight on the issue of police violence during the June 2024 protests, which saw dozens of people killed or injured.\n\nAlthough the government has pledged to investigate the deaths, there have been no significant actions taken to hold security officers accountable for the killings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/03084806/BBC-blood-parliament.jpg",
            "description": "<p>By The Eastleigh Voice  FOUR filmmakers connected to the explosive BBC documentary, Blood Parliament, have been arrested in Nairobi, amid mounting controversy over the government’s handling of police killings during last year’s protests, which were mainly led by Gen Z demonstrators, some of whom were killed by police. The filmmakers, Chris Wamae, Nicholas Gichuki, Brian</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/filmmakers-behind-bbcs-blood-parliament-arrested-in-nairobi-amid-outcry-over-police-killings/\">Filmmakers behind BBC’s ‘Blood Parliament’ arrested in Nairobi amid outcry over police killings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "04 May 2025"
        }
    ]
}