{
    "news": [
        {
            "title": "Diaspora Insurance launches 2025 Charity Campaign",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-launches-2025-charity-campaign/",
            "content": "By Chipo Sabeta\n\nDiaspora Insurancehas launched its 2025 Charity Campaign, a major initiative aimed at supporting underprivileged communities across Africa.\n\nOperating in 25 African countries, Diaspora Insurance plans to use its broad network to make a tangible difference where it matters most among the less privileged.\n\nAt the launch event held at theDiaspora Insuranceheadquarters in Birmingham, Miss Ruvarashe Madzingo, the Head of Charity Events, shared details of how the campaign will unfold.\n\nWe will be reaching out to clients across all 25 countries, inviting them to nominate a charity of their choice. After collecting all nominations, well be selecting 10 charities from the list. Each of these will receive a 1,000 donation from Diaspora Insurance to go towards celebrating the festive season. A total of 10,000 will be given out through this initiative, said Madzingo.\n\nA live draw will take place on November 28, where one of the selected charities will also become the main beneficiary of Diaspora Insurances 2025 charity mission, receiving full support throughout the year.\n\nThis inclusive approach allows clients to take part directly in shaping the campaign, reflecting the shared spirit of compassion and unity that defines Diaspora Insurances diverse community.\n\nAdded Madzingo, Since Diaspora Insurances inception, community service has been central to who we are. Even in our early days, when resources were limited, we made it a point to support the elderly, children, and persons with disabilities. We are a community-oriented company, and this campaign is simply a continuation of that journey.\n\nThrough the 2025 Charity Campaign,Diaspora Insurancehopes not only to touch lives but also to inspire others to give.\n\nDiaspora Insurance is widely recognised for its work within African and other diaspora communities across the UK, Europe, North America, and beyond. Beyond providing financial security through products such as the Diaspora Funeral Cash Plan, the company is also active in various Corporate Social Responsibility (CSR) initiatives and charities that support community welfare, cultural development, and empowerment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/21085608/Diaspora-Insurance-House.png",
            "description": "<p>By Chipo Sabeta Diaspora Insurance has launched its 2025 Charity Campaign, a major initiative aimed at supporting underprivileged communities across Africa. Operating in 25 African countries, Diaspora Insurance plans to use its broad network to make a tangible difference where it matters most among the less privileged. At the launch event held at the Diaspora</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-launches-2025-charity-campaign/\">Diaspora Insurance launches 2025 Charity Campaign</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        },
        {
            "title": "Zimbabwe names Mighty Warriors squad to play in Four Nations Tournament",
            "url": "https://www.newzimbabwe.com/zimbabwe-names-mighty-warriors-squad-to-play-in-four-nations-tournament/",
            "content": "By Sports Reporter\n\nZimbabwe senior womens team coach Sithethelelwe Kwinji 15 Sibanda has named a 23-woman squad to represent the country at the Four Nations tournament to be played in Malawi from the 29th of November to the 3rd of December.\n\nZimbabwe are one of the four countries participating in the invitational tournament, alongside South Africa, Zambia, and hosts Malawi.\n\nOf the 23-woman squad named by Sibanda, 12 of the players have received their first national team call-up, a move to start building for next years COSAFA Cup and other competitions.\n\nSibandas squad has since been questioned for lacking any foreign-based players, despite plenty of options available abroad.\n\nThe Zimbabwe womens team was last in action back in February when they were knocked out by Angola in a Womens Africa Cup of Nations qualifier.\n\nMIGHTY WARRIORS SQUAD FOR MALAWI FOUR NATIONS TOURNAMENT\n\nGOALKEEPERS:\n\nCynthia Shonga (Herentals Queens), Delight Matigwene (Chapungu Queens), Vanessa Lunga (Platinum Royals)\n\nDEFENDERS:\n\nBridget Mutaurwa (Herentals Queens), Thandekile Mandaba (Correctional Queens), Nobukhosi Ncube (Chapungu Queens), Egness Tumbare (Correctional Queens), Nokukhanya Ndlovu (Platinum Royals), Fiona Kabera (Conduit Soccer Academy), Melinda Mapasure (Faithdrive Academy), Sheila Antonio (Chapungu Queens), Alice Moyo (Herentals Queens)\n\nMIDFIELDERS:\n\nCaroline Mangwai (Black Rhinos Queens), Daisy Kaitano (Black Rhinos Queens), Shyline Dambamuromo (Herentals Queens), Macgirl Sipini (Harare City Queens), Patience Ndlovu (Mpopoma Soccer Academy), Lucia Chisvo (Black Rhinos), Bethel Kondo (Herentals Queens), Christabel Katona (Black Rhinos), Ennert Chemhere (Platinum Royals), Tasha Dube (Sheasham Queens)\n\nFORWARDS:\n\nPraynance Zvawanda (Herentals Queens), Thandolwenkosi Sibanda (Mpopoma Soccer Academy), Blessing Moyo (Correctional Queens), Mitchel Guri (Highlanders Royals), Rutendo Makore (Black Rhinos Queens), Anita Ncube (Kwekwe Queens), Ethel Chinyerere (Chapungu Queens), Priviledge Mupeti (Black Rhinos)\n\nTECHNICAL TEAM\n\nSithethelelwe Sibanda (Head Coach), Tsitsi Shiri (Assistant Coach), Onai Ching awo (Goalkeepers Coach), Primrose Serima (Fitness Coach), Dr. Margaret Maulana (Team Doctor), Kudzanayi Matavire (Physiotherapist), Petronella Mutyambizi (Safeguarding), Debra Green (Team Manager).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/24011009/Sithethelelwe-%E2%80%98%E2%80%98Kwinji-15-Sibanda.jpg",
            "description": "<p>By Sports Reporter Zimbabwe senior women’s team coach Sithethelelwe “Kwinji 15” Sibanda has named a 23-woman squad to represent the country at the Four Nations tournament to be played in Malawi from the 29th of November to the 3rd of December. Zimbabwe are one of the four countries participating in the invitational tournament, alongside South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-names-mighty-warriors-squad-to-play-in-four-nations-tournament/\">Zimbabwe names Mighty Warriors squad to play in Four Nations Tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        },
        {
            "title": "‘Mugabe was bad, this is worse’ – Chamisa condemns abduction, torture of CUT students as Amnesty International demands investigation",
            "url": "https://www.newzimbabwe.com/mugabe-was-bad-this-is-worse-chamisa-condemns-abduction-torture-of-cut-students-as-amnesty-international-demands-investigation/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has condemned the abduction and torture of two Chinhoyi University of Technology (CUT) students during Students Representative Council (SRC) election campaigns, describing the brutality as barbaric and pure evil.\n\nThe students, Marlvin Saint Madanda and Lindon Zanga, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi.\n\nAccording to ZINASU, the two were taken by unidentified individuals driving an unmarked grey Isuzu, a vehicle that had previously been seen on the CUT campus distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nMadanda and Zanga were later found in Shamva, about 120 kilometres from where they were abducted, visibly injured, shaken, and unable to sit or walk properly.\n\nNarrating their ordeal, Zanga said they were tortured for more than 12 hours for allegedly chanting slogans deemed to be against the ruling ZANU PF party during their SRC campaign.\n\nThe abductors took us to a forest and accused us of campaigning and chanting slogans against ZANU PF, Zanga said. We clearly told them we were simply conducting ZINASU campaigns, which had nothing to do with ZANU PF.\n\nDear Mr MnangagwaThis is why this evil must be fought for as long as is necessary, . even for the rest of our lives or with our own lives. This is wrong in all material respects!pic.twitter.com/Kau1kuozeZ\n\n nelson chamisa (@nelsonchamisa)November 11, 2025\n\nChamisa compared the attack to atrocities committed under the late former president Robert Mugabe, saying the current wave of repression was even worse.\n\nDuring Mugabes long tenure, opposition activists were routinely abducted, tortured and killed for being critical of his administration and ruling party.\n\nWriting on X, Chamisa said: Dear @PoliceZimbabwe, why should this terrorism and primitive brutality on harmless students and innocent citizens be allowed to continue? Mr Mnangagwa, why should this not worry or concern you? Mugabe was bad. This is worse. So barbaric. This is pure evil!\n\nMeanwhile, human rights organisation Amnesty International has called for a thorough investigation into the attack and urged authorities to protect students rights to peaceful assembly and association.\n\nThese attacks threaten not just freedoms of assembly, expression, and association, but also the rights to education, non-discrimination, academic freedom, and participation in university public life.\n\nWe urge the authorities to thoroughly investigate these attacks and ensure that students can exercise their freedom of expression and peaceful assembly without fear of reprisals, intimidation, or torture, Amnesty International said in a statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has condemned the abduction and torture of two Chinhoyi University of Technology (CUT) students during Students Representative Council (SRC) election campaigns, describing the brutality as “barbaric and pure evil.” The students, Marlvin Saint Madanda and Lindon Zanga, who are members of the Zimbabwe National Students Union (ZINASU), were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabe-was-bad-this-is-worse-chamisa-condemns-abduction-torture-of-cut-students-as-amnesty-international-demands-investigation/\">‘Mugabe was bad, this is worse’ – Chamisa condemns abduction, torture of CUT students as Amnesty International demands investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        },
        {
            "title": "Man blows money mistakenly deposited into his bank accounts",
            "url": "https://www.newzimbabwe.com/man-blows-money-mistakenly-deposited-into-his-bank-accounts/",
            "content": "By Staff Reporter\n\nA RUSAPE man has appeared in court for squandering money mistakenly deposited into his bank account.\n\nGarikai Mtangandebvu (30) of Vengere, Rusape, was convicted of theft when he was arraigned before the Rusape Magistrates Court.\n\nHe unlawfully converted to his personal use US$1,885.45 and ZWL238,638.90, funds, which were intended for another individual with the same name.\n\nCourt heard that, sometime in July 2025, the offender, who works for a wholesale shop, got suspicious deposits into his bank accounts. Instead of notifying the bank or the rightful owner, Mtangandebvu withdrew the money and used it for personal benefit.\n\nIt was further heard that, when the legitimate recipient made a claim, the company discovered the error and reported the matter to the police.\n\nNothing was recovered from the offender.\n\nMtangandebvu was slapped with 36 months imprisonment, of which six months were suspended on condition of good behaviour. A further 15 months were set aside on condition of full restitution to the complainant. The remaining 15 months were suspended on condition that he perform 525 hours of community service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>By Staff Reporter  A RUSAPE man has appeared in court for squandering money mistakenly deposited into his bank account. Garikai Mtangandebvu (30) of Vengere, Rusape, was convicted of theft when he was arraigned before the Rusape Magistrates Court. He unlawfully converted to his personal use US$1,885.45 and ZWL238,638.90, funds, which were intended for another individual</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-blows-money-mistakenly-deposited-into-his-bank-accounts/\">Man blows money mistakenly deposited into his bank accounts </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        },
        {
            "title": "Parliament commits to push for increased roads infrastructure funding",
            "url": "https://www.newzimbabwe.com/parliament-commits-to-push-for-increased-roads-infrastructure-funding/",
            "content": "By Alois Vinga\n\nParliament has pledged to advocate for a reasonable budget allocation towards road infrastructure development amid growing calls for contractors to complete their assigned projects within set timeframes.\n\nIn recent years, Zimbabwe has invested significantly in major road infrastructure projects, including the rehabilitation and upgrading of the BeitbridgeBulawayoVictoria Falls Road, the HarareChirundu Highway, the Trabablas Interchange and the planned dualisation of the HarareNyamapanda Road. Other projects, such as the Mabvuku Interchange in Harare, are also underway.\n\nSpeaking at a recent media engagement, Goromonzi West legislator Biatah Nyamupinga, who sits on the Parliamentary Portfolio Committee on Transport and Infrastructure Development, said her committee is committed to advocating for increased allocations to the Transport Ministry as the country prepares for the 2026 National Budget.\n\nAs we approach the budget process, our committee commits to pushing for a reasonable allocation to the Transport Ministry. They need adequate resources to complete the ongoing road projects. The Ministry is doing a commendable job, and we are seeing progress across the country. Lets ensure these roads are completed, she said.\n\nNyamupinga urged the Transport Ministry to openly communicate any challenges it faces so Parliament can channel them to the relevant authorities for redress.\n\nShe also called on contractors to adhere to agreed timelines.\n\nIn some of the areas we have visited, contractors promised to complete their projects by March next year. Lets ensure those targets are met. Delivering on time will strengthen our case when we lobby for bigger allocations. We can then proudly say contractors are delivering the work they were paid for, she added.\n\nDue to high infrastructure demands, the Transport Ministry reportedly exceeded its 2024 national budget allocation by 245% within six months, prompting fresh calls for supplementary funding to sustain projects until year-end.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/20050128/Road-project.jpeg",
            "description": "<p>By Alois Vinga Parliament has pledged to advocate for a reasonable budget allocation towards road infrastructure development amid growing calls for contractors to complete their assigned projects within set timeframes. In recent years, Zimbabwe has invested significantly in major road infrastructure projects, including the rehabilitation and upgrading of the Beitbridge–Bulawayo–Victoria Falls Road, the Harare–Chirundu Highway,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-commits-to-push-for-increased-roads-infrastructure-funding/\">Parliament commits to push for increased roads infrastructure funding </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        },
        {
            "title": "Zimbabwean art finds global resonance in two new exhibitions",
            "url": "https://www.newzimbabwe.com/zimbabwean-art-finds-global-resonance-in-two-new-exhibitions/",
            "content": "Artgal.Online\n\nIn recent years, both market and institutional interest in contemporary African art has surged, and a new landscape of artists from the continent is quickly rising. Founded by Dennis Ruf, who is also the co-founder of Swiss-Zim Heritage Gallery,Artgal.Onlinechampions Zimbabwean art and artists, offering insight into both the rich creative traditions of the country, and the dialogues that arise when juxtaposed with other international contexts. Two upcoming exhibitions facilitated by Artgal.Online present an opportunity to explore Zimbabwean and other contemporary African art.\n\nDebuting November 28, 2025, is Heritage & Horizons, which can be viewed both online and in-person in Berlin, with exact venue details forthcoming. Exhibiting Zimbabwean artists within the milieu of Berlins own robust art scene invites dialogue around how history, heritage, and material exploration influence and inform artmaking today across countries and cultures.\n\nKeith Zenda,From Seeds to Strength(2025). Courtesy of Artgal.Online.\n\nBerlin marks both an end and a beginning said Ruf, Heritage & Horizons closes our 2025 season by bridging continents through artaffirming that heritage is living, transforming, and shared. It leads directly into our next chapter as we deepen our roots and widen our horizons.\n\nHeritage & Horizons includes both figurative and abstract works, ranging from mixed-media compositions from Flatter Zenda to a painting by Barry Lungu, whose compositions elevate everyday moments to near mythos.\n\nFlatter Zenda,The Ties that Bind Us(2025). Courtesy of Artgal.Online.\n\nOur artists carry stories that travelthrough color, texture, and symbol, Ruf added, in Berlin we celebrate that journey, and with the Artgal Zim Center we create a home for it: a place to learn, mentor, archive and dream, so the next generation can stand taller.\n\nLater in the year, Artgal.Online and Swiss-Zim Heritage will jointly stage Roots & Horizons  Christmas Edition, a seasonal show that platforms artists whose work reflects the diverse facets of heritage, identity, and spiritual renewal. Viewable online as well as at the Art84 Gallery in Zimbabwes capital city of Harare, the exhibition promises visitors a sweeping look at how Zimbabwean artistsboth established and emergingengage with their ancestral roots to find new pathways forward into the future.\n\nRoots & Horizons  Christmas Edition is more than an exhibition, said Ruf, its a reflection of gratitude. As the year closes, we celebrate the artists who remind us of where we come from and the possibilities ahead. This season, we wanted to bring art closer to everyoneonline and in personbecause art unites us. It transcends borders and, like the holidays, invites warmth and shared humanity.\n\nFrom realistic canvases by Nokuthula Mpofu and otherworldly portraits by Florah Maphosa to photorealistic drawings by Willard Mujuru and fantastical scenes painted by Keith Zenda, the exhibition traverses subject and medium to bring to life a comprehensive artistic world of possibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11173133/barry-lungu-joyful-leap-2024-1536x1097-1.webp",
            "description": "<p>Artgal.Online In recent years, both market and institutional interest in contemporary African art has surged, and a new landscape of artists from the continent is quickly rising. Founded by Dennis Ruf, who is also the co-founder of Swiss-Zim Heritage Gallery, Artgal.Online champions Zimbabwean art and artists, offering insight into both the rich creative traditions of the country,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-art-finds-global-resonance-in-two-new-exhibitions/\">Zimbabwean art finds global resonance in two new exhibitions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        },
        {
            "title": "Rape, fraud-accused Magaya granted US$3,000 bail",
            "url": "https://www.newzimbabwe.com/rape-fraud-accused-magaya-granted-us3000-bail/",
            "content": "By Mary Taruvinga\n\nProphetic, Healing and Deliverance Ministries founder, Walter Magaya, who is facing rape and fraud charges, has been granted bail by the Harare High Court.\n\nMagaya was granted US$3,000 bail by Justice Gibson Mandaza.\n\nThe beleaguered cleric was arrested last week, facing charges emanating from a botched housing project which defrauded some of his congregants of thousands of dollars.\n\nHe will appear before the court on November 18 for routine remand.\n\nMagayas co-accused, his wife Tendai Magaya and Tapiwa Chikondo, his bodyguard, who was facing a charge of resisting law officers, were granted bail by the Magistrates Court last week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Prophetic, Healing and Deliverance Ministries founder, Walter Magaya, who is facing rape and fraud charges, has been granted bail by the Harare High Court. Magaya was granted US$3,000 bail by Justice Gibson Mandaza. The beleaguered cleric was arrested last week, facing charges emanating from a botched housing project which defrauded some of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rape-fraud-accused-magaya-granted-us3000-bail/\">Rape, fraud-accused Magaya granted US$3,000 bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        },
        {
            "title": "Two CUT students abducted during SRC election campaigns – union",
            "url": "https://www.newzimbabwe.com/two-cut-students-abducted-during-src-election-campaigns-union/",
            "content": "By Staff Reporter\n\nTwo students from Chinhoyi University of Technology (CUT) were allegedly kidnapped on Monday night during campaigns for the Student Representative Council (SRC) elections, the Zimbabwe National Students Union (ZINASU) has claimed.\n\nAccording to ZINASU, its members, Lindon Zanga and Marlvin Saint Madanda, were violently abducted at Mzimba Shopping Centre in Chinhoyi.\n\nThe union said the pair was taken by unidentified individuals driving an unmarked grey Isuzuthat had previously been seen on campus distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nIn a statement, ZINASU alleged that the abductions were part of a wider attempt to intimidate students and silence dissenting voices on campus.\n\nThe two student leaders were snatched in front of dozens of witnesses in a brazen act of banditry that has not only instilled fear but also exposed the modus operandi of a rogue regime seemingly afraid of open contestation of ideas.\n\nThis is a panic reaction from ZICOSU, which is directly sponsored by the ruling ZANU PF regime, and a clear attempt to silence the students voice.\n\nStudents have ceased to be seen as beacons of academic excellence. In the eyes of a jittery regime, they are viewed as terrorists who defy oppression, ZINASU said.\n\nThe student union also accused ZANU PF Youth League Political Commissar Taurai Kandishaya of being involved in the conflict.\n\nThe notorious presence of Youth League Political Commissar Taurai Kandishaya, who has a sordid history of doing everything necessary and unnecessary to please his bosses, should not be overlooked.\n\nHe is known for threatening and exposing innocent citizens who dare to think differently from the ZANU PF script. His hand is visible in this case.\n\nAn SRC election should be a democratic process giving young people a glimpse into leadership, yet rogue elements in power continue to use state resources to suppress dissent and manipulate outcomes, ZINASU added.\n\nZINASU said it is demanding the immediate release of Zanga and Saint and vowed to take legal action over the matter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11111935/CUT-ZINASU.jpeg",
            "description": "<p>By Staff Reporter Two students from Chinhoyi University of Technology (CUT) were allegedly kidnapped on Monday night during campaigns for the Student Representative Council (SRC) elections, the Zimbabwe National Students Union (ZINASU) has claimed. According to ZINASU, its members, Lindon Zanga and Marlvin Saint Madanda, were violently abducted at Mzimba Shopping Centre in Chinhoyi. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-cut-students-abducted-during-src-election-campaigns-union/\">Two CUT students abducted during SRC election campaigns – union</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "12 Nov 2025"
        }
    ]
}