{
    "news": [
        {
            "title": "Thou shalt not lie!: Mafume escapes with a suspended sentence after lying under oath",
            "url": "https://www.newzimbabwe.com/thou-shalt-not-lie-mafume-escapes-with-a-suspended-sentence-after-lying-under-oath/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume on Tuesday escaped with a suspended sentence after being found guilty of lying under oath, thereby misleading the Commission of Inquiry with a false testimony.\n\nThe Commission of Inquiry, chaired by retired Justice Maphios Cheda, found Mafume guilty of intentionally lying about his residence.\n\nEarlier this month, Mafume embarrassingly misled the Commission by providing an incorrect address in Greendale, which he claimed to be his residence.\n\nWhen the Commission arrived at 110 Coronation Road, they found an undeveloped property belonging to Peter Pfukwa, who runs a vehicle auction business.\n\nMafume admitted before the Commission of Inquiry that he had lied under oath.\n\nIndeed that is what happened. It was an error on my part. I did not do that knowingly. I had recently moved into the premises. The Commission must note that the street is the same. The area is in Greendale. My error was in the numbers, said Mafume.\n\nThe Commission of Inquirys evidence leader, Tapiwa Godzi, submitted that Mafume had taken the Commission for a ride by misleading it.\n\nRetired Justice Cheda invoked Section 13 of the Commission of Inquiry Act, sentencing Mafume to pay a fine of US$300 or face three months imprisonment. However, the sentence was suspended on the condition that Mafume does not commit a similar offence within the next five years.\n\nHarare mayor Jacob Mafume has been found guilty of breaching Section 13 of the Commissions of Inquiry Act for lying under oath while appearing before a Commission of Inquiry.\n\nHe has been sentenced to pay a fine of $300 or serve 3 months of imprisonment with hard labour, thepic.twitter.com/WK43RYWr0O\n\n NewZimbabwe.com (@NewZimbabweCom)February 18, 2025\n\nYou have been found guilty of contravening Section 13 of the Commission of Inquiry Act. You gave evidence which you knew was false. In assessing a suitable take into account what you have submitted in mitigation.\n\nJacob Mafume, you are sentenced to pay a fine of US$300 or three months in prison which is wholly suspended for five years on condition that during that period you are not convicted of contravening section 13 or 14 of the Act, said Cheda.\n\nMafume is the second council official to have been found guilty of contravening the Commission of Inquiry Act after Takudzwa Dzumbunu was detained last year for being evasive before the Commission.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06142935/mafume-mayor.jpg",
            "description": "<p>By Darlington Gatsi HARARE Mayor Jacob Mafume on Tuesday escaped with a suspended sentence after being found guilty of lying under oath, thereby misleading the Commission of Inquiry with a false testimony. The Commission of Inquiry, chaired by retired Justice Maphios Cheda, found Mafume guilty of intentionally lying about his residence. Earlier this month, Mafume</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thou-shalt-not-lie-mafume-escapes-with-a-suspended-sentence-after-lying-under-oath/\">Thou shalt not lie!: Mafume escapes with a suspended sentence after lying under oath </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "Zimbabwe beats Ireland to win ODI Series",
            "url": "https://www.newzimbabwe.com/zimbabwe-beats-ireland-to-win-odi-series/",
            "content": "By Sport Reporter\n\nBen Curran was the hero for Zimbabwe senior mens cricket team, Tuesday afternoon in their 9 wickets win against Ireland at Harare Sports Club.\n\nThe victory saw Zimbabwe sealing a 2-1 victory in the three-match ODI series which started last week.\n\nZimbabwe were desperate to redeem themselves in Tuesdays match, after losing the Test match against the visitors at Queens Sports Club in Bulawayo last week.\n\nTuesdays win came at the back of a 7 wicket defeat against the visitors who then levelled the series after they had suffered a 49-run loss in the first match.\n\nIreland lost the match and was left to bat first, posting a total of 240 runs in 50 overs, losing six wickets in the process.\n\nWith a task to chase 240 runs, the Chevrons did not disappoint with the opening batting partnership of Ben Curran and Brian Bennett posting a combined total of 124 runs before Bennett was dismissed which led to the introduction of Craig Ervine who posted 69 runs.\n\nBen Curran then carried the day as he went all the way to manage 118 runs off 130 balls, recording his first century in ODI career.\n\nCurrans century is the fourth fastest in ODI in history for the Chevrons, hence he was undoubtedly voted Player of The Match.\n\nUnbelievable feeling, and also to get the series win is big for us.\n\nJust happy to contribute, to be honest, I wouldnt say there is too much of a difference.\n\nIts a good feeling and Im very glad to be part of this, said Curran during post-match interview.\n\nThe Chevrons win over Ireland was the first ODI win on home soil since beating the Netherlands in 2023.\n\nLast year the team struggled with form as it failed to win all the ODI series played on home soil.\n\nZimbabwe and Ireland will now shift focus to the upcoming three-match T20 series scheduled for February 22nd, 24thand 26th.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/18180947/cricket-ODI.jpeg",
            "description": "<p>By Sport Reporter Ben Curran was the hero for Zimbabwe senior men’s cricket team, Tuesday afternoon in their 9 wickets win against Ireland at Harare Sports Club. The victory saw Zimbabwe sealing a 2-1 victory in the three-match ODI series which started last week. Zimbabwe were desperate to redeem themselves in Tuesday’s match, after losing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-beats-ireland-to-win-odi-series/\">Zimbabwe beats Ireland to win ODI Series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "Three victims report sexual assault and violence at Zanzou nightclub in Pretoria",
            "url": "https://www.newzimbabwe.com/three-victims-report-sexual-assault-and-violence-at-zanzou-nightclub-in-pretoria/",
            "content": "IOL\n\nThree victims have come forward to report incidents of abuse at Pretorias Zanzou nightclub, following the circulation of disturbing videos showing security personnel using excessive force on suspects.\n\nThe victims, aged 20, 21 and 22, have alleged sexual assault, kidnapping, and assault. SAPS is investigating, with the Family Violence, Child Protection, and Sexual Investigations (FCS) unit taking the lead.\n\nThis follows the release of number of videos, showing security personnel using excessive force  allegedly at the club  against suspects linked to phone thefts, prompting a widespread condemnation of the actions captured on tape.\n\nPolice had urged victims and witnesses to come forward, and three individuals, out of a group of five friends who had been assaulted, have reported incidents of abuse at the Brooklyn police station.\n\nThe victims recounted harrowing experiences that further substantiated the claims circulating online. The SAPS revealed that they are currently investigating serious charges, including compelled rape, assault, crimen injuria, intimidation, and kidnapping.\n\nAuthorities have flagged these incidents as severe human rights violations, with allegations ranging from kidnapping to sexual assault and attempted murder.\n\nAt the centre of the unfolding situation, a former nightclub bouncer named Pablo  believed to have released the videos  has come forward, claiming to possess crucial evidence for the investigation.\n\nHe claims that he holds more than 75 additional videos revealing the dark activities within Zanzou.\n\nEverything is true. Everything is 100% true, he said.\n\nPablo further elaborated on fatal incidents at the club and revealed that he has received death threats due to his knowledge of the clubs operations.\n\nMeanwhile, the Economic Freedom Fighters (EFF) held a picket outside the nightclub, demanding the arrest of the owner and the establishments closure. Zanzou Management has acknowledged the incidents and dismissed the involved security personnel.\n\nThe National Commissioner of the South African Police Service (SAPS), General Fannie Masemola, has instructed the Provincial Commissioner of Gauteng, Lieutenant General Tommy Mthombeni, to swiftly pursue those implicated.\n\nThe Department of Justice and Constitutional Development has also expressed strong condemnation of the actions revealed in the videos, labelling them as a gross infringement of the human rights enshrined in South Africas Constitution.\n\nIn a statement, the department called for a decisive and urgent response from law enforcement agencies, insisting that all those complicit in these violations be held accountable.\n\nIn response to the unfolding scandal, the Economic Freedom Fighters (EFF) held a picket outside the nightclub, demanding the immediate arrest of Stephane Cohen, alleged as the the clubs owner, and calling for the establishments closure.\n\nThe party expressed its outrage at the reported dehumanisation of individuals, insisting that no justification exists for the violence depicted in the videos.\n\nThe City of Tshwane, and indeed South Africa, is a democratic state, with the rule of law and respect for human rights, the EFF declared.\n\nWe reject any attempt by management to shift blame onto security personnel.\n\nThe organisation Not in My Name has expressed its sorrow over the violence that transpired within Zanzou, echoing calls for justice to be pursued rigorously.\n\nIn a statement released yesterday, Zanzou Management acknowledged awareness of the troubling videos depicting violent security responses to theft.\n\nThey claimed that upon becoming aware of such practices, they initiated an immediate investigation, resulting in the dismissal of the implicated security personnel.\n\nZanzou Management is aware of the circulation of disturbing historical videos that depict security personnel employing excessive and violent force in response to incidents of phone theft by the individuals therein. At the time when management became aware of these practices, an immediate investigation was conducted, which resulted in the immediate halting of such as well as the dismissal of security personnel responsible for the perpetration thereof, the statement read.\n\nIn a swift response to a series of distressing videos that have circulated on social media, Zanzou Management has taken decisive action following the exposure of security personnel employing excessive force against individuals suspected of phone theft. The troubling footage has sparked outrage among patrons and the wider community, prompting urgent intervention from the nightclubs leadership. Picture: Screenshot\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/18124123/zanzou.webp",
            "description": "<p>IOL Three victims have come forward to report incidents of abuse at Pretoria’s Zanzou nightclub, following the circulation of disturbing videos showing security personnel using excessive force on suspects. The victims, aged 20, 21 and 22, have alleged sexual assault, kidnapping, and assault. SAPS is investigating, with the Family Violence, Child Protection, and Sexual Investigations</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-victims-report-sexual-assault-and-violence-at-zanzou-nightclub-in-pretoria/\">Three victims report sexual assault and violence at Zanzou nightclub in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "Harare City Council executive milking the coffers dry, earning half a million US dollars in salaries monthly",
            "url": "https://www.newzimbabwe.com/harare-city-council-executive-milking-the-coffers-dry-earning-half-a-million-us-dollars-in-salaries-monthly/",
            "content": "By Costa Nkomo\n\nAt a time when the Harare City Council is struggling to provide basic services to its residents  from uncollected refuse and perennial sewage problems to non-functional traffic lights and a failure to deliver safe drinking water  it has emerged that the councils top management is essentially bleeding the city dry by awarding themselves exorbitant salaries.\n\nDuring his testimony before the Commission of Inquiry, led by Retired Judge Justice Maphios Cheda, Harare Mayor Jacob Mafume revealed that the councils executive is collectively pocketing half a million US dollars in salaries each month.\n\nThe Town Clerk, he stated, is earning a staggering US$27,000.\n\nI asked the Human Resources director for a report on salaries, Mafume testified. He refused to give it to me, saying it was an instruction from the Town Clerk. He then showed me the document in confidence, and from what I saw, the highest-paid executive is receiving US$27,000.\n\nMafume added that the lowest-paid member of the executive is taking home a handsome US$15,000.\n\nCommission lead evidence Thabani Mpofu asked Mafume to confirm that these hefty salaries did not include any additional benefits, to which Mafume replied in the affirmative, adding that with other perks factored in, the total remuneration would likely tip the scales at over US$30,000.\n\nJustice Cheda then probed Mafume further, questioning why he seemed to lack the authority to curb the lavish spending of the executive, to which he responded that executives are always quick to remind him that he is not an executive mayor and therefore his power is limited.\n\nJustice Cheda further inquired about the current relationship between the City Council executive and the councillors, which Mafume described as not harmonious.\n\nMafume was also grilled about the proliferation of service stations in residential areas, some of which Harare City Councils Town Planning Director, Samuel Nyabeza, has pledged to demolish because they pose serious safety issues to residents.\n\nHe was further taken to task over the non-functional traffic lights in Harare, which have contributed significantly to traffic accidents, some of which have tragically claimed lives.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Costa Nkomo At a time when the Harare City Council is struggling to provide basic services to its residents – from uncollected refuse and perennial sewage problems to non-functional traffic lights and a failure to deliver safe drinking water – it has emerged that the council’s top management is essentially bleeding the city dry</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-executive-milking-the-coffers-dry-earning-half-a-million-us-dollars-in-salaries-monthly/\">Harare City Council executive milking the coffers dry, earning half a million US dollars in salaries monthly</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "‘Don’t Ask. We are adults’: Khanyi Mbau and Kudzai Mushonga kiss and make-up",
            "url": "https://www.newzimbabwe.com/dont-ask-we-are-adults-khanyi-mbau-and-kudzai-mushonga-kiss-and-make-up/",
            "content": "News24\n\nReality TV star and actor Khanyi Mbau announced via Instagram on Monday that she and Kudzai Mushonga are back together again.\n\nEarlier this month, Mbau sent shockwaves across social media when she announced their split.\n\nHe was a good guy, but he did some bad things, he tried everything he could to make it up to me. I did most of my grieving while we were together. I finally got the courage to leave. And of course, I wish him the best, she wrote.\n\nThe pair who dated for five years and became one of the most popular couples in SA during that time, have now buried the hatchet, yet again.\n\nDont ask!! he didnt entertain my rubbish.We are adults!!! (listen dont judge).Besides where would I go with a thigh laminated in bold with his name, she wrote.\n\nHeres a look back at the couples tumultuous dating life following these developments:\n\nThe beginning: January 2021\n\nJanuary 2021 marked the beginning of what would be a rollercoaster relationship for Mbau and Mushonga.\n\nAfter having been single for a while following her public split from Kwela Tebza musician Tebogo Lerole, South Africans caught glimpses of Mbaus new man when she started posting the then mystery man on Instagram.\n\nThe man was later revealed as Terrence Kudzai Mushonga, a Zimbabwean-born controversial millionaire.\n\nExtravagant love and controversy: February 2021\n\nThe couple made their relationship public in February.\n\nSoon after that, the TV personality started posting her bae, showing offher expensive Valentines Day gifts, which included a hotel room filled with 1 250 individually staged red roses and Louis Vuitton bags.\n\nThat same month Zimbabwe Republic Police Assistant Commissioner Paul Nyathi toldCity Pressthat Mushonga had been on the run for almost five years.\n\nPlease be advised that our criminal investigation department has advised us that Mushonga is a wanted person in connection with a report of fraud made by Margaret Chipunza of African Century Limited in 2016, Nyathi said in a statement.\n\nAccording to a report in The Herald, a state-owned newspaper in Zimbabwe, Mushonga and three accomplices defrauded the microlender of $166 000 (R3.1 million).\n\nFor more info on the allegations that were labelled against Mushonga, readhere.\n\nLove tattoo: March 2021\n\nDespite the controversy surrounding Mushonga, Mbau continued to stand by her man and even went as a far as getting a tattoo of his name on her thigh.\n\nWhen you showed me before bedtime, I was in shock. Love you always. No going back. We will never end, Mushonga wrote on his Instagram account, which has since been deactivated.\n\nMbau flees Dubai: August 2021\n\nA couple of months went by as the pair served couple goals. They continued to share loved-up snaps right until Mushonga set the country in a panic when he claimed that he was unable to locate Mbau in Dubai after dropping her off at a salon.\n\nThe actor was on the trends list, with some genuinely worried about her whereabouts.\n\nHowever, Mbau later in an Instagram post,revealed that she was in Johannesburg, posting a photo of herself at her fathers grave, dispelling allegations that she went missing.\n\nMbau cleared the air with News24, saying she was home safe and sound after her partner expressed concern on Instagram.\n\nI am home safe and sound. I am so sorry to have worried and stressed the country, my fans, friends, relatives and family. Thank you for all your prayers, support, search parties, and all my friends who pulled major strings to locate me.\n\nREAD |Khanyi Mbau sorry to have worried and stressed country after boyfriend claimed shed gone missing\n\nAfter her whereabouts were confirmed, Mushonga, in a 24-minute Instagram Live broadcast, said: I dont know if this is the part where were breaking up, or there was something urgent that I didnt have to know.\n\nWe didnt fight; we didnt argue the same day that she left, he said about the events that transpired in the lead-up to her departure from Dubai.\n\nHe went on to say that he still loved Khanyi.\n\nYou hurt me, he said to Khanyi. I never lied to that woman. I told the truth. And Khanyi is the first lady that I never cheated on. In my whole life  Ive been a bad guy, guys, he said.\n\nMushonga later apologised to Khanyi for sharing their personal life on Instagram. I was hurting. I honestly didnt know how to deal with my emotions, baby. I love you.\n\nHe added: Im not ashamed to stand on top of the world and admit I love you I love you, and Im sorry.\n\nWater under the bridge or so it seemed: September 2021\n\nThe Young, Famous & Africanstarreunited with Mushongain Dubai after a few weeks in South Africa.\n\nMushonga later shared on his Instagram stories and videos how he showered Mbau with gifts from Cartier. The couple was later seen sharing a kiss while cosying up in the backseat of a Mercedes-Maybach.\n\nThe social media debacle even earned Mbau a Drama Queen of the Year nomination at the 2021 Feather Awards.\n\nCreating a life in Dubai: October 2021  2022\n\nFor a while after the eventful start to their relationship, the couple seemed to have finally found their rhythm. They relocated to Dubai, with hope of building an empire together.\n\nWhile the true nature of their love can only be confirmed by the pair, the years 2022 to 2023 were lived away from the spotlight, with Mbau occasionally offering a glimpse into her relationship when she was doing interviews for new projects.\n\nAfter her debut on Young, Famous & African in 2022, the actor spoke of being in a loving relationship with Mushonga despite their seven-year age gap.\n\nTrouble in paradise? 2023/2024\n\nIn the last episode of season three of the reality show, Mbau confirmed cracks in her relationship with Mushonga.\n\nIn a scene where she engaged with Naked DJ and offered advice about his relationship, the Metro FM DJ questions Mbau silence and why she was portraying a happy relationship with Mushonga on social media.\n\nMbau revealed she had burnout but did not offer any information of the current state of her relationship.\n\nThe end of the road: 3 February 2025\n\nAfter nearly 5 years, Mbau announced that she had broken up with her boyfriend and said it had been a long time coming.\n\nHe was a good guy, but he did some bad things; he tried everything he could to make it up to me. I did most of my grieving while we were together. I finally got the courage to leave. And, of course, I wish him the best, she wrote.\n\nGive everything time. I am grateful for the experience, she captioned the post that she has since deleted.\n\nThe beginning of another chapter? 17 February 2025\n\nWhile many were sure the pair were done, and others were processing the breakup, Mbau announced that theyve kissed and made up.\n\nHe called, demanded I address the bad things he did, she wrote, saying she was headed home.\n\nSEE THE POST HERE:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/18061211/KHANYI-KUDZAI.webp",
            "description": "<p>News24 On Monday Khanyi Mbau announced that she and her businessman boyfriend Kudzai Mushonga have made up after a short-lived breakup. This comes less than a month after Mbau announced on 3 February that she had ended her long-time relationship with Mushonga. The couple, who had been together for five years, have marked several, public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-ask-we-are-adults-khanyi-mbau-and-kudzai-mushonga-kiss-and-make-up/\">‘Don’t Ask. We are adults’: Khanyi Mbau and Kudzai Mushonga kiss and make-up</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "If money was stolen, report to the police – Mnangagwa says his time being wasted on questions over Chivayo’s splurging",
            "url": "https://www.newzimbabwe.com/if-money-was-stolen-report-to-the-police-mnangagwa-says-his-time-being-wasted-on-questions-over-chivayos-splurging/",
            "content": "By Costa Nkomo\n\nPresident Emmerson Mnangagwa has dismissed claims that controversial businessman Wicknell Chivayo is acting as his frontman, distributing vehicles and cash donations to various individuals, largely from his ruling Zanu-PF party and the artistic community.\n\nHe has defended Chivayo as a philanthropist, a view sharply at odds with that of his deputy, Constantino Chiwenga, who appears to consider Chivayo an unscrupulous businessman.\n\nRumours have been rife, that Chivayo is being used by Mnangagwa to lavish gifts  from luxury to budget vehicles  on strategic individuals, particularly artists, in a bid to drum up support for a potential presidential term extension. This is despite Mnangagwa maintaining that he will abide by the constitution and step down in 2028.\n\nAddressing journalists at State House on Monday, Mnangagwa refuted allegations that he is providing Chivayo with funds to splash around the country at a time when the economy and social services are on their knees.\n\nWhere would I get the money to give him? he questioned.\n\nInvestigate where you think Im getting the money to give Chivayo to distribute, rather than wasting my time worrying about someone who is using his own money. You cant bother me about someone who is philanthropic. If anyones money was stolen then they should report to the police.\n\n\"Kana pane akabirwa please report to the police\"  President Mnangagwa comments on Chivayo's splurging\n\nJoin thehttps://t.co/iVVKatQx0sChannelhttps://t.co/4EHrosKaUfpic.twitter.com/KCqUAs56mV\n\n NewZimbabwe.com (@NewZimbabweCom)February 17, 2025\n\nChivayo has been seen distributing vehicles and cash across the country, even, on occasion, throwing banknotes into the crowd, prompting desperate Zimbabweans to scramble for the money.\n\nWhile Mnangagwa paints Chivayo as a benevolent benefactor, his deputy, Constantino Chiwenga, views him in a distinctly different light.\n\nAddressing mourners at the National Shrine last month, Chiwenga, though not mentioning Chivayo by name, launched a veiled attack on his character, referring to him as a chigananda. Translated, this term implies someone who engages in dubious deals at the expense of others.\n\nVision 2030 is for all of us, not those you refer to asmbinga. During the liberation struggle, we referred to those aszvigananda.\n\nTo add fuel to the fire, Chivayo has publicly voiced his support on X (formerly Twitter) for Mnangagwas presidential term extension, arguing that the Zanu-PF leaders vision must be supported, not derailed.\n\nOutspoken Zanu-PF Central Committee member and war veteran Blessed Geza, now hunted by the police after his explosive press conference demanding Mnangagwas resignation (chiefly due to corruption), has also turned his ire towards Chivayo.\n\nGeza questioned the provenance of Chivayos seemingly limitless wealth, implicitly pointing the finger at Mnangagwa, suggesting his actions are merely to divert attention.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/10132512/Mnangagwa-and-Chivayo.webp",
            "description": "<p>By Costa Nkomo President Emmerson Mnangagwa has dismissed claims that controversial businessman Wicknell Chivayo is acting as his frontman, distributing vehicles and cash donations to various individuals, largely from his ruling Zanu-PF party and the artistic community. He has defended Chivayo as a philanthropist, a view sharply at odds with that of his deputy, Constantino</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/if-money-was-stolen-report-to-the-police-mnangagwa-says-his-time-being-wasted-on-questions-over-chivayos-splurging/\">If money was stolen, report to the police – Mnangagwa says his time being wasted on questions over Chivayo’s splurging</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "Warriors to host Benin in South Africa as new ZIFA exco misses target",
            "url": "https://www.newzimbabwe.com/warriors-to-host-benin-in-south-africa-as-new-zifa-exco-misses-target/",
            "content": "By Sport Reporter\n\nZimbabwe Football Association (ZIFA) has announced that Moses Mabhidha Stadium in Durban, South Africa will be the home venue for the upcoming Warriors match against Benin.\n\nThis is despite assurances by new ZIFA president Nqobile Magwizi that the 2026 World Cup Qualifiers would be played at the National Sports Stadium which is currently under renovation.\n\nThe two sides will clash on the 20th of March in a Group C 2026 World Cup Qualifiers match.\n\nZimbabwe has been without a CAF-approved ground since its re-admission to the international football family in July 2023 and has been seeking refuge in foreign lands for home matches.\n\nThe Zimbabwe Football Association (ZIFA) is delighted to announce that the Zimbabwe Senior Mens National Team, the Warriors, will play their Matchday 5, Group C, FIFA World Cup Qualifier against Benin at the iconic Moses Mabhida Stadium in Durban, South Africa.\n\nOriginally, ZIFA had planned to host this fixture in Polokwane; however, after it was allocated to Bafana Bafana in January, alternative venues had to be considered, read part of ZIFA statement.\n\nIn an interview withThe Standardthree weeks back, Magwizi had said the National Sports Stadium will be ready in time for the World Cup Qualifiers.\n\nWe are keen to have football return to the National Sports Stadium as soon as possible.\n\nAlthough it will not be easy, we aim to mobilise resources to see to it that renovations are completed in time for the World Cup Qualifiers, he pledged.\n\nNational Sports Stadium is the only local stadium close to meeting FIFAs required standards, provided all the recommendations boxes are ticked.\n\nPart of the requirements includes the installation of electronic turnstiles, bucket seats, standard changing rooms, and electronic screens.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10172257/WhatsApp-Image-2024-10-10-at-18.22.36.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe Football Association (ZIFA) has announced that Moses Mabhidha Stadium in Durban, South Africa will be the home venue for the upcoming Warriors match against Benin. This is despite assurances by new ZIFA president Nqobile Magwizi that the 2026 World Cup Qualifiers would be played at the National Sports Stadium which is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-to-host-benin-in-south-africa-as-new-zifa-exco-misses-target/\">Warriors to host Benin in South Africa as new ZIFA exco misses target</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "OK Zimbabwe blames ZWG devaluation; calls for market-determined exchange rates",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-blames-zwg-devaluation-calls-for-market-determined-exchange-rates/",
            "content": "By Alois Vinga\n\nLEADING retailer Ok Zimbabwe says the Reserve Bank of Zimbabwes (RBZ) decision to devalue the ZWG currency doubled the entitys US$-denominated loans and credits.\n\nThe supermarket chain is currently reeling under pressure to keep its heads above water as most shelves have gone empty without any stocks. At the heart of the problems is supplier resistance to offering commodities, which are often paid for in local currency.\n\nThe situation has led many suppliers to channel their commodities to the informal market, which often enjoys easy access to the much-needed greenback.\n\nPresenting a trading update for the third quarter period, OK Zimbabwes group company secretary, Margaret Munyuru, bemoaned the impact of the central banks decisions.\n\nThe local currency unit (ZWG) experienced a sharp devaluation at the end of September 2024 as monetary authorities sought to improve the viability of the exchange rate system for the broader economy. Invariably, the devaluation had the net effect of nearly doubling existing US Dollar denominated obligations in loans and creditors balances, she said.\n\nIn September 2024,the RBZdevalued the ZWG currency by 43%to keep pace with exchange rate premiums which had seen the official rate at the time stuck at ZWG13,80 when the parallel market rate had gravitated to a premium of ZWG30 against the greenback.\n\nThe move effectively worsened most retailers and companies balance sheets as they now had to pay more for their debts.\n\nMunyuru said during the period, the group had outstanding and overdue creditorsbalances which were predominantly denominated in US$ sales collection.\n\nShe attributed the low stocking levels to the direct manifestation of sub-economic pricing arising out of exchange rate distortions and suppliers need for foreign currency invoicing to cover their operational and raw material needs.\n\nResultantly, volumes during the period decreased by 36% in comparison to the same period last year. The reduction for the quarter also translated to a 36% revenue decline.\n\nDespite the challenges, the business has since begun to restock with support from suppliers as well as financial institutions that continue to assist with short-term funding structures.\n\nNew alternative procurement models have been developed which include, but are not limited to, a structured stock supply arrangement with a third party for supplier assurance purposes as the business works to restore critical supply relationships with both local and foreign suppliers.\n\nThe fortunes of the countrys formal retail sector hinge on the stability of our exchange rate regime. There is a need for absolute clarity on the roadmap towards a full market-determined exchange rate system. Such a liberalized system will go a long way in restoring the competitiveness of the formal retail sector, added Munyuru.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga LEADING retailer Ok Zimbabwe says the Reserve Bank of Zimbabwe’s (RBZ) decision to devalue the ZWG currency doubled the entity’s US$-denominated loans and credits. The supermarket chain is currently reeling under pressure to keep its heads above water as most shelves have gone empty without any stocks. At the heart of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-blames-zwg-devaluation-calls-for-market-determined-exchange-rates/\">OK Zimbabwe blames ZWG devaluation; calls for market-determined exchange rates   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "Hate speech on X surged for at least 8 months after Elon Musk takeover – new research",
            "url": "https://www.newzimbabwe.com/hate-speech-on-x-surged-for-at-least-8-months-after-elon-musk-takeover-new-research/",
            "content": "The Conversation\n\nHate speech on X was consistently 50% higher for at least eight months after tech billionaire Elon Musk bought the social media platform, new research has found.\n\nThe research looked at the prevalence of overt hate speech including a wide range of racist, homophobic and transphobic slurs.\n\nThe study,published today in PLOS ONE, was conducted by a team of researchers led by Daniel Hickney from the University of California, Berkeley.\n\nIt clearly demonstrates how a platform initiallyinvented to help friends and family stay in touchhas now metamorphosed into a place where hate speech is prolific. This is especially concerning givenhate speech online has been linkedto violent hate crimes offline.\n\nOn October 27 2022, Musk officially purchased X (then known as Twitter) for US$44 billion and became its CEO. His takeover was accompanied by promises toreduce hate speechon the platform andtackle botsand other inauthentic accounts.\n\nBut after he bought X, Musk made several changes to the platform to reduce content moderation. For example,in November 2022 he firedmuch of the companys full time workforce. He also fired outsourced content moderators who tracked abuse on X, despite research showing social medial platforms with high levels of content moderationcontain less hate speech.\n\nThe following month,Musk also disbanded the platforms Trust and Safety Council a volunteer advisory group of independent human rights leaders and academics formed in 2016 to fight hate speech and other problems on the platform.\n\nPrevious researchhas shownhate speech increased on X immediately afterMusk took over. So too did the prevalence of most types of bots.\n\nThis new study is the first to show that this wasnt an anomaly.\n\nThe study examined 4.7 million English language posts on X from the beginning of 2022 through to June 9 2023. This period includes the ten months before Musk bought X and the eight months afterwards.\n\nThe study measured overt hate speech, the meaning of which was clear to anyone who saw it  speech attacking identity groups or using toxic language. It did not measure covert types of hate speech, such ascoded language used by some extremist groupsto spread hate but plausibly deny doing so.\n\nAs well as measuring the amount of hate speech on X, the study also measured how much other users engaged with this material by liking it.\n\nThe researchers access to X data was cut off during the study due to a policy change by the platform, replacing free access to approved academic researchers with payment options which are generally unaffordable. This significantly hampered their ability to collect sample posts. But they dont mention whether it affected their results.\n\nThe study found a clear increase in the average number of posts containing hate speech following Musks purchase of X. Specifically, the volume of posts containing hate speech was consistently 50% higher after Musk took over X compared to beforehand  a jump from an estimated average of 2,179 to 3,246 posts containing hate speech per week.\n\nTransphobic slurs saw the highest increase, rising from an average of roughly 115 posts per week before Musks acquisition to an average of 418 afterwards.\n\nThe level of user engagement with posts containing hate speech also increased under Musks watch. For example, the weekly rate at which hate speech content was liked by users jumped by 70%.\n\nThe researchers say these results suggest either hate speech wasnt taken down, hateful users became more active, the platforms algorithm unintentionally promoted hate speech to users who like such content  or a combination of these possibilities.\n\nThe study also detected no decrease in the activity of inauthentic accounts on X. In fact, it found a potential increase in the number of bot accounts partly based on a large upswing in posts promoting cryptocurrency, which are typically associated with bots.\n\nThere were a number of limitations to the study. For example, it only measured hate speech posts in English, which accounts foronly 31% of postson the platform.\n\nEven so, the study is an important, data-driven deep dive into the state of X. It shows it is a platform where hate speech is prolific. It also shows Musk has failed to fulfil his earlier promises to address problems on X such as hate speech and bot activity.\n\nAsMusk himself saidat the White House earlier this week: Some of the things I say will be incorrect and should be corrected.\n\nAssociate professor, Institute for Governance and Policy Analysis, University of Canberra, University of Canberra\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/26043006/esla-and-SpaceX-CEO-Elon-Musk.jpeg",
            "description": "<p>The Conversation Hate speech on X was consistently 50% higher for at least eight months after tech billionaire Elon Musk bought the social media platform, new research has found. The research looked at the prevalence of overt hate speech including a wide range of racist, homophobic and transphobic slurs. The study, published today in PLOS ONE,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hate-speech-on-x-surged-for-at-least-8-months-after-elon-musk-takeover-new-research/\">Hate speech on X surged for at least 8 months after Elon Musk takeover – new research</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        },
        {
            "title": "Miniyothabo Chiwenga drops fraud charges against Gray Homes owners in botched US$1 million construction deal",
            "url": "https://www.newzimbabwe.com/miniyothabo-chiwenga-drops-fraud-charges-against-gray-homes-owners-in-botched-us1-million-construction-deal/",
            "content": "By Staff Reporter\n\nThe State on Monday withdrew criminal charges against a Harare couple and owners of a top construction company, Gray Homes, who were accused of duping Vice President Constantino Chiwengas wife Miniyothabo Baloyi-Chiwenga of nearly US$1 million.\n\nThe couple, Annavestah Mudiwa (39) and her husband Gray Mudiwa failed to complete a double-storey mansion, warehouse and shopping mall despite receiving the payment from Miniyothabo.\n\nThe case was withdrawn before Harare magistrate Donald Ndirowei but no reasons were given in court.\n\nThe State was alleging thatsometime in March 2023, thecoupleduped the complainant into believing that they could construct for her a double-storey house, a cottage and a precastwall.\n\nThey misrepresented their capacity and falsified that they could and would complete the project in 90 days.\n\nThis excited the complainant leading to her dispatching US$560,000to the accused persons,the statesaid.\n\nIt was alleged that after receiving the funds, the accused persons diverted them to their own use, and did not complete the project prejudicing Chiwenga of US$389,100.\n\nIn the second count itwas alleged that sometime in June 2023, the accused persons misled the complainant into believing that they were able to construct a Warehouse at Chivaraidze Farm in Goromonzi while they knew and were certain that they could not work on the construction.\n\nActing on the misrepresentation Chiwenga again proceeded to give to the accused persons US$550,000.\n\nAfter receiving the funds, the accused did not complete the projected and converted funds amounting to US$390,000 to their own use. The accused did not complete the project as was promised, said the state.\n\nIt was alleged that nothing was recovered.\n\nIn the last count itwas alleged that in September 2023, using the same modus operandi, the accused persons convinced Chiwenga that they were able to construct a Shopping Mall at Silalatshani Business Centre in Filabusi on behalf of the complainant while they knew that they had no capacity to do so.\n\nThe accused was given US$158,000 due to the misrepresentation.\n\nAfter receiving the funds, the accused persons diverted funds worth US$151,000 to their own use.\n\nAs a result of the accuseds actions, the complainant suffered a total financial prejudice in the sum of US$151,000 and nothing has been recovered so far, the court heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051524/zdf-chiwengas.jpeg",
            "description": "<p>By Staff Reporter The State on Monday withdrew criminal charges against a Harare couple and owners of a top construction company, Gray Homes, who were accused of duping Vice President Constantino Chiwenga’s wife Miniyothabo Baloyi-Chiwenga of nearly US$1 million. The couple, Annavestah Mudiwa (39) and her husband Gray Mudiwa failed to complete a double-storey mansion,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miniyothabo-chiwenga-drops-fraud-charges-against-gray-homes-owners-in-botched-us1-million-construction-deal/\">Miniyothabo Chiwenga drops fraud charges against Gray Homes owners in botched US$1 million construction deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "18 Feb 2025"
        }
    ]
}