{
    "news": [
        {
            "title": "Do not turn Zimbabwe into Operation Dudula – Mutsvangwa slams ‘overzealous’ Tagwirei over anti-foreigner comments",
            "url": "https://www.newzimbabwe.com/do-not-turn-zimbabwe-into-operation-dudula-mutsvangwa-slams-overzealous-tagwirei-over-anti-foreigner-comments/",
            "content": "By Darlington Gatsi\n\nZANU PF spokesperson Christopher Mutsvangwa has rebuked controversial businessman Kudakwashe Tagwirei over his recent remarks calling for foreign nationals to be excluded from investing in certain sectors of the economy, describing the comments as xenophobic.\n\nTagwirei recently told a ZANU PF meeting that foreigners should be removed from sectors such as transport, retail, and energy.\n\nIn response, Mutsvangwa warned Tagwirei against pushing sentiments that could evolve into a movement resembling South Africas anti-immigrant vigilante group, Operation Dudula.\n\nZimbabwe was founded on the support of Africa, the Africa liberation committee and one of the beneficiaries, as a young guerrilla was the current president. Africa matters to us as a country. So you do not go about saying we do not want foreigners in Zimbabwe.\n\nWe do not want Dudula here. We are an African country. Africans are not foreigners in Zimbabwe. If there are certain things that were being done by certain Africans, let them be handled by legal processes, said Mutsvangwa.\n\nThe Indigenisation and Economic Empowerment Act reserves sectors such as retail, employment agencies, and advertising for Zimbabwean citizens. The law is aimed at correcting longstanding economic imbalances, however, foreign nationals have increasingly encroached on these sectors.\n\nMutsvangwa said Zimbabweans should not mistreat foreigners, noting that many citizens themselves live abroad.\n\nWe are a mature brown stick country which has got a lot of respect for our African brethren and when they are here we treat them exactly as Zimbabweans. We are not xenophobic like South Africa. When you live in glass house do not throw stones. The third biggest foreign currency earner in this country is the diaspora. They are strangers in other lands, he said.\n\nMutsvangwas remarks also signalled a shift in tone towards Tagwirei, whom he recently supported for co-option into the ZANU PF Central Committee despite having previously criticised him for allegedly buying influence.\n\nIn a pointed remark, Mutsvangwa suggested that Tagwirei should consider enrolling at the partys Herbert Chitepo School of Ideology.\n\nCertain things are only said by the President. They are not said by everybody otherwise everyone who thinks can be a president can be seen giving polices from his platform.\n\nIt may not be too late particularly for people who want to be presidents to go back to Chitepo school of ideology. I have mentioned it before, he said.\n\nTagwirei has been reported to harbour presidential ambitions after President Emmerson Mnangagwas term ends in 2028.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16163123/chris-mutsvangwa.jpg",
            "description": "<p>By Darlington Gatsi ZANU PF spokesperson Christopher Mutsvangwa has rebuked controversial businessman Kudakwashe Tagwirei over his recent remarks calling for foreign nationals to be excluded from investing in certain sectors of the economy, describing the comments as xenophobic. Tagwirei recently told a ZANU PF meeting that foreigners should be removed from sectors such as transport,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/do-not-turn-zimbabwe-into-operation-dudula-mutsvangwa-slams-overzealous-tagwirei-over-anti-foreigner-comments/\">Do not turn Zimbabwe into Operation Dudula – Mutsvangwa slams ‘overzealous’ Tagwirei over anti-foreigner comments</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "21 Nov 2025"
        },
        {
            "title": "‘Historic victory for reproductive justice’ – health group hails High Court ruling recognising mental health in abortion law",
            "url": "https://www.newzimbabwe.com/historic-victory-for-reproductive-justice-health-group-hails-high-court-ruling-recognising-mental-health-in-abortion-law/",
            "content": "By Mary Taruvinga\n\nThe High Court has delivered a landmark ruling declaring parts of Zimbabwes restrictive abortion law unconstitutional, siding with the Community Working Group on Health (CWGH) and Member of Parliament Nyasha Batitsa, who brought the challenge with human-rights lawyer Tendai Biti.\n\nJustice Sylvia Chirawu-Mugomba ruled that the Termination of Pregnancy Act, enacted in 1977, unlawfully excludes mental-health risk as a ground for lawful termination and fails to protect women with mental disabilities from pregnancies resulting from sexual exploitation.\n\nThe statutory omission creates a discriminatory regime, the judge wrote, adding that forcing women to carry pregnancies that cause grave mental-health consequences violates their rights to dignity, equality, humane treatment, bodily autonomy, and health. She stressed that the Constitution recognises health as physical, mental, and psychological well-being.\n\nCourt sides with CWGH and Batitsa\n\nCWGH and Batitsa had challenged section 4(a) and the definition of unlawful intercourse in section 2(1), arguing the law ignored modern constitutional and medical understanding of health and erased the vulnerability of institutionalised mental-health patients who cannot legally consent to sex.\n\nIn their filing, they argued: Section 4(a) unlawfully confines lawful termination to threats to physical health, ignoring that health includes mental and psychological well-being. They also warned that excluding pregnancies arising from sexual exploitation of mental-health patients fails to safeguard the dignity and bodily integrity of a particularly vulnerable group.\n\nJustice Chirawu-Mugomba agreed, finding that the law erased their lack of capacity to consent and, as a consequence, denied them access to lawful termination even in circumstances amounting to abuse.\n\nThe Court declared the offending provisions unconstitutional, but suspended the declaration for 18 months and referred the matter to the Constitutional Court for confirmation.\n\nA shift in Zimbabwes reproductive-rights landscape\n\nThe ruling marks what the Court described as a move away from a narrow, biomedical model of abortion focused only on physical survival, toward a constitutional model grounded in dignity, equality, and holistic health.\n\nThe Courts effects-based analysis, drawing on comparative jurisprudence from South Africa and Canada, recognised mental health as an integral component of the constitutional right to health, and held that statutory frameworks must evolve with contemporary medical understanding.\n\nCWGH welcomes historic victory\n\nThe Community Working Group on Health welcomed the judgment, calling it a breakthrough for women whose suffering has long been invisible under the law.\n\nThis is a historic victory for reproductive justice, CWGH said in response to the ruling. The Court has affirmed that mental-health endangerment must be recognised alongside physical risk, and that women with mental disabilities are entitled to equal protection from sexual exploitation and its consequences.\n\nThe organisation said the decision creates a clear mandate for Parliament, health authorities, and civil society to ensure abortion services are accessible and responsive to the realities of women living with mental disabilities.\n\nNext steps for Parliament\n\nOnce the Constitutional Court confirms the ruling, Parliament will be required to amend the Termination of Pregnancy Act to include mental-health risk as a lawful ground for termination and expand the definition of unlawful intercourse to include sexual exploitation of mental-health patients, conduct already criminalised under the Mental Health Act.\n\nWith the judgment now on record, legal observers say Zimbabwe has taken a decisive step toward modernising reproductive-health law in line with constitutional values and regional obligations under the Maputo Protocol, CEDAW, and the African Charter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/22115253/abortion-law-.jpg",
            "description": "<p>By Mary Taruvinga The High Court has delivered a landmark ruling declaring parts of Zimbabwe’s restrictive abortion law unconstitutional, siding with the Community Working Group on Health (CWGH) and Member of Parliament Nyasha Batitsa, who brought the challenge with human-rights lawyer Tendai Biti. Justice Sylvia Chirawu-Mugomba ruled that the Termination of Pregnancy Act, enacted in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/historic-victory-for-reproductive-justice-health-group-hails-high-court-ruling-recognising-mental-health-in-abortion-law/\">‘Historic victory for reproductive justice’ – health group hails High Court ruling recognising mental health in abortion law</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "21 Nov 2025"
        },
        {
            "title": "Harare records over 500 cases of hand, foot and mouth disease",
            "url": "https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/",
            "content": "By Thandiwe Garusa\n\nTHE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10.\n\nIn a public notice issued Thursday, the local authority said the viral infection has been detected largely in Mabvuku, Mbare, Budiriro and Waterfalls, warning that the disease is highly contagious and spreads through direct contact with blisters or droplets from coughing and sneezing.\n\nSo far 501 cases have been recorded mainly in Mabvuku, Mbare, Budiriro and Waterfalls.\n\nNo deaths have been recorded and those with the symptoms are advised to report to the nearest clinic or hospital, the notice reads.\n\nAlthough HFMD is described as self-limiting, meaning it usually resolves on its own, the City of Harare urged parents and guardians to take symptoms seriously and seek medical assistance.\n\nThe disease is self-limiting and treatment is for symptoms.\n\nThe public is advised to avoid direct contact with those showing symptoms as it is a highly contagious disease, the notice added.\n\nThe city further advised residents to ensure any child showing signs of infection receives immediate medical attention.\n\nWe urge residents to immediately take children with symptoms of the disease to the clinic.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20184945/hand-foot-and-mouth.jpg",
            "description": "<p>By Thandiwe Garusa THE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10. In a public notice issued Thursday, the local authority said the viral infection has been detected largely in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/\">Harare records over 500 cases of hand, foot and mouth disease</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "21 Nov 2025"
        },
        {
            "title": "US wants to join G20 summit, end boycott: South Africa",
            "url": "https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/",
            "content": "AFP\n\nWashington had said it would not take part in the 22-23 November summit because it objected to the priorities for the meeting set by South Africa, which holds the G20s rotating presidency this year.\n\nWe have received notice from the United States, a notice which we are still in discussions with them over, about a change of mind about participating in one shape, form or other in the summit, Ramaphosa told reporters.\n\nThis comes at the late hour before the summit begins. And so therefore, we do need to engage in those types of discussions to see how practical it is and what it finally really means, he said.\n\nAll countries are here, and the United States, the biggest economy in the world, needs to be here, he said.\n\nSo its pleasing to hear that there is a change of approach, and so we are still discussing how that will manifest.\n\nUS President Donald Trump has singled out South Africa for harsh treatment on a number of issues since he returned to the White House in January, notably making debunked claims of white Afrikaners being systematically killed and slaughtered in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20172724/ramaphosa.jpg",
            "description": "<p>AFP The United States has had a “change of mind” about boycotting the G20 summit in Johannesburg this weekend and wanted to take part in some form, South African President Cyril Ramaphosa said Thursday. Washington had said it would not take part in the 22-23 November summit because it objected to the priorities for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/\">US wants to join G20 summit, end boycott: South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "21 Nov 2025"
        },
        {
            "title": "Chevrons beat Sri Lanka to pick first Tri-Series win",
            "url": "https://www.newzimbabwe.com/chevrons-beat-sri-lanka-to-pick-first-tri-series-win/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team delivered a solid performance on Thursday, defeating Sri Lanka by 67 runs in their second Tri-Series match at the Rawalpindi Cricket Stadium.\n\nThe victory marked the Chevrons first win of the tournament, bouncing back strongly after their 5-wicket loss to Pakistan in the opening match on Tuesday.\n\nAfter losing the toss and being sent in to bat, Zimbabwe posted a competitive 162 runs, led by opener Brian Bennett, who top-scored with 49 runs off 42 balls. Captain Sikandar Raza followed closely with an impressive 47 off 32 deliveries.\n\nDefending their total, the Chevrons were disciplined with the ball and sharp in the field, restricting Sri Lanka to 95 runs in their 20 overs.\n\nBrad Evans starred with the ball, taking three wickets, while Richard Ngarava chipped in with two. The rest of the bowling attack each picked up a wicket, contributing to a strong all-round performance.\n\nThe defeat marked a disappointing start for Sri Lanka in their Tri-Nations campaign, while Zimbabwe gained a confidence boost after their earlier loss to hosts Pakistan.\n\nSri Lanka will now take on Pakistan on Saturday to conclude the first-round fixtures, before the Chevrons face Pakistan again on Sunday as round two begins.\n\nThe tri-series serves as preparation for next years T20 World Cup, in which all three nations are set to participate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20175919/chevrons-paki.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team delivered a solid performance on Thursday, defeating Sri Lanka by 67 runs in their second Tri-Series match at the Rawalpindi Cricket Stadium. The victory marked the Chevrons’ first win of the tournament, bouncing back strongly after their 5-wicket loss to Pakistan in the opening match on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-beat-sri-lanka-to-pick-first-tri-series-win/\">Chevrons beat Sri Lanka to pick first Tri-Series win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "21 Nov 2025"
        },
        {
            "title": "Mwazha dies aged 107",
            "url": "https://www.newzimbabwe.com/mwazha-dies-aged-107/",
            "content": "By Staff Reporter\n\nClergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107.\n\nMwazha passed away on Thursday after a long illness.\n\nIn a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader.\n\nGood morning! The African Apostolic Church, VaApostora veAfrica.\n\nI regret to inform you that our Archbishop, Paul Mwazha of Africa, our church leader, has just passed on today, November 20, 2025. He has departed from us, but in spirit we are together with him.\n\nMore information will be released in due course. Any further announcements will be released in due course. Kudzai Jehovah, Kudzai Jehovah, said Mhizha.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20100021/mwazha-.jpg",
            "description": "<p>By Staff Reporter Clergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107. Mwazha passed away on Thursday after a long illness. In a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader. “Good morning! The African Apostolic Church, VaApostora veAfrica. “I regret to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwazha-dies-aged-107/\">Mwazha dies aged 107</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "21 Nov 2025"
        }
    ]
}