{
    "news": [
        {
            "title": "JUST IN: Former CIO boss Isaac Moyo, Ministers Ncube, Sanyatwe delisted from UK sanctions list",
            "url": "https://www.newzimbabwe.com/just-in-former-cio-boss-isaac-moyo-ministers-ncube-sanyatwe-delisted-from-uk-sanctions-list/",
            "content": "By Staff Reporter\n\nTHE United Kingdom (UK) has removed former Central Intelligence Organisation (CIO) boss Isaac Moyo, police Commissioner General Godwin Matanga and former army commander Anselem Sanyatwe from its sanctions list.\n\nMinister of State for Midlands and former Minister of State Security, Owen Ncube and the Zimbabwe Defence Industries (ZDI) have also been removed from the list.\n\nAnnounced in a statement Tuesday, the four top officials and ZDI had been under sanctions for various human rights-related abuses.\n\nMoyo headed the dreaded CIO from 2017 until his exit earlier this year, taking charge of operations that included intimidation, abduction and assault of opposition politicians, human rights activists and journalists.\n\nNcube has been accused of being the godfather of mining gangs in the Midlands. He was fingered as the main man behind violent attacks that claimed the life of an opposition supporter in Kwekwe, in the run-up to the 2018 elections.\n\nThe UK announces the delisting of sanctions against individuals Owen Ncube, Isaac Moyo, Godwin Matanga, Anselem Sanyatwe, and the entity Zimbabwe Defence Industries (ZDI), reads a statement on the UK governments website.\n\nThe revocations follow a similar move from the European Union in February 2025, when they delisted their last remaining entity (ZDI) whilst renewing their existing Zimbabwe sanctions framework.The US also removed a number of designations in March 2024.\n\nZDI was listed by the UK soon after late President Robert Mugabe chucked out the European Union (EU) observer mission ahead of the 2002 elections.\n\nIt stood accused of providing arms used in the abuse of ordinary Zimbabweans.\n\nThe recent round of removals will be taken as a triumph for President Emmerson Mnangagwa, who has been on an overdrive courting the West.\n\nOver recent years, the EU, UK and America have eased restrictions on Zimbabweans and entities that had been fingered in corruption and human rights abuses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/18045457/Owen-Ncube-Minister-of-State-Security.jpg",
            "description": "<p>By Staff Reporter THE United Kingdom (UK) has removed former Central Intelligence Organisation (CIO) boss Isaac Moyo, police Commissioner General Godwin Matanga and former army commander Anselem Sanyatwe from its sanctions list. Minister of State for Midlands and former Minister of State Security, Owen Ncube and the Zimbabwe Defence Industries (ZDI) have also been removed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/just-in-former-cio-boss-isaac-moyo-ministers-ncube-sanyatwe-delisted-from-uk-sanctions-list/\">JUST IN: Former CIO boss Isaac Moyo, Ministers Ncube, Sanyatwe delisted from UK sanctions list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "Internet Speed and Its Role in African eSports",
            "url": "https://www.newzimbabwe.com/internet-speed-and-its-role-in-african-esports/",
            "content": "As African eSports scene is growing fast, competitive gaming is attracting more viewers and more teams. However, to perform at a high level, players need one basic thing: strong and stable internet. Without it, real-time play becomes nearly impossible.\n\nAs eSports spreads across urban centres, better connectivity is helping the industry expand. Companies such ashttps://bizbet.africa/are watching this space closely. Many of them provide live odds and match coverage, relying on smooth streams and real-time updates. Poor speed limits not only gameplay, but also streaming and interaction.\n\nFast, consistent internet means lower lag, better reaction time, and access to online tournaments. It also improves player confidence. When the tech runs smoothly, skill becomes the real focus.\n\nSpeed is critical in eSports. A delay of even 100 milliseconds can change the outcome of a match. Most eSports titles depend on quick reflexes and real-time coordination. This makes internet performance as important as hardware or strategy.\n\nUrban gamers usually enjoy better conditions. Cities are more likely to have fibre lines or 4G/5G coverage. This is why most eSports hubs in Africa are in urban areas. Players gather in cafes or clubs where fast internet is guaranteed.\n\nSome betting-linked platforms also support gameplay tracking. Thehttps://bizbet.africa/mobileintegrates match data and team stats, including live feeds of tournament results. These services benefit when users experience smooth, uninterrupted access.\n\nFor those who follow streams or place live bets, fast internet is essential. They need real-time updates, not delayed scores. This creates a shared need for speed between gamers, platforms, and fans.\n\nWhile urban areas are progressing, gaps remain in rural regions. Limited bandwidth, high data costs, and poor infrastructure slow the growth of competitive gaming. Players may face issues connecting to servers or watching live matches.\n\nEfforts are being made to solve this. Gaming cafes, co-working spaces, and shared hubs offer fast internet in areas where home access is limited. Some developers now build lighter versions of games to suit slower speeds.\n\nIn addition, tech tools that allow low-latency match tracking often support bybizbet bet on sport. These features are built with mobile-first users in mind. This allows even mid-range devices to access real-time data without constant buffering.\n\nThe rise of mobile gaming also plays a role. Many Africans now compete or train on phones. This makes optimisation for mobile important. Fast loading times, reduced lag, and easy login improve the experience.\n\nGood internet access does more than improve play. It shapes the whole eSports economy. From coaching sessions and live commentary to sponsorship and betting markets, everything depends on smooth connectivity.\n\nKey areas affected by internet speed:\n\nIn many cities, local tournaments are beingstreamedfor the first time. This makes internet reliability even more vital. Fans want to follow favourite teams, comment on plays, and share clips. Without good bandwidth, these interactions stop.\n\nPlatforms offering sports odds and digital content rely on this as well. Live bets only work if data updates immediately. This is why strong mobile access supports both gaming and iGaming together.\n\nAfricas eSports future depends on internet growth. Faster networks mean more tournaments, better content, and larger audiences. Providers, platforms, and players all benefit.\n\nAs more users go online, and more titles enter the market, platforms will need to keep up. Investments in local infrastructure, device compatibility, and low-data apps will shape how far the industry can go.\n\nForAfrican gamers, internet speed is not just a technical need. It is part of how they train, compete, and earn. The more reliable the connection, the bigger the arena becomes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27143805/Screenshot-2025-05-27-at-15.37.08.png",
            "description": "<p>As African eSports scene is growing fast, competitive gaming is attracting more viewers and more teams. However, to perform at a high level, players need one basic thing: strong and stable internet. Without it, real-time play becomes nearly impossible. As eSports spreads across urban centres, better connectivity is helping the industry expand. Companies such as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/internet-speed-and-its-role-in-african-esports/\">Internet Speed and Its Role in African eSports</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "Award-winning ‘Tsotsi’ actor Presley Chweneyagae has died at 40",
            "url": "https://www.newzimbabwe.com/award-winning-tsotsi-actor-presley-chweneyagae-has-died-at-40/",
            "content": "IOL\n\nSouth Africans are reeling from the news of Presley Chweneyagaes passing.\n\nHis death was confirmed by Nina Morris Lee, CEO of talent company Moonyeenn Lee & Associates.\n\nIt is with profound sadness that we confirm the untimely passing of one of South Africas most gifted and beloved actors, Presley Chweneyagae, the statement read.\n\nHe was a gifted writer and director, co-authoring the internationally acclaimed stage play Relativity  His passion for empowering the next generation of artists will remain an integral part of his legacy  Details regarding memorial services will be shared in due course.\n\nRenowned for his unforgettable performances in South African cinema, Chweneyagae was best known for his role in the critically acclaimed film Tsotsi, which won the Oscar for Best Foreign Language Film in 2006, as well as in Mandela: Long Walk to Freedom.\n\nHailing from Soweto, the 40-year-old captivated audiences with his talent, resilience and charisma. His recent role as Thuso Cobra Mokoena in Cobrizi, a spin-off from the award-winning series The River, showcased his incredible range as an actor.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27113029/presley-chweneyagae.webp",
            "description": "<p>IOL South Africans are reeling from the news of Presley Chweneyagae’s passing. His death was confirmed by Nina Morris Lee, CEO of talent company Moonyeenn Lee & Associates. “It is with profound sadness that we confirm the untimely passing of one of South Africa’s most gifted and beloved actors, Presley Chweneyagae,” the statement read. “He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/award-winning-tsotsi-actor-presley-chweneyagae-has-died-at-40/\">Award-winning ‘Tsotsi’ actor Presley Chweneyagae has died at 40</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "Chipezeze, Kadewere back in Warriors fold as Nees announces June friendlies squad",
            "url": "https://www.newzimbabwe.com/chipezeze-kadewere-back-in-warriors-fold-as-nees-announces-june-friendlies-squad/",
            "content": "By Sport Reporter\n\nMagesi FC goalkeeper Elvis Chipezeze has bounced back into the Warriors fold after recieving a call from coach Michael Nees ahead of two international friendlies against Burkina Faso and Niger.\n\nThe two friendlies will be played in Morroco on the 6th and 10th of June, respectively.\n\nChipezezes call-up follows a successful season with South African Betway Premiership side Magesi FC, where he is the captain.\n\nThe last time Chipezeze featured for the Warriors was during the 2021 AFCON finals in Cameroon.\n\nWashington is number 1 goalkeeper, I dont mind his age but Elvis had a successful season and we have to also consider him and give him a chance.\n\nWe will see how it works, I also have to give him a chance and see what he can give, said Nees.\n\nFrench League 1 based striker Tinotenda Kadewere has also been called up, marking his return to the Warriors.\n\nKadewere missed the greater part of the AFCON Qualifiers campaign last year and World Cup Qualifiers games earlier this year due to injuries.\n\nZimbabwe has also been boosted with the return of Belgian based forward Bill Antonio, who has also earned his first international call up under Nees.\n\nThe 22-year-old scored his second goal of the season over the weekend since marking his return from a ten months injury lay off.\n\nWarriors captain Marvelous Nakamba will not be available for the upcoming friendlies due to an injury , while veteran forward Knowledge Musona has been rested out in a mutual agreement with the coach.\n\nJune Friendlies Squad vs Burkina Faso and Niger\n\nGoalkeepers\n\nWashington Arubi (Marumo Gallants), Elvis Chipezese (Magesi), Marley Tavaziva (Brentford)\n\nDefenders\n\nTeenage Hadebe (Cincinnati), Gerald Takwara (Al Minaa SC), Munashe Garananga (FC\n\nCopenhagen), Isheanesu Mauchi (Simba Bhora), Peter Muduhwa (Scottland), Godknows\n\nMurwira (Scottland), Emmanuel Jalai (Dynamos)\n\nMidfielders\n\nMthokozisi Msebe (Scottland), Khama Billiat (Scottland), Richard Hachiro (Ngezi Platinum).\n\nJonah Fabisch (FC Aue), Donald Mudadi (Simba Bhora), Sean Fusire (Sheffield Wednesday).\n\nDaniel Msendami (Marumo Gallants), Bill Antonio (K.V. Mechelen)\n\nForwards\n\nPrince Dube (Young Africans), Tawanda Maswanhise (Motherwell), Walter Musona (Scottland).\n\nTawanda Macheke (TelOne FC), Tino Kadewere (Nantes)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14051412/Elvis-Chipezeze.jpg",
            "description": "<p>By Sport Reporter Magesi FC goalkeeper Elvis Chipezeze has bounced back into the Warriors fold after recieving a call from coach Michael Nees ahead of two international friendlies against Burkina Faso and Niger. The two friendlies will be played in Morroco on the 6th and 10th of June, respectively. Chipezeze’s call-up follows a successful season</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chipezeze-kadewere-back-in-warriors-fold-as-nees-announces-june-friendlies-squad/\">Chipezeze, Kadewere back in Warriors fold as Nees announces June friendlies squad</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "MP partners Australian Embassy to build multi-purpose sports facility",
            "url": "https://www.newzimbabwe.com/mp-partners-australian-embassy-to-build-multi-purpose-sports-facility/",
            "content": "By Thandiwe Garusa\n\nBUDIRIRO South Member of Parliament Darlington Chigumbu has partnered with the Australian Embassy to develop a multi-purpose sports facility aimed at curbing drug abuse and unlocking the potential of local youth talent.\n\nSpeaking at the groundbreaking ceremony in Harare, Budiriro, Monday, Chigumbu said this initiative will provide opportunities for local young people and steer them away from drug and substance abuse.\n\nWe want to build a multi-purpose world-class sporting facility which will cater for many sporting disciplines.\n\nWe are doing this because we have seen many youths who are engaging in drug and substance abuse.\n\nWe have also seen that we have a lot of talent which is dying simply because we do not have facilities to expose that talent to opportunities. So we want to do this for our young people who stay in this community, Chigumbu said.\n\nThe legislator said part of the money for the project will come from the Australian citizens, Zimbabweans in Australia, as the Constituency Development Fund is not enough.\n\nDeputy Head of Mission for the Australian Embassy in Zimbabwe, Isaac Matia, who also attended the ceremony, assured support to the people of Budiriro.\n\nAustralia believes inclusive sport has the power to connect the people of Australia and Zimbabwe which can foster cooperation and understanding which makes anything possible.\n\nThe Australian and Zimbabwean governments both agree that this is an asset we must leverage in the bilateral relationships.\n\nWe are here to support you and your community, he said.\n\nHarare Mayor Jacob Mafume warned against illegal occupation of public facilities, stating that any structures built on land designated for sports facilities will be demolished.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27050946/1000590484-scaled.jpg",
            "description": "<p>By Thandiwe Garusa BUDIRIRO South Member of Parliament Darlington Chigumbu has partnered with the Australian Embassy to develop a multi-purpose sports facility aimed at curbing drug abuse and unlocking the potential of local youth talent. Speaking at the groundbreaking ceremony in Harare, Budiriro, Monday, Chigumbu said this initiative will provide opportunities for local young people</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mp-partners-australian-embassy-to-build-multi-purpose-sports-facility/\">MP partners Australian Embassy to build multi-purpose sports facility </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "Public Accounts Committee “satisfied” with Treasury’s report on issues flagged by Auditor General",
            "url": "https://www.newzimbabwe.com/public-accounts-committee-satisfied-with-treasurys-report-on-issues-flagged-by-auditor-general/",
            "content": "By Anna Chibamu\n\nFINANCE Permanent Secretary George Guvamatanga finally appeared before the Public Accounts Committee last Friday and presented a report on the issues raised by the Auditor Generals report, which the legislators said they were satisfied with.\n\nPart of the findings of the AG report were that there had been a gross mishandling of public funds amounting to US$400 million by the Finance Ministry which was also bypassing ministries and agencies and making payments directly to suppliers,failure by private companies to supply vehiclesand Treasury minutes not being submitted to the committee.\n\nGuvamatanga who had been a no-show on several occasions had requestedthe Committee to give him more time to gather evidence.\n\nAccording to the PAC chairperson, Charlton Hwende, Guvamatangas oral evidence regarding the raised concerns fully satisfied the Committee members during the inquiry.\n\nWe just finished an inquiry with the Finance ministry led by the permanent secretary.\n\nWe received a report on those issues and I think the committee was satisfied that the appropriate response has been given, said Hwende.\n\nHe highlighted: We discussed the burning issue of suppliers that are getting government money and disappearing without supplying goods.\n\nThe secretary has committed that hes going to give us a whole list of every supplier that has received money from the government and has failed to supply, because thats criminal in our view.\n\nWe want to bring them we want to call every supplier to come here because most of them have realized that they receive government money and immediately use it where they receive it in zig, if the ministers follow up they start claiming that the money is lost value they can find us dollars but its a criminal enterprise.\n\nOf the direct payments made to TAPO Commercial Private Limited by the treasury, Guvamatanga explained:\n\nFinance Ministry went into an agreement on December 16, 2022, with TAPO Commercial Private Limited, for the command to supply serving Toyota Hi-Lax GT6 2.8-litre double-cab motor vehicles.\n\nThe ministry paid the US$25,866 to the contractor on December 30, 2022. Since 2021 to date, only four of the seven vehicles have been delivered, leaving three outstanding, Guvamatanga said.\n\nHe told PAC the company had made an undertaking to deliver the outstanding vehicles by the 2nd of July 2025.\n\nThe ministry has also returned to pass a request for the outcome of the debatement hearing to enable the initiation of federal protection against the supplier if they fail to deliver in July.\n\nAlso, the ministry has ensured that no prepayments are made to suppliers of vehicles before delivery.\n\nPayments are only made for vehicles that are already delivered.\n\nIn the event that the supplier is set to receive an advance payment, the ministry will ensure that a bank guarantee equivalent to the requested payment value is provided by a registered commercial bank, said the Finance secretary.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Anna Chibamu FINANCE Permanent Secretary George Guvamatanga finally appeared before the Public Accounts Committee last Friday and presented a report on the issues raised by the Auditor General’s report, which the legislators said they were satisfied with. Part of the findings of the AG report were that there had been a gross mishandling of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/public-accounts-committee-satisfied-with-treasurys-report-on-issues-flagged-by-auditor-general/\">Public Accounts Committee “satisfied” with Treasury’s report on issues flagged by Auditor General</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "DStv cuts ties with MacG’s Podcast and Chill",
            "url": "https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/",
            "content": "The Citizen\n\nFollowing a controversial statement about one of South Africas loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform.\n\nMacG has been in the hot seat after making a comment about media personality Minnie Dlaminis private part in one of the episodes. However, Dstv did not air the episode in question; it was only aired on the Podcast and Chill channel on YouTube.\n\nDstvs digital distribution partner, Leading Edge Growth, confirmed toTimeslivethat Dstv has removed the popular podcast.\n\nLeading Edge Growth CEO Lufuno Maliavusa gave the confirmation that the show has been pulled.\n\nCiting To keep our content slate dynamic and engaging, we will continue to make adjustments to our roster. Notably, season one ofPodcast and Chilland season one ofAwkward Datesare nearing their final episodes in the coming weeks, making way for fresh and exciting content to take their place in these time slots.\n\nThis follows after MultiChoice refused to confirm the news of the shows cancellation. The Group only said it licensed a slate of podcasts from Leading Edge Growth, which was responsible for curating the podcast slate, taking into account audience dynamics and content demand.\n\nHowever, MacG is reportedlyunmoved by the news, as he is pursuing other endeavours.\n\nThe episode that spoke about Dlaminireceived attention from the Deputy Ministerof Women, Youth and Persons with Disabilities, Mmapaseka Steve Letsike.\n\nShe said MacGs comments were nauseating in their vulgarity and must be regarded as an unconstitutional violation of Dlaminis rights to freedom and security of the person, equality, and human dignity as enshrined in the Constitution of the Republic of South Africa.\n\nLetsike wanted MacG to be referred to the Parliaments Portfolio Committee, however,this was declined.\n\nI think the majority of members are not in favour of us proceeding as the honorable minister, deputy minister had requested us to do, the committees chairperson Liezl van der Merwe said.\n\nShe pointed out that Dlamini had not approached Parliament nor laid a criminal case.\n\nI think all of you have touched on this point that if we do decide it is our mandate to proceed with hearing one case of cyber-bullying, it would mean that this portfolio committee would have to extend that to every other person because they cannot be selective in choosing one case.\n\nMacG has since apologisedin one his episodes, saying he never intended to offend anyone.\n\nI want to apologise, first and foremost, to all the female chillers, and women in general in SA, I might have offended with that comment. That was not the intention. We never say things to offend people, he said.\n\nI want to extend an invite to Minnie Dlamini to the show. You are more than welcome to come.\n\nThis thing started on the podcastlets end it on the podcast. She said some things, I said some things. Lets squash it once and for all.\n\nDlamini saidshe was hurt and shocked by the commentsmade about her body and personal life on the podcast.\n\nOver the past few weeks, I have watched in disbelief and deep pain as my name, body, and dignity were dragged through the mud of public discourse, she said.\n\nShe described the remarks made by MacG as vile, humiliating, and inexcusable.\n\nDlamini said she is taking legal action to stand up for herself and the dignity of women.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27042300/MacG.jpg",
            "description": "<p>The Citizen Following a controversial statement about one of South Africa’s loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform. MacG has been in the hot seat after making a comment about media personality Minnie Dlamini’s private part in one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/\">DStv cuts ties with MacG’s Podcast and Chill</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "Unifreight bemoans Zimbabwe’s high operating costs",
            "url": "https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/",
            "content": "By Alois Vinga\n\nLISTED transport and logistics concern, Unifreight Africa Limited says the countrys tough economy added to high licensing fees is making operations very tough.\n\nIndustry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy are clogged with very costly, repetitive licensing fees, choking the ease of doing business.\n\nEchoing similar sentiments recently, Unifreights CEO, Richard Clarke, bemoaned the exorbitant licensing fees affecting transport sector players in the country.\n\nIn the transport sector specifically, operating costs in Zimbabwe are significantly higher than in neighbouring countries, which continues to squeeze margins. For example, fuel in Zimbabwe remains the most expensive in the region at around US$1,58 per litre, compared to about US$1,01 in Zambia. Vehicle registration and licensing fees are also exorbitantly high at roughly US$1,560 locally versus just US$132 in Zambia, he said.\n\nAdditionally, he said, diesel imports carry heavy duties (approx. USD 0.55 per litre)withexporters being forced to surrender 25% of foreign earnings for conversion into local currency (ZWG), which cannot be freely converted back to US$ at market rates.\n\nClarke said the combination of these challenges, added to currency volatility, liquidity constraints, inflationary pressures and a shortage of long-term financing in the local market, led many businesses to tighten their belts, creating a knock-on effect across supply chains.\n\nThe company said compounding cost pressures is the ongoing liquidity crunch in the banking sector prompting many financial institutions to pull back on lending, forcing companies, including Unifreight and our customers, to rely on shorter-term and more expensive financing.\n\nThese factors make operating a cross-border fleet out of Zimbabwe less attractive and more costly than regional competitors, Clarke said.\n\nMeanwhile, during the period, Unifreight Africa Limited delivered a strong start to 2025, with significant revenue growth in Q1.\n\nTotal revenues for the quarter surged by over 30% compared to the same period last year, reflecting robust demand and the success of recent strategic initiatives. Annual turnover rose from US$20.4 million in 2023 to US$24 million in 2024, and is forecast to reach US$32 million in 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03015012/Unifreight-Africa-which-operates-well-known-logistics-brands-including-Swift-Skynet-and-Bulwark-has-not-been-immune-to-these-challenges-Picture-Supplied.webp",
            "description": "<p>By Alois Vinga LISTED transport and logistics concern, Unifreight Africa Limited says the country’s tough economy added to high licensing fees is making operations very tough. Industry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/\">Unifreight bemoans Zimbabwe’s high operating costs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        },
        {
            "title": "Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/",
            "content": "IOL\n\nThe Polokwane Magistrates Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.\n\nLast week, Mashaba said Moyo was arrested during a joint operation comprising the SAPS anti-smuggling task team, Tshimollo Security and Investigation, Reflex Anti-hijacking Security, and Tracker SA.\n\nTheToyota RAV4was intercepted at approximately 8 pm (on Wednesday) near Shell Ultra City in Polokwane on the N1 highway, said Mashaba.\n\nZimbabwean man, Mhlalisi Moyo, was remanded in custody by the Polokwane Magistrates Court after he was arrested for possession of suspected stolen motor vehicle, a Toyota RAV4. Image: SAPS\n\nThe sport utility vehicle was reported stolen in Brooklyn, Tshwane.\n\nThe 43-year-old foreign national male was arrested at the scene, said Mashaba.\n\nOn Friday,IOL reported that the Mokopane Magistrates Court remanded 34-year-old Lucky Msizi Tshabanguin custody after he was arrested in Limpopo, while driving a stolen vehicle towards Zimbabwe.\n\nAt the time, Mashaba said the case against Tshabangu was postponed to Monday, enabling him to get legal representation.\n\nTshabangu is facing charges of possession of a suspected stolen motor vehicle, as well as reckless and negligent driving after he allegedly tried to flee from police.\n\nThe 34-year-old South African national was arrested at Mokopane last week, and police believe he was travelling to Zimbabwe with the stolen vehicle.\n\nLucky Msizi Tshabangu, 34, was remanded in custody after he was arrested in Limpopo, while allegedly driving a stolen Toyota Corolla Cross vehicle towards Zimbabwe. Image: SAPS\n\nIn an intelligence-driven operation, police officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101, which was en route to the Beitbridge port of entry, said Mashaba.\n\nInvestigations revealed that this vehicle had been reported stolen from the Wierdabrug policing area in Tshwane on Friday (16 May 2025).\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has praised the vigilance of all law enforcement units involved.\n\nThe recovery of these twelve vehicles represents a significant blow to this criminal networks. Our officers and their partners continue to work tirelessly to dismantle these syndicates that threaten our communities and economy, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27035716/Screenshot-2025-05-27-at-04.55.57.png",
            "description": "<p>IOL The Polokwane Magistrate’s Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/\">Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "27 May 2025"
        }
    ]
}