{
    "news": [
        {
            "title": "Parliament concerned by government’s snub of Mzilikazi Day",
            "url": "https://www.newzimbabwe.com/parliament-concerned-by-governments-snub-of-mzilikazi-day/",
            "content": "By Darlington Gatsi\n\nPARLIAMENT has raised concerns over the governments continued non-recognition of the annual Mzilikazi Day.\n\nMzilikazi Day is celebrated in honour of the founding father of the Ndebele Kingdom, Mzilikazi ka Matshobane, who died on 9 September 1868.\n\nOn Saturday, thousands thronged Mhlahlandlela to honour the legacy of Mzilikazi, which began in 1823 when he broke ranks from Shaka Zulu to forge the Ndebele Kingdom.\n\nConspicuous by their absence were government officials, including the Minister of Home Affairs and Cultural Heritage, Kazembe Kazembe.\n\nInterestingly, President Mnangagwa sent a representative to a cultural event in Eswatini, turning a blind eye to Mzilikazi Day.\n\nOpposition legislator Daniel Molokela said the governments snubbing of the day, which carries great historical significance, is concerning.\n\nDespite the fact that the event was a big success, one of the big concerns was that relevant Government departments were visible in their absence. Ministry of Tourism and Hospitality Industry, Ministry of Local Government and Public Works were nowhere to be seen, same as the Ministry of Home Affairs and Cultural Heritage. We want to encourage the Government of Zimbabwe to support such traditional and cultural heritage events, said Molokela.\n\nThe Government is at odds with the Ndebele King, Bulelani Khumalo, a descendant of Mzilikazi, refusing to recognise his kingship.\n\nMolokela further said Mzilikazi Day should be honoured and celebrated by the country.\n\nThe event attracted participants from all over Zimbabwe and some from the diaspora, especially from South Africa. Thousands of people from different generations, elders, youths, children, women, men, rural people and urban people attended the event from different cultures and languages.\n\nZimbabwe prides itself in cultural heritage, it prides itself in national identity and also decolonisation in terms of identity. An event like the one which we held on Saturday is something that as Zimbabweans, we must celebrate and encourage all districts, provinces, cultures and all languages in Zimbabwe to organise such kind of events so that as a nation, we can also be recognised that we have gone beyond the colonial system, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10191306/molokela-mzilikazi-day.jpeg",
            "description": "<p>By Darlington Gatsi PARLIAMENT has raised concerns over the government’s continued non-recognition of the annual Mzilikazi Day. Mzilikazi Day is celebrated in honour of the founding father of the Ndebele Kingdom, Mzilikazi ka Matshobane, who died on 9 September 1868. On Saturday, thousands thronged Mhlahlandlela to honour the legacy of Mzilikazi, which began in 1823</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-concerned-by-governments-snub-of-mzilikazi-day/\">Parliament concerned by government’s snub of Mzilikazi Day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "11 Sep 2025"
        },
        {
            "title": "Zimbabwean activist Nyokayemabhunu fears SA is colluding with Zanu-PF to send him back home",
            "url": "https://www.newzimbabwe.com/zimbabwean-activist-nyokayemabhunu-fears-sa-is-colluding-with-zanu-pf-to-send-him-back-home/",
            "content": "ByPeter Fabricius,Daily Maverick\n\nSince his arrest on 13 April, Wellington Masiwa has been in prison for illegally entering South Africa and for alleged fraud in Zimbabwe.\n\nZimbabwean opposition activists believe the South African authorities are colluding with Zimbabwes ruling Zanu-PF party to extradite a vocal critic of the Zimbabwean government from South Africa to Zimbabwe.\n\nWellington Masiwa, aka Comrade Nyokayemabhunu, has been detained in the Johannesburg Correctional Centre since he was arrested on 13 April for illegally entering South Africa and for alleged fraud in Zimbabwe.\n\nBefore that, he was held and assaulted by unknown men in an unknown place, according to his legal representatives.\n\nWhen he appeared in the Randburg Magistrates Court on 30 April on an illegal immigration charge, his lawyers were surprised when an Interpol representative showed up and laid new charges against him based on an extradition request from the Zimbabwean government.\n\nWhen the representative appeared in court at a later hearing in July, the crowd of opposition Zimbabwean citizens supporting Masiwa grew angry, suspecting new charges were being brought against him.\n\nSouth Africas justice minister, Mmamoloko Kubayi, is expected to rule this week on whether Masiwa is extraditable.\n\nThe extradition notice from Zimbabwes deputy prosecutor-general, Nelson Mutsonziwa, certified that Zimbabwe wanted him returned to serve an 18-month sentence for defrauding a fellow Zimbabwean, Prince Kutivo, of $3,660 in a fraudulent property deal in Harare.\n\nThis request is not being pursued for political reasons or any ulterior purpose, Mutsonziwa insisted.\n\nHowever, there are many anomalies in the case which cast doubt on Mutsonziwas assurances. For instance, another alleged fraud case against Masiwa has arisen. Masiwa says that he was arrested through a trap set by Zimbabwes notorious Central Intelligence Organisation and sprung by a fellow Zimbabwean activist, Honest Sibanda.\n\nThis appears to be another name for Honest Shumba, who has formally charged Masiwa with cheating him of some R24,000, which he paid Masiwa in Harare in July 2024 for a couch which Masiwa never delivered.\n\nMasiwa flatly denies the deal and says he was in South Africa when the transaction allegedly occurred.\n\nMasiwas attorney, Yugeshnee Govender, told Daily Maverick the prosecution had been unable to produce bank statements to prove Shumba paid this money into Masiwas bank account. The Zimbabwean government has not mentioned the Shumba case in its request for extradition.\n\nMasiwa, his lawyers and his opposition comrades believe the Shumba incident was invented to strengthen Zimbabwes case for his extradition. They believe the real reason the Zimbabwe government wants him home is that he has been a strident critic of President Emmerson Mnangagwa, and particularly of his political manoeuvring to try to secure a third term when his second  and constitutionally, final  term expires in 2028.\n\nUntil shortly before his arrest, Masiwa was posting calls on X and other social media, calling on Zimbabweans to join a national shutdown on 31 March to protest at Mnangagwas suspected plans to bypass or amend the Constitution so as to remain in power.\n\nIn an affidavit before the Randburg Magistrates Court seeking bail  which has so far been denied  Masiwa said that before his arrest he had had a WhatsApp channel called Nyokayemabhunu News.\n\nIt had been an important instrument in protest news in Zimbabwe. Masiwa said he was opposed to the campaign for the extension of Mnangagwas presidential term, which had come to be known as 2030 by Zanu-PF.\n\nThe extension is not in terms of the Zimbabwean Constitution, he said, insisting he had only advocated for peaceful means to stop the illegal subversion of the Zimbabwean Constitution by the ruling party in Zimbabwe, Zanu-PF. It is for this reason that I have been declared an enemy of the state by the Zimbabwean government and Zanu-PF.\n\nZanu-PF has called several press conferences to celebrate my arrest in South Africa and have indicated that they would want to charge me with terrorism for illegally attempting to remove a constitutionally elected government  which carries the death penalty.\n\nThe Progressive Zimbabwean Foundation, which says it represents numerous progressive forces and pressure groups, issued a statement in August expressing concern that Zimbabwes request for the extradition of Masiwa was political rather than legal.\n\nThe circumstances surrounding Cde Nyokayemabhunus arrest and detention raise serious concerns about the separation of politics from the justice system, particularly in a foreign nation like South Africa, said the foundations General Sithole.\n\nHe added that remarks by Zanu-PFs secretary for information and publicity, Chris Mutsvangwa, further reinforces the notion that this is a political matter.\n\nDuring a press conference at Zanu-PF headquarters in Harare on 8 May, Mutsvangwa said Zanu-PF was very happy that South Africa had taken steps to show that it was not prepared to tolerate Zanu-PFs critics using South Africa as a platform for their criticism.\n\nMentioning Nyokayemabhunu by name, he said, Some people have got the mistaken idea that you can go and be hosted in South Africa and start shouting bad things about Zimbabwe and talking subversion.\n\nThey have got a new comeuppance by South African laws. They are being told: Not here. We are a sister republic to Zimbabwe. We fought with Zanu-PF. We know each other. This is not your home.\n\nMutsvangwa said he hoped the legal action that South Africa was taking against Masiwa is a signal to others who are spewing hatred and vituperation  about Zanu-PF and our leader that South Africa cant tolerate. It cant be a home for vitriol against Zimbabwe.\n\nHowever, South African Police Service Captain Willem van der Heever testified, in a court affidavit responding to Masiwa, that the conviction in Zimbabwe has nothing to do with the political climate in Zimbabwe.\n\nVan der Heever said he was Interpols investigating officer in this matter, stationed at the Interpol extradition desk in Pretoria and that he had received Zimbabwes request for extradition through Interpol and had obtained a warrant for Masiwas arrest from the Kempton Park Magistrates Court on the basis of it on 29 April.\n\nVan der Heever cited deputy prosecutor-general Mutsonziwas certificate stating that Zimbabwe was only seeking Masiwas extradition to serve an 18-month sentence in the 2016 case for fraud against Kutivo.\n\nYet in his affidavit Van der Heever also cited Honest Shumbas alleged couch fraud complaint.\n\nGovender told Daily Maverick that Masiwa and his legal team were waiting for Justice Minister Kubayi to decide whether Masiwas case was extraditable. Govender said she believed the amount of the alleged fraud involved in this case was not great enough to warrant extradition.\n\nGovender said Kubayis ruling on this might be announced when Masiwa appeared in court again on 10 September. Masiwa said he fled Zimbabwe in 2017, fearing for his safety after being beaten by government agents after Mnangagwa ousted President Robert Mugabe in a coup.\n\nMasiwa now lives in Gqeberha with his wife and is a granite cutter. He has applied for political asylum in South Africa, but his court cases have interrupted his application.DM\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Peter Fabricius, Daily Maverick Since his arrest on 13 April, Wellington Masiwa has been in prison for illegally entering South Africa and for alleged fraud in Zimbabwe. Zimbabwean opposition activists believe the South African authorities are colluding with Zimbabwe’s ruling Zanu-PF party to extradite a vocal critic of the Zimbabwean government from South Africa to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-activist-nyokayemabhunu-fears-sa-is-colluding-with-zanu-pf-to-send-him-back-home/\">Zimbabwean activist Nyokayemabhunu fears SA is colluding with Zanu-PF to send him back home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "11 Sep 2025"
        },
        {
            "title": "Inside Zimbabwe’s gold mines where men risk being buried alive for a few dollars",
            "url": "https://www.newzimbabwe.com/inside-zimbabwes-gold-mines-where-men-risk-being-buried-alive-for-a-few-dollars/",
            "content": "Metro UKs foreign correspondent Gergana Krasteva reports from Zimbabwe\n\nBeads of sweat drip down Gilbert Nuovus forehead as the memories of working inone of Zimbabwes gold minesrush back in.\n\nOver a year ago, the dad-of-two deserted his job after a colleague was killed when the walls of the pit caved in, burying him alive.\n\nA friend of mine died on the spot. I was afraid for my life, so I went back home, he tellsMetro.\n\nThe road into Matabeleland North, 150 miles from the city of Bulawayo, is uneven and thick with dust, but I am assured that it will eventually lead to a gold mine.\n\nIt is one of the many precious materials for which the land here has been exploited since before British colonial rule, with the first extractions made as early as the 14th century.\n\nAs our SUV crawls forward, a line of workers stretches along the footpath  boys barely into their teens and weathered men three times their age.\n\nMost are wearing the same faded blue overalls, and chipped shovels slung over their shoulders  a sign theyworkin one of the legal mines.\n\nMatabeleland North sits on some of the richest deposits of gold in Africa, and so is plagued with artisanal pits, which are not officially registered with thegovernment, making them illegal.\n\nYet, tens of thousands of men and women are forced into the trade due to unemployment, making up the majority of the mining workforce.\n\nGordon Sibanda used to be one of them.\n\nMetrospeaks with him at the Libeni PrimarySchool, where he volunteers as a chef to somehow contribute to the local community while searching for work.\n\nSitting on a wooden log and smoothing his cooking apron, he admits that poverty is what drove him to mining in 2001, when he was 39.\n\nHe says: A friend introduced me to the trade. Many of my friends are still in the pits to this day.\n\nMining is strenuous labor. You can spend months searching for a mineral you cannot see and do not know if it is actually in the earth.\n\nAnd when luck would fall on our side, you may get something.\n\nIn Zimbabwes mines, death never seems far.\n\nSo when I ask Gordon if any of his colleagues were injured or killed in the pits, he replies, almost nonchalantly, as he takes off his woolen beanie: Ah yes. Three have been killed when the mines collapsed.\n\nDisintegrated shafts, explosions, flooding  each shift carries the chance that a worker will not return home.\n\nAs many as 237 people died in incidents in 2023, making it one of the very worst years in the countrys mining history.\n\nAnd up until May this year, 59 fatal incidents were reported  most in illegal mines, like the one that Gordon worked in.\n\nTo fully comprehend the vast scale of illegal mining,Metrosits down with Pumulu Masu, government school inspector, who says that most people in Matabeleland North dig without a permit, which means the state does not profit from it.\n\nMostly, people in the area mine illegally, she explains. Lets say there is an agricultural field. Instead of a farm, they will turn it into a mine.\n\nEven in their personal properties  behind their homes  people start to dig.\n\nWe can always tell by the maps of soil. If people suspect there is gold, they will always dig no matter what the land is.\n\nWhile Gordon worked in an illegal pit, Gilbert has experience in a registered mine.\n\nTheir only piece of advice  what they want everyone to know  is do not do it, do not work in a mine, pointing to how deadly the trade is.\n\nGilbert says: The pit is not that strong as miners often dig tunnels [without much planning], making the walls weak.\n\nWe are not given helmets or boots to protect us. It is difficult to survive.\n\nThe work is just too much. In mines, there are no set working hours.You work and you stop when it is time to eat, then you go back to work. It is continuous, we do not stop.\n\nIn Zimbabwe, mining runs through generations like a vein of gold itself. It is often seen as a rite of passage for children as young as nine, and at the same time a lifeline for families in the depths of poverty.\n\nThough the pay is still meagre. All the money Gordon earned was spent on food for his large family, all 13 of them.\n\nAt the time, he was the sole breadwinner for his wife, three sons and three daughters, his own parents and siblings.\n\nHand to mouth, nothing else [is left], he adds, gesturing at his grandson, a four-year-old boy playing with his friends a few metres away.\n\nYet, despite facing unemployment, Gordon has not given mining another thought because of the precarious conditions.\n\nLike him, Gilbert also did not live a life of luxury  but he was under no such illusions when he picked up a shovel.\n\nAfter three months of digging, he was paid around $20, and only after gold was actually discovered. Miners divvy up half the proceeds, while the rest goes straight to the owners pocket.\n\nThere are other dangers too.\n\nThe industry has long been linked to human rights abuses, environmental violations and labour exploitation, particularly in lithium mines operated byChina, despite denials by Zimbabwes government. About 70% of all lithium is processed there.\n\nRobert Mugabes successor, president Emmerson Mnangagwa, of ZANU-PF, has so far supported the takeovers, arguing they will bring economic growth.\n\nPerhaps this has materialised in the capital, Harare; yet, on the ground, in Matabeleland North, the mines have brought little benefits  if any  to the local community.\n\nMetrogained access to Turk, one of the oldest gold mines in Zimbabwe, located in the Bubbi District.\n\nArmed security usually guard gold mines, but today luck has fallen on our side  at least for a few minutes.\n\nPiles of reddish earth and stones mount inside the compound. A dragline excavator in the distance seems to have dosed off, but only momentarily.\n\nThe mine itself gapes before us, an abyss carved so deep and wide that, when peering over the edge, the bottom is not visible.\n\nAcross the road from the pit, a supermarket and two bars stand shoulder to shoulder, their doors flung wide open. A few men have gathered around a plastic table, kicking dust with their feet as they chat.\n\nThis is the heart of what is accepted as the traditional mining community in Zimbabwe.\n\nThere are no clinics or schools, or in fact any other reliable infrastructure apart from the mine.\n\nBars are always the first to spring up whenever gold is unearthed, offering miners a place to unwind and spend their hard-earned cash in.\n\nAs I come to learn, this has also led to alcohol abuse among workers who use drinking as a coping mechanism.\n\nA source, who wished to remain anonymous, tellsMetro: You cannot put a figure on how many people have died because of it. Some have been found dead on pavements.\n\nWorkers deaths are often blamed on the rise in popularity of an illicit brew called krango, which can cause severe organ damage, and is associated with soaring rates of binge drinking.\n\nMy source explains that it is mostly made from ethanol concentrate diluted with large amounts of water, adding: Krango is what it is all about in rural areas. It is packed in bottles of 250ml.\n\nSanctions on Zimbabwe were first introduced in the early 2000s, mainly by the UK, the EU, and the US, amid allegations of human rights abuses, electoral fraud, and Robert Mugabes land reform programme.\n\nThese measures are not broad trade embargoes. They focus on asset freezes and travel bans on senior government officials linked to the state.\n\nThe US also brought out the Zimbabwe Democracy and Economic Recovery Act (ZDERA) in 2001, which restricted its access to international financial institutions.\n\nWhile the sanctions target political elites, the Zimbabwean government argues they have deterred foreign investment and limited lines of credit  so much so that the now vice president Constantino Chiwenga said the country had lost more than $150 billion.\n\nSome are even packed by legitimate companies. It is sold for just $0.50, and the strength is usually around 40% strength.\n\nDespite the reported issues plaguing Zimbabwes mines, the government is hellbent on expanding the industry  the faster, the better.\n\nFor a nation that fought so hard to rid itself from colonial rule, it now relies on investors from China, South Africa, Australia, Canada and the UK, and it is eager to attract more.\n\nThe sector as a whole accounts for more than 60% of export revenues and 13% of gross domestic product (GDP), according to national statistics from 2023.\n\nTo increase those numbers, the Zimbabwean government introduced the Vision 2030 plan to become an upper-middle-income economy by the end of the decade.\n\nSupposedly, one of the key objectives is to grow the mining sector to have a revenue of $12 billion per year.\n\nIt makes money, that is for sure, though not for the small miner like Gordon or Gilbert.\n\nThey are currently unemployed and living with the memories of the hell inside the mines.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10182619/gordon-sibanda.webp",
            "description": "<p>Metro UK’s foreign correspondent Gergana Krasteva reports from Zimbabwe Beads of sweat drip down Gilbert Nuovu’s forehead as the memories of working in one of Zimbabwe’s gold mines rush back in. Over a year ago, the dad-of-two deserted his job after a colleague was killed when the walls of the pit caved in, burying him alive. ‘A</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/inside-zimbabwes-gold-mines-where-men-risk-being-buried-alive-for-a-few-dollars/\">Inside Zimbabwe’s gold mines where men risk being buried alive for a few dollars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "11 Sep 2025"
        },
        {
            "title": "King Kandoro headlines comedy night as Shoko Festival celebrates crystal jubilee",
            "url": "https://www.newzimbabwe.com/king-kandoro-headlines-comedy-night-as-shoko-festival-celebrates-crystal-jubilee/",
            "content": "By Darlington Gatsi\n\nAS the Shoko Festival marks 15 years since inception, the spotlight will be on the legacy of the countrys largest urban culture festival, and there is no better way to mark the occasion than with comedian King Kandoro headlining the comedy night on September 25.\n\nKing Kandoro will perform at the Shoko Festival Comedy Night at the Harare Gardens.\n\nThis marks a homecoming for King Kandoro, who last performed in Harare a year ago. The performance will mark a full circle for the jestmaster, who was nurtured through the incubation of the Magamba Network, the organisers of the Shoko Festival.\n\nKandoro, who has sold-out shows in Harare in the past, will be supported by Kenyas Justine Wanda, Munyaradzi Chipere, and Mbongeni Ignatious Ndlovu.\n\nShoko Festival director, Samm Farai Monro, says this years edition will honour the legacy that has been built over the past 15 years.\n\nOur Comedy Night lineup is a reflection of the legacy we have been building over 15 years as Shoko Festival. King Kandoro is an example of that legacy as he grew his comedy career through platforms created by Magamba TV and Shoko and is now one of Zimbabwes biggest comedians.\n\nHe returns triumphantly to Shoko as a headliner and this shows our commitment to nurturing the next generation of artists in Zimbabwe who speak truth to power. Kandoro will be joined on stage by an amazing group of comedians. Its gonna be a hilarious night! says Monro.\n\nKandoro is expected to surpass the performance standard set by Learnmore Jonasi, who was the headliner last year.\n\n",
            "image_url": null,
            "description": "<p>By Darlington Gatsi AS the Shoko Festival marks 15 years since inception, the spotlight will be on the legacy of the country’s largest urban culture festival, and there is no better way to mark the occasion than with comedian King Kandoro headlining the comedy night on September 25. King Kandoro will perform at the Shoko</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-kandoro-headlines-comedy-night-as-shoko-festival-celebrates-crystal-jubilee/\">King Kandoro headlines comedy night as Shoko Festival celebrates crystal jubilee </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "11 Sep 2025"
        },
        {
            "title": "Chevrons to play Namibia ahead of T20I World Cup Africa Regional Finals",
            "url": "https://www.newzimbabwe.com/chevrons-to-play-namibia-ahead-of-t20i-world-cup-africa-regional-finals/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team is set to play Namibia in a three-match T20I series scheduled from September 15 to 18.\n\nThe upcoming series will see all the games being played at Queens Sports Club.\n\nBoth Zimbabwe and Namibia will be using the series to prepare for the ICC Mens T20 World Cup Africa Regional Finals, scheduled to start the following week, from September 26 to October 4.\n\nThe Chevrons walk into the series coming off a 2-1 defeat against Sri Lanka at Harare Sports Club.\n\nCommenting ahead of the series, Chevrons coach Justin Summons said, Its important that we build on the positives from the Sri Lanka series, and facing Namibia will give us exactly the kind of contest we need before the qualifier.\n\nThey are a quality team who have consistently performed well in this format, so these matches will demand our very best.\n\nZimbabwe squad: Sikandar Raza (c), Brian Bennett, Ryan Burl, Brad Evans, Trevor Gwandu, Tinotenda Maposa, Tadiwanashe Marumani, Wellington Masakadza, Tony Munyonga, Tashinga Musekiwa, Blessing Muzarabani, Dion Myers, Richard Ngarava, Brendan Taylor, Sean Williams\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/25162538/Chevrons.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team is set to play Namibia in a three-match T20I series scheduled from September 15 to 18. The upcoming series will see all the games being played at Queens Sports Club. Both Zimbabwe and Namibia will be using the series to prepare for the ICC Men’s T20</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-play-namibia-ahead-of-t20i-world-cup-africa-regional-finals/\">Chevrons to play Namibia ahead of T20I World Cup Africa Regional Finals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "11 Sep 2025"
        },
        {
            "title": "Kadewere not dropped for Warriors last match, sources explain – as Nees begs for peace",
            "url": "https://www.newzimbabwe.com/kadewere-not-dropped-for-warriors-last-match-sources-explain-as-nees-begs-for-peace/",
            "content": "By Staff Reporter\n\nREPORTS that Warriors coach Michael Nees was forced to drop forward Tino Kadewere for their World Cup qualifier against Rwanda following his altercation with journalist Yvonne Mangunda, have been dismissed.\n\nKadewere and Mangunda had a short touchline bust-up at Orlando Stadium in South Africa where Zimbabwe were training ahead of their match against Rwanda.\n\nHis absence from the matchday squad had sent tongues wagging, with many arguing he had been dropped by Nees, a case that has been dismissed by sources within the ZIFA entourage in South Africa who explained his absence.\n\nZIFA put out a statement on the matter and that was it. He was not dropped but injured on Monday, said a source from within the entourage.\n\nThose who noticed, on Monday he sat out most of the training because of a knock he got last Friday (when Zimbabwe played Benin in Ivory Coast).\n\nSpeaking after another, slim 1-0 loss Nees fell short of begging for peace and unity, saying the matter had been rested.\n\nI appeal to everybody to stick together, be a little bit humble. We had incidents here and I hope they are all sorted out, said Nees.\n\nWe will not benefit; we all need positive energy. We wanted to break that with a result to get that positive mood. Definitely we have too much noise, there is no doubt about thatwe have to stop that on various platforms.\n\nSocial media has been ablaze since the incident, with fans unevenly divided between Kadewere and Mangunda.\n\nKadewere, despite a dip in form, has found favour and been saluted for standing up for himself while Mangunda is being accused of being toxic towards followers of her Facebook page.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/20005548/Tino-Kadewere-x350.jpg",
            "description": "<p>By Staff Reporter REPORTS that Warriors coach Michael Nees was forced to drop forward Tino Kadewere for their World Cup qualifier against Rwanda following his altercation with journalist Yvonne Mangunda, have been dismissed. Kadewere and Mangunda had a short touchline bust-up at Orlando Stadium in South Africa where Zimbabwe were training ahead of their match</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-not-dropped-for-warriors-last-match-sources-explain-as-nees-begs-for-peace/\">Kadewere not dropped for Warriors last match, sources explain – as Nees begs for peace</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "11 Sep 2025"
        }
    ]
}