{
    "news": [
        {
            "title": "ZIMURA to appeal boss’s fraud conviction, says ruling “unfair”",
            "url": "https://www.newzimbabwe.com/zimura-to-appeal-bosss-fraud-conviction-says-ruling-unfair/",
            "content": "By Tapiwa Svondo\n\nThe Zimbabwe Music Rights Association (ZIMURA) has said it will appeal its Executive Director Polisile Ncube Chimhinis fraud conviction, describing the ruling as unjust.\n\nChimhini was on Wednesday convicted of fraud by Harare Magistrate Rufaro Panavanhu. She was facing forgery and fraud charges and was acquitted.\n\nShe was acquitted of forgery but found guilty of fraud and fined US$300.\n\nIn a statement, the ZIMURA Director of Information, Alexio Gwenzi, said a notice of appeal against both the conviction and sentence had been filed.\n\nZIMURA was taken to court over allegations of misrepresentation of facts related to the filing of the CR6 form, a legally recognized document submitted to and stamped by the Registrar of Companies. This document was lawfully processed, paid for, and later tendered as evidence in the High Court in a separate case involving Phillip Chipfumbus membership dispute.\n\nZIMURA maintains that no misrepresentation, forgery, or fraud occurred in this matter. The CR6 was a legitimate filing under the Companies Act, and we firmly believe the conviction is unjust. As such, we have filed a notice of appeal to challenge both the conviction and sentence, said Gwenzi.\n\nIn July 2023, a complainant Philip Chipfumbu, filed a case against ZIMURA at the High Court and sought an audit of the music rights association. Chipfumbu later discovered that a CR6 document filed for ZIMURA by Chimhini was forged and not registered with the Department of Deeds, Companies and Intellectual Property. The CR6 was only registered later in January 2024.\n\nZIMURA further dismissed reports that Chimhini was remanded in custody.\n\nPlease take note that the malicious statements circulating that there was misappropriation of funds and that Mrs Chimhini was remanded in custody are mere lies aimed at tarnishing her image and brand Zimura. The fraud case is in relation to the CR6 form that was filed in the High Court of Zimbabwe, said Gwenzi.\n\nEarlier today, in a series of Facebook posts, Chimhini wrote, Dont worry Im safe, one doesnt go with a phone in jail.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/18152113/zimura.jpeg",
            "description": "<p>By Tapiwa Svondo The Zimbabwe Music Rights Association (ZIMURA) has said it will appeal its Executive Director Polisile Ncube Chimhini’s fraud conviction, describing the ruling as “unjust”. Chimhini was on Wednesday convicted of fraud by Harare Magistrate Rufaro Panavanhu. She was facing forgery and fraud charges and was acquitted. She was acquitted of forgery but</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimura-to-appeal-bosss-fraud-conviction-says-ruling-unfair/\">ZIMURA to appeal boss’s fraud conviction, says ruling “unfair”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "26 Jun 2025"
        },
        {
            "title": "Tagwirei unleashes tirade against Kasukuwere – labels ex-minister ‘godfather of corruption’, accuses Biti of shady dealings",
            "url": "https://www.newzimbabwe.com/tagwirei-unleashes-tirade-against-kasukuwere-labels-ex-minister-godfather-of-corruption-accuses-biti-of-shady-dealings/",
            "content": "By Costa Nkomo\n\nZANU PF businessman Kudakwashe Tagwirei has ignited a feud with self-exiled former cabinet minister Saviour Kasukuwere, branding him a prime example of corruption with no moral authority to criticise others.\n\nTagwirei also targeted former Finance Minister Tendai Biti, suggesting the former Harare East Member of Parliament is well aware that Tagwirei possesses compromising information of his past shady dealings.\n\nAddressing the Land Tenure Leadership Success Series in Bulawayo on Wednesday, Tagwirei claimed to possess a list of individuals who, despite accusations of corruption, dare to label him a corrupt businessman.\n\nIf I was to stand here, and Tendai Biti knows this, and if I start to speak about his corrupt activities where will we go? If I was to talk about all these people like Kasukuwere. As for Kasukuwere, he is one of the most corrupt people I know, Tagwirei fumed.\n\nTagwirei asserted his alignment with President Emmerson Mnangagwas approach to corruption, suggesting the President prioritises national development over publicly denouncing corrupt individuals.\n\nThe people who speak the most about corruption are the most corrupt. Now, have you ever seen that the President (Emmerson Mnangagwa) does not speak about the people. I learn from the best. The President does not speak about people. He speaks about his vision. So, I follow the Presidents vision. The Presidents vision is not about corruption. It is about building the country, Tagwirei said.\n\nTagwirei may have inadvertently stirred controversy by portraying the President as indifferent to the corrosive effects of corruption, which are crippling Zimbabwes economy.\n\nVice President Constantino Chiwenga has previously expressed strong condemnation of corruption, even deeming it a threat to national security.\n\nLast year, Prosecutor General Justice Loice Matanda-Moyo revealed that Zimbabwe loses US$2 billion United States dollars annually to corruption through illicit deals and leakages.\n\nTagwireis company, Sakunda Holdings, has faced allegations of misappropriating approximately US$3 billion United States dollars as a contracted supplier of farming inputs under the governments Command Agriculture programme between 2016 and 2019.\n\nAccording to a Transparency International report, Zimbabwes 2024 Corruption Perception Index (CPI) score was 21 out of 100. Lower scores indicate higher perceived corruption. This score places Zimbabwe 158 out of 180 in the index, indicating a widespread perception of corruption within its public sector compared to other nations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/27021209/Saviour-Kasukuwere.png",
            "description": "<p>By Costa Nkomo ZANU PF businessman Kudakwashe Tagwirei has ignited a feud with self-exiled former cabinet minister Saviour Kasukuwere, branding him a prime example of corruption with no moral authority to criticise others. Tagwirei also targeted former Finance Minister Tendai Biti, suggesting the former Harare East Member of Parliament is well aware that Tagwirei possesses</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-unleashes-tirade-against-kasukuwere-labels-ex-minister-godfather-of-corruption-accuses-biti-of-shady-dealings/\">Tagwirei unleashes tirade against Kasukuwere – labels ex-minister ‘godfather of corruption’, accuses Biti of shady dealings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "26 Jun 2025"
        },
        {
            "title": "WATCH | ‘Where must my family do business – Zimbabwe?,’ asks SA Deputy President Mashatile",
            "url": "https://www.newzimbabwe.com/watch-where-must-my-family-do-business-zimbabwe-asks-sa-deputy-president-mashatile/",
            "content": "African Insider\n\nDeputy President Paul Mashatile has denied any political interference inawarding South Africas lucrative national lottery licence to Sizekhaya Holdings, whose shareholders include Bellamont Gaming.\n\nAccording toThe Citizen, Bellamont is co-owned by Moses Tembe and Khumo Bogatsu  Bogatsu is the twin sister of Mashatiles wife, raising concerns over potential conflict of interest.\n\nSizekhaya was granted the licence for eight years, amid public scrutiny and fears of patronage, especially as Bellamont was registered just nine months prior, the report said.\n\nIn an interview withSowetan Times, Mashatile insisted he had no role in the process and says its unfair to accuse his relatives of wrongdoing simply due to their association with him.\n\nThere are so many people who know me in this country  family, children, cousins and friends. Where must they do business? In Zimbabwe? Out of this country?  Mashatile asked on Tuesday.\n\nThey can do business, as long as Im not involved, not because they know me. Because once you say Mr Mashatile is capable of influencing, even if he is sitting in his house, its unfair. You must be able to say he went there to interfere.\n\nThe deputy president stressed that only Trade and Industry Minister Parks Tau had the authority to select the winning bidder.\n\nTau announced Sizekhaya as the winner on 28 May after a lengthy evaluation process and has since promised Parliament that any allegations of conflicts of interest will be investigated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26052403/Paul-Mashatile_Cropped_Twitter_GovernmentZA.jpg",
            "description": "<p>African Insider Deputy President Paul Mashatile has denied any political interference in awarding South Africa’s lucrative national lottery licence to Sizekhaya Holdings, whose shareholders include Bellamont Gaming. According to The Citizen, Bellamont is co-owned by Moses Tembe and Khumo Bogatsu — Bogatsu is the twin sister of Mashatile’s wife, raising concerns over potential conflict of interest.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-where-must-my-family-do-business-zimbabwe-asks-sa-deputy-president-mashatile/\">WATCH | ‘Where must my family do business – Zimbabwe?,’ asks SA Deputy President Mashatile</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "26 Jun 2025"
        },
        {
            "title": "Zimbabwe set to make Women’s Championship debut during New Zealand tour",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-to-make-womens-championship-debut-during-new-zealand-tour/",
            "content": "ESPN\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22053346/lady-chevrons.jpeg",
            "description": "<p>ESPN Zimbabwe will begin their quest to qualify for the Women’s ODI World Cup for the first time in their history when they tour New Zealand for a white-ball series in February-March 2026. The three ODIs on the tour, scheduled for March 5, 8 and 11 in Dunedin, will be Zimbabwe’s debut in the ICC Women’s Championship, the primary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-to-make-womens-championship-debut-during-new-zealand-tour/\">Zimbabwe set to make Women’s Championship debut during New Zealand tour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "26 Jun 2025"
        },
        {
            "title": "Prince Dube’s Young Africans lift Tanzanian League Title",
            "url": "https://www.newzimbabwe.com/prince-dubes-young-africans-lift-tanzanian-league-title/",
            "content": "By Sports Reporter\n\nPrince Dubes club, Young Africans, on Wednesday afternoon won the NBC Tanzania Premier League trophy after beating rivals and fellow contenders Simba SC 2-0 in the final match of the season.\n\nThe title marks Prince Dubes first league title in his professional career, which started at Highlanders.\n\nYoung Africans lifted the league trophy with a record 82 points, four ahead of Simba SC, who finished on 78 points.\n\nWinning the title will see Yanga representing Tanzania in the coming 2025-26 Total CAF Champions League season.\n\nDube joined Young Africa in July last year after a three-year stint with another Tanzanian side, Azam FC.\n\nSince joining Yanga, the Zimbabwean forward has managed to score 14 league goals and three more in the CAF Champions League.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26045208/Screenshot-2025-06-26-at-05.50.42.png",
            "description": "<p>By Sports Reporter Prince Dube’s club, Young Africans, on Wednesday afternoon won the NBC Tanzania Premier League trophy after beating rivals and fellow contenders Simba SC 2-0 in the final match of the season. The title marks Prince Dube’s first league title in his professional career, which started at Highlanders. Young Africans lifted the league</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prince-dubes-young-africans-lift-tanzanian-league-title/\">Prince Dube’s Young Africans lift Tanzanian League Title</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "26 Jun 2025"
        },
        {
            "title": "Sixteen killed, hundreds injured, in antigovernment Kenyan protests",
            "url": "https://www.newzimbabwe.com/sixteen-killed-hundreds-injured-in-antigovernment-kenyan-protests/",
            "content": "Agencies\n\nAt least 16 people have been killed in nationwide rallies against police brutality and government corruption in Kenya, according to Amnesty International and the Kenya National Commission on Human Rights.\n\nAnother 400 people were injured on Wednesday, including protesters, police and journalists. The casualties included people hit by live fire and others who were wounded by rubber bullets, or were beaten, and were primarily in the Kenyan capital, Nairobi.\n\nDemonstrators had clashed with police, who hurled tear gas canisters and wielded batons. The protests mark one year since people stormed parliament at the peak of antigovernmentdemonstrations.\n\nThousands took to the streets to commemorate last years youth-led demonstrations against tax rises, during which at least 60 people were killed by security forces, according to rights groups.\n\nAmong the crowds in the capital, some waved Kenyan flags and placards with pictures of demonstrators killed last year and chanted Ruto must go, referring to President William Ruto, whose proposed tax hikes triggered last years youth-led protests.\n\nIve come here as a Kenyan youth to protest. It is our right for the sake of our fellow Kenyans who were killed last year. The police are here  they are supposed to protect us, but they kill us, Eve, a 24-year-old woman, told the AFP news agency.\n\nIt is extremely important that the young people mark June 25th because they lost people who look like them, who speak like them  who are fighting for good governance, said Angel Mbuthia, chair of the youth league for the opposition Jubilee Party.\n\nProtesters also gathered in various other parts of the country, including in the town of Matuu, approximately 100km (62 miles) from the capital, where there were reports of clashes.\n\nPolice blocked main roads leading into the capitals central business district, while government buildings were barricaded with razor wire.\n\nThe government ordered TV and radio stations to halt live coverage of the protests.\n\nNetBlocks, a global internet tracker, said social media platform Telegram had been restricted. And Kenyan broadcaster KTN was taken off the air later on Wednesday, a senior official at its parent company, Nation Media Group, said.\n\nAl Jazeeras Malcolm Webb, reporting from Nairobi, said protests across the country have been met with a lot of violence by the police.\n\nAbout a dozen people have been treated for gunshot wounds, he said, citing local media reports.\n\nKenyas Citizen TV reported that protesters torched court facilities in Kikuyu on the outskirts of Nairobi.\n\nIsolated clashes were reported in the port city of Mombasa, according to NTV, with protests also in the towns of Kitengela, Kisii, Matuu and Nyeri.\n\nThe anniversary comes amid soaring anger aboutpolice brutality, particularly after 31-year-old blogger and teacher, Albert Ojwang, was killed in custody earlier this month following his arrest for criticising a senior officer.\n\nSix people, including three police officers, were charged with murder on Tuesday for Ojwangs killing. They have all pleaded not guilty.\n\nPolice have said protests are permitted as long as they are peaceful and unarmed.\n\nBut a group of peaceful protesters was attacked last week by a large gang of motorbike-riding goons, as they are known in Kenya, armed with whips and clubs and working in tandem with the police.\n\nOn Tuesday, the embassies of the United States, the United Kingdom, Canada, and other Western nations released a joint statement on X urging all involved to facilitate peaceful demonstrations and to refrain from violence.\n\nThe use of plain clothed officers in unmarked vehicles erodes public trust, the statement said. Rights campaigners condemned the presence of unidentified police officers at protests last year.\n\nKenyas Ministry of Foreign Affairs said in a statement late on Tuesday that any policing violations would be addressed through government institutions, including the parliament and the judiciary.\n\nThe ministry reminds all that diplomatic partnerships flourish best in mutual respect, open channels and a recognition of each others unique governance contexts, it said.\n\nThere is also growing resentment among young people towards Ruto, who came to power in 2022, promising rapid economic progress.\n\nMany have been disillusioned by continued stagnation, corruption and high taxes, even after last years protests forced Ruto to cancel an unpopular finance bill. His government has been at pains to avoid direct tax rises this year.\n\nBut the frequent disappearances of government critics  rights groups have counted more than 80 since last years protests, with dozens still missing  have led many to accuse Ruto of returning Kenya to the dark days of its dictatorship in the 1980s and 90s.\n\nRuto previously promised an end to abductions but was unapologetic in a speech on Tuesday, pledging to stand by the police.\n\nYou cannot use force against the police or insult, or threaten the police, he warned protesters. You are threatening our nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26042000/AFP__20250625__63PB84A__v2__HighRes__TopshotKenyaUnrestPolitics-1750838089.webp",
            "description": "<p>Agencies At least 16 people have been killed in nationwide rallies against police brutality and government corruption in Kenya, according to Amnesty International and the Kenya National Commission on Human Rights. Another 400 people were injured on Wednesday, including protesters, police and journalists. The casualties included people hit by live fire and others who were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sixteen-killed-hundreds-injured-in-antigovernment-kenyan-protests/\">Sixteen killed, hundreds injured, in antigovernment Kenyan protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "26 Jun 2025"
        }
    ]
}