{
    "news": [
        {
            "title": "Opposition MPs demand electoral reforms ahead of 2028 elections",
            "url": "https://www.newzimbabwe.com/opposition-mps-demand-electoral-reforms-ahead-of-2028-elections/",
            "content": "By Anna Chibamu\n\nCitizens Coalition for Change (CCC)legislators on Wednesday demanded the implementation of electoral reforms, including recommendations made in the 2023 SADC Observer Election Report, before Zimbabwe holds its next general elections.\n\nZimbabwe is scheduled to hold general elections in 2028 when President Emmerson Mnangagwas current constitutional mandate ends. However, Zanu PF has already resolved at its last Conference to push for extending his stay in office until 2030.\n\nDuring a parliamentary Question and Answer session, CCC Harare Central MP Lovemore Jimu pressed government to outline policy measures for implementing electoral reforms ahead of the next polls.\n\nResponding, Acting Leader of Government Business in Parliament Felix Mhona said the Zimbabwe Electoral Commission (ZEC) was solely responsible for administering election matters.\n\nI am very happy that we have one of our institutions, ZEC, which superintends over elections. Our Constitution outlines what must be done prior to an election. If there are any specific concerns, the Honourable Member is free to put them on the Order Paper for the relevant Minister to address, said Mhona.\n\nCCCs Ellen Shiriyedenga reminded the House that ZEC had submitted a 2023 election report with specific recommendations.\n\nWe are in the preparatory stage of the election cycle. This is the time to implement ZECs recommendations from the 2023 elections. What is ZEC currently doing to ensure this happens before 2028? she asked.\n\nMhona responded by urging her to specify which recommendations had not been addressed, adding that the SADC report had not discredited Zimbabwes elections.\n\nThey were deemed to be credible, fair and transparent. It is just like if you are in a vote scenario where you have the minority and the majority. You might raise your concerns under the minority but the obvious majority rules, Mhona said.\n\nWarren Park MP, Shakespeare Hamauswa, also asked about stakeholder dialogue in preventing disputed elections. Mhona stated that President Mnangagwas Political Actors Dialogue (POLAD) platform was still available if the opposition wants to join.\n\nWhen we say we have a listening President, he has invited all political players to engage with him. He has an open-door policy and is amenable to addressing concerns raised, he said.\n\nCCC Mbizo legislator Corban Madzivanyika insisted that the SADC report highlighted serious shortcomings, including issues around voter registration, high nomination fees, state media bias, and election materials.\n\nMinister Mhona maintained that the ruling partys electoral victory reflected the will of the people, urging the opposition to look ahead.\n\nThe fact that Zanu PF is in Parliament with a majority shows that elections were held. Let us now focus on the future and address anomalies as we prepare for the next election, he said.\n\nHowever, MP Ransome Makamure reminded the House that Zimbabwe had recently chaired SADC and could not ignore its own bodys report.\n\nWe must embrace the SADC report, not dismiss it, since we are part of the regional bloc, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/24123047/vote-mother.jpg",
            "description": "<p>By Anna Chibamu Citizens Coalition for Change (CCC) legislators on Wednesday demanded the implementation of electoral reforms, including recommendations made in the 2023 SADC Observer Election Report, before Zimbabwe holds its next general elections. Zimbabwe is scheduled to hold general elections in 2028 when President Emmerson Mnangagwa’s current constitutional mandate ends. However, Zanu PF has already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-mps-demand-electoral-reforms-ahead-of-2028-elections/\">Opposition MPs demand electoral reforms ahead of 2028 elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "19 Sep 2025"
        },
        {
            "title": "Zimbabwe Central Bank deputy says time for dollar debate is over",
            "url": "https://www.newzimbabwe.com/zimbabwe-central-bank-deputy-says-time-for-dollar-debate-is-over/",
            "content": "Bloomberg\n\nZimbabweansshould focus more on their gold-backed currency thats set to become the sole legal tender by 2030 and less on how to phase out dollar use, according to the central banks deputy governor.\n\nWe should talk about mono-currency, the time to talk about de-dollarization is over,Innocent Matshesaid at an annual finance ministry conference Wednesday held in Bulawayo, the nations second largest city. We should think about our own currency, not on how to get rid of another currency.\n\nInnocent Matshe Photographer: Cynthia R Matonhodze/Bloomberg\n\nThe comments underscore the authorities resolve to adopt the ZiG  short for Zimbabwe Gold  as the sole currency, replacing the US dollar, which has been used for transactions since 2009.\n\nThe central bank earlier this month outlined steps needed before the local unit can be fully adopted. These included building sufficient foreign currency reserves and slashing annual inflation from 94% to single digits.\n\nThe ZiG wasintroducedin April 2024, marking the southern African nations sixth effort to stand up a viable local currency after previous efforts failed amid sky-high inflation and collapsing values on foreign exchange markets.\n\nSigns of improving sentiment toward the ZiG include a slowdown in the rate at which it is exchanged for US dollars, said Matshe, citing banking data. Currently, the ZiG accounts for about 40% of transactions in the economy\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Bloomberg Zimbabweans should focus more on their gold-backed currency that’s set to become the sole legal tender by 2030 and less on how to phase out dollar use, according to the central bank’s deputy governor. “We should talk about mono-currency, the time to talk about de-dollarization is over,” Innocent Matshe said at an annual finance ministry conference Wednesday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-central-bank-deputy-says-time-for-dollar-debate-is-over/\">Zimbabwe Central Bank deputy says time for dollar debate is over</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "19 Sep 2025"
        },
        {
            "title": "Avenues Clinic lays off 50 workers, accused of targeting unionised staff",
            "url": "https://www.newzimbabwe.com/avenues-clinic-lays-off-50-workers-accused-of-targeting-unionised-staff/",
            "content": "By Alois Vinga\n\nThe prestigious Avenues Clinic in Harare has begun a retrenchment exercise that will result in the layoff of 50 employees, according to insiders, who allege that this move is aimed at targeting unionised workers.\n\nThe private, multi-disciplinary hospital, a flagship facility of Medical Investments Limited (MIL), now risks being drawn into a major labour dispute.\n\nSources close to the developments toldNewZimbabwe.comthis week that the exercise appeared highly questionable.\n\nA total of 50 workers have since been served with Notices to retrench by the employer. Finer details on the reasons behind the job cuts and terminal benefits to be paid remain unclear. What boggles the mind is that the workers have since been placed on paid leave while the organisation has moved swiftly to replace some of the targeted workers, one insider said on condition of anonymity.\n\nAnother source alleged that the retrenchments disproportionately affected staff who were members of trade unions.\n\nOver and above all these shortcomings, we need to understand why the company has hurriedly replaced the affected workers in some sections, while others have been replaced through outsourcing services like cleaning. Among those recruited recently are allegations that they were warned against being unionised as a condition of service, the source claimed.\n\nThe affected employees are now expecting a reasonable termination package as they argue that the employers decision has nothing to do with the inability to pay salaries.\n\nWhen contacted for comment, MIL general manager Sibusisiwe Ndlovu neither confirmed nor denied the allegations, instead referringNewZimbabwe.comto the internal communications department, which had not responded by the time of publication.\n\nHowever, a letter seen byNewZimbabwe.com,dated September 16, 2025, and signed by Ndlovu, confirmed the institutions decision to retrench some staff. The letter, addressed to one affected employee (name withheld), reads in part:\n\nWe wish to advise you that your position has been affected by the restructuring exercise, therefore, you are among members of staff who will be retrenched. The intended retrenchment will take effect from the fourteenth day after the date of receiving this letter.\n\nEngagements with you shall commence soon, and it is our hope that a retrenchment agreement will be reached to facilitate an expeditious conclusion of this in a manner which is fair and transparent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/18062948/avenues-clinic.jpg",
            "description": "<p>By Alois Vinga The prestigious Avenues Clinic in Harare has begun a retrenchment exercise that will result in the layoff of 50 employees, according to insiders, who allege that this move is aimed at targeting unionised workers. The private, multi-disciplinary hospital, a flagship facility of Medical Investments Limited (MIL), now risks being drawn into a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/avenues-clinic-lays-off-50-workers-accused-of-targeting-unionised-staff/\">Avenues Clinic lays off 50 workers, accused of targeting unionised staff</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "19 Sep 2025"
        }
    ]
}