{
    "news": [
        {
            "title": "SZA’s comments spark Nicki Minaj’s fiery Twitter rant: a social media showdown",
            "url": "https://www.newzimbabwe.com/szas-comments-spark-nicki-minajs-fiery-twitter-rant-a-social-media-showdown/",
            "content": "IOL\n\nAmerican rapper Nicki Minaj is at it again with her X rants.\n\nThe 42-year-old rapper shared how a rapper called Punch, who is signed under SZAs label, Top Dawg Entertainment, bullied her on X for absolutely no reason.\n\nThe 30 for 30 singer then tweeted a short and cryptic message, which ultimately seemed not to be directed to anyone, as she did not include names.\n\nMercury retrograde  dont take the bait lol silly goose, the multi-award-winning singer wrote.\n\nThis one tweet opened a can of worms because theSuper Freaky Girl rapperwent on an X rant claiming that the tweet was indirectly about her.\n\nMinaj went on to throw multiple online jabs atSZA,comparing their streaming sales, talking about her looks and claiming that the Snooze singer is not an icon but she is.\n\nMinaj clapped back at SZA and said, Wait. Does SZA think shes more successful than me? Lol yall catch me up pls. SZA, if every song youve ever done vanished right now, the music business wouldnt even miss you.\n\nIn this lengthy tweet, the Trinidadian-born rapper went on to claim that other countries that she has been to have no clue who SZA is and the singer has not even headlined a concert that consists of 80 000 attendees.\n\nShe added: Boo, Im an icon. Youre not.\n\nWhile you would think that it was the end, you are wrong because Minaj followed up with a series of tweets calling SZA a weirdo after Minajs fanbase shared screenshots of SZA bashing other women in the music industry, including Rihanna, Beyonce and even the rapper herself.\n\nLike do you know the level of inside HATE for yourself you had to have had to be this much of a cunt for no reason to the women you later worked with? Now you wanna act like a mthfckn tarot card, b***t quit. What an odd little weirdo, she wrote.\n\nWhile Nicki did not stop there, SZA, on the other hand, subtly replied to Minajs rants by wishing everyone a blessed night.\n\nLmao lemme go back to being calm, shy and meek. Yall have a blessed night! See you tomorrow for night 2 Paris!!\n\nSZA is not the only artist who has experienced the wrath of Minajs X rants.\n\nJust last week, Minaj sparked a feud with the Carters, as she claimed that Jay Z cheated her out of a multi-million dollar deal with streaming service, TIDAL.\n\nWhile on her infamous rants, Beyoncs fanbase, Beyhive, quickly defended their idol, who is currently on tour.\n\nCardi Bis also known to be one of the people that has beef with Minaj. Even though their feud dates back to 2018, to date, the rappers continue to throw jabs at each other on social media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17034018/Screenshot-2025-07-17-at-04.39.56.png",
            "description": "<p>IOL American rapper Nicki Minaj is at it again with her X rants. The 42-year-old rapper shared how a rapper called Punch, who is signed under SZA’s label, Top Dawg Entertainment, bullied her on X for absolutely no reason. The “30 for 30” singer then tweeted a short and cryptic message, which ultimately seemed not</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/szas-comments-spark-nicki-minajs-fiery-twitter-rant-a-social-media-showdown/\">SZA’s comments spark Nicki Minaj’s fiery Twitter rant: a social media showdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "17 Jul 2025"
        },
        {
            "title": "Stolen R2.5 million Nissan Patrol: Zimbabwean man remains behind bars",
            "url": "https://www.newzimbabwe.com/stolen-r2-5-million-nissan-patrol-zimbabwean-man-remains-behind-bars/",
            "content": "IOL\n\nA 48-year-old Zimbabwean man, Stephen Nyoni, has been remanded in custody after appearing in a Limpopo court for possessing a stolen vehicle.\n\nLast week,IOL reported that police in Limpopo had intercepted and recovered a high-performance luxury sport utility vehicle, valued at over R2.5 million, during a targeted anti-smuggling operation.\n\nThe anti-crime blitz was conducted by the South African Police Service (SAPS) in Limpopo in collaboration with private security partners along the N1 highway near Polokwane on Wednesday.\n\nActing on intelligence regarding a stolen vehicle travelling from Gauteng towards the Beitbridge border, the operational team consisting of Limpopo SAPS, ShadowSecure Security, Tshimollo Security and Investigations, and Tracker Connect kept strategic observation along the N1 route, said Limpopo police spokesperson, Brigadier Hlulani Mashaba.\n\nThe vehicle matching the description, a Nissan Patrol V8 5.6, was identified and intercepted near Shell Ultra City within the Westernburg policing area.\n\nMashaba said further investigations confirmed that the vehicle had been stolen in Brooklyn, Pretoria.\n\nStephen Nyoni was arrested while allegedly driving a stolen V8 Nissan Patrol 5.6 worth R2.5 million towards the Beitbridge port of entry Image: SAPS\n\nA 48-year-old Zimbabwean national, who was driving the vehicle, was arrested on the spot and charged with possession of a suspected stolen motor vehicle, he said.\n\nIn an update,SAPS in Limpopo told IOL that Nyoni is expected to seek bail when he returns to the Polokwane Magistrates Court this week.\n\nThe accused person appeared before Polokwane Magistrates Court, and the matter was postponed to Wednesday, 16 July 2025, for formal bail application, said Mashaba.\n\nThe accused person was remanded in custody till then.\n\nIn May, IOL reported that a31-year-old man,Mikael Mlambo, appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted a stolenToyota Corolla Crosssport utility vehicle which was being driven towards the Beitbridge port of entry.\n\nAt the time,Mashaba said the matter was postponed to allow for the profiling of the arrested man. He said police had established that Mlambo is a South African national.\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen in May, around Pretoria central.\n\nOn Friday, 16 May 2025, members of provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17032342/Screenshot-2025-07-17-at-04.21.30.png",
            "description": "<p>IOL A 48-year-old Zimbabwean man, Stephen Nyoni, has been remanded in custody after appearing in a Limpopo court for possessing a stolen vehicle. Last week, IOL reported that police in Limpopo had intercepted and recovered a high-performance luxury sport utility vehicle, valued at over R2.5 million, during a targeted anti-smuggling operation. The anti-crime blitz was conducted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stolen-r2-5-million-nissan-patrol-zimbabwean-man-remains-behind-bars/\">Stolen R2.5 million Nissan Patrol: Zimbabwean man remains behind bars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "17 Jul 2025"
        },
        {
            "title": "Fidelity insurance contract revenue up 45%",
            "url": "https://www.newzimbabwe.com/fidelity-insurance-contract-revenue-up-45/",
            "content": "By Alois Vinga\n\nFIDELITY Life Assurance has seen insurance contract revenue growing by 45% compared to the prior year, signifying the groups resilience.\n\nPresenting the groups annual report this week, FLA chairman Livingstone Gwata said the segment grew by 45% from US$7,9 million to US$11,4 million in the year under review on the strength of the groups customised service approach which continues to drive uptake of the Companys products offering on the market.\n\nThe Vaka Yako product performed very well and contributed significantly to the Gross Premium Written (GPW) at 85% of the premium inflows. On the premium inflows, the Zimbabwean operation contributed 68% for the year under review compared to 62% in 2023, whilst for the year under review 32% was attributable to the Malawi operation which contributed 38% in 2023, he said.\n\nThe insurance service result declined by 174% owing to higher insurance service expenses incurred compared to the earned revenue. The segments expenses increased by 66% compared to the growth in Insurance Contract Revenue of 45%.\n\nNet investment income grew by 55% compared to the prior year from USD5.6 million to USD9.0 million. The Group profit for the period increased by 174%.\n\nFLA said the Asset Separation exercise, which is currently underway, is close to completion and is set to be concluded in Q1 2025.\n\nThe business is now wrapping up the paperwork required to fully execute the exercise. The exercise brings added transparency and protections to both policyholders and shareholders, especially noting Zimbabwes fluid policy environment.\n\nFor policyholders, the separation of assets will unlock more, in terms of quantum and value, investment opportunities, sustainable growth and profitability, said Gwata.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/22145953/Fidelity-Life-Assurance-building.jpg",
            "description": "<p>By Alois Vinga FIDELITY Life Assurance has seen insurance contract revenue growing by 45% compared to the prior year, signifying the group’s resilience. Presenting the group’s annual report this week, FLA chairman Livingstone Gwata said the segment grew by 45% from US$7,9 million to US$11,4 million in the year under review on the strength of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fidelity-insurance-contract-revenue-up-45/\">Fidelity insurance contract revenue up 45%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "17 Jul 2025"
        },
        {
            "title": "Dynamos adds foreign players in effort to survive relegation",
            "url": "https://www.newzimbabwe.com/dynamos-adds-foreign-players-in-effort-to-survive-relegation/",
            "content": "By Sports Reporter\n\nRelegation candidates Dynamos FC have signed three new foreign players in a move to beef up the squad.\n\nDembare is currently in the relegation zone as they are second from bottom (17) on the log with 15 points, six ahead of Kwekwe United.\n\nThe three new foreigners are two Ghanaian infield players, Felix Hammond (defender), Mohammed Issaka (striker) and a Zambian goalkeeper, Sitali Nyambe.\n\nNew Zimbabwe.com understands that the trio signed with the club on Tuesday and will be ready for selection for Saturdays match against Simba Bhora at Wadzanayi Stadium in Shamva.\n\nOther than the three foreigners, Dembare has also signed midfielder Wisdom Mutasa, who is coming from Botswanas Orapa United.\n\nThis will mark Mutasas second stint at the Glamour Boys, the first being in 2017 when he played under his father, Lloyd Mutasa, who was head coach then.\n\nMeanwhile, former Zimbabwe Premier Soccer League Soccer Star of the Year Denver Mukamba is training with Dynamos.\n\nMukamba is eyeing a return to Dembare after parting ways with the club in 2012.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17030319/WhatsApp-Image-2025-07-17-at-04.02.55.jpeg",
            "description": "<p>By Sports Reporter Relegation candidates Dynamos FC have signed three new foreign players in a move to beef up the squad. Dembare is currently in the relegation zone as they are second from bottom (17) on the log with 15 points, six ahead of Kwekwe United. The three new foreigners are two Ghanaian infield players,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-adds-foreign-players-in-effort-to-survive-relegation/\">Dynamos adds foreign players in effort to survive relegation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "17 Jul 2025"
        },
        {
            "title": "Withdrawal of donor funding a threat to Zimbabwe’s HIV financing; Health Ministry now seeks supplementary budget",
            "url": "https://www.newzimbabwe.com/withdrawal-of-donor-funding-a-threat-to-zimbabwes-hiv-financing-health-ministry-now-seeks-supplementary-budget/",
            "content": "By Anna Chibamu\n\nPermanant Secretary in the Ministry of Health and Child Care Dr Aspect Maunganidze says the United States withdrawal of funding for Zimbabwes healthcare sector, coupled with general donor fatigue, has disrupted the countrys HIV financing and programming.\n\nThe Trump administration withdrew funding by at least 85% worldwide earlier this year, severely affecting several poor countries, including Zimbabwe.\n\nGiving oral evidence to the Joint Portfolio Committee on Health and Child Care and the Thematic Committee on HIV and AIDS on HIV financing this Tuesday, Maunganidze said the reduced financing due to donor withdrawal had forced the ministry to re-strategise its funding mechanisms.\n\nHe told the committees that the ministry had written to Treasury seeking a supplementary budget to close the funding gap created by the US withdrawal and donor fatigue, in order to strengthen the national HIV response.\n\nThe main challenges in HIV and AIDS funding have always included some funding gaps, regardless of donor support or otherwise. Even ensuring that our strategic plan is truly a national HIV strategic plan that is sustainable, particularly in HIV prevention and related initiatives, has been difficult.\n\nHowever, the major threat right now is the withdrawal of donor funding.\n\nWhat we have observed globally is a general fatigue in donor funding. Whether it comes through the UN, the Global Fund, or other partners, this fatigue is concerning. There are now many competing global health and humanitarian challenges that have emerged in recent years, not just HIV and AIDS.\n\nThis has unfortunately been compounded by the abrupt withdrawal of funding from one of our key donorsthe US government, Maunganidze said.\n\nHe explained that the US had been supporting HIV funding through PEPFAR (Presidents Emergency Plan for AIDS Relief) and by contributing significantly to the Global Fund.\n\nThe US government contributes 30% of the Global Fund, which supports HIV, TB, and malaria interventions.\n\nThrough PEPFAR and US implementing agencies like the CDC and the Presidents Malaria Initiative, this sudden funding withdrawal has had significant consequences for our healthcare services, he said.\n\nMaunganidze also outlined Zimbabwes domestic and international HIV financing models.\n\nDomestically, we rely on the national budget allocation and the Health Levy (a 5% tax on mobile data and airtime), which supports various programs, including HIV.\n\nWeve also introduced specific taxes through the main budgetlike the recently implemented Health Sugar Levyto help strengthen our HIV response, he said.\n\nOn the international front, Maunganidzecited continued support from the Global Fund, the Health Development Fund, and donors such as the Bill and Melinda Gates Foundation.\n\nHe added that the ministry also works with the United Nations and follows UNAIDS Fast-Track commitments for 2020 and 2026, which aim to strengthen HIV responses in the country.\n\nIn general, partners contribute between 50% and 65% of funding for our HIV response.\n\nWhen looking at the overall health budget, development partners have contributed between 35% and 45%, and in some years, even beyond 50%, he noted.\n\nFollowing the US funding withdrawal announced on January 20, 2025, the government responded by announcing on May 15, 2025, intensified efforts to mobilise more domestic resources and laid out a roadmap to strategically boost local HIV drug production.\n\nI must say we are okay on HIV funding until at least January 20, 2026. The same applies to TB and malaria medicines.\n\nHowever, we must continue ensuring that our local revenue streams support a sustained HIV response so that we maintain our gains, particularly on the 95-95-95 UN targets, which we have already achieved.\n\nSince January, over 5,000 HIV-related deaths have been recorded, raising serious concerns about the governments need to increase investment in HIV financing and programming.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16170027/Dr-Aspect-Maunganidze.jpeg",
            "description": "<p>By Anna Chibamu Permanant Secretary in the Ministry of Health and Child Care Dr Aspect Maunganidze says the United States’ withdrawal of funding for Zimbabwe’s healthcare sector, coupled with general donor fatigue, has disrupted the country’s HIV financing and programming. The Trump administration withdrew funding by at least 85% worldwide earlier this year, severely affecting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/withdrawal-of-donor-funding-a-threat-to-zimbabwes-hiv-financing-health-ministry-now-seeks-supplementary-budget/\">Withdrawal of donor funding a threat to Zimbabwe’s HIV financing; Health Ministry now seeks supplementary budget</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "17 Jul 2025"
        },
        {
            "title": "Government to set caps on private healthcare fees, mandates emergency treatment access",
            "url": "https://www.newzimbabwe.com/government-to-set-caps-on-private-healthcare-fees-mandates-emergency-treatment-access/",
            "content": "By Staff Reporter\n\nGOVERNMENT has announced that fees at private health institutions will be subject to prescribed maximum limits and percentage increases, unless specifically approved by the Minister responsible for health.\n\nPresenting the Bill during its second reading in the National Assembly on Tuesday, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi said the legislation seeks to align the Medical Services Act with the fundamental principles enshrined in the Constitution.\n\nThis Bill, Mr Speaker Sir, is a testament of our commitment to ensuring that every citizen and permanent resident of our nation has access to essential health services.\n\nThe memorandum accompanying this Bill clearly outlines its primary objective, that is to uphold constitutional rights related to health and these rights are clearly stipulated in the Constitution, said Ziyambi.\n\nA key provision of the Bill, Clause 9, proposes amendments concerning fees and charges at private health institutions.\n\nZiyambi revealed that under the new amendments, no private hospital authority may impose fees exceeding prescribed amounts or increase fees beyond prescribed percentages without the Ministers approval.\n\nSubsection 1 stated that no responsible authority at a private hospital should impose fees above a prescribed amount or increase them by more than a prescribed percentage except with the approval of the Minister, he said.\n\nIt also included a proviso that paragraph A, imposing fees above a prescribed amount, would not apply to fees already being charged immediately before a fixed date.\n\nThe amendment in this Bill repeals this provision. Fees and charges at private health institutions, regardless of when they were first introduced, will be subject to the prescribed maximums and percentage increases unless specifically approved by the Minister. This change ensures greater oversight and control over the cost of private healthcare, aiming to protect patients from exorbitant charges, said Ziyambi further.\n\nThe proposed law will likely impact the operations of private medical facilities, which have assisted in alleviating the burden being suffered by Public facilities.\n\nAs public hospitals are in dire straits, citizens are left at the mercy of private institutions which are better equipped to cater for sick patients.\n\nClause 10 of the bill further empowers the Minister to enact regulations relating to healthcare for children, persons with chronic illnesses, liberation war veterans, and persons with disabilities.\n\nIt also provides for the establishment of healthcare packages at various service levels and the creation of a National Consultative Health Forum to facilitate public consultation.\n\nOther significant provisions include Clause 7, which broadens grounds for non-discrimination in healthcare, aligning with Section 56(3) of the Constitution, thereby reinforcing the Governments commitment to inclusive healthcare for all.\n\nZiyambi said the new Section 12(a), introduced by Clause 8, which prohibits private health institutions from refusing emergency medical treatment is of utmost importance.\n\nPerhaps, Mr. Speaker, one of the most impactful provisions is the new Section 12(a), inserted by Clause 8, which prohibits the refusal of emergency medical treatment by private health institutions, aligning with Section 76, Subsection 3 of the Constitution.\n\nThis mandates private institutions to admit patients suffering from life-threatening conditions for a period of not less than 48 hours for stabilisation, even if they cannot afford treatment. This is a lifeline for many and the Bill also allows for agreements between the Minister and private institutions for cost recovery, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/29054941/Doctor.jpg",
            "description": "<p>By Staff Reporter GOVERNMENT has announced that fees at private health institutions will be subject to prescribed maximum limits and percentage increases, unless specifically approved by the Minister responsible for health. Presenting the Bill during its second reading in the National Assembly on Tuesday, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi said the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-to-set-caps-on-private-healthcare-fees-mandates-emergency-treatment-access/\">Government to set caps on private healthcare fees, mandates emergency treatment access</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "17 Jul 2025"
        },
        {
            "title": "Zimbabwe partners with Chinese firms for construction of landmark $270m lithium plant",
            "url": "https://www.newzimbabwe.com/zimbabwe-partners-with-chinese-firms-for-construction-of-landmark-270m-lithium-plant/",
            "content": "Business Insider Africa\n\nZimbabwes state-owned Kuvimba Mining House is set to begin construction of a $270 million lithium concentrator at its Sandawana mine in the third quarter of 2025.\n\nAccording to CEO Trevor Barnard, the commissioning is targeted for early 2027.\n\nThe project, designed to process 600,000 metric tons of lithium ore annually, will be developed in partnership with two major Chinese metals companies,Reutersreported.\n\nUnder the agreement, the Chinese partners will build and operate the plant for at least five years before handing it over to Kuvimba. Barnard declined to disclose the names of the firms, citing ongoing negotiations.\n\nWe are still finalising the last few agreements that we need to put in place and making sure we have all the necessary and compatible industry conditions for our partner to start construction, Barnard said.\n\nWe are looking at breaking ground in the third quarter, he added.\n\nBarnard noted that the planned completion of the $270 million Sandawana lithium concentrator could align with a rebound in lithium prices.\n\nAlthough spot prices have since plunged by nearly 90% due to oversupply and weaker-than-expected EV demand, Chinese companies continue to invest heavily in Zimbabwes lithium sector to secure feedstock for their domestic refineries.\n\nAccording to data from CRU Group, Zimbabwe accounted for roughly 14% of Chinas lithium imports last year.\n\nAnalysts suggest that the current price slump may not last. Recent production cuts, paired with a rebound in EV sales in China, are expected to tighten the market, with lithium demand potentially outpacing supply by the end of the year.\n\nOur forecast is that lithium prices will recover sometime in the year 2027, right at a point in time when we expect the concentration plant to be in production, Barnard said.\n\nLast month, Zimbabwe,Africas leading lithium producer, announced plans to ban the export of lithium concentrates starting January 2027, as part of a broader strategy to boost local value addition in the mining sector.\n\nFor years, Chinese firms operating in Zimbabwe have exported lithium concentrates to China for refining, bypassing local processing.\n\nAs part of its industrialisation drive, Zimbabwe revealed that two lithium sulphate processing plants are currently under development.\n\nOne is at Bikita Minerals, owned by Chinas Sinomine Resource Group, and the other at Prospect Lithium Zimbabwe, operated by Zhejiang Huayou Cobalt.\n\nInterest in lithium is surging across Africa. Countries like Namibia, Mali, Ghana, and the Democratic Republic of the Congo (DRC) are ramping up exploration and mining efforts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17033731/Screenshot-2025-07-17-at-04.37.13.png",
            "description": "<p>Business Insider Africa Zimbabwe’s state-owned Kuvimba Mining House is set to begin construction of a $270 million lithium concentrator at its Sandawana mine in the third quarter of 2025. According to CEO Trevor Barnard, the commissioning is targeted for early 2027. The project, designed to process 600,000 metric tons of lithium ore annually, will be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-partners-with-chinese-firms-for-construction-of-landmark-270m-lithium-plant/\">Zimbabwe partners with Chinese firms for construction of landmark $270m lithium plant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "17 Jul 2025"
        }
    ]
}