{
    "news": [
        {
            "title": "UK: Some migrants to face 20 year wait for settled status",
            "url": "https://www.newzimbabwe.com/uk-some-migrants-to-face-20-year-wait-for-settled-status/",
            "content": "BBC\n\nMigrants who are in the UK legally could have to wait up to 20 years before they can settle permanently, under government proposals.\n\nThe Home Secretary Shabana Mahmood has announced the qualifying period for indefinite leave to remain will be extended from five to 10 years, and will apply to the estimated 2.6 million who arrived since 2021.\n\nThe changes will not apply to people who had already obtained settlement.\n\nMahmood said becoming part of the UK was not a right but a privilege  and one that must be earned.\n\nThe package is the latest in a string of changes to the immigration system announced by Mahmood over the past week.\n\nSettlement, also known as Indefinite Leave to Remain (ILR), allows someone to live in the UK permanently, work without restrictions and access public services. It is also a key step towards British citizenship.\n\nCurrently, most work and family visa holders can apply for settlement after five years.\n\nUnder the proposed changes the standard wait will be 10 years  with a range of criteria that would lengthen or shorten that period.\n\nLegal migrants who claim benefits for less than 12 months will have to wait 15 years\n\nPeople who arrived on post-Brexit health and social care visas would have to wait 15 years, up from five year currently\n\nMigrants reliant on benefits for more than 12 months face a 20-year wait for settlement, four times more than the current period and the longest in Europe\n\nThere is also a reduction to three years for applicants who earn 125,140 in the three years prior to applying for settlement, with this reduced to five years for anyone earning 50,270.\n\nTime spent volunteering and competency in the English language are also factors which could reduce the wait.\n\nAnnouncing the changes in the Commons, Mahmood said: Migration will always be a vital part of Britains story.\n\nBut the scale of arrivals in recent years has been unprecedented.\n\nConservative shadow home secretary Chris Philp accused Labour of copying and pasting policies from his party that it had previously voted against.\n\nPhilp said his part would support the changes, but warned the new system could create loopholes and urged ministers to adopt a migration cap.\n\nReform UK did not respond to the statement in the Commons. But the party has previously announced it would abolish ILR  replacing it with visas that migrants must reapply for every five years.\n\nThat includes hundreds of thousands of migrants currently in the UK.\n\nHome Office figures show net migration added 2.6 million people to UK population between 2021 and 2024.\n\nBecause of this, settlement grants are also expected to spike over the next five years, with around 1.6 million people forecast to settle between 2026 and 2030.\n\nMinisters plan to introduce an earned settlement system, requiring migrants to demonstrate social integration, economic contribution and good character before being granted settled status.\n\nApplicants will need to meet stricter minimum requirements including the equivalent to A-level standard English language, a clean criminal record and earning above 12,570 a year for at least three years.\n\nThere will be accelerated routes for those who make an outsized contribution to the UK.\n\nDoctors and nurses working in the NHS will be able to settle after five years. The brightest and best international talent could have settlement fast-tracked, with high earners and entrepreneurs able to stay after just three years.\n\nFamily members will not gain automatic status when the main applicant qualifies. Children who came to the UK under the age of 18 may settle with parents, but older dependants could face separate requirements.\n\nExisting fast-track routes for victims of domestic abuse, bereaved partners and resettled refugees will remain.\n\nPublic service union Unison said the changes would be devastating to thousands of essential workers and put services at risk.\n\nChristina McAnea, Unisons general secretary, said: Forcing staff, many of whom stepped up during Covid, to wait 15 years for certainty about their futures betrays the promises they were made.\n\nMs McAnea warned the government not to overlook the care workers, nursing assistants and school support staff from overseas as without them care services would collapse.\n\nThe changes build on measures first set out in the governments May white paper.\n\nThe government plan to roll out changes from spring 2026, after a consultation ends on 12 February.\n\nOn Monday, Mahmood announced a sweeping overhaul of the UKs asylum system  including plans to end permanent refugee status and replace it with temporary status subject to review every 30 months.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/21063737/7298f1264a780b47097ab7f8cd314d81Y29udGVudHNlYXJjaGFwaSwxNzU3MzQzNTY3-2.81449229.jpg",
            "description": "<p>BBC Migrants who are in the UK legally could have to wait up to 20 years before they can settle permanently, under government proposals. The Home Secretary Shabana Mahmood has announced the qualifying period for indefinite leave to remain will be extended from five to 10 years, and will apply to the estimated 2.6 million</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-some-migrants-to-face-20-year-wait-for-settled-status/\">UK: Some migrants to face 20 year wait for settled status</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Runde Bridge to temporarily close Sunday for asphalt overlay",
            "url": "https://www.newzimbabwe.com/runde-bridge-to-temporarily-close-sunday-for-asphalt-overlay/",
            "content": "By Alois Vinga\n\nRunde Bridge will on Sunday be temporarilyclosed to pave way for critical asphalt overlay, the Ministry of Transport and Infrastructure Development has said.\n\nZimbabwe is currently implementing an aggressive roads rehabilitationdriven by the EmergencyRoadRehabilitation Programme (ERRP), initiated after a 2021 state of national disaster declaration due to poorroadinfrastructure.This program focuses on repairing a significant portion of theroadnetwork, aiming to improve safety, stimulate economic activity and connect communities to essential services like health, education, and markets.\n\nTo date, majorroaduplifts have been undertaken along the countrys major highways.\n\nIn a statement, the Transport Ministry announced plans to temporarily close the Runde bridge to pave way for rehabilitation works.\n\nMotorists are advised of a scheduled full closure of the Runde Bridge. The 80-minute closure is necessary to perform a critical asphalt overlay, ensuring the long-term safety and integrity of the structure. The bridge is located at a chainage 105km from Masvingo towards Beitbridge on the Harare-Masvingo-Beitbridge Road, the statement reads.\n\nThe work is scheduled to take place on either Saturday, 22 November 2025, or Sunday, 23 November 2025, between 10:00 AM and 3:00 PM (1000HRS  1500HRS) with the final date and precise start time contingent upon favorable weather conditions.\n\nMotorists have been advised to anticipate significant delays and to plan their journeys accordingly or seek alternative routes to avoid delays.\n\nWe sincerely apologize for any inconvenience caused by this essential maintenance and appreciate the publics understanding as we work to improve our national transport infrastructure. Any updates will be communicated through official channels, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/16192007/Felix-Mhona-e1760323422657.jpg",
            "description": "<p>By Alois Vinga Runde Bridge will on Sunday be temporarily closed to pave way for critical asphalt overlay, the Ministry of Transport and Infrastructure Development has said. Zimbabwe is currently implementing an aggressive roads rehabilitation driven by the Emergency Road Rehabilitation Programme (ERRP), initiated after a 2021 state of national disaster declaration due to poor road infrastructure. This program focuses on repairing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/runde-bridge-to-temporarily-close-sunday-for-asphalt-overlay/\">Runde Bridge to temporarily close Sunday for asphalt overlay</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Miss Universe 2025 Top 30: Lyshanda Moyas makes the cut",
            "url": "https://www.newzimbabwe.com/miss-universe-2025-top-30-lyshanda-moyas-makes-the-cut/",
            "content": "Hola\n\nAfter weeks filled with excitement and controversies, the big day has finally arrived, the 74th edition of Miss Universe, where only one of the 130 contestants will be crowned the most beautiful woman in the world and the worthy successor of Denmarks Victoria Kjr Theilvig.\n\nAll eyes are on the stage of Impact Arena in Pak Kret, Thailand, where just one participant will take home the title.\n\nThe preliminary phase consisted of private interviews with the judges as well as the official swimsuit, national costume, and evening gown presentations. Now, the moment has come to reveal theTop 30 semifinalists.\n\nAfterward, theTop 12will be announced, followed by theTop 5 finalists. In the final round, the five candidates will answer questions live in front of the audience and the judging panel.\n\nIn the end, the second runner-up, first runner-up, and the new Miss Universe will be crowned.\n\nThe winner will be crowned byVictoria Kjr Theilvig, who will place on her head the Lumire de lInfini crown (Light of Infinity). The piece was handcrafted by Filipino master artisans using traditional techniques from Place Vendme, the heart of French elegance.\n\nIts color is inspired by the rare South Sea golden pearl, the National Gem of the Philippines, and the crown features 23 of these pearls, giving it a feminine, unique, and elegant touch.\n\nBefore the start of the competition, the event began with aminute of silencein memory of Thailands Queen MotherSirikit Kitiyakara, who died on October 24, 2025, at the age of 93. Throughout the pageant events, several contestants wore black ribbons on their sashes as a sign of respect.\n\nThe gala opened with a performance by Thai singerJeff Satur, who gave his all on stage, accompanied by dancers dressed in white. Afterwards, more than 120 contestants made their entrance.\n\nAfter Saturs musical performance, it was time for the contestants to step to the microphone one by one. The host then introduced the judging panel, responsible for choosing the next Miss Universe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/21045941/lyshanda.jpg",
            "description": "<p>Hola After weeks filled with excitement and controversies, the big day has finally arrived, the 74th edition of Miss Universe, where only one of the 130 contestants will be crowned the most beautiful woman in the world and the worthy successor of Denmark’s Victoria Kjær Theilvig. All eyes are on the stage of Impact Arena</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miss-universe-2025-top-30-lyshanda-moyas-makes-the-cut/\">Miss Universe 2025 Top 30: Lyshanda Moyas makes the cut</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "‘Historic victory for reproductive justice’ – health group hails High Court ruling recognising mental health in abortion law",
            "url": "https://www.newzimbabwe.com/historic-victory-for-reproductive-justice-health-group-hails-high-court-ruling-recognising-mental-health-in-abortion-law/",
            "content": "By Mary Taruvinga\n\nThe High Court has delivered a landmark ruling declaring parts of Zimbabwes restrictive abortion law unconstitutional, siding with the Community Working Group on Health (CWGH) and Member of Parliament Nyasha Batitsa, who brought the challenge with human-rights lawyer Tendai Biti.\n\nJustice Sylvia Chirawu-Mugomba ruled that the Termination of Pregnancy Act, enacted in 1977, unlawfully excludes mental-health risk as a ground for lawful termination and fails to protect women with mental disabilities from pregnancies resulting from sexual exploitation.\n\nThe statutory omission creates a discriminatory regime, the judge wrote, adding that forcing women to carry pregnancies that cause grave mental-health consequences violates their rights to dignity, equality, humane treatment, bodily autonomy, and health. She stressed that the Constitution recognises health as physical, mental, and psychological well-being.\n\nCourt sides with CWGH and Batitsa\n\nCWGH and Batitsa had challenged section 4(a) and the definition of unlawful intercourse in section 2(1), arguing the law ignored modern constitutional and medical understanding of health and erased the vulnerability of institutionalised mental-health patients who cannot legally consent to sex.\n\nIn their filing, they argued: Section 4(a) unlawfully confines lawful termination to threats to physical health, ignoring that health includes mental and psychological well-being. They also warned that excluding pregnancies arising from sexual exploitation of mental-health patients fails to safeguard the dignity and bodily integrity of a particularly vulnerable group.\n\nJustice Chirawu-Mugomba agreed, finding that the law erased their lack of capacity to consent and, as a consequence, denied them access to lawful termination even in circumstances amounting to abuse.\n\nThe Court declared the offending provisions unconstitutional, but suspended the declaration for 18 months and referred the matter to the Constitutional Court for confirmation.\n\nA shift in Zimbabwes reproductive-rights landscape\n\nThe ruling marks what the Court described as a move away from a narrow, biomedical model of abortion focused only on physical survival, toward a constitutional model grounded in dignity, equality, and holistic health.\n\nThe Courts effects-based analysis, drawing on comparative jurisprudence from South Africa and Canada, recognised mental health as an integral component of the constitutional right to health, and held that statutory frameworks must evolve with contemporary medical understanding.\n\nCWGH welcomes historic victory\n\nThe Community Working Group on Health welcomed the judgment, calling it a breakthrough for women whose suffering has long been invisible under the law.\n\nThis is a historic victory for reproductive justice, CWGH said in response to the ruling. The Court has affirmed that mental-health endangerment must be recognised alongside physical risk, and that women with mental disabilities are entitled to equal protection from sexual exploitation and its consequences.\n\nThe organisation said the decision creates a clear mandate for Parliament, health authorities, and civil society to ensure abortion services are accessible and responsive to the realities of women living with mental disabilities.\n\nNext steps for Parliament\n\nOnce the Constitutional Court confirms the ruling, Parliament will be required to amend the Termination of Pregnancy Act to include mental-health risk as a lawful ground for termination and expand the definition of unlawful intercourse to include sexual exploitation of mental-health patients, conduct already criminalised under the Mental Health Act.\n\nWith the judgment now on record, legal observers say Zimbabwe has taken a decisive step toward modernising reproductive-health law in line with constitutional values and regional obligations under the Maputo Protocol, CEDAW, and the African Charter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/22115253/abortion-law-.jpg",
            "description": "<p>By Mary Taruvinga The High Court has delivered a landmark ruling declaring parts of Zimbabwe’s restrictive abortion law unconstitutional, siding with the Community Working Group on Health (CWGH) and Member of Parliament Nyasha Batitsa, who brought the challenge with human-rights lawyer Tendai Biti. Justice Sylvia Chirawu-Mugomba ruled that the Termination of Pregnancy Act, enacted in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/historic-victory-for-reproductive-justice-health-group-hails-high-court-ruling-recognising-mental-health-in-abortion-law/\">‘Historic victory for reproductive justice’ – health group hails High Court ruling recognising mental health in abortion law</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Harare records over 500 cases of hand, foot and mouth disease",
            "url": "https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/",
            "content": "By Thandiwe Garusa\n\nTHE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10.\n\nIn a public notice issued Thursday, the local authority said the viral infection has been detected largely in Mabvuku, Mbare, Budiriro and Waterfalls, warning that the disease is highly contagious and spreads through direct contact with blisters or droplets from coughing and sneezing.\n\nSo far 501 cases have been recorded mainly in Mabvuku, Mbare, Budiriro and Waterfalls.\n\nNo deaths have been recorded and those with the symptoms are advised to report to the nearest clinic or hospital, the notice reads.\n\nAlthough HFMD is described as self-limiting, meaning it usually resolves on its own, the City of Harare urged parents and guardians to take symptoms seriously and seek medical assistance.\n\nThe disease is self-limiting and treatment is for symptoms.\n\nThe public is advised to avoid direct contact with those showing symptoms as it is a highly contagious disease, the notice added.\n\nThe city further advised residents to ensure any child showing signs of infection receives immediate medical attention.\n\nWe urge residents to immediately take children with symptoms of the disease to the clinic.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20184945/hand-foot-and-mouth.jpg",
            "description": "<p>By Thandiwe Garusa THE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10. In a public notice issued Thursday, the local authority said the viral infection has been detected largely in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/\">Harare records over 500 cases of hand, foot and mouth disease</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Zimbabwean national nabbed trying to smuggle illicit cigarettes into SA",
            "url": "https://www.newzimbabwe.com/zimbabwean-national-nabbed-trying-to-smuggle-illicit-cigarettes-into-sa/",
            "content": "The Citizen\n\nThe Border Management Authority (BMA) has intercepted a truck driven by a Zimbabwean national arriving from Zimbabwe with a consignment of illicit cigarettes and tobacco products destined for the South African market.\n\nThe vehicle with its cargo was seized during a targeted operation in the early hours of Wednesday, 19 November 2025, at the Beitbridge commercial port of entry.\n\nThe commissioner of the Border Management Authority (BMA), Dr Michael Masiapato, confirmed the significant seizure of the goods.\n\nAccording to the BMA, at approximately 1am, guards used technology to intercept the fully laden truck.\n\nJunior guards exercised full operational vigilance using the BMAs newly acquired video scope inspection toolkit to inspect a commercial truck arriving from Zimbabwe. Thanks to this new technology that provided advanced imaging, the officials detected a concealed load, prompting a physical inspection, which uncovered 14 master boxes of Remington Gold cigarettes.\n\nThe BMA said the use of its new cargo scanner was decisive in detecting this illicit load, underscoring the value of continued investment in modern border control technology.\n\nThe efforts of our junior border guards continue to ensure coordinated, rapid response. The joint operations approach that needs to be implemented by law enforcement working in vulnerable areas is central to disrupting sophisticated smuggling networks.\n\nDr Masiapato condemned the illicit trade of tobacco products.\n\nIllicit tobaccodeprives the South African Revenue Service (Sars) of critical revenue. By intercepting such consignments, the BMA helps to safeguard tax integrity and public finances. Beyond the immediate financial loss, illicit cigarettes pose health risks and fuel organised crime, Dr Masiapato said.\n\nWith the festive season around the corner, the BMA is expected to be on high alert at all South Africas border points of entry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20170525/Illicit-Cigarettes.jpg",
            "description": "<p>The Citizen The Border Management Authority (BMA) has intercepted a truck driven by a Zimbabwean national arriving from Zimbabwe with a consignment of illicit cigarettes and tobacco products destined for the South African market. The vehicle with its cargo was seized during a targeted operation in the early hours of Wednesday, 19 November 2025, at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-national-nabbed-trying-to-smuggle-illicit-cigarettes-into-sa/\">Zimbabwean national nabbed trying to smuggle illicit cigarettes into SA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "Advocate Mpofu Retraction and Apology",
            "url": "https://www.newzimbabwe.com/advocate-mpofu-retraction-and-apology/",
            "content": "NewZimbabwe.com unreservedly retracts and apologises for an article published under the headline Leaked letter accuses judge, top lawyer of conflict of interest. The article was based on an anonymous letter alleging a conflict of interest between High Court Judge, Justice Priscilla Munangati-Manongwa, and Advocate Thabani Mpofu.\n\nBy publishing the story without affording Advocate Mpofu his right of response, we fell short of the standards of fairness, balance, and accuracy that we are duty-bound to uphold.\n\nAdvocate Mpofu has since issued a detailed rebuttal, which we have prominently reproduced and acknowledge as central to setting the record straight.\n\nIn his response, Advocate Mpofu strongly dismissed the allegations, saying:\n\nThe letter which founds the story is simply false. Three cases have been identified. I absolutely have nothing to do with the first two cases, was never briefed on them and, naturally, never appeared before the judge or any judge for that matter. The names are completely foreign to me and have never been revealed even in my power naps.\n\nHe clarified that in the third matter mentioned in the letter, he was briefed by a completely different well-established firm, adding that the litigant he represented has never been Sikhumbuzos client and he has never been involved in that matter in any way, shape, form or size. He further stated that the matter never proceeded as it was withdrawn.\n\nResponding to suggestions that he has a close relationship with one Webster Chikwanha, Advocate Mpofu said, I do not know who Webster Chikwanha is I have no friend by the name Webster. I have no friend by the name Chikwanha. No complaint has ever been raised against me which the Webster Chikwanha would have suppressed.\n\nNewZimbabwe.com acknowledges that Advocate Mpofus right to be heard should have been sought before publication. We also accept that the anonymous allegations did not meet the threshold required for reporting without corroboration.\n\nWe unreservedly apologise to Advocate Thabani Mpofu and Justice Munangati-Manongwa for the distress and reputational harm caused.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20165137/retracted-1.webp",
            "description": "<p>NewZimbabwe.com unreservedly retracts and apologises for an article published under the headline “Leaked letter accuses judge, top lawyer of conflict of interest.” The article was based on an anonymous letter alleging a conflict of interest between High Court Judge, Justice Priscilla Munangati-Manongwa, and Advocate Thabani Mpofu. By publishing the story without affording Advocate Mpofu his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/advocate-mpofu-retraction-and-apology/\">Advocate Mpofu Retraction and Apology</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        },
        {
            "title": "US wants to join G20 summit, end boycott: South Africa",
            "url": "https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/",
            "content": "AFP\n\nWashington had said it would not take part in the 22-23 November summit because it objected to the priorities for the meeting set by South Africa, which holds the G20s rotating presidency this year.\n\nWe have received notice from the United States, a notice which we are still in discussions with them over, about a change of mind about participating in one shape, form or other in the summit, Ramaphosa told reporters.\n\nThis comes at the late hour before the summit begins. And so therefore, we do need to engage in those types of discussions to see how practical it is and what it finally really means, he said.\n\nAll countries are here, and the United States, the biggest economy in the world, needs to be here, he said.\n\nSo its pleasing to hear that there is a change of approach, and so we are still discussing how that will manifest.\n\nUS President Donald Trump has singled out South Africa for harsh treatment on a number of issues since he returned to the White House in January, notably making debunked claims of white Afrikaners being systematically killed and slaughtered in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20172724/ramaphosa.jpg",
            "description": "<p>AFP The United States has had a “change of mind” about boycotting the G20 summit in Johannesburg this weekend and wanted to take part in some form, South African President Cyril Ramaphosa said Thursday. Washington had said it would not take part in the 22-23 November summit because it objected to the priorities for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/\">US wants to join G20 summit, end boycott: South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "21 Nov 2025"
        }
    ]
}