{
    "news": [
        {
            "title": "Crisis looms as Treasury slashes Health Ministry’s 2026 national budget bid",
            "url": "https://www.newzimbabwe.com/crisis-looms-as-treasury-slashes-health-ministrys-2026-national-budget-bid/",
            "content": "By Anna Chibamu\n\nA major funding crisis is looming in Zimbabwes public health sector after the Ministry of Health and Child Care was directed by Treasury to cut its 2026 national budget bid, further threatening already-strained health services.\n\nPresenting the ministrys 2025 budget performance, priorities, and 2026 bids to a joint sitting of the Parliamentary Portfolio Committee on Health and the Thematic Committee on Health, Permanent Secretary for Health, Aspect Maunganidze, revealed that Treasury had capped the 2026 allocation at just ZWL$24.19 billion, representing only 28% of the ministrys initial request.\n\nWe have been advised that our cap for allocation will be ZWL$24.19 billion. This speaks to about only 28%. If you recall our 2025 figures, we requested about ZWL$94 billion and got around ZWL$28 billion, roughly 30%. So, this years allocation is actually lower than that of 2025, Maunganidze said.\n\nOut of the ministrys four major programmes: Policy and Administration, Public Health, Curative Services and Biomedical Engineering, Science, Pharmaceuticals and Biopharmaceutical Protection, the total budget bid for 2026 stands at ZWL$85.3 billion.\n\nMaunganidze explained that the ministry made a ZWL$94.9 billion bid in 2024, but only received ZWL$28.3 billion, or 30% of its needs. This allocation, he said, remained well below the Abuja Declaration target, which recommends that at least 15% of national budgets be allocated to health.\n\nOver the years, our health budget allocation has ranged from as low as 9.82% in 2024 to between 12% and 25% in 20212023. The 2025 allocation of 13.01% was actually the highest in the last five years, said Maunganidze.\n\nOf the ZWL$27.2 billion allocated for 2025, the ministry had received ZWL$11.4 billion by September, just 41% of the total expected.\n\nThis is what we have received up to the end of September 2025. The question has always been, even though we received little, are we utilising it? Of that $11.4 billion, we have spent about $10.5 billion, representing 92% utilisation, the permanent secretary added.\n\nMaunganidze also warned that the countrys health financing landscape has worsened since 2020, partly due to reduced donor support.\n\nThis has resulted in the need for much more robust resource mobilisation. Its a challenge that has always been looming, but for sustainable health interventions, we must invest locally, he said.\n\nDespite the financial challenges, Maunganidze highlighted notable improvements, including increased life expectancy, achievement of HIV/AIDS targets and progress in human resource development.\n\nWe have seen a marked improvement in several health indicators despite the challenges. Our life expectancy has gone up; women still live longer than men, as usual. Our HIV/AIDS targets have been achieved, and we are continuing to upskill our health workforce, he said.\n\nHowever, the situation has been further compounded by significant cuts in U.S. funding, particularly from the United States Agency for International Development (USAID) and the Presidents Emergency Plan for AIDS Relief (PEPFAR). These programmes have historically supported Zimbabwes HIV, tuberculosis, and maternal health efforts.\n\nThe reduction in donor financing has widened the countrys health funding gap, putting essential services such as drug procurement, HIV prevention, and maternal care at greater risk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on-e1746463851506.jpg",
            "description": "<p>By Anna Chibamu A major funding crisis is looming in Zimbabwe’s public health sector after the Ministry of Health and Child Care was directed by Treasury to cut its 2026 national budget bid, further threatening already-strained health services. Presenting the ministry’s 2025 budget performance, priorities, and 2026 bids to a joint sitting of the Parliamentary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crisis-looms-as-treasury-slashes-health-ministrys-2026-national-budget-bid/\">Crisis looms as Treasury slashes Health Ministry’s 2026 national budget bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "23 Oct 2025"
        },
        {
            "title": "Nurse Bridget Makaza jailed 27 years for cold-blooded murder of her husband",
            "url": "https://www.newzimbabwe.com/nurse-bridget-makaza-jailed-27-years-for-cold-blooded-murder-of-her-husband/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Emelia Muchawa has sentenced Harare nurse Bridget Makaza to 27 years in prison for the cold-blooded murder of her husband, Kurai Bus company owner Macloud Zvavovaviri Mapanga, whom she shot three times as he slept in their Strathaven home in 2018.\n\nMakaza was last week convicted of what the court described as a calculated act of vengeance fuelled by jealousy, polygamy and deceit. Justice Muchawa said Makaza executed her husband and then staged a fake robbery to conceal the crime.\n\nThe accused unlawfully and with intent to kill, executed her husband while he slept, ruled Justice Muchawa. She aimed at the upper part of his body and delivered three fatal shots, then staged an armed robbery to cover her tracks.\n\nWhen handing down the sentence, the judge said:\n\nWhereupon, after reading documents filed of record and hearing counsel, it is ordered that the offender who was found guilty of murder as defined in section 47 (1) of the Criminal Law (Codification and Reform) Act [Chapter 9:23] is hereby sentenced to 27 (twenty-seven) years imprisonment.\n\nThe court heard Makaza used a .38 Amadeo Rossi revolver with an erased serial number, smuggled from South Africa under the pretext of buying medication. After killing her husband, she screamed Thief! Thief! and falsely claimed robbers had stolen US$12,000.\n\nProsecutor B. Murevanhema said, There were no robbers. There was no break-in. The story was a fabrication to mask premeditated murder.\n\nPolice investigations confirmed there were no signs of forced entry. The firearm and gloves were later recovered from a swamp in Belvedere after Makaza led detectives to the spot.\n\nMakaza fled to South Africa after being granted bail and was re-arrested in December 2024 upon returning to Zimbabwe, claiming she missed her children.\n\nDuring the trial, she claimed self-defence, alleging her husband tried to attack her, but the judge dismissed this as a lame and incredible fabrication. Forensic expert Admire Mutizwa testified that the revolver required deliberate trigger pressure and could not have discharged accidentally.\n\nJustice Muchawa concluded that Makaza procured the weapon, waited for her husband to sleep, and executed him in cold blood.\n\nShe was methodical, the judge said. Her conduct before, during, and after the murder shows beyond doubt that this was a planned execution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23063548/Bridget-Makaza-1.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Emelia Muchawa has sentenced Harare nurse Bridget Makaza to 27 years in prison for the cold-blooded murder of her husband, Kurai Bus company owner Macloud Zvavovaviri Mapanga, whom she shot three times as he slept in their Strathaven home in 2018. Makaza was last week convicted of what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nurse-bridget-makaza-jailed-27-years-for-cold-blooded-murder-of-her-husband/\">Nurse Bridget Makaza jailed 27 years for cold-blooded murder of her husband</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "23 Oct 2025"
        },
        {
            "title": "Blow for Dynamos as Denver Mukamba is ruled out of Chibuku Cup semi-final clash against Highlanders",
            "url": "https://www.newzimbabwe.com/blow-for-dynamos-as-denver-mukamba-is-ruled-out-of-chibuku-cup-semi-final-clash-against-highlanders/",
            "content": "By Sports Reporter\n\nDynamos FC have suffered a major setback ahead of Sundays Chibuku Super Cup semi-final, with star midfielder Denver Mukamba ruled out through suspension.\n\nMukamba, who has been instrumental since rejoining the club in July, will miss the crucial encounter after accumulating five yellow cards, triggering an automatic one-match ban under league regulations.\n\nDynamos will also be without striker Jairos Kasondo, who is suspended for the same reason. Kasondo was Dembares hero last Sunday, scoring the equaliser in their 11 draw against Highlanders at Barbourfields Stadium.\n\nThe semi-final showdown comes as both traditional giants search for redemption following inconsistent league performances that have left them hovering near the lower half of the table.\n\nHead-to-head in league competitions, Dynamos have not beaten Highlanders in open play since 2015, adding extra pressure ahead of Sundays clash.\n\nHowever, Dembare have already made history by becoming the first team to reach the Chibuku Super Cup semi-finals for three consecutive seasons, a feat they will be hoping to build on despite the absence of two key players.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23062100/mukamba_denver.jpg",
            "description": "<p>By Sports Reporter Dynamos FC have suffered a major setback ahead of Sunday’s Chibuku Super Cup semi-final, with star midfielder Denver Mukamba ruled out through suspension. Mukamba, who has been instrumental since rejoining the club in July, will miss the crucial encounter after accumulating five yellow cards, triggering an automatic one-match ban under league regulations.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blow-for-dynamos-as-denver-mukamba-is-ruled-out-of-chibuku-cup-semi-final-clash-against-highlanders/\">Blow for Dynamos as Denver Mukamba is ruled out of Chibuku Cup semi-final clash against Highlanders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "23 Oct 2025"
        },
        {
            "title": "The Invisible Chain: The unspoken bond driving Zimbabwean migration to South Africa",
            "url": "https://www.newzimbabwe.com/the-invisible-chain-the-unspoken-bond-driving-zimbabwean-migration-to-south-africa/",
            "content": "By Siyabonga Hadebe\n\nTHE chorus is a familiar one, a relentless refrain in South Africas political and social discourse: illegal Zimbabweans are crossing the Limpopo in droves, stealing jobs from South Africans, social services like health and education and transforming the essence of the nation.\n\nThis narrative, politically potent and emotionally charged, is repeated in taxi ranks, talk radio shows and parliamentary debates.\n\nHowever, for all its volume, it is dangerously incomplete. It focuses on the symptom, the migrant, while wilfully ignoring the deep-seated historical and economic engine that actively imports this labour. The truth, far more complex and inconvenient, is that the migration of a significant number of Black Zimbabweans to South Africa is not a random, anarchic influx.\n\nIt is, rather, the tail end of a deeply entrenched, paternalistic economic system that packed its bags and moved across the Limpopo River, travelling in tandem with White Zimbabwean capital and social networks.\n\nTo understand the present crisis, we must first confront a forgotten, shared past and acknowledge the invisible chain that binds employer and employee across generations and borders.\n\nThe story does not start in 2000 with Zimbabwes land reforms but in the colonial state of Rhodesia. Many South Africans remain unaware that their northern neighbour operated a sophisticated system of controlled and bonded labour (serfdom). This system was, for all practical purposes, a mirror image of apartheid South Africas Masters and Servants Act and related laws.\n\nSouthern Rhodesia (from the 1890s to 1980) created a coercive system that functioned as bonded labour. The 1930 Land Apportionment Act confined the African majority to overcrowded reserves. Combined with compulsory poll taxes and restrictive pass laws, this engineered a cycle of poverty.\n\nAfrican men were systematically forced into migrant labour for White-owned mines and farms to survive. This structure, perfected after the 1923 shift to self-government, effectively bonded workers to employers through state-backed legal and economic coercion until the end of White minority rule.\n\nThe Rhodesian legal architecture, particularly the 1969 Masters and Servants Act (originally introduced in 1901), entrenched a rigid, paternalistic system. This legislation granted White landowners, farmers and businessmen near-total control over Black labourers lives, movement and economic prospects. This framework legally bound workers to their employers, criminalising breach of contract to ensure a cheap, captive workforce for the White minority economy.\n\nThis was not a simple, transactional employer-employee dynamic, but it was a comprehensive social and economic bond, forged in the crucible of White supremacy. The Rhodesian state meticulously constructed a world where Black life was subordinated to White economic needs, creating a dependency that extended beyond the workplace to include housing, food and a semblance of social welfare.\n\nThis system produced a specific psychology, a culture of paternalism where the White boss or madam was not just an employer but a patron, a provider and an authority figure whose influence permeated every aspect of a workers life. This relational model, born in the fields and homes of Rhodesia, is the original template, the blueprint that would later be exported.\n\nThe collapse of Rhodesia and the birth of Zimbabwe in 1980 did not erase this deeply ingrained system overnight. While the political landscape shifted, many of the economic and social patterns persisted through the 1980s and 1990s. However, the two great waves of White Zimbabwean migration were first, before and after independence.\n\nThen, more dramatically, during the botched land reforms of the 1990s and early 2000s, it acted as a catalyst for the transnational transfer of this relationship.\n\nWhen White Zimbabweans, also labelled Rhodies, relocated to South Africa, they did not come empty-handed. They brought their financial capital, their businesses and their professional networks. But crucially, they also brought their social capital: a ready-made, pre-vetted labour force. As scholarJames Muzondidya observes in his analysis of the Zimbabwean crisis, the displacement of White commercial farmers did not occur in a vacuum.\n\nThis displacement triggered a parallel and catastrophic displacement of the hundreds of millions of Black Zimbabweans whose entire lives and livelihoods were structurally tied to those farms. For these workers, the choice was not between staying in Zimbabwe or leaving; it was between utter destitution or following the only economic lifeline they had ever known.\n\nThis exodus was not a coincidence but a correlation. The capital of White Zimbabweans arrived in South Africa with hordes of cheap, attached labour. This explains the peculiar phenomenon we witness today across the northern provinces of South Africa and in its major urban centres.\n\nThese workers are not merely illegal immigrants but domestic slaves by descent, so they are attached to the family of their masters, for whom they worked continuously without pay.\n\nThe relationship between White Zimbabweans and Black Zimbabweans is akin to slavery in Mauritania, where light-skinned Arabs and Berbers (White Moors) own the dark-skinned Haratines. Arab and Berber families regard themselves as White and noble, while Black is synonymous with slave. Due to their long history, these Haratines not only speak the language of their White masters, Hassania (Mauritanian Arabic), but also constitute a significant class of bonded slaves.\n\nToday, White Zimbabweans are a visible and often successful part of the South African business landscape. They own and operate sprawling game farms in Limpopo, productive agricultural holdings in the Mpumalanga highveld and chic restaurants in the trendy suburbs of Johannesburg, Pretoria and Cape Town.\n\nAnd who is so often employed in these establishments? It is frequently the very same Zimbabweans who worked for them, or their extended family and village members, back home.\n\nThis is not a case of businesses opportunistically scooping up illegals from the streets of Hillbrow or Pretoria. However, it is the reactivation of a pre-existing, generational relationship. Sociologist Maxim Bolt documents this inseparable linkin his seminal ethnographic work,Zimbabwes Migrants and South Africas Border Farms.\n\nBolt spent years studying these communities and describes a world of interdependence that transcends international borders. He details how farmers who relocated from Zimbabwe to South Africas northern provinces deliberately recruited from their former workers networks, valuing their known skills, their trustworthiness and their understanding of the unspoken codes of this paternalistic dynamic.\n\nThe Black Zimbabweans who followed their formerboses(bosses) were not random economic migrants in the abstract sense. They were a known quantity, pre-socialised into a specific work ethic and hierarchy, making them the ideal, reliable helpers for both private homes and demanding upmarket enterprises. The relationship offers a perverse form of security for the employee  a familiar face in a foreign land, a guaranteed job and a place to stay.\n\nFor the employer, it offers a compliant, dependable workforce that understands their expectations without needing to be told. This system, however, perpetuates an inherently unequal power dynamic, locking both parties into a historical pattern that resists easy integration into South Africas more formalised (though still troubled) labour market.\n\nThis takes us to the core of South Africas flawed immigration debate. The idea that businesses unfairly employ undocumented migrants is both legally accurate and sociologically oversimplified. It is accurate in a strict legal sense, as it sidesteps South Africas immigration laws. However, it is a significant misdiagnosis of the root issue. This is not mainly a matter of exploitative job theft from South Africans. However, it is the natural extension of a bonded economic system where capital does not arrive alone but comes with its historically shaped supply of labour.\n\nThe system itself sustains this eternal relationship. To complain about illegal Zimbabweans without also questioning the employers who actively maintain this pipeline is to deliberately ignore a key driver of the phenomenon. This selective focus is politically convenient as it directs public anger towards the most visible and vulnerable actors, the migrants themselves, while excusing a powerful economic constituency in White Rhodie business owners.\n\nPoliticians, including those like the DAs Dr Leon Schreiber (also a Rhodie), are undoubtedly aware of these complex cross-border economic networks. As such, the DAs policy generally frames migration through a language of opportunity, aiming to harness its economic potential. Its position advocates for freer movement of people within Africa, spurs cross-border trade, and integrates migration into a broader national economic growth strategy.\n\nHowever, the public discourse, trapped in simplistic nationalism, remains fixated solely on border control and the documentation of individuals. The role of the employer, the pull factor embedded in a transplanted colonial labour system, is conspicuously absent from mainstream policy conversations.\n\nAnyone who genuinely wants to address the issue of undocumented Zimbabweans in South Africa must first demonstrate the intellectual honesty to be mindful of the entire White-Zimbabwean bonded economic system. Repeating simplistic slogans about border fences and deportation is not only ineffective; it is a form of historical denialism or lack of awareness. It ignores the work of scholars likeBolt and Muzondidya, who have meticulously documented the origins and persistence of this system.\n\nThe relationship was shaped by the laws of Rhodesia, developed in its tobacco fields and revitalised in the game farms and restaurants of democratic South Africa. It is a resilient, adaptable chain of mutual, albeit profoundly unequal, dependence.\n\nUntil we have the courage to recognise this uncomfortable truth, looking beyond the migrant at the border to see the employer who awaits them, our debates on immigration will remain not only divisive and inflammatory but also profoundly, and perhaps intentionally, dishonest.\n\nSiyayibanga le economy!\n\n* Siyabonga Hadebe is an independent commentator based in Geneva on socio-economic, political and global matters.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23060825/zim-migrants-.jpg",
            "description": "<p>By Siyabonga Hadebe THE chorus is a familiar one, a relentless refrain in South Africa’s political and social discourse: “illegal Zimbabweans” are crossing the Limpopo in droves, “stealing” jobs from South Africans, social services like health and education and transforming the essence of the nation. This narrative, politically potent and emotionally charged, is repeated in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-invisible-chain-the-unspoken-bond-driving-zimbabwean-migration-to-south-africa/\">The Invisible Chain: The unspoken bond driving Zimbabwean migration to South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "23 Oct 2025"
        },
        {
            "title": "‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid",
            "url": "https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/",
            "content": "IOL\n\nFormer Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movements bold plans to extend President Emmerson Mnangagwas term of office to 2030, warning that the move will end badly for both the president and Zimbabwe.\n\nSpeaking to IOL, Kasukuwere said:He (Mnangagwa) is dreaming and he has set himself up for a gigantic failure. Greediness knows no boundaries, and this will lead to a huge disaster for the country.\n\nEarlier this week,IOL reported that Zanu PF has emboldened its move to push through a proposal allowing Mnangagwa to remain in powerbeyond his current constitutional term, which ends in 2028. The party recently adopted a resolution at its annual conference backing the extension to align with the governments so-called Vision 2030 development agenda.\n\nKasukuwere, once a senior figure in the Zanu PF government led by Robert Mugabe before going into exile during the 2017 military intervention, became one of the most prominent former insiders to condemn the partys Mnangagwa plan publicly.\n\nZanu-PF party has announced plans to begin the process of extendingMnangagwas term of officeby two years  a move that, if successful, would keep him in power until 2030.\n\nThe proposal was formally endorsed at the partys annual national peoples conference in the eastern city of Mutare over the weekend. Delegates instructed government structures to start work on legislation to amend the constitution.\n\nAccording to State-ownedThe Herald, delegates argued that the extension would allow Mnangagwa to complete ongoing national development programmes aligned with the governments Vision 2030 agenda.\n\nThe conference adopted the resolution unanimously, describing it as a step toward ensuring policy continuity and consolidating the gains made under Mnangagwas leadership.\n\nZanu-PFs acting political commissar, Munyaradzi Machacha, toldThe Heraldthat the resolution formed part of the official conference outcomes and would be referred to the partys central committee for consideration.\n\nOur president has demonstrated exceptional leadership in driving national development. The conference agreed he should be supported to continue implementing Vision 2030, Machacha said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/15191341/Kasukuwere.jpg",
            "description": "<p>IOL Former Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movement’s bold plans to extend President Emmerson Mnangagwa’s term of office to 2030, warning that the move will end badly for both the president and Zimbabwe. Speaking to IOL, Kasukuwere said: “He (Mnangagwa) is dreaming and he has set himself up</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/\">‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "23 Oct 2025"
        },
        {
            "title": "Kavango Resources CEO Ben Turney steps down",
            "url": "https://www.newzimbabwe.com/kavango-resources-ceo-benturney-steps-down/",
            "content": "By Alois Vinga\n\nKAVANGOResources PLC (LSE: KAV.L, VFEX: KAV.VX) CEO Ben Turney has stepped down from his position and asa director, effective immediately.\n\nPeter Wynter Bee, the companys Executive Chairman, will take on the role of interim CEO while Kavango searches for a permanent replacement. Non-executive director Donald McAlister will temporarily assume the duties of Chief Financial Officer (CFO), and Gautam Dalal will step in as Chairman of the Audit Committee.\n\nMcAlister brings extensive experience in Zimbabwe to his interim role, having previously served as Finance Director at Reunion Mining PLC and Mwana Africa PLC, along with board positions at Freda Rebecca Gold Mine and Bindura Nickel Corporation.\n\nOver the past three and a half years, Ben has successfully expanded the companys operations into Zimbabwe, a country with a skilled workforce and a positive business environment. Under his leadership, Kavango also secured a Referral Listing on the Victoria Falls Stock Exchange, Wynter Bee said in a statement.\n\nWynter Bee also noted that McAlister and fellow director Hillary Gumbo had previously worked together at Reunion Mining, which developed mining operations in Zimbabwe and Zambia before being acquired by Anglo American in 1999.\n\nKavango Resources, which is focused on mineral exploration, currently operates in Zimbabwe and Botswana.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23063021/ben-turney-kavango.jpg",
            "description": "<p>By Alois Vinga KAVANGO Resources PLC (LSE: KAV.L, VFEX: KAV.VX) CEO Ben Turney has stepped down from his position and as a director, effective immediately. Peter Wynter Bee, the company’s Executive Chairman, will take on the role of interim CEO while Kavango searches for a permanent replacement. Non-executive director Donald McAlister will temporarily assume the duties of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-ceo-benturney-steps-down/\">Kavango Resources CEO Ben Turney steps down</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "23 Oct 2025"
        },
        {
            "title": "ZIFA sacks Warriors coach Michael Nees",
            "url": "https://www.newzimbabwe.com/zifa-sacks-warriors-coach-michael-nees/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has dismissed Warriors coach Michael Nees following a string of poor results.\n\nThe association confirmed this in a statement released Wednesday.\n\nThe Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and members of the public that the Executive Committee has resolved to terminate the contract of Mr. Michael Nees with immediate effect.\n\nThe Association takes this opportunity to sincerely thank Mr. Nees for his efforts and contributions to Zimbabwean football during his tenure. His dedication to the game and his service to the national structures are appreciated,readspart of ZIFAs statement.\n\nNees dismissal follows a disappointing run that saw the Warriors fail to register a single win in this years World Cup qualifiers.\n\nDuring his 16 matches in charge, the German coach managed only two victories,both against Namibia in last years Africa Cup of Nations qualifiers.\n\nAlthough Nees contract was originally set to expire in December, ZIFA opted for an early termination.\n\nMeanwhile, the association assured fans that interim technical appointments will be made soon.\n\nZIFA remains firmly committed to strengthening its technical development programs and ensuring continued progress in all areas of the game in line with its reform and restructuring agenda.\n\nFurther information regarding the transition process and interim technical arrangements will be communicated in due course,added ZIFA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has dismissed Warriors coach Michael Nees following a string of poor results. The association confirmed this in a statement released Wednesday. “The Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and members of the public that the Executive Committee has resolved to terminate the contract of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-sacks-warriors-coach-michael-nees/\">ZIFA sacks Warriors coach Michael Nees</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "23 Oct 2025"
        }
    ]
}