{
    "news": [
        {
            "title": "Malawi football giants hit by FIFA ban after failing to settle Ronald Chitiyo’s debt",
            "url": "https://www.newzimbabwe.com/malawi-football-giants-hit-by-fifa-ban-after-failing-to-settle-ronald-chitiyos-debt/",
            "content": "By Sports Reporter\n\nFIFA has banned Malawi football giants Nyasa Big Bullets from registering new players for the next three seasons after the club failed to pay Zimbabwe international midfielder Ronald Chitiyo his outstanding dues.\n\nNyasa Big Bullets was found guilty of terminating Chitiyos contract without following proper procedures and was ordered to pay the player US$15,200 in compensation. The club failed to settle the amount within the 45-day deadline.\n\nChitiyo signed a three-year contract with Nyasa Big Bullets on 2 April 2024, but he played only one season before his contract was unlawfully terminated. During his time at the club, he was coached by Zimbabwean Kalisto Pasuwa, who has since left Nyasa Big Bullets and now leads the Malawi mens national team.\n\nChitiyo currently plays for Green Fuel FC, a club he joined upon returning from Malawi earlier this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/03055156/Zimbabwean-Ronald-Chitiyo-joins-FCB-Nyasa-Big-Bullets-on-a-three-year-deal-until-March-2027-1024x707-1.jpeg",
            "description": "<p>By Sports Reporter FIFA has banned Malawi football giants Nyasa Big Bullets from registering new players for the next three seasons after the club failed to pay Zimbabwe international midfielder Ronald Chitiyo his outstanding dues. Nyasa Big Bullets was found guilty of terminating Chitiyo’s contract without following proper procedures and was ordered to pay the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malawi-football-giants-hit-by-fifa-ban-after-failing-to-settle-ronald-chitiyos-debt/\">Malawi football giants hit by FIFA ban after failing to settle Ronald Chitiyo’s debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "High Court lifts asset freeze on businessman Zangairai’s 24 properties, slams Prosecutor-General for “inaction”",
            "url": "https://www.newzimbabwe.com/high-court-lifts-asset-freeze-on-businessman-zangairais-24-properties-slams-prosecutor-general-for-inaction/",
            "content": "By Mary Taruvinga\n\nThe High Court has lifted a two-year asset freeze on properties belonging to businessman Tobias Zangairai, ruling that the Prosecutor-General failed to act on allegations of unexplained wealth despite obtaining an interim order in 2023.\n\nJustice Benjamin Chikowero said it would be unjust to keep the order in place indefinitely without prosecution or civil forfeiture proceedings.\n\nThe order was never meant to remain in force in perpetuity, ruled Justice Chikowero. The Prosecutor-General has not taken advantage of that order by taking positive action. As I write this judgment, no criminal prosecution of the applicant for any serious crime vis--vis some or all of those properties has seen the light of day.\n\nThe case dates back to January 27, 2023, when the court, at the request of the Prosecutor-General, granted an unexplained wealth order and an interim freezing order against Zangairai.\n\nHe was required to explain how he acquired 24 immovable and movable assets, including residential stands across Harare, Bulawayo, Beitbridge, Mutare, and a fleet of vehicles ranging from a Toyota Hilux to a Nissan Civilian bus.\n\nZangairai complied, submitting a sworn statement to the Zimbabwe Republic Polices Asset Forfeiture Unit within the required 30 days.\n\nHowever, since then, the state took no further steps to prosecute him or apply for civil forfeiture.\n\nIn his defence, Zangairai argued that the prolonged freeze violated his constitutional right to use and enjoy his property.\n\nSection 71(2) of Zimbabwes Constitution guarantees every citizen the right to acquire, hold, occupy, use, transfer, hypothecate, lease or dispose of all forms of property.\n\nThe judge criticised the Prosecutor-Generals office for keeping Zangairais assets in limbo for more than two-and-a-half years without justification.\n\nIn these circumstances, it was not surprising that counsel for the first respondent was unable to make any meaningful submissions, Justice Chikowero said.\n\nIt would be unjust not to accede to the application for the setting aside of the interim freezing order.\n\nThe court ruled that Zangairai can now freely deal with his 24 assets, which include prime land in Marlborough, Salisbury Township, Mahatshula in Bulawayo, Chikanga in Mutare, and multiple stands in Beitbridge, along with vehicles such as a Toyota Nadia, Nissan Hardbody, Mazda Capella, and several Toyota Hiace minibuses.\n\nThe High Court formally granted Zangairais application, struck out a related case (HCHACC 130/24), and ordered that each party bear its own legal costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has lifted a two-year asset freeze on properties belonging to businessman Tobias Zangairai, ruling that the Prosecutor-General failed to act on allegations of unexplained wealth despite obtaining an interim order in 2023. Justice Benjamin Chikowero said it would be “unjust” to keep the order in place indefinitely without prosecution</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-lifts-asset-freeze-on-businessman-zangairais-24-properties-slams-prosecutor-general-for-inaction/\">High Court lifts asset freeze on businessman Zangairai’s 24 properties, slams Prosecutor-General for “inaction”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "Sikandar Raza banks on home support as T20 World Cup Africa Qualifiers begin",
            "url": "https://www.newzimbabwe.com/sikandar-raza-banks-on-home-support-as-t20-world-cup-africa-qualifiers-begin/",
            "content": "By Sports Reporter\n\nZimbabwe mens T20 captain Sikandar Raza says home support will be key as the Chevrons begin their campaign in the ICC Mens T20 World Cup Africa Qualifiers, which kick off this Friday in Harare.\n\nThe tournament, running until October 4, will be staged across two venues,Takashinga Sports Club in Highfield and Harare Sports Club.\n\nZimbabwe have been drawn in Group B alongside Botswana, Tanzania, and Uganda, while Group A features Malawi, Namibia, Nigeria, and Kenya. The top two teams will qualify for the 2026 ICC Mens T20 World Cup, set to be hosted by Sri Lanka and India.\n\nRaza expressed confidence ahead of the competition, insisting that playing at home should inspire rather than pressure the side.\n\nI feel very confident that we will be at the World Cup. Some may look at playing at home as pressure, but I see it as support. Our fans give us so much energy, and I believe wewill be the team with the biggest backing throughout the tournament. I cannot wait for the competition to start, he said.\n\nZimbabwe begin their campaign against Uganda at Harare Sports Club on Friday, while Tanzania face Botswana at Takashinga. Both matches start at 13:50.\n\nThe Chevrons head into the tournament in buoyant form, having defeated Kenya by nine wickets on Monday before sealing a 47-run victory over Nigeria in Wednesdays warm-up match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/09154225/Sikandar-Raza-on-Fire.png",
            "description": "<p>By Sports Reporter Zimbabwe men’s T20 captain Sikandar Raza says home support will be key as the Chevrons begin their campaign in the ICC Men’s T20 World Cup Africa Qualifiers, which kick off this Friday in Harare. The tournament, running until October 4, will be staged across two venues, Takashinga Sports Club in Highfield and Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikandar-raza-banks-on-home-support-as-t20-world-cup-africa-qualifiers-begin/\">Sikandar Raza banks on home support as T20 World Cup Africa Qualifiers begin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "Gold glitters for Zimbabwean luxury crocodile skins supplier",
            "url": "https://www.newzimbabwe.com/gold-glitters-for-zimbabwean-luxury-crocodile-skins-supplier/",
            "content": "IOL\n\nGold is glittering for Zimbabwean crocodile skin supplier, Padenga Holdings, as luxury markets reels from global economic uncertainty and a growing shift to bullion as a store of value.\n\nPadengadiversified into gold mining in 2019 through the acquisition of Zimbabwe gold mining operations. Analysts said at the time that the diversification representedan unusual pairing but is value accretive through enhancement of forex earningspotential.\n\nNow, the company is reaping the benefits of that diversification, with gold prices spiking to highest levels. Spot gold prices traded above $3 700 per ounce in early trade on Thursday.\n\nFor the half year to end June, gold Prices closed$3 264per ounce for Padenga compared to$2 402per ounceat the beginning of the year. This represents36% increase over the period, with theupturn in the gold pricesalso complementing sterling financial performance at the companys gold miningdivision, Dallaglio.\n\nPadengas gold mining unit contributed 94% of the groups revenues of $130.68 million which was 38% stronger compared to same period last year.\n\nThis was afterDallaglio produced 1 292kgs of gold inthe first half year under review, 7% higher compared to the previous contrasting period attributable tostronger grades and higher plant recoveries.\n\nIn the prior contrasting period, Dallaglio accounted for 88% of Padengas overall revenues.\n\nHalf year profitsbefore taxfor the 2025 half year amounted to$41.31m, up 204% compared to thecontrasting period.\n\nA turnover of $123.37m was achievedfor Padengas gold operations,representing a 41% increase.\n\nEarnings before interest, tax, depreciation and amortisation for the half-year sprung up 114% $49.14m, with cash generated from operations also leaping up 183% to $38.12m attributable to continued investment in strategic growth and debt reduction strategies.\n\nPadenga is additionally investing in capital projects to further ramp up bullion production, with phase 3 of the underground project atitsPickstone mineprogressing according to schedule as access to Level 10 was established during the periodwhiledevelopmentistargeting commissioning of the loading and hoisting infrastructureby the end of this year.\n\nIn addition, Pickstone mine will embark on the addition of a pre-oxidation facility in the second half of the year, said Padenga chairman Themba Sibanda.\n\nThis facility will improve leachability of ore going into the Carbon-in-Leach (CIL) stage and enhance overall plant recovery. Procurement for the project will commence in Q3 and commissioning is targeted for Q1 2026.\n\nWhile the company is sinking capital investment into its gold mining assets, it is slowing down investment in its crocodile farming business as demand slows down.\n\nPadenga, which supplies crocodile skins to international luxury brands, says it has reduced costs by reducing its crocodile farms from three to two.\n\nIts less rosy prospects from the sale of crocodile skins, a business that was once brisk, are a consequence of aluxury industrythatis facing a significant slowdown that has hit even top brands hard,according to McKinsey.\n\nFor the first time since 2016 (excluding 2020), luxury value creation is expected to create less value than the previous year, notes McKinsey in a recent report.\n\nSeveral of theluxuryindustrys growth-driving engines have stalled(and) price increases have reached a ceiling, and higher prices are negatively affecting demandfrom luxury consumers.\n\nIn the first half period under review,sales ofcrocodile skins by Padenga slipped by 5% to13,919 skins. Moreover, the companysUme Crocodile Farm operationshave been discontinued due to the challenging market conditions, that have resulted in reduced demandforcrocodileskins.\n\nApart from supplying crocodile skins to global luxury brands, Padenga also exports crocodile meat to Asian and other markets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25153227/crocodile-gold.png",
            "description": "<p>IOL Gold is glittering for Zimbabwean crocodile skin supplier, Padenga Holdings, as luxury markets reels from global economic uncertainty and a growing shift to bullion as a store of value. Padenga diversified into gold mining in 2019 through the acquisition of Zimbabwe gold mining operations. Analysts said at the time that the diversification represented an “unusual pairing”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-glitters-for-zimbabwean-luxury-crocodile-skins-supplier/\">Gold glitters for Zimbabwean luxury crocodile skins supplier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "26 Sep 2025"
        },
        {
            "title": "Zimbabwean blueberry farmers set sights on China’s lucrative market",
            "url": "https://www.newzimbabwe.com/zimbabwean-blueberry-farmers-set-sights-on-chinas-lucrative-market/",
            "content": "Xinhua\n\nIn recent years, Zimbabwes blueberry industry has grown rapidly, bringing local farmers higher incomes. This year, producers are setting their sights on exporting blueberries to China, one of the worlds largest and most lucrative markets.\n\nHARARE, Sept. 25 (Xinhua)  Inside a greenhouse located in ZimbabwesMashonaland West Province, workers carefully hand-pick fresh blueberries from lush green shrubs, ensuring only the best fruit makes it to the baskets.\n\nIn recent years, Zimbabwes blueberry industry has grown rapidly, bringing local farmers higher incomes. This year, producers are setting their sights on exporting blueberries to China, one of the worlds largest and most lucrative markets.\n\nEarlier this month, Zimbabwe signed a trade agreement allowing fresh blueberry exports to China, a move farmers say will spur production to meet the surge in demand.\n\nIt is a huge market. They are the biggest exporters of blueberries, among the biggest growers of blueberries, and also one of the biggest importers of blueberries. So, it really has taken off there, said Alistair Campbell, a blueberry farmer from the province.\n\nSupported by favorable climate conditions, increased agricultural investment, and rising demand for this healthy food, Zimbabwes blueberry industry is expanding. According to the countrys Horticultural Development Council (HDC), production is expected to rise from 8,000 metric tons in 2024 to 12,000 metric tons in 2025.\n\nFarmers believe that Zimbabwes strategic geographic location  allowing early access to global markets  gives the country a competitive edge. Our product is well received. We get big, nice-tasting berries. And its well-received in the market thus far. We just need more scale, more blueberries, Campbell said, adding that the opportunity to export to China positions Zimbabwe as a significant player in blueberry production.\n\nWe really need to get things moving pretty quickly. We hope to have some really good engagements with government to see what we can get done there, and also with funders to make sure that we get enough plants in the ground to satisfy at least a part of that Chinese market, he added.\n\nIn a statement following the signing of the blueberry export agreement, the HDC called for policies to increase investment, expand production to required volumes, and ensure that Zimbabwes blueberries consistently meet Chinas quality and phytosanitary standards.\n\nJoseph Kakoto, president of the Zimbabwe Young Farmers Association for Sustainable Development, a youth-led organization, expressed optimism about the growth prospects of the Chinese export market, saying the protocol would attract new investment in plantations, packhouses, and cold chain infrastructure, creating jobs along the value chain.\n\nThis protocol is a win-win. Zimbabwe gains access to a lucrative market, while China secures reliable food imports, Kakoto told Xinhua.\n\nThe deal, he said, signals Zimbabwes entry into high-value horticultural exports such as blueberries, opening the door to greater foreign currency earnings and investment.\n\nI am very confident about the Chinese market because it is huge and steadily growing with a rising middle class that demands healthy premium foods such as blueberries. Zimbabwes climate and soil are highly suitable for premium berries, giving us a competitive edge, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25153032/blueberry-farmer.jpeg",
            "description": "<p>Xinhua In recent years, Zimbabwe’s blueberry industry has grown rapidly, bringing local farmers higher incomes. This year, producers are setting their sights on exporting blueberries to China, one of the world’s largest and most lucrative markets.   HARARE, Sept. 25 (Xinhua) — Inside a greenhouse located in Zimbabwe’s Mashonaland West Province, workers carefully hand-pick fresh blueberries</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-blueberry-farmers-set-sights-on-chinas-lucrative-market/\">Zimbabwean blueberry farmers set sights on China’s lucrative market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "26 Sep 2025"
        }
    ]
}