{
    "news": [
        {
            "title": "Highlanders FC opens lid on ZACC raid on its office",
            "url": "https://www.newzimbabwe.com/highlanders-fc-opens-lid-on-zacc-raid-on-its-office/",
            "content": "By Sports Reporter\n\nHIGHLANDERS FC has finally commented on the Thursday morning raid by the Zimbabwe Anti-Corruption Commission (ZACC) at its offices in Bulawayo.\n\nAccording to reports, ZACC is investigating Highlanders over misuse of funds, especially on players transfer fees.The club has distanced itself from allegations circulating on social media alleging one of its executive members invited ZACC to their premises to investigate the rot.Below is the clubs statement on ZACC:Following the Zimbabwe Anti-Corruption Commission (ZACC)s visit to Highlanders Football Club offices on Thursday 17 July 2025, the club would like to inform the clubs stakeholders and bonafide members that;1.Highlanders Football Club has not made any report to ZACC, the Zimbabwe Republic Police (ZRP) or any other investigative body.2.The cIub has effective administration processes that can deal with any issues of concern.3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)Finally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\nAccording to reports, ZACC is investigating Highlanders over misuse of funds, especially on players transfer fees.\n\nThe club has distanced itself from allegations circulating on social media alleging one of its executive members invited ZACC to their premises to investigate the rot.Below is the clubs statement on ZACC:Following the Zimbabwe Anti-Corruption Commission (ZACC)s visit to Highlanders Football Club offices on Thursday 17 July 2025, the club would like to inform the clubs stakeholders and bonafide members that;1.Highlanders Football Club has not made any report to ZACC, the Zimbabwe Republic Police (ZRP) or any other investigative body.2.The cIub has effective administration processes that can deal with any issues of concern.3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)Finally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\nThe club has distanced itself from allegations circulating on social media alleging one of its executive members invited ZACC to their premises to investigate the rot.\n\nBelow is the clubs statement on ZACC:Following the Zimbabwe Anti-Corruption Commission (ZACC)s visit to Highlanders Football Club offices on Thursday 17 July 2025, the club would like to inform the clubs stakeholders and bonafide members that;1.Highlanders Football Club has not made any report to ZACC, the Zimbabwe Republic Police (ZRP) or any other investigative body.2.The cIub has effective administration processes that can deal with any issues of concern.3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)Finally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\nBelow is the clubs statement on ZACC:\n\nFollowing the Zimbabwe Anti-Corruption Commission (ZACC)s visit to Highlanders Football Club offices on Thursday 17 July 2025, the club would like to inform the clubs stakeholders and bonafide members that;1.Highlanders Football Club has not made any report to ZACC, the Zimbabwe Republic Police (ZRP) or any other investigative body.2.The cIub has effective administration processes that can deal with any issues of concern.3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)Finally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\nFollowing the Zimbabwe Anti-Corruption Commission (ZACC)s visit to Highlanders Football Club offices on Thursday 17 July 2025, the club would like to inform the clubs stakeholders and bonafide members that;\n\n1.Highlanders Football Club has not made any report to ZACC, the Zimbabwe Republic Police (ZRP) or any other investigative body.2.The cIub has effective administration processes that can deal with any issues of concern.3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)Finally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\n1.Highlanders Football Club has not made any report to ZACC, the Zimbabwe Republic Police (ZRP) or any other investigative body.\n\n2.The cIub has effective administration processes that can deal with any issues of concern.3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)Finally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\n2.The cIub has effective administration processes that can deal with any issues of concern.\n\n3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)Finally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\n3. As a member of the Premier Soccer League (PSL), an affiliate of the Zimbabwe Football Association (ZIFA), under the auspices of the Federation Internationale de Football Association (FIFA), the club is committed to upholding the rules and regulations of FIFA and ensuring that governance and operations are free from external interference (Article 14: Independence of FIFA and its member associations and Article 19: Governing bodies and autonomy)\n\nFinally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\nFinally, the club would like to assure the clubs sponsors and other stakeholders that the information relating to them is safe and has not been contaminated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/02193823/Highlanders.jpg",
            "description": "<p>By Sports Reporter  HIGHLANDERS FC has finally commented on the Thursday morning raid by the Zimbabwe Anti-Corruption Commission (ZACC) at its offices in Bulawayo. According to reports, ZACC is investigating Highlanders over misuse of funds, especially on players’ transfer fees. The club has distanced itself from allegations circulating on social media alleging one of its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/highlanders-fc-opens-lid-on-zacc-raid-on-its-office/\">Highlanders FC opens lid on ZACC raid on its office </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "18 Jul 2025"
        },
        {
            "title": "US court rules in Zimbabwe’s favour over $93m mining dispute",
            "url": "https://www.newzimbabwe.com/us-court-rules-in-zimbabwes-favour-over-93m-mining-dispute/",
            "content": "Bloomberg\n\nA US court has dismissed a case brought by two Mauritian companies seeking to enforce a decade-old arbitration award against a Zimbabwean state-owned miner.\n\nThe US Court of Appeals, District of Columbia Circuit, ordered the case brought by Amaplat Mauritius Ltd. and Amari Nickel against the Zimbabwe Mining Development Corporation (ZMDC) be dismissed, citing a lack of jurisdiction.\n\nThe Mauritian firms approached the US court after the Zimbabwean company ignored an arbitration order and a court ruling to pay.\n\nThe International Court of Arbitration in Zambia in 2014 ordered ZMDC to pay $42.9 million to Amaplat and $3.9 million to Amari, with 5% annual interest, for cancelling a nickel and platinum joint venture in the southern African nation.\n\nThe amount has since risen to $93 million.\n\nIn 2019, the Zambian High Court granted the two companies permission to enforce the arbitration award, which would have allowed them to seize the state miners assets.\n\nZimbabwes Secretary for Mines and Mining Development Pfungwa Kunaka welcomed the outcome.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17163300/mine.jpg",
            "description": "<p>Bloomberg A US court has dismissed a case brought by two Mauritian companies seeking to enforce a decade-old arbitration award against a Zimbabwean state-owned miner. The US Court of Appeals, District of Columbia Circuit, ordered the case brought by Amaplat Mauritius Ltd. and Amari Nickel against the Zimbabwe Mining Development Corporation (ZMDC) be dismissed, citing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-court-rules-in-zimbabwes-favour-over-93m-mining-dispute/\">US court rules in Zimbabwe’s favour over $93m mining dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "18 Jul 2025"
        },
        {
            "title": "War veterans win legal battle for Spring Farm against Billy Rautenbach",
            "url": "https://www.newzimbabwe.com/war-veterans-win-legal-battle-for-spring-farm-against-billy-rautenbach/",
            "content": "By Mary Taruvinga\n\nIn a dramatic turn of events, war veterans from Spring Farm in Goromonzi have emerged victorious in a court case concerning the contentious loss of their land to businessman Billy Rautenbach. This followed the governments cancellation of their offer letters.\n\nSeeking justice, the veterans turned to the High Court after Rautenbach, a business associate of President Emmerson Mnangagwa, assumed control of the land. The courtroom erupted in joy when Judge Regis Dembure of the Harare High Court handed down the ruling on Thursday.\n\nThe judge was critical of Lands Minister Anxious Masuka, chastising him for his irrational and inconsiderate decision to cancel the veterans offer letters. Although the ministry had initially challenged the veterans application, Masuka failed to submit an opposing affidavit, a significant misstep that ultimately led to the cases outcome.\n\nThe court heard that the minister had delegated authority to the permanent secretary, a move that Dembure rejected outright. Striking off the permanent secretarys affidavit, the judge declared that the veterans legal arguments stood unopposed, leading to their victory.\n\nI wish to point out that the law in relation to authority to act is already settled that where authority has been challenged, it will be necessary to produce evidence, said Judge Dembure.\n\nHe emphasised the importance of substantiating claims regarding authority in court.\n\nThe judge added, What is clear is that where the authority of a defendant is put on issue, there will be a need to put evidence of that authority in court. He dismissed the permanent secretarys mere assertion of authority, saying, There is no evidence before me to show that he has authority.\n\nDembure further explained, The act of withdrawal of the offer letter is by the minister and cannot be delegated. The decision is his and he must justify his action.\n\nThe judge also said that the minister is expected by law to make decisions independently, stating, No delegated authority can speak on his behalf.\n\nIn his ruling, the judge noted that the minister only has the power to delegate administrative, not statutory, authority.\n\nIf a decision-maker has failed to depose an affidavit, its inadmissible.\n\nThe judge highlighted that the ministers actions had severely disrupted the veterans livelihood.\n\nHe criticised Masuka for not thoughtfully considering the implications of withdrawing the offer letters.\n\nHe is the one who should have told the court if it was a good intention to withdraw the offer letters and what was his state of mind when he formulated these decisions, Dembure said.\n\nIn the absence of his affidavit, the opposition is clearly a nullity. There is no proper opposition before the court.\n\nConsequently, the opposition was struck out, allowing the case to proceed without challenge.\n\nCritics of the allocation of Spring Farm to Rautenbachs Marimba Residential Properties Limited had raised concerns about potential manipulation and corruption surrounding the land seizure in Mashonaland East Province.\n\nWar veterans expressed alarm when it became known that Rautenbach was granted the deed of transfer for the land on June 5, 2025, prior to the court hearing, while indigenous farmers, including the veterans, had their applications still pending in court.\n\nAs if to heighten tensions, armed guards were deployed around the farm last week, further complicating matters ahead of the judicial proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Mary Taruvinga In a dramatic turn of events, war veterans from Spring Farm in Goromonzi have emerged victorious in a court case concerning the contentious loss of their land to businessman Billy Rautenbach. This followed the government’s cancellation of their offer letters. Seeking justice, the veterans turned to the High Court after Rautenbach, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-veterans-win-legal-battle-for-spring-farm-against-billy-rautenbach/\">War veterans win legal battle for Spring Farm against Billy Rautenbach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "18 Jul 2025"
        },
        {
            "title": "PEPFAR keeps millions of people with HIV alive and may be spared from Trump spending cuts",
            "url": "https://www.newzimbabwe.com/pepfar-keeps-millions-of-people-with-hiv-alive-and-may-be-spared-from-trump-spending-cuts/",
            "content": "AP\n\nThe program known as PEPFAR is one of the most effective and popular U.S. foreign aid projects in history, and the government says it has saved the lives of over 25 million people around the world with HIV.\n\nBut despite years of bipartisan support, PEPFAR has faced a severe threat as the Trump administration dismantles most U.S. foreign aid.\n\nPEPFAR on Tuesday appeared to be spared a $400 million cut as Republicans acted in rare defiance of a request by President Donald Trump. But governments, health experts and people with HIV around the world are alarmed by the effects of other U.S. aid cuts and chaos that are already disrupting the crucial supply of HIV drugs  which are meant to be taken daily.\n\nHeres a look at PEPFAR and how it affects millions of people globally.\n\nToday, many babies are born infection-free to mothers with HIV  the U.S. State Department says PEPFAR has been responsible for 5.5 million such births  and most people around the world no longer see an infection as a death sentence.\n\nGovernments in Africa and elsewhere had even begun to worry about complacency as people, especially youths, took the widespread availability of HIV drugs for granted. In another significant step forward, the U.S. Food and Drug Administration recently approved for use the worlds only twice-a-year shot to prevent HIV.\n\nBut the abrupt U.S. aid cuts have health officials in developing countries warning of a return to the early days of the AIDS pandemic, when drugs were nonexistent or severely limited and clinics were filled with the dying. PEPFAR was launched in 2004 in response to those grim scenes.\n\nAlso known as the U.S. Presidents Emergency Plan for AIDS Relief, the program has partnered with nonprofit groups to provide HIV medication  including the preventative PrEP  to millions around the world. It has strengthened national health care systems, cared for children orphaned by AIDS and provided job training for people at risk. It has played an important role in testing for and tracking HIV infections.\n\nHIV/AIDS has no cure, and it has killed over 40 million people globally over the years. Now the U.N. agency on AIDS is warning that analysis suggests 4 million additional AIDS-related deaths between now and 2029, including 300,000 additional childrens deaths, if programs permanently lose PEPFARs support.\n\nSince PEPFARs creation by Congress and Republican President George W. Bush, the program has largely enjoyed support across the political spectrum  and gratitude from countries whose health systems have been poorly equipped to care for millions with HIV.\n\nBut misinformation has crept in. The Heritage Foundation, an influential conservative Washington think tank, accused the Biden administration of using PEPFAR to promote its domestic radical social agenda overseas. Conservatives claimed there were efforts to integrate abortion with HIV/AIDS prevention, a claim the Biden administration denied. Similar claims linger under the Trump administration.\n\nTrump and his officials also claim widespread waste and fraud as they seek to dismantle U.S. foreign aid. But PEPFAR has been repeatedly scrutinized. Last year, the government said the State Departments Office of Inspector General had conducted 80 audits, inspections, and special reviews that included oversight of PEPFAR programs, including 21 thematic reviews and audits specifically focused on PEPFAR.\n\nThe $400 million proposed cut to PEPFAR still could be restored, in part or in full, as the bill on spending cuts faces a final vote in the Senate, a vote in the House of Representatives and Trumps signature before a Friday deadline.\n\nWe must stay vigilant, International AIDS Society President Beatriz Grinsztejn said in a statement Wednesday after PEPFAR appeared to be spared.\n\nNo matter what, countries and health experts say it will be impossible to fill the funding gap left by the overall U.S. withdrawal of billions of dollars in aid for the global HIV response, including via PEPFAR.\n\nLast month, a UNAIDS report said the abrupt cuts have destabilized supply chains, led to the closure of health facilities, left thousands of health clinics without staff, set back prevention programs, disrupted HIV testing efforts and forced many community organizations to reduce or halt their HIV activities.\n\nSouth Africa, where more people live with HIV than anywhere else in the world, has said 12 specialized HIV clinics that were funded by the U.S. have had to close down and over 8,000 health workers in its national HIV program are out of work.\n\nNow health workers there and elsewhere are trying to track down an unknown number of people who have lost access to HIV medication. The stakes are deadly. Stopping the drugs allows the virus to start multiplying again. HIV can rebound to detectable levels in peoples blood in just a few weeks, putting sexual partners at risk. The virus could even become drug-resistant.\n\nIt has really been hectic for us, said Mbonisiwe Hlongwane, manager of the HIV program at the Bertha Gxowa public hospital in Germiston, east of Johannesburg. And the uncertainty only continues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17164222/pepfar.webp",
            "description": "<p>AP The program known as PEPFAR is one of the most effective and popular U.S. foreign aid projects in history, and the government says it has saved the lives of over 25 million people around the world with HIV. But despite years of bipartisan support, PEPFAR has faced a severe threat as the Trump administration</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pepfar-keeps-millions-of-people-with-hiv-alive-and-may-be-spared-from-trump-spending-cuts/\">PEPFAR keeps millions of people with HIV alive and may be spared from Trump spending cuts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "18 Jul 2025"
        },
        {
            "title": "Mudzuri is wayward – Mwonzora’s MDC-T says as fight for party’s crumbs continues",
            "url": "https://www.newzimbabwe.com/mudzuri-is-wayward-mwonzoras-mdc-t-says-as-fight-for-partys-crumbs-continues/",
            "content": "By Darlington Gatsi\n\nMOVEMENT for Democratic Change (MDC-T) has labelled its vice president, Elias Mudzuri, wayward following skirmishes at the partys headquarters in Harare on Thursday.\n\nMDC-T officials were heavily guarded by riot police and party youths on Thursday, blocking an address by Mudzuri, who is challenging the legitimacy of Douglas Mwonzoraelected to lead the opposition party in 2022.\n\nThe clashes are the latest in a series of power wrangles within the opposition party, which has faced turbulence since the death of its leader, Morgan Tsvangirai in 2018.\n\nMwonzoras spokesperson, Lloyd Damba, said Mudzuri has no basis to return to the MDC-T as he has since formed another party.\n\nAs you know we held our Ordinary Congress in 2022 and Mudzuri due to his power-hungry nature approached the courts to have our Congress nullified, basing his argument that the Womens Assembly Congress was not held but apparently they were also delegates at the same Congress.\n\nThe High Court ruled in his favour, and we appealed to the Supreme Court. effectively. Our appeal suspends the High Court Ruling. He then insists that the party has no leader but if we are to implement the High Court ruling it means the default position is that we fall back to the Extraordinary Congress position.\n\nWhere Senator Mwonzora was elected President and Komichi returns his chairman position and Mudzuri as Deputy National chairman, but unfortunately, Komichi has already formed his party so automatically he has lost his right to return his position, said Damba.\n\nMudzuri and other disgruntled MDC-T members won their court challenge seeking to nullify Mwonzoras 2022 election as party leader. The High Court ordered the MDC-T to return to pre-election structures and convene an extraordinary congress. Mwonzora has since filed an appeal with the Supreme Court.\n\nDamba said Mudzuris latest actions were disruptive, coinciding with the Epworth by-election campaign.\n\nUnfortunately, our case us still before the courts and please note that it is not us who approached the courts but its them, so we are simply pursuing the legal route that they initiated.\n\nUnfortunately, Mudzuri is so wayward that he called for a press conference today, and nobody knows what he wanted to announce.\n\nThe MDC is a party with a constitution and all meetings are structured around certain office bearers, not the chaotic manner in which he wants to do it and he decided to do it at a time we are campaigning in Epworth North Ward 6 By Election. He intends to disrupt our by-election campaign so that Zanu-PF wins the seat, said Damba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Darlington Gatsi MOVEMENT for Democratic Change (MDC-T) has labelled its vice president, Elias Mudzuri, “wayward” following skirmishes at the party’s headquarters in Harare on Thursday. MDC-T officials were heavily guarded by riot police and party youths on Thursday, blocking an address by Mudzuri, who is challenging the legitimacy of Douglas Mwonzora—elected to lead the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudzuri-is-wayward-mwonzoras-mdc-t-says-as-fight-for-partys-crumbs-continues/\">Mudzuri is wayward – Mwonzora’s MDC-T says as fight for party’s crumbs continues </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "18 Jul 2025"
        },
        {
            "title": "Low disposable incomes force 15.6% decline of Edgars volumes",
            "url": "https://www.newzimbabwe.com/low-disposable-incomes-force-15-6-decline-of-edgars-volumes/",
            "content": "By Alois Vinga\n\nLOW disposable incomes have forced Edgars Limited volumes to decline by 15.6% confirming the changing priorities by hard-pressed citizens.\n\nPresenting an annual report for the just-ended year, the group bemoaned the pinch exerted by low disposable incomes in the market.\n\nSignificant pressures on disposable incomes resulted in reduced retail volumes. Consumer spending in a tight economic environment, as described, prioritises food security over clothing and footwear.\n\nAs a result, total Group units sold declined by 15,6% from 2.36 million to 1.99 million compared to the same period last year. Revenue decline was contained at 9,1% over the prior year, at USD30.7 million against USD33.7 million in 2023, the group said.\n\nThe company said the operating environment for the year ended 5 January 2025 was characterised by exchange rate volatility and incessant inflationary pressures on the back of liquidity challenges in both the local and foreign currencies, which persisted throughout the year.\n\nThe impact of the El Nio-induced drought in the 2023/2024 agricultural season, the worst in the last 43 years, resulted in below-average agricultural output. That, combined with retrenchments reported across various sectors, especially in retail branches, negatively impacted disposable incomes, resulting in subdued sales volumes during the period, compared to the prior year, the group said.\n\nGoing forward, management intends to right-align business overheads to attain volumes in the context of depressed demand and float flexible credit offerings, which will be maintained to stimulate increased expenditure.\n\nThe Group will continue to expand its geographic footprint through the opening of new stores in strategic locations. A further four Express Stores are targeted for expansion before the close of the FY2025 financial year, added Edgars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/29035436/Edgars-Stores.jpg",
            "description": "<p>By Alois Vinga LOW disposable incomes have forced Edgars Limited volumes to decline by 15.6% confirming the changing priorities by hard-pressed citizens. Presenting an annual report for the just-ended year, the group bemoaned the pinch exerted by low disposable incomes in the market. “Significant pressures on disposable incomes resulted in reduced retail volumes. Consumer spending</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/low-disposable-incomes-force-15-6-decline-of-edgars-volumes/\">Low disposable incomes force 15.6% decline of Edgars volumes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "18 Jul 2025"
        },
        {
            "title": "In Pictures: Zimbabwe successfully performs open-heart surgeries on 10 children",
            "url": "https://www.newzimbabwe.com/in-pictures-zimbabwe-successfully-performs-open-heart-surgeries-on-10-children/",
            "content": "ZIMBABWE has successfully conducted open-heart surgeries on 10 children during a week-long medical camp at Parirenyatwa Hospital.\n\nBelow are some images captured at the hospital.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17172701/1000775988.jpg",
            "description": "<p>ZIMBABWE has successfully conducted open-heart surgeries on 10 children during a week-long medical camp at Parirenyatwa Hospital. Below are some images captured at the hospital. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-zimbabwe-successfully-performs-open-heart-surgeries-on-10-children/\">In Pictures: Zimbabwe successfully performs open-heart surgeries on 10 children</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "18 Jul 2025"
        }
    ]
}