{
    "news": [
        {
            "title": "Zimbabwe records 28 cholera cases, 2 deaths",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-28-cholera-cases-2-deaths/",
            "content": "Xinhua\n\nZimbabwe has recorded 28 cholera cases and two deaths in the latest cholera outbreak that began in November last year, health authorities said Monday.\n\nIn an update on the cholera cases, Zimbabwes Ministry of Health and Child Care said the current outbreak, which began in the Kariba district of Mashonaland West Province, has since spread to seven districts in the country, including Harare, Zimbabwes capital.\n\nZimbabwe has recorded 282 suspected cholera cases and 275 recoveries and a total of 4, 923 people have been administered with oral cholera vaccine in a four-day campaign covering the most affected farms and residential areas in Glendale and Mazowe districts of Mashonaland Central Province, currently the epicentre of the current outbreak.\n\nThe current outbreak came just a few months after the government declared in August of last year an end to another nationwide outbreak that began in February 2023. According to the United Nations Childrens Fund, the outbreak caused more than 700 confirmed or suspected deaths in the African country.\n\nZimbabwe has faced persistent cholera outbreaks over the past years due to poor water and sanitation infrastructure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/26200440/Cholera_h1.jpeg",
            "description": "<p>Xinhua Zimbabwe has recorded 28 cholera cases and two deaths in the latest cholera outbreak that began in November last year, health authorities said Monday. In an update on the cholera cases, Zimbabwe’s Ministry of Health and Child Care said the current outbreak, which began in the Kariba district of Mashonaland West Province, has since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-28-cholera-cases-2-deaths/\">Zimbabwe records 28 cholera cases, 2 deaths</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Notorious Zim fugitive captured in Limpopo after mountain hideout raid",
            "url": "https://www.newzimbabwe.com/notorious-zim-fugitive-captured-in-limpopo-after-mountain-hideout-raid/",
            "content": "The Citizen\n\nIn a significant breakthrough for law enforcement, notorious Zimbabwean fugitive Lovemore Musoyi has been recaptured in Limpopos Sekhukhune District.\n\nMusoyi escaped police custody two years ago.\n\nHis rearrest follows a coordinated operation between police and private security forces.\n\nThe 32-year-old suspect, who had been evading authorities after a daring escape from police custody in Motetema, was apprehended on Friday during a daytime raid on his mountain hideout in the Rakgoadi policing area.\n\nMusoyis luck eventually deserted him when the police working with private security, operationalised information and invaded a hideout place of the suspect in the mountains at Rakgoadi policing area, said Police spokesperson Colonel Malesela Ledwaba.\n\nMusoyi faces more than ten criminal cases across multiple jurisdictions within the Sekhukhune District, including the areas of Elandskraal, Motetema, Dennilton, and Rakgoadi.\n\nHis alleged crimes span a wide range of serious offences, including murder, attempted murder, armed robberies, house robberies, business robberies, kidnapping, assaults, and stock theft.\n\nHe is also charged with possession of an unlicensed firearm and ammunition.\n\nDuring his arrest, authorities confiscated an unlicensed firearm from the suspect.\n\nLimpopo Provincial Police Commissioner Lieutenant General Thembi Hadebe praised the collaborative effort that led to Musoyis capture.\n\nThe operation involved the Saps Sekhukhune Task Team, Operation Vala Umgodi Multidisciplinary Team, and private security forces, who worked together to track down the fugitive.\n\nThis comes after his escape, during which he had attacked and disarmed two police officers.\n\nThe suspect is scheduled to appear before various Magistrates courts within the Sekhukhune District to face multiple charges, including escaping from lawful custody.\n\nLedwaba said police investigations into all related cases are ongoing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/10140947/Police-in-Limpopo-are-hunting-for-Lovemore-Musoyi-accused-of-numerous-violent-crimes-after-he-escaped-from-a-police-vehicle-last-year-Picture-SAPS.webp",
            "description": "<p>The Citizen In a significant breakthrough for law enforcement, notorious Zimbabwean fugitive Lovemore Musoyi has been recaptured in Limpopo’s Sekhukhune District. Musoyi escaped police custody two years ago. His rearrest follows a coordinated operation between police and private security forces. The 32-year-old suspect, who had been evading authorities after a daring escape from police custody</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/notorious-zim-fugitive-captured-in-limpopo-after-mountain-hideout-raid/\">Notorious Zim fugitive captured in Limpopo after mountain hideout raid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Triangle woman attempts suicide after killing her two minor daughters",
            "url": "https://www.newzimbabwe.com/triangle-woman-attempts-suicide-after-killing-her-two-minor-daughters/",
            "content": "By Staff Reporter\n\nA 25-year-old Triangle woman killed her two daughters ages four and eight by throwing them into a water canal before she attempted to commit suicide, a Chiredzi court has heard.\n\nThe woman Blessing Chiromonye, has since been taken to court facing two murder counts.\n\nShe was advised to seek bail at the High Court.\n\nAllegations are that, on January 2025, the accused threw her two daughters aged 4 and 8 into the main water canal, Triangle, resulting in their drowning and death.\n\nThe accused person tried to commit suicide by jumping into the canal but was thrown out by the water, prosecutors said.\n\nChiromonye allegedly went home and changed her wet clothes before she attempted to flee.\n\nThe driver of the commuter omnibus she took was tipped about what had transpired and drove the accused person back.\n\nA police report was made, leading to her arrest.\n\nChiromonye will be back in court on January 23 awaiting indictment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter A 25-year-old Triangle woman killed her two daughters ages four and eight by throwing them into a water canal before she attempted to commit suicide, a Chiredzi court has heard. The woman Blessing Chiromonye, has since been taken to court facing two murder counts. She was advised to seek bail at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/triangle-woman-attempts-suicide-after-killing-her-two-minor-daughters/\">Triangle woman attempts suicide after killing her two minor daughters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Netflix’s Young, Famous & African S3 promises new faces, fiery tales and ‘premium tears’",
            "url": "https://www.newzimbabwe.com/netflixs-young-famous-african-s3-promises-new-faces-fiery-tales-and-premium-tears/",
            "content": "News24\n\nNetflix announced Monday that their reality showYoung, Famous & Africanis returning for a third season.\n\nSouth African content creator Kefilwe Mabote, Nollywood star Ini Edo and entrepreneur Shakib Lutaaya are joining the show, along with the returning cast Zari Hassan, Swanky Jerry, Annie Macaulay-Idibia, Diamond Platnumz, Naked DJ, Kayleigh Schwark, Fantana, Luis Munana, Nadia Nakai and Khanyi Mbau, according to a Netflix press release.\n\nSA TV personality Bonang Matheba will not be returning for the shows third season.\n\nSocial media reactionsto the new cast additions have been positive.\n\nNetflix also dropped a trailer for the new eight-episode season, which is releasing on 17 January 2025.\n\nEight episodes pull back the curtains on fractured marriages, fragile friendships and fresh connections. It all ends in premium tears, the press release said.\n\nThe SAFTA-winning unscripted series was created by Peace Hyde and Martin Asare Amankwa, made by the production company Urban Brew Studios and Apop Media, with showrunner Jwalane Letaba.\n\nThe show is directed by Wesley Makgamatha and executively produced by Adelaide Joshua-Hill, Martin Asare-Amankwa and Peace Hyde.\n\nWATCH THE TRAILER HERE:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13184823/young-famous-african.webp",
            "description": "<p>News24 Netflix announced Monday that their reality show Young, Famous & African is returning for a third season. South African content creator Kefilwe Mabote, Nollywood star Ini Edo and entrepreneur Shakib Lutaaya are joining the show, along with the returning cast Zari Hassan, Swanky Jerry, Annie Macaulay-Idibia, Diamond Platnumz, Naked DJ, Kayleigh Schwark, Fantana, Luis Munana,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netflixs-young-famous-african-s3-promises-new-faces-fiery-tales-and-premium-tears/\">Netflix’s Young, Famous & African S3 promises new faces, fiery tales and ‘premium tears’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "From Zimbabwe to poverty: The harsh reality of migrants in South Africa",
            "url": "https://www.newzimbabwe.com/from-zimbabwe-to-poverty-the-harsh-reality-of-migrants-in-south-africa/",
            "content": "IOL\n\nWhile South Africa has long been a destination for migrants fleeing economic hardship and drought in Zimbabwe, many arrive to find a harsh reality of poverty, persecution, and xenophobia.\n\nAccording to a recentSky News report, migrants regularly cross through blind spots or use smugglers to navigate the porous border. One migrant openly admitted to crossing illegally, stating, Im not afraid to say this. Im crossing illegally here because theres no immigration or whatever. You cant stop someone suffering.\n\nFor those who make it across, the challenges only multiply. Shelters near the border, such as one for women and children, are filled with stories of despair. Some migrants, like a 14-year-old girl trafficked into South Africa, endure harrowing journeys. They passed through people who were robbing others. Some were taken away, and some were raped, she recounted.\n\nThe situation for men isnt any better. Many travel to Johannesburg only to find themselves trapped in poverty and forced into hijacked buildings. These decrepit structures are rife with overcrowding, inadequate sanitation, and the ever-present threat of fire.\n\nOne resident remarked, Youd rather be in this hijacked building than back home in Zimbabwe. Theres nothing to go back to.\n\nThe migration crisis has fueled xenophobic sentiment across South Africa. Movements like Operation Dudula have gained traction, calling for the mass deportation of undocumented immigrants.\n\nCritics argue that undocumented migrants are straining public resources and competing for jobs in an already struggling economy. Yet, human rights advocates, such as attorney Nomzamo Zondo, call for a more constructive approach.\n\nOnce you are here, how do we make sure that you are regularised, that we know who you are, and that you contribute to this economy? Zondo questioned. She warned against policies driven by hate and exclusion, urging the government to address systemic issues instead of scapegoating migrants.\n\nThe lack of border enforcement, compounded by South Africas flawed immigration system, leaves migrants in a perpetual cycle of vulnerability.\n\nAs authorities ramp up arrests and deportations, experts and activists continue to debate whether this strategy addresses the root causes or simply exacerbates the crisis.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13183224/Migrants-crossing-South-Africa-s-Limpopo-River-face-immense-challenges-from-smuggling-risks-to-xenophobic-hostility.webp",
            "description": "<p>IOL While South Africa has long been a destination for migrants fleeing economic hardship and drought in Zimbabwe, many arrive to find a harsh reality of poverty, persecution, and xenophobia. According to a recent Sky News report, migrants regularly cross through “blind spots” or use smugglers to navigate the porous border. One migrant openly admitted to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-zimbabwe-to-poverty-the-harsh-reality-of-migrants-in-south-africa/\">From Zimbabwe to poverty: The harsh reality of migrants in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Most African men at risk of prostate cancer – new study flags genetic causes",
            "url": "https://www.newzimbabwe.com/most-african-men-at-risk-of-prostate-cancer-new-study-flags-genetic-causes/",
            "content": "The Conversation\n\nA breakthrough study has identified the genetic risk factors that contribute to increased prostate cancer in African men. The study, the largest of its kind, recruited 7,500 men from eastern, southern and west Africa. The study is especially important because African men have a high risk of prostate cancer.\n\nMedical scientistWenlong Carl Chenexplains why the findings are significant and the promise they hold for future treatment.\n\nProstate cancer disproportionately affects men ofAfrican descent. Studies from the US and African countries report ahigher occurrence of prostate cancer in men of African ancestrywhen compared with men of other ancestries. Men of African and African Caribbean ancestry were also found to be at higher risk of developing amore aggressive form of prostate cancerand of developing it at a younger age when compared with men of European ancestry. Prostate cancer also accounts for nearly one-quarter of all cancer cases diagnosed in Africa.\n\nOurstudyaimed at uncovering aspects of genetic architecture of prostate cancer that were specific to men of African descent. In other words, we wanted to understand what it is about African mens genetic makeup that puts them at higher risk for prostate cancer.\n\nEvidence emerging in theliteraturesuggests that genetic risk factors significantly contribute to the development of prostate cancer. Genetic risks can be put into two groups:\n\nHereditary risk factors or germline mutations:There are rare genetic mutations in genes, such asBRCA1andBRCA2, that have been linked to increased risks for developing cancers. Mutations inBRCA2particularly are linked to higher risks of developing more aggressive prostate cancer.\n\nSingle nucleotide polymorphisms or variants:These are common genetic variants that are linked to increased disease risk. Each variant by itself confers a very small increase in risk. But several variants combined may raise the risk profiles for a disease.\n\nIn this study, we assessed the risk contributed by inherited genetic variants to prostate cancer.\n\nDespite the high burden of disease, genetic studies of prostate cancer in continental African populations are limited. The technology needed for these studies is typically very expensive and requires specialised instruments which are very scarce in Africa.\n\nTo better understand the geneticcausesof disease, we needed to study diverse populations, particularly African populations. African populations have muchhigher genetic diversitywhen compared with other populations. As the place oforigin ofHomo sapiens, the African population is much older than other populations and has therefore had more time to accumulate genetic variations.\n\nOurs is the largest study to date to investigate the ancestry-specific genetic architectures and disease associations for prostate cancer across multiple regions in sub-Saharan Africa.\n\nNumerous studies like this have been conducted worldwide. But participation from Africa, both in terms of researchers and study participants, is very low.\n\nOur consortium, theMen of African Descent, Carcinoma of the Prostate(MADCaP), was formed in 2016. Hospitals and universities in five African countries  Nigeria, Ghana, Senegal, Uganda and South Africa  partnered with several US-based universities to form the consortium. The US National Institute of Health provided funding.\n\nThe African centres enrolled men with newly diagnosed prostate cancer and, as controls, men of the same population groups who did not have cancer. Demographic, social, economic, and clinical information and bio-samples were collected from the participants.\n\nOur study consisted of 3,963 prostate cancer cases and 3,509 controls. Most bio-sample processing and genotyping was performed in Africa, using a custom genotyping array. A genotyping array provides information on hundreds of thousands of DNA variants. This specific one was designed and optimised to capture African genetic variations.\n\nWe identified three loci (genetic regions) with a strong association with increased prostate cancer incidence. The lead signals within these loci were common in African populations but were almost absent in non-African populations.\n\nAlthough these three loci were previously found in other populations, our signals within these loci are unique to African populations. They would not have been found if we had not studied African populations.\n\nThere are also differences within Africa. The genetic parts that contribute to prostate cancer risk differ by geographical population.\n\nIt is crucial to study diseases in populations with the highest disease burden.\n\nOur findings highlight the importance of studying the possible causes of disease in diverse populations.\n\nWe found novel associations by studying the genetics of prostate cancer across Africa. These signals would not have been found in studies done outside Africa.\n\nThe genetic diversity of African populations further allowed us to fine-map the regions of associations to better understand whats driving the signals.\n\nOur findings pave the way for the development of genetic tools that could grade people by their degree of risk.\n\nAnother example of this was a 2019studypublished in the American Journal of Human Genetics which used genetics to predict the risk of breast cancer. Women placed in higher risk groups would become eligible to enter the UK breast cancerscreening programmeat a much earlier age.\n\nThe results from our study will lay the foundation for the development and implementation of similar tools in an African setting.\n\nResearcher, University of the Witwatersrand\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13185524/Screenshot-2025-01-13-at-20.55.12.png",
            "description": "<p>The Conversation A breakthrough study has identified the genetic risk factors that contribute to increased prostate cancer in African men. The study, the largest of its kind, recruited 7,500 men from eastern, southern and west Africa. The study is especially important because African men have a high risk of prostate cancer. Medical scientist Wenlong Carl Chen explains</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/most-african-men-at-risk-of-prostate-cancer-new-study-flags-genetic-causes/\">Most African men at risk of prostate cancer – new study flags genetic causes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "In Pictures: Back-to-school in Harare",
            "url": "https://www.newzimbabwe.com/in-pictures-back-to-school-in-harare/",
            "content": "Below are some back-to-school pictures from Harare, where boarding school learners left for the first term of 2025, Monday.\n\nImages by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13190835/Back-to-school-10-scaled.jpg",
            "description": "<p>Below are some back-to-school pictures from Harare, where boarding school learners left for the first term of 2025, Monday. Images by Thandiwe Garusa </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-back-to-school-in-harare/\">In Pictures: Back-to-school in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "‘It was just a joke’: Zimbabwean TikTok sensation Ndoyisile Sibindi apologises after Mall of Africa rant backlash",
            "url": "https://www.newzimbabwe.com/it-was-just-a-joke-zimbabwean-tiktok-sensation-ndoyisile-sibindi-apologises-after-mall-of-africa-rant-backlash/",
            "content": "The Citizen\n\nContent creator Ndoyisile Sibindi faced backlash after a video of him ranting about overcrowding at the Mall of Africa went viral on social media.\n\nThe TikTok sensation, originally from Zimbabwe, has since apologised for his remarks, saying he did not mean to offend anyone.\n\nIn the video, Ndoyisile expressed his frustrations about people from Tembisa overcrowding the Mall of Africa.\n\nYou want to tell me that you guys leave your mall in Tembisa, if there is a mall in Tembisa, to come and overcrowd Mall of Africa?\n\nPeople are just gallivanting and occupying the mall for no reason. Its so uncomfortable for us who are claustrophobic.\n\nNdoyisiles remarks ruffled many feathers on social media, with some netizens even suggesting that he should be deported if he is in South Africa illegally.\n\nNdoyisile released another video apologising, adding that his initial video was intended to be humorous.\n\nThis video is mainly to apologise to people from Tembisa who got offended by the video that is currently circulating. First things first, Im sorry if I offended you, it was not my intention, it was just a joke.\n\nThat video was pre-recorded from my YouTube channel, from a vlog that I posted two weeks ago, he said in a now-deleted apology video.\n\nThe content creator said he recorded the video to let his followers know why he could not vlog at the mall as planned, explaining that it was due to overcrowding.\n\nHe also acknowledged the importance of respecting privacy laws, specifically the POPI Act, which prohibits recording individuals without their consent.\n\nThose words did not come from a place of being classist or suggesting that people shouldnt go to the mall. Its a mall, after all, people are bound to go there.\n\nIf you follow my content, you know that its often filled with dry humour and sarcasm, which my audience enjoys. If people didnt like my content, I wouldnt be nearing a million followers.\n\nNdoyisile also addressed questions about his nationality and the legitimacy of his documents.\n\nIve never been ashamed of where I come from. I was born and raised in Havana township in Zimbabwe. Im proud of my roots, and Im not hiding anything.\n\nShowing his passport, he added: I dont understand the narrative that people are trying to push on social media, and this is my passport with my last travel, which was to Swaziland. When talking about documentation, we are not talking about a bunch of papers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13151124/Ndoyisile-mall-of-africa-apology.jpg",
            "description": "<p>The Citizen Content creator Ndoyisile Sibindi faced backlash after a video of him ranting about overcrowding at the Mall of Africa went viral on social media. The TikTok sensation, originally from Zimbabwe, has since apologised for his remarks, saying he did not mean to offend anyone. In the video, Ndoyisile expressed his frustrations about people</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-was-just-a-joke-zimbabwean-tiktok-sensation-ndoyisile-sibindi-apologises-after-mall-of-africa-rant-backlash/\">‘It was just a joke’: Zimbabwean TikTok sensation Ndoyisile Sibindi apologises after Mall of Africa rant backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "Diaspora Marriages  –  Can Counselling Keep Couples Connected?",
            "url": "https://www.newzimbabwe.com/diaspora-marriages-can-counselling-keep-couples-connected/",
            "content": "Zimbabwe has long been shaped by migration. Many families are split between those who remain at home and those who seek better opportunities abroad. These separations often lead to long-distance marriages that face unique challenges. While remittances can ease financial burdens, the emotional cost of separation is more challenging to address.\n\nDiaspora marriages often struggle with trust, communication, and maintaining emotional intimacy. Partners in different countries experience life differently, leading to a growing gap in shared experiences. For some, cultural adjustments in new countries create conflicts as values shift, often without the other partners knowledge. Time zone differences, work pressures, and the lack of physical presence compound these issues, leaving both partners isolated.\n\nInfidelity, mistrust, and financial disagreements are common problems. One partner may suspect the other of infidelity or feel neglected due to reduced communication. On the other hand, the partner abroad may feel unappreciated despite their efforts to support the family financially. These tensions can cause resentment, making the relationship increasingly fragile.\n\nHow Marriage Counselling Can Help\n\nIncreasingly, especially in our online world, marriage counselling, offers a solution for couples facing these challenges. It provides a neutral platform where both partners can express their concerns without fear of judgment. Counsellors help couples rebuild trust and develop strategies for managing long-distance relationships. They focus on improving communication and helping partners understand each others needs and expectations.\n\nOnline counselling has become particularly relevant for diaspora marriages. Virtual sessions offer flexibility, allowing couples in different time zones to participate without disrupting their schedules. Platforms likeTherapyRoutethat connect individuals with trained professionals experienced in diaspora marriage issues make this more accessible.\n\nLocal support is also available. Organizations such as theChristian Counselling Centre in Harareprovide faith-based guidance that aligns with cultural and religious values.\n\nPractical Steps for Strengthening Diaspora Marriages\n\nAddressing the challenges of a long-distance marriage starts with honest communication.\n\nPartners must commit to regular check-ins, whether through video calls, voice notes, or written messages. Setting aside time to connect emotionallyeven with tight scheduleshelps keep the relationship alive.\n\nTrust is often key to successful long-distance relationships. Counsellors guide couples in rebuilding trust by addressing underlying insecurities and agreeing on boundaries. This process might include setting expectations around finances, social interactions, or how decisions are made while apart. Clear agreements reduce misunderstandings and help both partners feel secure.\n\nAnother critical aspect is maintaining a shared vision for the future. Partners should discuss their long-term goals: Will the family reunite? What sacrifices are necessary to achieve financial or career objectives? Counsellors often encourage couples to keep these conversations ongoing, ensuring both feel involved in shaping their future.\n\nWhile counselling sessions are key, couples must also take practical steps outside therapy. Shared rituals, such as watching the same movie from different locations or praying together over the phone, can foster emotional closeness. Sending thoughtful messages or small gifts can remind a partner they are valued and appreciated.\n\nA Final Word on Diaspora Marriages\n\nDiaspora marriages are a testament to resilience and sacrifice. They endure long distances, cultural adjustments, and financial pressures, all in pursuit of better opportunities. But these challenges can strain even the strongest relationships.\n\nMarriage counselling, when approached with an open mind, equips couples with the tools to communicate better, resolve conflicts, and maintain emotional intimacy. The journey is not easy, but with effort, patience, and the right support, it can lead to stronger, more fulfilling relationships.\n\nIf you or someone you know is navigating the complexities of a diaspora marriage, take that first step and reach out to trusted community leaders or professionals, and commit to investing in the future of your partnership.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/05001007/Marriage.png",
            "description": "<p>Zimbabwe has long been shaped by migration. Many families are split between those who remain at home and those who seek better opportunities abroad. These separations often lead to long-distance marriages that face unique challenges. While remittances can ease financial burdens, the emotional cost of separation is more challenging to address. Diaspora marriages often struggle</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-marriages-can-counselling-keep-couples-connected/\">Diaspora Marriages  –  Can Counselling Keep Couples Connected?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        },
        {
            "title": "In Pictures: South African police thwart major smuggling operation along Limpopo river, seizing goods worth R500,000",
            "url": "https://www.newzimbabwe.com/in-pictures-south-african-police-thwart-major-smuggling-operation-along-limpopo-river-seizing-goods-worth-r500000/",
            "content": "IOL\n\nA gangs attempt to smuggle goods into South Africa hit a major snag after the South African Police Service (SAPS) thwarted their operations and seized their goods.\n\nPolice said the confiscated items, which were likely being smuggled across the border, include alcoholic beverages, energy drinks, baked goods, flour, and other consumer goods, along with a chest fridge.\n\nLimpopo police spokesperson, Lieutenant Colonel Stephen Thakeng, said the items were confiscated along the Limpopo River, in the Musina policing area in Saturday morning.\n\nAt around 11.20am, the SAPS Operations Vala Umgodi National Prevention team was conducting a routine patrol near the Tshirundu village when they received a tip-off about eight boats loading goods, Thakeng said.\n\nHe said when the gang saw police, they got back into the boats and fled back to Zimbabwe, abandoning their loot.\n\nThe teams efforts were hailed by provincial police commissioner, Lieutenant General Thembi Hadebe.\n\nWell done to the team for their swift and decisive action, noting that the success of the operation highlights the SAPSs ongoing commitment to combating cross-border crimes and illegal trade activities, Hadebe said.\n\nAll seized items have been registered at the Musina SAPS for further investigation and processing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13073421/The-South-African-Police-Service-Operation-Vala-Umgodi-National-Intervention-team-has-successfully-thwarted-a-major-smuggling-operation-along-the-Limpopo-River-in-Musina.webp",
            "description": "<p>IOL A gang’s attempt to smuggle goods into South Africa hit a major snag after the South African Police Service (SAPS) thwarted their operations and seized their goods. Police said the confiscated items, which were likely being smuggled across the border, include alcoholic beverages, energy drinks, baked goods, flour, and other consumer goods, along with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-south-african-police-thwart-major-smuggling-operation-along-limpopo-river-seizing-goods-worth-r500000/\">In Pictures: South African police thwart major smuggling operation along Limpopo river, seizing goods worth R500,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "14 Jan 2025"
        }
    ]
}