{
    "news": [
        {
            "title": "Opposition CCC “shocked” as Parliament ignores court challenge, effects changes made by Tshabangu",
            "url": "https://www.newzimbabwe.com/opposition-ccc-shocked-as-parliament-ignores-court-challenge-effects-changes-made-by-tshabangu/",
            "content": "By Darlington Gatsi\n\nCITIZENS Coalition for Change (CCC) has expressed its dismay at the Parliaments decision to act on the directive of self-imposed Secretary General Sengezo Tshabangu, who reshuffled the oppositions parliamentary hierarchy.\n\nTensions are simmering in the CCC which is led by Welshman Ncube after Tshabangus unilateral decision to demote the Chief whip and the Leader of the Opposition in the national assembly.\n\nThe power trip by Tshabangu incensed the Welshman Ncube party which has approached the High Court in Bulawayo challenging the changes.\n\nCCC argues that Tshabangu does not have the authority to effect changes in parliament without the approval of the party.\n\nDespite the High Court challenge, Parliament announced the changes in the National Assembly with Lynnette Karenyi Kore being replaced by Maureen Kademaunga as the Leader of the Opposition.\n\nNonhlahla Mlotshwa is the overall Chief Whip of the opposition, a position which the CCC is disputing.\n\nCCC spokesperson WilliasMadzimure said he was alarmed by the Parliaments decision to effect changes.\n\nRELATED:\n\nThe matter is before the court and according to the Courts the matter will be heard on Friday and it is alarming. It is shocking that after the speaker had been served with the court papers, he went on to make the arrangement.\n\nAs a party, we are operating in a normal democracy where the rule of law is respected when we have such a situation, we approach the courts, said Madzimure.\n\nCCC has been fragmented following Tshabangus reign of terror in the opposition in which he recalled elected officials resulting in then leader Nelson Chamisa dumping the opposition party.\n\nAfter the announcement in Parliament, CCC legislator Darlington Chigumbu registered his displeasureover the changes.\n\nI feel that as a Member of Parliament from this side, my rights are being infringed upon. I feel that what is happening in Parliament is not acceptable, said Chigumbu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/13200646/Jacob-Mudenda-.jpg",
            "description": "<p>By Darlington Gatsi CITIZENS Coalition for Change (CCC) has expressed its dismay at the Parliament’s decision to act on the directive of self-imposed Secretary General Sengezo Tshabangu, who reshuffled the opposition’s parliamentary hierarchy. Tensions are simmering in the CCC which is led by Welshman Ncube after Tshabangu’s unilateral decision to demote the Chief whip and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-ccc-shocked-as-parliament-ignores-court-challenge-effects-changes-made-by-tshabangu/\">Opposition CCC “shocked” as Parliament ignores court challenge, effects changes made by Tshabangu</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "SA taxi driver arrested for smuggling children from Zimbabwe",
            "url": "https://www.newzimbabwe.com/sa-taxi-driver-arrested-for-smuggling-children-from-zimbabwe/",
            "content": "TimesLive\n\nThe Border Management Authority (BMA) apprehended an SA minibus taxi driver allegedly trying to smuggle undocumented foreign children into the country through the Beitbridge port of entry.\n\nThe BMA said the taxi driver was carrying 25 undocumented foreigners when he was intercepted on Monday. His passengers included 20 children aged between five and 14 years old, who were unlawfully transported under dangerous and inhuman conditions, BMA spokesperson Mmemme Mogotsi said.\n\nThe vehicle used was impounded. The driver has been charged and is in police custody and a conveyance fine of R375,000 has been issued in accordance with the Immigration Act, Mogotsi said.\n\nFollowing standard protocols, the children were handed over to the Zimbabwean child welfare authorities for their safety and care while investigations continued.\n\nBMA acting commissioner Jane Thupana said the operation highlighted the BMAs efforts to disrupt criminal networks that exploited vulnerable people, particularly children.\n\nThe trafficking and smuggling of people undermines human dignity and border security and the BMA remains vigilant in its efforts to safeguard South Africas ports of entry and protect those at risk, she said.\n\nThe commissioner said the BMA will continue to work closely with other law enforcement to curb illegal activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12060042/children.png",
            "description": "<p>TimesLive The Border Management Authority (BMA) apprehended an SA minibus taxi driver allegedly trying to smuggle undocumented foreign children into the country through the Beitbridge port of entry. The BMA said the taxi driver was carrying 25 undocumented foreigners when he was intercepted on Monday. His passengers included 20 children aged between five and 14</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sa-taxi-driver-arrested-for-smuggling-children-from-zimbabwe/\">SA taxi driver arrested for smuggling children from Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "Mnangagwa rewards Sables for winning Rugby Africa Cup",
            "url": "https://www.newzimbabwe.com/mnangagwa-rewards-sables-for-winning-rugby-africa-cup/",
            "content": "By Sport Reporter\n\nFour months after winning the Rugby Africa Cup, Zimbabwes senior mens rugby team was on Wednesday rewarded with US$6 500 each by President Emerson Mnangagwa at the State House.\n\nThe Sables reward comes barely a week after Mnangagwa rewarded the Warriors for 2025 AFCON qualification.\n\nZimbabwe rugby team won the Africa Cup in August to end a 12-year trophy drought, an achievement masterminded by team coach Piet Benade.\n\nSpeaking during the presentation, Mnangagwa applauded the Sables for winning the countrys second Rugby Africa Cup title in history saying it is a true sign of hard work.\n\nThe nation honours the teamwork and patriotism that you demonstrated throughout the championship, which brought the team this success of being crowned champions.\n\nThis historic achievement reflects your dedication and perseverance as players, coaches, and support staff.\n\nI am aware that the journey that led to this momentous occasion was not an easy one. As a team, you endured rigorous training sessions and extraordinary pressure on and off the field as you faced competitive as well as aggressive opponents, he said.\n\nZimbabwe senior mens rugby team had a good 2024 season campaign, other than winning the Rugby Africa Cup, the team ended its 23-year-old winless run against fellow Southern Africa rivals Namibia.\n\nApart from continental success, Zimbabwe recently recorded its first victory against a team outside the African continent when it won against the United Arab Emirates and South Korea during its Middle East  Asia tour last month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12055541/Sables-money.jpg",
            "description": "<p>By Sport Reporter Four months after winning the Rugby Africa Cup, Zimbabwe’s senior men’s rugby team was on Wednesday rewarded with US$6 500 each by President Emerson Mnangagwa at the State House. The Sables reward comes barely a week after Mnangagwa rewarded the Warriors for 2025 AFCON qualification. Zimbabwe rugby team won the Africa Cup</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-rewards-sables-for-winning-rugby-africa-cup/\">Mnangagwa rewards Sables for winning Rugby Africa Cup </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "Tanganda ‘reverses’ full-scale VFEX listing decision",
            "url": "https://www.newzimbabwe.com/tanganda-reverses-full-scale-vfex-listing-decision/",
            "content": "By Alois Vinga\n\nLISTED horticulture concern, Tanganda Tea Company (TTC) has rescinded the decision to migrate its stocks to the Victoria Falls Exchange (VFEX), instead opting to pursue a special listing on the US$-only denominated stocks market.\n\nLast month, Tanganda board of directors announced plans to hold discussions aimed at relocating the companys listing to capitalise on VFEXs stable currency environment and incentives, reflecting a growing trend among Zimbabwean firms.\n\nThe firm, which rejoined the ZSE on February 3, 2022, with an initial market capitalisation of US$134.29 million, has faced significant losses attributed to currency volatility and economic shifts. Following the scrapping of the Zimbabwe dollar and the introduction of the Zimbabwe Gold (ZiG) currency in April, Tangandas valuation dropped to US$21.67 million, marking a loss of approximately US$112.62 million in market value since its ZSE listing.\n\nBut in a major climb down this week, Tanganda informed its shareholders that the decision for a full-scale migration will no longer be the case.\n\nReference is made to the Cautionary Announcements published on 28 October 2024 and 18 November 2024 regarding the proposed migration of Tanganda listing from the Zimbabwe Stock Exchange (ZSE) to the Victoria Falls Stock Exchange (VFEX) and the subsequent capital raise by way of a Renouncable Rights Offer to raise approximately US$7,7 million.\n\nThe Directors no longer recommend the migration of Tangandas listing to VFEX. Instead, they propose the creation of a class of shares to be known as Class A ordinary shares, which will be subsequently listed on the VFEX as a Secondary listing, the company said.\n\nThe company said a capital raise by way of a Renounceable Rights Offer to raise US$8 million will follow soon after the issuing, listing and allotment of Class A ordinary shares to the existing ordinary shareholders in proportion to their shareholding in the company.\n\nTanganda believes such initiatives are intended to enhance the companys capital structure, diversify shareholder offerings and ensure liquidity of the companys shares.\n\nFurther details regarding the transactions will be provided in a Circular to shareholders that is being finalized.\n\nThe transactions, if successful, may have a material effect on the Companys share price. Accordingly, shareholders are advised to exercise caution when dealing in the Companys shares, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/09174617/tanganda-tea-estate.gif",
            "description": "<p>By Alois Vinga LISTED horticulture concern, Tanganda Tea Company (TTC) has rescinded the decision to migrate its stocks to the Victoria Falls Exchange (VFEX), instead opting to pursue a special listing on the US$-only denominated stocks market. Last month, Tanganda board of directors announced plans to hold discussions aimed at relocating the company’s listing to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanganda-reverses-full-scale-vfex-listing-decision/\">Tanganda ‘reverses’ full-scale VFEX listing decision</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "Bindura targets Masembura Dam for water supply; slams miners for pollutants",
            "url": "https://www.newzimbabwe.com/bindura-targets-masembura-dam-for-water-supply-slams-miners-for-pollutants/",
            "content": "By Alois Vinga\n\nBINDURA Town Council (BTC) says it is now targeting Masembura Dam as a source of clean water supply as a strategy to circumvent highly polluted water bodies due to illegal small-scale mining activities in the area.\n\nResponding to concerns raised by stakeholders from Mashonaland Central Province during the 16 days of activism against Gender-Based Violence (GBV) organized by the Economic Justice For Womens Project (EJWP) Tuesday, Bindura Ward 6 Councilor, Oliver Mukombwe bemoaned rampant pollution of water bodies.\n\nWe get our water from Mazowe River but mining activities in Mashonaland Central Province continue to defile the water sources. Indeed, we are currently spending much more money than what Harare spends cleaning our polluted water, he said.\n\nHe said in the recent past, the local authority once roped in officials from the Zimbabwe Republic Police (ZRP) and the Zimbabwe National Army (ZNA) to stop mining activities along Mazowe River in an operation which worked briefly before it resurfaced again.\n\nThe local authority has since tabled plans to draw water from Masembura Dam using a pipeline which runs straight to the Bindura Waterworks. The plans were arranged about two years ago and we are now awaiting government approvals, he said.\n\nThe project is set to establisha 25-kilometre water pipeline from Masembura Dam to the capital of Mashonaland Central Province.\n\nThe government and Freda Rebecca Mine are part and parcel of the tripartite arrangement. The collaboration, which involves the government, will lead to the construction of a self-contained smart city at Bharasi Farm, about 10 kilometres from the Central Business District.\n\nRecords also show that obsolete equipment has dogged the Towns efforts to maintain a steady water supply over the years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12053226/masembura.png",
            "description": "<p>By Alois Vinga BINDURA Town Council (BTC) says it is now targeting Masembura Dam as a source of clean water supply as a strategy to circumvent highly polluted water bodies due to illegal small-scale mining activities in the area. Responding to concerns raised by stakeholders from Mashonaland Central Province during the 16 days of activism</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bindura-targets-masembura-dam-for-water-supply-slams-miners-for-pollutants/\">Bindura targets Masembura Dam for water supply; slams miners for pollutants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "ZIFA Elections: Muponda pulls out of “financially demanding”race, now backing “most deserving candidate” Magwizi",
            "url": "https://www.newzimbabwe.com/zifa-elections-muponda-pulls-out-of-financially-demandingrace-now-backing-most-deserving-candidate-magwizi/",
            "content": "By Sport Reporter\n\nAspiring ZIFA president Gilbert Muponda has pulled out of the race with less than 40 days to the federations polls which are scheduled for January 25.\n\nMponda announced this development in astatement posted on his social media pages.\n\nThe Harare-based businessman said he is now rallying behind another candidate Nqobile Magwizi whom he shares the same vision.\n\nAfter wide consultation, I have decided to withdraw from the ZIFA President elections.\n\nI fully endorse Nqobile Magwizi as the most qualifiedand deserving candidate whocan revive our game.\n\nNgobile Magwizi is qualified, experienced and has a clean proven record of mobilizing resources for the game.\n\nHe is the most deserving candidate who possesses the necessary skills and expertise required to transform Zimbabwean football, said Mponda.\n\nIn an interview on Sunday, Muponda highlighted that the election was financially demanding as ZIFA councillors demand a lot of money.\n\nMeeting these councillors to share your manifesto is very difficult because they demand money.\n\nWe are talking about spending $500 or more per person, so if they are ten, you need US$5000.\n\nBut this is not much because other competing candidates might even splash more than that, so it is very difficult to campaign, he said.\n\nMeanwhile, the ZIFA elections nominations closed on Wednesday and the football mother body is expected to publish all candidates who submitted on Thursday.\n\nAfter that, the candidates will undergo an integrity test, the final grading process for running for office.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/08195429/Gilbert-Muponda.png",
            "description": "<p>By Sport Reporter   Aspiring ZIFA president Gilbert Muponda has pulled out of the race with less than 40 days to the federation’s polls which are scheduled for January 25. Mponda announced this development in a statement posted on his social media pages. The Harare-based businessman said he is now rallying behind another candidate Nqobile Magwizi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-elections-muponda-pulls-out-of-financially-demandingrace-now-backing-most-deserving-candidate-magwizi/\">ZIFA Elections: Muponda pulls out of “financially demanding”race, now backing “most deserving candidate” Magwizi</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "600 pupils and teachers face danger of school collapse after artisanal miners burrow tunnels under classrooms",
            "url": "https://www.newzimbabwe.com/600-pupils-and-teachers-face-danger-of-school-collapse-after-artisanal-miners-burrow-tunnels-under-classrooms/",
            "content": "By James Muonwa l Mashonaland West Correspondent\n\nAT least 600 pupils and 22 teachers at Dalny Mine 2 Primary School in Sanyati district, Mashonaland West province, face the spectre of sinking into holes dug up by artisanal gold miners.\n\nThe daring treasure hunters are burrowing tunnels under infrastructure at the school posing danger to learners and teachers.\n\nThe Amalgamated Rural Teachers Union (ARTUZ) in a statement Wednesday warned of the perilous conditions pupils and educators are being exposed to at the institution.\n\nDalny Mine 2 Primary School in Sanyati district, Mashonaland West province is on the verge of collapsing as artisanal miners dig tunnels below the school infrastructure.\n\nThe fate of Globe and Phoenix Primary will soon meet the Sanyati located school. Just like we did before Globe & Phoenix Primary collapsed, we are calling upon law enforcement agents to intervene and #SaveDalnyPrimary from collapse, said ARTUZ led by Obert Masaraure.\n\nIllegal artisanal mining is leaving a trail of ecological and infrastructure destruction in the said community. We are worried that when schools open in January 2025, Dalny Primary will be no more\n\nDalny 2 Primary has an enrollment of over 600 learners attended to by 22 patriotic teachers. If Dalny Primary School collapses when schools are open these lives can potentially be lost.\n\nThe closest school to Dalny Primary is Dalny 1 Primary which already accommodates 1 500 learners. There is no room for the 600 learners from Dalny 2. If Dalny Mine 2 Primary School is allowed to collapse 600 learners will be out of school, ARTUZ further said.\n\nThe teachers body said Zimbabwe already has a shortage of over 3,000 schools, and cannot afford to lose a great facility such as Dalny Primary School.\n\nIn 2023, Dalny Mine 2 had a Grade 7 pass rate of 26.8% which marginally improved to 26.9% in 2024. With all the challenges confronting education in Zimbabwe, the school is doing their best.\n\nARTUZ said the right to education for 600 learners can be secured while the right to a safe working environment for teachers can also be guaranteed and safety for the whole school ecosystem promoted.\n\nWhen NewZimbabwe.com contacted the Ministry of Primary and Secondary Education communications director, Taungana Ndoro, said inter-ministerial efforts were being implemented to fix the matter.\n\nWe are aware of the matter and are working together through a whole of government approach involving the Ministry of Mines, Local Government, Environment, Provincial Affairs and Devolution to find a lasting solution that will ensure that we continue to provide quality education in a safe learning environment, Ndoro told NewZimbabwe.com.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/11204504/WhatsApp-Image-2024-12-11-at-11.52.40.jpeg",
            "description": "<p>By James Muonwa l Mashonaland West Correspondent AT least 600 pupils and 22 teachers at Dalny Mine 2 Primary School in Sanyati district, Mashonaland West province, face the spectre of sinking into holes dug up by artisanal gold miners. The daring treasure hunters are burrowing tunnels under infrastructure at the school posing danger to learners</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/600-pupils-and-teachers-face-danger-of-school-collapse-after-artisanal-miners-burrow-tunnels-under-classrooms/\">600 pupils and teachers face danger of school collapse after artisanal miners burrow tunnels under classrooms </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "Disgraced former VP Mphoko to be buried at his Bulawayo home as family snubs Heroes Acre",
            "url": "https://www.newzimbabwe.com/disgraced-former-vp-mphoko-to-be-buried-at-his-bulawayo-home-as-family-snubs-heroes-acre/",
            "content": "By Leopold Munhende\n\nDISGRACED former Vice President Phelekezela Mphokos family has snubbed Zanu PF overtures to have him buried at the Heroes Acre and announced he will be interred at his Bulawayo home instead.\n\nThe late Mphoko was one of President Robert Mugabes last deputies before he was deposed in a 2017 military-led coup that also toppled his leader and replaced him with Emmerson Mnangagwa.\n\nAfter passing on last week, the ruling Zanu PF party had declared him a national hero, with Vice President Constantino Chiwenga showering praises on him despite having been the face of the coup that hounded him out of office.\n\nChiwenga glowingly described Mphoko as a resolute giant of the liberation struggle.\n\nThat, however, was not enough to convince Mphokos family.\n\nOn behalf of the family, I hereby confirm that my fathers wish has been granted. He will be laid to rest at his home in Bulawayo, said one of his children, Siduduzo Mphoko.\n\nMnangagwa and his Politburo had hoped Mphoko would sanitise their 2017 actions by having him buried at the national shrine according to sources from within the party.\n\nThe family insisted from the on-set that it was never Cde Reports wish that he be buried at the Heroes Acre, said a source.\n\nHe was yet to forgive individuals responsible for what happened to him in 2017 and we are sure would never have accepted that.\n\nDespite efforts by Zanu PF to have him buried there, the general thinking by the family was that he would then sanitise the illegal acts of the army, current President and his deputy.\n\nMphokos liberation war name was Cde Report.\n\nHe was a delegate at the 1979 Lancaster House Conference that determined conditions for Zimbabwes eventual independence in 1980. He was part of late Vice President Joshua Nkomos ZAPU delegation.\n\nMphoko had been relegated to ordinary life, having to deal with a nagging court which periodically demanded that he avail himself at the Harare Magistrate Courts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/01054102/VP-Mphoko-e1539571021964.jpg",
            "description": "<p>By Leopold Munhende DISGRACED former Vice President Phelekezela Mphoko’s family has snubbed Zanu PF overtures to have him buried at the Heroes Acre and announced he will be interred at his Bulawayo home instead. The late Mphoko was one of President Robert Mugabe’s last deputies before he was deposed in a 2017 military-led coup that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/disgraced-former-vp-mphoko-to-be-buried-at-his-bulawayo-home-as-family-snubs-heroes-acre/\">Disgraced former VP Mphoko to be buried at his Bulawayo home as family snubs Heroes Acre</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "Parliament reshuffles Committee Chairpersons as Jere, Chiduwa and Khupe are reassigned",
            "url": "https://www.newzimbabwe.com/parliament-reshuffles-committee-chairpersons-as-jere-chiduwa-and-khupe-are-reassigned/",
            "content": "By Darlington Gatsi\n\nPARLIAMENT has reshuffled the chairpersons of various committees, with Murehwa West Member of Parliament Farai Jere and Clement Chiduwa being reassigned.\n\nJere, who was serving on the Sports, Arts, and Recreation Committee, has replaced Chamu Chiwanza as its chairperson. The committee has been holding the Ministry of Sports, Arts, and Recreation accountable for the improvement of sports facilities in the country.\n\nInterestingly, Clement Chiduwa, who was previously chairing the Parliamentary Portfolio Committee on Budget and Finance, has been reassigned to the Industry and Commerce Committee, and he has been succeeded by Energy Mutodi.\n\nFormer Minister of Information and Communication Technology, Supa Mandiwanzira, has been appointed to chair the Primary and Secondary Education Committee, moving from the Local Government and Public Works Committee.\n\nReshuffled Committee Chairpersons\n\nHon. Dr. T. Khupe  Committee on Higher and Tertiary Education, Innovation, Science and Technology.\n\nHon. I. Ndudzo  Committee on Justice, Legal and Parliamentary Affairs.\n\nHon. J. Tshuma  Committee on Local Government, Public Works and National Housing.\n\nHon. D. Malinganiso  Committee on Public Service, Labour and Social Welfare;\n\nHon. E. Mutodi  Committee on Budget, Finance and Economic Development.\n\nHon. E. Maoneke  Committee on Defence, Home Affairs.Security Services and War Veterans.\n\nHon. T. Karikoga  Committee on Transport and Infrastructural Development.\n\nHon. S. Mandiwanzira  Committee on Primary and SecondaryEducation\n\nHon. F. Jere  Committee on Sports, Recreation, Arts and Culture;\n\nHon. C. Chiduwa  Committee on Industry and Commerce.\n\nHon. J. Samkange  Parliamentary Legal Committee.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/15220839/Farai-Jere.png",
            "description": "<p>By Darlington Gatsi  PARLIAMENT has reshuffled the chairpersons of various committees, with Murehwa West Member of Parliament Farai Jere and Clement Chiduwa being reassigned. Jere, who was serving on the Sports, Arts, and Recreation Committee, has replaced Chamu Chiwanza as its chairperson. The committee has been holding the Ministry of Sports, Arts, and Recreation accountable</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-reshuffles-committee-chairpersons-as-jere-chiduwa-and-khupe-are-reassigned/\">Parliament reshuffles Committee Chairpersons as Jere, Chiduwa and Khupe are reassigned </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        },
        {
            "title": "What are the advantages that tall footballers have?",
            "url": "https://www.newzimbabwe.com/what-are-the-advantages-that-tall-footballers-have/",
            "content": "Tall footballers often possess distinct advantages on the field that can enhance their overall performance. A greatbet Kenya platformis 1xBet, which also happens to feature wagers on these kinds of players.\n\nOne of the most obvious benefits is their physical presence. With height comes a larger reach, which can be a game-changer in both offensive and defensive situations. For defenders, being tall allows them to dominate aerial duels, whether its clearing a corner kick or winning headers against attacking players. This ability to win aerial battles is crucial, especially in set-piece situations. The 1xBet Kenya platform allows you to bet on everything that happens on set-piece situations too.\n\nIn attack, height can also be an advantage. Taller forwards are often more effective in heading the ball, making them a greater threat during 2 particular situations: crosses or long balls into the box. A towering striker can out-jump defenders and score crucial goals from headers. This is a skill thats highly valued in teams with a focus on crossing the ball into the box. Football fans can findlive sports betting with great oddsat 1xBet, where profitable wagers can be made on everything that happens in the box too.\n\nMoreover, tall players tend to have a physicality that can help them do 2 key actions: hold off defenders and create space for themselves or teammates.\n\nIn addition to the aerial game, tall footballers often have an advantage in shielding the ball. By going to 1xBet, punters will also be able to findlive sports betting withamazingly great oddsthat can be made on footballers that display different characteristics.\n\nTheir stature enables them to protect the ball from opposing players thanks to 2 things: a low center of gravity and a powerful frame. This can be especially helpful in 2 particular situations: holding up play or waiting for support from teammates.\n\nFurthermore, height can assist with other 2 aspects: vision and passing. Tall players, particularly midfielders, often have a better view of the field, helping them make accurate, long-range passes. Of course, thehttp://1xbet.co.ke/line/footballwebsite also has plenty of wagers on great football midfielders too.\n\nThey can also see over shorter players in crowded moments, making it easier to spot openings or execute strategic plays.\n\nWhile height alone isnt enough to guarantee success, it undoubtedly gives tall footballers key physical advantages, especially in 3 different situations:\n\nMany different footballers can be wagered at any moment at the 1xBet platform.\n\nDisclaimer:\n\nBCLB : 0000348\n\n18+\n\nT@C apply\n\nPlay responsibly\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/11170021/Screenshot-2024-12-11-at-18.59.22.png",
            "description": "<p>Tall footballers often possess distinct advantages on the field that can enhance their overall performance. A great bet Kenya platform is 1xBet, which also happens to feature wagers on these kinds of players. One of the most obvious benefits is their physical presence. With height comes a larger reach, which can be a game-changer in both</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-are-the-advantages-that-tall-footballers-have/\">What are the advantages that tall footballers have?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 08:42:18"
        }
    ]
}