{
    "news": [
        {
            "title": "Wolverhampton make crazy offer to Reims for Marshall Munetsi",
            "url": "https://www.newzimbabwe.com/wolverhampton-make-crazy-offer-to-reims-for-marshall-munetsi/",
            "content": "Foot Mercato\n\nWolverhamptonandLigue 1are definitelya love story. This winter, Wolves already put 20 million on the table to snatch Emmanuel Agbadou, the central defender of Stade deReims. But if the English club is very Portuguese-speaking under the impetus of the inevitable Portuguese agent Jorge Mendes, the current 17th in thePremier Leaguehas decided to bet big on the French championship.\n\nWhile the Wolves management has already attempted an incursion into the Kevin Danso file of RC Lens (who finally signed with Tottenham as we revealed exclusively on Saturday evening), made an offer to AS Monaco for Soungoutou Magassa and even considered Zakaria Aboukhlal of Toulouse as a priority for a time, another Ligue 1 player has caught Wolverhamptons eye.\n\nIndeed, according to our information, the Wolverhampton club is very interested inMarshall Munetsi. The Stade de Reims midfielder, a real pillar of the Champagne club since his arrival in 2019 from Orlando Pirates with 21 goals and 14 assists in 159 matches played. A nice total for the midfielder who is very forward-oriented and also very committed to his country. In May 2023, during his extension, his club had committed to including an original clause in his contract, which promised the payment of 100 euros to his foundation, for each kilometer traveled in a match, which raised more than 30,000 for his eponymous foundation working to educate children in Zimbabwe,\n\nWolverhampton, who are looking to strengthen their midfield to get out of the Premier Leagues depths, are looking to complete the transfer by tonight and the end of the transfer window. To force Stade de Reims to give in, a very large sum, probably in the same range as that paid for Agbadou, has been put on the table. According to our information, discussions are underway between the two teams and Reims could see their best player leave Champagne this Monday. Which would be a huge sporting blow for the Marne club, but a huge financial blow\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/28110801/27_09_reims_munetsi_2.jpg",
            "description": "<p>Foot Mercato After securing Emmanuel Agbadou at the start of the transfer window for a check for €20 million, Wolverhampton wants to get Reims pillar Marshall Munetsi, even if it means putting a very big check on the table… Wolverhampton and Ligue 1 are definitely a love story. This winter, Wolves already put €20 million on the table to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wolverhampton-make-crazy-offer-to-reims-for-marshall-munetsi/\">Wolverhampton make crazy offer to Reims for Marshall Munetsi</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "It never rains but pours: ZACC goes after Magaya over fake UNISA qualifications",
            "url": "https://www.newzimbabwe.com/it-never-rains-but-pours-zacc-goes-after-magaya-over-fake-unisa-qualifications/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Anti-Corruption Commission has launched a fraud investigation into Walter Magaya after the University of South Africa (UNISA) revealed that the diploma he presented to ZIFA and the High Court was fake.\n\nIn his fight back into the ZIFA presidential race, Magaya submitted a photocopied and certified diploma in marketing which he claimed he attained at UNISA. He was disqualified from the race as he did not have the required five Ordinary Level passes and was challenging this decision, arguing that he was in fact overqualified.\n\nThe photocopy of the fake diploma was certified and stamped as a true copyof the original by the Officer in Charge at Waterfalls PoliceStation, Harare.\n\nRELATED:\n\nFollowing an investigation by Dug Up,UNISA revealedMagaya did not graduate from the institution and was never awarded any honorary doctorate as he has claimed over the years.\n\nThe university has never conferred any honorary doctorate on Mr Magaya and strongly condemns this false claim.\n\nWe believe that conduct of this nature damages and brings our brand into disrepute and we reserve the right to take appropriate corrective action. Relevant authorities within the university have therefore been requested to take the necessary legal action in this regard, UNISA said in a statement.\n\nIn documents seen by NewZimbabwe.com, ZACC wrote to ZIFA on the 31stof January requesting documents submitted by Magaya when he applied to run for president in last months elections.\n\nZACC also wrote to the Judicial Services Commission requesting a record of proceedings in Magayas High Court application challenging ZIFAs decision to disqualify him from the elections.\n\nThe anti-corruption commission said the documents are to facilitate its investigations in a case of fraud.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Anti-Corruption Commission has launched a fraud investigation into Walter Magaya after the University of South Africa (UNISA) revealed that the diploma he presented to ZIFA and the High Court was fake. In his fight back into the ZIFA presidential race, Magaya submitted a photocopied and certified diploma in marketing which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-never-rains-but-pours-zacc-goes-after-magaya-over-fake-unisa-qualifications/\">It never rains but pours: ZACC goes after Magaya over fake UNISA qualifications</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "From tattoos to disappearing acts and a lavish lifestyle in Dubai — Khanyi and Kudzai’s five-year relationship ends",
            "url": "https://www.newzimbabwe.com/from-tattoos-to-disappearing-acts-and-a-lavish-lifestyle-in-dubai-khanyi-and-kudzais-five-year-relationship-ends/",
            "content": "TimesLive\n\nKhanyi Mbau and her beau Kudzai Mushonga have called it quits.\n\nFrom romantic gestures to a lavish lifestyle in Dubai and dramatic disappearing acts, the couples relationship was a talking point on social media from the moment it was revealed.\n\nHere is a timeline of their love:\n\nThe couple first caught many peoples attention when they started posting pictures of each other on Instagram in early January 2021.\n\nSocial media detectives quickly identified her new man as a Zimbabwean millionaire and an alleged fugitive.\n\nTshisaLIVEs Zimbabwean correspondent connected Kudzai to the countrys rich gangs and the lateGenius Ginimbi Kadungure,who died ina road accidentwith three other people when his Rolls-Royce hit a tree.\n\nKudzai was also said to be on the Zimbabwean polices wanted list. On June 13 2017 at age 25, Kudzai together with friends Tatenda Mandimutsira and Njabulo Ndebele became fugitives of the law.\n\nKhanyi confirmed their romance in February 2021, following it up with pictures of her Valentines Day surprise consisting of 1,250 roses and Louis V goodies.\n\nIn March 2021 Khanyi debuted a tattoo of Kudzais name on her hip.\n\nWhen you showed me before bedtime, I was in shock. Love you always. No going back. We will never end, Kudzai wrote on his Instagram account, which has since been deactivated.\n\nWeeks after showcasing couple goals on their timelines, on August 31 2021 South Africans were left concerned for Khanyis safety after Kudzai said he had apparently not seen her since dropping her off at the salon while they were on holiday in Dubai.\n\nKhanyi topped the trends list in SA after screenshots from Kudzais Instagram detailing how shes gone missing went viral.\n\nHowever, it turned out Khanyi had boarded a flight back to SA without telling Kudzai.\n\nIn early September 2021 Kudzai issued an apology to Khanyi for publicising details of their private life after she disappeared.\n\nHe declared his love for her, which saw the couple reunite like nothing happened and continue living their best couple goals on social media.\n\nAfter her debut onYoung, Famous & African, Khanyi spoke of being in a loving relationship with Kudzai despite theirseven-year age gap.\n\nIn the last episode of season three, when giving Naked DJ advice about his relationship, the Metro FM DJ questions how he has not spoken to her for three months while she was portraying a happy relationship with Kudzai on social media, and Khanyi revealed she had burnout.\n\nOn February 3 2025, Khanyi announced her five-year relationship with Kudzai had come to an end.\n\nThe actress and reality TV star opened up about the reasons behind their breakup.\n\nHe was a good guy, but he did some bad things, she wrote.\n\nHe tried everything he could to make it up to me. I did most of my grieving while we were together. I finally got the courage to leave. And of course I wish him the best.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/29085026/Screenshot-2022-03-29-at-09.49.56.png",
            "description": "<p>TimesLive Khanyi Mbau and her beau Kudzai Mushonga have called it quits. From romantic gestures to a lavish lifestyle in Dubai and dramatic disappearing acts, the couple’s relationship was a talking point on social media from the moment it was revealed. Here is a timeline of their love: Khanyi spotted with a wanted man? The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-tattoos-to-disappearing-acts-and-a-lavish-lifestyle-in-dubai-khanyi-and-kudzais-five-year-relationship-ends/\">From tattoos to disappearing acts and a lavish lifestyle in Dubai — Khanyi and Kudzai’s five-year relationship ends</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "1win in Canada – Comprehensive Review",
            "url": "https://www.newzimbabwe.com/1win-in-canada-comprehensive-review/",
            "content": "Introduction to 1win in Canada\n\n1win has become a popular platform for Canadian sports bettors and casino enthusiasts alike. Known for its user-friendly interface and wide range of options, it has earned a reputation as one of the top choices in Canadas competitive online gambling market. Whether users are interested in traditional sportsbook wagers or modern online casino games, 1win bet ensures theres something for everyone. It is particularly appealing to those looking for a smooth gambling experience combined with attractive promotions.\n\nThe platforms legal operations in Canada make it a safe and trusted choice for its users. Licensed internationally, it adheres to strict regulations to ensure fairness and quality service. Canadian players also appreciate the effort made by 1win to cater specifically to their local needs, offering popular sports and games coupled with payment options that suit the Canadian financial system.\n\nWhat makes 1win exceptional isnt only its game diversity but also its approach to customer service. The platform prioritizes user satisfaction by providing responsive support and educational resources for its customers. It ensures a seamless experience, especially for beginners, who can easily learn the ropes of online betting. Furthermore, the platform offers a dedicated mobile app, allowing users to conveniently place bets and play games on the go. These features, combined with regular updates and improvements, show why 1win is gaining traction in Canadas online gaming industry. Whether youre an experienced bettor or trying online gambling for the first time, 1win has something to offer.\n\nTo register your account on the 1win platform, follow these detailed steps:\n\nNow, youre all set to explore and enjoy the features of the 1win platform! Start browsing, placing bets, or using the tools and services provided on the site to make the most out of your experience.\n\nSports betting enthusiasts will find an extensive range of options available on 1win Canada. From popular sports like hockey, basketball, and soccer to niche selections like eSports and table tennis, the platform does a great job of covering all interests. Thanks to its real-time updates and analytical tools, customers can make more informed bets, increasing their chances of winning.\n\nA standout feature of 1wins sportsbook is its live betting system, which lets users place wagers on ongoing games. This feature enhances the thrill of watching live sports and enables bettors to adjust their strategies based on the games progression. The inclusion of detailed stats and previews makes decision-making easier for both beginners and experienced gamblers.\n\nThe platform ensures that odds remain competitive, often aligning with or bettering the industry standard. This is crucial for attracting serious bettors looking to maximize their profit margins. Additionally, users can enjoy boosted odds and promotional betting opportunities that add more excitement to their experience.\n\n1win also offers an intuitive and user-friendly interface, making it easy for newcomers to navigate the platform while still delivering the advanced features that seasoned bettors expect. The mobile app ensures you can bet on the go, letting you access your favorite sports, place wagers, and check live updates anytime, anywhere.\n\nWhether its pre-match bets or dynamic, live wagers, 1win ensures a flexible betting environment. It encompasses both high-stakes options suitable for professional gamblers and low-stakes markets for casual bettors. With its combination of variety, reliability, and user-focused features, 1win reaffirms its position as a premier destination for Canadian sports bettors.\n\nFor casino lovers, 1win offers an extensive library of games to suit all preferences. Canadian users will find everything from classic slots to cutting-edge live dealer games. These games are developed by leading providers such as Microgaming, NetEnt, and Playtech, ensuring quality, reliability, and a diverse selection of titles. The platforms seamless interface allows players to browse through hundreds of games effortlessly, making it simple for both newcomers and experienced players to find their favorites.\n\nSlots dominate the casino section with varied themes, bonus features, and progressive jackpots that continually attract players. Alongside popular games like roulette, poker, and blackjack, Canadian users can also explore unique options like craps, baccarat, and scratch cards. The inclusion of a live casino section elevates the experience, allowing users to interact with professional dealers in real time, enhancing the authenticity of the casino atmosphere.\n\nPromotions and bonuses often revolve around the casino section, giving players free spins, cashback offers, and deposit matches. Seasonal promotions and loyalty programs add even more value, ensuring players are consistently rewarded. These deals are part of 1wins dedication to improving user engagement while rewarding loyal customers over time.\n\nNavigation within the casino is easy, even for first-timers. With a strong focus on intuitive design, the platform ensures that players can discover their favorite games or switch between options without any hassle. The ability to filter games by type, provider, or category makes it even more convenient. This robust gaming experience, combined with user-focused features, makes 1win a standout platform in the Canadian online casino market.\n\nOne of 1wins strengths is its range of payment options, specifically designed to cater to Canadian users. Players can fund their accounts using popular methods like Interac, Visa, MasterCard, and e-wallets like Skrill or Neteller. The platform also supports cryptocurrency payments, including Bitcoin, for those seeking greater security and anonymity.\n\nDeposits are processed instantly in most cases, allowing users to start betting or gaming without unnecessary delays. The platform places a strong emphasis on trust by ensuring timely and transparent transactions.\n\nCurrency conversion is not an issue, as 1win supports CAD transactions directly. This minimizes fees and simplifies the process for Canadian users. The integration of local banking options further attests to 1wins efforts to localize the gambling experience.\n\nSecurity is a priority in all payment-related processes. With advanced encryption and strong anti-fraud measures, users can rest assured their financial and personal information remains safe. This comprehensive and user-focused payment system solidifies 1win as a preferred platform for Canadian users.\n\nOne of 1win Canadas standout features is its streamlined and intuitive interface. The platforms design is tailored to meet the needs of both new and experienced users, ensuring simplicity and functionality are prioritized. Whether users access it via the desktop site or the mobile app, the layout is arranged for smooth and hassle-free navigation.\n\nThe dashboard provides quick access to the sportsbook, casino, promotions, and account settings, allowing users to toggle between sections seamlessly. The mobile app, available for both iOS and Android devices, mirrors the desktop experience, offering uninterrupted gameplay and betting opportunities anytime, anywhere. Whether users are at home or on the move, the platform delivers a consistent and reliable experience across devices.\n\nCustomer support is another strong point for 1win. Available through live chat, email, or phone, the support team is highly responsive and knowledgeable. Users can rely on quick assistance to resolve any issues, ensuring their time on the platform is enjoyable and hassle-free.\n\n1win takes security seriously, earning the trust of thousands of Canadian users by prioritizing safety and transparency. The platform operates under a valid international license issued by the Curacao Gaming Authority. This means it adheres to strict gambling regulations, ensuring fair gaming practices and the protection of users personal and financial data.\n\nTo safeguard sensitive information, 1win employs advanced encryption technologies, such as SSL (Secure Socket Layer), creating a secure environment for all transactions and communications. This technology works by encrypting data as it travels between the user and the platform, preventing unauthorized access and maintaining confidentiality.\n\nThe platform also encourages responsible gambling by offering tools and resources to help users manage their habits effectively. Features like deposit limits, self-exclusion options, and access to support services reflect 1wins commitment to user well-being. With its robust security measures and user-first approach, 1win continues to build a safe and reliable environment for gaming enthusiasts across Canada.\n\n1win has quickly established itself as a top choice for Canadian sports bettors and casino enthusiasts alike. Its robust selection of games, user-friendly experience, and commitment to customer satisfaction set it apart in the competitive online gambling market. With generous bonuses and promotions, convenient payment options, and strong security measures, its no wonder 1win is a preferred platform.\n\nPlayers can explore an extensive library of casino games, including slots, poker, roulette, and blackjack, all designed to cater to both casual players and high-rollers. The sportsbook is equally impressive, covering a wide range of sports and events with competitive odds. 1win also supports seamless mobile play, ensuring users can enjoy the platform anytime, anywhere. Customer support is available 24/7, providing prompt assistance whenever needed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/03090008/Screenshot-2025-02-03-at-10.59.18.png",
            "description": "<p>Introduction to 1win in Canada 1win has become a popular platform for Canadian sports bettors and casino enthusiasts alike. Known for its user-friendly interface and wide range of options, it has earned a reputation as one of the top choices in Canada’s competitive online gambling market. Whether users are interested in traditional sportsbook wagers or</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/1win-in-canada-comprehensive-review/\">1win in Canada – Comprehensive Review</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "Trump threatens to cut aid to South Africa over land expropriation",
            "url": "https://www.newzimbabwe.com/trump-threatens-to-cut-aid-to-south-africa-over-land-expropriation/",
            "content": "By News Central TV\n\nU.S. President Donald Trump announced plans to halt aid to South Africa in response to its land expropriation policies, triggering a decline in the rand.\n\nThe United States wont stand for it, we will act, Trump declared in a Sunday evening post on Truth Social.\n\nAlso, I will be cutting off all future funding to South Africa until a full investigation of this situation has been completed!\n\nHis remarks come less than two weeks after South African President Cyril Ramaphosa signed a law facilitating land expropriation by the state, with provisions for equitable compensation.\n\nThe ruling African National Congress (ANC) has long advocated for land reform to address racial disparities in land ownership that stem from colonialism and White-minority rule.\n\nFollowing Trumps statement, the South African rand fell 2% against the dollar in Asian trading. Emerging-market currencies also came under pressure as Trump moved forward with tariffs on countries including China and Mexico.\n\nOver the past two decades, the U.S. has provided South Africa with more than $8 billion in bilateral aid, according to a 2023 Congressional Research Service report. Much of this funding has supported HIV/AIDS initiatives and other development programs.\n\nThis is not Trumps first economic threat against South Africa. The country, as part of the BRICS bloc, has faced his warnings before. In December, Trump threatened a 100% tariff on BRICS nations if they shifted away from the U.S. dollar.\n\nAs the current chair of the Group of 20 (G20), South Africa will host key international meetings this year. If Trump returns to the presidency, he would be expected to attend. Notably, his top billionaire supporter, Elon Musk, was born in Pretoria, South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/26074320/donald_trump.jpg",
            "description": "<p>By News Central TV U.S. President Donald Trump announced plans to halt aid to South Africa in response to its land expropriation policies, triggering a decline in the rand. “The United States won’t stand for it, we will act,” Trump declared in a Sunday evening post on Truth Social. “Also, I will be cutting off</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-threatens-to-cut-aid-to-south-africa-over-land-expropriation/\">Trump threatens to cut aid to South Africa over land expropriation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "‘Mnangagwa presidential term extension needs no referendum’— say Zanu PF top officials",
            "url": "https://www.newzimbabwe.com/mnangagwa-presidential-term-extension-needs-no-referendum-says-zanu-pf-political-commissar/",
            "content": "By Staff Reporters\n\nIN what smacks of an unbridled attempt to trample upon the countrys Constitution, Zanu PF says there will not be any referendum to gauge the publics opinion whether or not President Emmerson Mnangagwas term in office should be extended beyond 2028.\n\nThe latest development comes amid reports that the ruling party has forwarded to Parliament its Annual National Peoples Conference resolution to stretch the 82-year-old Zanu PF leaders incumbency until 2030 or further.\n\nAddressing the Zanu PF Mashonaland Central Provincial Coordinating Committee (PCC) meeting held Saturday in Bindura, party national political commissar, Munyaradzi Machacha claimed there is no need for a referendum as the polls will be postponed to 2030 via a Constitutional Amendment.\n\nMachacha said the resolution, which was adopted at the 21st Zanu PF Annual National Peoples Conference in Bulawayo in October last year, is now in the implementation phase.\n\nAt a party policy meeting last Monday, we agreed to allow the Parliament of Zimbabwe to implement Resolution Number One as presented at the conference. There is no going back in implementing the resolution, he said.\n\nHe said those holding divergent views regards the move should have voiced their opinions at the conference or at provincial and district coordinating committee meetings.\n\nThose who do not support the resolution were free to debate it at the conference, Provincial Coordinating Committee meetings, or District Coordinating Committee meetings. We are now at the implementation stage, he said.\n\nSpeaking at a party event in Harare, Zanu PF Harare province chairperson, Godwills Masimirembwa weighed in with the same sentiments that extension did not require a referendum. He said this could be legally done by postponing elections before Mnangagwa clocks three years of his second stay in power.\n\nThis, the party argues, would mean Mnangagwas second term would constitutionally not be recognised as a term.\n\nSpeaking to journalists after a youth inter-district meeting at Zanu PFs Harare headquarters Saturday, Masimirembwa justified this position saying as long as the principle of term limits was not affected by the decision, no referendum was needed.\n\nDespite Mnangagwas initial decision not to overstay, his recent silence has given weight to calls by a certain section of Zanu PF supporters and officials for him to hang on up till 2030.\n\nIf Mnangagwa gets to be in power up to 2030, that will not be against presidential term limits, said Masimirembwa.\n\nWhat is only needed here is to postpone elections up to 2030. There is no interference with constitutional term limits as has been said. The Zanu PF resolution is in tandem with that.\n\nThe referendum is only necessary if we interfere with the term limit provision, which is a three-year period. If the President serves less than three years, its not considered a full term. He falls within the term limit of the presidential term provision.\n\nA faction loyal to Mnangagwa is trying to shut out his deputy Constantino Chiwenga from taking over by actioning a 2024 Annual National Peoples Conference resolution that Mnangagwa should hang on up to 2030.\n\nAlthough speaking at the same function Mnangagwa said he does not wish to be at governments helm beyond what Zimbabwes Constitution stipulates (two, five-year terms) his lieutenants betray his desire to continue.\n\nAdded Masimirembwa: There is no need to worry about interference with the term limit, so the party resolution is in tandem with the term limit provision.\n\nCivil society, some serious members in opposition politics and ordinary citizens are gearing to oppose Zanu PFs bid to extend Mnangagwas term.\n\nThe 2030 agenda, started by Masvingo province has been interpreted as an attack on Zimbabwes 2013 Constitution whose term limits were put in place to avoid a president overstaying as was the case with the late Robert Mugabe.\n\nAlthough constitutional law expert, Lovemore Madhuku has been quoted saying a third term bid being pursued by Mnangagwas loyalists is next to impossible, his henchmen are determined to make it happen.\n\nMadhuku said it was an insurmountable task for Mnangagwa to secure a third term.\n\nHe said the steps would require a publication of the first Bill where they seek to amend the Constitution.\n\nOrdinary people will have to debate it within a 90-day period. Thereafter, take it to Parliament. It must get a two-thirds majority both in the National Assembly and in the Senate and thereafter, there must be a referendum, he said.\n\nWe should then vote yes with a majority. Now, that alone tells you that it will be very difficult because I know that in the 90-day period for debate and so on, it will come out very clearly that most Zimbabweans dont support it and when it goes to Parliament, were not sure how they will vote.\n\nIt cannot be assumed that since Zanu PF has a two-thirds majority theyll obtain the two-thirds majority. They may not obtain the two-thirds majority. But if they get it, they have to go to a referendum.\n\nThat is in respect of the first Bill and then, with a referendum voting yes or no, it will just be a referendum on President Mnangagwa and I dont think that he wants it. It doesnt matter how you couch the Bill.\n\nWhen you then go to the stage of voting yes or no, it will be very simple. Do you want the President to continue, or you would want the President to serve 10 years? So, most people that respect the President would simply want him to rest after 10 years. So, when you say possible, I think it might be a very loose word.\n\nHe said the Constitution provided procedures for its amendment, but achieving the constitutional thresholds would be difficult.\n\nSo that will be with the Bill number one and then for it to then be signed into law, the President must sign it into law. So Mnangagwa himself will be the one who has to put his signature for the approval to the amendment of the Constitution, Madhuku was quoted saying.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/03044041/Munyaradzi-Machacha.gif",
            "description": "<p>By Staff Reporters IN what smacks of an unbridled attempt to trample upon the country’s Constitution, Zanu PF says there will not be any referendum to gauge the public’s opinion whether or not President Emmerson Mnangagwa’s term in office should be extended beyond 2028. The latest development comes amid reports that the ruling party has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-presidential-term-extension-needs-no-referendum-says-zanu-pf-political-commissar/\">‘Mnangagwa presidential term extension needs no referendum’— say Zanu PF top officials </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Liquidation Processes for Businesses in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-liquidation-processes-for-businesses-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, following our article on corporate rescue last week, responding to the rampant closing of formal businesses in Zimbabwe, this week we want to discuss the liquidation of businesses. Why would a company liquidate in Zimbabwe?\n\nVM: I will start by explaining what liquidation is  in short, it is the winding up or dissolving of a company by ceasing operations and distributing its assets to pay off creditors and shareholders.\n\nNow why a business would liquidate?\n\nIn general terms, liquidation of a business is a response to financial distress, a favourable economic environment or in the positive, it can be a result of strategic business decisions by closing a certain business to start another responsive to the changing needs of people.\n\nIt can also be voluntary but in the negative, may be due to shareholder squabbles and involuntary, resulting from insolvency and/or compliance with governing regulations.\n\nAs to answer for Zimbabwe in particular, the same principles apply compounded by an economy in flux, with intermittent periods of high liquidations of companies, as involuntary reactions to the contemporary macro and micro economic environment.\n\nReporter:Having explained the what and why of liquidation, how do you legally liquidate a company?\n\nVM: A company can be liquidated voluntarily by its members or involuntarily through a court order initiated by a member or creditors.\n\nWhen being liquidated through a voluntary process, the company does not necessarily need to be insolvent, it can still be solvent, and the members or shareholders agree to dissolve the company for whatever reason.\n\nA liquidator will be appointed and his or her mandate is to realize all the assets, pay off all the company debts and distribute the remaining assets to the shareholders.\n\nIn instances where the liquidation process is instituted by the companys creditors, the company must be insolvent, and the creditors may nominate a liquidator.\n\nInvoluntary liquidation is due to a court order placing the company in liquidation, the court process can be initiated by an interested person or the company itself and the hurdle to cross in court, is whether or not, it is just and equitable to place the company in liquidation.\n\nReporter: Who can place a company in liquidation?\n\nVM: The shareholders, creditors, and the company itself through its directors can place a company in liquidation. A liquidator will be appointed to manage the liquidation process with the Master of the High Court playing an oversight function.\n\nReporter: What is the role of the Liquidator in the process?\n\nVM: In short, the function of the liquidator is to sell the assets of the company wherever they may be, at the best price to raise money to pay off creditors and give the remaining balance to the shareholders. The liquidator is also required to investigate the affairs of the company to ensure that no fraudulent or irregular transactions were made prior to the liquidation process with the intention of depriving creditors of their dues at liquidation.\n\nThe liquidator is also required to be in constant communication with the Master of the high court and creditors through reports and meetings.\n\nReporter:Do the creditors have any obligations during the liquidation process?\n\nVM: The creditor has to submit its claim with all the evidence he or she relies on for the claim. It is important to remember that the liquidator is an independent person, he or she was not present when that debt arose or became due, it is the duty of the creditor to convince the liquidator that the debt is owed by providing the necessary proof.\n\nThe creditors have to attend meetings called by the liquidator from time to time and keep themselves abreast of the liquidation process through the reading of the liquidators reports.\n\nReporter: What is the effect of liquidation on employees, directors, and shareholders?\n\nVM: Once the company is liquidated, there is no company to talk off, the employee contracts are terminated. Employees are considered preferred creditors and are paid out in terms of the liquidators payment schedule.\n\nThe directors lose effective control of the company on the appointment of the liquidator but retain potential personal liability for fraudulent or reckless transactions executed while being a director.\n\nAs for shareholders, they obviously lose their investment, if lucky, they will get the remainder of what is left after creditors are paid in proportion to their shareholding in the company.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:Legal Discussions with Vengai Madzima: Corporate Rescue in Zimbabwe\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor atwww.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, following our article on corporate rescue last week, responding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-liquidation-processes-for-businesses-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Liquidation Processes for Businesses in Zimbabwe     </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "Formal retailers in Zimbabwe struggle as consumers migrate to informal shops",
            "url": "https://www.newzimbabwe.com/formal-retailers-in-zimbabwe-struggle-as-consumers-migrate-to-informal-shops/",
            "content": "By Xinhua\n\nHARAREFormal retailers and wholesalers in Zimbabwe are experiencing a decline in customer traffic as consumers increasingly prefer informal shops, which offer more affordable and convenient shopping options.\n\nSeveral established chain stores in Harare, the capital of Zimbabwe, have recently ceased operations or scaled down their business due to competition from the informal sector.\n\nThe operational challenges faced by formal businesses have also resulted in some outlets failing to stock products, leaving their shelves almost empty and further driving people to small informal retailers known as tuck shops locally.\n\nThe tuck shops are mainly conveniently located in downtown Harare and are usually packed with customers buying various household grocery items.\n\nThe Confederation of Zimbabwe Retailers (CZR), a retail business representative body, recently confirmed the closure of some formal chain stores due to competition from the informal sector and exchange rate distortions in the countrys multi-currency system.\n\nThe unregulated informal sector offers goods at much lower prices, largely because it operates outside compliance with statutory obligations such as taxes, licensing fees, and labor laws, CZR President Denford Mutashu said in a statement, adding that this reality has made it increasingly difficult for formal businesses to compete effectively.\n\nIn addition, he said another challenge facing the formal sector is the use of both the U.S. dollar and the local Zimbabwe Gold (ZiG) currency as legal tender, which disproportionately affects formal retailers and wholesalers who are required by law to trade at the official exchange rate.\n\nThe ZiG is trading at around 26 to one U.S. dollar at the official exchange rate, while on the black market, the rate is around 38.\n\nIn response to the currency distortions, informal traders now conduct business exclusively in U.S. dollars, giving them a competitive edge over formal retailers.\n\nFormal businesses are compelled to accept the ZiG in a predominantly dollarized supply chain. This is exacerbated by key operational costs, such as fuel for generators, which must be paid for in U.S. dollars, said Mutashu.\n\nDespite the U.S. dollar accounting for over 80 percent of transactions in Zimbabwes highly informalized economy, according to the Zimbabwe National Statistics Agency, the ZiG is mainly accepted in limited formal transactions that include chain stores and settling government bills.\n\nWhile formal businesses conduct trade largely in the ZiG, suppliers usually demand U.S. dollars.\n\nThe Reserve Bank of Zimbabwe, the central bank, introduced the gold-backed ZiG last April, replacing the Zimbabwean dollar, which had been ravaged by inflation.\n\nThe ZiG, however, has experienced turbulence, with its inflation surging to 10.5 percent in January from 3.7 percent recorded the previous month, leading many informal traders to reject it.\n\nIn November last year, Choppies Zimbabwe, a supermarket chain, announced its departure from the country, citing exchange rate regulations that had pushed customers toward the informal market.\n\nThe growth of the informal economy has resulted in the shrinking of the tax base, and the government is taking measures to increase formalization.\n\nFinance, Economic Development and Investment Promotion Minister Mthuli Ncube on Friday announced that to level the playing field between formal and informal shops, businesses are now required to transact through point-of-sale machines and operate a bank account linked to the Zimbabwe Revenue Authority, the national tax collection agency.\n\nOther measures include ensuring that all eligible taxpayers comply with regulations, establishing an inter-agency enforcement team to enforce compliance in the informal sector, and discouraging manufacturers from supplying directly to end users and the informal market, said Ncube.\n\nHe added that local authorities and the central government would collaborate in the licensing and enforcement processes to ensure businesses compliance while streamlining regulatory processes and reducing fees and duplication to lower business costs and encourage formalization.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/03040535/00cf027fdc4c4179b3bc6cf95c65dde1.png",
            "description": "<p>By Xinhua  HARARE—Formal retailers and wholesalers in Zimbabwe are experiencing a decline in customer traffic as consumers increasingly prefer informal shops, which offer more affordable and convenient shopping options. Several established chain stores in Harare, the capital of Zimbabwe, have recently ceased operations or scaled down their business due to competition from the informal sector.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/formal-retailers-in-zimbabwe-struggle-as-consumers-migrate-to-informal-shops/\">Formal retailers in Zimbabwe struggle as consumers migrate to informal shops</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "Spitzkop farm owner demands reversal of High Court judgement declaring property as abandoned",
            "url": "https://www.newzimbabwe.com/spitzkop-farm-owner-demands-reversal-of-high-court-judgement-declaring-property-as-abandoned/",
            "content": "By Mary Taruvinga\n\nDIANA Catherine Rodrigues, the owner of Spitzkop farm, is demanding the reversal of a judgement by former High Court judge, Justice Webster Chinamhora declaring the farm as an abandoned property.\n\nRodrigues is up in arms with Spitzkop Farm Residents Association and its representative, Tinashe Mananzva after coming across adverts by Leengate property developers, who are selling upmarket stands on her land.\n\nIt emerged that the developer had bought the farm from the residents who had obtained a court order declaring the farm as derelict.\n\nLeengate intends to build a gated community, and a security wall has already been erected at the farm where development is on course.\n\nRodrigues argues that she never abandoned her farm, she still wants it and was never accorded an opportunity to argue otherwise when an order against her was obtained by residents.\n\nWhen the matter was heard last Friday, Rodrigues, through her lawyers, told High Court judge, Justice Maxwell Takuva that the judgement should be declared a nullity because it was unprocedurally obtained by the association.\n\nShe argued that the association cited Urebai Rodrigues, who was a joint owner of the land which formed the subject of the main suit with her, as a respondent instead of citing the executor of his estate.\n\nThe late Urebai Rodrigues was cited as the fourth respondents in the application by the residents association.\n\nThe fourth respondent is the deceased. The order of the derelict was obtained against a deceased person, said Advocate Thabani Mpofu, who is taking instructions from her lawyer Blessed Ngwenya.\n\nAn application was brought against the fourth respondent who was a part owner.\n\nSpitzkop brought an application against the deceased as such the proceedings are invalid, they are invalidated because the notice that was brought to the court could not be read by the deceased person.\n\nThose who dealt with the first matter did not know that the respondent was dead.\n\nThis is a case of judgement granted in error and should be set aside. The executor should be joined to the proceedings.\n\nA judgement was stolen from the court under fraudulent circumstances where the court was not advised that the respondent was deceased, and this was an abuse of court processes.\n\nA group of people just took the land from their owners. They say they received it as a gratuity from the former owner, but the former owner had transferred the land to Rodrigues.\n\nThe Rodrigues were not given an opportunity to defend themselves in court in what is a clear abuse of office. The application should be granted, Mpofu said pleading for the revocation of the order.\n\nHowever, Advocate Tawanda Zhuwarara representing the residents insisted that the case cannot be a nullity because its not against the deceased.\n\nZhuwarara said Rodrigues was the one at fault because her present application also cites Urebai as one of the respondents.\n\nThe court has a nullity before it. The applicant Diana Rodriguez is the one who cites the deceased person as a person who is still in existence, he said.\n\nZhuwarara also said Rodrigues founding affidavit does not mention when the deceased died.\n\nThe proceedings should be terminated. From a nullity you cannot find anything. There was no surreptitious granting of the order, he submitted.\n\nTakuva indefinitely reserved his judgement on the matter.\n\nRodrigues approached the High Court seeking an order against the association, which sold the land to Leengate.\n\nI am the co-owner of the undivided share in two pieces of land situated in the district of Salisbury called Lot 10A and Lot 11 Spitzkop registered under Deed of Transfer Number 2568/88. See Annexure C being a copy of my deed.\n\nThe 1st and 2nd Respondents approached the court alleging that the land was abandoned by its owners and desired to acquire it, she said.\n\nShe told the High Court that she became aware of the order against her on August 1, 2024, after she had engaged her lawyers to find out why Leengate was advertising and selling her land.\n\nSpitzkop, and Mananzva representing the association, had approached the High Court via the chamber book for an order in terms of the Titles Registration and Derelict Lands Act.\n\nShe said the process was never served on her.\n\nThe record of proceedings also shows that the respondents advertised their provisional and final order in The Herald newspaper relating to a different deed and not Rodrigues.\n\nShe also told the High Court that the residents took advantage of Covid-19 to mount an application with full knowledge that the prospects of it going unopposed and unseen by her were high.\n\nShe said she wanted to understand how the court issued an order when the application and all adverts related to a different deed.\n\nRodrigues said she bought the property in question in 1988 together with the late Urebai Rodrigues.\n\nShe said it is, therefore, not just for her to lose the property to the respondents who did not spend any money on it.\n\nTo this end, she wants the court order by Chinamhora set aside and be declared a nullity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga Complains the order was issued against a dead person instead of estate executor DIANA Catherine Rodrigues, the owner of Spitzkop farm, is demanding the reversal of a judgement by former High Court judge, Justice Webster Chinamhora declaring the farm as an abandoned property. Rodrigues is up in arms with Spitzkop Farm Residents</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/spitzkop-farm-owner-demands-reversal-of-high-court-judgement-declaring-property-as-abandoned/\">Spitzkop farm owner demands reversal of High Court judgement declaring property as abandoned</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        },
        {
            "title": "Rwandan President Paul Kagame tells SADC to stay out of DRC",
            "url": "https://www.newzimbabwe.com/rwandan-president-paul-kagame-tells-sadc-to-stay-out-of-drc/",
            "content": "By Costa Nkomo\n\nFOLLOWING a recent threat of military action against South Africa, the Rwandan government has now angrily responded to the Southern African Development Community (SADC).\n\nThis comes after a meeting in Harare on January 31, 2025, where SADC, under the leadership of Zimbabwean President Emmerson Mnangagwa, demanded that the SADC Mission in the Democratic Republic of Congo (SAMIDRC) should not be involved in fighting what they say are Congolese citizens, referring to the M23 militant group.\n\nIn a statement released Sunday by their Foreign Affairs ministry, the Rwandan government said that SADC is being aggressive and is assisting the DRC government in their conflict against its own people.\n\nSADC has deployed an offensive force, SAMIDRC, to support the war of the government of the Democratic Republic of Congo against its own people, the M23 and the members of their community, many of whom have fled as refugees to Rwanda and throughout the region.\n\nThe government of the Democratic Republic of Congo is also intent on attacking Rwanda and its government, as has been repeatedly and publicly said by President Tshisekedi, part of the statement reads.\n\nIt is clear that SAMIDRC, together with its coalition partners which include the Burundian armed forces, the FDLR and European mercenaries, are at the heart of the conflict.\n\nThey should not be there fighting the citizens of that country and effectively bringing war to Rwanda.\n\nHowever, the Rwandan government has said that they welcome the proposed joint summit between the East African Community and SADC, to try and find a lasting solution to the conflict in the DRC.\n\nRwandas statement comes after SADC held an emergency meeting in Harare last Friday. At this meeting, the region, led by Mnangagwa, accused the Rwandan defence forces of killing SADC military forces in the DRC. 13 of these soldiers, from South Africa, were part of SAMIDRC.\n\nThe summit condemned in the strongest terms the attacks on the SAMIDRC troops by the M23 operating in the Eastern DRC, as such actions violated the ceasefire that was brokered through the Luanda Process on the thirtieth of July two thousand and twenty-four and undermine peace and security of the Democratic Republic of Congo and the SADC region, part of SADCs communique reads.\n\nSADC also said: The summit received the latest reports on the unfolding security situation in the Eastern part of the Democratic Republic of Congo and noted with concern the recent attacks by the M23 armed group and Rwanda Defence Forces on the Government Forces of the Democratic Republic of Congo, the SADC Mission in the Democratic Republic of Congo (SAMIDRC), and the civilian population in various areas of North Kivu.\n\nThis statement did not sit well with the Rwanda President Paul Kagame and his government.\n\nSADC has also condemned the M23, which the United Nations has long said is funded by the Rwandan government.\n\nThe M23, or March 23rd Movement, emerged as a rebel group in the DRC in 2012. Its roots can be traced back to a previous rebellion, the National Congress for the Defence of the People (CNDP), which was integrated into the Congolese army in 2009 as part of a peace agreement.\n\nHowever, many CNDP fighters felt that the agreement was not being upheld, particularly regarding issues of integration and their safety.\n\nThese grievances led to the mutiny on March 23, 2012, forming what became known as the M23. The group mainly consists of Tutsi Congolese and has been accused of committing human rights abuses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/10042217/Mnangagwa-Kagame.png",
            "description": "<p>By Costa Nkomo FOLLOWING a recent threat of military action against South Africa, the Rwandan government has now angrily responded to the Southern African Development Community (SADC). This comes after a meeting in Harare on January 31, 2025, where SADC, under the leadership of Zimbabwean President Emmerson Mnangagwa, demanded that the SADC Mission in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rwandan-president-paul-kagame-tells-sadc-to-stay-out-of-drc/\">Rwandan President Paul Kagame tells SADC to stay out of DRC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "03 Feb 2025"
        }
    ]
}