{
    "news": [
        {
            "title": "The dollar still rules, but US policy is making it less special",
            "url": "https://www.newzimbabwe.com/the-dollar-still-rules-but-us-policy-is-making-it-less-special/",
            "content": "By Saleha Mohsin l Bloomberg\n\nTHE dollars role as the worlds reserve currency is being challenged due to President Donald Trumps push to redesign the global economic order in favor of the US.\n\nTrust in the dollar is faltering, with the US dollar index tumbling more than 10% in the first six months of the year, its worst first-half performance since 1973, and some of Asias richest families cutting exposure to US assets.According to Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council, the US may have to give up some benefits of the strong-dollar regime, including lower interest rates, as the dollar faces more competition in a multicurrency world.President Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.Its a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTrust in the dollar is faltering, with the US dollar index tumbling more than 10% in the first six months of the year, its worst first-half performance since 1973, and some of Asias richest families cutting exposure to US assets.\n\nAccording to Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council, the US may have to give up some benefits of the strong-dollar regime, including lower interest rates, as the dollar faces more competition in a multicurrency world.President Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.Its a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nAccording to Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council, the US may have to give up some benefits of the strong-dollar regime, including lower interest rates, as the dollar faces more competition in a multicurrency world.\n\nPresident Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.Its a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nPresident Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.\n\nIts a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nIts a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.\n\nBut trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nBut trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?\n\nThe Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.\n\nLike an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nLike an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.\n\nGeopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nGeopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.\n\nNot everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nNot everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.\n\nSecretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nSecretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.\n\nTheres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTheres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.\n\nChinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nChinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.\n\nCentral banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nCentral banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.\n\nSpeculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nSpeculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.\n\nOther financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nOther financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.\n\nWith no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nWith no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.\n\nIndeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nIndeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.\n\nThe US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.\n\nBarry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nBarry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.\n\nUS banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nUS banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.\n\nAnd though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nAnd though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.\n\nThe federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.\n\nThe globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.\n\nMeanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nMeanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.\n\nA less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nA less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.\n\nWe dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nWe dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.\n\nUS Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nUS Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.\n\nTrumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTrumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.\n\nThe world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.\n\nPrevious eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nPrevious eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.\n\nTodays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTodays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.\n\nMohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/10/28121757/us-dollar.jpg",
            "description": "<p>By Saleha Mohsin l Bloomberg  THE dollar’s role as the world’s reserve currency is being challenged due to President Donald Trump’s push to redesign the global economic order in favor of the US. Trust in the dollar is faltering, with the US dollar index tumbling more than 10% in the first six months of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-dollar-still-rules-but-us-policy-is-making-it-less-special/\">The dollar still rules, but US policy is making it less special</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "13 Aug 2025"
        },
        {
            "title": "Ronaldo engaged to long-term partner Georgina Rodríguez",
            "url": "https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/",
            "content": "By BBC News\n\nFOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodrguez.\n\nShe announced the news on social media alongside a picture of a large ring, writing Yes I do. In this and in all my lives in her native Spanish.\n\nNo further details have been shared. Ronaldo, who is the most followed person on Instagram, has not yet made a comment about their engagement.\n\nThe couple have been together for nine years, after they met at a Gucci shop in Madrid where Rodrguez was working. He was playing at the Spanish club Real Madrid at the time.\n\nShe said siu! was one of the top comments, a nod to the footballers famous goal celebration where he shouts yes in Portuguese or Spanish.\n\nThe Portugal and Al-Nassr player has five children in total, two of whom he shares with Rodrguez.\n\nTheir youngest daughter Bella was born in April 2022, alongside a baby boy who was stillborn.\n\nRodrguez has also helped to raise Ronaldos other three children.\n\nThe 31-year-old, who starred in her own Netflix reality show I Am Georgina, previously addressed speculation around her engagement status. On the programme, she said her friends were always joking about the wedding.\n\nSince Jennifer Lopezs song The Ring Or When came out, they started singing it to me. And well, this is not up to me, she added.\n\nFamous faces including Kim Kardashian have liked the engagement announcement on social media. Piers Morgan, who interviewed Ronaldo in 2022, wished them as much success in their marriage as hes had on the football pitch!\n\nCelebrity make-up artist Charlotte Tilbury commented that it was fabulous news. Lauren Sanchez-Bezos, who married Amazon founder Jeff Bezos in June, said she was so happy for the couple.\n\nThe family currently live in the Saudi Arabian capital Riyadh, where Ronaldo plays for Al-Nassr. He joined the club in December 2022 for a reported annual salary of 177m ($238m).\n\nIn June 2025, it was announced that the 40-year-olds contract had been extended until 2027 after speculation that he was preparing to retire.\n\nIn a post on X, Ronaldo wrote: A new chapter begins. Same passion, same dream. Lets make history together.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13045909/cristiano-ronaldo-wife-1.webp",
            "description": "<p>By BBC News FOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodríguez. She announced the news on social media alongside a picture of a large ring, writing “Yes I do. In this and in all my lives” in her native Spanish. No further details have been shared. Ronaldo, who is the most</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/\">Ronaldo engaged to long-term partner Georgina Rodríguez</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "13 Aug 2025"
        },
        {
            "title": "Embassy hosts table tennis tourney to enhances China-Zimbabwe ties",
            "url": "https://www.newzimbabwe.com/embassy-hosts-table-tennis-tourney-to-enhances-china-zimbabwe-ties/",
            "content": "By Xinhua\n\nA FRIENDLY table tennis tournament involving Chinese and Zimbabwean players was held in Harare on Sunday to mark 45 years of diplomatic relations between the two countries.\n\nOrganized by the Chinese Embassy in Zimbabwe and the Zimbabwe Table Tennis Union, the Diplomatic Friendly Tournament featured two teams of five Zimbabwean players, drawn from the under-19 and senior national squads, and five Chinese players.Now in its fifth year, the event provides a platform for cultural exchange and sporting interaction between the two sides.Noah Ferenando, president of the Zimbabwe Table Tennis Union, said the tournament allows local players to learn from their Chinese counterparts and improve their skills.Through the initiative, he said, Zimbabwean players have become competitive enough to participate in regional and world championships, with some now ranked internationally.We have been moving from another level to a higher level and we are really grateful that things have been going on very well and we have been improving our game in the country. We have been scooping medals on the way, which means that this relationship that we have forged has actually been beneficial to us, he said.We are also lobbying for us to have the coaches from China to come in here and we have training camps here in Zimbabwe, Ferenando added.Given table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.Zimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nOrganized by the Chinese Embassy in Zimbabwe and the Zimbabwe Table Tennis Union, the Diplomatic Friendly Tournament featured two teams of five Zimbabwean players, drawn from the under-19 and senior national squads, and five Chinese players.\n\nNow in its fifth year, the event provides a platform for cultural exchange and sporting interaction between the two sides.Noah Ferenando, president of the Zimbabwe Table Tennis Union, said the tournament allows local players to learn from their Chinese counterparts and improve their skills.Through the initiative, he said, Zimbabwean players have become competitive enough to participate in regional and world championships, with some now ranked internationally.We have been moving from another level to a higher level and we are really grateful that things have been going on very well and we have been improving our game in the country. We have been scooping medals on the way, which means that this relationship that we have forged has actually been beneficial to us, he said.We are also lobbying for us to have the coaches from China to come in here and we have training camps here in Zimbabwe, Ferenando added.Given table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.Zimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nNow in its fifth year, the event provides a platform for cultural exchange and sporting interaction between the two sides.\n\nNoah Ferenando, president of the Zimbabwe Table Tennis Union, said the tournament allows local players to learn from their Chinese counterparts and improve their skills.Through the initiative, he said, Zimbabwean players have become competitive enough to participate in regional and world championships, with some now ranked internationally.We have been moving from another level to a higher level and we are really grateful that things have been going on very well and we have been improving our game in the country. We have been scooping medals on the way, which means that this relationship that we have forged has actually been beneficial to us, he said.We are also lobbying for us to have the coaches from China to come in here and we have training camps here in Zimbabwe, Ferenando added.Given table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.Zimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nNoah Ferenando, president of the Zimbabwe Table Tennis Union, said the tournament allows local players to learn from their Chinese counterparts and improve their skills.\n\nThrough the initiative, he said, Zimbabwean players have become competitive enough to participate in regional and world championships, with some now ranked internationally.We have been moving from another level to a higher level and we are really grateful that things have been going on very well and we have been improving our game in the country. We have been scooping medals on the way, which means that this relationship that we have forged has actually been beneficial to us, he said.We are also lobbying for us to have the coaches from China to come in here and we have training camps here in Zimbabwe, Ferenando added.Given table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.Zimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nThrough the initiative, he said, Zimbabwean players have become competitive enough to participate in regional and world championships, with some now ranked internationally.\n\nWe have been moving from another level to a higher level and we are really grateful that things have been going on very well and we have been improving our game in the country. We have been scooping medals on the way, which means that this relationship that we have forged has actually been beneficial to us, he said.We are also lobbying for us to have the coaches from China to come in here and we have training camps here in Zimbabwe, Ferenando added.Given table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.Zimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nWe have been moving from another level to a higher level and we are really grateful that things have been going on very well and we have been improving our game in the country. We have been scooping medals on the way, which means that this relationship that we have forged has actually been beneficial to us, he said.\n\nWe are also lobbying for us to have the coaches from China to come in here and we have training camps here in Zimbabwe, Ferenando added.Given table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.Zimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nWe are also lobbying for us to have the coaches from China to come in here and we have training camps here in Zimbabwe, Ferenando added.\n\nGiven table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.Zimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nGiven table tenniss popularity in China, he said Zimbabwe could benefit from Chinese coaching techniques, including science-based approaches to training, management and play.\n\nZimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.This is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nZimbabwean player Tatenda Mumvuma said competing against Chinese players locally and training in China has boosted the standard of the game in the country.\n\nThis is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.Table tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nThis is something every athlete wants-to be among the best and train with the best to improve. Over my past two visits to China, my table tennis game has been on a steady upward trajectory, said Mumvuma.\n\nTable tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\nTable tennis is growing in popularity in Zimbabwe, with more schools introducing the sport.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/28121700/China-Zimbabwe.png",
            "description": "<p>By Xinhua  A FRIENDLY table tennis tournament involving Chinese and Zimbabwean players was held in Harare on Sunday to mark 45 years of diplomatic relations between the two countries. Organized by the Chinese Embassy in Zimbabwe and the Zimbabwe Table Tennis Union, the Diplomatic Friendly Tournament featured two teams of five Zimbabwean players, drawn from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/embassy-hosts-table-tennis-tourney-to-enhances-china-zimbabwe-ties/\">Embassy hosts table tennis tourney to enhances China-Zimbabwe ties</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "13 Aug 2025"
        },
        {
            "title": "Daniel Msendami opens Betway Premiership scoring account as Marumo beat Pirates",
            "url": "https://www.newzimbabwe.com/daniel-msendami-opens-betway-premiership-scoring-account-as-marumo-beat-pirates/",
            "content": "By Sports Reporter\n\nWARRIORS midfielder Daniel Msendami was on target Tuesday evening when Marumo Gallants beat Orlando Pirates 2-1 in the second game of South Africas Betway Premiership.\n\nMsendami struck in the 45th minute to cancel Orlando Pirates lead level the game at 1-1 going for the break.\n\nMarumo Gallants came back in the second half and sealed victory through Jaisen Clifford in the 90th minute to record a 2-1 win over Pirates.\n\nTuesdays goal was the first of the season for Zimbabwean striker, who joined the side in July last year from Botswanas Jwaneng Galaxy.\n\nMarumo Gallants is home two three Zimbabweans, the other two being Warriors first choice goalkeeper Washington Arubi and striker Junior Zindoga.\n\nArubi also had a good day in the office as he denied Orlando Pirates several attempts to score a second goal through his super saves.\n\nTuesdays win saw Marumo Gallants going on top of the Betway Premiership with six points after managing two wins in two games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/29053013/Daniel-Msendami-12-scaled-1.webp",
            "description": "<p>By Sports Reporter WARRIORS midfielder Daniel Msendami was on target Tuesday evening when Marumo Gallants beat Orlando Pirates 2-1 in the second game of South Africa’s Betway Premiership. Msendami struck in the 45th minute to cancel Orlando Pirates’ lead level the game at 1-1 going for the break. Marumo Gallants came back in the second</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/daniel-msendami-opens-betway-premiership-scoring-account-as-marumo-beat-pirates/\">Daniel Msendami opens Betway Premiership scoring account as Marumo beat Pirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "13 Aug 2025"
        },
        {
            "title": "Security guard burnt to death while sleeping in parked vehicle",
            "url": "https://www.newzimbabwe.com/security-guard-burnt-to-death-while-sleeping-in-parked-vehicle/",
            "content": "By Staff Reporter\n\nA SECURITY guard sleeping on duty was Monday burnt to death in a commuter omnibus he had sought shelter for the night.\n\nThe inalert watchman suffered burns after the vehicle he was sleeping in was consumed by a ball of fire.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the tragedy.\n\nThe ZRP is investigating a fire incident which resulted in the death of a security guard, Francis Jeimani Mlambo (39) on August 11, 2025 at Gazaland, Machipisa, Highfiled, Harare, said Nyathi.\n\nThe fire engulfed a kombi in which the victim was taking shelter and destroyed six other scrap vehicles.\n\nInvestigations are in progress to determine the cause of the inferno.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/08153433/Fire.png",
            "description": "<p>By Staff Reporter  A SECURITY guard sleeping on duty was Monday burnt to death in a commuter omnibus he had sought shelter for the night. The inalert watchman suffered burns after the vehicle he was sleeping in was consumed by a ball of fire. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/security-guard-burnt-to-death-while-sleeping-in-parked-vehicle/\">Security guard burnt to death while sleeping in parked vehicle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "13 Aug 2025"
        },
        {
            "title": "Defence Forces Day: Mnangagwa promises better salaries, housing, transport for the military",
            "url": "https://www.newzimbabwe.com/defence-forces-day-mnangagwa-promises-better-salaries-housing-transport-for-the-military/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa says his government is speeding up construction of the Zimbabwe Defence Forces Referral Hospital at Manyame Air Force Base, upgrading other military health facilities and improving transport and accommodation for soldiers through new funding plans.\n\nHe was speaking during the 45th anniversary of the Zimbabwe Defence Forces Day celebrations in Harare,Tuesday.\n\nMnangagwa said the government is working on improving military wages and benefits for members of the ZDF.\n\nGovernments improvement of the conditions of service for members of the Zimbabwe Defence Forces is ongoing.\n\nThe Defence Forces Service Commission is engaged in a process to rationalise the inter-rank salary differentials.\n\nThis is being done in tandem with efforts to finalise implementation of the Military Salary Concept, Mnangagwa said.\n\nMnangagwa also added that his administration is fast-tracking the construction of the military hospital at Manyame Air Force Base, modernising other defence health centres nationwide.\n\nIn the area of health delivery, my Administration is accelerating the completion of the Zimbabwe Defence Forces Referral Hospital at Manyame Air Force Base.\n\nRefurbishment, upgrading and modernisation projects of other medical facilities in cantonment areas, throughout the country, are being supported and speeded up, Mnangagwa said.\n\nHe further said the government is addressing long-standing housing shortages for soldiers and prioritising transport improvements through a phased plan to supply vehicles and buses for the Zimbabwe Defence Forces.\n\nInnovative financing models employed by the government are resolving the perennial shortage of institutional accommodation for serving members of the Zimbabwe Defence Forces.\n\nThe need to address the transport challenges besetting the Defence Forces has become a key priority.\n\nA phased programme is in place to add an assortment of vehicles for various ZDF operational requirements, including a fleet of buses to transport members, added Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051605/zdf-mnangagwa-2.jpeg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa says his government is speeding up construction of the Zimbabwe Defence Forces Referral Hospital at Manyame Air Force Base, upgrading other military health facilities and improving transport and accommodation for soldiers through new funding plans. He was speaking during the 45th anniversary of the Zimbabwe Defence Forces Day celebrations</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defence-forces-day-mnangagwa-promises-better-salaries-housing-transport-for-the-military/\">Defence Forces Day: Mnangagwa promises better salaries, housing, transport for the military</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "13 Aug 2025"
        }
    ]
}