{
    "news": [
        {
            "title": "Zimbabwe set to make Women’s Championship debut during New Zealand tour",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-to-make-womens-championship-debut-during-new-zealand-tour/",
            "content": "ESPN\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22053346/lady-chevrons.jpeg",
            "description": "<p>ESPN Zimbabwe will begin their quest to qualify for the Women’s ODI World Cup for the first time in their history when they tour New Zealand for a white-ball series in February-March 2026. The three ODIs on the tour, scheduled for March 5, 8 and 11 in Dunedin, will be Zimbabwe’s debut in the ICC Women’s Championship, the primary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-to-make-womens-championship-debut-during-new-zealand-tour/\">Zimbabwe set to make Women’s Championship debut during New Zealand tour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "26 Jun 2025"
        },
        {
            "title": "Diddy prosecutors drop kidnapping and arson claims, narrowing racketeering charge in final days of trial",
            "url": "https://www.newzimbabwe.com/diddy-prosecutors-drop-kidnapping-and-arson-claims-narrowing-racketeering-charge-in-final-days-of-trial/",
            "content": "IndependentUK\n\nFederal prosecutors narrowed the racketeering conspiracy charges againstSean Diddy Combs, removing the claims of arson and kidnapping Wednesday justone day before closing argumentsbegin in the blockbuster sex trafficking trial.\n\nThemusic mogul faces five federal counts of racketeering conspiracy, sex trafficking and transportation to engage in prostitution. Hes pleaded not guilty.\n\nUnder the racketeering conspiracy charge, prosecutors accusedDiddy in the indictmentof creating a criminal enterprise whose members and associates engaged in, and attempted to engage in, among other crimes, sex trafficking, forced labor, kidnapping, arson, bribery, and obstruction of justice.\n\nIn a letter to the court, the government proposed dropping three theories related to the racketeering conspiracy charge as a way to streamline jury instructions. They still intend to pursue the racketeering charge but removed instructions related to attempted kidnapping, attempted arson and aiding and abetting sex trafficking.\n\nThe Government is no longer planning to proceed on these theories of liability so instructions are no longer necessary, prosecutors wrote in the letter.\n\nFederal prosecutors narrowed the racketeering charge against Diddy in final stage of trial (REUTERS)\n\nAll of the five federal charges against Diddy remain.\n\nThe move comes after Alexandra Shapiro, one of the 55-year-old moguls defense attorneys, passionately argued in court on Tuesdayfor a judgment of acquittal on all counts.She claimed there were deficiencies to each count and then walked through each charge, outlining why it should be dropped.\n\nShapiro argued that two of the three of the governments examples of kidnapping were insufficient.\n\nIn one kidnapping allegation, Capricorn Clark, Diddys former employee, testified about being driven by Diddys then-head of security to a dilapidated building where she was subjected tolie detector tests for five daysin a row. If she failed, a man told her she would be thrown in the East River, she testified. But Shapiro argued there was no evidence that Diddy knew this was happening or that a co-conspirator had kidnapped her.\n\nSean Diddy Combs hugs his lawyer Nicole Westmoreland as he enters the courtroom during Combs sex trafficking trial in New York City, New York, U.S., June 16, 2025. (Reuters)\n\nThe arson allegation stems from a claim by Scott Mescudi, better known as Kid Cudi, thatDiddy firebombed his Porschein early 2012 after he discovered the rapper had dated his longtime girlfriend Cassie Ventura. Shapiro argued that there was no evidence that her client was involved, noting that Mescudi didnt witness the incident. She added that there was female DNA found on the bottle used for the Molotov cocktail.\n\nProsecutors plan to focus the racketeering conspiracy charges instead on proving forced labor and sex trafficking.\n\nThe judge said he would reserve a decision on the defenses motion. Closing arguments are set to begin Thursday morning.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>IndependentUK Federal prosecutors narrowed the racketeering conspiracy charges against Sean “Diddy” Combs, removing the claims of arson and kidnapping Wednesday just one day before closing arguments begin in the blockbuster sex trafficking trial. The music mogul faces five federal counts of racketeering conspiracy, sex trafficking and transportation to engage in prostitution. He’s pleaded not guilty. Under the racketeering</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diddy-prosecutors-drop-kidnapping-and-arson-claims-narrowing-racketeering-charge-in-final-days-of-trial/\">Diddy prosecutors drop kidnapping and arson claims, narrowing racketeering charge in final days of trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "26 Jun 2025"
        },
        {
            "title": "‘Not in Our Name’ – South African artists condemn Gayton McKenzie’s xenophobic tirade",
            "url": "https://www.newzimbabwe.com/not-in-our-name-south-african-artists-condemn-gayton-mckenzies-xenophobic-tirade/",
            "content": "IOL Entertainment\n\nActress Thandi Sebe has joined a growing chorus of South African artists condemning Minister of Sports, Arts and Culture,Gayton McKenzie,for spreading Afrophobic hate speech.\n\nIn a recent post on Instagram, Sebe said: As the South African Constitutional Court turns 30, we as South African artists call upon our leaders to protect the ideals of our beautiful constitution that guarantee the promise of a South Africa that belongs to all who live in it.\n\nWe condemn the hateful vitriol that the Minister for Arts and Culture spews about foreign citizens living in this country. We unequivocally condemn his tirades and say: Not in Our Name.\n\nMcKenzie came under firefollowing recent remarks targeting the employment of two Zimbabweans by the Market Theatre.\n\nHe is reported to have said: some of you here have the audacity to hire foreigners instead of South Africans; I dont care how you used to do it. But for as long as I am the minister, there will be no foreigner that will work in an entity while a South African can do the same thing; and foreigners employed bygovernment departmentsneeded to be out in three weeks I said it, I want them out, get them out.\n\nSebe went on to demand accountability from politicians, urging them to honour the constitution of the country.\n\nOther artists participating in the condemnation included Rafeeqah Galant, Marc Lottering, Hakeem Kae-Kazim, Mike van Graan, Tshamano Sebe, Rea Rangaka, Liza Scholtz, Lesedi Kolotsi, Matthew Griffiths, Ace Marcus, Liyema Duze, Mzu Ntantiso, Thandi Sebe, Rameez Cassiem, Danica Jones and Mihlali Kope.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/24011832/Minister-of-Sport-Arts-and-Culture-Gayton-Mackenzie-Picture-Ayanda-Ndamane-Independent-Media-File.webp",
            "description": "<p>IOL Entertainment Actress Thandi Sebe has joined a growing chorus of South African artists condemning Minister of Sports, Arts and Culture, Gayton McKenzie, for spreading Afrophobic hate speech. In a recent post on Instagram, Sebe said: “As the South African Constitutional Court turns 30, we as South African artists call upon our leaders to protect the ideals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-in-our-name-south-african-artists-condemn-gayton-mckenzies-xenophobic-tirade/\">‘Not in Our Name’ – South African artists condemn Gayton McKenzie’s xenophobic tirade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "26 Jun 2025"
        },
        {
            "title": "Shamva man jailed 30 years for murder",
            "url": "https://www.newzimbabwe.com/shamva-man-jailed-30-years-for-murder/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Esther Muremba has slapped a 24-year-old Shamva man with a 30-year jail term following his conviction for killing an artisanal miner in cold blood back in 2019.\n\nClaude Makoto was convicted after a full trial with the court hearing that he was only 18 when he killed Christopher Samu, a 37-year-old man, on 3 August 2019 at Nherera Mine in Shamva.\n\nIt was proved that Makoto was part of a gang that included Onias Sindura, Robert Sindura, Tinashe Zvinairo, Bhaureni Chingwaru, Lloyd Kafena, Charles Mhako, Kudakwashe Gutsa, Kudakwashe Karima, and one Jabulani.\n\nOn the fateful day the gang travelled to Nherera Mine in a Toyota Noah, intending to rob gold ore.\n\nUpon arrival, they encountered the deceased and his brother, Shame Samu, who were working at the mine.\n\nThe gang manhandled the deceased, while Shame managed to escape.\n\nThey then assaulted Christopher Samu indiscriminately using various weapons, before dragging him and disposing of his body in a shallow pit near the Mazowe River bank, the court heard.\n\nHis body was discovered the following day, 4 August 2019.\n\nOf the six witnesses presented by the State, only Shame, the brother of the deceased, testified in person during the trial.\n\nThe court found Makoto guilty of murder and his lawyers had proposed a sentence not exceeding 20 years, citing the accuseds age at the time of the offence.\n\nIt was argued that he succumbed to peer pressure due to his youthfulness.\n\nThe lawyers also submitted that the accused, who is a gold panner, got married in 2021 while out on bail and now has a child.\n\nBut the judge said a stiffer penalty was appropriate, taking into consideration that the lawlessness in mining communities is a serious concern.\n\nPeople engaged in gold panning often show no respect for human life, resorting to violence without hesitation.\n\nWhile the accused was young, he willfully participated in an organised gang, engaging in murder during a robberya crime that demands severe punishment, regardless of age, to deter others from exploiting youthfulness as an excuse for criminal behaviour.\n\nGiven the devastating impact of this murder on the deceaseds family, a sentence beyond 20 years imprisonment is warranted, the judge said.\n\nThe court heard Samus firstborn was unable to sit for O-Level examinations due to financial hardship.\n\nHis widow and three children are struggling, forced to survive on menial jobs, while his elderly mother, once dependent on him, has developed a heart condition following his death.\n\nNeither the accused nor his gang members have offered any compensation or contributed towards funeral expenses, further exacerbating the familys struggle.\n\nA sentence of 30 years imprisonment as proposed by the State is just and necessary, reflecting the gravity of the offence and its lasting consequences.\n\nMuremba also said the sentence has been influenced by the fact that the accused is a first offender and was 18 years old at the time of the offence.\n\nHad he been older, we would have readily imposed a life sentence, especially now that the death penalty has been abolished.\n\nBefore its abolishment, capital punishment was the appropriate and fitting penalty for murder committed in the course of a robbery.\n\nAccordingly, the accused is sentenced to 30 years imprisonment, she ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Esther Muremba has slapped a 24-year-old Shamva man with a 30-year jail term following his conviction for killing an artisanal miner in cold blood back in 2019. Claude Makoto was convicted after a full trial with the court hearing that he was only 18 when he killed Christopher</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shamva-man-jailed-30-years-for-murder/\">Shamva man jailed 30 years for murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "26 Jun 2025"
        },
        {
            "title": "Dynamos summoned by PSL, Chaminuka reacts",
            "url": "https://www.newzimbabwe.com/dynamos-summoned-by-psl-chaminuka-reacts/",
            "content": "By Sports Reporter\n\nDynamos coach Saul Chaminuka has responded to the recent summons to appear before the Premier Soccer League Disciplinary Committee.\n\nThis comes after the team walked off the pitch in a match against FC Platinum on Sunday, protesting against the referees decision leading to the abandonment of the match.\n\nSpeaking during a press conference this afternoon, Chaminuka said he is willing to go before the disciplinary and share his side of the story.\n\nI dont think that we will fail to answer the questions, because we are going to be talking about what happenedon the field of play, and thats my area.\n\nIt will be a question of how they want to take it; otherwise, we are going to talk in football, and I think Im the specialist when it comes to that area, said Chaminuka.\n\nDynamos was summoned by PSL to appear before the Disciplinary Committee together with coach Chaminuka on the 8thof July.\n\nThe Harare giants will become the third club this season to appear before the committee, the other two being Kwekwe United and Chicken Inn.\n\nKwekwe United failed to appear for their home fixture against Herentals in April and Chicken Inn walked off the pitch against Scottland last month at Rufaro in protest of a penalty, an incident which then led to the abandonment of the match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Sports Reporter Dynamos coach Saul Chaminuka has responded to the recent summons to appear before the Premier Soccer League Disciplinary Committee. This comes after the team walked off the pitch in a match against FC Platinum on Sunday, protesting against the referee’s decision leading to the abandonment of the match. Speaking during a press</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-summoned-by-psl-chaminuka-reacts/\">Dynamos summoned by PSL, Chaminuka reacts </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "26 Jun 2025"
        },
        {
            "title": "University of Zimbabwe dismisses striking lecturers",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-dismisses-striking-lecturers/",
            "content": "By Thandiwe Garusa\n\nTHEUniversity of Zimbabwe(UZ)s administration has fired four leaders of the ongoing lecturersstrike.\n\nThe strike has reached day 71, withlecturers demanding an upward review of their salaries to US$2,250 from thecurrent US$230.\n\nThe four dismissed are Association of University Teachers (AUT) leaders: Munyaradzi Chamburuka (President), Bornface Mwakorera (Secretary-General), Justin Tandire (Organising Secretary), and Obvious Vengeyi (Spokesperson).\n\nVengeyi told NewZimbabwe.com, Wednesday that they were dismissed for using the great hall without approval from the university, despite the fact that university authorities had opened the building for them and had also provided a legal officer and security personnel during the event.\n\nThe four were suspended last month and later underwent disciplinary hearings.\n\nWe have received dismissal letters from the university following the disciplinary proceedings. We were suspended on the 6th of May, and the letters stated that the dismissal is effective from the date of our suspension.\n\nWe wrote to the registrar that we wished to use the great hall for the purposes of balloting on the 28th of March and the balloting was meant for the 2nd of April, but the registrar did not respond to our letter of request.\n\nThen came the second of April, the university opened the hall and also brought in a legal officer of the University of Zimbabwe to be part of the proceedings.\n\nThe university also supplied security guards to oversee the process until the end and then two days later, that is when they said we used the hall without authorisation, Vengeyi said.\n\nHe added that they will continue picketingand plan to pursue legal action.\n\nWe are still AUT members, we will continue with our strike and our picketing. We will also seek legal remedy, which we will discuss later with our legal advisor.\n\nWe are not disturbed at all, not worried. We knew they would reach this decision because, even during the disciplinary hearings, they classified the offence under Schedule D, which allows dismissal on the first offence and we knew this was their intention, to fire us in the hope that it would stop the strike.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27161528/UZ-strike-6-scaled.jpg",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe (UZ)’s administration has fired four leaders of the ongoing lecturers’ strike. The strike has reached day 71, with lecturers demanding an upward review of their salaries to US$2,250 from the current US$230. The four dismissed are Association of University Teachers (AUT) leaders: Munyaradzi Chamburuka (President), Bornface Mwakorera (Secretary-General), Justin Tandire (Organising Secretary), and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-dismisses-striking-lecturers/\">University of Zimbabwe dismisses striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "26 Jun 2025"
        }
    ]
}