{
    "news": [
        {
            "title": "Musona parts ways with Saudi Arabia side Al-Okhdood",
            "url": "https://www.newzimbabwe.com/musona-parts-ways-with-saudi-arabia-side-al-okhdood/",
            "content": "By Sports Reporter\n\nWarrior striker Knowledge Musona has been released by Saudi Arabia side Al-Okhdood.\n\nHis departurewas confirmed by the club, which highlighted that it is seeking to refresh its foreign quota list with new players.\n\nMusona was released together with Saviour Godwin (Nigeria), Ousmane Barry (Guinea), Damion Lowe (Jamaica), and the Brazilian trio of Paulo Vitor, Petros Matheus, and Diego Souza.\n\nMusona joined Al-Okhdood in July last year and enjoyed a full season with the side, helping it survive relegation in the process.\n\nThe former Warriors captain might head back to his former club, Kaizer Chiefs, who are leading the race for his signature.\n\nThe South African giants almost landed back Musona last season, only to lose him to Al-Okhdood in the final hour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16162405/knowledge-Musona.jpeg",
            "description": "<p>By Sports Reporter Warrior striker Knowledge Musona has been released by Saudi Arabia side Al-Okhdood. His departure was confirmed by the club, which highlighted that it is seeking to refresh its foreign quota list with new players. Musona was released together with Saviour Godwin (Nigeria), Ousmane Barry (Guinea), Damion Lowe (Jamaica), and the Brazilian trio of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musona-parts-ways-with-saudi-arabia-side-al-okhdood/\">Musona parts ways with Saudi Arabia side Al-Okhdood</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        },
        {
            "title": "MK party gives President Ramaphosa until Friday to resign, threatens rolling mass action",
            "url": "https://www.newzimbabwe.com/mk-party-gives-president-ramaphosa-until-friday-to-resign-threatens-rolling-mass-action/",
            "content": "IOL\n\nThe uMkhonto weSizwe (MK) party has formally delivered a letter of demand to Cyril Ramaphosa, calling on him to resign from office by 9am on Friday, 18 July.\n\nIn the letter seen by IOL, among other things, the MK party tells Ramaphosa that the decision toappoint Professor Cachalia as Acting Minister of Policeis in contravention of the Constitution, because the academic is not a member of Cabinet or the National Assembly.\n\nMK party national spokesperson, Nhlamulo Ndhlela, said Ramaphosa must resign in honour of Nelson Rolihlahla Mandela, the founding commander-in-chief of uMkhonto weSizwe  the military wing.\n\nShould Ramaphosa fail to heed this call, the MK party will pursue a range of lawful and peaceful actions, including constitutional litigation, a motion of no confidence in Parliament and rolling mass action nationwide, said Ndlela.\n\nThese steps reflect the will of the people, who, through democratic means, delivered a decisive electoral verdict against the African National Congress under Ramaphosas leadership.\n\nHe said, despite the clear message from the electorate, the will of the people has been undermined by opportunistic political alliances.\n\nDuring the May 2024 general elections,the African National Congress (ANC) secured just 40% of the vote, failing to maintain its decades-long parliamentary majority.\n\nThe so-called Government of National Unity (GNU), formed by the Democratic Alliance, Freedom Front Plus, and their collaborators, has effectively reinstalled the very ANC that South Africans voted out. This betrayal has sparked widespread public outrage and represents a direct affront to democratic accountability, said Ndlela.\n\nThe recent explosive revelations by General Mkhwanazi further expose the GNU as a deeply compromised arrangement, more aligned with criminality than with the constitutional mandate to serve the people.\n\nHe said the MK party views the GNU as the most dangerous political fraud in post-apartheid South Africa, adding that the political arrangement enables the continued theft of land, resources and dignity.\n\nThe MK party calls on Cyril Ramaphosa and the GNU to respect the voice of the people before irreparable damage is done to South Africas democratic institutions. The time for accountability and ethical leadership is now, said Ndlela.\n\nEarlier,IOL reported that as the streets of Durban became a backdrop for impassioned pleas for justice, Soweto residents and supporters of Lieutenant General Nhlanhla Mkhwanazi also took to the streets in support of the KZN police commissioner on Tuesday.\n\nMarching from Thokoza Park to the Kliptown police station, the small group lamented the recent deaths of councillors and other activists whose murders have not been resolved, while crime continues to spiral out of control.\n\nIn Durban, supporters of Mkhwanazi marched from Curries Fountain to Hoy Park to deliver a memorandum, calling for the police commissioners protection.\n\nThis march followed his recent media briefing, which has lifted the lid on alleged deep-rooted corruption within the SAPS.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16150857/Screenshot-2025-07-16-at-16.08.32.png",
            "description": "<p>IOL The uMkhonto weSizwe (MK) party has formally delivered a letter of demand to Cyril Ramaphosa, calling on him to resign from office by 9am on Friday, 18 July. In the letter seen by IOL, among other things, the MK party tells Ramaphosa that the decision to appoint Professor Cachalia as Acting Minister of Police is in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mk-party-gives-president-ramaphosa-until-friday-to-resign-threatens-rolling-mass-action/\">MK party gives President Ramaphosa until Friday to resign, threatens rolling mass action</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        },
        {
            "title": "Ramaphosa appoints Gwede Mantashe as acting police minister",
            "url": "https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/",
            "content": "In a decisive move to address escalating concerns within South Africas police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening,Cape {town} Etcreports.\n\nThis temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast a shadow over the law enforcement agency.\n\nMantashes role will be short-lived as he is slated to hold the position until Professor Firoz Cachalia steps into the role at the beginning of August.\n\nCachalia, who has spent most of his career in academia, is poised to take the reins following his retirement from the University of the Witwatersrand at the end of this month.\n\nHis appointment was previously announced by Ramaphosa during a televised address on Sunday.\n\nThe political landscape is particularly volatile at present, with serious allegations surfacing against former Police Minister Senzo Mchunu. In a stark revelation, KwaZulu-Natal Provincial Police Commissioner, Lieutenant General Nhlanhla Mkhwanazi, claimed a powerful criminal syndicate has infiltrated South Africas law enforcement and judicial systems.\n\nMkhwanazi went one step further, accusing Mchunu of meddling in sensitive cases and colluding with a businessman accused of murder, aiming to dismantle the task force investigating a spate of political killings in KwaZulu-Natal.\n\nIn light of these explosive allegations, President Ramaphosa has taken decisive action, placing Mchunu on special leave while also initiating a judicial commission of inquiry to be led by Acting Deputy Chief Justice Mbuyiseli Madlanga.\n\nThe commission is tasked with investigating claims of interference in investigations, complicity among government officials, and the suppression of crucial law enforcement activities.\n\nMchunu, embroiled in controversy over the past week, has been accused by Mkhwanazi of being entwined with drug cartels and influential business concerns.\n\nAmong the allegations presented was an assertion that Lieutenant-General Shadrack Sibiya, deputy national commissioner for crime detection, colluded with Mchunu and a known information dealer, Brown Mogotsi, in a plot to disband the KwaZulu-Natal political killings task team.\n\nPolice Commissioner Masemola announced that Sibiya would also be requesting a leave of absence while investigations unfold, indicating a stern approach to restoring integrity within the police service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/03003040/Gwede-Mantashe.png",
            "description": "<p>Cape ETC In a decisive move to address escalating concerns within South Africa’s police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening, Cape {town} Etc reports. This temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/\">Ramaphosa appoints Gwede Mantashe as acting police minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        },
        {
            "title": "Harare welcomes Pulitzer-winning playwright for intensive writing program",
            "url": "https://www.newzimbabwe.com/harare-welcomes-pulitzer-winning-playwright-for-intensive-writing-program/",
            "content": "By Tapiwa Svondo\n\nSix Zimbabwean playwrights are honing their craft under the tutelage of two-time Pulitzer Prize winner Lynn Nottage, hosted by Almasi Collaborative Arts in partnership with the Zimbabwe German Society.\n\nThe American playwright, known for her powerful works like Sweat and Ruined, is leading an intensive Re-Write Masterclass in Harare from the 5th to 19th of July.\n\nIn a statement, Almasi Collaborative Arts said playwrights Amanda Ranganawa (Mutare), Batsirai Chigama (Harare), Kingsley Chinhanu (Mutare), Philani Nyoni (Bulawayo), Rudo Mutangadura (Harare) and Tatenda Mutyambizi (Harare), are set to go through a rigorous process of refining their plays.\n\nThis intensive masterclass led by incomparable two-time Pulitzer Prize winner Lynn Nottage, arguably the most decorated playwright of our time, will equip six Zimbabwean writers with advanced skills to define robust narratives on the page and thus create impactful works ready for the global stage.\n\nThe six playwrights are further developing their plays to the level of professional works with the expert facilitation of Ms. Nottage, reads the statement.\n\nLynn Nottages Masterclass will showcase this Saturday, free for public viewing of new works by Zimbabwean playwrights.\n\nAs a key program in Almasis inaugural Africa Voices Now! A Festival of New African Plays, this Masterclass is geared to provide invaluable skills into the craft of re-writing as a crucial development tool and a platform for selected plays to be further honed before showcase at the festival.\n\nThe Masterclass enables Almasi to usher in a new era of dramatic making where we facilitate the cross-cultural exchange between world-renowned professionals and local practitioners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052947/497796.jpg",
            "description": "<p>By Tapiwa Svondo Six Zimbabwean playwrights are honing their craft under the tutelage of two-time Pulitzer Prize winner Lynn Nottage, hosted by Almasi Collaborative Arts in partnership with the Zimbabwe German Society. The American playwright, known for her powerful works like “Sweat” and “Ruined,” is leading an intensive “Re-Write Masterclass” in Harare from the 5th</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-welcomes-pulitzer-winning-playwright-for-intensive-writing-program/\">Harare welcomes Pulitzer-winning playwright for intensive writing program</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zim referee Brighton Chimene to officiate at CHAN",
            "url": "https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/",
            "content": "By Sports Reporter\n\nZimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month.\n\nThe tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August.\n\nChimene is one of the 75 selected referees to serve at the tournament.\n\nCHAN call-up marks Chimenes second major tournament this year, the first one being the AFCON boys under 17 three months ago.\n\nAged 35, Chimene was elevated to be an Elite B class on the FIFA panel early this year, making himself eligible for major CAF tournaments.\n\nThe four-time Zimbabwe Premier Soccer League Referee of the Year is now one level lower to officiate at the FIFA World Cup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052432/Brighton-Chimenes.jpg",
            "description": "<p>By Sports Reporter Zimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month. The tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August. Chimene is one of the 75</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/\">Zim referee Brighton Chimene to officiate at CHAN</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zimbabwe ranks among the world’s 10 most difficult places to live",
            "url": "https://www.newzimbabwe.com/zimbabwe-ranks-among-the-worlds-10-most-difficult-places-to-live/",
            "content": "Business Insider Africa\n\nZimbabwe and Nigeria have been ranked among the worlds 10 most difficult places to live, according to a new global livability index that highlights the harsh realities of urban life in some of the worlds most challenged cities.\n\nThe annual report, compiled by the Economist Intelligence Unit (EIU), measures cities based on stability, healthcare, education, infrastructure, and environment, key indicators that affectoverall quality of life.\n\nThe Global Livability Index evaluates cities based on over 30 indicators across five core categories: stability, healthcare, culture and environment, education, and infrastructure. Stability measures crime levels, civil unrest, and the threat of conflict.\n\nHealthcare assesses the quality and availability of public and private services. Culture and environment consider factors like climate, recreational options, and personal freedoms.\n\nEducation is judged by access to quality public and private schooling, while infrastructure focuses on roads, transport, housing, and global connectivity. These combined metrics provide a snapshot of how liveable a city is for its residents.\n\nMost African nations are grappling with persistent economic pressures, insecurity, and strained public services.\n\nIn many of these cities, ongoing political unrest, insecurity, limited access to quality healthcare, and under-resourced education systems contribute topoor livability scores.\n\nIn Nigeria, cities like Lagos and Port Harcourt continue to suffer from overcrowding, inadequate healthcare systems, and rising crime rates, while Zimbabwes capital, Harare, remains burdened by hyperinflation, aging infrastructure, and limited access to essential services.\n\nAlgeria and Libya have also been named among the worldsmost difficult placesto live, joining Nigeria and Zimbabwe in a ranking that highlights the pressures facing several African cities.\n\nFor example, Tripoli in Libya continues to struggle with the effects of prolonged conflict and weakened institutions, while Algiers faces structural economic challenges and restrictions on civil liberties.\n\nThese issues are compounded byinadequate infrastructureand housing conditions that fall short of global standards.\n\nThe table below presents the ten most challenging cities to live in globally.\n\nCities at the bottom of the liveability rankings are predominantly located in the Middle East and Africa, reflecting persistent instability, limited infrastructure, and constrained access to quality services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/17050648/harare.webp",
            "description": "<p>Business Insider Africa Zimbabwe and Nigeria have been ranked among the world’s 10 most difficult places to live, according to a new global livability index that highlights the harsh realities of urban life in some of the world’s most challenged cities. Zimbabwe and Nigeria rank among the world’s most difficult places to live, according to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ranks-among-the-worlds-10-most-difficult-places-to-live/\">Zimbabwe ranks among the world’s 10 most difficult places to live</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        },
        {
            "title": "Namib minerals to invest $400m in Zimbabwe gold mines",
            "url": "https://www.newzimbabwe.com/namib-minerals-to-invest-400m-in-zimbabwe-gold-mines/",
            "content": "Bloomberg\n\nNamib Minerals plans to invest as much as $400 million in reviving two gold mining ventures in Zimbabwe over the next five years.\n\nThe company is restarting the Redwing and Mazowe mines, which jointly hold 3.7 million ounces of gold, Namib Minerals Chief Executive Officer Ibrahima Sory Tall said Tuesday in an emailed statement. The two mines were under care and maintenance between 2019 and 2020.\n\nNamib Minerals, which started trading on the Nasdaq last month, already operates the How Mine near Zimbabwes second-biggest city of Bulawayo.\n\nThe miner expects to reopen Mazowe first, as the high-grade deposit  averaging 8 grams per ton  has lower capital requirements. The larger Redwing mine requires more investment, it said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/07203627/Gold.jpg",
            "description": "<p>Bloomberg Namib Minerals plans to invest as much as $400 million in reviving two gold mining ventures in Zimbabwe over the next five years. The company is restarting the Redwing and Mazowe mines, which jointly hold 3.7 million ounces of gold, Namib Minerals Chief Executive Officer Ibrahima Sory Tall said Tuesday in an emailed statement.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namib-minerals-to-invest-400m-in-zimbabwe-gold-mines/\">Namib minerals to invest $400m in Zimbabwe gold mines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        },
        {
            "title": "Pension funds’ tilt to property hurts Zimbabwe stocks",
            "url": "https://www.newzimbabwe.com/pension-funds-tilt-to-property-hurts-zimbabwe-stocks/",
            "content": "Bloomberg\n\nZimbabwes stock-market performance is being negatively impacted by pension funds overexposure to property, according to the countrys largest independently-owned asset manager.\n\nThe Zimbabwe Stock Exchange (ZSE), already weakened by declining foreign investor interest amid recurring currency woes, is now being hard-hit by pension funds shifting money into real estate, Shelton Sibanda, Imara Asset Managements chief executive officer, and John Legat, a non-executive director, wrote in a quarterly note to clients.\n\nPreviously, pension funds held nearly half of their assets in listed equities.\n\nNow, their total exposure, including cash and money market investments, has dropped to 25%, according to a report by the Insurance and Pensions Commission, the industry regulator.\n\nThats contributed to an almost 10% decline in the ZSE All Share Index this year. The bourse was once considered one of the best investment options in the southern African nation for hedging against exchange-rate volatility and inflation.\n\nUnrealistic valuations\n\nToday, too many pension funds are heavily weighted toward property, which is overvalued in our view, and alternative assets that have neither been marked down to realistic valuations nor have clear exit mechanisms, Sibanda and Legat wrote.\n\nThe failure to accurately value such holdings is worsening the situation: overvalued pension funds lead to inflated pension payouts, putting further pressure on the ZSE and Zimbabwes Victoria Falls Securities Exchange (VFEX) in the absence of adequate contributions, they said.\n\nThe result is a self-fulfilling prophecy, due to notable selling pressures to meet liquidity needs, prices of assets on both the ZSE and VFEX are very low and that has led investors to panic.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16050730/house-in-Borrowdale.jpg",
            "description": "<p>Bloomberg Zimbabwe’s stock-market performance is being negatively impacted by pension funds’ overexposure to property, according to the country’s largest independently-owned asset manager. The Zimbabwe Stock Exchange (ZSE), already weakened by declining foreign investor interest amid recurring currency woes, is now being hard-hit by pension funds shifting money into real estate, Shelton Sibanda, Imara Asset Management’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pension-funds-tilt-to-property-hurts-zimbabwe-stocks/\">Pension funds’ tilt to property hurts Zimbabwe stocks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "16 Jul 2025"
        }
    ]
}