{
    "news": [
        {
            "title": "‘Were they just voting on vibes?’: Oscars’ new compulsory viewing rule sparks backlash",
            "url": "https://www.newzimbabwe.com/were-they-just-voting-on-vibes-oscars-new-compulsory-viewing-rule-sparks-backlash/",
            "content": "The Guardian\n\nA new rule introduced by the Academy of Motion Picture Arts and Sciences to ensure voters have seen all the films in a category before they cast their ballots has provoked disquiet online, with many expressing surprise it wasnt already a requirement.\n\nA raft of measures were announced by theOscarsgoverning body on Monday, including the stipulation that Academy members must now watch all nominated films in each category to be eligible to vote in the final round for the Oscars.\n\nAbsolutely insane this wasnt already a thing, wrote one person on X, a sentiment echoed by many others, who questioned the validity of previous Academy decisions and theorised about the reasons key titles had been celebrated  or snubbed.\n\nYoure telling me all this time people could just watch one movie and be like yeah that should win all the awards, said another, with one X commentator asking: Were they just voting on vibes?\n\nTHEY WERENT DOING THAT BEFORE?, wrote one user, adding: This explains why movies like The Color Purple, Whats Love Got to Do With It, and Malcolm X were snubbed. These voters were NOT watching black films?\n\nAnonymous Oscar voters have previously admitted to not watching all the contenders in a category before voting in the final round.\n\nIm bummed because I havent seen The Substance or Im Still Here yet, one toldEntertainment Weeklyahead of the most recent ceremony. The first Dune, I couldnt get through; Im not rushing for another three hours of Dune. Theres still time to re-evaluate, but I really struggled.\n\nIn this event, voters are expected to abstain in that category, however there is no enforcement for this, and category error and ignorance can persist.\n\nOther leaked ballots earlier this year suggested a widespread misapprehension among voters that Conclaves Ralph Fiennes had already won an Oscar in 1994 for Schindlers List. In fact he has never won, and this year lost out to Adrien Brody for The Brutalist.\n\nOther changes to the awards included an update to the international feature film category, to include film-makers with refugee or asylum status, and the clarification that the use of generative AI in a film would neither help nor harm their submission.\n\nTwo of this years key nominees  The Brutalist and Emilia Prez  were involved in minor controversies over their use of AI to enhance the voices of their leading actors.\n\nMondays statement also provided further details on how the inaugural casting prize will be decided  the equivalent award was first introduced at theBaftasin 2020.\n\nCompulsory viewing was enforced by the British Academy as part of its radical overhaul of rules and regulations that same year, in response to the #BaftasSoWhite controversy.\n\nStringent regulations are in force to ensure not only that voters view all the films in the categories for which they cast their ballot, but also that they watch 15 randomised movies participating in the first stage of voting. As with the strict gender quotas in force on the director longlist, and the inclusivity criteria necessary for inclusion in a number of key categories such as outstanding British film, this measure is to try to promote a more diverse spread of contenders.\n\nSpeaking to theGuardian in 2018, ahead of her Oscar win for The Favourite,Olivia Colmansaid that she would always abstain from voting should she not have seen all films in consideration.\n\nThe alternative, she said, feels so naughty. I think maybe Im just really square. Colman went on to attribute her response to the fate of Paddy Considines 2011 filmTyrannosaur, in which she starred, and which was ignored by Bafta in its best film nominations: Very few people watched it and it broke my heart a bit.\n\nPreliminary voting for next yearsOscarsbegins in December, with the nominations announcement on 22 January ahead of the 15 March ceremony  an unusually long campaigning period. This years emcee, Conan OBrien, will return as host.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23064633/Screenshot-2025-04-23-at-07.44.26.png",
            "description": "<p>The Guardian A new rule introduced by the Academy of Motion Picture Arts and Sciences to ensure voters have seen all the films in a category before they cast their ballots has provoked disquiet online, with many expressing surprise it wasn’t already a requirement. A raft of measures were announced by the Oscars governing body on Monday,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/were-they-just-voting-on-vibes-oscars-new-compulsory-viewing-rule-sparks-backlash/\">‘Were they just voting on vibes?’: Oscars’ new compulsory viewing rule sparks backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "Ghana president suspends chief justice in unprecedented move",
            "url": "https://www.newzimbabwe.com/ghana-president-suspends-chief-justice-in-unprecedented-move/",
            "content": "BBC\n\nGhanaian President John Mahama has suspended the countrys Supreme Court chief justice  a move that marks a first in the countrys history.\n\nAn investigation has been launched and three undisclosed petitions have been filed making allegations against Gertrude Torkornoo, calling for her permanent removal.\n\nChief justices in Ghana enjoy security of tenure  meaning they can only be removed from office on a few grounds, which include incompetence and misbehaviour.\n\nThe content of the petitions has not been made public and she is yet to comment, while Ghanas former attorney general has claimed her suspension is an attempt to undermine the judiciary.\n\nI think it is a complete charade, Godfred Yeboah Dame told the BBC.\n\nIts the biggest assault on the [judiciary] in the nations history, the greatest assault on the independence of the judiciary under the constitutional dispensation of this country.\n\nMs Torkornoo is Ghanas third female chief justice and was nominated in 2023 by former president Nana Akufo-Addo.\n\nIt is her responsibility to oversee the administration of justice in Ghana.\n\nAccording to news agency Reuters, Ms Torkornoo survived a removal request earlier this year when former President Akufo-Addo said a petition to have her dismissed had several deficiencies.\n\nCopies of the three recently filed petitions against Ms Torkornoo were not initially made available to her.\n\nBut some lawyers argued that withholding the documents was a violation of Ms Torkornoos right to a fair hearing.\n\nCopies of the petition were subsequently made available to the chief justice, allowing her to respond to the allegations privately and in writing.\n\nMs Torkornoo will be invited by the five-member committee to respond again to the petitions before a final decision is reached as to whether she should be removed from office or not.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23062631/torkornoo-ghana.webp",
            "description": "<p>BBC Ghanaian President John Mahama has suspended the country’s Supreme Court chief justice – a move that marks a first in the country’s history. An investigation has been launched and three undisclosed petitions have been filed making allegations against Gertrude Torkornoo, calling for her permanent removal. Chief justices in Ghana enjoy security of tenure –</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ghana-president-suspends-chief-justice-in-unprecedented-move/\">Ghana president suspends chief justice in unprecedented move</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "Easter and Independence holiday road traffic accidents up by 34% – police",
            "url": "https://www.newzimbabwe.com/easter-and-independence-holiday-road-traffic-accidents-up-by-34-police/",
            "content": "By Costa Nkomo\n\nThe Zimbabwe Republic Police (ZRP) has reported a concerning increase of 34 percent in the number of accidents that occurred over the Easter and Independence holidays this year, compared to the same period in 2024.\n\nWhile the police noted that the number of fatalities during the 2025 Easter holidays fell slightly from 25 to 21 compared to the previous year, the number of injured persons actually rose, from 159 recorded last year to 178 this year.\n\nIn a statement released on Tuesday, national police spokesperson Commissioner Paul Nyathi said that both the number of accidents and the number of people injured were up on last years figures for the same period.\n\nOn Easter and Independence Holidays, a total of 384 road traffic accidents were recorded compared to 286 recorded during the same period last year.\n\nThe number of fatal road traffic accidents and people killed decreased from 27 to 24 and the number of fatal accidents decreased from 26 to 21. The number of people injured went up from 159 to 178, Nyathi said.\n\nHe highlighted the most serious accident, which occurred in Norton on 21 April 2025 which claimed four (4) lives.\n\nOne of the road traffic accidents recorded during the 2025 Easter and Independence Holidays includes the accident which occurred at the 51km peg along Harare Bulawayo Road on the 21st of April at around 1200hrs, where four people were killed, while 14 others were injured when a Toyota Hiace kombi which had 18 passengers on board, veered off the road and overturned.\n\nAs a result, three (3) passengers died on the spot and one (1) died upon admission at Norton Hospital.\n\nNyathi also drew attention to the tragic consequences of hit-and-run accidents, where motorists failed to stop at the scene.\n\nDuring the period, three (3) hit-and-run fatal accidents were recorded in Murewa and Harare. The first accident occurred on the 19th of April 2025, at the 57km peg along the Mutoko Chidye dust road, when an unknown motorcyclist hit a pedestrian and sped off. The victim died upon admission at Mutoko Hospital. The second accident occurred on the 20th of April 2025 along Harare-Bulawayo Road at Tynwald flyover when an unknown male adult was hit by an identified vehicle and died on the spot.\n\nOn the same date, another accident occurred along Harare- Bulawayo Road, near Puma Service Station in Whitehouse, where a 66-year-old man was hit by a Nissan Caravan vehicle. The victim died upon admission at Parirenyatwa Group Hospital, and the driver of the vehicle did not stop after the accident, Nyathi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18062359/IMG-20250417-WA0074.jpg",
            "description": "<p>By Costa Nkomo The Zimbabwe Republic Police (ZRP) has reported a concerning increase of 34 percent in the number of accidents that occurred over the Easter and Independence holidays this year, compared to the same period in 2024. While the police noted that the number of fatalities during the 2025 Easter holidays fell slightly from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/easter-and-independence-holiday-road-traffic-accidents-up-by-34-police/\">Easter and Independence holiday road traffic accidents up by 34% – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "We cannot stay home when we have to put food on the table –  Zimbabweans ignore calls for a stay away, cite tough economy",
            "url": "https://www.newzimbabwe.com/we-cannot-stay-home-when-we-have-to-put-food-on-the-table-zimbabweans-ignore-calls-for-a-stay-away-cite-tough-economy/",
            "content": "By Darlington Gatsi\n\nSCEPTICISM is growing towards war veteran Blessed Bombshell Gezas strategy to nullify a ZANU PF clique pushing for the extension of President Emmerson Mnangagwas rule beyond the stipulated two terms.\n\nGeza, who has positioned himself as a champion of constitutionalism by challenging the extension of President Mnangagwas rule, now faces doubts over his ambitious plan.\n\nThe firebrand war veteran has called for stay-aways as a sign of protest against Mnangagwas rule but has twice received a tepid response from the public.\n\nGezas call for indefinite protests flopped Tuesday, with the countrys major cities bustling with activity.\n\nHarare resident Daniel Mateta told NewZimbabwe.com that the stay-away puts ordinary citizens in a difficult position, forcing them to choose between survival and the change Geza is advocating for.\n\nComing to work today is a result of poverty. Someone telling us to stay awayI find it meaningless. I have to solve my problem by coming to work. I dont even know this Geza, said Mateta.\n\nGeza is banking on the support of citizens frustrated by the ailing economy, which has left the majority on the brink of formal unemployment.\n\nHowever, with most people engaged in informal employment, Gezas proposed strategy has fallen on deaf ears as citizens prioritise making a living over protesting against the government.\n\nRobert Moyo, who operates a grinding mill in Mbare, said that while there is an appetite for change, earning a living takes precedence over anti-Mnangagwa protests.\n\nWe are being squeezed from both sides. The economy is tough, which makes it hard for me to stay at home. I want economic change, but its difficult to choose which side to take. You cant stay at home because I have to put food on the table in the evening, which requires me to be at work during the day, said Moyo.\n\nMoyos sentiments are shared by many Zimbabweans who are frustrated by the countrys economic and political situation.\n\nThe ruling party, ZANU-PF, has been accused of entrenching corruption, with elites benefiting at the expense of the poor, who bear the brunt of the failing economy.\n\nThe countrys opposition is also in disarray, leaving citizens without a strong alternative voice or representation.\n\nDespite boasting military backing, Gezas plan risks fizzling out, with citizens taking it with a pinch of salt.\n\nIn 2017, President Mnangagwawith the armys support and street proteststoppled long-time leader Robert Mugabe, a playbook Geza is attempting to replicate.\n\nPolitical analyst Lazarus Sauti said that while Geza has silenced voices supporting President Mnangagwas term extension, he must reconsider his modus operandi.\n\nGeza is riding on the general consensus of Zimbabweans, especially regarding presidential term limits. Zimbabweans are against that. However, stay-aways in an informal economy like Zimbabwes are not sustainable.\n\nHe should change his tack if he is to silence the ED 2030 discourse. Credit to himGeza has managed to frighten the bootlickers who were singing the 2030 chorus, said Sauti.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22155536/Shutdown-flops-5.png",
            "description": "<p>By Darlington Gatsi SCEPTICISM is growing towards war veteran Blessed “Bombshell” Geza’s strategy to nullify a ZANU PF clique pushing for the extension of President Emmerson Mnangagwa’s rule beyond the stipulated two terms. Geza, who has positioned himself as a champion of constitutionalism by challenging the extension of President Mnangagwa’s rule, now faces doubts over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-cannot-stay-home-when-we-have-to-put-food-on-the-table-zimbabweans-ignore-calls-for-a-stay-away-cite-tough-economy/\">We cannot stay home when we have to put food on the table –  Zimbabweans ignore calls for a stay away, cite tough economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "Opposition supporter Madzibaba veShanduko’s home petrol bombed",
            "url": "https://www.newzimbabwe.com/opposition-supporter-madzibaba-veshandukos-home-petrol-bombed/",
            "content": "By Staff Reporter\n\nA staunch supporter of the opposition, Godfrey Karembera, popularly known as Madzibaba veShanduko, had his home petrol bombed on Monday night by unknown assailants.\n\nKaremberas home is located in the area under Chief Chipuriro in Guruve South and the property was reduced to ashes.\n\nKarembera himself was not at home when the attack took place. However, his 17-year-old son, Laxmore, sustained injuries while rescuing his two younger siblings from the inferno.\n\nLaxmore suffered deep lacerations to his neck and feet before he managed to escape with his siblings into the surrounding fields. He was rushed to Guruve District Hospital by neighbours.\n\nI was not at home when this happened, Karembera recounted. My neighbours, who witnessed everything, told me they heard noises around midnight that sounded like petrol bombs. My son has since confirmed it.\n\nHe told me he went out of his bedroom to investigate when he heard the strange noise. When he got outside, he realised that part of the house was on fire.\n\nHe ran back to his bedroom to wake up his siblings, with whom he shared a room. As they were escaping, another petrol bomb was thrown at them, but thankfully, they managed to get away through the fields.\n\nKarembera told NewZimbabwe.com that his neighbours reported seeing two top-of-the-range vehicles visiting his home before the incident. He suspects those individuals are responsible for the attack.\n\nThey told me that two GD6 Toyota Double cabs arrived at my house before the attack. I suspect those people are responsible for setting my home alight with petrol bombs, Karembera stated.\n\nKarembera has since filed a police report at Guruve District Police Station, and police officers attended the scene around 10 am on Tuesday.\n\nKarembera also described the apparent slowness of healthcare workers in attending to his son despite the urgent need for medical care. He believes this is due to his open support for Chamisa.\n\nLaxmore was taken to Shinje Clinic in Ward 7 by my friends, but the staff there refused to treat him, saying his injuries were too severe. They referred him to Guruve District Hospital, where, again, he was not attended to.\n\nThe healthcare workers appeared completely disinterested. I had to phone friends to help me get him to a private health facility where he is currently receiving treatment. He is in a great deal of pain, he explained.\n\nWe are not safe in our own homes, and yet we claim to be independent. There is no freedom whatsoever. We are being traumatised day and night, he lamented, his voice heavy with despair.\n\nKarembera was arrested in March 2022 and reportedly tortured at Harare Central Police Station. He was charged with disorderly conduct after he allegedly went into Harare Central Business District wearing yellow regalia, which then symbolised support for the Citizens Coalition for Change, just a month after its inception by Chamisa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/24035134/Godfrey-KaremberaCCC.png",
            "description": "<p>By Staff Reporter A staunch supporter of the opposition, Godfrey Karembera, popularly known as “Madzibaba veShanduko,” had his home petrol bombed on Monday night by unknown assailants. Karembera’s home is located in the area under Chief Chipuriro in Guruve South and the property was reduced to ashes. Karembera himself was not at home when the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-supporter-madzibaba-veshandukos-home-petrol-bombed/\">Opposition supporter Madzibaba veShanduko’s home petrol bombed </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "Drones help intercept over 1,000 undocumented migrants at Beitbridge",
            "url": "https://www.newzimbabwe.com/drones-help-intercept-over-1000-undocumented-migrants-at-beitbridge/",
            "content": "IOL\n\nBorder Management Authority (BMA) Commissioner Dr Michael Masiapato has praised the use of drones in helping intercept more than 1,000 undocumented migrants attempting to enter South Africa illegally over the Easter weekend.\n\nMasiapato confirmed that all those arrested will be deported to their homelands.\n\nWithout drones, this work becomes very expensive and ineffective. We would be patrolling blindly, not knowing if we would encounter people, Masiapato said on Monday during a media briefing at Beitbridge Border Post.\n\nHe admitted the BMA has long faced challenges intercepting undocumented migrants, but said the introduction of drones has significantly improved their operations.\n\nWith drones, we can now monitor vulnerable segments along the border and corridors. At Beitbridge, including the river crossing, we can see individuals using makeshift boats to cross. Once detected, we send coordinates to our ground teams, who move in to intercept them, Masiapato said.\n\nHe revealed that more than 1,000 illegal foreigners had been intercepted in the four days over the Easter weekend, due to the assistance of the drones.\n\nThe BMA also plans to implement a targeted approach to intercept facilitators assisting undocumented migrants to cross into South Africa illegally.\n\nHome Affairs Minister Leon Schreiber recently launched four drones and 40 body-worn cameras to strengthen border security.\n\nThe new technologies were deployed for the first time over Easter.\n\nSouth Africa shares borders with Lesotho, Botswana, Eswatini, Mozambique, Namibia, and Zimbabwe.\n\nHowever, these borders have long been plagued by illegal migration, cross-border crime, smuggling, and human trafficking, issues exacerbated by porous borders, corruption, and poor infrastructure.\n\nIOL News previously reported that Masiapato criticised neighbouring countries such as Zimbabwe, Mozambique and Lesotho for not doing enough to curb illegal migration, saying the problem affects South Africa more directly.\n\nIllegal migration is complicated, and its South Africa that bears the brunt, he said.\n\nOur neighbours do not allocate many resources to it, understandably, because it does not affect them directly. We continue to engage, but the problem persists.\n\nHe said the root causes of illegal immigration  unemployment and socioeconomic issues in neighbouring countries  are political matters that must be addressed at higher levels.\n\nWhile acknowledging that South Africa faces similar challenges, Masiapato said the country remains a pull factor due to its relatively better economic conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23055111/Screenshot-2025-04-23-at-06.50.34.png",
            "description": "<p>IOL Border Management Authority (BMA) Commissioner Dr Michael Masiapato has praised the use of drones in helping intercept more than 1,000 undocumented migrants attempting to enter South Africa illegally over the Easter weekend. Masiapato confirmed that all those arrested will be deported to their homelands. “Without drones, this work becomes very expensive and ineffective. We</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drones-help-intercept-over-1000-undocumented-migrants-at-beitbridge/\">Drones help intercept over 1,000 undocumented migrants at Beitbridge</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "In Pictures: Business as usual as Geza’s stay away flops",
            "url": "https://www.newzimbabwe.com/in-pictures-business-as-usual-as-gezas-stay-away-flops/",
            "content": "War veteran Blessed Gezas efforts to initiate a nationwide shutdown in Zimbabwe starting Tuesday failed, as the majority of people went about their normal daily routines.\n\nWhile traffic was noticeable, it was not as heavy as usual. Most businesses remained open, with only a few outlets closed.\n\nHere are some images from Harares Central Business District and Mbare.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22155539/Shutdown-flops-6.png",
            "description": "<p>War veteran Blessed Geza’s efforts to initiate a nationwide shutdown in Zimbabwe starting Tuesday failed, as the majority of people went about their normal daily routines. While traffic was noticeable, it was not as heavy as usual. Most businesses remained open, with only a few outlets closed. Here are some images from Harare’s Central Business</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-business-as-usual-as-gezas-stay-away-flops/\">In Pictures: Business as usual as Geza’s stay away flops</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "Business as usual in Harare as Geza’s stay away is ignored",
            "url": "https://www.newzimbabwe.com/business-as-usual-in-harare-as-gezas-stay-away-is-ignored/",
            "content": "By Staff Reporter\n\nRESIDENTS of Harare ignored war veteran Blesses Gezas call for a stay away on Tuesday, with most businesses operating as usual.\n\nFrom as early as 5 am, commuter omnibuses were touting for commuters, most of whom are vendors headed to Harares main vegetable market in Mbare.\n\nThere was no indication of any change in Dzivarasekwa Extension, Madokero, Westlea and Warren Park, Waterfalls, Greendale and Chitungwizawhen NewZimbabwe.com toured.\n\nThe same applied in the Central Business District (CBD) and areas such as Westgate, Rugare and the heavily populated Mbare high-density.\n\nWe cannot afford to stay away even if we wanted to, said a vendor in Warren Park who sells cigarettes, chips and soft drinks.\n\nEveryone understands what Geza is saying and agrees with him that only a few are living off Zimbabwes wealth but most of us are not formally employed, we eat what we kill on a daily basis.\n\nIf he intends to have people support his cause, he should take a different approach.\n\nVendors went about their business while most of the supermarkets in town were open.\n\nThe government had earlier warned civil servants not to stay at home and promised punishment for any of them who would choose to respect Gezas call.\n\nZimbabwe Republic Police (ZRP) spokesperson Paul Nyathi assured citizens and exhibitors at the ongoing Zimbabwe International Trade Fair (ZITF) in Bulawayo of their safety.\n\nGeza, the man who has riskedit all by taking confronting President Emmerson Mnangagwa and demanding that he steps down, on March 31 called for a protest cum stay away.\n\nMost businesses chose to stay shut while a significant number protested on the streets of Harare.\n\nHe is in hiding but maintains that Mnangagwa knows where he is.\n\nWe did not go to war so that Mnangagwa and his corrupt colleagues enjoy. We went to war for every Zimbabwean, he once again said when announcing the Tuesday and Wednesday stay away.\n\nGeza finds himself at the centre of factional fights within the ruling Zanu PF party.\n\nSome sections within the party, mainly from Mnangagwas Masvingo province, are calling for him to hang on beyond the constitutionally mandated two terms up to 2030.\n\nThe other faction, allegedly in support of Mnangagwas deputy Constantino Chiwenga, wants him to hand over power in 2028.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22111740/mbare-.jpeg",
            "description": "<p>By Staff Reporter RESIDENTS of Harare ignored war veteran Blesses Geza’s call for a stay away on Tuesday, with most businesses operating as usual. From as early as 5 am, commuter omnibuses were touting for commuters, most of whom are vendors headed to Harare’s main vegetable market in Mbare. There was no indication of any</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/business-as-usual-in-harare-as-gezas-stay-away-is-ignored/\">Business as usual in Harare as Geza’s stay away is ignored</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "Mapeza calm despite FC Platinum’s slow start",
            "url": "https://www.newzimbabwe.com/mapeza-calm-despite-fc-platinums-slow-start/",
            "content": "By Sports Reporter\n\nFC Platinum coach Norman Mapeza says he is not panicking despite his sides slow start in the ongoing Premier Soccer League campaign.\n\nMapezas team on Monday managed a one all draw against Scottland at Rufaro Stadium.\n\nFC Platinum picked up a point from the match, thanks to super-sub Jarrison Selimani, who scored an equalizer to cancel Vassil Kawes first-half strike for Scottland.\n\nWith one win so far this season, the Zvishavane-based side is currently sitting in position 10 on the log with 9 points.\n\nFC Platinum has been struggling upfront with only three goals in seven games, however, Mapeza ishopingfor an improvement.\n\nWe are ok, the boys are doing well despite us not scoring, I have been in this before and I am not panicking.\n\nIm not going to give my boys pressure, they are working so hard and you saw it today. The results will come, we just need to be patient and keep on working hard, said Mapeza.\n\nMapeza guided FC Platinum to win three of its four league titles in 2017, 2018 and 2022.\n\nFC Platinum and the current league log leader, Mwos, are the only teams yet to register a defeat this season in the ongoing league campaign.\n\nWe are doing well with these boys. I was with Munhumutapa in 2008, the first four games we lost, and by this time of this season, we were where we are right now, seven games with 9 points.\n\nSo I know anything can happen, its more or less the same, added Mapeza.\n\nCastle Lager Premier Soccer League Matchday 7 Results\n\nMWOS 1-0 Dynamos\n\nCAPS United 0-1 Bikita Minerals\n\nScottland 1-1 FC Platinum\n\nManica Diamonds 2-2 Tel One\n\nTriangle 1-0 Yadah\n\nNgezi Platinum 0-0 Highlanders\n\nChicken 1-0 Simba Bhora\n\nGreen Fuel 0-0 ZPC Kariba\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/05172218/Norman-Mapeza.jpg",
            "description": "<p>By Sports Reporter FC Platinum coach Norman Mapeza says he is not panicking despite his side’s slow start in the ongoing Premier Soccer League campaign. Mapeza’s team on Monday managed a one all draw against Scottland at Rufaro Stadium. FC Platinum picked up a point from the match, thanks to super-sub Jarrison Selimani, who scored</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mapeza-calm-despite-fc-platinums-slow-start/\">Mapeza calm despite FC Platinum’s slow start</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        },
        {
            "title": "‘Staying away from work is sabotage’—Civil servants warned against participating in national shutdown",
            "url": "https://www.newzimbabwe.com/staying-away-from-work-is-sabotage-civil-servants-warned-against-participating-in-national-shutdown/",
            "content": "By Staff Reporter\n\nTHE Public Service Commission (PSC)has issued a warning to civil servants who abscond from work heeding a call for a national shutdown.\n\nThe warning comes in the wake of calls by war veteran Blessed Bombshell Geza for citizens not to report for duty, but stay home in protest over alleged gross incompetence by President Emmerson Mnangagwa and his government. Geza says the protests should be sustained until Mnangagwa resigns.\n\nIn response to Gezas incitement, the PSC said its workers, who fail to report for duty, would be deemed saboteurs.\n\nThe PSC notes with concern recent incitements circulating in various platforms encouraging public servants and other citizens to stay away from work or abstain from regular activities on 22 and 23 April 2025.\n\nThe Commission is confident that public servants, who are committed, disciplined, and fully aware of their responsibilities, will not be misled by such reckless and disruptive incitements, PSC said in a statement.\n\nPublic servants are reminded that their core mandate is to serve the people of Zimbabwe faithfully, diligently, and without interruption. The work carried out by the Public Service is vital to the delivery of essential services and the advancement of our national development aspirations, as outlined in Vision 2030.\n\nThe government workers were also reminded that participating in the stay-away would be considered an act of insubordination.\n\nParticipation in any stay-away that disrupts service delivery constitutes a dereliction of duty and an act of insubordination. Such actions are unpatriotic, undermine national unity, damage the economy, and hinder the collective progress of the nation. The PSC will not tolerate any conduct that threatens the stability and functionality of public institutions, added the PSC.\n\nAccordingly, the PSC wishes to clarify that Tuesday, 22 April 2025, and Wednesday, 23 April 2025, are normal working days.\n\nSupervisors were urged to mark attendance registers of all government employees and inspectors will collect the registers at all ministries, departments and agencies.\n\nPSC said it expects its workers to be at their workstations and discharge normal duties professionally, thereby displaying their loyalty to the incumbent leadership.\n\nTogether, let us uphold the dignity of the Public Service and contribute meaningfully towards building a prosperous, resilient, and united Zimbabwe, the PSC statement further reads.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22075053/PSC.jpg",
            "description": "<p>By Staff Reporter THE Public Service Commission (PSC) has issued a warning to civil servants who abscond from work heeding a call for a national shutdown. The warning comes in the wake of calls by war veteran Blessed ‘Bombshell’ Geza for citizens not to report for duty, but stay home in protest over alleged gross incompetence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/staying-away-from-work-is-sabotage-civil-servants-warned-against-participating-in-national-shutdown/\">‘Staying away from work is sabotage’—Civil servants warned against participating in national shutdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:12",
            "date": "23 Apr 2025"
        }
    ]
}