{
    "news": [
        {
            "title": "Harare City Council fights court order to fix Mbare flats, sparking residents’ fury",
            "url": "https://www.newzimbabwe.com/harare-city-council-fights-court-order-to-fix-mbare-flats-sparking-residents-fury/",
            "content": "By Darlington Gatsi\n\nHARARE City Council is seeking the reversal of a High Court judgment that ordered the municipality to renovate the Mbare flats, a move that has riled the capitals residents.\n\nHarare City Council has filed an application appealing Justice Priscilla Munangati-Manongwas judgment, which compelled it to improve the living standards of Mbare residents.\n\nJustice Munangati-Manongwa ordered the City Council to exercise its mandate by renovating the Matapi, Matererini, Nenyere, and Mbare flats, which are in a state of disrepair.\n\nHCC is challenging this judgment, and the matter has been set for 18 July before Justice Manyangadze.\n\nThe Combined Harare Residents Association (CHRA), cited as the first respondent, has lashed out at the City Councils latest move, accusing it of abdicating its responsibility as the landlord of the Mbare flats.\n\nThe City of Harare has sparked outrage after launching an appeal to reverse a High Court judgment (HCH4825/24) compelling it to rehabilitate Mbare Flats and provide residents with basic water, sanitation, and hygiene services.\n\nThe court order was issued following a successful legal challenge led by the Combined Harare Residents Association (CHRA), which took the City of Harare to court over its failure to uphold residents constitutional right to safe and adequate housing, said CHRA in a statement.\n\nMbare flats have, in recent times, become hotbeds of disease and bedbugs, attributed to the unsanitary conditions. The hostels are characterised by raw sewage and a lack of water, amid a ballooning number of residents.\n\nCHRA said the situation is likely to worsen, with HCC failing to take responsibility for renovating the flats.\n\nThe court had ruled that the city must take immediate action to restore dignity and protect public health by upgrading the dilapidated and unsanitary Mbare hostels, which have long suffered from broken sewer systems, water shortages, and unsafe living conditions.\n\nNow, instead of complying with the judgment, the City of Harare is fighting to reverse the ruling, raising alarm bells among housing rights advocates and public health experts. This move threatens to deepen the housing and hygiene crisis already faced by thousands of Mbare residents, many of whom live in overcrowded, hazardous environments, said CHRA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04110814/mbare-3-e1667562235561.png",
            "description": "<p>By Darlington Gatsi HARARE City Council is seeking the reversal of a High Court judgment that ordered the municipality to renovate the Mbare flats, a move that has riled the capital’s residents. Harare City Council has filed an application appealing Justice Priscilla Munangati-Manongwa’s judgment, which compelled it to improve the living standards of Mbare residents.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-fights-court-order-to-fix-mbare-flats-sparking-residents-fury/\">Harare City Council fights court order to fix Mbare flats, sparking residents’ fury</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "08 Jul 2025"
        },
        {
            "title": "Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures",
            "url": "https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/",
            "content": "By Business Report\n\nAn uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities.\n\nHippo Valley, Tongaat Huletts Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this monthalthough the gross profit for the year to end March rose 2% to$66.87m.\n\nAnother Zimbabwean consumer company, Star Africa Corporation that also trades in sugar, however, raised revenues by 22% over the same period.\n\nNonetheless, analysts at IH Securities on Friday said in the securities and advisory firms latest research note on Zimbabwes consumer sector that they anticipate an uplift to volumes for consumer-facing companies this year owing to a likely recovery in consumer spend.\n\nHowever, this was against the backdrop of general cost structures continuing to be on the rise corresponding to a volatile policy environment and the crystallization of costs in United States dollars.\n\nOn the demand side, private consumption growth, which had slowed down from 4.8% in 2023 to 2.5% in 2024, is expected to have a rosier year with household spending rebounding by 6.6% in 2025, said the report.\n\nAfter an improved rainy season and prices for minerals such as gold firming up, Zimbabwean consumer firms are well placed for stronger consumer spending.\n\nCompanies expected to benefit from this include beer and soft drinks manufacturer, Delta Corporation, which has cited stiffer competition in some beverage categories.\n\nZimbabwean consumer discretionary spend however remains subdued, with data from Zimstats recently showing average earnings of 55% of the employed population at less than $100.\n\nMoreover, Zimbabwean companies have to absorb some of the legislation-linked costs of production, such as sugar taxes and fast-food taxes, to support volumes.\n\nIH Securities is thus skewed towards consumer-facing stocks thatexhibit the ability to generate a significant portion of revenue in US dollar, have good management practices, and are also consistent in paying dividends.\n\nCompanies offering defensive staples such as National Foods  in which Tiger Brands has an interest  were displaying volume growth, said the analysts.National Foods maize division recordeda significant volume growth of 58% in May over the comparative nine-month period, largely attributable to the market dynamics.\n\nDairy company, Dairibord, saw consolidated volume growth of 14% for itsfirst quarter ended 31 March 2025.\n\nOn the retail front, the past two years have been challenging for formal operators on account of several issues. As per leading retailers, a key impediment to viability has been S.I 81A of 2024, an exchange control act that mandated the selling of goods and services at the official exchange rate, noted the report.\n\nIt further though stated that Zimbabwesoperating environment for companiesremained challenging overall, citing key issues such as elevated production costs as well as sporadic operating liquidity squeezes in light of the tightening of monetary conditions.\n\nIt mentioned emerging cost pressures including the governments recent increase of 19.1% to the diesel levy as further worsening costs for companies.\n\nHeadwinds in Zimbabwe had already affected Hippo Valley, which has had to rightsize its workforce with 1 000 workers expected to be let go by August.\n\nOK Zimbabwe, another prominent retailer battling headwinds, is now undertaking a $30m rights issue to stabilize the company. The retailer has also announced further closures of stores, pointing to a 2025 year that remains volatile and fragile, but with a possibility of better performances by consumer companies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>By Business Report An uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities. Hippo Valley, Tongaat Hulett’s Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this month although the gross profit for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/\">Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "08 Jul 2025"
        },
        {
            "title": "Calvin Ratladi’s ‘Breakfast with Mugabe’ delivers a bold, haunting portrait at The Market Theatre",
            "url": "https://www.newzimbabwe.com/calvin-ratladis-breakfast-with-mugabe-delivers-a-bold-haunting-portrait-at-the-market-theatre/",
            "content": "IOL\n\nAfter a powerful debut at the 2025 National Arts Festival, Calvin RatladisBreakfast with Mugabeis set to make its way to the Market Theatre  bringing with it a bold, unflinching meditation on power, memory, and the ghosts that haunt leadership.\n\nThe production, which drew strong responses during its Makhanda run from July 3 to 6 as part of the festival  South Africas longest-running and most prestigious celebration of the arts  marked a significant moment for Ratladi, this years Standard Bank Young Artist for Theatre.\n\nBased on the award-winning script by British playwright Fraser Grace, the production reimagines President Robert Mugabe not as the distant figure weve come to know through headlines and political discourse, but as a haunted man, navigating memory, grief, and the ghosts of power.\n\nIn Graces fictionalised account, loosely inspired by reports that Mugabe once sought psychiatric help for his declining mental health, we find Zimbabwes former president in conversation with a white psychiatrist.\n\nWhat begins as a clinical session soon unravels into a layered exploration of trauma, nationalism, identity, and the burdens of leadership.Breakfast with Mugabehas been hailed as a modern-day Macbeth, but in Ratladis hands, the play becomes something even more personal and political.\n\nNever in my deepest existence did I imagine I would direct this play, Ratladi admits.\n\nI read it in 2016 while I was still an undergrad. I loved the script, but it was not the kind of work I gravitate towards.\n\nYet something lingered. Over the years, he noticed how the themes of land dispossession, power, African culture, spirituality and ancestry echoed his own artistic concerns. The connection deepened, not just with Mugabe the leader, but with Mugabe the man.\n\nI was interested in who this man really was. Not the version fed to us by the media and propaganda. I wanted to know the colour of his underwear, the small decisions in his household that somehow held global consequences. These things arent just personal, theyre ancestral, psychological, spiritual.\n\nTo ground the production in authenticity, Ratladi brought on a cultural dramaturg from Zimbabwe, Professor Samuel Ravengai, an academic intimately familiar with the countrys spiritual and political terrain.\n\nThe dramaturg helped guide certain choices in the staging, allowing Ratladi to merge intuitive direction with lived cultural insight. Every moment in the show was decided, he says. Sometimes I followed their advice fully, sometimes partially. But I always listened.\n\nHis cast, too, reflects this commitment to truth. Themba Ndaba brings gravitas to the role of Robert Mugabe, while Gontse Ntshegang embodies Grace Mugabe with a commanding, complex presence. Craig Jackson rounds out the principal cast as Andrew Peric, the probing psychiatrist whose sessions with Mugabe drive the psychological tension of the piece.\n\nOne surprise addition was the actor cast as the presidents bodyguard, Farai Chigudu, who flew in from Zimbabwe to audition.\n\nI asked him three times to come in, and he never once mentioned he was flying from Zimbabwe, Ratladi recalls. Now hes here, in South Africa, making his theatre debut.\n\nThe production process was as intense as the script itself. With just four weeks to mount the piece, Ratladi and his team worked at an unrelenting pace, driven by what he describes as a divine plan.\n\nThis felt like Gods work. Everything aligned, cast, collaborators, and timing. Things I dreamed about years ago just started falling into place.\n\nBut why should people come see Breakfast with Mugabe? For Ratladi, the answer lies in what the play dares to confront.\n\nIn African leadership, vulnerability is still a taboo, he says. And I think this play opens up that conversation. It shows how the political and the personal are deeply intertwined, how a moment of discomfort in a leaders household can spill over and shape the fate of an entire nation.\n\nRatladi refers to the piece as being full of flaws, fear, brilliance, and brokenness. At its heart, its about human beings, not headlines. I had to guide the actors to play real people. That meant stripping away performance masks and finding emotional truth. I hope audiences leave unsettled, in the best way, questioning the cost of silence, the weight of history, and what it means to protect the myths of ones life.\n\nRatladi insists that Breakfast with Mugabe is far more than a biographical study; its a meditation on the aftershocks of colonialism, the psychological toll of liberation, and the fragile humanity obscured by political power. His interpretation is steeped in African cosmology and cultural specificity, yet it echoes with a universality that resonates far beyond the continent.\n\nEvery day I walked into rehearsal, it felt like coming home, he says. Not work. Home. And we understood the politics of this continent, but also where we are now, and how this story might speak to the global moment.\n\nHe adds that the production has changed him. One thing this work has taught me is to trust slowness. To listen. Ive learned that the most powerful moments are found in the quiet corners of a scene, in the breath before the line. Its reaffirmed my commitment to telling African stories with complexity, without simplifying our realities to fit Western expectations.\n\nBreakfast with Mugabe will make its highly anticipated debut at The Market Theatre, where it will run from July 16 to August 10.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07103832/Screenshot-2025-07-07-at-11.37.46.png",
            "description": "<p>IOL After a powerful debut at the 2025 National Arts Festival, Calvin Ratladi’s Breakfast with Mugabe is set to make its way to the Market Theatre – bringing with it a bold, unflinching meditation on power, memory, and the ghosts that haunt leadership. The production, which drew strong responses during its Makhanda run from July 3</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/calvin-ratladis-breakfast-with-mugabe-delivers-a-bold-haunting-portrait-at-the-market-theatre/\">Calvin Ratladi’s ‘Breakfast with Mugabe’ delivers a bold, haunting portrait at The Market Theatre</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "08 Jul 2025"
        },
        {
            "title": "Railroad accidents surge, ten hit by trains in six months",
            "url": "https://www.newzimbabwe.com/railroad-accidents-surge-ten-hit-by-trains-in-six-months/",
            "content": "By Staff Reporter\n\nTEN people were hit by trains in the first half of 2025, resulting in four deaths and six injuries, the National Railways of Zimbabwe (NRZ) has revealed.\n\nAccording to NRZ, some of these accidents are caused by pedestrians walking or exercising on railway tracks, motorists and pedestrians ignoring safety regulations at level crossings, and distractions such as mobile phones or headphones near railway lines.\n\nIn a statement Monday, NRZ spokesperson Andrew Kunambura raised concerns over the increase in train accidents, with this years figures already surpassing last years totals and urged motorists and pedestrians to exercise extreme caution on railway tracks.\n\nIn the first half of the year, 13 level crossing accidents were recorded, resulting in 13 injuries, while 10 people were hit by trains walking on tracks or close to the railway line, leading to four deaths and six injuries.\n\nThe whole of last year, 13 level crossing accidents were recorded resulting in one death and 26 injuries while five people were killed and eight injured after being hit by trains.\n\nIf the trend of accidents recorded so far this year continues, it means last years figures would be significantly surpassed, Kunambura said.\n\nKunambura also encouraged parents and schools to teach children about the dangers of playing near railway tracks.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/20022554/Railway-Line.png",
            "description": "<p>By Staff Reporter TEN people were hit by trains in the first half of 2025, resulting in four deaths and six injuries, the National Railways of Zimbabwe (NRZ) has revealed. According to NRZ, some of these accidents are caused by pedestrians walking or exercising on railway tracks, motorists and pedestrians ignoring safety regulations at level</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/railroad-accidents-surge-ten-hit-by-trains-in-six-months/\">Railroad accidents surge, ten hit by trains in six months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "08 Jul 2025"
        },
        {
            "title": "Mai TT slapped with US$100,000 defamation lawsuit",
            "url": "https://www.newzimbabwe.com/mai-tt-slapped-with-us100000-defamation-lawsuit/",
            "content": "By Staff Reporter\n\nCOMEDIENNE Mai TT is facing a US$100,000 defamation lawsuit from businesswoman Shingirayi Ziwange Jere, wife of Murehwa West legislator and CAPS United owner Farai Jere.\n\nThe lawsuit follows Facebook posts in which Mai TT accused Jere of threatening her, sending people to assault her, and manipulating the justice system.\n\nJere represented by lawyer Admire Rubaya of Rubaya and Chatambudza Legal Practitioners, said the statements published on June 9 were unfounded and fabricated and depicted the businesswoman as a criminal queenpin.\n\nShingirayi Ziwange Jere\n\nIn this digital epoch where all and sundry have widespread access to the internet, it is our clients considered view that the statements that you published on your FACEBOOK page are defamatory and were understood by a reasonable reader, follower or Facebook user to carry one or more of the following meanings:\n\nThat our client acts with impunity in that she is a maliciously dangerous person who malevolently hires criminals to commit assault and torture ordinary citizens and non-entities like you.\n\nThat our client, is a criminal queenpin conducting criminal activities of conducting unlawful surveillance on your property without your consent and/or permission and is consistently threatening you with death and harm.\n\nThat our client is a person who manipulates the justice system in Zimbabwe which has led to you losing a case against another socialite Patricia Jack whom you allegedly caused her arrest for alleged uploading your daughters nude pictures yet our client has no connection whatsoever to justice system in Zimbabwe and has no capacity whatsoever to influence any out comes regards cases in Zimbabwe, reads the letter.\n\nJere is also lodging a criminal complaint against Mai TT under Zimbabwes Cyber and Data Protection Act for cyberbullying, harassment, and spreading false information.\n\nThe overall tenor of your ill-founded social media rants is that you are sadfishing at the expense of our client and she will not take this lying low.\n\nIn this vein, please note that our client is in the process of lodging a criminal complaint against you. It is quite ironic and amusing how you must obviously be aware that your actions are clearly criminal, given your history of lodging similar complaints against others. Therefore, this may literally be a charming dose of your own medicine.\n\nWe urge you to consider Section 164B, 164C of the Criminal law Codification and Reform Act [Chapter 9:23] as amended by the Cyber and Data Protection Act [Chapter 12:07.\n\nThese two offences creating provisions relate to cyber-bullying, harassment and transmission of false data messages intending to cause harm, which include economic harm, reads the letter.\n\nFurthermore, Jeres legal team has demanded a full, unconditional and unreserved withdrawal from Mai TT within twelve hours, warning that failure to comply will result in a formal summons for US$100,000 in damages.\n\nIn light of the above, our strict instructions are to demand, as we hereby do, the publication of a full, unconditional and unreserved withdrawal of that defamatory statement, pictures and the related imputations together with an expression of regret on the same within twelve hours of receiving this letter as well as an instruction to your personnel in charge of the content of your Facebook page and/ or other social media pages or handles to delete the posts and comments in question.\n\nIn the event that you fail to retract the defamatory statements as demanded our client shall proceed to issue Summons and claim damages for defamation in the tune of US$100,000 (One Hundred United States Dollars) without any further notice to you, reads the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07195804/WhatsApp-Image-2025-07-07-at-20.55.21.jpeg",
            "description": "<p>By Staff Reporter COMEDIENNE  Mai TT is facing a US$100,000 defamation lawsuit from businesswoman Shingirayi Ziwange Jere, wife of Murehwa West legislator and CAPS United owner Farai Jere. The lawsuit follows Facebook posts in which Mai TT accused Jere of threatening her, sending people to assault her, and manipulating the justice system. Jere represented by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mai-tt-slapped-with-us100000-defamation-lawsuit/\">Mai TT slapped with US$100,000 defamation lawsuit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "08 Jul 2025"
        },
        {
            "title": "Youth Minister Machakaire demands public apology, retraction from Mahere following social media row",
            "url": "https://www.newzimbabwe.com/youth-minister-machakaire-demands-public-apology-retraction-from-mahere-following-social-media-row/",
            "content": "By Staff Reporter\n\nYOUTH Empowerment Minister Tinoda Machakaire has written tolawyer and opposition politician Fadzayi Mahere, demanding a retraction and public apology within 24 hours over what he describes as defamatory allegations.\n\nThe two have been engaged in a heated exchange on X, after Machakaire echoed President Emmerson Mnangagwas denunciation of zvigananda.\n\nThe term zvigananda is a derogatory label for individuals with ill-got wealth.\n\nMahere respondedto Machakaire,questioninghim over allegations that his company, TinMac Motors, was corruptly awarded tenders under the US$3 billion Command Agriculture scheme due to his association with controversial businesstycoonKudakwasheTagwirei.\n\nShe also raised concerns about a vehicle scandal during Machakaires tenure as Deputy Youth Minister, where 17 cars were purchased for the ministry, yet only seven were delivered and just four were officially registered under the ministry.\n\nFadzayi Mahere\n\nMahere further questioned Machakaire about an alleged multi-million-dollar tax evasion case involving vehicle imports, which was reportedly dropped by the Zimbabwe Anti-Corruption Commission following political interference.\n\nIn a letter seen by NewZimbabwe.com Monday, Machakaire, through his lawyers, demanded that Mahere issue a public apology and retraction in both print and digital media.\n\nWe hereby demand, as we are instructed, that you comply with the following within 24 hours of receipt of this letter:\n\nYou shall issue a sincere, profuse, and unconditional public apology to our client, acknowledging the harm caused by your nefarious allegations. The apology must be both in print and digital media.\n\nFor the avoidance of doubt, you shall cause an apology to be published in one of the most widely circulating newspapers in this country and post the same apology on your X handle, @advocatemahere.\n\nYou shall unconditionally retract the posts you made on your X handle, regarding Honourable Machakaire, alleging he is corrupt, dishonest, a liar, and misuses public funds to acquire luxury vehicles, the letter reads.\n\nMeanwhile, Mahere acknowledged receipt of the letter but questionedwhether Machakaire was aware that the Access to Information and Protection of Privacy Act (AIPPA), which he cited in his letter, was repealed five years ago.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/14011139/Machakaire-1.jpg",
            "description": "<p>By Staff Reporter YOUTH Empowerment Minister Tinoda Machakaire has written to lawyer and opposition politician Fadzayi Mahere, demanding a retraction and public apology within 24 hours over what he describes as “defamatory allegations”. The two have been engaged in a heated exchange on X, after Machakaire echoed President Emmerson Mnangagwa’s denunciation of “zvigananda.” The term “zvigananda”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/youth-minister-machakaire-demands-public-apology-retraction-from-mahere-following-social-media-row/\">Youth Minister Machakaire demands public apology, retraction from Mahere following social media row</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "08 Jul 2025"
        },
        {
            "title": "LONDON: Diaspora Insurance CEO wins UK Africa business award",
            "url": "https://www.newzimbabwe.com/london-diaspora-insurance-ceo-wins-uk-africa-business-award/",
            "content": "By Gilbert Nyambabvu\n\nDIASPORA InsuranceCEO, Jeff Madzingo, was last week recognised and honoured as one of the leading African entrepreneurs and business leaders in the United Kingdom.\n\nMadzingo won the Financial Services Excellence Award at a glittering gala dinner in London hosted by theAfrican Business Chamberand attended by diplomats, entrepreneurs and business executives.\n\nIn his keynote address, Rwandas High Commissioner to the United Kingdom, H.E. Johnston Busingye,\n\nRwandas High Commissioner to the United Kingdom, H.E. Johnston Busingye\n\nchallenged Africans to commit ourselves to making a difference.\n\nThe Africa we want is within reach, but getting there requires governments that match policy with implementation, businesses that take bold steps, and partners who are willing to build lasting and productive relationships.\n\nMeanwhile, founded 14 years ago,Diaspora Insurancehas enjoyed phenomenal growth, developing into a multi-million-dollar business from its global headquarters in Birmingham.\n\nFrom covering just two countries when it was founded, the company now covers 20 African nationalities not just in the UK and Europe but right across the world.\n\nWhen we started, we did say we can only call ourselves a civilised people when we are able to create common solutions for our common good, said Madzingo.\n\nWe were coming from a background where every time there is a bereavement, it comes with a begging bowl, and we needed to arrest that challenge.\n\nDiaspora Insurancechanged the traditional services-based approach to funeral insurance, introducing products more suited to the unique needs of African diasporas.\n\nThe companysfuneral cash planprovides immediate cash intervention to ensure families are not subjected to the double trauma and indignity of grieving and begging at the same time.\n\nMadzingo also shared insights on challenges which face African entrepreneurs in the UK, including poor access to capital, lack of professional support and limited networks, limited experience in top executive roles.\n\nOther drawbacks include a consumer rather than producer mindset that we come with as African entrepreneurs, said Madzingo, adding that we also tend to focus on businesses that are very difficult to scale up.\n\nAwards host, theAfrican Business Chamber (AfBC), is a global organisation dedicated to representing and supporting African businesses, investors, and entrepreneurs as they grow and thrive in the global economy.\n\nChamber CEO Eugene Nizeyimana said the organisation was eight years ago to enhance our representation in the UK economy, enhance our voice, and establish businesses that create jobs and wealth.\n\nSecondly, we want to drive investment between the UK and Africa, make sure that all of us, as we live in the UK we also contribute back, engage back and invest back in Africa.\n\nTop 100 Business Leader of the Year:Said ADREN\n\nBusiness Excellence Award:Edward Obi Chartered FCIPD, MIRP, TechIOSH\n\nEntrepreneur of the Year:Cody Gapare (CMgr MCMI MBA)\n\nStartup and New Business of the Year Award:Michaelle Kubwimana\n\nTechnology and Innovation Excellence Award:Olusola (Sola) Idowu\n\nHealthcare Excellence Award:Professor Rotimi Jaiyesimi\n\nCreative Industry Excellence Award:Juliana Olayinka\n\nFinancial Services Excellence Award:Jeff Madzingo\n\nProfessional Services Excellence Award:Leslie Owusu\n\nWomen in Business (WIB) Excellence Award:Fungai Ndemera\n\nInternational Trade Excellence Award:Veronica Bolton Smith\n\nSocial Enterprise Excellence Award:Leah Chikamba-Mulando\n\nDiaspora Excellence Award:Jabo Butera\n\nBusiness of the Year Award:Bank Of Africa UK\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07180151/MADZINGO.png",
            "description": "<p>By Gilbert Nyambabvu DIASPORA Insurance CEO, Jeff Madzingo, was last week recognised and honoured as one of the leading African entrepreneurs and business leaders in the United Kingdom. Madzingo won the Financial Services Excellence Award at a glittering gala dinner in London hosted by the African Business Chamber and attended by diplomats, entrepreneurs and business</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/london-diaspora-insurance-ceo-wins-uk-africa-business-award/\">LONDON: Diaspora Insurance CEO wins UK Africa business award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "08 Jul 2025"
        }
    ]
}