{
    "news": [
        {
            "title": "Referee’s baby dies at ZIFA Village during training seminar",
            "url": "https://www.newzimbabwe.com/referees-baby-dies-at-zifa-village-during-training-seminar/",
            "content": "By Sports Reporter\n\nA local female referees baby has died at the ZIFA Village in Mt Hampden, where a FIFA MA Referees training course is currently underway.\n\nThe referee had attended the workshop with her two children when one of the toddlers suddenly passed away, despite efforts to resuscitate the infant.\n\nIn a statement released Wednesday, ZIFA confirmed the tragedy and said the matter is now being handled by the Zimbabwe Republic Police(ZRP).\n\nOne of the female participants, who had attended with her two children, suffered the sudden and unexpected loss of her infant child during the course of the day. Despite immediate efforts to render assistance, the child sadly passed away.\n\nThe matter has been referred to the Zimbabwe Republic Police, who are now handling the case in accordance with the law. ZIFA is cooperating fully with the relevant authorities and is extending support to the bereaved mother during this extremely difficult time.\n\nAs an Association, we extend our deepest condolences to the bereaved family and respectfully ask that their privacy be observed, read the statement.\n\nThe five-day refresher course, which began on Monday, is scheduled to end on Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20153335/referee-training-.jpg",
            "description": "<p>By Sports Reporter A local female referee’s baby has died at the ZIFA Village in Mt Hampden, where a FIFA MA Referees training course is currently underway. The referee had attended the workshop with her two children when one of the toddlers suddenly passed away, despite efforts to resuscitate the infant. In a statement released</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/referees-baby-dies-at-zifa-village-during-training-seminar/\">Referee’s baby dies at ZIFA Village during training seminar</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "FIFA instructor hails Zimbabwean referees’ progress on international stage",
            "url": "https://www.newzimbabwe.com/fifa-instructor-hails-zimbabwean-referees-progress-on-international-stage/",
            "content": "By Sports Reporter\n\nFIFA referees instructor Felix Tangawarima has heaped praise on Zimbabwean match officials.\n\nHe was speaking on the sidelines of a one-week Referees MA Course being held at ZIFA Village in Harare.\n\nNow serving as an instructor, Tangawarima said Zimbabwean referees are doing well in international duty, a sign of how much they have improved.\n\nI can safely say that, as FIFA, we are extremely happy with how these local referees are performing at the international level.\n\nYou can see that there is an increase in the number of referees we are assigning to handle international games, so they are not doing badly, he said.\n\nZimbabwe currently has reigning Referee of the Year Brighton Chimene at the ongoing CHAN tournament as one of the match officials.\n\nOther than Chimene, six local referees are also on the COSAFA panel.\n\nTangawarima is Zimbabwes most successful referee in history. In 2000, he became the first local referee to officiate at AFCON.\n\nCurrently, he is the Head of Referees at COSAFA, leading all referees in the Southern African Region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20072542/felix-tangawarima.jpg",
            "description": "<p>By Sports Reporter FIFA referees instructor Felix Tangawarima has heaped praise on Zimbabwean match officials. He was speaking on the sidelines of a one-week Referees MA Course being held at ZIFA Village in Harare. Now serving as an instructor, Tangawarima said Zimbabwean referees are doing well in international duty, a sign of how much they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fifa-instructor-hails-zimbabwean-referees-progress-on-international-stage/\">FIFA instructor hails Zimbabwean referees’ progress on international stage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Court strikes blow against tenants in battle with Harare City Council’s Rufaro Marketing",
            "url": "https://www.newzimbabwe.com/court-strikes-blow-against-tenants-in-battle-with-harare-city-councils-rufaro-marketing/",
            "content": "By Mary Taruvinga\n\nThe High Court has struck off the roll a case brought by three bar operators against Rufaro Marketing (Pvt) Ltd, a Harare City Councilowned company, in a ruling that gives the municipal entity the upper hand in an ongoing battle over leases and sub-tenancy rights.\n\nThe applicants, Ilack Moyo, John Musara and Tendayi Mhembere had sought a declaratory order blocking Rufaro Marketing from collecting rentals directly from their subtenants at Zororo II Bar in Dzivarasekwa, Mabvuku Bar and Willowvale Bar in Highfield.\n\nJusticeMaxwell Takuva ruled that the dispute could not be entertained while related proceedings were already pending before the Magistrates Court.\n\nThis court cannot intervene in the proceedings in the Magistrates Court lest it risks the possibility of conflicting judgments, Takuva said.\n\nWhatever decision that the Magistrate reaches will be able to guide the parties as to how to proceed from there onwards.\n\nThe bar operators accused Rufaro Marketings new management of unlawfully diverting rental payments from their subtenants, undermining agreements they had entered into with the companys previous chief executive officer.\n\nThey argued that this move crippled their ability to meet rental obligations.\n\nHowever, Takuva found the tenants case misdirected, stressing that once they had withdrawn a previous High Court application, they could not stop the respondent from pursuing its own legal remedies.\n\nWhen a party decides to withdraw its matter, it cannot therefore stay the other parties from proceeding to pursue their own application to court, the judge ruled.\n\nStriking the matter off the roll, the court ordered the applicants to pay costs.\n\nWith the case now resting in the Magistrates Court, Rufaro Marketing retains control of rental collections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/19182107/rufaro-marketing-.jpg",
            "description": "<p>By Mary Taruvinga The High Court has struck off the roll a case brought by three bar operators against Rufaro Marketing (Pvt) Ltd, a Harare City Council–owned company, in a ruling that gives the municipal entity the upper hand in an ongoing battle over leases and sub-tenancy rights. The applicants, Ilack Moyo, John Musara and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-strikes-blow-against-tenants-in-battle-with-harare-city-councils-rufaro-marketing/\">Court strikes blow against tenants in battle with Harare City Council’s Rufaro Marketing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        },
        {
            "title": "Ambitious refugee Tawanda Muyeye is now a star of The Hundred",
            "url": "https://www.newzimbabwe.com/ambitious-refugee-tawanda-muyeye-is-now-a-star-of-the-hundred/",
            "content": "The Voice\n\nAMBITIOUS refugee Tawanda Muyeye is now a star of The Hundred. In early 2021, months before signing his professional contract with Kent Cricket, Tawanda had his right to remain in the United Kingdom approved by the Home Office.\n\nBorn and bred in Zimbabwe, Tawanda moved to England at the age of 17 and attended Eastbourne College on a cricket scholarship, while spending some time with the Sussex Academy.\n\nNow a batter for Kent Cricket and the Oval Invincibles, Tawanda is set to compete at The Hundred, where he will be one of the few Black players at the tournament.\n\nFor me to be a Black player, playing cricket in England, it just shows that there are no boundaries, Tawanda toldThe Voice.\n\nIf you have dreams, you can achieve them. The colour of your skin doesnt matter. Of course, therell be hurdles along the way, but I think being a player of colour and being a representative is quite a big thing because it just shows that anything is possible.\n\nWhile his professional career began in England, Tawandas love for cricket was born in Zimbabwe when he was just a child.\n\nFor me to be a Black player, playing cricket in England, it just shows that there are no boundaries\n\nMy brother was the person who got me into cricket. On the weekends, when hed come back home from boarding school, I would play cricket with him. Thats how it all started.\n\nIn the High School that I attended, theyd just built a high performance cricket centre, which is unheard of in Zimbabwe, unless youre playing for the national team.\n\nThere werent many high performance centres, especially not in schools, so that was a massive thing, and I spent a lot of my time in there.\n\nWhen I moved to England, I think the biggest change was the weather! Goodness, I found that change difficult, even in April, May, it was still quite chilly for a Zimbabwean kid.\n\nTawanda made a big impression during his time at Eastbourne College. His runs led him to be namedWisdensSchools Cricketer of the Year for 2020, and Kent took notice.\n\nKent are a big reason Im where I am today. They had to jump through some hurdles to get me to this point because Im a refugee, and my family are refugees.\n\nThere was a man named Paul Downton, he was the Director of Cricket at Kent, and he went out of his way to help me. Kent gave me the opportunity to grow and develop as a player, and theyve given me the platform to showcase what I can do.\n\nLooking back four years later, Im just very grateful for Kent and everything theyve done for me.\n\nIve just signed a new contract with them, and I want to give them a shoutout because it wasnt easy for them initially, but they made my life easier and treated me like a normal person and welcomed me with open arms.\n\nTawanda has achieved so much already, and it is the 24-year-olds mindset which keeps him moving forward.\n\nFor me, its about striving to be the best that I can be, not comparing myself to others, because I believe comparison is the thief of all joy.\n\nWhen you get into the professional game, it becomes a bit more complex, and the transition isnt easy. However, I think because I have that desire to be the best that I can be, it keeps me going and keeps me motivated to achieve my goals.\n\nMy main aspiration is to play cricket for England, to play as many Test matches as I can for England. However, I dont just want to play for England once, I want to play for a long time and be good enough to achieve that goal.\n\nKent had to jump through some hurdles to get me to this point because Im a refugee, and my family are refugees.\n\nWhile his focus is on cricket, Tawanda hopes he is remembered for so much more than just the sport. When I do finish playing cricket, I hope people remember me as a person first and foremost, because Im a human being. I go through everything that every other human being goes through.\n\nI dont want people to put me on a pedestal, because no one is bigger than anyone or bigger than the sport. If people are to think about me when I finish playing, I just want them to think that I was entertaining, and a fun person to watch.\n\nI just want to be myself, go out there, be free and play with a smile on my face and inspire people to have fun with what theyre doing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/19164854/muyeye.jpg",
            "description": "<p>The Voice AMBITIOUS refugee Tawanda Muyeye is now a star of The Hundred. In early 2021, months before signing his professional contract with Kent Cricket, Tawanda had his right to remain in the United Kingdom approved by the Home Office. Born and bred in Zimbabwe, Tawanda moved to England at the age of 17 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ambitious-refugee-tawanda-muyeye-is-now-a-star-of-the-hundred/\">Ambitious refugee Tawanda Muyeye is now a star of The Hundred</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Aug 2025"
        }
    ]
}