{
    "news": [
        {
            "title": "Silent Killer no-show disappoints Durban fans, promoters threaten legal action",
            "url": "https://www.newzimbabwe.com/silent-killer-no-show-disappoints-durban-fans-promoters-threaten-legal-action/",
            "content": "By Staff Reporter\n\nZimdancehall artist Silent Killer did not show up for a recent music show at Cool Runnings, Durban, leaving fans and promoters frustrated.\n\nThis incident follows another no-show by the chanter at the UK SAMA Festival in April, after he reportedly refused to board a flight due to a troubling dream.\n\nStige Movement, the Durban shows promoter, expressed deep frustration over the artists absence, citing breach of contract despite arranging flights, accommodation, and providing a 50% advance payment.\n\nIn a statement, Promoter Nqabutho Prestige Stige Dlamini has demanded a public apology from Silent Killer.\n\nFans had gathered in numbers at Cool Runnings, enthusiastic to witness Silent Killers electrifying performance. The venue buzzed with anticipation, only to be dampened by the news of his unexplained nonappearance. Stige Movement has now publicly called on Silent Killer to issue an unreserved media apology to both the Durban fans and the promoter.\n\nFailure to apologise will result in instantaneous legal action. We will open a case for breach of contract and damages incurred.\n\nStige applauded artists Qounfuzed and Junior Spragga for their top performances despite Silent Killers absence.\n\nDespite the setback, the night was not without its highlights. Stige Movement extends heartfelt gratitude to artists Qounfuzed and Junior Spragga along with their management teams for delivering exceptional performances and maintaining a high level of proficiency under challenging circumstances.\n\nWe sincerely apologise to all our fans and supporters who came out in full force. We will not tolerate disregard for commitment, and we will continue to uphold the values of veracity, responsibility, and excellence in our events.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/18060254/Silent-Killer.webp",
            "description": "<p>By Staff Reporter Zimdancehall artist Silent Killer did not show up for a recent music show at Cool Runnings, Durban, leaving fans and promoters frustrated. This incident follows another no-show by the chanter at the UK SAMA Festival in April, after he reportedly refused to board a flight due to a “troubling dream.” Stige Movement,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/silent-killer-no-show-disappoints-durban-fans-promoters-threaten-legal-action/\">Silent Killer no-show disappoints Durban fans, promoters threaten legal action</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Sables return to hero’s welcome after Rugby Africa Cup victory",
            "url": "https://www.newzimbabwe.com/sables-return-to-heros-welcome-after-rugby-africa-cup-victory/",
            "content": "By Sports Reporter\n\nHundreds of rugby fans thronged Robert Mugabe International Airport on Tuesday evening to welcome the Sables, who won the Rugby Africa Cup on Saturday in Uganda.\n\nThe Africa Cup trophy came with a ticket to the 2027 Rugby World Cup for the Sables, who ended a 34-year wait.\n\nZimbabwe last played at a Rugby World Cup in 199, and Saturdays victory is a milestone achievement for the current crop of players who managed to defend the prestigious trophy, which they also won last year.\n\nPresent at the airport were several government officials, including Deputy Minister of Sports Emily Jesaya.\n\nZimbabwe staged a spirited campaign at the Rugby Africa Cup, which saw them ending the tournament unbeaten, in the process denting Namibias consecutive World Cup qualification since 1998.\n\nSpeaking upon arrival, Sables coach Piet Benada said, It feels amazing, I think its a testament to my assistants and the boys and all the support that we had behind the scenes.\n\nYou come with a vision, but if people dont buy in, then nothing happens.\n\nSo I thank everybody. I thank my support staff and most of all the players and their families who supported them through this journey.\n\nSince his appointment last year in March, Benade has remained unbeaten in all the matches he has played.\n\nHe added that he is now looking forward to the challenge that is ahead.\n\nIts a challenge to take on. Its one of the worlds best, and were excited about that challenge.\n\nSo it might be difficult at the start, I dont think we can expect things to just continue as they are.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22190821/sables-airport.jpeg",
            "description": "<p>By Sports Reporter Hundreds of rugby fans thronged Robert Mugabe International Airport on Tuesday evening to welcome the Sables, who won the Rugby Africa Cup on Saturday in Uganda. The Africa Cup trophy came with a ticket to the 2027 Rugby World Cup for the Sables, who ended a 34-year wait. Zimbabwe last played at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-return-to-heros-welcome-after-rugby-africa-cup-victory/\">Sables return to hero’s welcome after Rugby Africa Cup victory</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Kadewere joins Greek side Aris Thessaloniki",
            "url": "https://www.newzimbabwe.com/kadewere-joins-greek-side-aris-thessaloniki/",
            "content": "By Sports Reporter\n\nWarriors forward Tino Kadewere has joined Aris Thessaloniki in Greece after parting ways with French Ligue 1 side Nantes.\n\nKadewere has signed a two-year contract with the Greek side.\n\nThe 29-year-old forward is one of the 14 players who were released by Nantes during the ongoing off-season transfer window period.\n\nKadewere had initially joined Nantes in January from fellow French Ligue 1 side Olympique Lyonnais.\n\nThe former Harare City player becomes the second Zimbabwean to play for Aris Thesaloniki, the first one being Warriors legend Kennedy Nagoli.\n\nAris Thessaloniki finished fifth last season in the Greek top-flight league and will compete in the UEFA Conference League this coming season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22134217/WhatsApp-Image-2025-07-22-at-12.03.55.jpeg",
            "description": "<p>By Sports Reporter Warriors forward Tino Kadewere has joined Aris Thessaloniki in Greece after parting ways with French Ligue 1 side Nantes. Kadewere has signed a two-year contract with the Greek side. The 29-year-old forward is one of the 14 players who were released by Nantes during the ongoing off-season transfer window period. Kadewere had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-joins-greek-side-aris-thessaloniki/\">Kadewere joins Greek side Aris Thessaloniki</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "In Pictures: At least 17 killed in Seke Road accident",
            "url": "https://www.newzimbabwe.com/in-pictures-at-least-17-killed-in-seke-road-accident/",
            "content": "AT LEAST 17 people were killed in an accident which occurred along Seke Road on Tuesday morning when a haulage truck collided with a commuter omnibus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133056/1000794251-scaled.jpg",
            "description": "<p>AT LEAST 17 people were killed in an accident which occurred along Seke Road on  Tuesday morning when a haulage truck collided with a commuter omnibus. Below are some images from the accident scene. Pictures by Tapiwa Svondo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-at-least-17-killed-in-seke-road-accident/\">In Pictures: At least 17 killed in Seke Road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Brendan Taylor set to return to face NewZealand after three-year ban",
            "url": "https://www.newzimbabwe.com/brendan-taylor-set-to-return-to-face-newzealand-after-three-year-ban/",
            "content": "NZ Herald\n\nFormer Zimbabwe cricket captain Brendan Taylor is set to face the Black Caps just days after his three-and-a-half-year ban from cricket is lifted, according to reports.\n\nTaylor was handed the ban in 2022 for breaching the ICCs anti-corruption code after he admitted to taking money from match-fixers in India  but claimed he never fixed or manipulated games.\n\nHis ban officially expires on Saturday, after which he will be named in the Zimbabwe test squad to face the Black Caps, with the first test beginning on July 30, Cricinfo reports.\n\nThe 39-year-old has previously played 34 tests including leading Zimbabwe to a close defeat to the Black Caps in 2011, in which he scored a century in the fourth innings before the home side fell 34 runs short of victory.\n\nTaylor admitted he took money from match-fixers who tried to blackmail him into manipulating international games with a secret video of him using cocaine on a visit to India in 2019.\n\nEven though he took US$15,000 ($25,000) from the fixers, Taylor said he never fixed or manipulated games.\n\nTaylor said he was invited to India to discuss a sponsorship opportunity in October 2019. At a dinner with businessmen, he was offered cocaine and foolishly took the bait.\n\nThe following morning, the same men entered my hotel room to show me a video taken of me the night before doing cocaine and told me that if I did not partake in spot fixing at international matches, the video would be released to the public, Taylor said.\n\nTaylor said he took the US$15,000 from the men, who said it was now a deposit for him to fix and they promised him another US$20,000 ($33,500) once the fixing job was complete.\n\nTaylor took four months to report the incident to the ICC and accepted that was against crickets anti-corruption rules.\n\nThe Black Caps and Zimbabwe will play a two-test series with both matches taking place in Bulawayo.\n\nZimbabwe have already named a 16-man squad which includes four changes following a 2-0 series defeat to South Africa last month, with Ben Curran, Sikandar Raza, Roy Kaia and Tanunurwa Makoni joining the side. Cricinfo reports Taylor is expected to be added to the squad.\n\nTaylor told Cricinfo in March that he has been using facilities at an elite independent school in Harare, preparing for his return.\n\nI still want to play and I believe I could make an impact as a player, he said.\n\nI look at where Im at physically and mentally and if I didnt feel I could do it, I wouldnt bother. Givemore [Makoni, managing director of Zimbabwe Cricket] has really supported me on this. He sort of shut down the coaching role for now and said, Can you play and try to push yourself up until the 2027 World Cup? Granted Ill be 41 then but with sobriety, Im living my truest form.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/16073556/brendan-taylor-e1581839069251.jpg",
            "description": "<p>NZ Herald Former Zimbabwe cricket captain Brendan Taylor is set to face the Black Caps just days after his three-and-a-half-year ban from cricket is lifted, according to reports. Taylor was handed the ban in 2022 for breaching the ICC’s anti-corruption code after he admitted to taking money from match-fixers in India – but claimed he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-taylor-set-to-return-to-face-newzealand-after-three-year-ban/\">Brendan Taylor set to return to face NewZealand after three-year ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Sables coach proves critics wrong after making World Cup qualification history",
            "url": "https://www.newzimbabwe.com/sables-coach-proves-critics-wrong-after-making-world-cup-qualification-history/",
            "content": "By Sports Reporter\n\nWhen Piet Benade was appointed head coach to lead the Sables in March last year, not many gave him a chance.\n\nThe 43-year-old gaffer was heavily criticised with many doubting his pedigree, including former rugby administrator Themba Mliswa.\n\nIm very disappointed how we still seem insecure to trust our own local coaches to lead the national team.\n\nWho is this guy, and what level has he been coaching? We keep importing mediocre coaches who cant measure up to the requisite level, wrote Mliswa after Benades appointment.\n\nTo prove his critics wrong, Benade guided Zimbabwe to win the 2024 Rugby Africa Cup, a historical achievement.\n\nThe former Old Hararians gaffer on Saturday led Zimbabwe to defend the title, becoming the first Zimbabwean coach to win the Rugby Africa Cup trophy back-to-back.\n\nSo important was the victory that it came with a 2027 Rugby World Cup qualification ticket.\n\nThe true magnitude of what has been achieved has not yet set in, to be honest.\n\nWe are obviously very proud of our group for the work that was put in and very happy that the vision we set out 18 months ago has become a reality, Sables coach Piet Benade told New Zimbabwe.com.\n\nZimbabwe last featured at a rugby World Cup in 1991, and Benades recent success saw him end the nations 34-year wait.\n\nThe 43-year-old gaffer has, however, hinted that the greater challenge of preparing for the World Cup is now his focus.\n\nWe knew we had to go out and do something special to change what has happened for 30 years.\n\nWe hope that this will inspire and give the belief that Zimbabweans can be excellent.\n\nThe next step is obviously very daunting, but we are excited by the challenge of what is to come, he added.\n\nZimbabwe Sables are expected to arrive in the country on Tuesday evening at Robert Mugabe International Airport in Harare.\n\nThe Zimbabwe Rugby Union supporter union is set to give the team a heros welcome.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22104131/piet-benade.jpg",
            "description": "<p>By Sports Reporter When Piet Benade was appointed head coach to lead the Sables in March last year, not many gave him a chance. The 43-year-old gaffer was heavily criticised with many doubting his pedigree, including former rugby administrator Themba Mliswa. “I’m very disappointed how we still seem insecure to trust our own local coaches</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-coach-proves-critics-wrong-after-making-world-cup-qualification-history/\">Sables coach proves critics wrong after making World Cup qualification history</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Pastor escapes 20 year jail term; court hears rape was reported 12 years later",
            "url": "https://www.newzimbabwe.com/pastor-escapes-20-year-jail-term-court-hears-rape-was-reported-12-years-later/",
            "content": "By Mary Taruvinga\n\nA Harare pastor has been spared from serving a 20-year jail term after the High Court quashed his conviction and sentence, having found that the lower court erred in finding him guilty.\n\nJeane Pierre Dusabe was jailed by a Harare magistrate for allegedly raping and indecently assaulting a minor girl he took custody of after her parents divorced back in 2014.\n\nThe rape only emerged ten years later, when the girl got married, with a formal report being made later in 2023.\n\nThe court heard, Dusabe was aged 39 while the girl was aged 12 years when the offence was allegedly committed.\n\nThe allegations in count one were that the appellant indecently assaulted the complainant once at a house in Harare.\n\nOn the second count, it was alleged that on dates unknown to the prosecutor between the years 2014 and 2022 and at different places in Harare and Masvingo, the appellant hadsexual intercourse with the complainant without her consent on several occasions.\n\nDusabe was charged with one count of rape and another of indecent assault.\n\nThe complainantstestimony was that sometime in 2014 Dusabe touched her private parts when her aunt was away on a trip to South Africa.\n\nShe was having swimming lessons conducted by Dusabe in a pool at her home in Mandara, together with her sister, who was also a minor.\n\nOn the same day, around midnight, the appellant came into the room, got into the blankets, and got on top of her.\n\nShe awoke to find the appellant on top of her before he raped her while covering her mouth.\n\nShe said after this incident, the appellant had sexual intercourse with her without her consent several times at different homes they stayed in.\n\nShe also said sometime in 2015 on unknown dates and in Hateld, the appellant would occasionally transport her to and from school using his commuter omnibus. It is alleged that during these times, the appellant would take advantage of the complainant and have sexual intercourse with her without her consent at a bushy area in Arlington.\n\nThe complainant also told the court a quo that sometime in March 2022, on an unknown date, she fell sick and sought the appellants help.\n\nShe said Dusabe suggested to her that they go to Masvingo to a doctor whom he knew who could treat her.\n\nWhilst there, Dusabe had sexual intercourse with her four times without her consent, after his relatives, whom they had found at his house, had left for Harare.\n\nThe alleged rape only surfaced after her husband confronted her over her virginity when they got married.\n\nShe told her that Dusabe had raped her several times.\n\nThe husband then told church members in 2022 but a formal report was made two years later.\n\nThe trial court found Dusabe guilty of rape and indecent assault before sentencing him to 20 years imprisonment.\n\nAggrieved, he mounted the present application, complaining that the lower court erred in convicting him when there was no evidence linking him to the alleged crimes.\n\nDusabe proved that his wife never visited South Africa in 2014 by producing her passport.\n\nThree relatives testified that Dusabe never resided at a house with a functional swimming pool.\n\nHis lawyer said the lower court was wrong in finding that the delay in reporting the rape was reasonable when one considers the manner in which the offence surfaced and material discrepancies in the evidence of the complainant.\n\nHe also said the alleged rape in Masvingo took place when the complainant was already married and that she failed to disclose it, then was therefore unreasonable.\n\nHigh Court judge Justice Christopher Dube Banda upheld Dusabes appeal, ruling that the report of rape does not meet the requirements for admissibility.\n\nThe trial court erred in failing to make findings on material aspects of the case.\n\nThe delay in reporting the alleged rape and indecent assault and the circumstances under which the disclosure was made render the complaint doubtful and unreasonable.\n\nConsequently, the State evidence led is not reliable and safe to convict on.\n\nThe appellants story is convincing.\n\nThe State failed to prove its case beyond a reasonable doubt.\n\nThe evidence that was placed before the court did not meet the required threshold when regard is had to the evidence of the State witnesses.\n\nOn that basis, this court is obliged to interfere with the findings of the trial court.\n\nThe evidence being unreliable, it was unsafe to convict the appellant on its basis.\n\nAccordingly, the court finds that the States concession was properly made. The appeal succeeds. As a result, it is ordered that the appeal against both conviction and sentence is upheld.\n\nThe court a quos conviction and sentence be and is hereby set aside and in its place is substituted the following; The accused is found not guilty and acquitted, the judge ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A Harare pastor has been spared from serving a 20-year jail term after the High Court quashed his conviction and sentence, having found that the lower court erred in finding him guilty. Jeane Pierre Dusabe was jailed by a Harare magistrate for allegedly raping and indecently assaulting a minor girl he took</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-escapes-20-year-jail-term-court-hears-rape-was-reported-12-years-later/\">Pastor escapes 20 year jail term; court hears rape was reported 12 years later</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "OK Zimbabwe greenlights immovable properties disposal",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-greenlights-immovable-properties-disposal/",
            "content": "By Alois Vinga\n\nListed retailer, OK Zimbabwes shareholders have approved the disposal of immovable properties and other measures to shore up working capital.\n\nLast month, the retail giant disclosed that it was in discussions to secure funding, primarily to clear a debt of US$30 million, of which US$24 million is owed to suppliers.\n\nResults of the Extraordinary General Meeting held on July 17 2025, show that shareholders approved the proposal to dispose of the groups immovable properties.\n\nPursuant to the provisions of Article 91 of the Companys Articles of Association and other applicable provisions of the Companies and Other Business Entities Act (Chapter 24:31) and the Zimbabwe Stock Exchange Listing Requirements (SI 134/19), the approval of the Shareholders be and is hereby accorded for the Directors of the Company to raise approximately US$10,5 million, the statement said.\n\nThe amount will be realised by disposing of all or some of the several immovable properties owned by the Company. These include Stand 19676 Harare Township of Salisbury Township Lands, Liberation Legacy Way, Borrowdale, Harare (vacant commercial stand), Stand 14997 Salisbury Township, Birmingham Road, Workington, Harare, OK Mbuya Nehanda Street, among others.\n\nFollowing the shareholders approval, the directors are empowered to identify and negotiate with potential buyers, finalise the terms and conditions of the sale, ensuring compliance with all applicable laws and regulations in Zimbabwe.\n\nThe disposals can be made to related parties, provided any such disposals shall be at arms length and for best value.\n\nThe Directors may execute all necessary agreements, deeds, and documents to effect the disposals in a manner that maximises value for shareholders and aligns with the strategic objectives of the Company.\n\nThe Directors shall report back to Shareholders in the next Annual Report of the Company on completion of the disposals and provide a summary of the terms of the disposals, said the company.\n\nThe shareholders also approved the proposal to increase the authorised share capital of the Company from two billion (2,000,000,000) ordinary shares of ZWL0.0001 (zero comma zero zero zero one Zimbabwe Gold) nominal value each, to six billion (6,000,000,000) each ranking pari passu in every respect with existing ordinary shares of the company.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>By Alois Vinga Listed retailer, OK Zimbabwe’s shareholders have approved the disposal of immovable properties and other measures to shore up working capital. Last month, the retail giant disclosed that it was in discussions to secure funding, primarily to clear a debt of US$30 million, of which US$24 million is owed to suppliers. Results of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-greenlights-immovable-properties-disposal/\">OK Zimbabwe greenlights immovable properties disposal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "VP Chiwenga distances self from Tagwirei’s “pseudo-event”",
            "url": "https://www.newzimbabwe.com/vp-chiwenga-distances-self-from-tagwireis-pseudo-event/",
            "content": "By Darlington Gatsi\n\nDEPUTY President Constantino Chiwenga has distanced himself from an event allegedly organised by allies of President Emmerson Mnangagwa, exposing deepening fissures within the ruling ZANU-PF party.\n\nOn the events flyer shared on social media platforms, Chiwenga is listed as the guest of honour with controversial businessmen Kudakwashe Tagwirei and Paul Tungwarara headlining.\n\nThe event dubbed Matebeland Business Dinner features a speakers panel with several cabinet ministers.\n\nHowever, Chiwengas office has denied any involvement, calling the event fraudulent and a violation of government protocol.\n\nIt has come to the attention of Honourable Vice President Gen. (Retd) Dr. C. G. D. N. Chiwengas office that a group of persons have been flighting Advertisements on social media purporting to announce a Business Dinner dubbed Matabeleland Business Dinner at which the Vice President is touted as Guest of Honour.\n\nThe office of the Vice President categorically disassociates itself from the event which has nothing to do with Government, blatantly violates Government protocol, and goes against our organisational norms, read the statement.\n\nTagwirei and Tungwarara are part of a clique of businessmen reportedly referred to by Chiwenga as zvigananda, a derogatory term for individuals accused of amassing wealth through opaque deals and political patronage.\n\nThis also comes as Chiwenga reportedly moved against the co-option of Tagwirei into the ZANU PF Central Committee, recently delaying the businessmans adoption into the powerful organ of the party.\n\nTagwirei has reportedly been eyeing to replace Mnangagwa as the leader of ZANU PF when his constitutionally limited two terms expire. However, the business mogul has since denied harbouring this ambition.\n\nChiwengas statement further condemned the dinner as an extortion scheme.\n\nThe Vice President takes great exception to being associated with such a fraudulent pseudo-event designed to extort the unsuspecting public through false association with him and other figures of Government, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/29170900/Chiwenga.jpeg",
            "description": "<p>By Darlington Gatsi DEPUTY President Constantino Chiwenga has distanced himself from an event allegedly organised by allies of President Emmerson Mnangagwa, exposing deepening fissures within the ruling ZANU-PF party. On the event’s flyer shared on social media platforms, Chiwenga is listed as the guest of honour with controversial businessmen Kudakwashe Tagwirei and Paul Tungwarara headlining.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vp-chiwenga-distances-self-from-tagwireis-pseudo-event/\">VP Chiwenga distances self from Tagwirei’s “pseudo-event”  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:10",
            "date": "22 Jul 2025"
        }
    ]
}