{
    "news": [
        {
            "title": "Defending Champions Kenya in Zim for Barthes Trophy",
            "url": "https://www.newzimbabwe.com/defending-champions-kenya-in-zim-for-barthes-trophy/",
            "content": "By Sport Reporter\n\nKenya, the Defending champions of the Rugby Africa Barthes Under 20 Trophy, have arrived in Zimbabwe for this years edition.\n\nKenya landed at Robert Mugabe International airport on Thursday, ahead of the tournament, which kicks off Saturday.\n\nZimbabwe is hosting the prestigious mens under 20 rugby tournament for the second time after hosting it again last year.\n\nA total of four nations will be battling for honours at this years edition Kenya, Namibia, Tunisia and hosts Zimbabwe.\n\nThis years edition will see all the games being played at Old Hararians, a shift from the traditional international rugby venue, Harare Sports Club.\n\nKenya won the tournament last year after beating Zimbabwes Junior Sables 28-13 in the final.\n\nThe Junior Sables will be hoping to reclaim their title, which they won in 2022 and again in 2023, before last years disappointing home defeat.\n\nKenya and Tunisia will open the tournament on Saturday at midday, before a late afternoon kick-off between hosts Zimbabwe and Namibia.\n\nThe tournament will then continue on Wednesday when Zimbabwe plays Tunisia while Kenya faces off with Namibia, before the tournament ends on Sunday April 27, with a highly anticipated clash between Zimbabwe and Kenya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18071413/kenya-barthes.jpeg",
            "description": "<p>By Sport Reporter Kenya, the Defending champions of the Rugby Africa Barthes Under 20 Trophy, have arrived in Zimbabwe for this year’s edition. Kenya landed at Robert Mugabe International airport on Thursday, ahead of the tournament, which kicks off Saturday. Zimbabwe is hosting the prestigious men’s under 20 rugby tournament for the second time after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defending-champions-kenya-in-zim-for-barthes-trophy/\">Defending Champions Kenya in Zim for Barthes Trophy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Scottland FC Under 21 in South Africa for Pirates Cup",
            "url": "https://www.newzimbabwe.com/scottland-fc-under-21-in-south-africa-for-pirates-cup/",
            "content": "By Sport Reporter\n\nScottland FC under 21 team is in South Africa for the Pirates Cup which kicks off Friday.\n\nThe annual tournament has a total of 56 junior clubs participating: 16 ladiesteamsand 44 male sides.\n\nScottland was drawn in the same pool with Limpopo School of Excellence, Galeshwe Stars FC, SOL Platjie University FC.\n\nThe mens champions at the tournament will walk away with R100,000, an increase from last years R80,000, whilst the winners in the ladies side walk away with R50,000, that is R10,000 more than last years stake.\n\nPirates Cup started in 2016 and has, over the years developed into the most popular junior football tournament in the Southern African region.\n\nPirates Cup Winners Since Formation\n\n2016 Orlando Pirates\n\n2017 Orlando Pirates\n\n2018 Orlando Pirates\n\n2019 SuperSport United Orlando Pirates\n\n2020 cancelled due to COVID-19 pandemic\n\n2022 Ambassadors FC\n\n2023 Stars of Africa Football Academy\n\n2024 University of Johannesburg FC\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18070757/scottland-under-21.jpeg",
            "description": "<p>By Sport Reporter Scottland FC under 21 team is in South Africa for the Pirates Cup which kicks off Friday. The annual tournament has a total of 56 junior clubs participating: 16 ladies’ teams and 44 male sides. Scottland was drawn in the same pool with Limpopo School of Excellence, Galeshwe Stars FC, SOL Platjie University FC.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-fc-under-21-in-south-africa-for-pirates-cup/\">Scottland FC Under 21 in South Africa for Pirates Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Another Wolves player commits to Warriors",
            "url": "https://www.newzimbabwe.com/another-wolves-player-commits-to-warriors/",
            "content": "By Sport Reporter\n\nWolverhampton Wanderers winger Ethan Sutherland has committed to play for the Warriors after an engagement with ZIFA Global and Diaspora chair Marshall Gore.\n\nSutherland (18) previously featured for Scotland under-19 before the switch, which was confirmed on Thursday.\n\nWe are delighted to share that Wolves winger Ethan Sutherland has officially committed to playing for Zimbabwe.\n\nHe began his Zimbabwean passport application process at the Zimbabwe Embassy in the UK this week, announced Gore.\n\nSutherlands move follows the new ZIFA executives mandate to lure foreign-born Warriors prospects who are playing professional football in Europe.\n\nAs part of the process, Warriors coach Michael Nees and ZIFA president Nqobile Magwizi will next week meet with Zimbabwean youth footballers based in the UK.\n\nThe initiative Roots & Dreams: A Conversation with ZIFA is supported byDiaspora Insuranceand other companies and will start in London on April 23 before moving to Birmingham on April 24.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18064548/ethan-sutherland.jpeg",
            "description": "<p>By Sport Reporter Wolverhampton Wanderers winger Ethan Sutherland has committed to play for the Warriors after an engagement with ZIFA Global and Diaspora chair Marshall Gore. Sutherland (18) previously featured for Scotland under-19 before the switch, which was confirmed on Thursday. “We are delighted to share that Wolves winger Ethan Sutherland has officially committed to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-wolves-player-commits-to-warriors/\">Another Wolves player commits to Warriors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "School head forced to reverse dismissal of pupil over unpaid BEAM funds",
            "url": "https://www.newzimbabwe.com/school-head-forced-to-reverse-dismissal-of-pupil-over-unpaid-beam-funds/",
            "content": "By Staff Reporter\n\nAuthorities at Sherenje Primary School in Headlands, who dismissed an underprivileged student from school for failing to pay fees, have been forced to reverse their decision following the intervention of rights lawyers.\n\nThe student whosetuition is paid by government under the state-funded Basic Education Assistance Module (BEAM) was stopped from going to school after her guardian failed to pay the required US$30.\n\nThis was despite the fact that her circumstances were known.\n\nThis saw the 10-year-old student missing out on attending her Grade 4 lessons as her legal guardian could not afford to pay tuition fees amounting to US$30.\n\nAs a result, the students guardian enlisted the services of human rights lawyers Tatenda Sigauke and Peggy Tavagadza of Zimbabwe Lawyers for Human Rights, who wrote a letter of demand to the school head at Sherenje Primary School demanding that her right to education be respected through allowing her within a period of 24 hours to attend lessons and access basic education, failure of which they would institute legal proceedings against the school authorities, said the lawyers.\n\nIn their letter, Sigauke and Tavagadza advised and reminded the school authorities about the provisions of the Education (General) Regulations of 2025, which were promulgated through Statutory Instrument 13 of 2025 by Primary and Secondary Education MinisterTorerai Moyo, which provide that every child of school going age shall be afforded equal opportunity to access to education and that basic education is compulsory and if the parents of the pupil cannot afford paying the school fees at a government-run school, the state should assist.\n\nIn addition, Sigauke and Tavagadza said that since the Constitution guarantees the right to education, exclusion of a child from school for non-payment of fees is a direct infringement on the right to education and would reverse the progressive elaboration of the Bill of Rights and the Education Regulations.\n\nThe human rights lawyers warned the school authorities not to use undue pressure to enforce payment of tuition fees by using the pupil as a pawn, as this is unlawful.\n\nEventually, the school immediately allowed the 10-year-old student to attend lessons while the issue of payment of school fees was being sorted out.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/21182408/School-Kids.png",
            "description": "<p>By Staff Reporter Authorities at Sherenje Primary School in Headlands, who dismissed an underprivileged student from school for failing to pay fees, have been forced to reverse their decision following the intervention of rights lawyers. The student whose tuition is paid by government under the state-funded Basic Education Assistance Module (BEAM) was stopped from going to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/school-head-forced-to-reverse-dismissal-of-pupil-over-unpaid-beam-funds/\">School head forced to reverse dismissal of pupil over unpaid BEAM funds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Six killed in road traffic accident",
            "url": "https://www.newzimbabwe.com/six-killed-in-road-traffic-accident/",
            "content": "By Staff Reporter\n\nSIX people were killed in a road traffic accident on Thursday just outside Karoi, Mashonaland West province.\n\nThe crash, which occurred near Magunje turnoff along the Harare-Chirundu highway, involved a van and a haulage truck.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy.\n\nZRP confirms a fatal road traffic accident, which occurred on April 17, 2025 at around 1130 hours at the 214 km peg along Harare-Chirundu Road in which six people were killed.\n\nA haulage truck with no passengers on board was involved in a head-on collision with a Nissan NV 150 vehicle with five passengers on board, said Nyathi.\n\nThe bodies of the victims were taken to Karoi Hospital mortuary for post-mortem.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18062359/IMG-20250417-WA0074.jpg",
            "description": "<p>By Staff Reporter SIX people were killed in a road traffic accident on Thursday just outside Karoi, Mashonaland West province. The crash, which occurred near Magunje turnoff along the Harare-Chirundu highway, involved a van and a haulage truck. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy. “ZRP confirms a fatal road</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/six-killed-in-road-traffic-accident/\">Six killed in road traffic accident </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Churches say ‘civic restrictions’ in Zimbabwe threaten freedom",
            "url": "https://www.newzimbabwe.com/churches-say-civic-restrictions-in-zimbabwe-threaten-freedom/",
            "content": "TheTablet\n\nIn recent months, journalists and members of the public opposed to the government have been imprisoned on charges of undermining the president and threatening the rule of law.\n\nThe Zimbabwe Council of Churches (ZCC) warned that what they called a restrictive civic environment that is threatening fundamental rights.\n\nIn a statement dated 13 April, issued to coincide with Holy Week and Independence Day commemorations on 18 April, they addressed the countrys increasing economic hardship and what activists say are deteriorating human rights.\n\nIn recent months, journalists and members of the public opposed to the ruling Zimbabwe African National Union (Patriotic Front), ZANU-PF, have been thrown into prison on charges of undermining the president and threatening the rule of law. Human rights and pro-democracy activists say these arrests reveal a disturbing trend of human rights abuses.\n\nThe ZCC says these developments go against the spirit of the countrys constitution and appealed to the country to renew its commitment to peace, social justice and human rights for all citizens.\n\nA restrictive civic environment continues to threaten fundamental freedoms, compounding the sufferings caused by a harsh economy and acts of repression, the Churches said in their statement.\n\nWe call upon our leaders to prioritise the needs of the people to cultivate an environment where every voice is heard and to uphold the rule of law, it continued.\n\nThese concerns have intensified amid growing hostilities within ZANU-PF. Disaffected members of the ruling party called on the population to take to the streets to voice their discontent with the government, which has responded by deploying security forces across the country. No mass protests took place.\n\nAs a Church, we affirm that we offer solidarity to the people of Zimbabwe, the nationalists and liberation fighters, and given todays realities, the Church affirms its unfaltering resolve to stand with the ordinary people, the ZCC statement said.\n\nThe council also renewed its appeal for the revision of what it called repressive laws which restrict the ability of Zimbabweans to organise and express their views.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18054445/police-march.jpg",
            "description": "<p>TheTablet In recent months, journalists and members of the public opposed to the government have been imprisoned on charges of undermining the president and threatening the rule of law. The Zimbabwe Council of Churches (ZCC) warned that what they called a restrictive civic environment that is threatening fundamental rights. In a statement dated 13 April,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/churches-say-civic-restrictions-in-zimbabwe-threaten-freedom/\">Churches say ‘civic restrictions’ in Zimbabwe threaten freedom</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Is Zimbabwe wooing Donald Trump by paying white farmers and ending tariffs?",
            "url": "https://www.newzimbabwe.com/is-zimbabwe-wooing-donald-trump-by-paying-white-farmers-and-ending-tariffs/",
            "content": "Al Jazeera\n\nLong-frozen relations between the United States and Zimbabwe may be thawing after the Southern African nation slashed all taxes on US goods flowing into the country and announced it has begun to pay compensation to white farmers who lost land during controversial, sometimes violentland expropriation reformsthat were instituted 25 years ago\n\nThe moves come amid a wave of sweepingtariffsimposed on countries around the world by US President Donald Trump, and as other countries scramble to renegotiate with Washington.\n\nAlongside his stated aim of reducing trading deficits with the USs trading partners, Trump has repeatedly claimed that white farmers in Southern Africa are discriminated against. Both he and his adviser, South African-born Tesla billionaire Elon Musk, have criticised the treatment of white minorities in South Africa, alleging that they face discrimination. Zimbabwe and South Africa have white minority populations who are mainly descendants of British settlers.\n\nMeanwhile, Zimbabwe has been in the throes ofeconomiccollapse for more than two decades. Over that time, hyperinflation has weakened the economy, killed jobs, and seen the introduction of several legal tenders, from the US dollar to thenew gold-backed ZiG.\n\nSo, might Zimbabwe be trying to please the US and woo President Trump in the hope of economic gains? And could that work? Heres what we know:\n\nPresident Trumps April 2Liberation Daytariff announcements saw dozens of countries hit with varying surcharges on goods imported to the US, including Zimbabwe, which was hit with an 18 percent levy on all products it exports there.\n\nTariffs levied on African nations by President Trump vary. Neighbouring Lesotho has been hit with the highest tax of any African nation at 50 percent, and is currently seeking to renegotiate with the White House.\n\nZimbabwe mostly exports steel components, tobacco and sugar to the US while the US exports machinery, pharmaceuticals and agricultural produce to the Zimbabwean market.\n\nTrade between the two countries is limited, reaching a total of about $111.6m in 2024. US exports to Zimbabwe amounted to $43.8m, while imports from Zimbabwe were $67.8m. The trade deficit in favour of Zimbabwe was, therefore, just over $24m, according toUS government data.\n\nCountries around the world have been scrambling to negotiate a reduction in tariffs with Washington. On April 9, the White Houseplaced a 90-day pauseon the reciprocal tax hikes to allow time for country representatives to strike deals and because most countries had not retaliated, Trump said. The only exception is China, which has opted to go head-to-head by reciprocating and increasing taxes on US imports into the country to 125 percent and will not benefit from the pause.\n\nZimbabwe has taken an entirely different approach. In a post on X on April 5, Zimbabwes President Emmerson Mnangagwa announced that all taxes on US imports would be scrapped in order to build a positive relationship with Washington.\n\nThe move is intended to facilitate the expansion of American imports within the Zimbabwean market, while simultaneously promoting the growth of Zimbabwean exports destined for the United States, the Zimbabwean president said.\n\nZimbabwe is the first country to suspend tariffs on US goods in response to Trumps tariffs announcement. Until now, most goods entering the country have been subject to a 15 percent levy.\n\nIts unlikely, experts say. South Africa-based economist Eddie Mahembe from business consultancy Underhill Corporate Solutions,said Zimbabwe cannot afford not to tax US imports and the move could worsen the countrys already frail economy.\n\nItll mean that US goods will flood Zimbabwe, and then it will kill the economy more, Mahembe told Al Jazeera. Local competitors, already affected by hyperinflation and cheap goods coming in from China, are likely to suffer more, he added. Zimbabwe could see less production, more unemployment and even lower revenues from levies, he said.\n\nWhat they did was not necessary, at all, Mahemmbe added, referring to the Zimbabwean government.\n\nExperts also say the move could cause tension with Zimbabwes biggest trading partners  South Africa, China and the United Arab Emirates, who might question why they should still pay tariffs on their goods entering Zimbabwe, when the US does not have to. This move could sour Zimbabwes relationships with partners, policy analysts Craig Moffat and EM Hoza wrote in an opinion piece for the South African newspaper, The Mail and Guardian.\n\nThese countries might demand similar tariff exemptions or seek to renegotiate trade terms  Zimbabwes actions could be perceived as undermining the principles of fair, non-discriminatory trade.\n\nOn April 10, Zimbabwean Finance Minister Mthuli Ncube told reporters the government had approved a disbursement of $3.1m in compensation to be shared by white farmers displaced from nearly 400 farms seized by the government in 2000 after then-President Robert Mugabe signed a controversial land expropriation programme. This is the first in a series of planned compensation payments.\n\nThe Zimbabwean government did not explicitly state that the recent payments were prompted by President Trumps tariffs announcement and negotiations.\n\nMugabes land programme was supposed to redistribute land to disadvantaged Black Zimbabweans with the aim of boosting equity and agricultural development. Land was seized from some 4,000 white farmers, sometimes forcefully and violently between 2000 and 2001, and at least seven farmers were killed.\n\nUntil that point, minority white people, who made up about 4 percent of the population, owned more than half the land in Zimbabwe, while locals were crowded into native reserves.\n\nHowever, the policyfailed to achieve its aimand contributed to the weakening of the Zimbabwean economy. Rather than resettle peasants, the political elite including Mugabes family, acquired large swaths of land for rent. Farming output dropped significantly, causing food supply chains to dry up. Zimbabwe was also sanctioned by several Western countries, including the US, for the move.\n\nIn 2020, after two decades of crippling sanctions, thegovernment agreedto pay white farmers $3.5bn for infrastructure such as wells, irrigation equipment and buildings on seized land. Only 1 percent was to be paid in cash, with the balance to be settled with treasury bonds. According to Finance Minister Ncube, the government has now issued treasury bonds for the first batch of farmers.\n\nThe payments have caused controversy in the country, with some Black Zimbabweans questioning why public money is being used to compensate the farmers, rather than being paid directly by those who benefitted from the policy.\n\nZimbabwean politics are currently dominated by a power struggle within the ruling ZANU-PF party.\n\nZimbabwean President Emmerson Mnangagwa, who came to power in 2017 on promises of democratic and economic reforms, isfacing pressureto step down from within his party after his current, second term. ZANU-PF has dominated government since the countrys independence in 1980.\n\nA succession battle has erupted ahead of the general elections scheduled for 2028. Factions have emerged: one supporting a prolonged, unconstitutional third term for Mnangagwa, 82, so that he can continue with his reforms, and another supporting the ascendancy of Constantino Chiwenga, his 68-year-old vice president.\n\nExperts say the government hopes its recent decision to cancel tariffs on US goods may lead to a lifting of sanctions by countries like the US and other potential international lenders. That could provide some respite for Zimbabwe after years of economic decline.\n\nHowever, economist Mahembe said the tariff move was more likely to ingratiate a small, political elite with the US and other markets, to enable those few to benefit from lucrative mineral sales.\n\nIn March 2024, First Lady Auxillia Mnangagwa, alongside her husband and several other government officials,was sanctioned by the United Statesfor alleged involvement in illicit diamond and gold networks.\n\nEarlier, in 2023, an Al Jazeera investigation revealed that Zimbabwean officials were usingsmuggling gangsto sell the countrys gold to soften the impact of sanctions.\n\nIts not just about the country, its also really more about them, Mahembe said, referring to the countrys political elite.\n\nIts unclear if President Mnangagwa can achieve his stated goal of building a better, positive relationship with Washington.\n\nRegarding compensating white farmers, it is unclear whether the recent move to make the first compensation payments is designed to please Trump.\n\nFurthermore, some problems concerning the payments have emerged. A group of affected farmers accused the government on Wednesday of over-stating the amounts being paid and said the amount being paid now is too low.\n\nIn a statement, Deon Theron, acting chairman of the Compensation Steering Committee set up to represent farmers, also said officials in Harare had not properly consulted the majority of the farmers in the compensation process.\n\nIn reality, only a small token payment has been made and thousands of farmers, the significant majority by number, remain uncompensated, Theron said.\n\nThe $3.5bn agreed to was already a substantial discount on the actual value of the properties, and these payments have reached fewer than 10 percent of farmers, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>Al Jazeera Long-frozen relations between the United States and Zimbabwe may be thawing after the Southern African nation slashed all taxes on US goods flowing into the country and announced it has begun to pay compensation to white farmers who lost land during controversial, sometimes violent land expropriation reforms that were instituted 25 years ago The moves</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/is-zimbabwe-wooing-donald-trump-by-paying-white-farmers-and-ending-tariffs/\">Is Zimbabwe wooing Donald Trump by paying white farmers and ending tariffs?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Keyshia Cole’s South African concert officially cancelled: A dream dashed for R&B fans",
            "url": "https://www.newzimbabwe.com/keyshia-coles-south-african-concert-officially-cancelled-a-dream-dashed-for-rb-fans/",
            "content": "IOL\n\nIn a disappointing turn of events for R&B fans, the eagerly awaited concert,Keyshia Cole  Live in South Africa, has been officially cancelled.\n\nThis announcement comes after a series of scheduling difficulties that have plagued the planning of the event, with Coles team requesting yet another postponement to accommodate her global tour later this year.\n\nCole was initially meant to perform in South Africa in September, however due to unforeseen circumstances it was postponed to January 2025.\n\nThe January date was rescheduled to Aprildue to a devastating fire incident in Los Angeles earlier this year, fans had finally received optimism when a confirmation video was shared byColeherself on social media, declaring the show would go ahead next week.\n\nHowever, amidst further complications, it has now been confirmed that the concert will not take place as planned.\n\nThe concert promoter Glen21 Entertainment issued a heartfelt statement this morning, expressing their disappointment at letting fans down once more. We are incredibly disappointed to let fans down once again, they said.\n\nSouth African fans have shown immense excitement and loyalty, and we were truly looking forward to bringingKeyshia Coleto our shores. Unfortunately, under the current circumstances with a request for yet another postponement, we are unable to continue pursuing a new tour date yet again.\n\nFor those who purchased tickets, the promoter assured that all ticket holders would be contacted directly with detailed information regarding refunds.\n\nAdditionally, the official ticketing platform is set to provide further assistance in the coming days. Fans seeking immediate answers can also reach out via the email addressinfo@ticketpro.co.za.\n\nThe promoter extended their gratitude to fans for their patience and understanding throughout this trying ordeal, and sincerely apologised for the inconvenience caused.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18053022/Keyshia-Cole-is-officially-no-longer-going-to-perform-in-South-Africa-after-two-postponements-Picture-Instagram-keyshiacole.webp",
            "description": "<p>IOL In a disappointing turn of events for R&B fans, the eagerly awaited concert, Keyshia Cole – Live in South Africa, has been officially cancelled. This announcement comes after a series of scheduling difficulties that have plagued the planning of the event, with Cole’s team requesting yet another postponement to accommodate her global tour later this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/keyshia-coles-south-african-concert-officially-cancelled-a-dream-dashed-for-rb-fans/\">Keyshia Cole’s South African concert officially cancelled: A dream dashed for R&B fans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "Vision Group secures clearance to take over Tongaat Hulett’s operations in Zimbabwe",
            "url": "https://www.newzimbabwe.com/vision-group-secures-clearance-to-take-over-tongaat-huletts-operations-in-zimbabwe/",
            "content": "IOL\n\nThe Vision Group announced on Wednesday that it has received competition approvals for acquisition of all Tongaat Huletts assets in Zimbabwe.\n\nUnder the transaction, Ball Foundry has been given the nod by the Competition and Tariff Commission of Zimbabwe to acquire Triangle Sugar Corporation, which holds Tongaat Huletts operations in Zimbabwe.\n\nProsper Ziyadhuma, an official with the Zimbabwe CTC, confirmed this toBusiness Reporton Wednesday.\n\nWe had given them an intended decision as indicated in the notice they provided, Ziyadhuma said.\n\nVision Group, whose principals include Mpumalanga businessman Robert Gumede and Zimbabwean business executive Rutenhuro Moyo, has beneficial ownership in Ball Foundry, which is incorporated in Mauritius.\n\nThe purchase consideration will be settled by way of a set-off against a portion ofthelendergroupclaims.Triangle Sugar is the holding company of Tongaat Hulettsoperations in Zimbabwe, Tongaat Hulett, currently under business rescue, said in December.\n\nWhile the transaction for the disposal of Tongaat Huletts operations in Zimbabwe was signed on December 21, the agreement had been subject to the fulfillment of a number of suspensive conditions, including employee related conditions.\n\nTongaat Hulett also confirmed on Wednesday that the Competition and Tariff Commission of Zimbabwe hasprovided approval for the Alternative Transaction subject to certain employment-relatedconditions.\n\nThese conditions have been duly accepted, rendering the approval effective. Thismarks the final competition authority approval required across all applicable jurisdictions forthe implementation of the alternative transaction, said the company.\n\nTongaat Hulett and the Business Rescue Practitioners continue to work closely with Vision to finalise the implementation of the transaction. This collaborative effort underscores a shared commitment to revitalising Tongaats operations for the benefit of employees, cane growers, suppliers and rural communities.\n\nThe alternativetransactionforms the cornerstone ofthe Tongaat Hulett adoptedbusinessrescueplanandentails the sale ofthe troubled South African agro-processing and sugar manufacturersbusiness and assets including those in Zimbabwe, Botswana and Mozambique among others as a going concern.\n\nThe sale will be finalised in a consolidated group transactionto Vision.\n\nThe transaction includes the sale of Tongaat Huletts South African assets, including its sugar operations and corporate head office, as well as the sale of its shares in and claims against the Zimbabwe, Mozambique, and Botswana businesses.\n\nEarlier this year, theHigh Court in Durban dismissed RGS Group Holdings application seeking to interdict Vision Groups implementation of Tongaat Huletts business rescue plan related to the sale of the agro-processing entitys assets and businesses.\n\nLast year, creditors in Tongaat voted in favour of a business rescue plan put forward by Vision.\n\nThis was after an accounting scandal rocked Tongaat Hulett, with the company tail-spinning into a debt of R8.2 billion and prompting shareholders to adopt an amended business rescue plan, which the companys business rescue practitioners now intend to implement.\n\nTongaat Hulettis envisioned to continue playing critical rolesin the economic fabric of Southern Africa.\n\nIn South Africa, the businessremains a cornerstone of the sugar industry, directly employing 2600 individuals, indirectly supporting 25 500 rural jobs and sourcing cane from 15 000 small-scale growers  thereby sustaining local farming communities, and underpinning numerous rural economies, especially in theKwaZulu-Natalprovince.\n\nIn Zimbabwe, Tongaat Hulett owns two operating businesses, Triangle and separately listed Hippo Valley Estates.Triangle saidrecentlythat it was facing operational challenges that had forced it to retrench employees after cost-cutting measures failed to yield a respite.\n\nItsaid it had seenprofit margins decline significantly by 55%, with manpower costsspikingby 133% as a proportion of revenue and debt levels rose to unsustainable levels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/29151203/Tongaat-Hulett.jpeg",
            "description": "<p>IOL The Vision Group announced on Wednesday that it has received competition approvals for acquisition of all Tongaat Hulett’s assets in Zimbabwe. Under the transaction, Ball Foundry has been given the nod by the Competition and Tariff Commission of Zimbabwe to acquire Triangle Sugar Corporation, which holds Tongaat Hulett’s operations in Zimbabwe. Prosper Ziyadhuma, an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vision-group-secures-clearance-to-take-over-tongaat-huletts-operations-in-zimbabwe/\">Vision Group secures clearance to take over Tongaat Hulett’s operations in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        },
        {
            "title": "We suffer in silence – says Zimbabwean migrant care worker",
            "url": "https://www.newzimbabwe.com/we-suffer-in-silence-says-zimbabwean-migrant-care-worker/",
            "content": "BBC\n\nA migrant social care worker has said her employer threatened to cancel her visa if she complained about being forced to work long hours without any days off.\n\nSophia  not her real name  said she paid more than 2,000 in fees to a South Yorkshire care company that sponsored her visa to come to the UK from Zimbabwe to work for them in 2023.\n\nThe Home Office has cracked down on abuse and exploitation by some care companies by revoking their licences, leaving many workers without a job.\n\nLeeds City Council, which oversees a Yorkshire-wide project to find new jobs for unemployed overseas workers, said there had been challenges in matching people with roles.\n\nSophia came to the UK on a health and care worker visa, designed to help plug staffing gaps in the sector.\n\nShe said she was placed in an unregistered, multi-occupancy house and when she complained that she was paying too much for the accommodation was told she was not grateful.\n\nSophia added that she was threatened with having her Certificate of Sponsorship terminated  a document provided by an employer that is required for the visa to be valid.\n\nYoure supposed to be quiet, so we had to suffer in silence, Sophia said. You cant move, you cant breathe, you are stuck.\n\nYou have sacrificed everything to come here so that you can start a new life. When you get here, you see the treatment is not good.\n\nSophia said she was often out of the house for 16 hours a day for work, without any days off.\n\nShe felt unable to seek any other employment because her visa depended on the care company.\n\nThe union Unison has called for the government to take control of issuing Certificates of Sponsorship, to stop individual care companies having an enormous amount of power over workers.\n\nJordan Stapleton, the unions regional migrant lead, said: Were seeing migrant workers who are having to pay thousands of pounds in illegal fees, often working 16 hours a day, often without a break, not getting paid correctly, not being paid for travel time and being threatened with deportation and their visa being removed if they complain.\n\nAlthough the government has been revoking the licence of some of these employers, many employers are still operating because [employees] darent report them.\n\nJamila Duncan-Bosu, a solicitor from the charity Anti Trafficking and Labour Exploitation Unit (Atleu), said she had seen a rise in the number of inquiries from care workers seeking legal action over their experiences.\n\nThere needs to be a proper safety net, she said.\n\nBetween July 2022 and December 2024, the government said it had revoked more than 470 care providers licences, which enable companies to give visas to overseas workers across England, where there were concerns about abuse and exploitation.\n\nBut the move had left thousands of the workers unemployed.\n\nHome Office figuresreleased last monthrevealed more than 39,000 workers had been associated with these care providers since October 2022.\n\nTo help find the workers find new jobs, in March 2023, the then-Conservative government gave councils across England a total of 16m to tackle the exploitation of overseas workers, help find them new work and offer support.\n\nLeeds City Council runs the Yorkshire and Humber branch of the project.\n\nThe project said it had been approached by 4,355 workers who had been left without employment after having their visa sponsorships revoked.\n\nIt had successfully matched 71 people to new roles or new sponsors since it launched two years ago.\n\nA council spokesperson said a lack of Home Office-approved sponsor organisations in the area affected the number of job matches.\n\nWe recognise that there have been challenges across the region in finding workers new sponsors, which is in line with national recruitment issues faced by organisations in the care sector across the UK, they said.\n\nA government spokesperson said they were determined to protect migrant care workers from exploitation and abuse, including from employers that fail to provide work they had promised or non-payment of minimum wage.\n\nWhere there is evidence of illegal and unethical practices, we will always take action as swiftly as possible, they said.\n\nDan Archer, chief executive of home care service Visiting Angels, which has no involvement with Sophias case, said his company had chosen not to hire staff through the visa scheme.\n\nHe said in some cases hiring overseas workers was the wrong solution to fix the staffing shortage.\n\nIt feels exploitative, bringing people to the UK to ask them to do a job that not enough people in the UK are prepared to do, he said.\n\nInstead, Mr Archer said the company aimed to make the job more attractive to workers already in the UK, by offering better pay and avoiding zero-hour contracts.\n\nElaine Thompson, from Thurnscoe, near Barnsley, said she had relied on the firms care since her husband died five years ago.\n\nHer carer, mother-of-three Natalie Henstalk, said she enjoyed the job because she felt she was helping people and flexible hours meant she could also look after her children.\n\nI love my job. Its a good job to have, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18052159/sophia-bbc-.webp",
            "description": "<p>BBC A migrant social care worker has said her employer threatened to cancel her visa if she complained about being forced to work long hours without any days off. Sophia – not her real name – said she paid more than £2,000 in fees to a South Yorkshire care company that sponsored her visa to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-suffer-in-silence-says-zimbabwean-migrant-care-worker/\">We suffer in silence – says Zimbabwean migrant care worker</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "18 Apr 2025"
        }
    ]
}