{
    "news": [
        {
            "title": "World Bank warns Zimbabwe on climate-induced economic losses",
            "url": "https://www.newzimbabwe.com/world-bank-warns-zimbabwe-on-climate-induced-economic-losses/",
            "content": "By Xinhua\n\nTHE World Bank (WB) has warned that climate change could erode up to 12 percent of Zimbabwes gross domestic product (GDP) annually if the country does not implement robust measures to tackle the phenomenon.\n\nIn its latest Zimbabwe economic update report launched Friday in Harare, Zimbabwes capital, the WB urged Zimbabwe to bolster resilience against climate-related shocks, focusing on agriculture as a critical pillar of the economy.\n\nStatistics from the Zimbabwean government show agriculture contributes from 11 percent to 14 percent of GDP and provides employment for some 70 percent of the population and about 60 percent of all raw materials for the industry.\n\nThe countrys heavy reliance on rain-fed systems and maize production, however, leaves it vulnerable to increasingly severe climate events, the WB noted.\n\nIn the 2023/2024 farming season, Zimbabwe experienced a severe El Nino-induced drought, resulting in a 60 percent decline in maize yield compared to the five-year average.\n\nThe significant reduction in rainfall, coupled with high temperatures, has led to widespread food insecurity and economic hardship.\n\nThe WB observed that the governments ambitious target to boost agricultural output to 12.5 billion U.S. dollars by 2025 is under threat due to climate-induced challenges.\n\nClimate shocks disrupt GDP, trade balances, and fiscal stability. The 2023/2024 El Nino-induced drought alone caused approximately 363 million U.S. dollars in damage losses, the WB said.\n\nThis cycle of drought and recovery undermines sustainable development and exacerbates poverty levels, making it imperative to enhance the resilience of the agricultural sector, said Easther Chigumira, World Bank senior agriculture specialist and co-author of the report.\n\nShe said to strengthen Zimbabwes resilience to weather shocks and climate change, a dual approach is essential, involving substantial investment in climate adaptation and the enhancement of anticipatory actions.\n\nThe report, titled Improving Resilience to Weather Shocks and Climate Change, highlighted the opportunity for Zimbabwe to strengthen resilience to climate shocks and further boost economic growth.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/27201329/World-bank.jpg",
            "description": "<p>By Xinhua THE World Bank (WB) has warned that climate change could erode up to 12 percent of Zimbabwe’s gross domestic product (GDP) annually if the country does not implement robust measures to tackle the phenomenon. In its latest Zimbabwe economic update report launched Friday in Harare, Zimbabwe’s capital, the WB urged Zimbabwe to bolster</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-bank-warns-zimbabwe-on-climate-induced-economic-losses/\">World Bank warns Zimbabwe on climate-induced economic losses </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "Davis Cup: Zimbabwe relegated to Group lll",
            "url": "https://www.newzimbabwe.com/davis-cup-zimbabwe-relegated-to-group-lll/",
            "content": "By Sport Reporter\n\nZIMBABWE tennis team failed to take advantage of playing on home after they recorded whitewash at the hands of Morocco in a Davis Cup Group II play-off held at Harare Sports Club Saturday.\n\nThe defeat saw Zimbabwe being relegated to Group III of the Africa Davis Cup competition.\n\nRunning for two days, Zimbabwe tennis team was taken for a ride by the visitors, who dominated with victories in successive days.\n\nZimbabwes streak of defeats started on Friday when Courtney Lock and Ethan Sibanda lost their singles Friday.\n\nCourtney lost by 6-2 6-4 to Taha Baadi while Sibanda went down 6-3 6-2 to Elliot Benchentrit.\n\nMorocco continued with its dominance over Zimbabwe Saturday after with their doubles team won 6-1 6-1 to claim an unassailable 3-0 lead.\n\nIn the doubles, the hosts were represented by Courtney Lock and Ronnan Mtisi, who came in for injured Ethan Sibanda.\n\nWith a task to save the face of Team Zimbabwe, Mtisi then played Karim Bennani in the reverse singles match in which he lost by 6-4 6-3, taking the tally to 4-0 win for the visitors.\n\nZimbabwes whitewash defeat by Morocco means they will be going back to compete in Group III this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/02034649/GinetYQXQAARpVl.jpeg",
            "description": "<p>By Sport Reporter  ZIMBABWE tennis team failed to take advantage of playing on home after they recorded whitewash at the hands of Morocco in a Davis Cup Group II play-off held at Harare Sports Club Saturday. The defeat saw Zimbabwe being relegated to Group III of the Africa Davis Cup competition. Running for two days,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/davis-cup-zimbabwe-relegated-to-group-lll/\">Davis Cup: Zimbabwe relegated to Group lll</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "Netball league honours 2024 season top performers",
            "url": "https://www.newzimbabwe.com/netball-league-honours-2024-season-top-performers/",
            "content": "By Sport Reporter\n\nRAINBOW Netball League (RANL) Saturday night honoured the 2024 top performers at a glittering awards ceremony held in the capital.\n\nRunning for the sixth time, the awards ceremony was preceded by an elective Annual General Meeting (AGM), which saw the election into power of a new executive chaired by Chipo Chirenje.\n\nThe new executives term will run for four years.\n\nSaturday night belonged Anifa Luya, who won the Player of The Year accolade.\n\nPlaying as a winger, the Flow Angels player had 13 Player of The Match accolades to her name during the 2024 season, hence without doubt she was voted the best player in the league.\n\nHonestly, l am happy, its something l never expected. I want to thank my teammates for their support because without them l could not have made it this far, said Luya, with joy written all over her face.\n\nThe league also recognised the brilliance of top goalscorer, Tafadzwa Mawango of Correctional Queens with a Golden Glove accolade.\n\nMawango scored a total of 1802 goals, the highest by any player in the league during the 2024 season.\n\nAfter helping Correctional Queens to lift the league title since 2019, team head coach Naftali Nyangulu was voted Coach of The Year, taking the gong away from Glow Petroleums Perpetua Siyachitema who won it the previous two seasons.\n\nRANL Awards 2024 Winners List\n\nMost Disciplined Team  Mtala Netball Club\n\nRookie of The Year  Ashley James\n\nGolden Hand  Tafadzwa Mawango\n\n(1802 goals) (Correction Queens)\n\nPeoples Choice Award  Pamela Muchena\n\nCoach of The Year  Naftali Nyanguru\n\nPlayer Of The Year  Anifa Luya\n\nPlayers Player of The Year  Amanda Ncube\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/02034335/EMOQoI9XUAUvV9l.jpeg",
            "description": "<p>By Sport Reporter  RAINBOW Netball League (RANL) Saturday night honoured the 2024 top performers at a glittering awards ceremony held in the capital. Running for the sixth time, the awards ceremony was preceded by an elective Annual General Meeting (AGM), which saw the election into power of a new executive chaired by Chipo Chirenje. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netball-league-honours-2024-season-top-performers/\">Netball league honours 2024 season top performers </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "SADC proposes joint summit with East African Community to solve DRC crisis",
            "url": "https://www.newzimbabwe.com/sadc-proposes-joint-summit-with-east-african-community-to-solve-drc-crisis/",
            "content": "By Thandiwe Garusa\n\nSOUTHERN African Development Community (SADC) leaders have suggested holding a meeting with the East African Community (EAC) to discuss the conflict in the Democratic Republic of Congo (DRC), where rebels have seized the eastern city of Goma.\n\nThe EAC is a regional bloc comprising eight member states: Burundi, Kenya, Rwanda, Somalia, South Sudan, Uganda, Tanzania and DRC. Its headquarters are located in Arusha, Tanzania.\n\nSADC leaders held an extraordinary summit in Harare Friday, following intensified attacks by the March 23 Movement (M23) rebels who killed 16 soldiers serving with SADC and United Nations (UN) peacekeeping forces last week and quickly expanded their presence in eastern DRC after capturing Goma.\n\nSummit called for an immediate joint Summit of SADC and East African Community (EAC) to deliberate on the way forward regarding the security situation in the DRC as proposed by the 24th Extraordinary Summit of Heads of State of the EAC held on 29th January 2025, SADC executive secretary Elias Magosi said.\n\nThe leaders also called for humanitarian support as the situation worsens leaving ordinary Congolese without basic essentials.\n\nSummit expressed concern that the recent attacks continued to worsen the security and humanitarian situation in the DRC and called for immediate restoration of essential utilities such as water, electricity, means of communication and supply lines for food and other essential commodities, he added.\n\nMeanwhile, over 400 000 people have been displaced due to the clashes since the beginning of the year.\n\nThe M23 group is the strongest of over 100 armed groups fighting for control in eastern DRC, an area rich in valuable minerals used in global technology.\n\nAccording to UN experts, M23 is supported by about 4,000 soldiers from Rwandamany more than in 2012 when they briefly took over Goma in a conflict fuelled by ethnic tensions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31174300/SADC-head-of-states-scaled.jpg",
            "description": "<p>By Thandiwe Garusa SOUTHERN African Development Community (SADC) leaders have suggested holding a meeting with the East African Community (EAC) to discuss the conflict in the Democratic Republic of Congo (DRC), where rebels have seized the eastern city of Goma. The EAC is a regional bloc comprising eight member states: Burundi, Kenya, Rwanda, Somalia, South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-proposes-joint-summit-with-east-african-community-to-solve-drc-crisis/\">SADC proposes joint summit with East African Community to solve DRC crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "Raw ivory lands suspected poacher in trouble",
            "url": "https://www.newzimbabwe.com/raw-ivory-lands-suspected-poacher-in-trouble/",
            "content": "By Staff Reporter\n\nA SUSPECTED poacher was nabbed in Bulawayo while in possession of raw ivory, which he wanted to sell.\n\nA 29-year-old man identified as Blessed Matibenga has since been arrested for illegal possession of the elephant tusk.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn January 31, 2025, police in Bulawayo acted on a tip-off and arrested Blessed Matibenga (29) for possession of raw, unmarked and unregistered ivory at Amakhosi Service Station along the Bulawayo-Victoria Falls road.\n\nPolice recovered one elephant tusk, which was concealed in a white sack from the suspect who was seeking potential buyers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/16125356/Ivory.jpg",
            "description": "<p>By Staff Reporter  A SUSPECTED poacher was nabbed in Bulawayo while in possession of raw ivory, which he wanted to sell. A 29-year-old man identified as Blessed Matibenga has since been arrested for illegal possession of the elephant tusk. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. On January 31, 2025,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/raw-ivory-lands-suspected-poacher-in-trouble/\">Raw ivory lands suspected poacher in trouble </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "Breaking free from generational curses: A call to prayer",
            "url": "https://www.newzimbabwe.com/breaking-free-from-generational-curses-a-call-to-prayer/",
            "content": "SUNDAY MORNING TABLET\n\nDear brothers and sisters in Christ,\n\nWe are living in perilous times, and the Bible warns us that in the last days, difficult times will come (2 Timothy 3:1).\n\nMany families are facing unimaginable pain and suffering due to generational spirits that Satan uses to wreak havoc.\n\nSome families are haunted by mysterious deaths, while others are plagued by infidelity, troubled marriages, and economic stagnation. Children are disrespecting their parents, and mental health issues are on the rise.\n\nFurthermore, some individuals have found themselves entangled in the web of Satans deceit, leading them to commit heinous crimes, including murder. The Bible warns us that Satan is a murderer from the beginning (John 8:44), and he seeks to destroy humanity through his evil schemes.\n\nBut we must not lose hope. The Bible reminds us that we are not fighting against flesh and blood, but against the spiritual forces of evil (Ephesians 6:12).\n\nWe must stay prayerful and vigilant, putting on the full armour of God to withstand the schemes of the devil (Ephesians 6:13-18).\n\nAs families, communities, and workmates, we must come together to pray and seek Gods protection and deliverance.\n\nLET US PRAY:\n\nDear Heavenly Father, we come to you in humility and repentance, acknowledging our helplessness against the forces of darkness. We ask that you cover us with your precious blood and protect us from the evil one.\n\nDeliver us from generational spirits that seek to destroy our families, communities, and workplaces.\n\nGive us wisdom and discernment to recognize the schemes of the devil and to stand firm against them. We pray for your mighty hand to move in our midst, bringing healing, restoration, and revival. In Jesus name, we pray.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/16093245/IMG-20240616-WA0009.jpg",
            "description": "<p>SUNDAY MORNING TABLET Dear brothers and sisters in Christ, We are living in perilous times, and the Bible warns us that in the last days, difficult times will come (2 Timothy 3:1). Many families are facing unimaginable pain and suffering due to generational spirits that Satan uses to wreak havoc. Some families are haunted by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/breaking-free-from-generational-curses-a-call-to-prayer/\">Breaking free from generational curses: A call to prayer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "Chinese national in viral video to languish in remand prison",
            "url": "https://www.newzimbabwe.com/chinese-national-in-viral-video-to-languish-in-remand-prison/",
            "content": "By Staff Reporter\n\nA CHINESE national filmed in a video that went viral on social media while pointing a pistol at a local, has been dragged to court.\n\nAccused person, Wang Jun this week appeared at the Gweru Magistrates Court facing three charges under the Firearms Act, Explosives Act and the Mines and Minerals Act.\n\nCircumstances are that on January 21, 2025, and at Bijou farm, Gweru, accused person allegedly intervened in a scuffle between farm manager, Liu Haifeng and complainant, Kholwani Dube.\n\nIt is alleged accused person overpowered Dube, tripped him before pressing his head against the ground while pointing a firearm at him.\n\nThe Chinese national faces additional charges in that last year, he allegedly used explosives without a blasting licence at the farm. He is also alleged to have excavated and blasted the ground at the farm without a permit.\n\nWangu Jun will languish in remand prison until his next court appearance on February 7, 2025 for routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/23170027/Screenshot-2025-01-23-at-18.58.25.png",
            "description": "<p>By Staff Reporter  A CHINESE national filmed in a video that went viral on social media while pointing a pistol at a local, has been dragged to court. Accused person, Wang Jun this week appeared at the Gweru Magistrates Court facing three charges under the Firearms Act, Explosives Act and the Mines and Minerals Act.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-national-in-viral-video-to-languish-in-remand-prison/\">Chinese national in viral video to languish in remand prison</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "COTTCO expects bumper harvest during 2024/25 season",
            "url": "https://www.newzimbabwe.com/cottco-expects-bumper-harvest-during-2024-25-season/",
            "content": "By Darlington Gatsi\n\nCOTTON Company of Zimbabwe (COTTCO) is anticipating a positive outlook for this farming season, with hopes pinned on the continuation of rainfall.\n\nThe optimism is despite that fact that most farmers planted late into the season.\n\nZimbabwe recorded a subdued harvest last season due to low rainfall caused by the El Nino phenomenon.\n\nHowever, this year the sector is expected to bounce back, as the country is experiencing a better rainfall season.\n\nCOTTCO chief executive officer, Rocky Mutenha said should the rains persist into February-March, the outlook for the crop will improve.\n\nAdmittedly, the crop stages indicate a very late crop. The bulk of the crop has not yet reached the productive phase and it is critical that rains continue into the month of February and March, Mutenha said.\n\nWhat is obtaining on the ground is that 12% has just emerged because farmers planted late, 31% is between two to four pair leaves 32% is between four to six pair leaves and 18% is squaring and 7 % is at flowering to ball stages.\n\nGenerally, the plants are looking good. If it continues to rain into February and March, we should expect a good harvest. The first crop assessment is underway to assessment is underway, he added.\n\nOver 200,000 hectares have been put under cotton this season due to the seamless distribution of inputs.\n\nA farmer classification system introduced last year, was used to distribute inputs. Farmers were grouped into three classes based on their history in farming, hectarage, and loyalty to COTTCO.\n\nMutenha also said COTTCO had settled part of the money owed to farmers from last season, with the remaining amount in local currency to be paid before the start of this years marketing season.\n\nFor the 2023  2024 marketing season, COTCCO managed to pay 100% of the US$ component which is 75% an amount US$400 000 payable in ZiG and representing 25% is what is outstanding. Our aim is to clear it before the marketing season commences, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/01060834/IMG-20250131-WA0013.jpg",
            "description": "<p>By Darlington Gatsi  COTTON Company of Zimbabwe (COTTCO) is anticipating a positive outlook for this farming season, with hopes pinned on the continuation of rainfall. The optimism is despite that fact that most farmers planted late into the season. Zimbabwe recorded a subdued harvest last season due to low rainfall caused by the El Nino</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cottco-expects-bumper-harvest-during-2024-25-season/\">COTTCO expects bumper harvest during 2024/25 season </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "In Pictures: SADC Heads of States and Governments meet for Extraordinary Summit on DRC conflict",
            "url": "https://www.newzimbabwe.com/in-pictures-sadc-heads-of-states-and-governments-meet-for-extraordinary-summit-on-drc-conflict/",
            "content": "BELOW are images taken at the SADC Heads of States and Governments Extraordinary Summit on DRC conflict held in Harare on Friday, January 31, 2025. Pictures by THANDIWE GARUSA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/01065849/Mnangagwa-and-Ramaphosa-3-scaled.jpg",
            "description": "<p>BELOW are images taken at the SADC Heads of States and Governments Extraordinary Summit on DRC conflict held in Harare on Friday, January 31, 2025. Pictures by THANDIWE GARUSA.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-sadc-heads-of-states-and-governments-meet-for-extraordinary-summit-on-drc-conflict/\">In Pictures: SADC Heads of States and Governments meet for Extraordinary Summit on DRC conflict</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        },
        {
            "title": "Mthuli Ncube locks stables when horses have bolted; belated move to save retail sector ignores ZWG and US$ factors",
            "url": "https://www.newzimbabwe.com/mthuli-ncube-locks-stables-when-horses-have-bolted-belated-move-to-save-retail-sector-ignores-zwg-and-us-factors/",
            "content": "By Alois Vinga\n\nFINANCE Minister, Mthuli Ncube Friday announced new measures to save the crumbling retail sector, which did not address two pertinent issues bedeviling the retailers like the Zimbabwe Gold (ZWG) currency impact and inadequacy of the United States dollar.\n\nThe negative impact of informalisation reached a crescendo recently after an escalation in company closures.\n\nRegional retailer Choppies Enterprise Limited (Choppies) and fast-moving consumer goods firms Unilever plc have indicated the intent to leave the country.\n\nKhayah Cement Limited and clothing retailer Truworths Limited entered corporate rescue in December and August 2024, respectively.\n\nAlso, British multinational professional services and PriceWaterHouse Coopers International Limited is on its way out of Zimbabwe.\n\nOn numerous occasions the retail sector sobbed bitterly for authorities to urgently consider creating an easy passage to access the US$ in exchange of the ZWG currency which is normally dumped in the formal sector at a time when suppliers of commodities are demanding payment in US$.\n\nPreviously, the Reserve Bank of Zimbabwe had managed to ease such carnage through the Foreign Exchange Auction System, which was discontinued when the central bank decided to create pure market determined source channels.\n\nBut in its annual assessment for the just-ended year of 2024, the Zimbabwe National Chamber of Commerce (ZNCC) bemoaned the lack of willing foreign currency sellers in the Interbank Market, leaving many companies in a dire situation.\n\nNumerous calls by the retail sector for authorities to rein in escalating informalisation before it was too late were met with hostility.\n\nJust last year, the Finance Ministrys Permanent Secretary, George Guvamatanga fired a salvo at OK Zimbabwe management after they raised concerns on spiraling informality in the retail sector and went further to suggest that such managers must be fired for failing to respond to economic dynamics.\n\nHowever, in a gesture to save the retail sector Friday in what many believe to be similar to the proverbial quote of locking the stable when the horses have already bolted out Ncube announced a cocktail of measures which do not address the pressing issues choking the retail sector.\n\nHe ordered the mandatory use of point-of-sale machines by all informal traders, adoption of international best practice tax payment, which ensures every eligible taxpayer complies and level playing field between formal and informal businesses by discouraging manufacturers from supplying directly to end users and informal markets.\n\nEstablishment of a Domestic Interagency Enforcement Team to enforce compliance in the informal sector to enforce collaboration between Local Authorities and Central Government in the licensing and enforcement processes.\n\nThe RBZ will announce additional measures through the Monetary Policy Statement to enhance the formalisation of the market and the government will embark on an exercise to streamline regulatory processes , fees and charges as well as duplication of work by Government Agencies in order to reduce the cost of doing business, he said.\n\nThe Treasury boss ordered the enforcement of the provisions of the Indigenisation and Economic Empowerment Act, which provides for Reserved Sectors as well as the provision of additional incentives to support Industry through the Industrialisation Fund.\n\nHe committed to promote the procurement of goods and services from local producers and suppliers by the Government to support local industry.\n\nIn conclusion, the government is committed to improving the business environment, in order to curb the informalisation of the economy, as we move towards Vision 2030, added Ncube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/19122023/Mthuli-Ncube-e1661953746455.png",
            "description": "<p>By Alois Vinga FINANCE Minister, Mthuli Ncube Friday announced new measures to save the crumbling retail sector, which did not address two pertinent issues bedeviling the retailers like the Zimbabwe Gold (ZWG) currency impact and inadequacy of the United States dollar. The negative impact of informalisation reached a crescendo recently after an escalation in company</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mthuli-ncube-locks-stables-when-horses-have-bolted-belated-move-to-save-retail-sector-ignores-zwg-and-us-factors/\">Mthuli Ncube locks stables when horses have bolted; belated move to save retail sector ignores ZWG and US$ factors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "02 Feb 2025"
        }
    ]
}