{
    "news": [
        {
            "title": "Top Ibhetshu LikaZulu official resigns after once-vibrant pressure group goes to bed with Zanu PF",
            "url": "https://www.newzimbabwe.com/top-ibhetshu-likazulu-official-resigns-after-once-vibrant-pressure-group-goes-to-bed-with-zanu-pf/",
            "content": "By Leopold Munhende\n\nGIFFORD Sibanda, the Ibhetshu LikaZulu spokesperson, has resigned from the once vibrant pressure group following revelations that Secretary General Mbuso Fuzwayo is now working hand in glove with Zanu PF to ensure President Emmerson Mnangagwas ambitions for a term extension are realised.\n\nThe group, which in the past was declared a public enemy with some of its members arrested and locked up for standing up to the Zanu PF government, is the second applicant in a Constitutional Court application veiled as an attempt to stop Mnangagwas 2030 plan.\n\nSengezo Tshabangus lawyer, Nqobile Sithole and Method Ndlovu are representing Fuzwayo and Ibhetshu LikaZulu.\n\nAccording to reports, Sibandas resignation emanates from knowledge that Fuzwayo has been tasked to challenge the illegal attempts to have Mnangagwa hang on, and lose.\n\nThis will thereby open avenues for Zanu PFs resolution to extend his second term actionably without any legal hindrances and possible challenges.\n\nThis, however, remains unconfirmed as Fuzwayos number was not going through when NewZimbabwe.com sought to get his comment on the allegations. His WhatsApp number was also not receiving messages.\n\nIt is with a heavy heart that I tender my resignation from Ibhetshu LikaZulu, effective immediately, reads Sibandas letter to Fuzwayo.\n\nThis decision comes after deep reflection on the current direction and approach the organisation has taken in the struggle against Zanu PF.\n\nUnfortunately, I find that this route diverges from my own beliefs, principles, and the foundational values that Ibhetshu LikaZulu has long stood for.\n\nThis is not an easy decision. Ibhetshu LikaZulu has been a home of conscience and courage  a movement that stood firmly with the oppressed and gave voice to the voiceless.\n\nSibanda and Fuzwayo had been comrades in arms for years, in the trenches against first late President Robert Mugabe and his harsh Zanu PF regime to the current.\n\nA resolution by Zanu PF last year mandated the partys secretary for justice to initiate the process that will extend Mnangagwas second and final term, which is supposed to end in 2028. The party wants it lengthened to 2030.\n\nThe involvement of exiled former minister in Mugabes government, Jonathan Moyo, has raised the stakes as he is a known strategist and thinker.\n\nThe resolution, which has threatened to split the revolutionary institution and riddled it with factional fights, was reinforced at its recent Peoples Conference hosted in Mutare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/22205448/Mbuso-Fuzwayo.jpg",
            "description": "<p>By Leopold Munhende GIFFORD Sibanda, the Ibhetshu LikaZulu spokesperson, has resigned from the once vibrant pressure group following revelations that Secretary General Mbuso Fuzwayo is now working hand in glove with Zanu PF to ensure President Emmerson Mnangagwa’s ambitions for a term extension are realised. The group, which in the past was declared a public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-ibhetshu-likazulu-official-resigns-after-once-vibrant-pressure-group-goes-to-bed-with-zanu-pf/\">Top Ibhetshu LikaZulu official resigns after once-vibrant pressure group goes to bed with Zanu PF</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nA GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora.\n\nMwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling partys controversial resolution to extend President Emmerson Mnangagwas tenure to 2030 or beyond.\n\nIn a statement, the opposition party saidthe attackers armed with guns were donning Zanu PF regalia.\n\nMwonzora had made a brief stop at the MDC Bulawayo Provincial Office to address party members and journalists on Zanu PFs Agenda 2030.\n\nYesterday a group of Zanu PF vigilantes calling themselves Boys  dzaMudhara disrupted a peaceful meeting of the MDC in Bulawayo. We shall never bow down to thuggery. Our fight against desecration of our constitution and the 2030 agenda will be intensified.pic.twitter.com/yHJnTicoqS\n\n Sen Douglas Mwonzora (@DMwonzora)November 6, 2025\n\nTrouble reportedly started after Mwonzora finished addressing journalists.\n\nSoon after the members of the Press left, members of the police mainly from PISI and CID and youths wearing Zanu PF regalia entered the office from the back door, numbering about 20, armed with guns and knives and started dismissing people as they advanced towards the MDC leader threateningly.\n\nThey were chanting 2030 ino budirira chete (The 2030 agenda will succeed), said the opposition.\n\nA stampede then followed as members of the security whisked away the president (Mwonzora).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter A GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora. Mwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling party’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/\">Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "IMF says Zim highly dollarised as local industry calls for further disinflation",
            "url": "https://www.newzimbabwe.com/imf-says-zim-highly-dollarised-as-local-industry-calls-for-further-disinflation/",
            "content": "IOL\n\nThe International Monetary Fund (IMF) says Zimbabwes economy remains highly dollarised, with any de-dollarisation policies needing gradual implementation while the Confederation of Zimbabwe Industries has called for further disinflation strategies into 2026 to correct pricing and manage stubbornly high inflation.\n\nZimbabwe is pushing for an end to the use of US Dollars across the economy by 2030, coinciding with a possible two year extension of President Emmerson Mnangagwas rule originally scheduled to end in 2028. Mnangagwas party, Zanu PF party has resolved to extend the Zimbabwean leaders tenure and to end dollarisation by 2030.\n\nHowever, the IMF has said in an interview that Zimbabwe remains highly dollarized with any confidence in a local currency needing to be built through credible fiscal and monetary policies, a strengthened FX market, and the absence of quasi-fiscal operations such as providing subsidies or financing government programsoutside of the budgetframework.\n\nThe Zimbabwe Gold (ZiG) local currency Zimbabwe says is backed by foreign currency reserves is largely shunned by locals for transactions. The IMF said Zimbabwe has to ringfence any de-dollarisation efforts by a stable policy environment that will accrue confidence for the local unit of exchange.\n\nConfidence in macro-economic policy and the currency is reinforced by a predictable, rules-based policy environment and progress on economic governance.Advancing these reformsalongside clear, consistent economic policy implementationwould help anchor expectations and bolster confidence, the IMFs chief of mission to Zimbabwe,Wojciech Stanislaw Maliszewski, said by email.\n\nThe Confederation of Zimbabwe Industries (CZI) has called for further disinflation strategies over the next few months. It argued that inflation should be lowered further.\n\nAn inflation rate of 30% is still too high, calling for more disinflation strategies into 2026.The policy target is to have an annual ZiG inflation of 30% by December 2025, said Cornelius Dube, chief economist for the CZI.\n\nAccording to the IMF, theReserve Bank of Zimbabwe (RBZ)has been tighteningits policy stancesince September last year afterhalting monetary financing. This had helpedtolower inflationfrom elevated highs while also easingexchange-rate pressures.\n\nThe gap between official and parallel market rates narrowed, and ZiG inflation declined by mid-2025, though the economy remains highly dollarized, said Maliszewski.\n\nFor the month of October, Zimbabwes inflation in ZiG local currency dropped to32.7%aftershedding 50 percentage points from a rate of 82.7% in the month of September 2025. on the other hand, the USD month-on-month inflation for October 2025 increased to 0.3% from a rate of 0% in the month of September2025.11.4\n\nThe CZI has explained that thismeansthatprices in USD terms remained stable as the observed increase is minimal.\n\nHowever, CZI believes that when the de-dollarisation programme gets rolled out, the inflation differential between ZiG and USD will matter in the decision of which currency to usein transactions.\n\nUSD price stability would make the USD attractive as both a transaction and savings currency. ZiG stability has to be sustainable for a very long time before it can also be considered a close substitute to the USD, said Dube.\n\nThis comes as ZimbabwesUSD year-on-year inflationhas continued on adeclining trend which started in July 2025.\n\nIn October 2025,ZimbabwesUSD inflation declined to 13% fromthe13.4% registered in the month of September. However, a 13% USD inflation is still very high, as it means that savings in USD lost about 13% purchasing power between October 2024 and October 2025, said the CZI.\n\nWith the USD being the main savings currency, it is critical for its inflation to remain very low if savings are to be protected.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>IOL The International Monetary Fund (IMF) says Zimbabwe’s economy remains highly dollarised, with any de-dollarisation policies needing gradual implementation while the Confederation of Zimbabwe Industries has called for further disinflation strategies into 2026 to correct pricing and manage stubbornly high inflation. Zimbabwe is pushing for an end to the use of US Dollars across the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-says-zim-highly-dollarised-as-local-industry-calls-for-further-disinflation/\">IMF says Zim highly dollarised as local industry calls for further disinflation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm",
            "url": "https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/",
            "content": "By Leopold Munhende\n\nWAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land.\n\nLocal Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds.\n\nAccording to documents gleaned by NewZimbabwe.com, his Ministry is seeking to reopen a case that could grant Rautenbach ownership of land the High Court already decided was not his.\n\nThe war vets, under the Springs Farmers Association, have filed their intent to oppose the ministrys application, arguing that the government cannot relitigate a matter that was final and conclusive and that any further interference puts Zimbabwes land-reform credibility at stake.\n\nThe dispute centres on a March 2025 offer letter issued by Local Government Minister Daniel Garwe, allocating 671 hectares at Springs Farm and 412 hectares at Stuhm to Marimba Residential Properties (Pvt) Ltd as final compensation for land in Aspindale Park, Lochinvar, and Salisbury Park that the company claims to have lost years ago.\n\nHowever, the courts have already ruled on the matter.\n\nIn 2019, the High Court found that businessman Rautenbach and his associated companies had no valid title to the Aspindale property, affirming that the land had been lawfully acquired by the State and allocated to housing co-operatives under the National Housing Delivery Programme.\n\nThat ruling, described by the judge as final and definitive, was never overturned.\n\nDocuments show that while Marimba claims to have lost about 180 hectares in Aspindale, the new offer compensates it with over 1,100 hectares of prime farmland, six times the size and far higher in market and agricultural value.\n\nThe paper trail surrounding Marimba Residential Properties raises more questions than answers.\n\nThe Registrar of Companies confirmed in 2018 that Marimba Residential Properties and Marimba Industrial Properties are not registered companies in our database.\n\nAt the same time, the Registrar of Deeds admitted that the title deed purportedly linking Marimba to the Aspindale property is missing from the record.\n\nDespite those gaps, the company continues to feature in official correspondence and now, in the new compensation offer.\n\nIn their newly filed opposition, the farmers accuse the government of attempting to rescind a ruling made on the merits, which the law does not allow.\n\nThey describe the governments filing as a composite application that is procedurally and substantively defective, arguing that it merges three distinct processes: review, rescission, and interdict into a single motion, something the farmers lawyers say is jurisprudentially untenable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Leopold Munhende WAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land. Local Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/\">War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Vandalism attempts led to restriction of Mbuya Nehanda statue – Information Perm Sec",
            "url": "https://www.newzimbabwe.com/vandalism-attempts-led-to-restriction-of-mbuya-nehanda-statue-information-perm-sec/",
            "content": "By Staff Reporter\n\nPermanent Secretary in the Ministry of Information and Publicity, Nick Mangwana, says government restricted public access to the Mbuya Nehanda statue in Harares Central Business District following several attempts of vandalism.\n\nThe statue, unveiled by President Emmerson Mnangagwa in 2021, cost the State a substantial amount of money.\n\nSince its unveiling, the monument which stands at the corner of Julius Nyerere Way and Samora Machel Avenue has been inaccessible to the public, with police officers stationed to guard it.\n\nThe monument was initially accessible to the public. Unfortunately, after a rise in visitor numbers and repeated vandalism attempts, including people trying to push it over or deface it, access had to be restricted, said Mangwana in a post on X.\n\nHe added that government is now working on measures to reopen access to the statue.\n\nTo enable safe public viewing of the Mbuya Nehanda statue, while protecting the iconic monument, the government is creating a new access framework. The President has instructed that this be implemented as soon as possible. We take this opportunity to apologize to the public for the delayed access, he said.\n\nMangwanas response follows criticism after international travel vlogger Davud Akhundzada was denied access to the statue during a recent visit.\n\nAuthorities came under fire for missing an opportunity to market Zimbabwes capital city.\n\nIn a statement, the Ministry of Tourism and Hospitality Industry distanced itself from the incident, saying responsibility for the monument lies with the Ministry of Home Affairs and Cultural Heritage.\n\nWe wish to clarify that the Mbuya Nehanda Statue is a National Heritage Monument managed by the Ministry of Home Affairs and Cultural Heritage. It stands as a proud symbol of Zimbabwes liberation history and identity.\n\nThe site is subject to specific preservation and security protocols and as such, public access to certain areas, including elevated or restricted zones, may be limited for safety, preservation and security reasons.\n\nHowever, as the Ministry of Tourism and Hospitality Industry, we are taking proactive steps to enhance tourist management at such sites. Through a Whole-of-Government Approach Strategy, in coordination with our counterparts at the Ministry of Home Affairs and Cultural Heritage, we are in the process of deploying tourism officers at key heritage and cultural monuments. These officers will facilitate seamless, well-informed and welcoming access for tourists, ensuring a positive experience while safeguarding our national heritage, read the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/03062339/Mbuya-Nehanda.jpg",
            "description": "<p>By Staff Reporter Permanent Secretary in the Ministry of Information and Publicity, Nick Mangwana, says government restricted public access to the Mbuya Nehanda statue in Harare’s Central Business District following several attempts of vandalism. The statue, unveiled by President Emmerson Mnangagwa in 2021, cost the State a substantial amount of money. Since its unveiling, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vandalism-attempts-led-to-restriction-of-mbuya-nehanda-statue-information-perm-sec/\">Vandalism attempts led to restriction of Mbuya Nehanda statue – Information Perm Sec</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Man (22) jailed for raping 93-year-old woman",
            "url": "https://www.newzimbabwe.com/man-22-jailed-for-raping-93-year-old-woman/",
            "content": "By Staff Reporter\n\nA GWANDA man has been sentenced to 20 years imprisonment for raping a 93-year-old womanfrom his village in Esigodini.\n\nThe offender, aged 22 this week, appeared before the Gwanda Magistrates Court, where he was convicted.\n\nThe State case was that on July 6, 2025, during the night and in the Esibomvu area of Esigodini, the offender broke down the door to the victims bedroom to gain entry.\n\nWhile inside, he pulled the victim from her bed, undressed and raped her.\n\nIt was heard in court that during the same night, the offender committed another crime of unlawful entry and theft, which prompted villagers to trace his footprints, leading to his arrest, which then linked him to the rape.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) noted that the appalling act was intolerable, considering that elderly persons are vulnerable members of society who deserve the protection of communities.\n\nMeanwhile, the Bulawayo Magistrates Court has slapped a 40-year-old man from Tsholotsho with 20 years imprisonment after he was convicted of two counts of rape perpetrated on his biological daughter, aged 19.\n\nThe offences occurred between June 2022 and August 2025 on two separate locations in Tsholotsho, where the offender would force himself on the victim. She later filed a police report leading to the offenders arrest.\n\nThe court imposed 20 years imprisonment for each count, to run concurrently.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06063336/Gwanda-court_magistrate.jpg",
            "description": "<p>By Staff Reporter A GWANDA man has been sentenced to 20 years’ imprisonment for raping a 93-year-old woman from his village in Esigodini. The offender, aged 22 this week, appeared before the Gwanda Magistrates Court, where he was convicted. The State case was that on July 6, 2025, during the night and in the Esibomvu area</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-22-jailed-for-raping-93-year-old-woman/\">Man (22) jailed for raping 93-year-old woman</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "06 Nov 2025"
        }
    ]
}