{
    "news": [
        {
            "title": "Former Mauritanian Finance Minister Tah Elected President of AfDB",
            "url": "https://www.newzimbabwe.com/former-mauritanian-finance-minister-tah-elected-president-of-afdb/",
            "content": "By Boakai Fofana\n\nFormer Mauritanian finance minister, Sidi Ould Tah, was elected president of the Africa Development Bank, the AfDBannounced. Tah, who also headed the Arab Bank for Economic Development in Africa, won after three rounds of voting by the AfDBs Board of Governors at their meeting in Abidjan, securing more than 76% of the votes in the end, according toreports.\n\nIn the weeks leading up to Thursdays vote, Tahpromisedto undertake internal reforms if elected. He spoke of the needto improve key functions of the Bank, such as reducing the time frame for the implementation of projects and attracting the necessary talent.\n\nAmongst what he said were thefour main pillars  forming the basis of his leadership  are scaling up financing for development and strengthening the continents financial architecture.\n\nThe Mauritanian becomes the ninth president of the AfDB since its founding in 1964. He ran against four candidates: Amadou Hott of Senegal, Zambias Samuel Maimbo, Mahamat Abbas Tolli of Chad, and the only woman candidate, Bajabulile Swazi Tshabalala from South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29193432/afdb.jpg",
            "description": "<p>By Boakai Fofana  Former Mauritanian finance minister, Sidi Ould Tah, was elected president of the Africa Development Bank, the AfDB announced. Tah, who also headed the Arab Bank for Economic Development in Africa, won after three rounds of voting by the AfDB’s Board of Governors at their meeting in Abidjan, securing more than 76% of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-mauritanian-finance-minister-tah-elected-president-of-afdb/\">Former Mauritanian Finance Minister Tah Elected President of AfDB</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "29 May 2025"
        },
        {
            "title": "Will Liga MX Return to FC 26?",
            "url": "https://www.newzimbabwe.com/will-liga-mx-return-to-fc-26/",
            "content": "It has been a disappointing period for fans of Mexican soccer, as the premier soccer gaming option hasnt had the licensing rights for the Liga MX since FIFA 22.\n\nThe leagues absence has been a big miss for gamers, especially those that wish to play as some of the major teams from the region such as Club America and Tigres.\n\nHowever, there could yet be good news on the horizon for Liga MX fans as the competition is set toreturn to the EA Sportsfranchise in time to be included in the upcoming release later this year.\n\nPrevious Partnership Ends\n\nThe reason for Liga MXs exclusion from recent EA releases is due to the competitions ongoing partnership with Konami, meaning that it was only able tofeature in theeFootballseries.\n\nThat has been a major blow for fans of the competition, especially considering that the quality of the Konami titles has diminished compared to the offerings provided by EA Sports throughout modern history.\n\nHowever, it was revealed on the site of the eFootball series that Liga MX is no longer listed as an official partner for the title, which signals the end of their three-year agreement.\n\nWhile it has not yet been officially announced that the competition will return to the EA series, there is an expectancy that one of the worlds most popular leagues will once again feature in the worlds most popular soccer gaming title.\n\nWhy is Liga MX So Important?\n\nThe absence of Liga MX clubs in the EA Sports game would have been felt by the developer, especially considering the popularity of the competition across the Americas. The Mexican league is very popular in Americas, as you can see in mostLiga MX betting apps.\n\nWith no Liga MX clubs licensed, sales of the game in Mexico have diminished, with many fans opting to instead play as their favorite clubs in the eFootball series. Gaining licensing rights for the competition is vitally important for the long-term success of the EA Sports game, as the tournament is one of the most followed across the Americas.\n\nThat is reflected by the fact that Liga MX is second to only the Premier League in terms of average viewing figures in the United States. Not only that, but the atmospheric stadiums available to players in Mexico offer players a unique environment to play matches.\n\nThere are also important factors that should be considered when it comes to the stadium licenses, as EA FC will have the rights to include all major arenas that will be used for next summers World Cup. However, the title of the competition will need to be different due to the ending of the agreement between EA Sports and FIFA.\n\nWhen Was Liga MX Last in an EA Sports Game?\n\nIt has been a long wait for Liga MX fans, as the competition hasnt been included an EA Sports series since FIFA 2022. The absence was felt by fans in the proceeding years, as it greatly reduced the number of teams available to players.\n\nHowever, its return is likely to appease the vast majority of gamers that like to experience and play with new teams that they wouldnt typically come across. It is also a further reminder that EA Sports are committed to offering the most authentic and comprehensive soccer gaming experience to their customers.\n\nOther Teams That Will Miss Out on EA FC 26\n\nThere will be a host of teams that will miss out on being included in the upcoming release of EA FC 26. Among those include teams that have been relegated from the bottom available tiers in the title. That includes English clubs such as Carlisle United and Morecambe.\n\nHowever, Barnet will replace one of the teams following their promotion from the National League. Two of the biggest teams in world soccer will also be likely to be missing in the title this year. EA has been missing Italian teams in recent editions of the title, and once again, it appears unlikely that either Inter Milan or AC Milan will be licensed in time to feature in the 2026 title.\n\nWith the World Cup fast approaching, there will also be major concerns that some of the biggest national teams in the world are also not licensed. The most notable of those is Brazil, who havent been licensed in the EA Sports series since FIFA 23.\n\nBelgium was unlicensed in EA FC 25, but featured in the previous edition of the title. Other nations that could make the World Cup but are unlikely to be licensed in time for the release this year include Australia, Canada, China, and Turkey. The latter of the nations hasnt featured in an EA Sports series title since FIFA 2021.\n\nWhen is EA FC 26 Released?\n\nSoccer fans still face a lengthy wait before the upcoming title in the EA Sports series is released, as EA FC 26 isnt set to hit shelves until late September.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29121714/WhatsApp-Image-2025-05-29-at-13.00.03.jpeg",
            "description": "<p>It has been a disappointing period for fans of Mexican soccer, as the premier soccer gaming option hasn’t had the licensing rights for the Liga MX since FIFA 22. The league’s absence has been a big miss for gamers, especially those that wish to play as some of the major teams from the region such</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/will-liga-mx-return-to-fc-26/\">Will Liga MX Return to FC 26?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "29 May 2025"
        },
        {
            "title": "Dynamos hit with FIFA ban",
            "url": "https://www.newzimbabwe.com/dynamos-hit-with-fifa-ban/",
            "content": "By Sports Reporter\n\nZimbabwe football giants Dynamos has been hit with a FIFA ban due to an outstanding amount of US$18,500 owed to two former players from Ghana, Emmanuel Paga and Ansa Botchway.\n\nAccording to reports, Dynamos owes Paga US$8,500, while Botchway is owed US$10,000.\n\nThe duo parted ways with Dynamos in December last year, with Paga joining Mutare-based outfits Manica Diamonds, as Botchway crossed to Scottland FC.\n\nDembare had a turbulent 2024 season campaign, with players boycotting training several times in protest over unpaid winning bonuses and sign-on fees.\n\nThis then led to a mass players exodus at the end of the season as 15 senior players left.\n\nDynamos has become the fourth Zimbabwean club to be slapped with a FIFA ban since last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29044358/paga.png",
            "description": "<p>By Sports Reporter Zimbabwe football giants Dynamos has been hit with a FIFA ban due to an outstanding amount of US$18,500 owed to two former players from Ghana, Emmanuel Paga and Ansa Botchway. According to reports, Dynamos owes Paga US$8,500, while Botchway is owed US$10,000. The duo parted ways with Dynamos in December last year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-hit-with-fifa-ban/\">Dynamos hit with FIFA ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "29 May 2025"
        },
        {
            "title": "ZWG annual inflation rate hits 92,1%",
            "url": "https://www.newzimbabwe.com/zwg-annual-inflation-rate-hits-921/",
            "content": "By Alois Vinga\n\nTHE local ZWG inflation rate has surged to 92,1% amid grave concerns bytheindustry for authorities to contain the rates.\n\nData published by the Zimbabwe National Statistics Agency (ZimStat) this week revealed that annual inflation, which stood at 85% last month, surged by 7% in the month of May 2025.\n\nThe ZWG month-on-month inflation rate was 0.9 percent in May 2025, gaining 0.3 percentage points on the April 2025 rate of 0.6 percent. The ZWG year-on-year inflation rate (annual percentage change) for the month of May 2025, as measured by the all-items ZWG Consumer Price Index (CPI), was 92.1%, the statistics agency said.\n\nLast month, the Confederation of Zimbabwe Industries said the high ZWG inflation largely reflects cumulative shocks that drove month-on-month inflation in 2024. The industry grouping said a significant factor was the September 2024 exchange rate devaluation, which substantially increased the ZiG Consumer Price Index (CPI) and, in turn, elevated annual inflation compared to April 2024 levels.\n\nThe industry body said high ZWG annual inflation poses challenges for businesses, particularly due to its impact on interest rates.\n\nZimstat said the weighted month-on-month inflation rate was 0.0 percent in May 2025, shedding 0.3 percentage points on the April 2025 rate of 0.3 percent while the weighted year-on-year inflation rate for May 2025 as measured by the all-items USD Consumer Price Index (CPI), was 26.9 percent.\n\nThe USD month-on-month inflation rate was -0.3 percent in May 2025, shedding 0.5 percentage points on the April 2025 rate of 0.2 percent. The USD year-on-year inflation rate (annual percentage change) for the month of May 2025, as measured by the all-items USD Consumer Price Index (CPI), was 13.9 percent, said Zimstat.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga THE local ZWG inflation rate has surged to 92,1% amid grave concerns by the industry for authorities to contain the rates. Data published by the Zimbabwe National Statistics Agency (ZimStat) this week revealed that annual inflation, which stood at 85% last month, surged by 7%  in the month of May 2025. “The ZWG month-on-month</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-annual-inflation-rate-hits-921/\">ZWG annual inflation rate hits 92,1%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "29 May 2025"
        },
        {
            "title": "Mnangagwa declares multi-vehicle collision which killed 12 a national disaster, victims named",
            "url": "https://www.newzimbabwe.com/mnangagwa-declares-multi-vehicle-collision-which-killed-12-a-national-disaster-victims-named/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has declared the fatal accident involving a fuel tanker, a two-tonne truck and a van, which claimed 12 lives near Kwekwe, a national disaster.\n\nThe accident occurred at the 200 kilometre peg along the Harare-Bulawayo Road near Sebakwe River.\n\nAccording to the Zimbabwe Republic Police (ZRP), the fuel tanker with two trailers, travelling towards Kwekwe, collided with a truck travelling from the opposite direction, resulting in a head-on collision with a Nissan AD van, which had 12 people on board.\n\nThe tanker dragged the van for several metres before overturning and falling on top of it, trapping the 12 occupants inside.\n\nPolice have released names of eight of the victims  James Ncube (23), Marvellous Mapanzure (20), Emilly Mpofu Mucheuki (25), Joshua Muza (35), Reward Nyatsongo (28), Farai Bisendi (47), Emmanuel Mangomana (21) and Maria Jasi (43).\n\nFour females are yet to be identified.\n\nIn a statement, Mnangagwa declared the accident a national disaster.\n\nMy heart goes out to families that have lost their loved ones in this horrific accident. Equally, I wish a speedy recovery to all those nursing injuries from the incident. I have since directed the responsible arms of my Government to declare this traffic accident a national disaster.\n\nThis crucial legal step paves the way for Government to move in and take all-round responsibility for the interment of all those who perished the accident, and for support to those hospitalised. May all the bereaved and other affected families find comfort and a solace in that our Nation joins and mourns with them in this hour of deep grief and pain, said Mnangagwa.\n\nHe urged the public to support law enforcement in addressing reckless driving.\n\nThe deadly incident adds yet another grim statistic to the needless toll which reckless driving levies on our people and our Nation. While I am pleased that the Zimbabwe Republic Police is moving speedily towards a full deployment of high-end technologies for traffic management, and for curbing waywardness on our roads, more still has to be done to arrest the ever-spiralling fatalities we face as a Nation.\n\nThe duty for safe traffic conduct squarely falls on all road users, while the responsibility to call out reckless road-users includes the general public who should support our law enforcement agencies to tame what in essence has become a traffic jungle, added Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28170019/kwekwe-accident.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has declared the fatal accident involving a fuel tanker, a two-tonne truck and a van, which claimed 12 lives near Kwekwe, a national disaster. The accident occurred at the 200 kilometre peg along the Harare-Bulawayo Road near Sebakwe River. According to the Zimbabwe Republic Police (ZRP), the fuel tanker</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-declares-multi-vehicle-collision-which-killed-12-a-national-disaster-victims-named/\">Mnangagwa declares multi-vehicle collision which killed 12 a national disaster, victims named </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "29 May 2025"
        },
        {
            "title": "Chevrons to play Proteas in Battle of Limpopo test match",
            "url": "https://www.newzimbabwe.com/chevrons-to-play-proteas-in-battle-of-limpopo-test-match/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens cricket team will in June face neighbours South Africa at Queens Sports Club in a two-Test match series dubbed the Battle of Limpopo.\n\nThe first series is scheduled will start onJune28 to July 2, while the second one will be played from July6 to 10.\n\nChevrons upcoming series against Proteas comes on the back of an innings and 45 runs defeat against England in a historical Test match, which was played at Trent Bridge.\n\nZimbabwes Test match against South Africa will mark the third Test for the Chevrons this year, following two Test encounters against Bangladesh in April and England in May.\n\nZimbabwe and South Africas last Test meeting was a single-match encounter played at Port Elizabeth in 2017, which the host won by 120 runs.\n\nChevrons two-match series against South Africa will be used as a build-up to another two-test match series against New Zealand, which is set to tour Zimbabwe at the end of July.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/01174040/Chevrons.webp",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s cricket team will in June face neighbours South Africa at Queens Sports Club in a two-Test match series dubbed the ‘Battle of Limpopo’. The first series is scheduled will start on June 28 to July 2, while the second one will be played from July 6 to 10. Chevrons’ upcoming series against</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-play-proteas-in-battle-of-limpopo-test-match/\">Chevrons to play Proteas in Battle of Limpopo test match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "29 May 2025"
        }
    ]
}