{
    "news": [
        {
            "title": "Viral video of Zimbabwean patient and SA nurses’ clash sparks outrage",
            "url": "https://www.newzimbabwe.com/viral-video-of-zimbabwean-patient-and-sa-nurses-clash-sparks-outrage/",
            "content": "By The South African\n\nA ZIMBABWE patients encounter with South African nurses has sparked widespread debate and outrage after a video went viral on social media.\n\nThe footage, allegedly recorded at a medical facility in Midrand, shows the patient demanding a transfer letter to another doctor after reportedly not receiving adequate assistance.\n\nHeated exchange over patients transfer letter\n\nIn the first part of the video, a nurse is seen speaking on the phone with a colleague, ostensibly to inquire about the transfer letter.\n\nThe colleague reportedly responds that she never saw the patient.\n\nWhen the nurse relays this message, the patient adamantly counters, Yes, she never saw me, she never attended me. I saw her, I saw her. She can just do it now, rather than sitting there, she can just do it now. Can you ask her to do it now?\n\nBlood pressure check dispute\n\nThe tension escalates as the patients camera pans to a second nurse, who is accused of neglecting to check the patients blood pressure.\n\nIn the exchange, the nurse claims, I dont check BP, prompting the patient to ask, What do you do?\n\nThe nurses reply, I sleep, move around, and eat a lot, draws a sharp rebuke from the patient, who comments on the nurses weight: That is why you are fat.\n\nPatients frustration and nurses defiance\n\nThe patient, growing frustrated, states, They said she must write me a transfer. She is not No, I came here what time? I cant wait anymore. Write me a transfer, let me go to the doctor.\n\nThe nurse, however, refuses, responding defiantly, I wont write you a transfer. Shout as much as you want, let everyone hear you. I wont write you. Take a pic, here, sue me, post me, I will sue the f*** out of you.\n\nPublic outcry and calls for accountability\n\nThe video has since ignited a firestorm of reactions online, with many expressing outrage at the nurses unprofessional behaviour.\n\nCritics have called for accountability and urged health authorities to investigate the incident thoroughly.\n\nMeanwhile, others argued that the patient was very rude.\n\nBroader implications for healthcare\n\nSouth Africas healthcare system has long faced scrutiny over allegations of poor treatment and strained resources, particularly for foreign nationals seeking medical care.\n\nIn 2022, the then Limpopo Health MEC Phophi Ramathuba stirred significant controversy when a video surfaced of her telling a woman that migrants from Zimbabwe placed a huge strain on the provincial healthcare system.\n\nThis latest incident has intensified debates about the quality of service and the treatment of non-citizens in the countrys healthcare facilities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/19200045/Screenshot_20250119-215559_1.jpg",
            "description": "<p>By The South African  A ZIMBABWE patient’s encounter with South African nurses has sparked widespread debate and outrage after a video went viral on social media. The footage, allegedly recorded at a medical facility in Midrand, shows the patient demanding a transfer letter to another doctor after reportedly not receiving adequate assistance. Heated exchange over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/viral-video-of-zimbabwean-patient-and-sa-nurses-clash-sparks-outrage/\">Viral video of Zimbabwean patient and SA nurses’ clash sparks outrage </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zimbabwe’s ruling party to push for third term for President Mnangagwa",
            "url": "https://www.newzimbabwe.com/zimbabwes-ruling-party-to-push-for-third-term-for-president-mnangagwa/",
            "content": "By VOA\n\nHARARE, ZIMBABWE  Zimbabwes ruling party says it will initiate steps to amend the constitution so President Emmerson Mnangagwa can run for a third term in the 2028 elections. The opposition is strongly opposed to amending the 2013 constitution, which limited presidents to two five-year terms.\n\nIn an interview with VOA, Ziyambi Ziyambi, Zimbabwes minister of justice, legal and parliamentary affairs, said the government is ready to move forward once lawmakers introduce the bill to amend the constitution.\n\nIs there a prohibition in amending anything in the constitution? Ziyambi said. The only prohibition, the only clause that I know in the constitution, it says any electoral amendments have to be done six months before an election for that amendment to be used in the coming election. Anything else Im not aware.\n\nLovemore Madhuku, a law professor at the University of Zimbabwe and an opposition leader, said it will be difficult though not impossible for the ruling Zanu-PF party to change the constitution in time for its leader to run in the 2028 election.\n\nLegally, yes you can go through the steps, Madhuku said. The steps will require a publication of the first bill, give Zimbabweans a 90-day period to debate it. Thereafter, take it to parliament. It must get a two-thirds majority, and thereafter there must be a referendum. That alone tells you that it is very difficult. It cannot be assumed that since Zanu-PF has a two-thirds majority [in parliament], they will obtain the two-thirds majority.\n\nDouglas Mwonzora, leader of the Movement for Democratic Change party, said the MDC will campaign vehemently against the bid to have Mnangagwa stand for a third term.\n\nMwonzora, who is a lawyer, said one referendum will not suffice for Mnangagwa to stand in 2028.\n\nThey will need another referendum, Mwonzora said. This time specifically, stating whether or not President Mnangagwa must stand again and these two referendums must not be within six months of one another.\n\nWe will campaign for a no vote again not because we have anything personal against President Mnangagwa, we think that President Mnangagwa after his term should go and rest, we think its time for other leaders, so we will campaign no in that regard.\n\nBut Ziyambi said Zanu-PF will overcome all obstacles in the way of Mnangagwas third term.\n\nZanu-PF is a mass party. Our structures are to the grassroot from village level, so when we are doing resolutions, thats where they start, Ziyambi said. Its not the top leadership that say that they want anything.\n\nZiyambi said Mnangagwa said he has been clear that he wants to abide by the constitution, but the push for the resolution to allow him to run for a third term is coming from the grassroots level.\n\nPresident Robert Mugabe ruled Zimbabwe for 37 years before Mnangagwa, a former army general and Mugabes vice president took power in a 2017 coup.\n\nMnangagwa is 82 years old and is currently the fifth oldest head of state in Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By VOA HARARE, ZIMBABWE — Zimbabwe’s ruling party says it will initiate steps to amend the constitution so President Emmerson Mnangagwa can run for a third term in the 2028 elections. The opposition is strongly opposed to amending the 2013 constitution, which limited presidents to two five-year terms. In an interview with VOA, Ziyambi Ziyambi,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-ruling-party-to-push-for-third-term-for-president-mnangagwa/\">Zimbabwe’s ruling party to push for third term for President Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Late ex-VP Mphoko’s son files $500,000 lawsuit against accuser for malicious prosecution",
            "url": "https://www.newzimbabwe.com/late-ex-vp-mphokos-son-files-500000-lawsuit-against-accuser-for-malicious-prosecution/",
            "content": "By Staff Reporter\n\nSON of the late former Vice President Phelekezela Mphoko has filed a lawsuit demanding US$500,000 in damages for malicious prosecution.\n\nThe lawsuit stems from a series of allegations that Siqokoqela Mphoko had an unlawful carnal knowledge with the accusers daughter and saw Mphoko being arrested and sentenced to 20 years.\n\nIn a letter, Mphokos conviction was overturned on appeal, where the court found that the charges were baseless and motivated by malice.\n\nYou made a report to the police that our client had had unlawful carnal knowledge with your daughter, a minor. As a result of your complaint our client was arrested by the police, detained and arraigned for trial.\n\nYou gave evidence at the trial implicating our client and persisted with your allegations. Our client was, in part because of your evidence, convicted and sentenced to 20 years imprisonment.\n\nOn appeal our client was acquitted on the basis that the charges against him were fabricated and actuated by malice, reads the letter of demand.\n\nMphokos attorney claims the allegations against him went viral, causing damage to his life and the victim being a close relative to him.\n\nAs a result of the report you made and the charges which followed the matter was widely publicised in the national press and on social media platforms. Our client is a businessman of repute and a public figure.\n\nHis reputation and standing in society has been diminished in the eyes of right- thinking members of the society.\n\nThe damage are aggravated by the fact that the alleged victim is a very close relative. Our client was cast in the image of sexual predator.\n\nThe accuser will be summoned if payment arrangements are not made.\n\nIt is for the above reasons that our client makes the demand he does. Unless payment or other satisfactory arrangements are made our instructions are to issue summons against you without further notice to you, the lawyer further said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/31182752/siqokoqela-mphoko-3.jpg",
            "description": "<p>By Staff Reporter  SON of the late former Vice President Phelekezela Mphoko has filed a lawsuit demanding US$500,000 in damages for malicious prosecution. The lawsuit stems from a series of allegations that Siqokoqela Mphoko had an “unlawful carnal knowledge” with the accuser’s daughter and saw Mphoko being arrested and sentenced to 20 years. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/late-ex-vp-mphokos-son-files-500000-lawsuit-against-accuser-for-malicious-prosecution/\">Late ex-VP Mphoko’s son files $500,000 lawsuit against accuser for malicious prosecution</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "With cocktails and Snoop Dogg, crypto industry celebrates Trump inauguration",
            "url": "https://www.newzimbabwe.com/with-cocktails-and-snoop-dogg-crypto-industry-celebrates-trump-inauguration/",
            "content": "By Reuters\n\nWASHINGTON  Cryptocurrency executives swilled cocktails and danced to rap superstar Snoop Dogg on Friday night as they celebrated the approaching inauguration of President-elect Donald Trump, whose administration has promised major changes in crypto policy.\n\nAfter years of butting heads with Washington policymakers, executives from crypto companies including Crypto.com, Kraken, and Exodus partied at the first-ever crypto inauguration ball held at the 90-year-old Andrew W. Mellon Auditorium beneath towering 62-foot columns.\n\nClad in black tie and ball gowns, guests noshed on miniature lobster rolls and Trumps favored McDonalds burgers and fries, according to social media posts and two attendees who spoke to Reuters.\n\nIn addition to Snoop Dogg, the entertainment lineup featured rappers Rick Ross and Soulja Boy, the attendees said. One of many Washington celebrations ahead of Trumps Monday swearing-in, the crypto gala marks a stunning turnaround for an industry that has been in the Biden administrations crosshairs.\n\nTwo years ago, it looked to be on the brink of extinction amid the collapse of FTX. Trump, who did not attend the gala, courted crypto campaign cash with promises to be a crypto president, and is expected next week to issue executive orders aimed at reducing crypto regulatory roadblocks and promoting widespread adoption of digital assets.\n\nThere were a lot of dark years, said Les Borsai, co-founder of the crypto investment adviser Wave Digital Assets, who flew in from Los Angeles.\n\nIf this signifies what the future looks like  I think thats the optimism weve been waiting for.\n\nSwag included Make Bitcoin Great Again red baseball caps, and American flag pins with the symbol for Gemini, an event sponsor and crypto exchange founded by Cameron and Tyler Winklevoss, who backed Trumps campaign.\n\nSOLD OUT\n\nTickets sold out at $2,500 each for general admission, the balls website said, but for a cool $100,000, VIP packages provided face time with tech entrepreneur David Sacks, Trumps incoming crypto czar and the galas emcee, according to attendees and crypto media outlets.\n\nAbout 1,500 people attended. Several other officials from Trumps incoming administration were also present, the attendees said.\n\nOther sponsors included the digital asset division of Robinhood, MicroStrategy and Crypto.com, according to the event website.\n\nSponsors had cocktails named in their honor.\n\nLast night was truly a testament to how mainstream crypto has become, said JP Richardson, CEO of Exodus, which co-hosted the ball.\n\nWhile the industry was reveling, Trump on Friday night expanded his cryptocurrency interests, which already include World Liberty Financial, by launching a digital token branded with an image from his attempted assassination in July.\n\nThe price of that meme coin was around $27 by Saturday afternoon, giving it a market capitalization of about $5.5 billion, according to CoinMarketCap.\n\nWorried about fraud and money laundering, President Joe Bidens regulators cracked down on crypto companies, suing exchanges Coinbase, Binance, Kraken and dozens more in federal court.\n\nTrumps crypto policy team is taking shape, with his crypto-friendly Securities and Exchange Commission chair pick Paul Atkins expected to forge major crypto policy changes.\n\nThe crypto voter showed up in the election and this event signifies a turning point for crypto policy in the United States, Jonathan Jachym, global head of policy at Kraken, said in a statement.\n\nBitcoin, the worlds largest cryptocurrency, hit new records above $107,000 in December on excitement over Trumps policy changes.\n\nWe are proud to support the Crypto Ball  and look forward to supporting the new administration to advance innovation in digital assets, said a spokesperson for Crypto.com, adding the companys president of North America, Matt David, attended.\n\nRepresentatives for the Trump administration, Robinhood, MicroStrategy, Gemini and the events other two hosts, BTC Inc. and Stand With Crypto, did not immediately comment.\n\nSacks did not immediately return an emailed request for comment. Representatives for Snoop Dogg, Rick Ross and Soulja Boy could not immediately be reached on Saturday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/11042040/Snoop-Dogg.jpeg",
            "description": "<p>By Reuters  WASHINGTON – Cryptocurrency executives swilled cocktails and danced to rap superstar Snoop Dogg on Friday night as they celebrated the approaching inauguration of President-elect Donald Trump, whose administration has promised major changes in crypto policy. After years of butting heads with Washington policymakers, executives from crypto companies including Crypto.com, Kraken, and Exodus partied</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/with-cocktails-and-snoop-dogg-crypto-industry-celebrates-trump-inauguration/\">With cocktails and Snoop Dogg, crypto industry celebrates Trump inauguration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Stilfontein Crisis Committee considers murder charges against government over miners’ deaths",
            "url": "https://www.newzimbabwe.com/stilfontein-crisis-committee-considers-murder-charges-against-government-over-miners-deaths/",
            "content": "By lOL\n\nTHE Stilfontein Crisis Committee is mulling over charging government with murder after the bodies of more than 70 miners were brought to the surface this week.\n\nThese miners were part of a larger group that languished underground for more than two months after a stand-off with policing and mining authorities over illegal mining activities at disused mine shafts.\n\nSpeaking to Newzroom Afrika, the committees chairperson, Christopher Rutledge, accused government of making comments while the miners were underground, indicating its intention of killing them.\n\nWe are going to consider a number of routes, including charging individuals and the state with murder, he said.\n\nHe said the committee will also ask for an inquiry similar to the Life Esidimeni inquiry following the deaths of 141 mentally-challenged patients.\n\nRutledge said government had been provided with information about the miners and the conditions they were in, while underground.\n\nGovernment was provided with information that the miners in shaft 11 had no access to exit the mine.\n\nSpeaking to Newzroom Afrika, he said the only other exit was through shaft 10, and this where bodies of dead miners lay.\n\nRutledge explained that the exit through shaft 10 was dangerous as the structure itself was compromised.\n\nIt has rusty, rickety iron poles that people have to climb and if you lose your footing while climbing up almost two kilometres, you will fall down, and it is very unlikely that you will survive and be recovered. That was the one opportunity in our view that was unreasonable to expect people to exit the mine, he said.\n\nAccording to Rutledge, government was provided with clear information on the underground conditions and those trapped in shaft 11 were unable to exit without assistance.\n\nMoving forward, he said the commission will also look at seeking constitutional damages as this action was a violation of rights.\n\nAccording to police, 246 illegal miners have been rescued from the North West mine.\n\nThe operation was undertaken by different specialists health-care professionals led by acting Deputy Director General for Hospitals and Clinical Support, Agisanang Portia Tlou, Chief Director for Hospitals and Clinical Support Services Zenzo Ndabula, and Chief Director for Dr. Kenneth Kaunda district, Phil Maboe.\n\nNational police spokesperson, Colonel Athlenda Mathe, said nine illegal miners had been taken for medical check-ups while the rest were taken in police custody.\n\nThe illegal miners are from; Mozambique, Lesotho, Zimbabwe with at least five being South African.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>By lOL THE Stilfontein Crisis Committee is mulling over charging government with murder after the bodies of more than 70 miners were brought to the surface this week. These miners were part of a larger group that languished underground for more than two months after a stand-off with policing and mining authorities over illegal mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stilfontein-crisis-committee-considers-murder-charges-against-government-over-miners-deaths/\">Stilfontein Crisis Committee considers murder charges against government over miners’ deaths</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Midfield maestro Kundai Benyu makes surprise move to CAPS United",
            "url": "https://www.newzimbabwe.com/midfield-maestro-kundai-benyu-makes-surprise-move-to-caps-united/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens soccer team, Warriors midfielder, Kundai Benyu has made a surprising move to join Castle Lager Premier Soccer League (PSL) giants CAPS United.\n\nBenyu arrived in the country from the United Kingdom (UK) Saturday afternoon and was welcomed by CAPS United team being led by head coach Lloyd Chitembwe, accompanied by club legend Alois Bunjira.\n\nThe 27-year-old midfielder is seeking revival in his football career after spending the whole of last year unattached to a club in the UK, where he was plying his trade.\n\nThe UK-born midfielder signed a two-year contract, which will see him playing for the Green Machine until December 2026.\n\nMakepekepe becomes the first local topflight league side that Benyu will feature for.\n\nThe Warriors midfielder started his professional football career in the UK at Ipswich in England before moving to several clubs including Scottish giants Celtic.\n\nCAPS United is quietly going about its business during the ongoing transfer window, with the Harare-based side having also signed Ghananian goalkeeper Stephen Osai Kwaku, who comes in as a replacement to Tonderai Mateyaunga, who is now with Simba Bhora.\n\nOther than losing Mateyaunga, Makepekepe have also lost energetic defender Godknows Murwira and midfielder Kingsley Mureremba to league newcomers Scottland FC.\n\nThe team will also be without veteran players Bruce Kangwa, Ralph Kawondera and Lot Chiwunga for the 2025 league season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/19045224/IMG-20250118-WA0122.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s soccer team, Warriors midfielder, Kundai Benyu has made a surprising move to join Castle Lager Premier Soccer League (PSL) giants CAPS United. Benyu arrived in the country from the United Kingdom (UK) Saturday afternoon and was welcomed by CAPS United team being led by head coach Lloyd Chitembwe, accompanied</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/midfield-maestro-kundai-benyu-makes-surprise-move-to-caps-united/\">Midfield maestro Kundai Benyu makes surprise move to CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "JSC enlists 15 new magistrates to oil justice delivery system",
            "url": "https://www.newzimbabwe.com/jsc-enlists-15-new-magistrates-to-oil-justice-delivery-system/",
            "content": "By Staff Reporter\n\nTHE Judicial Service Commission (JSC) has sworn in 15 magistrates at the Harare Magistrates Court in a bid to ease the workload on the current staff complement.\n\nThe move, chief magistrate Vongai Guwuriro said, is part of efforts to enhance the countrys justice delivery system.\n\nThe chief magistrate said that the JSC prides in having increased the number of magistrates and opened new court stations to enhance access to justice.\n\nOf the 15 new magistrates, 12 are women while three are men.\n\nThe newly inducted judicial officers include, Moreblessing Mahaso, Nyasha Mangezi, Nyengeterai Bushu, Rufaro Musiiwa, Samantha Ruponga, Samukelisiwe Mpande, Tariro Hove and Tendai Nyagura.\n\nOthers are, Bentone Matope, Blessing Makaripe, Blessing Shumba, Daphne Maruta, Gillian Padzakashamba, Lawrence Mubvumbi and Marvellous Joma.\n\nThe newly induced magistrates pose for a photo\n\nThe recruitment of additional magistrates is expected to improve access to justice, reduce case backlogs, and enhance the overall efficiency of the countrys judiciary system.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter  THE Judicial Service Commission (JSC) has sworn in 15 magistrates at the Harare Magistrates Court in a bid to ease the workload on the current staff complement. The move, chief magistrate Vongai Guwuriro said, is part of efforts to enhance the country’s justice delivery system. The chief magistrate said that the JSC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jsc-enlists-15-new-magistrates-to-oil-justice-delivery-system/\">JSC enlists 15 new magistrates to oil justice delivery system </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "FAITH: The language of God’s operation",
            "url": "https://www.newzimbabwe.com/faith-the-language-of-gods-operation/",
            "content": "SUNDAY MORNING TABLET\n\nGood morning, dear Christian friends!\n\nToday, lets dive into the transformative power of Gods word. In Luke 5:1-11, we see Jesus instructing Peter, a seasoned fisherman, to cast his nets into the deep waters during the day.\n\nDespite the seeming foolishness of this action, Peter obeyed, acknowledging Jesus authority. It was common knowledge that fishing couldnt be done in the afternoon because fish would see the nets and wouldnt enter. This act of faith led to a miraculous catch.\n\nThe power of Gods word lies in its ability to transcend human understanding. Its not about conventional or scientific logic or reason; its about trusting in the One who speaks.\n\nAs Romans 1:17 says, The just shall live by faith. Faith is the language of Gods operation, and its the only way to please Him (Hebrews 11:6).\n\nJesus emphasizes the importance of faith in Mark 11:22-24. He tells His disciples to have faith in God and assures them that whatever they ask for in prayer, believing theyll receive it, will be theirs. This is not just a suggestion; its a command. Jesus wants us to trust Him completely, without questioning His ways.\n\nBut how do we develop this kind of faith? The answer lies in Gods word. As Psalm 119:160 says, The entirety of Your word is truth.\n\nWe must immerse ourselves in Scripture, allowing its truth to transform our minds and hearts. We must learn to trust Gods word, even when it seems foolish or contradictory to our scientific knowledge or circumstances.\n\nSo, lets approach Gods word with faith, not questioning its logic or reasonableness. Lets talk to Him through His word and prayer, trusting that He will guide us and bless us. Lets cast our nets deeper into the waters of Gods blessings, trusting in His word and His faithfulness.\n\nAs we close, remember that faith is not a feeling; its a choice. Choose to trust Gods word today, and watch Him work miracles in your life.\n\nPRAYER:\n\nDear Heavenly Father, we thank You for the power of Your word. Help us to trust in You, even when Your ways seem foolish to us. Give us the faith to take You at Your word, and may we experience the miraculous blessings that come from obeying Your instructions.\n\nMay Your word be our guide, our comfort, and our strength. In Jesus name, we pray.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/07060039/IMG-20240616-WA0009-1.jpg",
            "description": "<p>SUNDAY MORNING TABLET Good morning, dear Christian friends! Today, let’s dive into the transformative power of God’s word. In Luke 5:1-11, we see Jesus instructing Peter, a seasoned fisherman, to cast his nets into the deep waters during the day. Despite the seeming foolishness of this action, Peter obeyed, acknowledging Jesus’ authority. It was common</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/faith-the-language-of-gods-operation/\">FAITH: The language of God’s operation </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "NAMA opens voting platform for People’s Choice award",
            "url": "https://www.newzimbabwe.com/nama-opens-voting-platform-for-peoples-choice-award/",
            "content": "By Staff Reporter\n\nTHE National Arts Merit Awards (NAMA) has announced the opening of various platforms through which members of the public and journalists can vote for the Peoples Choice Award winner.\n\nIn a statement Friday, NAMA director Tinashe Kitchen said the public, journalists and other stakeholders can utilise the voting mediums to elect the most deserving practitioners pursuing diverse arts genres.\n\nThis press release serves to notify members of the press, general public, and relevant stakeholders that the 23rd Edition of the National Arts Merit Awards has officially opened its call for nominations for the NAMA Peoples Choice Award, said Kitchen.\n\nThe Peoples Choice Award is one of NAMAs most special awards as it is the only one where the people of Zimbabwe get to choose who they believe is most deserving of the accolade.\n\nZimbabwean artists from all genres (song, dance, theatre, literature, spoken word, comedy, visual arts, television, and radio) can be nominated for the Peoples Choice Award.\n\nNominations will close February 5, 2025, after which the top five nominees will be announced.\n\nTo vote, members of the public are encouraged to log on to NAMA social media platforms and thegatewaystream.comwebsite.\n\nLast years winner of the coveted award was inimitable Zimdancehall musician Wallace Chirimuko, popularly known as Winky D.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/20004947/Winky-D1.jpg",
            "description": "<p>By Staff Reporter  THE National Arts Merit Awards (NAMA) has announced the opening of various platforms through which members of the public and journalists can vote for the People’s Choice Award winner. In a statement Friday, NAMA director Tinashe Kitchen said the public, journalists and other stakeholders can utilise the voting mediums to elect the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nama-opens-voting-platform-for-peoples-choice-award/\">NAMA opens voting platform for People’s Choice award </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "After slow growth in 2024, World Bank projects 6.2% recovery for Zimbabwe economy in 2025",
            "url": "https://www.newzimbabwe.com/after-slow-growth-in-2024-world-bank-projects-6-2-recovery-for-zimbabwe-economy-in-2025/",
            "content": "By newZWire\n\nZIMBABWE could register 6.2% economic growth in 2025, after the country saw only sluggish growth of 2% last year, the World Bank says in a new report.\n\nIn June, the World Bank had forecast growth of 3.3% for 2024 and 3.6% in 2025. Its latest estimates, in the newly released annual Global Economic Prospects report, are within range of governments own estimate of 2% in 2024 and forecast of 6% in 2025.\n\nZimbabwe had banked on better rainfall to lift agriculture by 12.5% in 2025, helping the economy recover from last years drought, the worst in over 40 years.\n\nBut late rains mean agricultures anticipated recovery may be slower than expected.\n\nFinance Minister Mthuli Ncube says he will wait to the end of the farming season to see whether Zimbabwe needs to revise its 2025 growth outlook.\n\nWe will be able to assess, four months from now, as to what the output looks like and then say whether we maintain the 6% or not, Ncube says.\n\nAccording to the World Bank, growth in Sub-Saharan Africa (SSA) is projected to 4.2% in 2025-26, driven by better commodity prices.\n\nBut the bank warns that commodity exporters, like Zimbabwe, may suffer from slow growth in China, a major importer of their goods.\n\nGrowth in China could weaken more than expected, with adverse effects on the demand for minerals and metals. Lower prices for these commodities, which are the main exports of several SSA countriesmany of them low-income countrieswould hit these countries especially hard, the World Bank says.\n\nFurthermore, slower growth in China could reduce Chinese investment in SSA.\n\nSouth Africa, the regions biggest economy, grew by 0.8% last year, according to World Banks estimates. It will grow by 1.8% this year.\n\nZambia grew by 1.2% last year and will grow 6.2% in 2025 while Tanzania expanded 5.4% last year and 2025 projected growth is 5.8%.\n\nMozambique will maintain 2024 growth of 4% through this year. Botswanas 2024 growth is estimated at 1%, with a strong recovery of 5.3% expected this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/19043356/Tnash-Creative-Studios-0540-696x464-1.jpg",
            "description": "<p>By newZWire  ZIMBABWE could register 6.2% economic growth in 2025, after the country saw only sluggish growth of 2% last year, the World Bank says in a new report. In June, the World Bank had forecast growth of 3.3% for 2024 and 3.6% in 2025. Its latest estimates, in the newly released annual Global Economic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-slow-growth-in-2024-world-bank-projects-6-2-recovery-for-zimbabwe-economy-in-2025/\">After slow growth in 2024, World Bank projects 6.2% recovery for Zimbabwe economy in 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "20 Jan 2025"
        }
    ]
}