{
    "news": [
        {
            "title": "Hands off the Constitution – ZANU PF told",
            "url": "https://www.newzimbabwe.com/hands-off-the-constitution-zanu-pf-told/",
            "content": "By Darlington Gatsi\n\nOPPOSITION party leader Elizabeth Valerio has criticised the ruling party ZANU PF for pushing for the amendment of the constitution to allow President Emmerson Mnangagwa to extend his stay in office.\n\nWhile one faction of the Zanu PF is pushing for the suspension of the 2028 elections to enable President Mnangagwa to remain in power until 2030, another backing his vice Constantino Chiwenga insists on maintaining the constitutionally stipulated two-term limit.\n\nThe ruling party faction has reportedly enlisted some opposition Members of Parliament to undermine the constitution and exploit the current disarray within the opposition to push for the term extension.\n\nUnited Zimbabwe Alliance (UZA) leader Valerio emphasised that ZANU PFs internal disputes should not interfere with the countrys constitution.\n\nThe government needs to respect the Constitution of Zimbabwe. We do not, in any way, want to see a Zimbabwe where the rights of the people are being eroded. In 2028, we expect to go to the polls.\n\nWe expect to have the opportunity to register our candidates and to elect a new president for Zimbabwe. That is our constitutional right, and we are urging those in ZANU PF to keep their factional disputes to themselves. Do not involve the nation, and do not disrespect our constitutional document. It is the right of citizens to choose their leaders, said Valerio.\n\nDespite Mnangagwa refusing to endorse the extension of his rule, his supporters have been rallying to push for the constitutional amendment.\n\nHe, however, has not publicly condemned the actions of this faction within ZANU PF.\n\nValerio warned that the country should not repeat the mistake of being drawn into ZANU PFs internal politics.\n\nIt is quite unfortunate that Zimbabwe keeps going down the same path. In 2017, we were presented with an opportunity for a new future. Now, we are hearing this new mantra saying we must keep the president in power because he is doing such a great job. This is why we are launching the Community Wall Initiative. We are covering the entire country because we want to put it on record: no one wants 2030.\n\nIf you speak to the people, there are hundreds gathered here today, and they will tell you clearly that they want something different every time they go to the polls. We are no longer interested in this. As UZA, we will ensure that the voice of the citizens is on record. We will not get involved in this factional fight, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/14000014/Elisabeth-Valerio-e1686157693693.jpg",
            "description": "<p>By Darlington Gatsi OPPOSITION party leader Elizabeth Valerio has criticised the ruling party ZANU PF for pushing for the amendment of the constitution to allow President Emmerson Mnangagwa to extend his stay in office. While one faction of the Zanu PF is pushing for the suspension of the 2028 elections to enable President Mnangagwa to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hands-off-the-constitution-zanu-pf-told/\">Hands off the Constitution – ZANU PF told</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Govt makes electronic money usage compulsory for businesses",
            "url": "https://www.newzimbabwe.com/govt-makes-electronic-money-usage-compulsory-for-businesses/",
            "content": "By Alois Vinga\n\nCABINET has approved the compulsory usage of electronic money by all businesses as part of measures to fast-track the formalisation of the business sector.\n\nThis year, Zimbabwe faced the full wrath of formalisation after most big retailers who are a source of tax revenue closed shops after a prolonged era of facing unfair competition from players in the alternative market.\n\nOfficial records show that informalisation in Zimbabwe is around 65% of the Gross Domestic Product (GDP) with a huge chunk of workers being employed in the sector. Data also indicates that the informal sector has cost Zimbabwe at least US$1,15 billion in potential fiscal revenue between 2020 and 2023.\n\nUnder this framework, vendors will be licensed by local authorities in consultation with the Central Government.\n\nSpeaking at the post-cabinet briefing Tuesday, Information Minister Jenfan Muswere said, Under short-term measures, the use of electronic money will now be compulsory for all businesses and shall be achieved through the introduction of a compulsory tax payment system to ensure that every eligible taxpayer pays tax and the establishment of a Domestic Inter-agency Team to ensure informal sector compliance with tax laws.\n\nThe government seeks to bring all businesses into the tax bracket and enhance the effectiveness of the foreign exchange market.\n\nIn the long-term, the government will address the business environment to streamline fees, and charges and minimize duplication of work by Government Agencies as well as improve electricity supply in a bid to enable MSMEs to graduate into formal businesses.\n\nThe Cabinet also agreed to expedite the construction of power plants and upgrading of the distribution network to enhance the availability of electricity, incentivise the use of alternative energy sources, and expedite social protection coverage to the informal sector.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/22053126/what-is-pos-machine-works.jpg",
            "description": "<p>By Alois Vinga CABINET has approved the compulsory usage of electronic money by all businesses as part of measures to fast-track the formalisation of the business sector. This year, Zimbabwe faced the full wrath of formalisation after most big retailers who are a source of tax revenue closed shops after a prolonged era of facing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-makes-electronic-money-usage-compulsory-for-businesses/\">Govt makes electronic money usage compulsory for businesses </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zimbabwe begins compensation of BIPPA protected ex-white farmers with US$20 million set aside in 2024 National Budget; AfDB says payouts will improve investor confidence",
            "url": "https://www.newzimbabwe.com/zimbabwe-begins-compensation-of-bippa-protected-ex-white-farmers-with-us20-million-set-aside-in-2024-national-budget-afdb-says-payouts-will-improve-investor-confidence/",
            "content": "By Alois Vinga\n\nFINANCE and Investment Promotion Minister, Mthuli Ncube has announced the beginning of compensation payments to farmers under the US$20 million facility set aside in the 2024 National Budget.\n\nThe compensation exercise targets investors protected by the Bilateral Investment Protection and Promotion Agreements (BIPPAs) whose investments were affected by the Land Reform Program in 2000.\n\nThe claimants under the category are from Denmark, Germany, the Netherlands, Switzerland and former Yugoslavia.\n\nI am pleased to announce that the compensation process has begun. We believe that this process is crucial for building Trust, honoring commitments and ensuring consistency with our Constitution as we address Zimbabwes debt challenge.\n\nThe payments towards the compensation of investors under BIPPA Protection began in the second week of January 2025.Payments is being made to the claimants bank accounts of choice, said Ncube.\n\nThe envoys of Germany, the Netherlands and Switzerland jointly welcomed the announcement describing it as a giant step bringing a sense of closure among the affected parties.\n\nThe framework established by the Government of Zimbabwe leading to the full compensation of affected BIPPA farmers protected by BIPPA Agreements is indeed a historic achievement. We commend the governments allocation of funds in the National Budget as of 2024 to make the compensation a reality.\n\nSeveral affected investors have received initial payouts, and an emerging sense of closure exists.It marks a significant milestone and we consider it a very encouraging step towards a comprehensive and fair settlement for farmers and investors in Zimbabwe, the ambassadors said in a statement.\n\nThe President of the African Development Bank (AfDB) and the champion of the Zimbabwe Arrears clearance and Debt resolution, Dr Akinwumi Adesina hailed the milestone achievement and implored more development partners to support the initiative.\n\nThe compensation demonstrates the governments goodwill and commitment to building trust in the process and improving in the country. The progress Zimbabwe has made, the commitment and resilience it is showing, calls for support from development partners to facilitate the countrys efforts in implementing ongoing reforms and to provide the much-needed cushion to particularly the vulnerable members of the population, he said.\n\nIn 2022, the Government of Zimbabwe established a Structured Dialogue Platform with all its creditors and development partners to institutionalize engagement on economic and governance reforms to underpin the Arrears clearance and Debt Resolution Process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga FINANCE and Investment Promotion Minister, Mthuli Ncube has announced the beginning of compensation payments to farmers under the US$20 million facility set aside in the 2024 National Budget. The compensation exercise targets investors protected by the Bilateral Investment Protection and Promotion Agreements (BIPPAs) whose investments were affected by the Land Reform Program</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-begins-compensation-of-bippa-protected-ex-white-farmers-with-us20-million-set-aside-in-2024-national-budget-afdb-says-payouts-will-improve-investor-confidence/\">Zimbabwe begins compensation of BIPPA protected ex-white farmers with US$20 million set aside in 2024 National Budget; AfDB says payouts will improve investor confidence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Harare men locked up for stealing seven ostriches",
            "url": "https://www.newzimbabwe.com/harare-men-locked-up-for-stealing-seven-ostriches/",
            "content": "By Staff Reporter\n\nTwo Harare men landed in the dock on allegations of stealing seven ostriches from Haka Game Park in Harare.\n\nThe two are Wisdom Supayi and Francis Office both from Mabvuku.\n\nThey appeared before Harare magistrate Isheanesu Matova charged with three stock theft counts.\n\nThe two will be back in court Wednesday for their bail application.\n\nIt is Sthe tates case that the ostriches are valued at US$7,000.\n\nProsecutor Rufaro Chonzi alleges that on 3 February 2025 at around 0130 hours, the two accused persons together with the other four accomplices who are still at large went to Haka Game Park.\n\nThe court heard they scaled the security fence and gained entry into the ostrich pen.\n\nIt is alleged that they killed four ostriches using a log and went away with the carcasses unnoticed.\n\nA police report was made.\n\nThey went back again on February 7, killed another ostrich and left unnoticed.\n\nThe court heard that on 9 February 2025 at around 1200 hours, the two accused persons and their four accomplices who are still at large went back again and used the same modus operandi to gain entry into the park.\n\nThey allegedly killed two ostrichesbut were spotted by security guards who fired at them.\n\nSupayi and his accomplices managed to escape leaving behind the ostrich carcasses and that is when a police report was made.\n\nAn investigation led to the arrest of Supayi at his place of residence and he had gunshot wounds on both legs.\n\nOstrich feathers were recovered from the accuseds house. Supayi indicated that he was shot in Haka Game Park where they were found killing Ostriches using a log and he implicated Office who was later arrested.\n\nParks and Wildlife official was summoned to CID MFFU Harare and proceeded Haka Game Park where he assayed, examined the killed birds and identified as two ostriches valued at US$ 2,000.\n\nHe also assayed the feathers were recovered at the houses of the two accused persons and identified them as ostrich feathers, the State alleges further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/11163156/Ostriches-1280x853-2.webp",
            "description": "<p>By Staff Reporter Two Harare men landed in the dock on allegations of stealing seven ostriches from Haka Game Park in Harare. The two are Wisdom Supayi and Francis Office both from Mabvuku. They appeared before Harare magistrate Isheanesu Matova charged with three stock theft counts. The two will be back in court Wednesday for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-men-locked-up-for-stealing-seven-ostriches/\">Harare men locked up for stealing seven ostriches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zimbabwe’s gold coins sell for record $3,000 as bullion surges",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-coins-sell-for-record-3000-as-bullion-surges/",
            "content": "Bloomberg\n\nZimbabwes gold coins sold above $3 000 for the first time since they were introduced almost three years ago as the price of bullion surged.\n\nThe 22-carat Mosi-Oa-Tunya gold coins, named after Victoria Falls, a popular tourist destination in southern Africa, were priced at $3 018.38, according to data on the Reserve Bank of Zimbabwes website Monday. Spot gold rose to a record $2 911.72 an ounce after US President Donald Trump said he plans to impose 25% tariffs on steel and aluminium imports.\n\nThe coins have been snapped up by institutional investors and ordinary citizens seeking a store of value against high inflation and frequent currency crises.\n\nThe bulk of the coins were bought using the Zimbabwean dollar, which was replaced by the ZiG in April, after it lost 80% of its value against the greenback in just under four months.\n\nGovernor John Mushayavanhu said in July the central bank would stop minting the coins to boost its gold reserves used to back the ZiG. At the end of January, the southern African nation held about 2.67 tons of gold, the governor said.\n\nHolders of the gold coins can still redeem them at the central bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/21142401/gold-coins.webp",
            "description": "<p>Bloomberg Zimbabwe’s gold coins sold above $3 000 for the first time since they were introduced almost three years ago as the price of bullion surged. The 22-carat “Mosi-Oa-Tunya” gold coins, named after Victoria Falls, a popular tourist destination in southern Africa, were priced at $3 018.38, according to data on the Reserve Bank of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-coins-sell-for-record-3000-as-bullion-surges/\">Zimbabwe’s gold coins sell for record $3,000 as bullion surges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zuma orders daughter to apologise for online rant against MK Party secretary-general Shivambu",
            "url": "https://www.newzimbabwe.com/zuma-orders-daughter-to-apologise-for-online-rant-against-mk-party-secretary-general-shivambu/",
            "content": "News24\n\nIn his capacity as MK Party (MKP) leader, Jacob Zuma has demanded an apology from Duduzile Zuma-Sambudla  his daughter  after she posted remarks on social media about the partys secretary-general, Floyd Shivambu.\n\nShe has since been told to issue a public apology or face disciplinary action.\n\nIn a series of X posts, Zuma-Sambudla lashed out at Shivambu, describing him as useless and the worst thing that happened to MK, drawing the wrath of the party in the process.\n\nIn a party statement, MKP said it acknowledges the recent public posts on X made by MK member, Commander Duduzile Zuma.\n\nThese posts are insulting towards the secretary-general of uMkhonto weSizwe Party, constituting a direct violation of the partys disciplinary code of conduct. Such actions are unacceptable, divisive, denigrating, and offensive. They undermine the principles of unity, respect, and discipline that are fundamental to the values of uMkhonto weSizwe Party, it stated.\n\nIt said Zuma issued a directive demanding that Zuma-Sambudla issue an unconditional public apology to the secretary-general, the president, members, supporters of uMkhonto weSizwe, and all the people of South Africa.\n\nIt also ordered that she extend formal apologies to all structures she serves in or leads, including the Southern Caucus of the Pan-African Parliament.\n\nThese apologies must be made immediately. Following this, an internal disciplinary process will be initiated in accordance with the uMkhonto weSizwe Party constitution, code of conduct and all relevant prescripts, the party said.\n\nFailure to comply with this directive will result in immediate consequences, including the summary termination of Commander Duduzile Zumas membership in uMkhonto weSizwe Party and her recall from all party responsibilities.\n\nShivambu retweeted the party statement, but issued no response in his personal capacity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30053914/DUDUZILE-ZUMA.webp",
            "description": "<p>News24 In his capacity as MK Party (MKP) leader, Jacob Zuma has demanded an apology from Duduzile Zuma-Sambudla – his daughter – after she posted remarks on social media about the party’s secretary-general, Floyd Shivambu. She has since been told to issue a public apology or face disciplinary action. In a series of X posts,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zuma-orders-daughter-to-apologise-for-online-rant-against-mk-party-secretary-general-shivambu/\">Zuma orders daughter to apologise for online rant against MK Party secretary-general Shivambu</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Super Bowl Halftime Show dancer gets NFL lifetime ban for displaying Palestinian flag during performance",
            "url": "https://www.newzimbabwe.com/super-bowl-halftime-show-dancer-gets-nfl-lifetime-ban-for-displaying-palestinian-flag-during-performance/",
            "content": "The Algemeiner\n\nA dancer in Kendrick Lamars Super Bowl LIX Halftime Show has been banned for life from all National Football League stadiums and events for waving a combined Palestinian-Sudanese flag with the words Gaza and Sudan during the rappers performance on Sunday night at Caesars Superdome in New Orleans.\n\nThe NFL said the African American protester, who has not been identified, concealed the flag and unveiled it without prior knowledge by the shows production team.\n\nWe commend security for quickly detaining the individual who displayed the flag, the NFL said in a released statement. He was a part of the 400-member field cast. The individual hid the item on his person and unveiled it late in the show. No one involved with the production was aware of the individuals intent. The league added that the individual will banned for life from all NFL stadiums and events.\n\nToward the end of Lamars performance  after his track Not Like Us and right before his final song TV Off  the dancer waved the flag while standing on top of a car used as a prop in the performance. The car, a Buick Grand National GNX, inspired the name of Lamars latest album, GNX, and it was a key prop in the rappers halftime show performance.\n\nSudan and Gaza were written on the white sections of the flag held by the protester. A heart was drawn next to Sudan and a solidarity fist was depicted next to the word Gaza. The dancer, who wore a black ensemble matching the other dancers on stage, alsojumped off the carand fled the stage while still displaying the flag. He waved it while standing on the ground near other dancers before security personnel tackled and detained him. He was then removed from the field and escorted from the stadium. New Orleans police toldUSA Todaythat as of Monday, the performer has not been formally arrested or charged.\n\nThe incident took place a day after three more Israeli hostages were freed from Hamas captivity in Gaza, as part of a ceasefire agreement in the war between the terrorist organization and Israel, and while a civil war rages on in Sudan.\n\nThe New Orleans Police Department said it continues to work with NFL and the halftime production team to ascertain any affiliation the individual may have had with the halftime show.\n\nThe entertainment company behind the halftime show, Roc Nation, said in a statement that the act by the individual was neither planned nor part of the production and was never in any rehearsal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/11094437/superbowl-.jpg",
            "description": "<p>The Algemeiner A dancer in Kendrick Lamar’s Super Bowl LIX Halftime Show has been banned for life from all National Football League stadiums and events for waving a combined Palestinian-Sudanese flag with the words “Gaza” and “Sudan” during the rapper’s performance on Sunday night at Caesars Superdome in New Orleans. The NFL said the African</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/super-bowl-halftime-show-dancer-gets-nfl-lifetime-ban-for-displaying-palestinian-flag-during-performance/\">Super Bowl Halftime Show dancer gets NFL lifetime ban for displaying Palestinian flag during performance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Mbuyiseni Ndlozi resigns from EFF, announces ambition to join civil society",
            "url": "https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-from-eff-announces-ambition-to-join-civil-society/",
            "content": "TimesLive\n\nFormer EFF MP Mbuyiseni Ndlozi has announced his decision to leave the EFF and politics.\n\nThis comes months after speculation about his fallout with party leader Julius Malema.\n\nIn an interview with the SABC, Ndlozi expressed his desire to contribute to academia, leveraging on his educational background.\n\nI have taken a decision to step away from party politics, he said.\n\nI have left the EFF. I have left party politics. I have handed over my resignation as a member and it is because where I want to go and contribute, I cant hold a single party membership.\n\nIn January the EFF announced Ndlozi had resigned from parliament.\n\nIm passionate about the upliftment of the levels of discourse in the country but most importantly I think the terrain of struggle that has been neglected over the years is the civil society space. Im interested in it because it is where you are able to cultivate and agitate the notions of freedom, where liberation is about the people, community development, research, advocacy.\n\nIts time somebody did for the people of this country what AfriForum is doing for the Afrikaners.\n\nNdlozis resignation from the EFF follows that of prominent members, including former deputy leader Floyd Shivambu, who left last year to join Jacob Zumas MK Party.\n\nNdlozi confirmed he was suspended after he was charged by the EFF on allegations of being part of the MK Partys infiltration strategy and not informing the leadership about Shivambus intention to leave the party.\n\nHe said he couldnt attend the conference of the EFF due to a dispute over his suspension, after being served with a suspension notice six weeks before the elective conference in December.\n\nHe said the suspension was unconventional in that it didnt rely on the code of conduct of the EFF.\n\nI was told to stay at home, cease my participation in parliament and the rest of the activities of the EFF. It was important for me because they said the investigation was still ongoing and when the investigation was finished I would be given an opportunity to respond to the allegations.\n\nI think we can agree these are dangerous and serious allegations. Later, the leadership argued the report would only be ready after conference and the matter has been referred to the leadership after the conference. It seemed fair for me to wait to clear my name so I did not function with a dark cloud over my head or a gun in my face.\n\nHe also confirmed he knew about Shivambus departure but believed it wasnt his place to inform the leadership.\n\nI knew about the departure of Floyd. He came to tell me of his consideration and I told him he would have to take the leadership into [his] confidence, and he did.\n\nThe idea that I should have run behind his back and informed other people or the leadership suggested Im an informant, a gossiper or a wedge driver. I am none of those.\n\nIt was Floyds decision; he had to communicate it. It was not my decision, he had to communicate it and he did.\n\nHe made it clear he never intended to join Zumas party.\n\nI never planned to join the MK Party, I still dont. I never worked with anybody in the MK Party in relation to some conspiracy about my departure. Whatever information they say they have was based largely on lies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/11054437/mbuyiseni.jpg",
            "description": "<p>TimesLive Former EFF MP Mbuyiseni Ndlozi has announced his decision to leave the EFF and politics. This comes months after speculation about his fallout with party leader Julius Malema. In an interview with the SABC, Ndlozi expressed his desire to contribute to academia, leveraging on his educational background. “I have taken a decision to step</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-from-eff-announces-ambition-to-join-civil-society/\">Mbuyiseni Ndlozi resigns from EFF, announces ambition to join civil society</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Sables to host United Arab Emirates ahead of Rugby Africa Cup",
            "url": "https://www.newzimbabwe.com/sables-to-host-united-arab-emirates-ahead-of-rugby-africa-cup/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens rugby team is set to host the United Arab Emirates this year as part of its preparations for the Rugby Africa Cup.\n\nSables match against UAE willbe played on May24in Harare.\n\nZimbabwe will use the match as part of its preparations for the Rugby Africa Cup, where they will be hoping to defend the title.\n\nWinners of this years Rugby Africa Cup will automatically qualify for the 2027 World Cup.\n\nWe are going to play United Arab Emirates here on the 24th of May.\n\nThis is one of the many test games that our team will play ahead of Rugby Africa Cup.\n\nThis year, Africa Cup comes with a ticket to the World Cup. Hence, we have to up our preparations, said Zimbabwe Rugby Union president Losson Mtongwiza.\n\nSables had a successful tour inUnited Arab Emirates in November last year, beating the host to record their first victory outside the African continent.\n\nOther than playing UAE, the president added that they have lined up several games as part of preparations for Rugby Africa Cup.\n\nWe are also going to play Zambia, then Botswana and from there we will play one of the elite clubs in South Africa.\n\nThese are part of the games we have confirmed, but still, we are working to secure more, Mtongwiza added.\n\nZimbabwe mens rugby team had a good 2024 season, which saw them winning the Rugby Africa Cup to end a 12-year jinx.\n\nHowever, the greater task is awaiting this year, which is for them to qualify for the World Cup and mark their return since 1991.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/26074443/Losson-Pic2-1-696x1149-1-e1724150059820.jpg",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s rugby team is set to host the United Arab Emirates this year as part of its preparations for the Rugby Africa Cup. Sables’ match against UAE will be played on May 24 in Harare. Zimbabwe will use the match as part of its preparations for the Rugby Africa Cup, where they will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-to-host-united-arab-emirates-ahead-of-rugby-africa-cup/\">Sables to host United Arab Emirates ahead of Rugby Africa Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        },
        {
            "title": "Double-digit US$ inflation figure a cause for concern- Industry says",
            "url": "https://www.newzimbabwe.com/double-digit-us-inflation-figure-a-cause-for-concern-industry-says/",
            "content": "By Alois Vinga\n\nA double-digit US$ inflation rate is cause for concern considering the economy is already highly dollarized, industry lobby group Confederation of Zimbabwe Industries (CZI) has said.\n\nZimbabweis battling to maintain sustainable inflation rates with a series of measures being implemented time and again to achieve the goal.\n\nLast year, the Reserve Bank of Zimbabwe (RBZ) introduced the ZWG currency  a minerals and foreign currency backed local unit and presented it as the lasting solution to decades-old currency problems.\n\nSix months after its introduction,the ZWG sufferedmassive depreciation against the greenback on the alternative market. The central bank was forced to swallow the bitter pill after intervening by unilaterallydeclaring a 43% devaluation rate in a bid to align with realistic market trends.\n\nHowever, inflationary rates published by the Zimbabwe National Statistics Agency (Zimstat) last month indicated that the countrys safe-haven, the US$ endured severe inflation blows after the year-on-year US$ inflation rate for January 2025 jumped to 14.6%, thereby gaining 12,1% from a rate of 2,5% in December 2024.\n\nAgainst the background, double-digit USD inflation under a highly dollarized environment is a cause for concern, as prices are generally expected to be stable in USD terms, the industry grouping inflation tracker said.\n\nRecords show that US$ inflation rate has been stable since January 2021 with current trends departing from the years long gains.\n\nIn Zimbabwe, US$ inflation is normally a response to ZWG inflation, as retailers adjust their prices in line with ZWG prices to avoid being accused by the RBZs Financial Intelligence Unit (FIU) for using the parallel market rates, the CZI analysis said.\n\nThe US$ month-on-month inflation began the year at a higher rate of about 11,5% for January 2025, which is an all-time high rate over the past four years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>By Alois Vinga A double-digit US$ inflation rate is cause for concern considering the economy is already highly dollarized, industry lobby group Confederation of Zimbabwe Industries (CZI) has said. Zimbabwe is battling to maintain sustainable inflation rates with a series of measures being implemented time and again to achieve the goal. Last year, the Reserve Bank</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/double-digit-us-inflation-figure-a-cause-for-concern-industry-says/\">Double-digit US$ inflation figure a cause for concern- Industry says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "12 Feb 2025"
        }
    ]
}