{
    "news": [
        {
            "title": "Sponsored lies – Chamisa dismisses claims he is forming new party",
            "url": "https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has dismissedas sponsored liessocial media rumours suggesting he is launching a new movement at the end of this month.\n\nSince his resignation as Citizens Coalition for Change (CCC)president in January 2024, following what he described as the hijacking of his party by Zanu PF,Chamisa has kept both supporters and opponents guessing over his next move.\n\nChamisa has repeatedly emphasised that he has not left politics but was forced to abandon the CCC due to its takeover.\n\nIn recent days, social media has been awash with flyers claiming Chamisa has launched a new party.\n\nIgnore these lies and falsehoods, Chamisa posted on his X account.\n\nOverwhelmed and flooded by calls from anxious, restless and expectant citizens. Disregard these sponsored lies from scared propagandists.\n\nA new nation founded on love, Zimbabwe shall be a new and great nation governed by love, truth and justice, not hate, violence, lies, deceit and corruption.\n\nLove is the missing essential! Love is the foundation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/21132503/DSC06267-copy-scaled.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has dismissed as “sponsored lies” social media rumours suggesting he is launching a new movement at the end of this month. Since his resignation as Citizens Coalition for Change (CCC) president in January 2024, following what he described as the hijacking of his party by Zanu PF, Chamisa has kept both supporters</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/\">Sponsored lies – Chamisa dismisses claims he is forming new party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "Don’t panic over army unit on field training exercise— ZNA diffuses fears of a “signal”",
            "url": "https://www.newzimbabwe.com/dont-panic-over-army-unit-on-field-training-exercise-zna-diffuses-fears-of-a-signal/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe National Army (ZNA) has announced that one of its units will be on a routine field exercise in Harares suburban areas.\n\nIn a press statement, ZNA Director of Public Relations, Colonel Hlengiwe Dube, said troops will conduct training exercises in public spaces, although these will not affect the publics daily routines.\n\nThe ZNA wishes to inform the general public that one of its units is conducting a field training exercise in Harare during the period 03 to 06 June 2025.\n\nThe training exercise will be carried out in the general areas of Glenview, Glen Norah, Kuwadzana, Dzivarasekwa, Mt Hampden and Westgate. The road to be used during the exercise is Solomon Mujuru, formerly known as Kirkman Road, Dube said.\n\nThe army spokesperson reiterated that the exercise will be conducted during the day and the public is, therefore, urged to remain calm.\n\nThe public is therefore requested not to panic as the training exercise is part of routine training by ZNA units, added Col Dube.\n\nThe preemptive move was ostensibly timed conveniently to counter the misconception that the drill was a signal for masses to take to the streets in protest against President Emmerson Mnangagwas government, as hoped for by war veteran Blessed Bombshell Runesu Geza.\n\nGeza has on numerous broadcasts vaguely stated that a signal shall come at the appropriate time and Zimbabweans must march in the streets demanding Mnangagwas exit on accusations of a slew of charges, including grand corruption.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/19120420/WhatsApp-Image-2025-02-19-at-14.03.32.jpeg",
            "description": "<p>By Staff Reporter THE Zimbabwe  National Army (ZNA) has announced that one of its units will be on a routine field exercise in Harare’s suburban areas. In a press statement, ZNA Director of Public Relations, Colonel Hlengiwe Dube, said troops will conduct training exercises in public spaces, although these will not affect the public’s daily</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-panic-over-army-unit-on-field-training-exercise-zna-diffuses-fears-of-a-signal/\">Don’t panic over army unit on field training exercise— ZNA diffuses fears of a “signal”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "Oreo maker sues Aldi in US over ‘copycat’ packaging",
            "url": "https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/",
            "content": "BBC\n\nThe corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of blatantly copying the packaging of its famous snacks.\n\nCourt documents showed that Mondelz International said Aldi uses similar packaging likely to deceive consumers and ride the coattails of the companys attraction, fame and prestige.\n\nThe snack giant also is behind Wheat Thins, Nutter Butter, Chips Ahoy!, and Ritz  all products the company accuses Aldi of copying with its discount versions.\n\nAldi US didnt respond to the BBCs request for comment, but its British counterpart stressed that it is not involved in the lawsuit.\n\nA spokesperson for Aldi UK told the BBC, that they are under the same ownership but operate as completely separate businesses.\n\nMondelz, which submitted the lawsuit in May, said it had reached out to Aldi several times about the confusingly similar packaging.\n\nAlthough Aldi did discontinue or alter the packaging of some products, the supermarket has continued making unacceptable copies, the lawsuit stated.\n\nThe company claimed that if Aldi is allowed to continued with its product lines, it will irreparably harm the Mondelz brand.\n\nThe lawsuit included side-by-side pictures comparing the appearances of Mondelz product with Aldis.\n\nMondelz lawsuit The snack giant included side-by-side pictures of their products (L) next to Aldis biscuit brands (R)\n\nIn the lawsuit, Aldi is accused of trademark infringement, unfair competition and unjust enrichment. Mondelz said it is seeking damages.\n\nMondelz described Aldis business model as hinging on low-priced private label products that resemble the look and feel of well-known brands.\n\nAldi, which has its headquarters in Germany, is known as a discount supermarket offering affordable alternatives to well-known brands.\n\nThere are over 2,500 Aldi shops in the US.\n\nThis is not the first time Aldi has been embroiled in a trademark battle. Earlier this year, it lost a battle with Cider producers Thatchers, which accused the supermarket of copying its drink in taste and appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04041224/oreo.webp",
            "description": "<p>BBC The corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of “blatantly” copying the packaging of its famous snacks. Court documents showed that Mondelēz International said Aldi uses similar packaging likely to “deceive” consumers and “ride the coattails” of the company’s “attraction, fame and prestige”. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/\">Oreo maker sues Aldi in US over ‘copycat’ packaging</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "Scotts Maphuma faces backlash for missing major children’s festival in Mozambique",
            "url": "https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/",
            "content": "IOL\n\nAmapiano artistScotts Maphuma, real name Mpho Lebajoa,is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform.\n\nThe ShayiMoto singer was set to perform in the country over the weekend at an annual Childrens Day festival in Matola, Mozambique.\n\nHowever, he did not show up to the event, and he later discovered that things work differently in Mozambique, finding himself in trouble with the local authorities.\n\nIt all started when a video of the artist in a police holding cell circulated on social media and sparked mixed reactions as well as questions from fans.\n\nLocal reporters from Mz Magazine News posted the video on their Instagram with a caption that reads: Scotts Maphuma  levado a esquadra por no ter chegado a tempo de actuar.\n\nIt translates to: Scotts Maphuma is taken to the police station for not arriving on time to perform.\n\nMaphuma was meant to headline the Childrens Day festival on Sunday, June 1, at an event known as Lizha s festas in Matola, a vibrant Mozambican suburb.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/09064854/scotts.webp",
            "description": "<p>IOL Amapiano artist Scotts Maphuma, real name Mpho Lebajoa, is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform. The “Shayi’Moto” singer was set to perform in the country over the weekend at an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/\">Scotts Maphuma faces backlash for missing major children’s festival in Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "High Court trashes stepson’s US$60,000 lawsuit against 70-year-old widow",
            "url": "https://www.newzimbabwe.com/high-court-trashes-stepsons-us60000-lawsuit-against-70-year-old-widow/",
            "content": "By Staff Reporter\n\nHIGH Court judge Justice Christopher Dube-Banda has dismissed an application against a Murewa widow who was being sued US$60,000 for malicious prosecution by her stepson.\n\nThe complainant in the case, Collin Benyure, was suing his stepmother, Anna Benyure, claiming US$$20,000 for emotional stress, US$$30,000 for damages to his reputation, and US$10,000 for legal costs incurred during the prosecution.\n\nThe widowdid not file a notice to defend, resulting in the matter being set down on the unopposed roll.\n\nThe judge dismissed the claim, ruling that Collin had no evidence to support his claim.\n\nThe declaration stated that on 8 May 2024, Anna falsely claimed that the plaintiff, Collin, destroyed her seven-roomed house at Benyure homestead, Nyamakosi Village, Mutoko.\n\nThe court heard Collin was subsequently charged with the crime of contravening s 140 of the Criminal Law [Codification and Reform] Act [Chapter 9:23].\n\nHe was subsequently arrested before he was later cleared, resulting in him filing the present application.\n\nIn casu, in her statement to the police, Anna stated that on 8 May 2004, she received an anonymous call informing her that the plaintiff had demolished her house.\n\nOn the same day, she passed through the homestead and saw that indeed her seven-roomed, unroofed house had been demolished.\n\nThis is the information the defendant provided to the police.\n\nShe mentioned the plaintiff only as a suspect and informed the police that she did not seehimdemolishing the house.\n\nThe court heard she was candid that her information was based on an anonymous call she received.\n\nOn the premise of that account and the investigations, the police arrested and preferred a charge against the plaintiff.\n\nIn dismissing Collins claim, the judge said the decision to arrest and charge the plaintiff was exclusively that of the police.\n\nThe question whether she had a right or not to build a house at the homestead does not arise in this matter. It is irrelevant. The point is that she had a house at the Benyure homestead. Her house was demolished, and this is what she reported to the police. The conduct of the defendant cannot be said to amount to an active instigation of criminal proceedings, said the judge.\n\nIn addition, the judge said Collins affidavit of evidence merely recycles the contents of the summons and declaration.\n\nSuch is unhelpful. The allegation that the defendant made a false statement is not in sync with the facts of this case.\n\nThe demolished house was at the centre of the case; the police could not have arrested, and the prosecution could not have prosecuted the plaintiff if there had been no demolished house. There was a demolished house.\n\nBanda said there is no evidence that, besides giving information to the police, the defendant proceeded to lay a charge and was overbearing on the police to institute proceedings when they would not have otherwise done so.\n\nThe defendant in this case confined herself to giving information on what she believed transpired.\n\nHe said malice may be inferred from the absence of reasonable and probable cause to commence or continue a prosecution.\n\nIn other words, a want of reasonable and probable cause may be evidence of malice, where the court may conclude that there was no honest belief in the accusation made. In casu, there is no evidence of malice.\n\nIn other words, the plaintiff has not proved an absence of reasonable and probable cause operating on the mind of the defendant. Therefore, the plaintiff failed to prove the aspect of malice in the context of a claim for malicious prosecution, the court ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter HIGH Court judge Justice Christopher Dube-Banda has dismissed an application against a Murewa widow who was being sued US$60,000 for malicious prosecution by her stepson. The complainant in the case, Collin Benyure, was suing his stepmother, Anna Benyure, claiming US$$20,000 for emotional stress, US$$30,000 for damages to his reputation, and US$10,000 for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-trashes-stepsons-us60000-lawsuit-against-70-year-old-widow/\">High Court trashes stepson’s US$60,000 lawsuit against 70-year-old widow</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "Pitbull owner was bullheaded – neighbours say as family demands justice following fatal dog attack on relative",
            "url": "https://www.newzimbabwe.com/pitbull-owner-was-bullheaded-neighbours-say-as-family-demands-justice-following-fatal-dog-attack-on-relative/",
            "content": "By Staff Reporter\n\nA Harare family is demanding justice after the death of Samuel Machara, who was fatally attacked by a pitbull over the weekend.\n\nMachara was killed in Bluffhill, becoming the latest victim of the vicious dog in recent months.\n\nThe Machara family came face to face with the dogs owner, Mike Mupinga, who is facing a culpable homicide charge when he appeared at Harare Magistrates Court on Tuesday.\n\nHe will remain locked up after his bail ruling was moved to Friday.\n\nAccording to Bluffhill residents, three pitbulls belonging to a negligent Mupinga had become a menace.\n\nMike is arrogant. We filed a lot of complaints regarding the problems and risks posed by his dogs. Unfortunately, the more you reprimanded him, the more he would show his arrogant side, said one neighbour.\n\nWhen NewZimbabwe.com visited Bluffhill, a ramshackle kennel in which Mupinga kept his four dogs, the perimeter wall too short to secure the dangerous animals.\n\nEfforts to lobby authorities over the viciousness of the pitbulls fell on deaf ears, with officials turning a blind eye to Mupinga.\n\nElijah Machara, who was the first to find his uncles body, said the death had shaken the family.\n\nI was told by a neighbour to come and check on an unconscious body. When I got closer, I found Uncle Samuel dead. He had a deep cut on his neck, and my worst fear became reality  he was dead, said Machara.\n\nMachara is the latest victim in a rising number of fatal pitbull attacks, raising concerns about the safety and coexistence of pitbulls and people.\n\nAn estimated 12 countries worldwide have banned pitbull ownership, and there are growing calls for Zimbabwe to impose similar restrictions.\n\nHarare Mayor Jacob Mafume, in a social media post, said the City Council is working on regulating pitbulls.\n\nWe have raised concerns. We will explore whether, as council, we can stretch our mandate. Our position is that such dogs are dangerous and must be banned or strictly regulated  like how one would regulate a firearm, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04031421/mike-mupinga.jpg",
            "description": "<p>By Staff Reporter A Harare family is demanding justice after the death of Samuel Machara, who was fatally attacked by a pitbull over the weekend. Machara was killed in Bluffhill, becoming the latest victim of the vicious dog in recent months. The Machara family came face to face with the dog’s owner, Mike Mupinga, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pitbull-owner-was-bullheaded-neighbours-say-as-family-demands-justice-following-fatal-dog-attack-on-relative/\">Pitbull owner was bullheaded – neighbours say as family demands justice following fatal dog attack on relative</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "Zimbabwe coach backs Proteas for WTC glory",
            "url": "https://www.newzimbabwe.com/zimbabwe-coach-backs-proteas-for-wtc-glory/",
            "content": "SABC News\n\nZimbabwe head coach Justin Sammons has thrown his weight behind South Africa as they continue their preparations for the World Test Championship Final against Australia.\n\nThe South African, who was appointed as the head coach of The Chevrons in June last year, will lead his team in a one-off four-day match against the Proteas at the Arundel Castle Cricket Ground.\n\nThe Proteas are using this game as a final warm-up before facing the Aussies. Sammons says the two teams will go into that match on an equal footing.\n\nI think South Africa have a great chance of taking that World Test Championship final. Two evenly matched teams. Its going to be a really good game and ultimately it will be decided by the batting unit that can fare best against two quality bowling attacks, he predicted.\n\nThe former Proteas batting consultant is also quite excited to be facing his native nation over the next few days.\n\nThis will also serve as good preparation for the official test series that the neighbours will play at the end of this month in Bulawayo.\n\nThe next four days against South Africa offer our team an amazing opportunity to prepare for what promises to be an exciting and challenging winter, with two tests against the same team and another two against New Zealand.\n\nSo the guys are really looking forward to the challenge and obviously the learnings that will come from it.\n\nIt is good for this group and for Zimbabwean cricket in general that theres so much test cricket available for them this year and obviously towards the end of last year. Its where your fundamentals are tested, and as a young group of players, its where youre going to take the greatest amount of learnings, concluded Sammons.\n\nZimbabwe played a one-off test match against England almost two weeks ago, and were ruthlessly beaten by an innings and 45 runs.\n\nThe coach admitted that the occasion got the better of his team, and says that there was a lot of anxiety among the players.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/20085613/FB_IMG_1718829092641.jpg",
            "description": "<p>SABC News Zimbabwe head coach Justin Sammons has thrown his weight behind South Africa as they continue their preparations for the World Test Championship Final against Australia. The South African, who was appointed as the head coach of The Chevrons in June last year, will lead his team in a one-off four-day match against the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-coach-backs-proteas-for-wtc-glory/\">Zimbabwe coach backs Proteas for WTC glory</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "The implications of Floyd Shivambu’s demotion from the MK Party",
            "url": "https://www.newzimbabwe.com/the-implications-of-floyd-shivambus-demotion-from-the-mk-party/",
            "content": "IOL\n\nThe Umkhonto Wesizwe (MK) partys announcement on Tuesday thatFloyd Shivambu had been removed from his position as Secretary-Generalduring a press briefing has ignited debate about the stability and governance of the MK party, which has long been perceived as a volatile and informal organisation.\n\nDuring a tense press briefing in Durban, the party said the decision follows an internal investigation into Shivambus recent trip to Malawi, which officials say contravened the partys constitution and raised questions about leadership discipline within the organisation.\n\nAccording to MK party officials, Shivambus visit to Malawi to meet withfugitive pastor Shepherd BushirisEnlightened Church was the catalyst for his dismissal.\n\nThe partys statement confirmed that the trip was unauthorised and inconsistent with its constitutional guidelines, which explicitly prohibit members from engaging in activities that could undermine the partys integrity or expose it to external scrutiny.\n\nThe partys leadership cited the trip as emblematic of deeper systemic issues, namely, a leadership style characterised by unpredictability, casual decision-making, and a lack of institutional discipline.\n\nIndependent political analyst Sandile Swana weighed in on the implications of Shivambus removal, drawing parallels to the leadership patterns associated with former President Jacob Zuma.\n\nI have observed that part of the HR strategies of Jacob Zumawhere even when he was the President of the State, ministers and top officials were often removed abruptlymirror what we are seeing in the MK party, Swana said.\n\nIts a pattern of instability and informal governance. Leadership positions are often shifted overnight, with little transparency or consistency.\n\nSwana further argued that this informal style fosters an environment where leadership is unpredictable.\n\nThe character of the MK partys leadership resembles Zumas era  characterised by casualness and personal loyalty rather than institutional stability.\n\nThis creates a fragile political landscape where alliances are fleeting, and leadership is often driven by personal whims rather than strategic planning, he added.\n\nSanet Solomon, a political analyst from the University of the Free States Department of Political Studies and Governance, expressed concern about Shivambus removals broader implications.\n\nThe decision to recall Shivambu was not entirely unexpected, especially given the controversy surrounding his Malawi trip, she said.\n\nSuch actions risk alienating voters and could negatively impact the partys prospects in upcoming elections.\n\nSolomon criticised MKs apparent lack of precise succession planning, noting that the partys leadership operates casually and informally.\n\nThis pattern of instability suggests a leadership style that is personal rather than institutional, which can be detrimental to the partys credibility and long-term viability, she warned.\n\nThe ousting of Shivambu has raised questions about the future direction of the MK party. Analysts speculate the party may be heading into profound introspection or further instability.\n\nSome political commentators suggest that the leaderships decision to remove Shivambu rather than confront him publicly reflects a strategic attempt to avoid further internal dissent.\n\nHowever, critics argue that such moves only deepen the perception of disorder within the MK party, especially given the partys history of leadership upheaval and infighting.\n\nSwana pointed out the parallels between MKs leadership chaos and Zumas style of governance, adding another layer of complexity.\n\nThe informal and personal nature of MKs leadership echoes Zumas approach  where loyalty and personal connections often trump institutional norms, Swana said.\n\nThis could indicate that the party is becoming a mirror of Zumas political style, which may have long-term consequences for its stability.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04022058/floyd-shivambu.png",
            "description": "<p>IOL The Umkhonto Wesizwe (MK) party’s announcement on Tuesday that Floyd Shivambu had been removed from his position as Secretary-General during a press briefing has ignited debate about the stability and governance of the MK party, which has long been perceived as a volatile and informal organisation. During a tense press briefing in Durban, the party</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-implications-of-floyd-shivambus-demotion-from-the-mk-party/\">The implications of Floyd Shivambu’s demotion from the MK Party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "Zimbabwe to cull elephants to manage overpopulation",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-cull-elephants-to-manage-overpopulation/",
            "content": "By Mary Taruvinga\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) has given the Save Valley Conservancy the green light to cull 50 elephants to curb overpopulation.\n\nThe growing elephant populationis fast exceeding the carrying capacity of Zimbabwes national parks.\n\nZimParks spokesperson Tinashe Farawo confirmed the development in a statement on Tuesday, noting that permits have been issued to Save Valley Conservancy for an elephant management exercise.\n\nThe management quota is meant to address the growing elephant population in the region and will initially target 50 elephants.\n\nAccording to the 2024 aerial survey, there are 2550 elephants against an ecological carrying capacity of 800 elephants in Save Valley Conservancy.\n\nOver the past five years, the Conservancy translocated 200 elephants to Hurungwe and Sapi in an effort to manage the elephant population and protect the wildlife habitat, he said.\n\nAccording to ZimParks, elephant meat from the management exercise will be distributed to local communities.\n\nIvory will be State property that will be handed over to the ZimParks for safekeeping.\n\nZimparks announced the plan to cull 200 elephants last year amid criticism from some conservationists.\n\nZimParks clarified that the culling is part of their routine wildlife management practices, and the number of elephants culled is within the approved management quota.\n\nCulling is primarily driven by two factors: the severe drought affecting both wildlife and human populations, and the growing elephant population exceeding the carrying capacity of Zimbabwes national parks.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/31034915/elephant-4-scaled.webp",
            "description": "<p>By Mary Taruvinga Zimbabwe Parks and Wildlife Management Authority (ZimParks) has given the Save Valley Conservancy the green light to cull 50 elephants to curb overpopulation. The growing elephant population is fast exceeding the carrying capacity of Zimbabwe’s national parks. ZimParks spokesperson Tinashe Farawo confirmed the development in a statement on Tuesday, noting that permits have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-cull-elephants-to-manage-overpopulation/\">Zimbabwe to cull elephants to manage overpopulation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        },
        {
            "title": "OK Zimbabwe shuts down two Food Lover’s Market outlets",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-shuts-down-two-food-lovers-market-outlets/",
            "content": "By Alois Vinga\n\nRETAIL giant, OK Zimbabwe, has closed down its premium Food Lovers Market outlets in Borrowdale and Avondale.\n\nSeveral supermarkets in Zimbabwe have been closing branches due to economic challenges, including unstable currency and a difficult operating environment.This has led to a significant shift in the retail landscape, with some larger chains shrinking their presence while smaller businesses, like tuck shops, are thriving.\n\nThe Borrowdale and Avondale Food Lovers Market outlets were acquired by OK Zimbabwe in 2023, together with the Bulawayo branch. The Food Lovers Market Greendale store was not part of the acquisition as it operates under a separate franchise arrangement.\n\nYour local favourite daily fresh stop is saying goodbye.\n\nWe want to let you know that Food Lovers Market Borrowdale will be closing shop on June 8, 2025.\n\nUntil then, look out for daily, wonderful specials in-store as our thanks to you for your generous support, reads a social media post by Food Lovers Market Zimbabwe.\n\nTo our beloved Avondale community, a heartfelt thank you for your loyalty over the years.\n\nFood Lovers Market Avondale will be wrapping up trading on June 22, 2025.\n\nAs we prepare to finalise trading, as a mark of our gratitude, we have daily exciting specials in-store for you, designed to serve you fresh value.\n\nOK Zimbabwe recently shut down several outletsin Harare.\n\nAnother top retailer, N.Richards Group,closed several outlets under this group and also Spar Zimbabwe: Queensdale branch was closed.\n\nThe rise of tuckshops and other informal retailers, offering more competitive pricing, coupled with high taxes, has threatened established formal retailers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04035524/Food-lovers.webp",
            "description": "<p>By Alois Vinga RETAIL giant, OK Zimbabwe, has closed down its premium Food Lover’s Market outlets in Borrowdale and Avondale. Several supermarkets in Zimbabwe have been closing branches due to economic challenges, including unstable currency and a difficult operating environment. This has led to a significant shift in the retail landscape, with some larger chains shrinking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-shuts-down-two-food-lovers-market-outlets/\">OK Zimbabwe shuts down two Food Lover’s Market outlets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "04 Jun 2025"
        }
    ]
}