{
    "news": [
        {
            "title": "Sinking Dynamos finally registers Denver Mukamba",
            "url": "https://www.newzimbabwe.com/sinking-dynamos-finally-registers-denver-mukamba/",
            "content": "By Sports Reporter\n\nDynamos on Thursday finally registered midfielder Denver Mukamba after a one-month trial.\n\nMukamba becomes the fifth player to be registered by the fading giants, who are currently second from bottom on the log.\n\nMukamba is marking his return to Dynamos since his departure in 2023.\n\nHe last featured for Scottland FC in the Northern Region Division One League last season and was currently unattached to any club this year.\n\nMeanwhile, former Yadah FC coach Thomas Ruzive has been appointed assistant coach at Dynamos.\n\nRuzive will be working with incoming coach Kelvin Kaindu, who is expected to start training the side next week Monday, once his work permit is done.\n\nAccording to inside sources, Ruzive will lead the technical team on Saturday when Dynamos hosts MWOS at RufaroStadium.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/25043049/Denver-Mukamba.jpg",
            "description": "<p>By Sports Reporter Dynamos on Thursday finally registered midfielder Denver Mukamba after a one-month trial. Mukamba becomes the fifth player to be registered by the fading giants, who are currently second from bottom on the log. Mukamba is marking his return to Dynamos since his departure in 2023. He last featured for Scottland FC in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sinking-dynamos-finally-registers-denver-mukamba/\">Sinking Dynamos finally registers Denver Mukamba</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:51",
            "date": "01 Aug 2025"
        },
        {
            "title": "Diaspora remittances rise to US$635.2 million",
            "url": "https://www.newzimbabwe.com/diaspora-remittances-rise-to-us635-2-million/",
            "content": "By Alois Vinga\n\nDIASPORA remittances rose to US$635.2 million in the years first half, signalling a 7.1% increase compared to the same period last year.\n\nPresenting the Mid-term Budget Review Thursday, Finance Minister Mthuli Ncube said the revenue category performed fairly well.\n\nRemittances increased by 7,1%, from US$593.2 million in the first quarter of 2024 to US$635.2 million in 2025. The remittances have had a favourable impact on the current account balance.\n\nTo year end, remittances are projected to increase by 4.9% from US$2.6 billion in 2024 to US$2.7 billion in 2025, sustaining a positive current account balance. Given the strategic importance of the diaspora community, the Government seeks to strengthen their role in the development of the country, he said.\n\nNcube said the government is finalising the formulation of the Diaspora Policy, which will outline measures to promote remittances at a minimum cost and give guidelines on various investment initiatives.\n\nDuring the period, direct investment inflows were estimated at US$184,9 million in the first quarter of 2025, up from US$103,5 million recorded in the corresponding quarter of 2024.\n\nThe inflows were mainly in the form of capital equipment, predominantly directed towards the mining and manufacturing sectors.\n\nDuring the quarter, 207 new investment licenses were issued, marking a 44.8% increase compared to the corresponding period in 2024.\n\nThe successful launch of ZIDAs digital investment license issuance system is anticipated to streamline processes, thereby enhancing investor confidence and operational efficiency.\n\nDirect investment inflows are projected to grow to over US$600 million in 2025, with the major recipients being the energy, mining and manufacturing sectors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13025414/Diaspora-Remittances.png",
            "description": "<p>By Alois Vinga DIASPORA remittances rose to US$635.2 million in the year’s first half, signalling a 7.1% increase compared to the same period last year. Presenting the Mid-term Budget Review Thursday, Finance Minister Mthuli Ncube said the revenue category performed fairly well. “Remittances increased by 7,1%, from US$593.2 million in the first quarter of 2024</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-remittances-rise-to-us635-2-million/\">Diaspora remittances rise to US$635.2 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:51",
            "date": "01 Aug 2025"
        },
        {
            "title": "‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record",
            "url": "https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/",
            "content": "BBC\n\nA baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record.\n\nLindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce toldMIT Technology Reviewher family thought its like something from a sci-fi movie.\n\nIt is believed to be longest that an embryo has been frozen before resulting in a successful live birth. The previous record-holder wasa pair of twins who were born in 2022 from embryos frozen in 1992.\n\nThe Pierces had tried to have a child for seven years before they decided to adopt the embryo Linda Archerd, 62, made with her then-husband in 1994 through IVF.\n\nAt the time, Ms Archerd initially created four embryos. One become her now-30-year-old daughter, and the other three were left in storage.\n\nDespite separating from her husband, she did not want to get rid of the embryos, donate them for research or give them to another family anonymously.\n\nShe said it was important that she was involved with the baby, as they would be related to her adult daughter.\n\nMs Archerd paid thousands of dollars a year for storage until she found a Christian embryo adoption agency, Nightlight Christian Adoptions, which runs a programme known as Snowflakes. Many of these agencies consider their programmes to be saving lives.\n\nThe programme used by Ms Archerd allows donors to choose a couple, meaning they can state religious, racial and nationality preferences.\n\nMs Archerds preference was for a married Caucasian, Christian couple living in the US, as she didnt want to go out of the country, she told MIT Technology Review.\n\nShe ultimately matched with the Pierces.\n\nThe IVF clinic in Tennessee at which the couple underwent the procedure, Rejoice Fertility, said its aim was to transfer any embryo it received, no matter the age or conditions.\n\nMs Pierce said she and her husband did not set out to break any records, but just wanted to have a baby.\n\nMs Archerd told MIT Technology Review she had not met the baby in person yet, but could already see a resemblance with her daughter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31194934/embryo.webp",
            "description": "<p>BBC A baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record. Lindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce told MIT Technology Review her family thought “it’s like something from a sci-fi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/\">‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:51",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mutapa Fund driving sustainable growth – Govt",
            "url": "https://www.newzimbabwe.com/mutapa-fund-driving-sustainable-growth-govt/",
            "content": "By Alois Vinga\n\nFINANCE Minister, Mthuli Ncube, says the Mutapa Investment Fund (MIF) is driving sustainable growth by undertaking projects of high national impact.\n\nEstablished in 2015 and first known as the Sovereign Wealth Fund, the MIF is Zimbabwes sovereign wealth fund, which is a pool of resources that the government invests for the future.It was renamed in 2023.\n\nPresenting the Mid-Term Budget Review before ParliamentThursday, Ncube expressed confidence in the MIFs potential to spur national sustainable growth.\n\nHe said to date,the Fund has achieved significant strides towards strengthening the governance frameworks and enhancing the financial performance of the portfolio companies under its ambit.\n\nThe Fund has injected capital into a significant number of portfolio companies, most of which have started registering improved performance. The capital deployment to the portfolio companies is guided by the Investment Strategy of the Fund and the diagnostic assessment report, prioritising long-term value creation, stability and prosperity, Ncube said.\n\nInvestments currently under consideration include procurement of buses for the Zimbabwe United Passenger Company (ZUPCO) to minimise public transport challenges, capitalisation of the National Railways of Zimbabwe (NRZ) to rehabilitate rail infrastructure and address rolling stock challenges, crafting of sustainable operational models for COTTCO, Air Zimbabwe, Cold Storage Company and Silo Food industries, among others.\n\nThe Fund is also working with the Zimbabwe Electricity Supply Authority (ZESA) on a variety of initiatives to address power shortages, which include enhancing base load, together with the implementation of prepaid, net and smart metering projects.\n\nBased on the current and projected investments in the energy sector, the Fund is optimistic that load shedding will be significantly minimised in the outlook period, not least because of the rehabilitation of Hwange Units 1 to 6 under a Rehabilitate Operate and Transfer concession agreement between Zimbabwe Power Company and Jindal Africa, added Ncube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/08/05173324/ZUPCO-bus.jpg",
            "description": "<p>By Alois Vinga FINANCE Minister, Mthuli Ncube, says the Mutapa Investment Fund (MIF) is driving sustainable growth by undertaking projects of high national impact. Established in 2015 and first known as the Sovereign Wealth Fund, the MIF is Zimbabwe’s sovereign wealth fund, which is a pool of resources that the government invests for the future. It</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-driving-sustainable-growth-govt/\">Mutapa Fund driving sustainable growth – Govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:51",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion",
            "url": "https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/",
            "content": "By Alois Vinga\n\nZIMBABWEs total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year.\n\nThe unsustainable debt continues to choke Zimbabwes capacity to unlock external funding, with local debt being criticised for crowding out the private sector.\n\nPresenting the 2025 Mid-Term Budget Review Thursday, Finance Minister Mthuli Ncube said the debt stock comprises local and external debt.\n\nIn US$ terms, the total PPG debt as at end March 2025, amounted to US$21.5 billion, comprising external debt stock of US$12.6 billion and domestic debt stock of US$8.9 billion. This brings the debt-to-GDP ratio to 44% as at 31 March 2025, he said.\n\nIn local currency terms, the countrys stock of Public and Publicly Guaranteed (PPG) debt stood at ZiG576.5 billion as at the end of March 2025. The debt was external debt totalling ZiG337.7 billion, and domestic debt amounting to ZiG238.8 billion, representing 58.6% and 41.4% respectively.\n\nThe external and domestic debt arrears as at end March 2025 amounted to US$7.8 billion, constituting 36% of total PPG debt. The accumulation of arrears since the year 2000 have been worsening the country`s debt situation, constraining access to external concessional financing.\n\nIn this regard, the government is implementing the Arrears Clearance and Debt Resolution Roadmap in order to restore debt sustainability and unlock critical external financing needed for the countrys development programs, he said.\n\nDomestic debt service in local currency totalled ZiG1.64 billion, comprising both principal and interest payments during the period January to June 2025.\n\nDuring the period January to June 2025, Treasury made payments amounting to US$176.28 million for external debt service, which includes US$93.72 million towards the active portfolio, US$79.75 million for legacy debts and US$2.81 million of token payments to the International Financial Institutions and the sixteen Paris Club Bilateral Creditors.\n\nOf this, ZiG39.52 million was paid towards interest payments and ZiG1.60 billion for principal payments related to ZiG-denominated Treasury Bills and bonds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01093427/mthuli-1.jpg",
            "description": "<p>By Alois Vinga ZIMBABWE’s total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year. The unsustainable debt continues to choke Zimbabwe‘s capacity to unlock external funding, with local debt being criticised for crowding out the private sector. Presenting the 2025</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/\">Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:51",
            "date": "01 Aug 2025"
        },
        {
            "title": "UK: Diaspora Insurance hosts Zimbabwe Embassy outreach for passports and other consular services",
            "url": "https://www.newzimbabwe.com/uk-diaspora-insurance-hosts-zimbabwe-embassy-outreach-for-passports-and-other-consular-services/",
            "content": "By UK Correspondent\n\nLONDON: THE Zimbabwe Embassy in the UK will next week take its outreach programme to the West Midlands, allowing Zimbabweans in the region to apply for passports and access other consular services.\n\nAccording to a notice from the embassy, the outreach will be hosted byDiaspora Insuranceat its global headquarters in Birmingham from Tuesday (05/08/25) to Thursday (07/05/25).\n\nServices available include passports, child registration, temporary travel documents, as well as police clearance.\n\nService is on first come first serve basis. No appointment is required. We look forward to meeting you soon for seamless Consular services, the embassy said in its public notice.\n\nThe global risk solutions specialist firm will host the embassy at Diaspora Insurance House, Parklands Business Centre, Parklands Business Park,Birmingham B45 9PZ.\n\nCommenting on the development, a company representative said, We are pleased to host the Zimbabwe Embassys consular services outreach programme.\n\nProviding a platform for such essential services not only helps facilitate easier access to consular assistance but also demonstrates our commitment to serving the needs of the Zimbabwean community here.\n\nWe look forward to continuing this collaboration and working together to ensure that our community members receive the support and services they deserve.\n\nFrom Birmingham, the outreach programme will also take in the Channel Islands of Jersy and Gurnsey towards the end of August.\n\nMeanwhileDiaspora Insurancesaid its head office is available not just to the Zimbabwe community but all the 20 African nationalities the company covers across the globe.\n\nEstablished more than 14 years ago,Diaspora Insurancehas grown exponentially over the years with its bespoke funeral cash plan product providing critical financial intervention which ensures Africans in the Diaspora do not endure the indignity of GoFundMe appeals to deal with end-of-life expenses.\n\nWith no medicals asked, African transnational citizens can cover themselves in the Diaspora as well as family back home with a product that removes the double trauma of bereaving a loved one while also begging for financial assistance to help with funeral costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31170830/Diaspora-Insurance-House.png",
            "description": "<p>By UK Correspondent LONDON: THE Zimbabwe Embassy in the UK will next week take its outreach programme to the West Midlands, allowing Zimbabweans in the region to apply for passports and access other consular services. According to a notice from the embassy, the outreach will be hosted by Diaspora Insurance at its global headquarters in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-diaspora-insurance-hosts-zimbabwe-embassy-outreach-for-passports-and-other-consular-services/\">UK: Diaspora Insurance hosts Zimbabwe Embassy outreach for passports and other consular services</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:51",
            "date": "01 Aug 2025"
        }
    ]
}