{
    "news": [
        {
            "title": "Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss the law of succession as it relates to agricultural land in Zimbabwe. What are the main considerations?\n\nVM:Thank you\n\nBefore delving into the laws of succession in agricultural land, it is necessary that I first address how agricultural is held in Zimbabwe. Agricultural land is held either through title deeds, 99-year leases, leases with an option to purchase, offer letters, permits or customarily as rural land under Rural District Councils.\n\nThese forms of holding confer personal rights to the holder except in title deeds, where the holder has real rights to the land. The personal rights titles emanating from Land Reform, being mainly permits, offer letters and 99-year leases, are a result of potentially one of the most significant wealth transfer events in post-colonial Africa.\n\nThe land itself is owned by the state and occupiers have usufructs on the land to use, enjoy and earn from it.\n\nThis background or understanding is necessary as it has a direct effect on succession.\n\nSuccession itself has become topical as farming by its very nature is a generational business.\n\nIf land reform started around 2000, it means the process is now 25 years old and cases of succession by heirs are now commonplace.\n\nReporter: You highlight land reform beneficiaries, that is A1 and A2. What is the process when the initial beneficiary dies?\n\nVM:It is important that we first differentiate the A1, being a small holder farm held under a permit from the government and an A2 farm being a large-scale commercial farm held under an offer letter or a 99-year lease.\n\nI understand that the current government policy is aimed at issuing deeds for these holders. I will discuss on succession for deeds later on. For now, I will restrict myself to permit, offer letter and lease holders.\n\nFirst thing to understand is that the land under these models belongs to the State and not individuals, therefore, succession in its strictest sense, which is through the Master of the High Court, is only for improvements and movable property.\n\nIf its for land, then the succession or reallocation of land to an heir has to be approved by the government who is the landowner. When the estate of the late holder is being administered, the value of the land is not included in the process as it does not belong to the estate but the government.\n\nMaking the process twotier\n\nFor A1 farms, the surviving spouse and dependants may succeed although the successor has to be approved by the Minister of Lands. The process is done through the District Lands office within 3  6 months after the death of the land owner, depending on whether or not there are disputes. In situations of disputes, spousal rights are protected and consideration is also given to potential successors who developed the farm.\n\nThe process is similar for A2 offer letters; there is a need for an application to the Ministry of Lands district office with the required documents, which is dealt with by the Valuation and Estate Management section. As part of its consideration, it will assess, among other things, the capacity to farm, whether or not the potential heir has other farms et cetera.\n\nAs for lease holders, it is governed by general inheritance laws; the executor, upon completing the beneficiary identification process, will still be required to make an application to the Minister for approval of allocation.\n\nReporter:What issues may inhibit or stop the A1 or A2 farms being re-allocated or distributed to the selected beneficiary?\n\nVM:I am forced to start by reiterating that the rights conferred by offer letters and or leases are personal in nature. This makes it necessary for the beneficiary or potential heir to prove the rights to the Ministry of Lands.\n\nSuch proof is through the offer letter, permit or lease granted to the deceased. A failure to prove implies that the late occupier may potentially have been an unlawful occupier.\n\nIn the absence of proof, the Ministry of Lands has no obligation to re-allocate the land to the selected heir. As there may be back and forth between the offices, it is important that copies of correspondence with the Ministry are kept judiciously in the event there is a need for them to be reproduced\n\nReporter: What is the inheritance position for rural kumusha land when it comes to inheritance and farms having a title deed?\n\nVM:Communal land is vested in the President and administered by the Rural district Councils through traditional leaders being chiefs and headmen. Their inheritance for use is normally through family lines.\n\nAs for farms having title deeds, they fall under our normal inheritance laws under the purview of the Master of the High Court. The Ministry of Lands does not have jurisdiction over these types of farms.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04171724/mcm-legal.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "05 Nov 2025"
        },
        {
            "title": "Improve our welfare or we leave – nurses tell government",
            "url": "https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/",
            "content": "By Staff Reporter\n\nNURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad.\n\nMedical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health institutions.\n\nAddressing the annual general meeting in Masvingo recently, Zimbabwe Nurses Association (ZINA) president Enock Dongo told Deputy Minister of Health and Child Welfare Sleiman Kwidini that government shouldtake care of the workforce to avoid strikes.\n\nOur covenant is that we do not engage in strike. Strike is the last resort. We should not be pushed to that limit. So when you hear us complaining it would be so that nurses receive meaningful salaries. If they get enough salaries they forget about going on strike, said Dongo.\n\nHealth professionalshave been leavingthe countryin droves, in the process affecting service delivery in public hospitals.\n\nDongo said 4 000 nurses have applied to government for verification as they attempt to leave the country.\n\nWe have a very topical issue of verification which was supposed to be given by the Nurses Council, is not being given right now. Power has been taken by the Ministry. Legally Ministry does not have the power to withhold a letter of good standing, but it is still doing that.\n\nLetter of good standing is supposed to be given so that one can go wherever he wants. If I have done anything wrong just write rather than withholding it. We have more than 4 000 verification applications by nurses is because of poor working conditions and salaries.\n\nWe do not even aim to go outside the country. All the nurses here are very patriotic, added Dongo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/05015541/Nursees-on-Strike.png",
            "description": "<p>By Staff Reporter NURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad. Medical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/\">Improve our welfare or we leave – nurses tell government </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "05 Nov 2025"
        },
        {
            "title": "5 minutes with the creator of Bad Influencer and Zimbabwean visionary Kudi Maradzika",
            "url": "https://www.newzimbabwe.com/5-minutes-with-the-creator-of-bad-influencer-and-zimbabwean-visionary-kudi-maradzika/",
            "content": "The Drum\n\nWho knew the illicit handbag trade was a dog-eat-dog world?\n\nYou either eat or get eaten.\n\nAll for the statement of a Birkin, Chanel or a Louis Vuitton handbag.\n\nTo an ordinary person, the frenzy is unnecessary, but in the influencer world, the handbag carries your worth and status in circles of power.\n\nIn the Bad Influencer series, we see how a single mother capitalises on the staged detoxification of this high life as she navigates climbing the ladder of the illicit trades under the microscope of a police officer she falls in love with.\n\nWith this intriguing story, the creator, Kudi Maradzika, wanted to capture the intersection of two worlds that she is intrigued by.\n\nInfluencer culture and the world of crime. The original concept always had influencers, crime and counterfeit bags at its core, although the story did evolve in development. Bad Influencer allowed me to explore these worlds with humour, social tension and emotional depth, while still having fun with the wildness of internet culture.\n\nShe tells Drum that she also wanted to interrogate how we measure value in a world where women dont have power or financial freedom.\n\nInfluence, beauty, wealth and success are often curated illusions, and chasing them without grounding can feel exhilarating but can be dangerous. That said, I also want audiences to laugh, reflect, and question the ladders we climb to attain power and social currency.\n\nLed by Jo-Anne Reyneke, Cindy Mahlangu and Thapelo Mokoena, the cast brings to life the female-driven crime story rooted in the belly of Johannesburg streets.\n\nArt plays in the hands of reality as the Zimbabwean producer also leads in various male-dominated creative spaces.Im redefining power on my own terms. Im taking up space, building ecosystems instead of waiting for permission, and creating opportunities for others as I climb. My responsibility is not just to tell stories, but to help create platforms and initiatives where African women can own, build and lead their creative futures.\n\nShe explains how she bridges storytelling across TV, comics and gaming.\n\nI build worlds first. The medium becomes an extension of the universe. Each platform deepens the audience experience and longevity of the intellectual property (IP). Africa doesnt yet have the full transmedia infrastructure, but thats also the opportunity. The goal is not just to make content from one IP, but also to build entire story universes with unique offerings at each product vertical, from video games to merchandise, to animation and film.\n\nIP is legacy. Its economic freedom. Its how we build generational wealth in storytelling, she adds.\n\nFrom as far back as she can remember, her imaginative mind has always bred stories itching to be told.\n\nAs a child, I would write my own version of Peter Rabbit stories, and later, Id write plays in high school. That instinct followed me into journalism, and eventually into film production and screenwriting. For me, storytelling has always been a way of making sense of human behaviour, power, identity, and possibility.\n\nHer upbringing between different cultures, countries and identities also turned her perspective into a muscle she could exercise from an early stage in her life.\n\nWith a background in journalism, I also learned to observe and question narratives early in my career. Id like to believe that my upbringing shaped my hunger, resilience, and belief in creating things that outlive me, whether thats a story world, a book, a platform, or a shift in how we imagine African stories.\n\nOver the years, the creative in her late 30s has been part of international fellowships and labs in which shes championed feminine power and ownership.\n\nNow with Bad Influencer out on Netflix, shes already on to the next project. Her new project is Artemis Elixa; she shares with Drum what its all about.\n\nArtemis Elixa is a pan-African sci-fi franchise about a brilliant engineer from the future who time-travels back to stop a rogue super-intelligence from taking over humanity. Each mission sends her across the continent, from Congos mineral frontlines to Nairobis tech corridors.\n\nWith each mission, she confronts power, exploitation, and the ethics of progress. Its an African answer to Lara Croft meets The Terminator, with a touch of Black Panther, grounded in our real-world trajectory of technology, geopolitics, and African innovation. Its part graphic novel, part game, part cinematic world. The comic will be launching in 2026, she concludes the conversation with Drum.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04164958/kudi-maradzika.jpg",
            "description": "<p>The Drum Who knew the illicit handbag trade was a dog-eat-dog world? You either eat or get eaten. All for the statement of a Birkin, Chanel or a Louis Vuitton handbag. To an ordinary person, the frenzy is unnecessary, but in the influencer world, the handbag carries your worth and status in circles of power.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/5-minutes-with-the-creator-of-bad-influencer-and-zimbabwean-visionary-kudi-maradzika/\">5 minutes with the creator of Bad Influencer and Zimbabwean visionary Kudi Maradzika</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "05 Nov 2025"
        },
        {
            "title": "Sean Williams in rehab for drug addiction, dropped by Zimbabwe Cricket",
            "url": "https://www.newzimbabwe.com/sean-williams-in-rehab-for-drug-addiction-dropped-by-zimbabwe-cricket/",
            "content": "By Sports Reporter\n\nVeteran Zimbabwean batter Sean Williams has checked into a rehabilitation centre after admitting to a drug addiction.\n\nWilliams, one of the countrys most experienced cricketers, recently withdrew from the squadon the eve of the ICC Mens T20 World Cup Africa Qualifier 2025 in Harareciting personal reasons.\n\nFollowing an internal investigation into his sudden withdrawal, Zimbabwe Cricket (ZC) said Williams confessed to struggling with a drug addiction and voluntarily checked into rehab.\n\nIn a statement, ZC said Williams contract will not be renewed after its expiry in December 2025 because of his unprofessionalism.\n\nDuring an internal investigation to understand the reasons for his unavailability, Williams disclosed that he has been struggling with drug addiction and has voluntarily entered rehabilitation.\n\nZC expects all contracted players to uphold the highest standards of professionalism, discipline, and compliance with team protocols and anti-doping regulations, read part of ZCs statement.\n\nAfter careful consideration, ZC has concluded that Williams will no longer be considered for national selection. Consequently, it is not feasible to continue his national contract beyond its expiry on 31 December 2025.\n\nWilliams, who made his international debut in 2005, has been one of Zimbabwes most consistent performers across formats and previously captained the national side.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/31042232/Zimbabwe-batter-Sean-Williams.jpg",
            "description": "<p>By Sports Reporter Veteran Zimbabwean batter Sean Williams has checked into a rehabilitation centre after admitting to a drug addiction. Williams, one of the country’s most experienced cricketers, recently withdrew from the squad on the eve of the ICC Men’s T20 World Cup Africa Qualifier 2025 in Harare citing personal reasons. Following an internal investigation into his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-williams-in-rehab-for-drug-addiction-dropped-by-zimbabwe-cricket/\">Sean Williams in rehab for drug addiction, dropped by Zimbabwe Cricket</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "05 Nov 2025"
        },
        {
            "title": "Operation Dudula’s conduct in schools and hospitals ruled unlawful",
            "url": "https://www.newzimbabwe.com/operation-dudulas-conduct-in-schools-and-hospitals-ruled-unlawful/",
            "content": "JOHANNESBURG Operation Dudulas has no right or power to prevent undocumented foreign national from accessing public healthcare and schools according to a ruling by the High Court in Johannesburg on Tuesday.\n\nThe Socio-Economic Rights Institute of South Africa brought the case to court on behalf of various groups.\n\nThe case calls the actions of the movement: harassment, intimidation, and targeting migrants.\n\nThe court ruled in SERIs favour, saying Operation Dudulas actions are unlawful and xenophobic.\n\nThe High Court in Johannesburg has interdicted them from blocking clinics and schools.\n\nSERIs litigation director,Nkosinathi Sithole said, This is an exciting moment, not only for our clients but for the South African constitution.\n\nConsidering what we have been seeing is dastardly criminal conduct by Operation Dudula of blocking people from facilities, including healthcare facilities, education, demanding identity documents of people in public: all of that has been declared unlawful and have been interdicted from doing so.\n\nThe court did not only talk about Operation Dudula, it spoke about the state as well. This includes the Minister of Police and the Minister of Home Affairs, to say that they too must make sure that they are not complacent in these acts of Operation Dudula.\n\nSithole said, the state cannot simply enter peoples homes and start doing raids. They need to have a search warrant, they need to have arrest warrants. In public, they need to have a clear, reasonable suspicion that someone is an undocumented foreign national before they can ask for such identity documents.\n\nOperation Dudula members outside the court said they would not be changing their stance and would do what needs to be done on the streets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10045549/Operation-Dudula-leader-Zandile-Dabula.jpeg",
            "description": "<p>JOHANNESBURG – Operation Dudula‘s has no right or power to prevent undocumented foreign national from accessing public healthcare and schools according to a ruling by the High Court in Johannesburg on Tuesday. The Socio-Economic Rights Institute of South Africa brought the case to court on behalf of various groups. The case calls the actions of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/operation-dudulas-conduct-in-schools-and-hospitals-ruled-unlawful/\">Operation Dudula’s conduct in schools and hospitals ruled unlawful</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "05 Nov 2025"
        }
    ]
}