{
    "news": [
        {
            "title": "Pope Francis to be discharged from hospital",
            "url": "https://www.newzimbabwe.com/pope-francis-to-be-discharged-from-hospital/",
            "content": "By BBC\n\nPOPE Francis will be discharged from Romes Gemelli hospital this Sunday and will need at least two months of rest at the Vatican, doctors treating him have said.\n\nThe 88-year-old was admitted to the hospital on 14 February with a severe respiratory infection that resulted in double pneumonia.\n\nDuring the past five weeks, he presented two very critical episodes where his life was in danger, Dr Sergio Alfieri, one of the doctors treating the Pope, said.\n\nPope Francis was never intubated and always remained alert and oriented, Dr Alfieri said.\n\nThe Pope is not completely healed, but no longer has pneumonia and is now in a stable condition, according to his doctors.\n\nToday we are happy to say that tomorrow he will be at home, Dr Alfieri told reporters on Saturday.\n\nThe Pope will offer a blessing from his window at the Gemelli hospital on Sunday  the first time he will appear in public since he was admitted to hospital  before returning to his residence at the Vatican.\n\nDr Alfieri said that patients with double pneumonia lose their voice a little and especially in the elderly, it will take time for your voice to return to normal.\n\nOn Friday, Cardinal Victor Fernandez had said high-flow oxygen dries everything out and as a result the Pope needs to relearn how to speak, Reuters had reported.\n\nIf the trend of improvement continues, doctors said, the Pope would be able to return to work as soon as possible.\n\nThe Vatican had said on Friday that the Pope had seen some improvements in his breathing and mobility.\n\nIt had confirmed he no longer uses mechanical ventilation for breathing at night, but was instead receiving oxygen via a small tube under his nose. During the day, he is using less high-flow oxygen.\n\nThe Pope has only been seen by the public once since he was admitted to hospital, in a photograph released by the Vatican last week, which showed him praying in a hospital chapel.\n\nEarlier this month, an audio recording of Pope Francis speaking in his native Spanish was played in St Peters Square in Vatican City.\n\nHis voice was breathless as he thanked the Catholic faithful for their prayers.\n\nPope Francis has spent nearly 12 years as leader of the Roman Catholic Church.\n\nHe has suffered a number of health issues throughout his life, including having part of one of his lungs removed at age 21, making him more prone to infections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/04153922/Pope-Francis.png",
            "description": "<p>By BBC POPE Francis will be discharged from Rome’s Gemelli hospital this Sunday and will need at least two months of rest at the Vatican, doctors treating him have said. The 88-year-old was admitted to the hospital on 14 February with a severe respiratory infection that resulted in double pneumonia. During the past five weeks,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pope-francis-to-be-discharged-from-hospital/\">Pope Francis to be discharged from hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "Kirsty Coventry deserves IOC presidency: Mnangagwa",
            "url": "https://www.newzimbabwe.com/kirsty-coventry-deserves-ioc-presidency-mnangagwa/",
            "content": "By Sports Reporter\n\nPRESIDENT Emmerson Mnangagwa says Kirsty Coventry deserves to be International Olympics Committee (IOC) president following her election last Thursday to the world most influential sports post.\n\nCoventry succeeds Thomas Bach to become the 10th IOC president in history.\n\nThe seven-time Olympic medalist, overcame six male contenders including World Athletics president Lord Coe, who was the favourite.\n\nAged 41, Coventry becomes the first female IOC president in history.\n\nBesides breaking the gender barrier, she also became the first IOC president from the African continent.\n\nCommenting on Coventrys election into office, Mnangagwa said the Olympic gold medalist deserved to win the polls.\n\nWe are very happy as Zimbabweans, but above all she deserves it, she has done a lot.\n\nIts not that there is any favour but she actually deserves that position.\n\nShe is highly qualified to be in that position and we as Zimbabweans we are very happy, said Mnangagwa Friday.\n\nCoventry is currently serving in Mnangagwas Cabinet as the Minister of Sports, Recreation, Arts and Culture, a post she attained in 2018.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20181137/kirsty-IOC-scaled.jpeg",
            "description": "<p>By Sports Reporter PRESIDENT Emmerson Mnangagwa says Kirsty Coventry deserves to be International Olympics Committee (IOC) president following her election last Thursday to the world most influential sports post. Coventry succeeds Thomas Bach to become the 10th IOC president in history. The seven-time Olympic medalist, overcame six male contenders including World Athletics president Lord Coe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kirsty-coventry-deserves-ioc-presidency-mnangagwa/\">Kirsty Coventry deserves IOC presidency: Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "Robbery suspect in shootout with prison wardens, robs vehicle and flees from custody",
            "url": "https://www.newzimbabwe.com/robbery-suspect-in-shootout-with-prison-wardens-robs-vehicle-and-flees-from-custody/",
            "content": "By Staff Reporter\n\nTHERE was drama at the Harare Magistrates Court Friday after an armed robbery suspect exchanged gunfire with prison wardens as he made a daring escape.\n\nThe incident happened as now fugitive Luke Zinyengere (29) and others were being escorted into a Zimbabwe Prisons and Correctional Services (ZPCS) van taking them to prison after a court session.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed that a manhunt has been launched to account for Zinyengere.\n\nThe ZRP confirms that investigations are being conducted in connection with the escape from lawful custody and alleged armed robbery incident of a Mazda Demio vehicle at Harare Magistrates Court on March 21, 2025, said Nyathi.\n\nHe said police are appealing for information that may lead to the suspects arrest.\n\nAfter engaging in a shootout with prison officers, Zinyengere used a pistol to rob a car before his movie-style escape from court premises.\n\nPolice assured the public that comprehensive investigations were underway to establish what actually transpired during the incident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  THERE was drama at the Harare Magistrates Court Friday after an armed robbery suspect exchanged gunfire with prison wardens as he made a daring escape. The incident happened as now fugitive Luke Zinyengere (29) and others were being escorted into a Zimbabwe Prisons and Correctional Services (ZPCS) van taking them to prison</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robbery-suspect-in-shootout-with-prison-wardens-robs-vehicle-and-flees-from-custody/\">Robbery suspect in shootout with prison wardens, robs vehicle and flees from custody</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "Warriors hunt Indomitable Lions of Nigeria in decisive World Cup Qualifier",
            "url": "https://www.newzimbabwe.com/warriors-hunt-indomitable-lions-of-nigeria-in-decisive-world-cup-qualifier/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens football national team, the Warriors have shifted base to Nigeria ahead of the 2026 World Cup Qualifiers.\n\nMichael Nees and his squad arrived in Lagos, Nigeria Friday before travelling to Uyo, where the match will be played.\n\nThe Warriors are set to play the Super Eagles Tuesday at Godswill Akpabio Stadium in Uyo.\n\nNigeria and Zimbabwe played a 1-1 draw during the first leg match played in 2023 when they faced off at Stade Huye Stadium in Rwanda.\n\nComing from a 2-2 draw from behind, Zimbabwe will be desperate to pick maximum points Tuesday to keep its hopes of qualifying for the 2026 World Cup alive.\n\nCurrently the Warriors are bottom in Group C with three points, seven behind South Africa, who are on top with 10 points.\n\nZimbabwe remains the only team yet to win in the group and a defeat Tuesday will shutter its hope of making it to next years World Cup tournament.\n\nNigeria walks into Tuesdays game brimming with confidence after picking their first win of the campaign Friday against Rwanda whom they beat 2-0.\n\nThe Super Eagles are now on six points, climbing up Group C standings to position four.\n\nSouth Africa  10 points\n\nBenin  8 points\n\nRwanda  7 points\n\nNigeria  6 points\n\nLesotho  5 points\n\nZimbabwe  3 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s football national team, the Warriors have shifted base to Nigeria ahead of the 2026 World Cup Qualifiers. Michael Nees and his squad arrived in Lagos, Nigeria Friday before travelling to Uyo, where the match will be played. The Warriors are set to play the Super Eagles Tuesday at Godswill</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-hunt-indomitable-lions-of-nigeria-in-decisive-world-cup-qualifier/\">Warriors hunt Indomitable Lions of Nigeria in decisive World Cup Qualifier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "‘2030 agenda unstoppable, whether you shout at President’— says Local Government minister in unrelenting attack on war veteran Geza",
            "url": "https://www.newzimbabwe.com/2030-agenda-unstoppable-whether-you-shout-at-president-says-local-government-minister-in-unrelenting-attack-on-war-veteran-geza/",
            "content": "By Staff Reporter\n\nLOCAL Government, Daniel Garwe, has blasted outspoken war veteran and expelled Zanu PF Central Committee member, Blessed Bombshell Runesu Geza, calling him names during an address to party supporters.\n\nGarwes remarks came in response to Gezas recent online State of The Nation Address, during which the acerbic former liberation war combatant urged Zimbabweans to throng the streets on March 31 in protest over misrule by Mnangagwa and his cabal.\n\nGeza also sensationally claimed that President Emmerson Mnangagwa, in a morbid plot to perpetuate his presidency, sent assassins who poisoned his deputy, Constantino Chiwenga in a bid to eliminate the heir apparent.\n\nIn his speech at the launch of the Presidential War Veterans Fund, Borehole Drilling Scheme, and Housing Scheme in Mashonaland East this Saturday, Garwe made a blistering attack on Geza, who is currently in hiding.\n\nYou Geza, you are forgetting that Zanu PF bred you, today you are rebuking Zanu PF. Mnangagwa was your commander during the war, your commander in ZNA, is the one you are now spiting, stupid, nuisance, idiot, ranted Garwe,who double as Zanu PF Mashonaland East Provincial Chairman.\n\nHe added that Zanu PF is not governed through social media or petitions, declaring, 2030 is unstoppable, whether you shout at the President or not.\n\nZanu PF is not ruled over social media, shut up!\n\n2030 is unstoppable whether you shout at the President or not, whether you shout at Mahiya or not whether you insult Garwe or not, its unstoppable, whether you move around with a paper and write a petition it wont stop 2030, said Garwe.\n\nMeanwhile, during the same address, the Local Government minister sought to make a somersault on his earlier directive to councils to remove vendors from the streets.\n\nIf you go to the towns there are rumors that the government said it is removing vendors, dont be lied to. We didnt say people should be removed, we said we want to build beautiful places for the small businesses to occupy and sell their goods.\n\nBut we only said the laws dont permit people to work during the night, because those who sell drugs now sell at night, those who sell expired goods now sell at night, said Garwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Staff Reporter LOCAL Government, Daniel Garwe, has blasted outspoken war veteran and expelled Zanu PF Central Committee member, Blessed “Bombshell” Runesu Geza, calling him names during an address to party supporters. Garwe’s remarks came in response to Geza’s recent online “State of The Nation Address”, during which the acerbic former liberation war combatant urged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/2030-agenda-unstoppable-whether-you-shout-at-president-says-local-government-minister-in-unrelenting-attack-on-war-veteran-geza/\">‘2030 agenda unstoppable, whether you shout at President’— says Local Government minister in unrelenting attack on war veteran Geza</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "ZINARA disburses 88 percent of collected revenue to councils – Mutare lauds move as progressive",
            "url": "https://www.newzimbabwe.com/zinara-disburses-88-percent-of-collected-revenue-to-councils-mutare-lauds-move-as-progressive/",
            "content": "By Leopold Munhende\n\nMUTARE City Council has described as progressive, moves by the Zimbabwe National Roads Authority (ZINARA) to disburse 88% of collected revenue to local authorities across the country.\n\nZINARA, tasked with funding Zimbabwes road rehabilitation programme, disbursed 100% of budgeted-for amounts to all councils across the countrys 10 provinces, according to its recent memo.\n\nFifty-eight (58) of Zimbabwes 94 road authorities received 100% of their fuel allocation with ZINARA disbursing ZiG4,7 billion to councils in the year ending December 31, 2024.\n\nZimbabwes road network, which was declared a national disaster by President Emmerson Mnangagwa, has been under constant rehabilitation since. Councils and government have over recent years gone a gear up in their rehabilitation.\n\nMutare Town Clerk, Blessing Chafesuka welcomed ZINARAs quick disbursement of funds saying it saved council from having to deal with devaluation of the local currency associated with late deposits of funds.\n\nChafesukas council got 100% of its US$8,978,287 budget from ZINARA.\n\nMutare received its full allocation for 2024, which is progressive, said Chafesuka.\n\nWe have no issues with ZINARA disbursements, our only challenge relates to procurement regulations which are too long and not suitable to the obtaining economic environment, said Chafesuka.\n\nZINARA has the sole mandate of collecting revenue on Zimbabwean roads through toll fees and has spearheaded the funding of road rehabilitation on its major highways such as the Beit Bridge  Harare and Bulawayo  Harare highways.\n\nFuel allocation to councils was referred to by Chafesuka as a good way of maintaining the value of the local ZiG.\n\nHe added: This is a better way to preserve value than getting ZiG, which in most cases loses value in accounts.\n\nFormerly one of the most secretive parastatals, ZINARA, now led by Chief Executive Officer Nkosinathi Ncube, has much recently been open with how it operates, including the funding model used to finance councils across the country.\n\nWe are in a good working relationship with ZINARA as it is engaging us professionally through multiple channels, said Makonde Rural District Council (RDC) chief executive officer (CEO) Paradzayi Munyeda.\n\nIn Harare, funds have been disbursed for reconstruction of roads such as the Dzivarasekwa and Warren Park  Kambuzuma roads.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/23034548/SAVE_20250321_183557.jpg",
            "description": "<p>By Leopold Munhende MUTARE City Council has described as progressive, moves by the Zimbabwe National Roads Authority (ZINARA) to disburse 88% of collected revenue to local authorities across the country. ZINARA, tasked with funding Zimbabwe’s road rehabilitation programme, disbursed 100% of budgeted-for amounts to all councils across the country’s 10 provinces, according to its recent</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zinara-disburses-88-percent-of-collected-revenue-to-councils-mutare-lauds-move-as-progressive/\">ZINARA disburses 88 percent of collected revenue to councils – Mutare lauds move as progressive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "Government to crack whip on foreigners, including refugees, invading reserved economic sectors",
            "url": "https://www.newzimbabwe.com/government-to-crack-whip-on-foreigners-including-refugees-invading-reserved-economic-sectors/",
            "content": "By Darlington Gatsi\n\nIN a desperate bid to force the acceptance of local currency and curb the smuggling of counterfeit goods by micro-small to medium enterprises (MSMEs), the government is targeting a clampdown on foreign nationals, who have invaded the reserved sector.\n\nForeign nationals are flooding the MSME sector, establishing tuckshops in some parts of Harare, where they sell various goods, including household groceries.\n\nThis is despite the sector having been protected by the government through the amended Indigenisation and Economic Empowerment Act.\n\nUnder this Act, sectors such as transport, retail, and wholesale trade, among others, have been reserved for local citizens.\n\nResponding to questions on what measures the government has taken to address the refusal of local currency by MSMEs, the Minister of Industry and Commerce, Mangaliso Ndlovu, said there will be an issuance of a Statutory Instrument to thwart the operations of foreigners.\n\nI am now thinking that it might be appropriate to bring a ministerial statement on some of the measures that we will be instituting in a very short time. Among them, is the enforcement of the reserved sectors.\n\nThe retail sectors where we have a lot of foreigners, most of whom are not even here legally, some came as refugees. This extends to other sectors including quarrying, brick moulding and sand mining, which has been invaded by foreign nationals.\n\nWe will be enforcing the law fully. We are just finalising on some of the statutory provisions which we were supposed to have instituted a few years ago when the amendments to the Indigenisation and Economic Empowerment Act was done through the Finance Act of 2018.\n\nOnce the Statutory Instrument gives us full powers to enforce the reserved sector laws, we hope that we will be able to address this scourge which is really giving us problems at the moment, said Ndlovu.\n\nThe local currency has become dreaded by MSMEs due to its volatility, with many preferring the United States dollar. Shop owners reportedly manipulate point-of-sale machines to only accept transactions in US dollars.\n\nThis has disadvantaged the majority of consumers who earn in the local currency.\n\nNdlovu further said that his ministry will take steps to regulate the informal sector to allow the purchase of goods in all currencies.\n\nIf you follow the Monetary Policy Statement issued by the Central Bank, they have highlighted again that every registered business ought to have a point of sale machine. These are attempts to make sure that everyone operating in this country, a business affords the consumer an opportunity to swipe or to use the local currency alongside the foreign currency as they wish.\n\nI might highlight for the comfort of the House that this is a matter we are seized with where we are coming up with a comprehensive system and as we speak, officials from the Ministry of Finance, the Central Bank, from our ministry and from the security agencies have been assigned to go to India where they will understudy a centralised payment system where SMEs and industry are successfully formalised and are contributing to the fiscus, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26164728/tuckshop.gif",
            "description": "<p>By Darlington Gatsi IN a desperate bid to force the acceptance of local currency and curb the smuggling of counterfeit goods by micro-small to medium enterprises (MSMEs), the government is targeting a clampdown on foreign nationals, who have invaded the reserved sector. Foreign nationals are flooding the MSME sector, establishing tuckshops in some parts of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-to-crack-whip-on-foreigners-including-refugees-invading-reserved-economic-sectors/\">Government to crack whip on foreigners, including refugees, invading reserved economic sectors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "George Foreman, the fearsome heavyweight who became a beloved champion, dies at 76",
            "url": "https://www.newzimbabwe.com/george-foreman-the-fearsome-heavyweight-who-became-a-beloved-champion-dies-at-76/",
            "content": "By Associated Press\n\nGEORGE Foreman became the heavyweight champion of the world in his 20s, only to lose his belt to Muhammad Ali in perhaps the most memorable fight in boxing history.\n\nA full 20 years later in 1994, the 45-year-old Foreman became the oldest man to win the heavyweight championship, throwing one perfect combination to steal Michael Moorers title in an epic upset.\n\nFew fighters ever had more big moments than Big George Foreman  and even after he finally left the ring, he was only getting started.\n\nThe fearsome heavyweight, who lost the Rumble in the Jungle to Ali before his inspiring second act as a surprising champion and a successful businessman, died Friday night. Foreman was 76.\n\nForemans family announced his death on social media, not saying how or where he died.\n\nA devout preacher, a devoted husband, a loving father and a proud grand- and great-grandfather, he lived a life marked by unwavering faith, humility and purpose, his family wrote.\n\nA humanitarian, an Olympian and two-time heavyweight champion of the world, he was deeply respected. A force for good, a man of discipline, conviction, and a protector of his legacy, fighting tirelessly to preserve his good name for his family.\n\nA native Texan, Foreman began his boxing career as an Olympic gold medalist who inspired fear and awe as he climbed to the peak of the heavyweight division by stopping Joe Frazier in 1973.\n\nHis formidable aura evaporated only a year later when Ali pulled off one of the most audacious victories in boxing history in Zaire, baiting and taunting Foreman into losing his belt.\n\nForeman left the sport a few years later, but returned after a 10-year absence and a self-described religious awakening.\n\nThe middle-aged fighter then pulled off one of the most spectacular knockouts in boxing history, flooring Moorer  19 years his junior  with a surgical right hand and claiming Moorers two heavyweight belts. Foremans 20 years is easily the longest gap between heavyweight title reigns.\n\nForemans transformation into an inspirational figure was complete, and he fought only four more times  finishing 76-5 with 68 knockouts  before moving onto his next career as a genial businessman, pitchman and occasional actor.\n\nOutside the ring, he was best known as the face of the George Foreman Grill, which launched in the same year as his victory over Moorer. The simple cooking machine sold more than 100 million units and made him much wealthier than his sport ever did.\n\nGeorge was a great friend to not only myself, but to my entire family, Top Rank president Bob Arum said. Weve lost a family member and are absolutely devastated.\n\nIn the first chapter of his boxing career, Foreman was nothing like the smiling grandfather who hawked his grills on television to great success.\n\nForeman dabbled in petty crime while growing up in Houstons Fifth Ward, but changed his life through boxing. He made the U.S. Olympic team in 1968 and won gold in Mexico City as a teenager, stopping a 29-year-old opponent in a star-making performance.\n\nForeman rose to the pinnacle of the pro game over the next five years, but was also perceived as an aloof, unfriendly athlete, both through his demeanor and through the skewed racial lenses of the time.\n\nJim Lampley, the veteran boxing broadcaster who worked alongside Foreman for many years at HBO, told The Associated Press on Friday night that Foremans initial demeanor was an attempt by his camp to emulate Sonny Liston, the glowering heavyweight champ of the 1960s.\n\nAt some point somewhere along the way, he realized that wasnt him, Lampley said.\n\nForeman stopped Frazier in an upset in Jamaica in January 1973 to win the belt, with his knockout inspiring Howard Cosells iconic call: Down goes Frazier! Down goes Frazier!\n\nForeman defended his belt against Ken Norton before accepting the fight with Ali in the now-immortal bout staged in Africa by promoter Don King. Ali put on a tactical masterclass against Foreman, showing off the rope-a-dope strategy that frustrated and infuriated the champion. Foreman was eventually knocked down for the first time in his career, and the fight was stopped in the eighth round.\n\nForeman told the BBC in 2014 that he took the fight almost out of charity to Ali, who he suspected to be broke.\n\nI said I was going to go out there and kill him, and people said, Please, dont say youre going to kill Muhammad, Foreman said. So I said, OK, Ill just beat him down to the ground. Thats how easy I thought the fight would be.\n\nExhausted and disillusioned, Foreman stopped fighting in 1977 and largely spent the next decade preaching and working with kids in Houston after his religious awakening. He returned to boxing in 1987 in his late 30s with a plan to defy time through frequent ring appearances, and he racked up a lengthy series of victories before losing to Evander Holyfield in a surprisingly competitive title fight in 1991.\n\nThree years later, Foreman got in the ring with Moorer in Las Vegas, more for his celebrity than for his perceived ability to beat Moorer. The champion appeared to win the first nine rounds rather comfortably, with Foreman unable to land his slower punches. But Foreman came alive in the 10th, hurting Moorer before slipping in the short right hand that sent Moorer to the canvas in earth-shaking fashion.\n\nLampley, who was calling the fight, named his upcoming autobiography  which includes a prologue about Foreman  after his famous call of that moment: It Happened!\n\nForeman quit the ring for good in 1997, although he occasionally discussed a comeback. He settled into a life as a boxing analyst for HBO and as a pitchman for the grills that grew his fame and fortune. Much of the world soon knew Foreman as both a lovable friend and a ferocious fighter.\n\nHe started performing as this pitchman, this product pitchman with the big, ever-present giant grin on his face, Lampley recalled. When I was working with him, people would say, George is a big clown.\n\nAnd I would say, Well, you can call him a clown, but hes actually a genius. He may be the greatest genius Ive ever met. And people would say, Well, genius, what do you mean? Id say, Well, check the bank account. If that isnt proof enough, I dont know what is. So, he was a genius. He was a human genius.\n\nForeman briefly starred in a sitcom called George in the 1990s, and he even appeared on the reality singing competition The Masked Singer in 2022. A biographical movie based on his life was released in 2023.\n\nForeman had 12 children, including five sons who are all famously named George Edward Foreman.\n\nLegendary boxing champion, life-changing preacher, husband, father, grand- and great-grandfather and the best friend you could have, WBC President Mauricio Sulaiman wrote on social media.\n\nHis memory is now eternal, may Big George rest in peace.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/22073921/download-10.webp",
            "description": "<p>By Associated Press  GEORGE Foreman became the heavyweight champion of the world in his 20s, only to lose his belt to Muhammad Ali in perhaps the most memorable fight in boxing history. A full 20 years later in 1994, the 45-year-old Foreman became the oldest man to win the heavyweight championship, throwing one perfect combination</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/george-foreman-the-fearsome-heavyweight-who-became-a-beloved-champion-dies-at-76/\">George Foreman, the fearsome heavyweight who became a beloved champion, dies at 76</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "Suspected Zanu PF thugs destroy car, house belonging to party member opposed to Mnangagwa’s 2030 agenda",
            "url": "https://www.newzimbabwe.com/suspected-zanu-pf-thugs-destroy-car-house-belonging-to-party-member-opposed-to-mnangagwas-2030-agenda/",
            "content": "By Staff Reporter\n\nPROPERTY belonging to a Zanu PF member was Thursday destroyed by suspected fellow party activists during a nocturnal raid in Zvimba, Mashonaland West province, as intra-party violence escalates in the ruling establishment.\n\nGifford Gomwe had his vehicle and house destroyed for allegedly bravely coming out to vociferously resist President Emmerson Mnangagwas supporters push to extend his rule beyond his constitutionally-permissible two five-year terms.\n\nGifford Gomwe\n\nGomwe, who faced off with Justice Minister Ziyambi Ziyambi during the 2023 Zanu PF primaries in which both eventually lost to current Labour deputy minister Mercy Maruva-Dinha, is counting his loss after unknown assailants descended on his homestead Thursday night.\n\nThe attackers, seemingly on a terror mission, didnt take away any valuables but targeted a double-cab vehicle whose windows and lights they shattered using unknown objects. They also smashed window panes around the house before fleeing.\n\nGomwe confirmed the incident to NewZimbabwe.com in a telephone interview.\n\nThe incident happened while l was away in Harare for work but one of my relatives was there. The assailants were clearly on a mission to intimidate me because all they did was to vandalise my property and didnt take away anything of value, Gomwe told NewZimbabwe.com.\n\nPolice attended the scene but until the time of publishing, no suspect had been arrested.\n\nHowever, Gomwe is convinced the attack was politically-motivated.\n\nThis is clearly the work of fellow Zanu PF comrades who want to silence me because l have been vocal in resisting the 2030 agenda to have President Emmerson Mnangagwas term extended beyond 2028. I am taking that stance because l am a constitutionalist, said Gomwe, who insists he is still a Zanu PF member despite a recent Politburo decision to expel him.\n\nI was never served with a charge sheet nor given an opportunity to respond to the allegations. Also, the expulsion was never formally communicated to me, l only learnt about it through social media and the very same people pushing for my expulsion were the ones behind the attack at my home.\n\nLosers from the 2023 elections such as Ziyambi and others were allegedly angered by those pushing back calls for Mnangagwa to perpetuate his rule, Gomwe opined.\n\nIndividuals who lost elections and went on to benefit from President Mnangagwas appointments are the ones agitating for him to cling to power, which l personally disagree with, he added.\n\nIn a public statement, Gomwe noted that the recent attack at his homestead would not shake his resolve to ensure Zanu PF observes the party and national constitutions.\n\nI stand unwavering and unshaken by the recent vandalism incident at my rural homestead in Zvimba. This cowardly and barbaric act will not intimidate me, nor will it deter our collective march towards a brighter future.\n\nThe damaged car\n\nSuch acts of violence and intimidation only serve to expose the desperation and fear of those who seek to undermine our progress, he wrote.\n\nLet me be clear: these tactics will not succeed. The revolution that seeks to emancipate our people and bring us to greater heights will not be stopped by senseless acts of destruction.\n\nTo the perpetrators, you will face the full wrath of the law. Justice will be served, and you will be held accountable for your actions.\n\nTo my fellow comrades, let us stand strong and united in the face of such cowardice. Let us continue to push forward, undeterred, towards a future that is brighter, more just, and more equal for all. Aluta continua.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/22065322/IMG-20250321-WA0015.jpg",
            "description": "<p>By Staff Reporter  PROPERTY belonging to a Zanu PF member was Thursday destroyed by suspected fellow party activists during a nocturnal raid in Zvimba, Mashonaland West province, as intra-party violence escalates in the ruling establishment. Gifford Gomwe had his vehicle and house destroyed for allegedly bravely coming out to vociferously resist President Emmerson Mnangagwa’s supporters’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/suspected-zanu-pf-thugs-destroy-car-house-belonging-to-party-member-opposed-to-mnangagwas-2030-agenda/\">Suspected Zanu PF thugs destroy car, house belonging to party member opposed to Mnangagwa’s 2030 agenda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        },
        {
            "title": "Fugitive Blessed Geza’s YouTube post dressed in military uniform riles Zimbabwe Defence Forces",
            "url": "https://www.newzimbabwe.com/fugitive-blessed-gezas-youtube-post-dressed-in-military-uniform-riles-zimbabwe-defence-forces/",
            "content": "By Staff Reporter\n\nZIMBABWEs military has, in a rare show of power and authority, come out to denounce individuals either wearing military fatigue or pretending to be part of the army.\n\nThis follows the appearance of disgruntled war veteran Blessed Geza in full army uniform in a video posted last weekend that has been shared widely.\n\nGeza is the man who has been calling for the immediate resignation of President Emmerson Mnangagwa and on the police to deal with his associates whom he accuses of grand corruption.\n\nThe video, which has now been posted on numerous channels, has him calling for a March 31 mass protest that is expected to force out Mnangagwa who still has to serve three years of his second term.\n\nGezas motivation has been Mnangagwas attempts to disrespect the Constitution by having it amended to his benefit. Sections within the party want him to hang on until 2030 despite the Constitution declaring that he should vacate office in 2028 after two terms in office.\n\nThis, argues Geza, is wrong, unfair, corrupt and the reason why Zimbabwes army is backing his deputy Constantino Chiwenga to take over, in factional fights bedeviling the ruling party.\n\nThe Zimbabwe Defence Forces further note with concern, the continued misuse of military uniform by some members of the public, reads the statement.\n\nThe public is advised that according to the Defence Act (Chapter 11:02), the abuse of military uniform is an offence which prohibits and criminalises the wearing of military uniform by individuals who are not members of the Defence Forces.\n\nAny person who without authority wears or uses any decoration supplied to or authorised for use by any member of the Defence Forces or other military forces or any decoration so nearly resembling such decoration as to be likely to deceive shall be guilty of an offence.\n\nMembers of the public are therefore urged to desist from acquiring or wearing any items of military uniform or apparel resembling such. Those caught on the wrong side of the law will be prosecuted.\n\nMembers of the public are also urged to report to the Zimbabwe Republic Police or the Zimbabwe Military Police any persons seen wearing military uniforms outside cantonment and other designated areas, or those committing crimes on the pretext that they are members of the Zimbabwe Defence Forces.\n\nDespite the statement, Geza, who is on the polices wanted list on charges of inciting violence and undermining the authority of the president, is widely believed to be enjoying the security and support of Zimbabwes army.\n\nHe is widely believed to be pushing an agenda whose interests are in sync with the armys, the installment of Chiwenga as President.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter ZIMBABWE’s military has, in a rare show of power and authority, come out to denounce individuals either wearing military fatigue or pretending to be part of the army. This follows the appearance of disgruntled war veteran Blessed Geza in full army uniform in a video posted last weekend that has been shared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fugitive-blessed-gezas-youtube-post-dressed-in-military-uniform-riles-zimbabwe-defence-forces/\">Fugitive Blessed Geza’s YouTube post dressed in military uniform riles Zimbabwe Defence Forces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "23 Mar 2025"
        }
    ]
}