{
    "news": [
        {
            "title": "Four ZIMRA officials arrested for demanding, accepting US$1,500 bribe",
            "url": "https://www.newzimbabwe.com/four-zimra-officials-arrested-for-demanding-accepting-us1500-bribe/",
            "content": "By Staff Reporter\n\nFOUR Zimbabwe Revenue Authority (ZIMRA) officials have been arrested for demanding and receiving bribe money.\n\nThe quartet of Maguta Jonathan, Mitwira Obert, Homera Simon and Gwatirinda Paul, all revenue officers, faces charges of extortion or, alternatively, criminal abuse of duty as public officers.\n\nThey were nabbed by Zimbabwe Anti-Corruption Commission (ZACC) investigators on charges of extortion after allegedly demanding a bribe from a transport operator to facilitate the release of a bus impounded during an anti-smuggling blitz.\n\nAccording to ZACC, the accused demanded US$6,000 from Beatrice Maramwidze, director of Best Express Logistics, after the company paid ZWG55,000 in excess duty for a bus seized during a clampdown.\n\nMaramwidze reported the matter to ZACC, leading to an investigation.\n\nThe accused were arrested after accepting a US$1,500 bribe while aboard a ZIMRA-branded vehicle.\n\nDuring a search, ZACC investigators recovered an additional US$3,951, suspected to be part of the extorted cash.\n\nThe suspects are currently detained at Avondale Police Station and are expected to appear in Harare Magistrate Court tomorrow, January 11, 2025.\n\nZACC urged the public and the business community to report any instances of corruption.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/02234101/handcuffs.jpg",
            "description": "<p>By Staff Reporter  FOUR Zimbabwe Revenue Authority (ZIMRA) officials have been arrested for demanding and receiving bribe money. The quartet of Maguta Jonathan, Mitwira Obert, Homera Simon and Gwatirinda Paul, all revenue officers, faces charges of extortion or, alternatively, criminal abuse of duty as public officers. They were nabbed by Zimbabwe Anti-Corruption Commission (ZACC) investigators</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-zimra-officials-arrested-for-demanding-accepting-us1500-bribe/\">Four ZIMRA officials arrested for demanding, accepting US$1,500 bribe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "US President Biden’s govt slammed for mulling LGBTlQ programmes funding in Zimbabwe",
            "url": "https://www.newzimbabwe.com/us-president-bidens-govt-slammed-for-mulling-lgbtlq-programmes-funding-in-zimbabwe/",
            "content": "By NewsMax\n\nTHE new chair of the House Foreign Affairs Committee has questioned why the Joe Biden administration is attempting to send millions of dollars of taxpayer money into international programmes irrelevant to national security, including Lesbian, Gay, Bisexual and Transgender, Intersex and Queer (LGBTIQ) initiatives in Zimbabwe.\n\nIn recent weeks, my office has been made aware of hundreds of millions of dollars of proposed obligations for initiatives that offer no clear national security benefit to the U.S. or its allies, Rep. Brian Mast, R-Fla., wrote in a letter Wednesday to Secretary of State Antony Blinken and Samantha Power, administrator of the U.S. Agency for International Development.\n\nMast succeeded Rep. Michael McCaul, R-Texas, as the committees chair in the new Congress. McCaul oversaw the committees investigation into the Biden administrations disastrous withdraw from Afghanistan in August 2021.\n\nThe American people sent a clear message in November that they will no longer tolerate uncontrolled spending on programmes that are incompatible with the United States interests abroad, Mast wrote.\n\nAs their representative, I cannot, in good faith, allow you to spend millions of dollars to combat climate change in the war-torn Middle East or fund LGBTQI awareness in Zimbabwe  both of which are among your recent proposals.\n\nThe rush to fund these and other controversial programmes on the eve of a new administration contradicts President [Joe] Bidens pledge to conduct a smooth transition and undermines critical Congressional oversight of taxpayer dollars spent abroad. As such, I am invoking the longstanding precedent granted to authorizing and appropriating committees to place a hold on these funds before they are obligated.\n\nA State Department spokesperson told National Review, The policies and current spending of the administration align with bipartisan foreign policy and national security goals that span many administrations  such as advancing democracy and human rights, protecting and ensuring access to natural resources, and increasing access to education and innovation.\n\nThe spokesperson added, The State Department will continue to work with Congress on spending priorities for appropriated funds, as required by law, to advance the nations foreign policy objectives.\n\nMast, a decorated U.S. Army veteran who also chairs the Foreign Affairs subcommittee on Oversight and Accountability, last month released a report detailing how the State Department used taxpayer dollars to spread left-leaning ideology worldwide.\n\nThe report said approximately $500,000 went to a Great Britain humanist group to teach humanist groups in Nepal how to proselytize and to expand atheist networks in the region.\n\nIt also said money targeted youth with sexualized programming, including a $20,600 grant to fund drag shows in Ecuador; cash and voucher assistance to migrants in northern Mexico to make their journey across the southern border easier, and help navigating the U.S. asylum system.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/19064104/Joe-Biden-e1604465588920.jpg",
            "description": "<p>By NewsMax THE new chair of the House Foreign Affairs Committee has questioned why the Joe Biden administration is attempting to send millions of dollars of taxpayer money into international programmes irrelevant to national security, including Lesbian, Gay, Bisexual and Transgender, Intersex and Queer (LGBTIQ) initiatives in Zimbabwe. “In recent weeks, my office has been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-president-bidens-govt-slammed-for-mulling-lgbtlq-programmes-funding-in-zimbabwe/\">US President Biden’s govt slammed for mulling LGBTlQ programmes funding in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "Choked Zimbabweans decry high cost of education as schools anticipate opening for 2025 calendar",
            "url": "https://www.newzimbabwe.com/choked-zimbabweans-decry-high-cost-of-education-as-schools-anticipate-opening-for-2025-calendar/",
            "content": "By Staff Reporter\n\nPARENTS and guardians of school-going children are facing a torrid time preparing learners for the new 2025 calendar year that kicks off next Tuesday, January 14.\n\nIt is particularly burdening for those with children progressing from Early Childhood Development (ECD) to Grade One, and from Grade Seven into secondaryschool as pupils need new sets of uniforms, stationery, among other paraphernalia such as trunks, which are very expensive for many.\n\nThe streets of Harare, Bulawayo, Mutare, Chinhoyi, and indeed other urban areas, were this week bustling with back-to-school shoppers buying trunks, plastic and khaki covers, books from reputable and fly-by-night as well as street stationery retailers.\n\nIn snap surveys conducted by NewZimbabwe.com, parents and guardians complained about the ever-rising cost of sending children to school amid worsening economic conditions and a high unemployment rate.\n\nMostly, interviewees complained of the United States dollar-denominated tuition fees and levies, high prices of school uniforms at most retailers while others expressed concern over some institutions forcing them to buy expensively priced products at schools.\n\nDumisani Munyulwa, a male vendor living with a disability plying his trade in central Harare and making ends meet by selling school supplies, shared the challenges he faces as schools reopen for the new calendar.\n\nYes, schools are opening, but its now different from years back. Business used to be brisk during this time of the year, but nowadays street sales are low. This is because most schools are now selling their own uniforms and stationery.\n\nThe competition is stiff, and l am not sure if l will be able to buy new uniforms and stationery for my own kids, pay US$ school fees for my three kids, one in Form Three, the other Form One and the last in Grade Five, Munyulwa told NewZimbabwe.com.\n\nMunyulwa is not alone as his sentiments are shared by Lovemore Chitanda, who noted the financial strain that the new school term has brought him in the wake of high spending during the just-ended Christmas and New Year holidays.\n\nThe festive season really took a toll on my purse as I and my family had to travel to the rural areas. Now, l am facing the challenges of items needed for my Form One kid which surpass US$600, and also my Grade 7 child who has their needs, said Chitanda.\n\nMelissa Chipwanya shared the struggles faced by parents, particularly those with multiple children.\n\nThings are hard since we are just coming from the holidays. Schools require money but the budgeted cash wont be enough to buy uniforms, books and other stuff needed. In most cases, you wont be having one child, but two to three, who need to be taken to school, and all expenses fully paid.\n\nAs for myself, I have two kids, one in Form Three and the other Form One, both at Klein Manasse High School. As for the younger one, since hes starting secondary education, he needs a new set of uniforms which the school says must be purchased at the school only which is sightly expensive than buying from the streets or other shops. Its hard, said Chipwanya.\n\nMeanwhile, not all parents are facing challenges as some had to make sacrifices during the festive season and budgeted for the schools opening.\n\nOne Muzariri, a parent who has already managed to pay for his childrens fees, noted the sacrifices made to meet educational costs.\n\nBasically, the start of a new year, school items will be on demand, and they tend to cost slightly higher than during the course of the year, but it needs oneself, as a parent, to be prepared for the challenges.\n\nWe have paid for all the fees; we had to make sacrifices. During Christmas we did not spend unnecessarily, so all the required fees has been paid thats where we are coming from now. We are doing the final shopping for uniforms as well as stationery.\n\nMy son is going for Form Three at Chinhoyi High School, and my daughter is going in Grade Three at Chivaraidze Primary School, and all is set for the 2025 school year, said Muzariri.\n\nCynthia Munyongani conceded that the high cost of education in Zimbabwe which is taking a knock on citizens pockets.\n\nAs parents we confront these challenges head-on and making huge sacrifices. The reopening of schools serves as a reminder of the ongoing economic pressures associated with funding education in Zimbabwe.\n\nWith many families feeling the pinch, the upcoming term will test their resilience and resourcefulness as they strive to provide for their childrens educational needs, said Munyongani\n\nPrimary and Secondary Education permanent secretary, Moses Mhike has warned schools engaging in unethical behaviours of chasing away learners without fully paid fees, those that demand fees only in United States dollars and those who make it compulsory to buy uniforms at the respective schools.\n\nNo school should force any parent to pay fees or levies exclusively in foreign currency. Parents are free to pay in any currency of their choice, as Zimbabwe operates under a multi-currency regime.\n\nHeads of schools and responsible authorities are, therefore, warned to abide by this directive and refrain from mandating parents to buy uniforms and stationery exclusively at their schools, Mhike was quoted by State media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/10055402/20250109_133141-scaled.jpg",
            "description": "<p>By Staff Reporter  PARENTS and guardians of school-going children are facing a torrid time preparing learners for the new 2025 calendar year that kicks off next Tuesday, January 14. It is particularly burdening for those with children progressing from Early Childhood Development (ECD) to Grade One, and from Grade Seven into secondary school as pupils need</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/choked-zimbabweans-decry-high-cost-of-education-as-schools-anticipate-opening-for-2025-calendar/\">Choked Zimbabweans decry high cost of education as schools anticipate opening for 2025 calendar</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "Attack on Chad’s presidential palace leaves 19 dead",
            "url": "https://www.newzimbabwe.com/attack-on-chads-presidential-palace-leaves-19-dead/",
            "content": "By Associated Press\n\nNDJAMENA, Chad (AP)  An attack on Chads presidential palace left 18 assailants dead and six in custody, with one soldier killed and three wounded, state media reported Thursday.\n\nThe attack on Wednesday night occurred while Chadian President Mahamat Deby Itno was inside the palace, but authorities said the situation was quickly brought under control.\n\nThe situation is completely under control. There is no fear, Foreign Affairs Minister Abderaman Koulamallah said while surrounded by soldiers in a live Facebook broadcast filmed inside what appeared to be a quiet presidential palace late Wednesday.\n\nIn an interview with state TV, Koulamallah praised the vigilance of the palace guards, describing the attackers as disorganized and intoxicated by alcohol and drugs. When asked if the attack was terrorism, he said it was probably not, as the attackers were local youths from the capital, NDjamena.\n\nThe attack occurred the same day as a visit by Chinese Foreign Minister Wang Yi, who congratulated Deby Itno on reestablishing constitutional order.\n\nIn the immediate aftermath, rumors spread online that the attack was the work of Islamic militant group Boko Haram.\n\nBoko Haram, which launched an insurgency more than a decade ago against Western education, seeks to establish Islamic law in Nigerias northeast. The insurgency has spread to neighboring West African countries including Cameroon, Niger and Chad.\n\nChad, a country of nearly 18 million people, has been reeling from political turmoil before and after a controversial presidential election that resulted in Deby Itnos victory. He had led the country as interim president during the period of military rule that followed the death of his father in 2021.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/10050537/download-2-1.webp",
            "description": "<p>By Associated Press N’DJAMENA, Chad (AP) — An attack on Chad’s presidential palace left 18 assailants dead and six in custody, with one soldier killed and three wounded, state media reported Thursday. The attack on Wednesday night occurred while Chadian President Mahamat Deby Itno was inside the palace, but authorities said the situation was quickly</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/attack-on-chads-presidential-palace-leaves-19-dead/\">Attack on Chad’s presidential palace leaves 19 dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "Chemicals from Chinese-owned mines caused deaths of 19 hippos— claims CNRG",
            "url": "https://www.newzimbabwe.com/chemicals-from-chinese-owned-mines-caused-deaths-of-19-hippos-claims-cnrg/",
            "content": "By Tapiwa Svondo\n\nTHE recent deaths of 18 hippopotamus in Sapi Safari Area and one in Chirundu was due to poisonous substances used in open cast mining at Chinese-owned establishments, the Centre for Natural Resource Governance (CNRG) has said.\n\nThe claim flies in the face of preliminary findings by the Zimbabwe National Parks and Wildlife Authority (ZimParks), which said the giant mammals succumbed to malnutrition.\n\nIn a statement, CNRG said mining activities were decimating wildlife habitats, hence various species were dying at an alarming rate.\n\nThe sudden and significant loss of these hippos highlights potential underlying environmental issues, such as habitat degradation, water pollution, or the detrimental effects of human activities in the area.\n\nThis incident underscores the urgent need for stronger wildlife conservation efforts and stricter enforcement of environmental regulations to safeguard Zimbabwes rich biodiversity, said the environment watchdog.\n\nCNRG noted that processes used by Chinese to extract gold is contributing to the deaths of animals due to toxic mining chemicals that enter the soil and water.\n\nIn a broader context, CNRG is alarmed by the rapid growth of large-scale open-cast mining operations across Zimbabwe in the past five years, particularly those led by Chinese nationals collaborating with the countrys political elites.\n\nThese mining operations, which often completely disregard the rule of law, have raised serious concerns about their impact on local communities, the environment, and biodiversity.\n\nA particularly controversial practice these operations employ is heap leaching, commonly used in gold recovery. This process involves treating gold ore with a dilute alkaline sodium cyanide solution. While cost-effective for large-scale mining, heap leaching poses significant environmental and health risks.\n\nThe toxic chemicals used in the process can easily contaminate water sources and soil, leading to long-term ecological damage and harm to local populations.\n\nIt is no coincidence that the deaths of white rhinoceros and fish at Lake Chivero and the hippos in the Zambezi Valley occur during the rainy season. The rains wash the poorly disposed cyanide into surface runoff, contaminating rivers and dams. The threat to humans is extremely high, said CNRG.\n\nThe lobby group has called for an immediate investigation into the hippo deaths to implement measures protecting remaining wildlife.\n\nCNRG calls for a thorough investigation into the cause of the deaths of hippos to ensure appropriate measures are taken to protect the remaining wildlife and prevent further losses.\n\nParliament, accused of inaction to stop environmental harm, has been called upon to take decisive action to fix challenges facing local communities. Parliament and other State institutions, CNRG says, risk losing public trust.\n\nParliament should conduct an urgent site visit to Premier Estate, and take prompt, decisive action to address the violations raised in the petition. It is crucial that the concerns of local populations are taken seriously, and that Zimbabwes natural resources are preserved for future generations, reads the statement.\n\nOne of the most concerning examples of this is the case of Sino Africa Huijin, a Chinese mining syndicate operating at Premier Estate in Old Mutare. In 2023, CNRG petitioned Parliament regarding the pollution of the Mutare River-a vital tributary of the Odzi River-caused using heap leaching techniques at this site.\n\nDespite extensive oral evidence hearings involving CNRG, the Environmental Management Agency (EMA), and the Ministry of Mines, which were concluded in May 2024, Parliament has yet to take any action. The lack of a site visit to Premier Estate and the failure to address the petition has led to increasing frustration among local communities, environmental groups, and concerned citizens.\n\nParliament was urged to conduct an urgent site visit to Premier Estate, and take prompt, decisive action to address the violations raised in the petition.\n\nIt is crucial that the concerns of local populations are taken seriously, and that Zimbabwes natural resources are preserved for future generations.\n\nWe urge Parliament to take immediate and decisive action to address the devastating environmental impact of mining activities across the country, said CNRG.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/02022447/Hippo.jpg",
            "description": "<p>By Tapiwa Svondo  THE recent deaths of 18 hippopotamus in Sapi Safari Area and one in Chirundu was due to poisonous substances used in open cast mining at Chinese-owned establishments, the Centre for Natural Resource Governance (CNRG) has said. The claim flies in the face of preliminary findings by the Zimbabwe National Parks and Wildlife</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chemicals-from-chinese-owned-mines-caused-deaths-of-19-hippos-claims-cnrg/\">Chemicals from Chinese-owned mines caused deaths of 19 hippos— claims CNRG</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "Eight years later, woman (21) exposes teen rape by her biological father who will languish 20 years in jail",
            "url": "https://www.newzimbabwe.com/eight-years-later-woman-21-exposes-teen-rape-by-her-biological-father-who-will-languish-20-years-in-jail/",
            "content": "By Staff Reporter\n\nA 42-year-old man has been sentenced to an effective 20 years imprisonment for raping his biological daughter, who later gave birth to a child from the incestuous rape.\n\nAccused person, whose identity was withheld to protect the victim, hails from Chief Hikwa, Dombodema in Plumtree, Matabeleland North.\n\nHe appeared at Plumtree Magistrates Court facing rape charges.\n\nComplainant now aged 21 is the offenders biological daughter and was 13 at the time of commission of the crime.\n\nThe States case was that sometime in 2013, the accused person, his wife and complainant would sleep in the same room.\n\nCourt heard that during one night accused person took advantage of his wifes absence, disembarked from the bed and sneaked into the girls blankets before raping her.\n\nFollowing the dastardly act, assailant silenced complainant saying she would lose a breadwinner if she reported the rape to anyone.\n\nThe State averred that the rape encounters continued until victim fell pregnant. The violations went on even during the girls pregnancy.\n\nIt was heard that immediately after giving birth to a baby girl in 2016, complainant fled to Botswana only to return home in December 2024 with her eight-year-old child.\n\nIn a bid to protect her minor daughter from the rapist, complainant gathered courage and reported the yester-year rape cases to police leading to accused persons arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter  A 42-year-old man has been sentenced to an effective 20 years’ imprisonment for raping his biological daughter, who later gave birth to a child from the incestuous rape. Accused person, whose identity was withheld to protect the victim, hails from Chief Hikwa, Dombodema in Plumtree, Matabeleland North. He appeared at Plumtree Magistrates’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eight-years-later-woman-21-exposes-teen-rape-by-her-biological-father-who-will-languish-20-years-in-jail/\">Eight years later, woman (21) exposes teen rape by her biological father who will languish 20 years in jail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "‘Cheerleaders no more’— says female contestants eyeing vice president, board members posts in ZIFA elections",
            "url": "https://www.newzimbabwe.com/cheerleaders-no-more-says-female-contestants-eyeing-vice-president-board-members-posts-in-zifa-elections/",
            "content": "By Sport Reporter\n\nFOR a number of years, local football administration has been dominated by men, reducing women to cheerleaders.\n\nBut that is now a story of the past, thanks to the new Zimbabwe Football Association (ZIFA) Constitution adopted last year ahead of January 25, 2025, elections, which will usher into power a new executive to take over from the Normalisation Committee.\n\nFor the first time in a ZIFA poll, more than 10 women are going to be participating, thanks to Article 38 of the Constitution, which states that one of the executives two vice presidents should be a woman.\n\nThe move has since encouraged more women to take part in the upcoming elections rather than seating back to their cheerleading roles as in the past.\n\nOf the 10 women contesting in the upcoming plebiscites, five will be battling it out for the vice presidents role. These include, Joyce Kapota, Mavis Gumbo, Patience Mutumwa, Winnert Murota and Loveness Mukura, while the other five are up for board members posts, these include Kudzai Kadzombe, Sibekiwe Ndlovu, Cecillia Gambe, Alice Zeure and Beaullar Musara.\n\nIn as much as the increase in women participation is encouraging, analysts believe that these candidates are fronts used by powerful male football mafias to maintain their grip on Zimbabwean football.\n\nBut is that the case? Well for one of the contesting candidates, Kadzombe, her motivation was mainly to create female role models for young girls out there.\n\nIm driven by the need to fill the gap in terms of female representation in football.\n\nGrowing up, I was inspired by attending Warriors matches in the 90s. Now, I believe its my time to make a meaningful impact through policy formulation and football development, Kadzombe said.\n\nThere is a huge gap when it comes to the girl child; sometimes they are treated as non-existent.\n\nSo, I need to push that each team in the PSL, in any area zones in all the districts and the regions, has a womens team that participates in a league just like men do, Kadzombe was quoted in a media interview recently.\n\nAnother contesting candidate, Mutumwa, said a lot needs to be done for Zimbabwean football to return to its former glory, and as part of her manifesto, she promised an overhaul of the sports administration architecture.\n\nThere are so many things that need to be changed, especially issues to do with constitutionalism, issues to do with marketing brand name ZIFA and issues to do with developmental football,  said Mutumwa.\n\nIn an interview with the media, former FIFA referees instructor Ndlovu revealed that she is basing on her experience in the game, which tracks back to the late 80s when she started as a player.\n\nI started football a long way back in 1985, and l am still in the game, that is passion.\n\nI promise to deliver integrity by that l mean, l need to be honest in everything and be trusted by all stakeholders involved, said Ndlovu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/10044914/23d9c6f1-b3d3-4ff2-a23a-fa824e5804a9-scaled.jpg",
            "description": "<p>By Sport Reporter FOR a number of years, local football administration has been dominated by men, reducing women to cheerleaders. But that is now a story of the past, thanks to the new Zimbabwe Football Association (ZIFA) Constitution adopted last year ahead of January 25, 2025, elections, which will usher into power a new executive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cheerleaders-no-more-says-female-contestants-eyeing-vice-president-board-members-posts-in-zifa-elections/\">‘Cheerleaders no more’— says female contestants eyeing vice president, board members posts in ZIFA elections </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "Kwaito star Doc Shebeleza passes away at the age of 51",
            "url": "https://www.newzimbabwe.com/kwaito-star-doc-shebeleza-passes-away-at-the-age-of-51/",
            "content": "By SABC\n\nSOUTH Africas music industry is mourning the death of another music star. Kwaito music star Victor Bogopane, popularly known as Doc Shebeleza has passed away.\n\nThe Ebumnandini and Gets Getsa hitmaker died at his home in Fairlands, north of Johannesburg, on Thursday morning.\n\nHe was 51.\n\nDoc Shebeleza was admitted to hospital and underwent surgery in December.\n\nHis death comes just days after the death of musician and actor Winnie Khumalo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09151550/e506839a3c374c3b9122c6e702f12b6f.jpg",
            "description": "<p>By SABC SOUTH Africa’s music industry is mourning the death of another music star. Kwaito music star Victor Bogopane, popularly known as Doc Shebeleza has passed away. The “Ebumnandini” and “Gets Getsa” hitmaker died at his home in Fairlands, north of Johannesburg, on Thursday morning. He was 51. Doc Shebeleza was admitted to hospital and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwaito-star-doc-shebeleza-passes-away-at-the-age-of-51/\">Kwaito star Doc Shebeleza passes away at the age of 51</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "Opposition CCC camp suspends self-styled secretary-general Tshabangu as factional fight rages",
            "url": "https://www.newzimbabwe.com/opposition-ccc-camp-suspends-self-styled-secretary-general-tshabangu-as-factional-fight-rages/",
            "content": "By Staff Reporter\n\nOPPOSITION Citizens Coalition for Changes (CCC) all-too-powerful secretary general, Sengezo Tshabangu has been suspended from the party.\n\nThe latest development follows a fallout between Tshabangu and acting president Welshman Ncube opening another chapter of the partys ongoing factional fights.\n\nIn a statement, the CCC aligned to Ncube announced Tshabangus suspension.\n\nActing in terms of Article 9.1.2.3 of the CCC Constitution the Acting President Prof Welshman Ncube has suspended Sengezo Tshabangu with immediate effect, said presidential spokesperson Kurauone Chihwayi.\n\nThis decision was made in light of Tshabangus actions, which were deemed to be in contravention of the partys constitution.\n\nTshabangus suspension is pending a disciplinary hearing, which will be conducted in accordance with the partys internal processes.\n\nHaving been catapulted to prominence after initiating a round of parliamentary and council recalls soon after the August 2023 general elections, Tshabangu stands accused acting in contravention of the partys Constitution.\n\nThe recalls, which were unsuccessfully challenged in court by then party leader Nelson Chamisa, dismantled what was then the strongest opposition to the ruling Zanu PF party.\n\nDespite having been its founder, Chamisa eventually resigned, leaving the party in the hands of Tshabangu, Ncube, Tendai Biti and Harare Mayor Jacob Mafume. Biti was to be forced out.\n\nTimba now leads another distinct CCC faction reportedly loyal to Chamisa.\n\nThis time, Tshabangu stands accused of unilaterally and illegally making appointments to the partys local government caucus and other committees.\n\nOn Thursday last week he appointed Mafume head of the partys local government caucus and named other councillors as officials in a move dismissed by another faction of CCC represented by its spokesperson Willias Madzimure.\n\nThe battle for control of the party between Tshabangu and Ncube has been ongoing since the two reportedly connived to push out other senior members.\n\nTshabangu is also accused of failing to account for government-allocated political party funds released to the opposition formation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Staff Reporter OPPOSITION Citizens Coalition for Change’s (CCC) all-too-powerful secretary general, Sengezo Tshabangu has been suspended from the party. The latest development follows a fallout between Tshabangu and acting president Welshman Ncube opening another chapter of the party’s ongoing factional fights. In a statement, the CCC aligned to Ncube announced Tshabangu’s suspension. “Acting in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-ccc-camp-suspends-self-styled-secretary-general-tshabangu-as-factional-fight-rages/\">Opposition CCC camp suspends self-styled secretary-general Tshabangu as factional fight rages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        },
        {
            "title": "Mbuyiseni Ndlozi resigns as EFF Member of Parliament",
            "url": "https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-as-eff-member-of-parliament/",
            "content": "By News24\n\nPOPULAR Economic Freedom Fighters (EFF) legislator and the partys former national spokesperson, Mbuyiseni Ndlozi, has resigned from Parliament.\n\nThe party announced his resignation on Thursday.\n\nThe Economic Freedom Fighters (EFF) has received the voluntary resignations of fighter Yazini Tetyana and fighter Dr Mbuyiseni Ndlozi as representatives of the EFF in the Parliament of South Africa, read a press statement.\n\nThe voluntary requests to be released from deployment, which were sent to the secretary-general of the EFF (Marshall Dlamini) consecutively and within days of each other, expressed gratitude to the EFF for the opportunity to serve the organisation and the people of South Africa.\n\nThe EFF said it accepted the requests to be released from deployment, adding that they had diligently served the organisation in their respective deployments since the EFF has had representation in the legislative sphere.\n\nNdlozi has served in the National Assembly since 2014.\n\nHe skipped the partys third elective congress which was held in Johannesburg in December, following reports of a fallout with party leader Julius Malema and questions about his future in the party.\n\nTetyana was EFF leader in the Eastern Cape and also served as a member of the Eastern Cape legislature before joining national Parliament.\n\nThey have both been exemplary in their deployments and acted as commendable public representatives, the EFF said as it wished them well in their future endeavours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09110456/220895a3eaa34f428f68223bcc13bdad.jpg",
            "description": "<p>By News24 POPULAR Economic Freedom Fighters (EFF) legislator and the party’s former national spokesperson, Mbuyiseni Ndlozi, has resigned from Parliament. The party announced his resignation on Thursday. “The Economic Freedom Fighters (EFF) has received the voluntary resignations of fighter Yazini Tetyana and fighter Dr Mbuyiseni Ndlozi as representatives of the EFF in the Parliament of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-as-eff-member-of-parliament/\">Mbuyiseni Ndlozi resigns as EFF Member of Parliament </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "10 Jan 2025"
        }
    ]
}