{
    "news": [
        {
            "title": "Musona banks on Kaizer Chiefs experience ahead of Bafana Bafana clash",
            "url": "https://www.newzimbabwe.com/musona-banks-on-kaizer-chiefs-experience-ahead-of-bafana-bafana-clash/",
            "content": "By Sports Reporter\n\nWarriors forward Knowledge Musona will be under the spotlight of South African football fans this Friday when Zimbabwe faces Bafana Bafana in a World Cup Qualifier at Moses Mabhida Stadium.\n\nWhile Zimbabwe will be playing mainly for pride, South Africa will be fighting to keep their World Cup qualification hopes alive, making the encounter one of high stakes and strong emotions.\n\nMusona, who rose to prominence during his successful stint at Kaizer Chiefs, has been a key talking point in the build-up to the match. The 34-year-old striker said returning to South Africa brings back fond memories and added motivation.\n\nI have once played here in South Africa and during my time I did well, so Im looking forward to playing against South Africa, said Musona.\n\nThe game is going to be here in South Africa, so that motivates me a lot as a player who once played here because everyone here knows me as a good player from my time at Kaizer Chiefs. I have to make a repetition of that come Friday.\n\nDuring his time at Kaizer Chiefs, Musona won the 20092010 Rookie of the Year Award and the 20102011 Golden Boot, scoring 15 goals that season.\n\nThe former Warriors captain almost made a return to the Soweto giants in July but instead joined Scottland FC, following a late lucrative offer from the club.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/08052111/musona-k.png",
            "description": "<p>By Sports Reporter Warriors forward Knowledge Musona will be under the spotlight of South African football fans this Friday when Zimbabwe faces Bafana Bafana in a World Cup Qualifier at Moses Mabhida Stadium. While Zimbabwe will be playing mainly for pride, South Africa will be fighting to keep their World Cup qualification hopes alive, making</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musona-banks-on-kaizer-chiefs-experience-ahead-of-bafana-bafana-clash/\">Musona banks on Kaizer Chiefs experience ahead of Bafana Bafana clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Chamisa urges ZEC to learn from Malawi’s electoral example",
            "url": "https://www.newzimbabwe.com/chamisa-urges-zec-to-learn-from-malawis-electoral-example/",
            "content": "By Staff Reporter\n\nFormer Citizens Coalition for Change (CCC) leader Nelson Chamisa has called on the Zimbabwe Electoral Commission (ZEC) to emulate the Malawi Electoral Commission (MEC) in conducting transparentand credible elections.\n\nLast month, Malawians elected former President Peter Mutharika, who was declared the winner after securing 57% of the vote againstLazarus Chakweras 33%. Chakwera, a former pastor, conceded defeat before the final results were announced, calling Mutharika to congratulate him on his historic win.\n\nChamisa contrasted this with Zimbabwes deeply contested electoral history, saying the country has failed to conduct free and fair elections since the turn of the millennium.\n\nIn the 2023 general elections, the Southern African Development Community (SADC) observer mission noted, for the first time since 2008, that Zimbabwes polls did not meet the basic standards of credibility. The elections were marred by logistical chaos, with ZEC failing to deliver voting materials on time in major cities, forcing some polling stations to operate in darkness or reopen the next day\n\nUrban voters, traditionally opposition strongholds, were disproportionately affected by the delays, a situation critics say benefited the ruling Zanu PF, which continues to dominate rural areas.\n\nTaking to X, Chamisa said Zimbabwe should draw lessons from Malawis example of peaceful and credible elections.\n\nZimbabwes Electoral Commission (ZEC) should take notes from Malawis example where results reflect the true will of the people and peaceful transitions are possible, Chamisa said.\n\nHe also condemned the recurring cycle of violence and intimidation surrounding Zimbabwean elections.\n\nSince independence, Zimbabwe has faced violent and contested elections punctuated by a systematic obstruction of democratic change, trapping the nation in a vicious cycle of instability and inexorable conflict. Its time for Zimbabwe to commit to CITIZENOCRACY  an accountable, citizens-centred and citizens-driven system of government, he added.\n\nChamisa recalled the 2008 elections, during which more than 300 opposition supporters were reportedly killed in politically motivated violence, mostly targeting supporters of the late Morgan Tsvangirais Movement for Democratic Change (MDC).\n\nThe opposition leader, who also challenged President Emmerson Mnangagwas victories in 2018 and 2023, has repeatedly accused ZEC of bias and continues to reject Mnangagwas legitimacy.\n\nDespite the controversies, Chamisas then-18-month-old CCC party managed to deny Zanu PF a two-thirds majority in Parliament in the 2023 elections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter Former Citizens Coalition for Change (CCC) leader Nelson Chamisa has called on the Zimbabwe Electoral Commission (ZEC) to emulate the Malawi Electoral Commission (MEC) in conducting transparent and credible elections. Last month, Malawians elected former President Peter Mutharika, who was declared the winner after securing 57% of the vote against Lazarus Chakwera’s 33%. Chakwera,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chamisa-urges-zec-to-learn-from-malawis-electoral-example/\">Chamisa urges ZEC to learn from Malawi’s electoral example</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Three months later, Mnangagwa sits on Inquiry Report as corruption deepens at Mafume-led Harare City Council",
            "url": "https://www.newzimbabwe.com/three-months-later-mnangagwa-sits-on-inquiry-report-as-corruption-deepens-at-mafume-led-harare-city-council/",
            "content": "By Darlington Gatsi\n\nThree months after receiving the Commission of Inquiry Report into the operations of the Harare City Council, President Emmerson Mnangagwa has yet to make its contents public, raising concerns over the governments commitment to addressing deep-rooted corruption at Town House.\n\nThe report, compiled by retired Judge Maphios Cheda and submitted in June 2025, followed more than a year of investigations into allegations of mismanagement, poor service delivery, and financial impropriety at the local authority.\n\nDespite expectations that the findings would help restore order and accountability, the governments silence has sparked fears that corruption will continue unchecked at the Jacob Mafume-led council.\n\nIn an interview with NewZimbabwe.com, Harare Residents Trust (HRT) Director Precious Shumba said the delay in releasing the report was undermining efforts to combat graft within the city administration.\n\nHarare Residents Trust (HRT) Director Precious Shumba\n\nThe Harare Residents Trust appeals to the President to release the report of the Commission of Inquiry into the financial matters of the City of Harare without any further delays.\n\nSince the conclusion of the investigation, there has been unhinged corruption. Officials and councillors have engaged in accelerated looting of council funds and assets, especially land.\n\nMinister Daniel Garwe should use his position to request the President to act in the public interest and save the city of Harare from further deterioration at the hands of cartels, said Shumba.\n\nThe Commission heard evidence of severe mismanagement within the council, with senior officials reportedly prioritising lavish salaries and perks over basic service delivery. Testimonies also exposed how councillors colluded with officials to illegally parcel out land across the capital.\n\nCouncil-owned entities such as Harare Quarry, City Parking, and Rufaro Marketing were cited as hubs of corruption, allegedly used to siphon public funds.\n\nObservers believe the unreleased report could contain damning findings and recommendations likely to implicate senior officials.\n\nValuing the interests and needs of the residents of Harare should be seen in the government releasing the report of the Commission of Inquiry, and taking decisive action against anyone implicated in financial impropriety, Shumba added.\n\nWhen President Mnangagwa established the Commission, it was tasked with eight key objectives, including probing the City Councils financial management systems, adherence to procurement laws, and the handling of property sales and leases.\n\nDuring public hearings, witnesses accused the council of routinely violating regulations, highlighting systemic governance failures.\n\nThe government set up the commission of inquiry at the expense of the taxpayers. The delay in acting against the rot is tantamount to endorsing the abuse of public resources, said Shumba.\n\nThis is not the first time a Mnangagwa-appointed commission has been accused of producing reports that gather dust. The 2018 Motlanthe Commission, established to investigate the military killings of civilians after disputed elections, has yet to see its recommendations implemented.\n\nSimilarly, critics warn the Harare City Council inquiry risks becoming another box-ticking exercise.\n\nDuring his appearance before the Cheda Commission last year, former opposition leader Nelson Chamisa questioned the sincerity of the process.\n\nThis is not the first time a commission has been used as a diversion from addressing real issues. In 2018, Mr. Mnangagwa established the Motlanthe Commission following the disputed General Elections.\n\nI was summoned before the commission over a matter entirely unrelated to me. Now in 2023, the same pattern is repeated, where I am once again being drawn into issues far beyond my purview, said Chamisa.\n\nAs the report remains under wraps, corruption at the Harare City Council continues to erode public trustleaving residents to wonder whether the government will ever act on the Commissions findings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Darlington Gatsi Three months after receiving the Commission of Inquiry Report into the operations of the Harare City Council, President Emmerson Mnangagwa has yet to make its contents public, raising concerns over the government’s commitment to addressing deep-rooted corruption at Town House. The report, compiled by retired Judge Maphios Cheda and submitted in June</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-months-later-mnangagwa-sits-on-inquiry-report-as-corruption-deepens-at-mafume-led-harare-city-council/\">Three months later, Mnangagwa sits on Inquiry Report as corruption deepens at Mafume-led Harare City Council</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "South Africa extends Zimbabwe’s Exemption Permit by 18 months",
            "url": "https://www.newzimbabwe.com/south-africa-extends-zimbabwes-exemption-permit-by-18-months/",
            "content": "By Leopold Munhende\n\nSOUTH Africa has extended the validity of the Zimbabwean Exemption Permit (ZEP) until May 28, 2027.\n\nIntroduced as a means to control the influx of Zimbabwean migrants prior to 2009, the validity of the ZEP has been constantly extended to bar their deportation and allow them work opportunities.\n\nHome Affairs Minister Leon Amos Schreiber announced the extension in a public notice,Ministers Immigration Directive No. 21 of 2025, released this week.\n\nI have decided to extend the validity of the Zimbabwean Exemption Permits (ZEP) until 28 May 2027, read Schreibers directive.\n\nI directed that existing ZEPs shall be deemed to remain valid for an additional 18 months after the current expiry date of 28 November 2025.\n\nThe November 28 expiration date had been set by another extension in November last year, months after a decision to terminate the ZEP was challenged and deemed illegal by the South African High Court.\n\nAccording to a 2022 census, there are a million Zimbabweans in South Africa, with estimates putting the number at five million when considering those who migrate through illegal entry points.\n\nThe one million represented 45% of South Africas immigrant population then.\n\nFleeing economic and political strife, Zimbabweans have for decades found it easy to move to their southern neighbours despite growing discontent.\n\nIllegal openings along the Limpopo border have served millions since the hyperinflation period in the 2000s, when many chose to move down south.\n\nIn April this year, Schreiber appointed an Immigration Advisory Board (IAB) to deliberate on the ZEP and other related matters.\n\nThe IAB is yet to find a permanent solution to the ZEP.\n\nAdded Schreiber: The IAB has met on several occasions and deliberated amongst themselves on the immediate future and a long-term solution for holders of ZEP permits.\n\nCritical stakeholders will need to be part of a consultation process.\n\nAlthough South Africa has generally been proven unfriendly to foreigners, a campaign specifically against migrants without permits is currently dominating its industrial capital, Johannesburg.\n\nReferred to as Operation Dudula, a ragtag unit of vigilantes, they would initially hunt and capture for deportation any undocumented foreigner.\n\nThe group has extended its tentacles in public hospitals where it has barred foreigners from getting medical assistance and public schools where children of foreign nationals are being barred from accessing basic education.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>By Leopold Munhende SOUTH Africa has extended the validity of the Zimbabwean Exemption Permit (ZEP) until May 28, 2027. Introduced as a means to control the influx of Zimbabwean migrants prior to 2009, the validity of the ZEP has been constantly extended to bar their deportation and allow them work opportunities. Home Affairs Minister Leon</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-extends-zimbabwes-exemption-permit-by-18-months/\">South Africa extends Zimbabwe’s Exemption Permit by 18 months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Government slashes business licence fees",
            "url": "https://www.newzimbabwe.com/government-slashes-business-licence-fees/",
            "content": "By Alois Vinga\n\nIn a bold move to improve the ease of doing business, the government has embarked on a sweeping reform of the countrys licensing framework, aimed at cutting bureaucratic inefficiencies and aligning with global best practices.\n\nThe latest efforts are designed to lower operational costs, reduce redundant charges, and simplify procedures, positioning Zimbabwe as a more attractive destination for both local and foreign investors.\n\nSpeaking at a Post-Cabinet Media Briefing in Harare on Tuesday, Minister of InformationJenfan Muswere said the cabinet had approved several key measures to revamp the business environment.\n\nCabinet has approved significant reductions and eliminations of business licence fees to foster private sector growth and reduce barriers to entry, he said.\n\nA major feature of the overhaul is the consolidation of multiple, overlapping licence requirements into a single, streamlined business licence. The government will also remove redundant permits and reduce or eliminate high fees that have long hindered business operations, particularly in the wholesale and retail sectors.\n\nUnder the new framework, the Liquor licence application fee will be reduced from US$1,080 for wholesalers to just US$20 across all sectors, significantly improving access for small and medium enterprises.\n\nThe Medicines Control Authority of Zimbabwe (MCAZ) will scrap the US$200 fee previously charged for trading in veterinary products, while the local bakery licence fee of US$703 will be abolished entirely. In addition, local authority licence fees will be capped to ensure uniformity nationwide.\n\nMuswere noted that the changes were part of an ongoing process, with further refinements expected before the new regulations are gazetted.\n\nFinance Minister Professor Mthuli Ncube acknowledged that high local authority fees had discouraged investment, adding that their reduction would help stimulate private sector participation, a critical driver for maintaining economic growth above six percent.\n\nMeanwhile, Lands, Agriculture, Fisheries, Water, and Rural Development MinisterAnxious Masuka highlighted ongoing progress in water infrastructure development, with 12 new dams currently under construction.\n\nHe said these projects are vital for strengthening the agricultural sectors resilience to climate change and ensuring long-term food security.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga In a bold move to improve the ease of doing business, the government has embarked on a sweeping reform of the country’s licensing framework, aimed at cutting bureaucratic inefficiencies and aligning with global best practices. The latest efforts are designed to lower operational costs, reduce redundant charges, and simplify procedures, positioning Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-slashes-business-licence-fees/\">Government slashes business licence fees</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Mutodi removed as Parliamentary Committee chair over bribery claims against Finance Ministry PS Guvamatanga",
            "url": "https://www.newzimbabwe.com/mutodi-removed-as-parliamentary-committee-chair-over-bribery-claims-against-finance-ministry-ps-guvamatanga/",
            "content": "By Staff Reporter\n\nBikita South MP Energy Mutodi has been removed from his position as Chairperson of Parliaments Portfolio Committee on Budget, Finance and Economic Development following allegations he made against Finance Ministry Permanent Secretary George Guvamatanga, accusing him of receiving multi-million dollar kickbacks from government contractors.\n\nIn a post on X last week, Mutodi claimed Parliament had received complaints regarding Guvamatangas conduct and alleged that he was demanding payments of between 5% and 10% from ministries and departments to facilitate Treasury disbursements.\n\nMutodi further alleged that Guvamatangas wealth, which he said includes several mansions and over 5,000 dairy cattle, was built from illicit proceeds amounting to more than US$1 billion.\n\nThe MP repeated his claims in Parliament, calling for Guvamatanga to be summoned to clear his name, before later retracting the allegations and issuing a public apology.\n\nA letter seen byNewZimbabwe.comfrom Speaker of Parliament Jacob Mudenda informed Mutodi of his dismissal from the committee chairmanship. He has since been replaced by Chipinge East MP Lincoln Dhliwayo.\n\nThis serves to notify you that pursuant to Standing Order No. 19 of the National Assembly, the Committee on Standing Rules and Orders (CSRO) has resolved to terminate your tenure as Chairperson of the Portfolio Committee on Budget, Finance and Investment Promotion with immediate effect.\n\nConsequently, all benefits and entitlements attendant upon the said role shall likewise be discontinued forthwith. Please be guided accordingly, reads the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/05195520/Energy-Mutodi.jpg",
            "description": "<p>By Staff Reporter Bikita South MP Energy Mutodi has been removed from his position as Chairperson of Parliament’s Portfolio Committee on Budget, Finance and Economic Development following allegations he made against Finance Ministry Permanent Secretary George Guvamatanga, accusing him of receiving multi-million dollar kickbacks from government contractors. In a post on X last week, Mutodi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutodi-removed-as-parliamentary-committee-chair-over-bribery-claims-against-finance-ministry-ps-guvamatanga/\">Mutodi removed as Parliamentary Committee chair over bribery claims against Finance Ministry PS Guvamatanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Edson Sithole: New book uncovers the work of a thinker, lawyer and Zimbabwean freedom fighter who ‘disappeared’",
            "url": "https://www.newzimbabwe.com/edson-sithole-new-book-uncovers-the-work-of-a-thinker-lawyer-and-zimbabwean-freedom-fighter-who-disappeared/",
            "content": "The Conversation\n\nEdson Sitholewas born in what was then Southern Rhodesia in 1935. He was the first black person in southern Africa to obtain a Doctor of Laws degree. He was the second black person in the country (which became Zimbabwe in 1980) to qualify as a lawyer, and co-founded Rhodesias African Bar Association in 1973.\n\nSithole was an anti-colonial nationalist. He was disappeared alongside his secretary, Miriam Mhlanga, in downtown Salisbury (present-day Harare) 50 years ago. Brooks Marmon, a historian of Zimbabwes liberation struggle, has compiled and edited aforthcoming collectionof Sitholes writings, speeches and interviews.\n\nHe was one of the most prominent pan-African nationalists who had not gone into exile, a major legal and intellectual force behind multiple Zimbabwean liberation movements.\n\nDespite his important intellectual and organisational contributions to Zimbabwes independence struggle, he is best remembered today for the sensational nature of his elimination from the political scene. He left the Rhodesian press club at a downtown hotel in Salisbury on 15 October 1975, and was never seen again.\n\nThe 50th anniversary of Sitholes elimination is an apt time to recover his political voice. Sithole was a prolific writer but much of his work appeared in periodicals that were banned and silenced by settler authorities.\n\nThe contributions in the book highlight four themes: Sitholes views on pan-Africanism; his experience as a political prisoner; his views on intra-nationalist factionalism; and his search for a settlement with white Rhodesians.\n\nSitholes voice is supplemented by my own biographical account of his political life.\n\nGiven Zimbabwes struggles with political pluralism, the section on factionalism is especially illuminating. A recurring theme is Sitholes rivalry with one of the leading protagonists of Zimbabwes liberation struggle,Joshua Nkomo. Coupled with Sitholes overlooked membership in several breakaway liberation movements, a holistic view of his independent character emerges.\n\nThis was particularly notable in an era in which an absolute commitment to unity was a key facet of the defining ideology of the struggle,pan-Africanism.\n\nSithole was an executive member of four Zimbabwean liberation movements. In 1964 he became the publicity secretary of Zanu-PF, Zimbabwes current ruling party, then known as the Zimbabwe African National Union. He was that partys chief spokesperson 60 years ago this November when the colonys small white minorityunilaterally declared its independencefrom Britain.\n\nThe last decade of Sitholes life was spent trying to end this rebellion and usher in genuine independence under majority rule.\n\nWhen the Conservative British government appeared poised to reach a settlement favourable to continued white domination, Sithole co-founded the African National Council (ANC) in December 1971. Its opposition to the tentative accord forced the British government to abandon that effort to reconcile with their settler kith and kin in Rhodesia.\n\nWhite minority rule dragged on for eight more years and thousands lost their lives in the struggle to affect a change, including Sithole.\n\nSitholes intellectual profile was particularly impressive as he spent more than half of his adult life as a political prisoner. He was first detained in 1959 at the age of 23. He completed a masters degree in law from the University of London via correspondence during that first stint of restriction. During a second period of imprisonment, he completed most of his work toward a Doctor of Laws from the University of South Africa.\n\nIn April 1974, the hardline Estado Novo regime in Portugal was overthrown in amilitary coup. It soon became clear that Portugal would dismantle its colonial empire, including Mozambique and Angola.\n\nThis development transformed the political scene in southern Africa. White Rhodesia was deprived of a major European ally and a secure border on its eastern flank. At the end of that year, all four of Zimbabwes major liberation movements united under the banner of the African National Council in Zambia.\n\nFor some of the most prominent Zimbabwean nationalists, such as Nkomo and Robert Mugabe, the Portuguese revolution resulted in their release from prison, culminating in their ascent to political power in independent Zimbabwe in early 1980.\n\nSithole, however, experienced no fruits of dtente. Instead he became enmeshed in a political struggle with both the settler state and his erstwhile nationalist colleagues.\n\nIn early June 1975, intra African National Council violence erupted between factions loyal to its head, Abel Muzorewa, whom Sithole backed, and Nkomo, a long-time foe of Sithole, who had headed the Zimbabwe African Peoples Union.\n\nNearly a dozen people were killed and Sithole was manhandled by Nkomo loyalists.\n\nNear the end of the month, Sithole released a document which claimed that Nkomo and prime minister Ian Smith had reached a secret deal to elevate Nkomo to the head of the African National Council. Days later, Sithole developed severe stomach cramps. He declared that the settler statehad poisoned him, an allegation backed by a Zambian doctor who treated him.\n\nTensions increased. The last month of Sitholes life was consumed by attempts to derail any possible attempt by Nkomo and the Zapu element in the African National Council to reach an accord with the Rhodesian state.\n\nOn Sitholes last day as an independent man  15 October 1975  he held a press conference which accused the settler state of favouring Nkomo, whose faction had recently been allowed to hold a massive open-air meeting.\n\nTwo detectives visited Sithole at his office that afternoon and took a statement.\n\nThat evening, he made the short drive to the Ambassador Hotel in his blue BMW for drinks at the Quill Club.\n\nSithole left the hotel around 7pm, where a witness outside saw him met by two white and two black men who identified themselves as belonging to Rhodesias Special Branch. They escorted Sithole and his secretary into a grey Mazda van, a make typically associated with the renegade states security apparatus.\n\nInternational media accounts identified Detective Inspector Winston Hart and Detective Section Officer George Mitchell as the two white men. As recently as April 2023, an interview with Hart about his service in Rhodesiapopped up on YouTube.\n\nSithole was never seen again, although persistent rumours claimed that he had been seen in various government detention centres.\n\nSithole was just one of tens of thousands of individuals who died during Zimbabwes independence struggle.\n\nUnlike South Africa, Zimbabwe did not embrace any formal transitional justice mechanism following independence. After Mugabe was voted into power, he announced:\n\nWe will be interested to get some evidence as to what happened to Dr. Sithole. (16 March 1980 issue of the Zimbabwean Sunday Mail)\n\nNothing substantial ever came out of the inquiry.\n\nResearch Associate in the Department of Historical and Heritage Studies, University of Pretoria\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/04203121/edson-sithole.webp",
            "description": "<p>The Conversation Edson Sithole was born in what was then Southern Rhodesia in 1935. He was the first black person in southern Africa to obtain a Doctor of Laws degree. He was the second black person in the country (which became Zimbabwe in 1980) to qualify as a lawyer, and co-founded Rhodesia’s African Bar Association in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/edson-sithole-new-book-uncovers-the-work-of-a-thinker-lawyer-and-zimbabwean-freedom-fighter-who-disappeared/\">Edson Sithole: New book uncovers the work of a thinker, lawyer and Zimbabwean freedom fighter who ‘disappeared’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Daring thief targets President’s and Home Affairs offices, steals property worth over US$23,000",
            "url": "https://www.newzimbabwe.com/daring-thief-targets-presidents-and-home-affairs-offices-steals-property-worth-over-us23000/",
            "content": "By Mary Taruvinga\n\nNotorious theft suspect Romeo Kurai Pemba (39), once convicted of theft in 2015,has once again found himself in court, this time accused of breaking into multiple government offices, including those under the Office of the President and Cabinet, and stealing property worth over US$23,000.\n\nPemba was arrested on October 2, 2025, after an extensive investigation by the CID Stores and Business Unitin Harare. According to police, he was captured on CCTVcommitting the crimes and later led detectives to the recovery of part of the stolen propertyvalued at US$1,400.\n\nHe appeared before Harare magistrate Tapiwa Kuhudzai, who remanded him in custody after he pleaded to all nine counts of unlawful entry. His plea recording is expected to continue on Tuesday before sentencing.\n\nThe State alleges that between June and September 2025, Pemba went on a burglary spree targeting high-security government officeslocated in Mukwati and Kaguvi Buildings, including those belonging to the Office of the President and Cabinet, the Ministry of Home Affairs, the Ministry of Womens Affairs, Gender and Wellness, and ZimStat.\n\nPemba allegedly used unknown tools to force open office doors and stole laptops, CPUs, monitors, and other electronic equipment. Several items have since been positively identifiedby the affected departments.\n\nThe accused person was captured on CCTV committing the crime and the footage is held as an exhibit, reads part of the police remand request. He led to the recovery of part of the stolen property and indicated how he committed the crime. Fingerprints uplifted at the scene matched those of the accused.\n\nPolice strongly opposed bail, citing Pembas previous conviction and high flight risk. Detective Assistant Inspector Christopher Lloyd Tarenyikastated that Pemba has no fixed addressand could easily abscond or interfere with witnesses.\n\nThe accused person has known previous convictions under CRB HREP 10833/15, Tarenyika said. He is facing a serious offence which, if convicted, attracts a lengthy custodial sentence. There is overwhelming evidence linking him to the crime, and if granted bail, he may abscond or interfere with witnesses.\n\nThe charges fall under Section 131(1)(a)as read with Section 131(2)(e)of the Criminal Law (Codification and Reform) Act [Chapter 9:23], which covers aggravated unlawful entry.\n\nPembas latest arrest adds to his record of theft-related offences. Police say he was convicted in 2016following similar allegations. Investigations into related cases are ongoing, with at least 15 witnessesexpected to testify. The total value of stolen property is pegged at US$23,020, with only a fraction recovered so far.\n\nHe remains in custody pending his next court appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga Notorious theft suspect Romeo Kurai Pemba (39), once convicted of theft in 2015, has once again found himself in court, this time accused of breaking into multiple government offices, including those under the Office of the President and Cabinet, and stealing property worth over US$23,000. Pemba was arrested on October 2, 2025, after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/daring-thief-targets-presidents-and-home-affairs-offices-steals-property-worth-over-us23000/\">Daring thief targets President’s and Home Affairs offices, steals property worth over US$23,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "UNDP, government launch innovative zero-emission cooling system to tackle climate impacts",
            "url": "https://www.newzimbabwe.com/undp-government-launch-innovative-zero-emission-cooling-system-to-tackle-climate-impacts/",
            "content": "UNDP\n\nThe United Nations Development Programme (UNDP), in partnership with the Ministry of Environment, Climate and Wildlife; Ministry of Power and Energy Development; and Scientific and Industrial Research and Development Centre (SIRDC) today launched theLow Temperature Evaporative Cooling System (LTEIHT-AC) an innovative, zero-emission cooling technology designed to provide sustainable and affordable temperature control in Zimbabwes increasingly warming climate.\n\nDeveloped byPhokeng Global Health and Environmental Solutions, the Evaporative Cooling System leverages atmospheric enthalpy and water evaporation to produce cooling effects without relying on electricity or ozone-depleting refrigerants. Built using locally available materials, the system is both environmentally friendly and economically accessible, offering a scalable solution to Zimbabwes energy and climate resilience challenges.\n\nThis initiative represents a practical example of climate innovation in Zimbabwe  a solution that not only reduces greenhouse gas emissions but also empowers communities through local manufacturing and skills development, saidDr. Ayodele Odusola, UNDP Resident Representative. By investing in sustainable technologies like this, we are helping to ensure that no one is left behind in the transition to a greener, more resilient future.\n\nKey Highlights of the Event:\n\nTheEvaporative Cooling System Inception Meeting, held at UNDPs Harare offices, marked a significant milestone in Zimbabwes transition toward climate-resilient and energy-efficient technologies. The event brought together key stakeholders from government, academia, the private sector, and development partners to discuss the systems design, applications, and roadmap for national deployment.\n\nA highlight of the event was theformal introduction of the prototypefrom Phokeng Global Health and Environmental Solutions to the Scientific and Industrial Research and Development Centre (SIRDC), symbolizing the transition from design to institutional adoption and field testing. The technology will undergo pilot testing and performance monitoring in selected communities, with results informing wider national rollout.\n\nThe system directly supports the National Climate Change Policy (2017), the Energy Efficiency Policy (2024), and Zimbabwes Nationally Determined Contributions (NDC 3.0). It also contributes to the achievement of Sustainable Development Goals (SDGs) 7, 9, and 13, advancing access to clean energy, innovation, and climate action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07072932/undp-scaled.jpg",
            "description": "<p>UNDP The United Nations Development Programme (UNDP), in partnership with the Ministry of Environment, Climate and Wildlife; Ministry of Power and Energy Development; and Scientific and Industrial Research and Development Centre (SIRDC) today launched the Low Temperature Evaporative Cooling System (LTEIHT-AC) — an innovative, zero-emission cooling technology designed to provide sustainable and affordable temperature control in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/undp-government-launch-innovative-zero-emission-cooling-system-to-tackle-climate-impacts/\">UNDP, government launch innovative zero-emission cooling system to tackle climate impacts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Zimplow cuts losses by 70% as cost controls, asset sales pay off",
            "url": "https://www.newzimbabwe.com/zimplow-cuts-losses-by-70-as-cost-controls-asset-sales-pay-off/",
            "content": "By Alois Vinga\n\nZimplow Holdings Limited has significantly reduced its losses in the first half of 2025, reporting a deficit of US$499,500,a 70% improvement from the US$1.66 million loss recorded during the same period last year.\n\nThe turnaround follows the companys aggressive cost-cutting measures, which included staff reductionsand streamlined administrative expenses. Zimplow also disposed of outdated equipment to free up capital for reinvestment. Proceeds from the sale of its Dagenham Road property have been channelled toward the establishment of a new mining and logistics hub in Msasa.\n\nThe groups strategic shift toward the mining sector is part of efforts to cushion itself from the volatility of the agriculture industry. However, a poor weather outlook,with forecasts predicting below-average rainfall,is expected to weigh heavily on its agriculture-focused subsidiaries, Farmec and Mealie Brand, which depend on rain-fed farming. This could dampen sales and create financial pressure, compounded by potential inventory build-ups from trade loans that may increase storage costs and force price cuts.\n\nDespite these headwinds, Zimplows mining-related operations remain robust. Subsidiaries such as Scanlink and Tractive Power Solutions continue to perform well, buoyed by sustained demand for heavy equipment in Zimbabwes mining sector. Similarly, Powermec is benefiting from increased demand for solar-powered generators amid persistent power shortages caused by drought conditions.\n\nThe company is also exploring drought-adaptive innovations, including modular irrigation kits and scalable solar power solutions, to diversify its revenue streams.\n\nHowever, smuggling continues to undermine operations at Trentyre and CT Bolts, with the influx of grey market imports eroding revenues.\n\nZimplows diversification strategy, supported by cost discipline and its pivot toward mining and renewable energy solutions, positions the group for potential recovery in the second half of 2025,provided it successfully navigates the prevailing economic and regulatory challenges.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/18224140/Zimplow.jpeg",
            "description": "<p>By Alois Vinga Zimplow Holdings Limited has significantly reduced its losses in the first half of 2025, reporting a deficit of US$499,500, a 70% improvement from the US$1.66 million loss recorded during the same period last year. The turnaround follows the company’s aggressive cost-cutting measures, which included staff reductions and streamlined administrative expenses. Zimplow also disposed of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimplow-cuts-losses-by-70-as-cost-controls-asset-sales-pay-off/\">Zimplow cuts losses by 70% as cost controls, asset sales pay off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "08 Oct 2025"
        }
    ]
}