{
    "news": [
        {
            "title": "Burkina Faso’s military govt arrests European NGO workers for ‘spying’",
            "url": "https://www.newzimbabwe.com/burkina-fasos-military-govt-arrests-european-ngo-workers-for-spying/",
            "content": "Al Jazeera\n\nBurkina Fasos military government says it has arrested eight people working for a humanitarian organisation, accusing them of spying and treason, allegations the Dutch nonprofit categorically rejected.\n\nBurkina Fasos Security Minister Mahamadou Sana said the eight people arrested worked for the International NGO Safety Organisation (INSO), a Netherlands-based group specialising in humanitarian safety.\n\nThose detained included a French man, a French-Senegalese woman, a Czech man, a Malian and four Burkinabe nationals, Sana said, alleging the staff members had continued working for the organisation after it was banned for three months, for allegedly collecting sensitive data without authorisation.\n\nThe security minister claimed some of INSOs staff had continued to clandestinely or covertly conduct activities such as information collection and meetings in person or online following the ban, including its country director, who had also previously been arrested when the suspension came into effect at the end of July.\n\nSana said the INSO staff members had collected and passed on sensitive security information that could be detrimental to national security and the interests of Burkina Faso, to foreign powers.\n\nThe Hague-based humanitarian organisation issued a statement on Tuesday saying it categorically rejected the allegations about its activities in Burkina Faso.\n\n[We] remain committed to doing everything in our power to secure the safe release of all our colleagues, INSO said in the statement.\n\nINSO also said it collects information exclusively for the purpose of keeping humanitarians safe, and that the information it gathers is not confidential and is largely already known to the public.\n\nBurkina Fasos military government has turned away from the West and, in particular, its former colonial ruler, France, since seizing power in a September 2022 coup.\n\nTogether with neighbouring Mali and Niger, which are also ruled by military governments, it has also withdrawn from regional and international organisations in recent months, with the three countriesforming their own blocknown as the Alliance of Sahel States.\n\nThe three West African countries have also wound back defence cooperation with Western powers, most notably their former colonial ruler,France, in favour of closer ties with Russia, including Niger nationalising a uranium mine operated by French nuclear firmOrano.\n\nWithin the three countries, the military governments are fighting armed groups linked to al-Qaeda that control territory and have staged attacks on army posts.\n\nHuman Rights Watch and other advocacy groups have accused the fighters, the military and partner forces of Burkina Faso and Mali of possible atrocities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17174007/traore.webp",
            "description": "<p>Al Jazeera Burkina Faso’s military government says it has arrested eight people working for a humanitarian organisation, accusing them of “spying and treason”, allegations the Dutch nonprofit “categorically” rejected. Burkina Faso’s Security Minister Mahamadou Sana said the eight people arrested worked for the International NGO Safety Organisation (INSO), a Netherlands-based group specialising in humanitarian safety.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/burkina-fasos-military-govt-arrests-european-ngo-workers-for-spying/\">Burkina Faso’s military govt arrests European NGO workers for ‘spying’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "08 Oct 2025"
        },
        {
            "title": "Jazzworx and Thukuthela to headline Afro-house festival in Zimbabwe",
            "url": "https://www.newzimbabwe.com/jazzworx-and-thukuthela-to-headline-afro-house-festival-in-zimbabwe/",
            "content": "The South African\n\nThe sensational duo Kgotso Thukuthela Dube and Kamohelo Jazzworx Monese are set to perform in Zimbabwe for the first time.\n\nThe pair will headline the 7th edition of HiNDE at Mystique Gardens in Bulawayo, Zimbabwe on 29 November.\n\nKnown for their electrifying 3-step dance house, the pair have become major forces in Southern Africasmusic scene.\n\nTheir groove-packed, polished tracks dominate streaming platforms and top The Official SA Charts, making this debut a must-see for Afro-house fans.\n\nSunday Worldreports that the duo cut ties with some friends and relocated after experiencing atraumatic house robbery.\n\nJust weeks before releasing their 13-track album, armed robbers invaded their home, kidnapped Jazzworx, and held their friend and fellow musician Gobokweone GL Ceejay Lekganyane captive.\n\nJazzworx and Thukuthela remain relatively new in the business but have picked up valuable experience.\n\nWe are learning about the business side of the music industry. We had a dream but didnt see ourselves reaching international standards so soon, Thukuthela toldSunday World.\n\nOur music is being recognised globally.\n\nHiNDEhave confirmed on their social media pages that Jazzworx and Thukuthela will headline their upcoming event.\n\nHiNDE is a recurring Afro-house music and culture event that takes place in Zimbabwe.\n\nSince its launch in 2021, HiNDE has grown beyond a typical night out. It has become a vibrant platform where local and international DJs share the stage.\n\nThis edition promises to elevate Bulawayos house music scene even further as Jazzworx and Thukuthela bring their signature energy to Zimbabwean audiences for the very first time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07055811/thukuthela.webp",
            "description": "<p>The South African The sensational duo  Kgotso “Thukuthela” Dube and Kamohelo “Jazzworx” Monese are set to perform in Zimbabwe for the first time. The pair will headline the 7th edition of HiNDE at Mystique Gardens in Bulawayo, Zimbabwe on 29 November. Jazzworx and Thukuthela making waves Known for their electrifying 3-step dance house, the pair</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jazzworx-and-thukuthela-to-headline-afro-house-festival-in-zimbabwe/\">Jazzworx and Thukuthela to headline Afro-house festival in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "08 Oct 2025"
        },
        {
            "title": "Supreme Court resurrects US$8 million chrome feud in Guruve Dyke",
            "url": "https://www.newzimbabwe.com/supreme-court-resurrects-us8-million-chrome-feud-in-guruve-dyke/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has granted chrome miner Monochrome (Pvt) Ltd permission to revive its appeal in a long-running multimillion-dollar mining battle, ruling that the company has bright prospects of success in its US$8.1 million damages claim against rivals Kehrai Investments and Labenmon Investments.\n\nThe judgment, delivered by Justice Chinembiri Bhunu condoned Monochromes procedural delays and extended time for the company to file its appeal against a High Court ruling that dismissed its US$8,173,188 claim.\n\nThe courts are generally loath to punish litigants for the sins of their lawyers unless such conduct is gross and unpardonable. The ends of justice demand that whenever possible, justice be dispensed on the merits rather than on technicalities, Bhunu said.\n\nIn 2018, when Monochrome accused Kehrai and Labenmon of illegally mining alluvial chrome on six of its claims in the Guruve North Dyke Msasa 122 to 127 and sued for damages, representing lost profits.\n\nMonochrome argued that surveys by the Ministry of Mines confirmed encroachment, supported by a geological expert who presented diagrams, pictures, and stockpile estimates of the extracted chrome.\n\nThe defendants denied wrongdoing. Kehrai failed to appear, resulting in a default judgment against it, while Labenmon insisted it mined lawfully under a contract with Kehrai, challenging Monochromes ownership and the scale of damages claimed.\n\nIn 2023, the High Court sided with Labenmon, ruling Monochrome had not proved ownership, the extent of extraction, or the US$8 million loss.\n\nBut Bhunu found that the appeal raises weighty issues, especially after Kehrai capitulated by failing to defend ownership of the disputed claims.\n\nThe applicant has sound and reasonable prospects of success on appeal given that the first respondents ownership of the mining claims has been severely dented by the extant default judgment against it, Bhunu ruled.\n\nThe second respondent is merely riding on the back of the first respondent as the source of its mining rights. That being the case, it is likely to fall with the capitulation of its principal.\n\nThe Supreme Court ordered Monochrome to file its appeal within 10 days, paving the way for a full hearing on the merits of the chrome feud.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has granted chrome miner Monochrome (Pvt) Ltd permission to revive its appeal in a long-running multimillion-dollar mining battle, ruling that the company has “bright prospects of success” in its US$8.1 million damages claim against rivals Kehrai Investments and Labenmon Investments. The judgment, delivered by Justice Chinembiri Bhunu condoned Monochrome’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-resurrects-us8-million-chrome-feud-in-guruve-dyke/\">Supreme Court resurrects US$8 million chrome feud in Guruve Dyke</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "08 Oct 2025"
        },
        {
            "title": "Police officer jailed for extorting US$50 from motorist",
            "url": "https://www.newzimbabwe.com/police-officer-jailed-for-extorting-us50-from-motorist/",
            "content": "By James Muonwa\n\nA KAROI based police officer has been sentenced to imprisonment for extorting US$50 from a motorist.\n\nSergeant Paul Mutingoringo Dzimbanhete (32) of Karoi Urban Police Station was slapped with 36 months imprisonment, with six months suspended for five years on condition of good behaviour. He will, therefore, spend an effective 30 months behind bars.\n\nThe State case was that between June 3 and 13, 2025, the offender confiscated a drivers certificate of competency from Olly Mcupi at a roadblock along the Karoi-Nyamambizi road and demanded US$50 for its release.\n\nCourt heard that following a complaint by Mcupis father, Sebastian Kumbirai Chinyemba, a special team from Police General Headquarters (PGHQ) set up a sting operation.\n\nWith instructions from the PGHQ team, Mcupi arranged to meet the rogue cop at TM Supermarket, Karoi, where Dzimbanhete handed back the confiscated certificate in exchange for cash while seated in a Toyota Gaia.\n\nThe police internal investigations team moved in immediatelycapturing the transaction on video. In a dramatic twist, Dzimbanhete swallowed the marked US$50 in a failed attempt to destroy evidence.\n\nOfficers, however, recovered cash and a notebook (ZRP Book 6) showing that he had improperly recorded Mcupis arrest as dangerous parking.\n\nCourt found Dzimbanhete guilty of extortion after altering the earlier preferred charge of criminal abuse of duty as a public officer.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said law enforcement agents must uphold the highest standards of integrity.\n\nEvery officer is expected to serve with honour, professionalism, and respect for the law, the NPAZ noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By James Muonwa A KAROI based police officer has been sentenced to imprisonment for extorting US$50 from a motorist. Sergeant Paul Mutingoringo Dzimbanhete (32) of Karoi Urban Police Station was slapped with 36 months imprisonment, with six months suspended for five years on condition of good behaviour. He will, therefore, spend an effective 30 months</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-jailed-for-extorting-us50-from-motorist/\">Police officer jailed for extorting US$50 from motorist</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "08 Oct 2025"
        },
        {
            "title": "High Court dismisses sex offender’s bid to revive case over ‘crucial witness’",
            "url": "https://www.newzimbabwe.com/high-court-dismisses-sex-offenders-bid-to-revive-case-over-crucial-witness/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out an application by convicted sex offender Levison Popi, who sought to review his trial on the grounds that a key defence witness was not called.\n\nJustice Sinabuliso Siziba, sitting at Mutare High Court, ruled that Popis chamber application, filed five months after his conviction, was an afterthought and lacked merit.\n\nThe explanation for the delay is unreasonable. It defies logic why he would obtain advice at that early stage from his inmates and neglect to inquire from his lawyer, Siziba said.\n\nPopi was convicted on 16 December 2024 of attempted indecent assault under Zimbabwes Criminal Law (Codification and Reform) Act. His initial appeal was struck off the roll in March 2025 for being fatally defective.\n\nHe later argued that the trial magistrate had failed to explain his right to call a witness, Alice Nyanjowa, who has since died. Nyanjowa had previously stated that she was present in the room during the alleged incident but did not observe anything concerning the allegations.\n\nBut the judge found no irregularity in the lower court proceedings.\n\nA perusal of the record indicates in no uncertain terms that the applicant was advised by the trial magistrate of his right to adduce evidence on his own and also through his witnesses. He then testified and also called two witnesses, the judge noted.\n\nThe court further stressed that it was Popis choice, not the courts or the prosecutors, to omit the deceased witness from his defence.\n\nThe prosecutor had no duty or right to choose witnesses for the applicant. He called the other witnesses and left out the very witness that he now complains of having been left out, Siziba ruled.\n\nThe application was dismissed with costs.\n\nPopi was arrested in 2024 after he was accused of attempting to indecently assault a woman. Prosecutors alleged that he made unwanted sexual advances that fell short of full assault but still contravened Zimbabwes criminal statutes.\n\nDuring his trial, Popi denied the allegations and presented two witnesses in his defence. However, the court found the complainants testimony credible and convicted him of attempted indecent assault.\n\nOn appeal, his challenge to the conviction was struck off the roll in March 2025. His latest effort, a chamber application seeking to revive the case by relying on the statement of the now-deceased witness, Alice Nyanjowa has now also failed, leaving his conviction intact.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19055619/mutare.png",
            "description": "<p>By Mary Taruvinga The High Court has thrown out an application by convicted sex offender Levison Popi, who sought to review his trial on the grounds that a key defence witness was not called. Justice Sinabuliso Siziba, sitting at Mutare High Court, ruled that Popi’s chamber application, filed five months after his conviction, was “an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-dismisses-sex-offenders-bid-to-revive-case-over-crucial-witness/\">High Court dismisses sex offender’s bid to revive case over ‘crucial witness’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "08 Oct 2025"
        },
        {
            "title": "Farmer accused of killing two women admits to tossing their bodies into pigsty",
            "url": "https://www.newzimbabwe.com/farmer-accused-of-killing-two-women-admits-to-tossing-their-bodies-into-pigsty/",
            "content": "Sowetan Live\n\nThe Limpopo pig farmer accused of killing two women who were scavenging for food on his property told the court that when he was alerted to the body of one of his victims, he panicked and left the scene until he returned the following day and put it in an empty pigsty.\n\nHe said he had expected the person who accompanied the intruders to come and collect the body. Then when they discovered the second body the following day, he and his employees also put it in a pigsty.\n\nThis is contained in an affidavit of Zachariah Johannes Olivier, which was read out in the Polokwane high court on Tuesday. Olivier denies that he intentionally killed Maria Makgato, 45 and Locadia Ndlovu, 34, in August last year then fed them to the pigs. Ndlovus husband survived the attack.\n\nHe said he had gone to the to spot where the women were shot expecting to see trespassers and he had tried to frighten them by shooting at them.\n\nOlivier, 60, and co-accused William Musora, 50, entered the second day of the trial yesterday. They face charges of murder, attempted murder, employing an illegal immigrant who does not possess a work permit and the possession of an unlicensed firearm.\n\nMusora, a Zimbabwean national, faces a further charge of contravention of the Immigration Act, for being in SA illegally.\n\nOn Monday, in a panicked state, I proceeded to cut up both rifles that were used to shoot the warning shots into pieces, and I disposed of such pieces as I was scared and disgusted with the rifles and what had transpired\n\nZachariah Johannes Olivier, farmer\n\nIn his affidavit, Olivier claims that after the discovery of the two bodies, he panicked and went home before returning the following day to destroy the guns used to shoot the two women.\n\nOn Monday, in a panicked state, I proceeded to cut up both rifles that were used to shoot the warning shots into pieces, and I disposed of such pieces as I was scared and disgusted with the rifles and what had transpired.\n\nI never had any intention of defeating the purpose of the administration of justice. I simply panicked and acted out of an extreme level of shock.\n\nAccording to Olivier, he called the police the following day as I could not deal with the situation any longer.\n\nThe state has since withdrawn charges against another farmworker, Adrian de Wet, 19, who is now a state witness. In his affidavit, Olivier claims that he was with de Wet on the night that the women were shot. De Wet, he claims, also fired shots.\n\nSpeaking to Sowetan outside court, Makgatos grieving mother said she will never forgive those who cut short her daughters life.\n\nWhy did he have to kill my child in such a brutal manner? Why did he not inform the police that people were trespassing on his farm, asked Moyahabo Mokgato.\n\nThe pensioner said she has been battling to take care of her household as well as her late daughters children aged 5, 12, 16 and 22 since Marias death.\n\nAfter they murdered my child, I am now struggling, as I do not work. Im unable to provide for my family.\n\nI cannot forgive them, she said.\n\nDuring proceedings, judge Jane Ngobeni informed the two men that should they be convicted of murder, they face life in prison. If they are first offenders, the sentence wont be less than 15 years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/08052921/limpopo-pig-farmer.jpg",
            "description": "<p>Sowetan Live The Limpopo pig farmer accused of killing two women who were scavenging for food on his property told the court that when he was alerted to the body of one of his victims, he panicked and left the scene until he returned the following day and put it in an empty pigsty. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/farmer-accused-of-killing-two-women-admits-to-tossing-their-bodies-into-pigsty/\">Farmer accused of killing two women admits to tossing their bodies into pigsty</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "08 Oct 2025"
        }
    ]
}