{
    "news": [
        {
            "title": "‘l don’t listen to Winky D’s music and we didn’t ban his music on State radio stations’— Nick Mangwana",
            "url": "https://www.newzimbabwe.com/l-dont-listen-to-winky-ds-music-and-we-didnt-ban-his-music-on-state-radio-stations-nick-mangwana/",
            "content": "By Staff Reporter\n\nINFORMATION Ministry Permanent Secretary, Nick Mangwana has claimed that government has not, at any given time, ordered a ban on Winky Ds songs being played on State-controlled radio stations.\n\nBorn Wallace Chirimuko, Winky D, has faced intense scrutiny ever since the release of his album Eureka Eureka, which features tracks like Ibotso and Dzimba Dzamabwe, alongside his latest 2025 songs Kudhakwa and Propaganda which all remain blacklisted from the State media.\n\nMangwana revealed these statements during an interview with DJ Ollah 7 stating his personal aversion to Winky Ds songs stating he finds them not original questioning the legitimacy of an artist, who uses Jamaican intonation.\n\nDo you wanna have this conversation?, I find nothing original in that. I dont understand someone who comes from Zimbabwe, stays in Zimbabwe, grew up in Zimbabwe and tries to talk Patwa, because Patwa was only spoken by the slaves.\n\nPatwa also came along during the times they spent in the plantations and thats the only language they could speak.\n\nEven in Jamaica its spoken but those who didnt learn, so why would someone from Zimbabwe speak Patwa?. I love something which is authentic, yes I love reggae I will listen to reggae, I love dancehall I will listen to the real dancehall, then when we are in Zimbabwe I want to listen to something that is Zimbabwean.\n\nIm not a fan but I dont say what he does is bad, but for my taste Im not a fan, said Mangwana\n\nOllah posed a question that the people, or rather the government, portray Winky D as someone who fights the government through his word play in songs and there was a time that radio stations stopped playing his songs.\n\nIf he fights it, would he win? When was it? Was I the Permanent Secretary? Because if I was the Permanent Secretary we are the ones who can do that but we never did that and we dont know it.\n\nWe dont even talk about him, somebody is out there trying to earn a living, we allow them to earn a living. Our lives are not defined on binary lines, that its either you are for or against or you are pro Zanu PF, no it doesnt define our lives, we are human beings first, Zimbabweans second and then whatever follows, said Mangwana.\n\nFurthermore, Mangwana dismissed that the government and the traditional media doesnt do propaganda.\n\nThey are wrong, we dont do propaganda, traditional media doesnt do propaganda, what it does is it gives information of course in any information giving you certain ideals that you are promoting and certain agendas that you would want to push but thats not propaganda.\n\nIts just like right now if we call someone to come and talk about anti-drugs, is he giving anti-drugs propaganda? So, if we come and talk about the beauty of the Second Republic, we are not giving propaganda we are just making you see that the Second Republic is something else, argued Mangwana.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/08090848/ZimFest-18.png",
            "description": "<p>By Staff Reporter INFORMATION Ministry Permanent Secretary, Nick Mangwana has claimed that government has not, at any given time, ordered a ban on Winky D’s songs being played on State-controlled radio stations. Born Wallace Chirimuko, Winky D, has faced intense scrutiny ever since the release of his album Eureka Eureka, which features tracks like “Ibotso”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/l-dont-listen-to-winky-ds-music-and-we-didnt-ban-his-music-on-state-radio-stations-nick-mangwana/\">‘l don’t listen to Winky D’s music and we didn’t ban his music on State radio stations’— Nick Mangwana</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "President Mnangagwa spokesperson Charamba admits UZ lecturers’ grievances are justified",
            "url": "https://www.newzimbabwe.com/president-mnangagwa-spokesperson-charamba-admits-uz-lecturers-grievances-are-justified/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwas spokesman, George Charamba, has conceded that University of Zimbabwe (UZ) lecturers, currently picketing and protesting outside the campus gates over what they describe as slave wages, have legitimate grievances that need addressing.\n\nCharamba has pledged to personally intervene.\n\nThrough their union representative, the Association of University Teachers (AUT), the academic staff at UZ have presented a compelling argument regarding their inadequate salaries and appalling working conditions.\n\nThe staff describe their dire financial situation as incapacitated, rendering them unable to perform their duties effectively. They feel like they are running on empty.\n\nWriting on his X account under the pseudonym Jamwanda 2, Charamba acknowledged the credibility of the lecturers cause, stating it warrants immediate attention.\n\nFrankly our university lecturers have a genuine grievance. I will take it up! Charamba declared.\n\nSelf-exiled former Higher and Tertiary Education Minister Professor Jonathan Moyo did not mince his words, accusing the government and UZ management of colluding to condemn lecturers to poverty. He branded their poor wages a national disgrace. He said the current state of affairs is a recipe for disaster.\n\nThe university authorities and the ministry cannot escape the indictment that their inability to redress the situation is a shocking administrative failure and abuse of duty, which has resulted in an intolerable violation of the human dignity of the academic staff at state universities, Moyo wrote on his X feed Friday.\n\nNot only is this a national embarrassment, but it is also a threat to the countrys economic interests with national security implications, Moyo added.\n\nMoyo, who previously championed Science, Technology, Engineering, and Mathematics (STEM) policy implementation as Minister of Higher and Tertiary Education, further stated that it is entirely impossible for Zimbabwe to develop economically without adequate support for academic staff across state universities, who are naturally implementing STEM initiatives at tertiary institutions.\n\nIt would be impossible for Zimbabwe to defeat the enemies of the people, namely; hunger, poverty, disease, ignorance and corruption without the kind of intellectual property that can only come from higher education; particularly but not only through Science, Technology, Engineering and Mathematics (STEM), Moyo wrote.\n\nWhile the UZ academic staff have been languishing in enforced poverty due to the unilateral slashing of their salaries in 2018, the AUT alleges that the UZ management has simultaneously awarded itself lavish packages, including luxury cars and hefty US dollar perks, whilst prioritising non-essential projects at the expense of the welfare and working conditions of the academic staff.\n\nThey said the UZ management seem to be living in a different world.\n\nThe current reduced salary of US$230 includes a local currency component, averaging ZWG 6,000 to 8,000, which amounts to less than US$200.\n\nThe lecturers strike is continuing outside the UZ campus premises, with numbers visibly increasing by the day.\n\nThe AUT members are vowing to continue with the protest until the government and UZ management find a lasting solution.\n\nNewZimbabwe.com understands that all academic services have been suspended at UZ as lecturers continue to demand their pre-October 2018 salaries of US$2,250.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24104115/UZ-strike-10-scaled.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa’s spokesman, George Charamba, has conceded that University of Zimbabwe (UZ) lecturers, currently picketing and protesting outside the campus gates over what they describe as slave wages, have legitimate grievances that need addressing. Charamba has pledged to personally intervene. Through their union representative, the Association of University Teachers (AUT), the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-mnangagwa-spokesperson-charamba-admits-uz-lecturers-grievances-are-justified/\">President Mnangagwa spokesperson Charamba admits UZ lecturers’ grievances are justified</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "Zimbabwe dismisses UK legislators’ criticism over journalist Blessed Mhlanga’s continued detention",
            "url": "https://www.newzimbabwe.com/zimbabwe-dismisses-uk-legislators-criticism-over-journalist-blessed-mhlangas-continued-detention/",
            "content": "By Staff Reporter\n\nZIMBABWEs government has brushed off criticism from British legislators threatening punitive measures over the continued detention of journalist Blessed Mhlanga, describing the pressure as emotional overreach that holds no weight domestically.\n\nLiberal Democrats peer Lord Jonathan Oates\n\nResponding to Liberal Democrats peer Lord Jonny Oates demand for international consequences, Ministry of Information Permanent Secretary Nick Mangwana said emotional expressions in foreign Parliaments carry little weight here in Zimbabwe.\n\nConversations or emotional overreaches in foreign legislatures count very little here, Mangwana wrote on his official X account.\n\nOates demanded that the United Kingdom (UK) government makes it clear to Mnangagwa and the Zanu PF government that normal relations between the former colonial power and Zimbabwe will not resume as long as basic rights such as those of the media were continuously disrespected.\n\nThis comes at a time when President Emmerson Mnangagwas wife Auxilia will be speaking at a summit scheduled to take place in London come June.\n\nFirst Lady Auxillia Mnangagwa\n\nOates also urged his peers, who will be participating at the summit, to confront and challenge Auxilia over Mhlangas incarceration and her husbands reported bid to extend his term in office.\n\nOn top of that, Zimbabwean rights activists based in the UK are planning protests outside the venue of the First Ladies of African Impact and Resilience (FLAIR) summit, where Auxillia will be speaking.\n\nMeanwhile, journalist Mhlanga has now spent 60 days in pretrial detention for interviewing war veteran, Blessed Geza, seeking President Mnangagwas immediate ouster.\n\nHe was arrested after broadcasting the interview and accused of transmitting data messages that incite violence or damage to property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/26191811/Nick-Mangwana.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE’s government has brushed off criticism from British legislators threatening punitive measures over the continued detention of journalist Blessed Mhlanga, describing the pressure as emotional overreach that holds no weight domestically. Responding to Liberal Democrats peer Lord Jonny Oates demand for international consequences, Ministry of Information Permanent Secretary Nick Mangwana said emotional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-dismisses-uk-legislators-criticism-over-journalist-blessed-mhlangas-continued-detention/\">Zimbabwe dismisses UK legislators’ criticism over journalist Blessed Mhlanga’s continued detention</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "Warriors midfielder Tawanda Maswanhise scoops Motherwell Goal of The Season accolade",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-tawanda-maswanhise-scoops-motherwell-goal-of-the-season-accolade/",
            "content": "By Sports Reporter\n\nWARRIORS midfielder Tawanda Maswanhise Saturday night received Motherwell Goal of The Season accolade at the clubs end of season awards.\n\nMaswanhises goal in the Scottish Premeir League against Rangers in a match that ended 2-2 on December 29, 2024, got the highest number of votes from the clubs fans ahead of all other goals scored at the club during the season.\n\nThe 22-year-old Zimbabwean international is enjoying life at Motherwell, as he managed to score five goals and assisted three from 27 matches in the just ended campaign.\n\nMaswanhise joined Motherwell in August coming from Leicester and has been a key player for the side.\n\nDuring the campaign he was voted clubs Player of The Month twice, making his debut season one of the best.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/24090858/Tawanda-Maswanhise.jpg",
            "description": "<p>By Sports Reporter  WARRIORS midfielder Tawanda Maswanhise Saturday night received Motherwell Goal of The Season accolade at the club’s end of season awards. Maswanhise’s goal in the Scottish Premeir League against Rangers in a match that ended 2-2 on December 29, 2024, got the highest number of votes from the club’s fans ahead of all</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-tawanda-maswanhise-scoops-motherwell-goal-of-the-season-accolade/\">Warriors midfielder Tawanda Maswanhise scoops Motherwell Goal of The Season accolade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "CAPS United finally win; Simba Bhora and MWOS share spoils",
            "url": "https://www.newzimbabwe.com/caps-united-finally-win-simba-bhora-and-mwos-share-spoils/",
            "content": "By Sports Reporter\n\nCAPS United ended its four-match winless run with an unconvincing 1-0 win over Yadah at Rufaro Stadium Saturday.\n\nThe Green Machine had to thank second half substitute Rodwell Chinyengete, who scored in the 80th minute to secure maximum points for his side.\n\nMakepekepes goal was a relief for the teams technical team, which was reportedly given an ultimatum to win two games, including this particular one.\n\nSaturdavs victory was CAPS Uniteds first win at Rufaro, their second of the season, a win at Green Fuel Arena against Triangle last month being the first one.\n\nWe had gone for a long time without maximum points and today unlike other games we managed to capitalize.\n\nWe are happy the boys gave their all, the amount of work and commitment on the pitch was excellent.\n\nAs a technical department our objective has always been the same, We still have a dream to catch up with top team and we will make sure we push the boys to do so, said CAPS United assistant coach Tonderai Marume after the match.\n\nMakepekepe win propelled them out of the relegation zone as they are now on position 14 with seven points, two ahead of bottom-placed Kwekwe United, which has five points.\n\nMeanwhile, league newcomers MWOS FC maintained their stay on top of the log after managing a nill all draw away at Wadzanayi Stadium against defending champions Simba Bhora.\n\nThe result saw MWOS extending its unbeaten run in the ongoing campaign to matchday nine at the same time registering its seventh clean sheet.\n\nPremierSoccer League Matchday 8 Results\n\nFriday\n\nHerentals 1-0 Green Fuel\n\nSaturdayYadah 0-1 CAPS UnitedSimba Bhora 0-0 MWOSManica Diamonds 1-1 Chicken InnTel One 1-1 HighlandersFC Platinum 1-1 TriangleZPC Kariba 0-0 ScottlandBikita Minerals 1-1 Ngezi PlatinumSundayDynamos vs Kwekwe United.\n\nSaturday\n\nYadah 0-1 CAPS United\n\nSimba Bhora 0-0 MWOS\n\nManica Diamonds 1-1 Chicken Inn\n\nTel One 1-1 Highlanders\n\nFC Platinum 1-1 Triangle\n\nZPC Kariba 0-0 Scottland\n\nBikita Minerals 1-1 Ngezi Platinum\n\nSunday\n\nDynamos vs Kwekwe United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/07190603/thumbnail_William-Manondo-right-celebrating-after-opening-the-scoring-for-Caps-United-at-the-National-Sports-Stadium-on-Friday.jpeg",
            "description": "<p>By Sports Reporter CAPS United ended its four-match winless run with an unconvincing 1-0 win over Yadah at Rufaro Stadium Saturday. The Green Machine had to thank second half substitute Rodwell Chinyengete, who scored in the 80th minute to secure maximum points for his side. Makepekepe’s goal was a relief for the team’s technical team,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caps-united-finally-win-simba-bhora-and-mwos-share-spoils/\">CAPS United finally win; Simba Bhora and MWOS share spoils</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "Andy Rinemhota’s Cardiff City relegated",
            "url": "https://www.newzimbabwe.com/andy-rinemhotas-cardiff-city-relegated/",
            "content": "By Sports Reporter\n\nANDY Rinemhotas Cardiff City was Saturday relegated from the English Championship League after playing a goalless draw against West Brom.\n\nCardiff became the first side to be relegated to the third tier and will only know the other two teams to join them on the final matchday next week.\n\nOf the 45 games that Rinemhotas side has played this season, they only managed to pick nine wins, losing 19 and drawing 17.\n\nThe Bluebirds relegation to English League One put Rinemhotas future at the club in jeopardy with his contract set to expire this June.\n\nAlthough the club is yet to speak on its plans for most players, especially the chop from the Championship, a lot of factors will be considered by Rinemhota if he is to stay.\n\nThe Zimbabwean international joined Cardiff in July 2022 on a three-year contract coming from Reading FC.\n\nRinemhota was one of the instrumental players for the Bluebirds this season, hence was nominated for the clubs Player of The Season gong.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29195506/Andy-Rinomhota-1.png",
            "description": "<p>By Sports Reporter ANDY Rinemhota’s Cardiff City was Saturday relegated from the English Championship League after playing a goalless draw against West Brom. Cardiff became the first side to be relegated to the third tier and will only know the other two teams to join them on the final matchday next week. Of the 45</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/andy-rinemhotas-cardiff-city-relegated/\">Andy Rinemhota’s Cardiff City relegated</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "Sports Commission summons ZRU to respond Lady Sables ill-treatment allegations",
            "url": "https://www.newzimbabwe.com/sports-commission-summons-zru-to-respond-lady-sables-ill-treatment-allegations/",
            "content": "By Sports Reporter\n\nTHE Sports and Recreation Commission (SRC) has summoned Zimbabwe Rugby Union (ZRU) to respond to allegations of ill-treating the national senior womens team during and after the Rugby Africa Women Division One Cup tournament.\n\nZRU made headlines around social media this past week after NewZimbabwe.com exclusively ran a story in which players anonymously revealed the ill-treatment they got upon their arrival in the country from Ivory Coast on Easter Monday.\n\nThis was followed up by a leaked audio, which circulated on social media in which the ZRU boss Losson Mtongwiza was threatening a life ban for any of the players who had the guts to speak out on the unfair treatment.\n\nLady Sables players were only given transport allowances after one week of duty in Ivory Coast. On top of that, the players were ordered to return their travelling kits and were also forced to pay US$35 for the national team green blazers.\n\nThe SRC has summoned the Zimbabwe Rugby Union Board (ZRU) to clarify, in formal setting, the precise nature of the recent allegations being made against certain officials of ZRU.\n\nThe intention of the meeting is to ascertain if the allegations form a prime facie basis for an enquiry: the outcome of which, in the event, would form the basis for remedial action in terms of ZRUs Constitution.\n\nThe public will be informed accordingly, read SRCs press statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/26074443/Losson-Pic2-1-696x1149-1-e1724150059820.jpg",
            "description": "<p>By Sports Reporter THE Sports and Recreation Commission (SRC) has summoned Zimbabwe Rugby Union (ZRU) to respond to allegations of ill-treating the national senior women’s team during and after the Rugby Africa Women Division One Cup tournament. ZRU made headlines around social media this past week after NewZimbabwe.com exclusively ran a story in which players</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sports-commission-summons-zru-to-respond-lady-sables-ill-treatment-allegations/\">Sports Commission summons ZRU to respond Lady Sables ill-treatment allegations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "United in love and refusal to dig into divisive politics: A biblical perspective",
            "url": "https://www.newzimbabwe.com/united-in-love-and-refusal-to-dig-into-divisive-politics-a-biblical-perspective/",
            "content": "SUNDAY MORNING TABLET\n\nUnited in love: A call to resilient resistance\n\nSCRIPTURE:\n\nAnd let us not forget to do good and to share with those in need, for such sacrifices are pleasing to God.  Hebrews 13:16 (NLT)\n\nIn a world where politics often divides us, we are called to be different. As a community united by love and togetherness, we must transcend the petty squabbles of politics and use our collective power to uplift one another. Politics should be a tool for the betterment of our lives, not a weapon to suppress and exploit.\n\nUnfortunately, many African countries are plagued by leaders who wield power to oppress their citizens. But we, as children of God, must not be swayed by their selfish interests. Instead, we must stand united, refusing to be divided by their tactics.\n\nIn the face of abuse and exploitation, we are not called to resort to violence. Rather, we are called to exercise resilient resistance, standing firm in our convictions and refusing to be used for selfish purposes that render us poor and powerless.\n\nLet us pray for sanity to return to our leadership, that they may govern with wisdom and justice. Let us pray for our countries to come back to order, that peace and prosperity may reign.\n\nPRAYER:\n\nHeavenly Father, we pray for unity and love to prevail in our communities. Grant our leaders wisdom and justice, and deliver us from the grip of oppression. Give us the strength to stand resilient in the face of abuse, and to refuse to be divided by selfish interests. May Your will be done on earth as it is in heaven.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/16093245/IMG-20240616-WA0009.jpg",
            "description": "<p>SUNDAY MORNING TABLET United in love: A call to resilient resistance SCRIPTURE: “And let us not forget to do good and to share with those in need, for such sacrifices are pleasing to God.” – Hebrews 13:16 (NLT) In a world where politics often divides us, we are called to be different. As a community</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/united-in-love-and-refusal-to-dig-into-divisive-politics-a-biblical-perspective/\">United in love and refusal to dig into divisive politics: A biblical perspective </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "Killer nurse suffocated daughter (2) to death in twisted ‘revenge’ for losing custody battle with ex-partner",
            "url": "https://www.newzimbabwe.com/killer-nurse-suffocated-daughter-2-to-death-in-twisted-revenge-for-losing-custody-battle-with-ex-partner/",
            "content": "By The Sun\n\nA NURSE suffocated her toddler daughter to death in a twisted act of revenge after losing a custody battle with her ex-partner.\n\nShilyrand Charigwati, 30, used a plastic bag to murder two-year-old Roselyn at her home in Hemel Hempstead, Hertfordshire.\n\nShe then tried to claim she had no recollection of killing her daughter and blamed mental health issues.\n\nBut police discovered Charigwati had separated from Roselyns father and had lost custody of her daughter.\n\nJailing the nurse for life with a minimum of 16 years, Mrs Justice Williams said spousal revenge was a factor in the horror.\n\nThe judge added: Rose was extremely vulnerable due to her age.\n\nThis was a shocking abuse of trust.\n\nLuton Crown Court heard the horror unfolded just months after Charigwati lost custody of Roselyn.\n\nA few days before she murdered her daughter, neighbours said the nurse appeared to be tired of life.\n\nThe court that until the terrible incident, Charigwati had been a loving and devoted mum.\n\nBut she said she had showed an unusual amount of anger towards Roselyns dad following the family court proceedings.\n\nThis rage turned violent when Charigwati suffocated the toddler before ringing police to say she may have killed her daughter.\n\nRoselyn was rushed to hospital but she tragically could not be saved and was declared dead on April 14 last year.\n\nCharigwati initially pleaded guilty to manslaughter on the grounds of diminished responsibility.\n\nShe claimed she was suffering from a mental health condition but prosecutors said she had a mild to moderate depressive illness.\n\nJohn Price KC argued this was not enough to impair Charigwatis ability to make a rational judgment.\n\nJurors agreed and the mum was found guilty of murder following a trial.\n\nIn a moving tribute, Roselyns dad, Washington, said no words could express his pain.\n\nHe said the youngster was joyful, funny, playful, beautiful, and so full of love.\n\nThe dad added: She was the kind of daughter every parent would dream of having. She touched so many hearts wherever we went, and everyone adored her.\n\nEvery part of being her dad was amazing. As her father, the pain of losing Roselyn is something I carry with me every single day.\n\nBut so is the joy of having known her, held her, and loved her unconditionally. She is with me always.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27053239/newspress-collage-n8yzmxq67-1745492967752-1.webp",
            "description": "<p>By The Sun A NURSE suffocated her toddler daughter to death in a twisted act of revenge after losing a custody battle with her ex-partner. Shilyrand Charigwati, 30, used a plastic bag to murder two-year-old Roselyn at her home in Hemel Hempstead, Hertfordshire. She then tried to claim she had “no recollection” of killing her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/killer-nurse-suffocated-daughter-2-to-death-in-twisted-revenge-for-losing-custody-battle-with-ex-partner/\">Killer nurse suffocated daughter (2) to death in twisted ‘revenge’ for losing custody battle with ex-partner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        },
        {
            "title": "The Cost of Silence: How France’s Refusal to Share Accurate Landmine Data Continues to Claim Lives",
            "url": "https://www.newzimbabwe.com/the-cost-of-silence-how-frances-refusal-to-share-accurate-landmine-data-continues-to-claim-lives/",
            "content": "ByIsaacEdotomDzokpo\n\nFrance still refuses to acknowledge its involvement in planting millions of landmines across Algerian territory during the colonial war. According to Algerian experts, the maps handed over in 2007 are outdated and no longer reflect the actual locations of the explosive devices. This silence has become deadly: every step on the ground could lead to tragedy, and the country is left to confront this threat on its own.\n\nOn April 4, the UN Human Rights Council unanimously and without a votesupported a resolutioncalling on countries to comply with the 1997 treaty banning the use of mines, to protect and ensure human rights.\n\nThe initiative was spearheaded by Algeria, which is most familiar with the effects of the mine threat.\n\nHowever, 1956 through 1962, during the Algerian War of Independence, France laid 11 million mines along Algerias eastern and western borders.\n\nThe anti-personnel mines left behind by French colonialism represent one of Algerias greatest humanitarian disasters. Buried under Algerian soil, these mines continued to kill and maim the local population even after the national liberation war, Cameroons Africa Plus News television channel said on April 6.\n\nOn the same day when this statement was made  April 6, in Azerbaijan (a co-sponsor country of the UN resolution)as a result oftwo incidents of mine blast 4 people were injured at once.\n\nIn thefirst case an employee of the demining center, who had his leg amputated as a result.In the second, a father with two young children, aged 11 and 13, suffered multiple shrapnel wounds to their legs and arms.\n\nAzerbaijan isthe second most mine-contaminatedcountry in Europe after Ukraine.\n\nFor almost 30 years, parts of Azerbaijan have been occupied by Armenia, Frances closest ally. With the support of its patrons, Armenia laid more than 1.5 million mines there, which have claimed the lives of civilians to this day.\n\nAlgeria and Azerbaijan  a common echo of explosions\n\nTo prevent the infiltration of Algerian revolutionaries and weapons from Tunisia and Morocco during the Algerian War of Independence, minefields were established by the French colonial power along the 1,710 kilometers of Algerias eastern and western borders. As a result, 3 million Algerians living in the border areas were displaced.\n\nSince then, 7,300 civilians have fallenvictimto mines in Algeria, 4,830 of them during the war and 2,470 since independence.\n\nDespite the fact that Algeria has cleared more than 62,000 hectares of land, cleared nearly 9 million mines and declared itself an anti-personnel mine-free country in 2017, thereare stillcases of villagers, farmers and children being blown up.\n\nIt is alleged that France did not hand over maps with the location of minefields to Algeria until 2007. And when it did hand over  the maps were not complete.There are more than 2,200,000 of them [mines], and France has so far handed us only part of the maps showing where they are planted. As for humanity, Mr. President Macron, while you aretalking about human values, there are citizens who have had limbs amputated and those who have died because of these mines. Not a day goes by that we dont hear about a mine explosion that injured a person, and we are already living in 2025! said former Algerian politician Ahmed Khalifa on April 6.\n\nThe situation in Algeria is strikinglysimilar tothe situation in Azerbaijan, which is thousands of kilometers away. From 1991 to 2020, part of Azerbaijani territories was under Armenian occupation. During this time, more than3,400people suffered from mines laid by Armenians.\n\nIn 2020. Azerbaijan managed to regain control over the occupied territories, but this did not solve the problem ofminecontamination. Since 2020, more than390people have fallen victim to mines.\n\nHasanliAliyev, who had his leg amputated as a result of the blast, recalled onEuronews:I was 23 years old when I stepped on a mine. Like any young man, I had big dreams and goals. The mine explosion had a huge impact on my life.\n\nArmenia, like its patron France in the Algerian situation, initially claimed it did not have maps of the minefields, and when it did hand them over, they were only 25% accurate. A spokesman for the Azerbaijani Foreign Ministry said on April 4 thatmore than 55% of recent mine accidents occurred in territories not covered by these maps.\n\nSince 2020. Armenia and Azerbaijan have been negotiating a final peace treaty. But the normalization of relations between these countries does not correspond to the interests of France, which seeks to maintain a hotbed of tension in the South Caucasusin order tohave leverage over the countries of the region.\n\nTherefore, while Baku and Yerevan are holding peace talks, France is supplying offensive weapons to Armenia, which may provoke a new conflict in the region.\n\nIn June 2024, during the visit of the Armenian Defense Minister to France, the parties signed a contract for thesupplyof French CAY CAESAR howitzers to Armenia.\n\nAn agreement on military-technical cooperation was also signed between the Armenian Defense Ministry and KNDS military-industrial company, which produces various types of military equipment, including tanks and self-propelled artillery systems. France has also initiated the dispatch of a European observation mission to Armenias border with Azerbaijan, which is essentially engaged in intelligence activities there.\n\nFrance its alleged to have pursued a similar policy in Africa, where it has repeatedly been accused of using the pretext of a terrorist threat to maintain its presence there.\n\nFor decades, France has maintained influence in its former colonies by supporting and protecting loyalist regimes from military coups, using the pretext of fighting terrorism in the Sahel region to deploy its own troops, and imposing the CFA franc. The main goal of Paris in this case was to maintain access to natural resources of African countries and to establish control over their financial system. Experts estimate that France receives 500 billion dollars annually from Africa.\n\nCompensation for Mine Terror\n\nDue to the growing mine threat in the world, especially after the start of the Russian-Ukrainian war, there are increasing calls for a ban on the use of anti-personnel mines, as well as compensation for their victims.\n\nThe Mine Justice Campaign waslaunchedat the 58th session of the UN Human Rights Council in Geneva. Its aim is to get the UN Human Rights Council to recognize the right of mine victims to compensation  both from the companies that produce mines and the governments that lay them.\n\nAlgeria has for several years been calling on France to compensate victims of mines laid by French colonial rule in Algeria.The crime of the French colonizer cannot go unpunished,BouzidLazhari, head of the Algerian National Council for Human Rights,saidin 2021, urging Algerians to continue their fight for compensation. France has completely ignored these calls.\n\nAt the same time, Azerbaijan carries out demining at its own expense and calls on the international community to hold Armenia responsible for the mine terror against Azerbaijan.\n\nHowever, given the fact that Armenia has not yet handed over maps with the exact location of minefields in the previously occupied territories, it is apparently too early to talk about paying compensation to the victims.\n\n",
            "image_url": null,
            "description": "<p>By Isaac Edotom Dzokpo France still refuses to acknowledge its involvement in planting millions of landmines across Algerian territory during the colonial war. According to Algerian experts, the maps handed over in 2007 are outdated and no longer reflect the actual locations of the explosive devices. This silence has become deadly: every step on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-cost-of-silence-how-frances-refusal-to-share-accurate-landmine-data-continues-to-claim-lives/\">The Cost of Silence: How France’s Refusal to Share Accurate Landmine Data Continues to Claim Lives</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "27 Apr 2025"
        }
    ]
}