{
    "news": [
        {
            "title": "UK: Some migrants to face 20 year wait for settled status",
            "url": "https://www.newzimbabwe.com/uk-some-migrants-to-face-20-year-wait-for-settled-status/",
            "content": "BBC\n\nMigrants who are in the UK legally could have to wait up to 20 years before they can settle permanently, under government proposals.\n\nThe Home Secretary Shabana Mahmood has announced the qualifying period for indefinite leave to remain will be extended from five to 10 years, and will apply to the estimated 2.6 million who arrived since 2021.\n\nThe changes will not apply to people who had already obtained settlement.\n\nMahmood said becoming part of the UK was not a right but a privilege  and one that must be earned.\n\nThe package is the latest in a string of changes to the immigration system announced by Mahmood over the past week.\n\nSettlement, also known as Indefinite Leave to Remain (ILR), allows someone to live in the UK permanently, work without restrictions and access public services. It is also a key step towards British citizenship.\n\nCurrently, most work and family visa holders can apply for settlement after five years.\n\nUnder the proposed changes the standard wait will be 10 years  with a range of criteria that would lengthen or shorten that period.\n\nLegal migrants who claim benefits for less than 12 months will have to wait 15 years\n\nPeople who arrived on post-Brexit health and social care visas would have to wait 15 years, up from five year currently\n\nMigrants reliant on benefits for more than 12 months face a 20-year wait for settlement, four times more than the current period and the longest in Europe\n\nThere is also a reduction to three years for applicants who earn 125,140 in the three years prior to applying for settlement, with this reduced to five years for anyone earning 50,270.\n\nTime spent volunteering and competency in the English language are also factors which could reduce the wait.\n\nAnnouncing the changes in the Commons, Mahmood said: Migration will always be a vital part of Britains story.\n\nBut the scale of arrivals in recent years has been unprecedented.\n\nConservative shadow home secretary Chris Philp accused Labour of copying and pasting policies from his party that it had previously voted against.\n\nPhilp said his part would support the changes, but warned the new system could create loopholes and urged ministers to adopt a migration cap.\n\nReform UK did not respond to the statement in the Commons. But the party has previously announced it would abolish ILR  replacing it with visas that migrants must reapply for every five years.\n\nThat includes hundreds of thousands of migrants currently in the UK.\n\nHome Office figures show net migration added 2.6 million people to UK population between 2021 and 2024.\n\nBecause of this, settlement grants are also expected to spike over the next five years, with around 1.6 million people forecast to settle between 2026 and 2030.\n\nMinisters plan to introduce an earned settlement system, requiring migrants to demonstrate social integration, economic contribution and good character before being granted settled status.\n\nApplicants will need to meet stricter minimum requirements including the equivalent to A-level standard English language, a clean criminal record and earning above 12,570 a year for at least three years.\n\nThere will be accelerated routes for those who make an outsized contribution to the UK.\n\nDoctors and nurses working in the NHS will be able to settle after five years. The brightest and best international talent could have settlement fast-tracked, with high earners and entrepreneurs able to stay after just three years.\n\nFamily members will not gain automatic status when the main applicant qualifies. Children who came to the UK under the age of 18 may settle with parents, but older dependants could face separate requirements.\n\nExisting fast-track routes for victims of domestic abuse, bereaved partners and resettled refugees will remain.\n\nPublic service union Unison said the changes would be devastating to thousands of essential workers and put services at risk.\n\nChristina McAnea, Unisons general secretary, said: Forcing staff, many of whom stepped up during Covid, to wait 15 years for certainty about their futures betrays the promises they were made.\n\nMs McAnea warned the government not to overlook the care workers, nursing assistants and school support staff from overseas as without them care services would collapse.\n\nThe changes build on measures first set out in the governments May white paper.\n\nThe government plan to roll out changes from spring 2026, after a consultation ends on 12 February.\n\nOn Monday, Mahmood announced a sweeping overhaul of the UKs asylum system  including plans to end permanent refugee status and replace it with temporary status subject to review every 30 months.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/21063737/7298f1264a780b47097ab7f8cd314d81Y29udGVudHNlYXJjaGFwaSwxNzU3MzQzNTY3-2.81449229.jpg",
            "description": "<p>BBC Migrants who are in the UK legally could have to wait up to 20 years before they can settle permanently, under government proposals. The Home Secretary Shabana Mahmood has announced the qualifying period for indefinite leave to remain will be extended from five to 10 years, and will apply to the estimated 2.6 million</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-some-migrants-to-face-20-year-wait-for-settled-status/\">UK: Some migrants to face 20 year wait for settled status</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "21 Nov 2025"
        },
        {
            "title": "Harare records over 500 cases of hand, foot and mouth disease",
            "url": "https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/",
            "content": "By Thandiwe Garusa\n\nTHE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10.\n\nIn a public notice issued Thursday, the local authority said the viral infection has been detected largely in Mabvuku, Mbare, Budiriro and Waterfalls, warning that the disease is highly contagious and spreads through direct contact with blisters or droplets from coughing and sneezing.\n\nSo far 501 cases have been recorded mainly in Mabvuku, Mbare, Budiriro and Waterfalls.\n\nNo deaths have been recorded and those with the symptoms are advised to report to the nearest clinic or hospital, the notice reads.\n\nAlthough HFMD is described as self-limiting, meaning it usually resolves on its own, the City of Harare urged parents and guardians to take symptoms seriously and seek medical assistance.\n\nThe disease is self-limiting and treatment is for symptoms.\n\nThe public is advised to avoid direct contact with those showing symptoms as it is a highly contagious disease, the notice added.\n\nThe city further advised residents to ensure any child showing signs of infection receives immediate medical attention.\n\nWe urge residents to immediately take children with symptoms of the disease to the clinic.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20184945/hand-foot-and-mouth.jpg",
            "description": "<p>By Thandiwe Garusa THE City of Harare has raised alarm over an outbreak of hand, foot and mouth disease (HFMD), with at least 501 cases recorded across several suburbs, mainly affecting children under the age of 10. In a public notice issued Thursday, the local authority said the viral infection has been detected largely in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-records-over-500-cases-of-hand-foot-and-mouth-disease/\">Harare records over 500 cases of hand, foot and mouth disease</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "21 Nov 2025"
        },
        {
            "title": "US wants to join G20 summit, end boycott: South Africa",
            "url": "https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/",
            "content": "AFP\n\nWashington had said it would not take part in the 22-23 November summit because it objected to the priorities for the meeting set by South Africa, which holds the G20s rotating presidency this year.\n\nWe have received notice from the United States, a notice which we are still in discussions with them over, about a change of mind about participating in one shape, form or other in the summit, Ramaphosa told reporters.\n\nThis comes at the late hour before the summit begins. And so therefore, we do need to engage in those types of discussions to see how practical it is and what it finally really means, he said.\n\nAll countries are here, and the United States, the biggest economy in the world, needs to be here, he said.\n\nSo its pleasing to hear that there is a change of approach, and so we are still discussing how that will manifest.\n\nUS President Donald Trump has singled out South Africa for harsh treatment on a number of issues since he returned to the White House in January, notably making debunked claims of white Afrikaners being systematically killed and slaughtered in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20172724/ramaphosa.jpg",
            "description": "<p>AFP The United States has had a “change of mind” about boycotting the G20 summit in Johannesburg this weekend and wanted to take part in some form, South African President Cyril Ramaphosa said Thursday. Washington had said it would not take part in the 22-23 November summit because it objected to the priorities for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-wants-to-join-g20-summit-end-boycott-south-africa/\">US wants to join G20 summit, end boycott: South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "21 Nov 2025"
        }
    ]
}