{
    "news": [
        {
            "title": "Govt says security services ‘on high alert’ amid calls for protests",
            "url": "https://www.newzimbabwe.com/govt-says-security-services-on-high-alert-amid-calls-for-protests/",
            "content": "By Staff Reporter\n\nThe government has upped security across the country as disgruntled war vet Blessed Bombshell Geza calls for demonstrations against President Emmerson Mnangagwa.\n\nGeza has been opposing the extension of Mnangagwas tenure and demanding his immediate resignation, levelling allegations of corruption, tribalism and cronyism. Earlier this month, he was expelled from Zanu PF, where he was a Central Committee member over allegations of indiscipline.\n\nThe war vet has recently done explosive live broadcasts calling on citizens to take to the streets on March 31.\n\nIn a statement, Thursday, Home Affairs Minister Kazembe Kazembe warned citizens against participating in the planned protests.\n\nThe illegal acts being mobilised undermine the prevailing security, peace and stability.The retrogressive intents should be dismissed with the contempt they deserve. Those fronting the mobilisation should stand warned.\n\nThe countrys security services are on high alert to ensure the sustained safety and security of the public. The Zimbabwean Republic Police has made adequate deployments to guarantee an environment conducive to socio-economic development and unhindered movement of people in all parts of the country, reads part of the statement.\n\nPolice have since issued a two-month-long prohibition order from March 27 until May 31, barring the carrying of weapons including swords, knobkerries, axes, daggers, machetes and catapults in Harare and Bulawayo.\n\nThere has also been a heavy deployment of police officers in both urban and rural areas to maintain peace and order.\n\nAdded Kazembe, May I also remind the public of the need to abide by the provisions of the Criminal Law (Codification and Reform) Act Chapter 24, which is categorical on the maintenance of public order. Equally, I need not emphasize that we are all expected to remain guided by the provisions of Section 164 of the Criminal Law (Codification and Reform) Act and Section 164 of the Cyber Security and Data Protection Act on offences relating to electronic communications and materials.\n\nThe relevant instruments would be invoked to deal with those who unlawfully engage in transmitting, broadcasting and distributing data messages to any person, group of persons or to the public with the intent to incite acts of violence against any persons or to cause damage to any property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/25185424/Home-Affairs-Minister-Kazembe-Kazembe.jpg",
            "description": "<p>By Staff Reporter The government has upped security across the country as disgruntled war vet Blessed “Bombshell” Geza calls for demonstrations against President Emmerson Mnangagwa. Geza has been opposing the extension of Mnangagwa’s tenure and demanding his immediate resignation, levelling allegations of corruption, tribalism and cronyism. Earlier this month, he was expelled from Zanu PF,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-says-security-services-on-high-alert-amid-calls-for-protests/\">Govt says security services ‘on high alert’ amid calls for protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "Transport ministry announces road closure to allow upgrade",
            "url": "https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-allow-upgrade/",
            "content": "By Staff Reporter\n\nTHE Ministry of Transport and Infrastructural Development (MTID) has announced the closure of Simon Mazorodze Road from Harare Drive to Willowvale Road/St George Street.\n\nThe closure, effective 27 March until further notice, is part of a project contracted to Tensor Systems aimed at upgrading and rehabilitating the road.\n\nIn a public notice the MTID announced the temporary traffic changes to ensure a smooth flow of transport and pedestrians.\n\nAll pedestrians and the motoring public who use the affected road are advised as follows: construction of the carriageway)  detours northbound (city-bound citybound (or northbound) traffic may use watts road (the service road adjacent to Simon Mazorodze) by exiting Simon Mazorodze at the Chinzou roundabout and joining the service lane.\n\nTraffic may shift back into Simon Mazorodze after the construction zone. Alternatively, city-bound traffic may turn left onto Harare Drive, then right onto Willowvale road, or continue to highfield road. Southbound (Masvingo bound) traffic may continue using the southbound carriageway. During this period, Watts shall operate as a one-way street, reads the notice.\n\nTraffic will continue on the southbound carriageway initially, but later shift to the northbound lane as construction progresses.\n\nConstruction of the southbound (Masvingo bound Tensor Systems carriageway)  detours northbound (city bound) traffic shall continue to use Watts road, which shall continue to operate as a one-way street as described above. southbound (Masvingo-bound) traffic will be moved the then completed northbound carriageway.\n\nAlternatively, southbound traffic may turn left into Daniel Street then immediately right into Mbirimi Drive, left into St Georges street, right into Waterfalls avenue then back into Simon Mazorodze road, further reads the notice.\n\nMotorists are advised to follow all traffic signs, allow extra travel time, and give way to construction vehicles. Further updates on detours will be provided as necessary.\n\nOther diversion routes will be advised as they are prepared. Additional diversions shall be added to allow bridge construction. Road users are free to use any other roads of their choice but the ministry will only be responsible for the designated routes.\n\nRoad users are advised to follow the traffic signs strictly and at all times cooperate with traffic controllers posted around the construction zone.\n\nAllow for extra time to reach intended destinations. Give right of way to all construction machinery, including all vehicles branded tensor systems, to ensure safety to all road users, the ministry said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/05162122/Road-Construction.jpg",
            "description": "<p>By Staff Reporter  THE Ministry of Transport and Infrastructural Development (MTID) has announced the closure of Simon Mazorodze Road from Harare Drive to Willowvale Road/St George Street. The closure, effective 27 March until further notice, is part of a project contracted to Tensor Systems aimed at upgrading and rehabilitating the road. In a public notice</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-allow-upgrade/\">Transport ministry announces road closure to allow upgrade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "Tel One F.C plots victory against CAPS United",
            "url": "https://www.newzimbabwe.com/tel-one-f-c-plots-victory-against-caps-united/",
            "content": "By Sports Reporter\n\nGWERU-based topflight league side Tel One FC is eyeing to cause an upset against league giants CAPS United when they face off Saturday at Bata Stadium.\n\nThe Wi-Fi Boys are enjoying a good start in the topflight league where they are sitting on position eight with four points, three behind log leaders MWOS FC.\n\nTel One has lost once against Herentals on matchday one before thrashing Triangle 4-1 and picking and draw against Dynamos before the international break.\n\nCommenting ahead of the CAPS United game team, head coach Herbert Maruwa said the only option for them is to win.\n\nIts not going to be an easy game, CAPS United is a big team, but we have our own targets, to make sure we collect maximum points.\n\nThe team is doing well and Saturday against CAPS we have to give our best. We are coming from a draw away from home against Dynamos, but now we are now home we have to utilise our home advantage and get maximum points.\n\nCAPS United walks into Saturdays match with confidence after picking its first win against Triangle a fortnight ago.\n\nMakepekepe had a slow start in the league, as they started of with a 1-1 draw against Green Fuel before losing to Scottland on the second matchday.\n\nCurrently they occupy position nine with four points.\n\nMATCHHAY 4 FIXTURES\n\nSATURDAY\n\nTELONE FC VS CAPS UNITED F.C. (Bata Stadium)\n\nHIGHLANDERS FC VS SCOTTLAND F.C.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/14064152/telone.jpeg",
            "description": "<p>By Sports Reporter GWERU-based topflight league side Tel One FC is eyeing to cause an upset against league giants CAPS United when they face off Saturday at Bata Stadium. The Wi-Fi Boys are enjoying a good start in the topflight league where they are sitting on position eight with four points, three behind log leaders</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tel-one-f-c-plots-victory-against-caps-united/\">Tel One F.C plots victory against CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "Chevrons to host New Zealand and South Africa in T20 tri-nations series",
            "url": "https://www.newzimbabwe.com/chevrons-to-host-new-zealand-and-south-africa-in-t20-tri-nations-series/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens cricket team, popularly known as the Chevrons, is set to host New Zealand and South Africa in a T20-tri nations series.\n\nThe series is scheduled to run from the 14th of July to the 26 th.\n\nNeighbours South Africa are scheduled to land earlier in the country as they have a two match test series against the Chevrons before they play the tri nations series.\n\nThe test matches series will be played at Queens Sports Club in Bulawayo, the first one scheduled for June 28 to July 2, before the second match will which run from July 6 to 10.\n\nBoth sides will then shift base to Harare for the tri-nations series clash in crickets shortest format at Harare Sports Club, where the stage will be opened by the two sides on July 14, before South Africa face off with New Zealand two days later.\n\nThe Chevrons will then bounce back in action on July 18 with a clash against New Zealand before facing off the the Proteas in the second leg on the 20th.\n\nAction will then continue on July 22 when South Africa face the Black Caps for the second leg, before Zimbabwe rounds off group games on the 24th with the same opponents.\n\nThe T20 series will end on the 26th of July when top two teams from the two legged round robbin group stages face off in the final.\n\nCommenting on the tri-series, Zimbabwe Cricket managing director Givemore Makoni said, This is the biggest international home season we have had in years.\n\nIt is an incredible opportunity for our players to test themselves against two of the worlds cricketing powerhouses.\n\nHosting South Africa and New Zealand for both Test cricket and an exciting T20I tri-series is a fantastic development for the growth of the game in Zimbabwe.\n\nWe are looking forward to welcoming the teams and putting on a great spectacle for our passionate cricket fans.\n\nZimbabwe last hosted a T20I tri-nation series in July 2018, featuring Australia and Pakistan, with Pakistan emerging victorious.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17061815/ZIM-T20-CHEVRONS.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s cricket team, popularly known as the Chevrons, is set to host New Zealand and South Africa in a T20-tri nations series. The series is scheduled to run from the 14th of July to the 26 th. Neighbours South Africa are scheduled to land earlier in the country as they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-host-new-zealand-and-south-africa-in-t20-tri-nations-series/\">Chevrons to host New Zealand and South Africa in T20 tri-nations series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "Tragedy strikes as mine employee is electrocuted",
            "url": "https://www.newzimbabwe.com/tragedy-strikes-as-mine-employee-is-electrocuted/",
            "content": "By Staff Reporter\n\nA SOMBRE atmosphere has engulfed a gold mine in Chinhoyi after an employee working about 100 metres underground was electrocuted while trying to connect a water pump.\n\nThe incident, which claimed the life of Blessed Kanongota aged 21, occurred at Rody Boys Mine just outside Chinhoyi.\n\nZimbabwe Republic Police (ZRP) provincial spokesperson, Inspector Ian Kohwera confirmed the incident.\n\nI confirm a sudden death by electrocution of a 21-year-old man at Rody Boys 4 Mine, Chinhoyi on March 25, 2025, at around 1500 hours.\n\nBlessed Kanongota of Hunyani farm, Chinhoyi was working in a mine shaft approximately 100 meters deep extracting gold ore with other employees.\n\nAt around 1440 hours, one of the employees outside the shaft wanted those in the shaft to drain water using a water pump. He dropped an electric cable and advised them to connect the water pump. Kanongota was electrocuted in the process and died, said Kohwera.\n\nElectricity was switched off, and Kanongotas body was hoisted to the surface.\n\nMine manager Mostaf Sayemu was advised before a police report was made at ZRP Chinhoyi Rural. Police attended the scene and conveyed the body to Chinhoyi Provincial Hospital mortuary for postmortem.\n\nInvestigations are reportedly still underway to establish what transpired.\n\nKohwera urged miners to ensure safety measures are always in place to avoid loss of life through such avoidable incidents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/04045212/mortuary.jpeg",
            "description": "<p>By Staff Reporter A SOMBRE atmosphere has engulfed a gold mine in Chinhoyi after an employee working about 100 metres underground was electrocuted while trying to connect a water pump. The incident, which claimed the life of Blessed Kanongota aged 21, occurred at Rody Boys Mine just outside Chinhoyi. Zimbabwe Republic Police (ZRP) provincial spokesperson,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tragedy-strikes-as-mine-employee-is-electrocuted/\">Tragedy strikes as mine employee is electrocuted </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "Police probe arson at Zanu PF-linked tycoons Tagwirei and Chivayo’s business premises",
            "url": "https://www.newzimbabwe.com/police-probe-arson-at-zanu-pf-linked-tycoons-tagwirei-and-chivayos-business-premises/",
            "content": "By Costa Nkomo\n\nFOLLOWING alleged bombings in which vehicles were set alight outside the offices of Zanu PF-linked businessmen Wicknell Chivayo and Kudakwashe Tagwirei, as well as a petrol station in Harare on Thursday night, police have confirmed they are investigating the incidents.\n\nThese suspected bombings occurred hours after expelled Zanu PF Central Committee member and militant war veteran Blessed Geza named Tagwirei and Chivayo as criminals around the President.\n\nIn his explosive address Wednesday evening, Geza warned that action against all the corrupt individuals he named, Chivayo and Tagwirei among them, would be dealt with as a matter of urgency.\n\nWhile he stopped short of specifying the precise action to be taken against these so-called criminals surrounding President Emmerson Mnangagwa, his words have now taken on a decidedly ominous tone.\n\nIn a statement released Friday, Zimbabwe Republic Police (ZRP) National Police spokesperson, Commissioner Paul Nyathi stated that authorities are investigating incidents involving vehicles that were set ablaze at Tagwirei and Chivayos business premises.\n\nThe Zimbabwe Republic Police has received reports of petrol instigated burning of moving vehicles at business premises in Avondale, Highlands, Newlands, and Goromonzi on 28 March 2025 between 12 midnight and 4am.\n\nThis was done by suspects who were driving the vehicles. They quickly jumped onto accompanying vehicles and ran away. Police are conducting investigations into the incidents, Nyathi said.\n\nThe curious timing of the attacks, so soon after Gezas pronouncements, have raised eyebrows. Some observers are suggesting that Gezas words might have been the straw that broke the camels back, inciting individuals to take matters into their own hands.\n\nOther commentators believe that there is more to this than meets the eye, and that the bombings could be the result of internal power struggles inside Zanu PF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/29035232/GnHY1KVXAAAzcVw.jpeg",
            "description": "<p>By Costa Nkomo FOLLOWING alleged bombings in which vehicles were set alight outside the offices of Zanu PF-linked businessmen Wicknell Chivayo and Kudakwashe Tagwirei, as well as a petrol station in Harare on Thursday night, police have confirmed they are investigating the incidents. These suspected bombings occurred hours after expelled Zanu PF Central Committee member</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-probe-arson-at-zanu-pf-linked-tycoons-tagwirei-and-chivayos-business-premises/\">Police probe arson at Zanu PF-linked tycoons Tagwirei and Chivayo’s business premises</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "ZETDC introduces mandatory $25 electrical inspections fee for households and other tariffs for generator owners",
            "url": "https://www.newzimbabwe.com/zetdc-introduces-mandatory-25-electrical-inspections-fee-for-households-and-other-tariffs-for-generator-owners/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Electricity Transmission and Distribution Company (ZETDC) has announced a US$25 fee mandatory for inspections and re-inspections of electrical installations nationwide.\n\nIn a public notice, ZETDC said this move will ensure safety and reliability within the electrical infrastructure following recent incidents of house fires and electrical accidents.\n\nWhy these inspections are crucial, recent incidents of house fires and electrical accidents underscore the critical importance of maintaining safe electrical installations. These inspections are not just procedural, but are a vital step in preventing potentially devastating consequences. Unsafe wiring, faulty connections, and non-compliant installations pose serious risks to electricity users and members of the public.\n\nYour safety is our priority!, ZETDC is dedicated to ensuring that all electrical systems meet the highest safety standards. These inspections will identify and rectify potential hazards, minimizing the risk of electrical fires, shocks, and other dangers, reads the notice.\n\nIn addition to the US$25 inspection fee, those who own specific generators will also be charged to pay for the verification and safety inspection fees.\n\nMandatory fees associated with inspections, to facilitate these essential safety measures, the following mandatory fees apply: Statutory inspections and re-inspections: $25.00 (All customers)\n\nGenerator Verification and Safety Inspection Fees: Up to 100KW (petrol, diesel, solar, wind, etc): $5.00 Above 100KW (petrol, diesel, solar, wind, etc): $50.00 Advanced Safety Inspection Fees: For generators below 100KW (petrol, diesel, solar, wind, etc): $20.00 For generators above 100KW (petrol, diesel, solar, wind, etc): $100.00, For prototype generators below 100KW (petrol, diesel, solar, wind, etc): $100.00\n\nCustomers are advised that all payments are to be made using the official ZETDC payment platforms and a receipt shall be provided to that effect. No payments shall be made to individuals during the process of the inspections, reads the notice.\n\nZETDC also added that, We understand that inspections may cause some inconvenience, but the safety of your family and property is paramount. We urge all customers to cooperate fully with our inspection teams. By adhering to these statutory requirements and cooperating with ZETDC, we can collectively create a safer environment for everyone.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/29023916/Meter-Box-Replacement-scaled-1.jpeg",
            "description": "<p>By Staff Reporter  THE Zimbabwe Electricity Transmission and Distribution Company (ZETDC) has announced a US$25 fee mandatory for inspections and re-inspections of electrical installations nationwide. In a public notice, ZETDC said this move will ensure safety and reliability within the electrical infrastructure following recent incidents of house fires and electrical accidents. “Why these inspections are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zetdc-introduces-mandatory-25-electrical-inspections-fee-for-households-and-other-tariffs-for-generator-owners/\">ZETDC introduces mandatory $25 electrical inspections fee for households and other tariffs for generator owners </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "Govt says over one million to benefit from housing schemes by 2030",
            "url": "https://www.newzimbabwe.com/govt-says-over-one-million-to-benefit-from-housing-schemes-by-2030/",
            "content": "By Thandiwe Garusa\n\nTHE governmentis targeting toprovide decent accommodation to over a million citizens with a focus on eliminating illegal settlements and ensuring access to basic services like electricity, clean water and sanitation.\n\nSpeaking at the official ground breaking ceremony of popular cleric Emmanuel Makandiwas United Family International Church (UFIC) housing project in Harare, Waterfalls, Wednesday, Deputy Minister of Local Government and Public Works Benjamin Kabikira said government is willing to have private partnerson boardto help develop serviced housing as part of efforts to curb illegal settlements.\n\nKabikira added that by 2030, over one million people would have benefited from these partnerships.\n\nWe have many illegal settlements in Zimbabwe and it is also our wish that everyone must have a well-serviced home with electricity, roads, access to clean water and a sewer reticulation system.\n\nAs government, we are taking many initiatives to provide accommodation to citizens and these projects by churches to push the same agenda towards developing accommodation for everyone, we really appreciate this as a government, and it is through these partnerships that we move the nation forward, he said.\n\nWe are aiming to provide serviced stands to one million people by 2030, and we are certain we will exceed this target through public-private partnerships.\n\nThe housing scheme  Operation Nehemiah started in 2016 under UFIC and was designed to cater for those people who would ordinarily not afford to be homeowners and will benefit 6,000 beneficiaries.\n\nThese beneficiaries included members of the UFIC as well as non-members.\n\nThe land earmarked for an orphanage, church and residential stands had been illegally grabbed and sold to hundreds of families by suspected Zanu PF-linked land barons who were later evicted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/28085846/Benjamin-Kabikira-scaled.jpg",
            "description": "<p>By Thandiwe Garusa THE government is targeting to provide decent accommodation to over a million citizens with a focus on eliminating illegal settlements and ensuring access to basic services like electricity, clean water and sanitation. Speaking at the official ground breaking ceremony of popular cleric Emmanuel Makandiwa’s United Family International Church (UFIC) housing project in Harare, Waterfalls,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-says-over-one-million-to-benefit-from-housing-schemes-by-2030/\">Govt says over one million to benefit from housing schemes by 2030</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "‘Cat and mouse game’: Zimbabwe govt workers moonlight as street vendors",
            "url": "https://www.newzimbabwe.com/cat-and-mouse-game-zimbabwe-govt-workers-moonlight-as-street-vendors/",
            "content": "Al Jazeera\n\nEvery morning, Dumisani Ngara* gets up at dawn to catch a 6:30am bus to work at Zimbabwes Ministry of National Housing and Social Amenities. The government-provided bus is free for civil servants in Harare, and on his $250 monthly salary, he tries to save every cent he can.\n\nOnce at work, Ngara  dressed neatly in a suit and tie  makes sure the days files are all in order before the office opens at 8:30am. In between paperwork and meetings, he takes breaks. At 1pm, he opens a lunchbox packed with rice and meat he prepared at home.\n\nMost of us here, we work to the best of our ability. It is a profession I love. It comes also with job security, said the 48-year-old husband and father of three.\n\nBut by 5pm, as the end of the workday arrives, instead of heading home, Ngara rushes to a restroom in the pub across the street, where he changes into sweatpants and a T-shirt before walking four blocks to join his oldest son at a pavement stall in the city centre. From there, they sell groceries to passers-by.\n\nNgaras side hustle is a secret, as Zimbabwean government workers are restricted from holding other jobs. But he says life is tough on a single-source income.\n\nNgara has been a government worker since 2010, but making ends meet has been especially difficult since 2019, when inflation shot up to 300 percent and the value of his salary eroded.\n\nTo afford rent and other expenses, his family had to make a plan.\n\nMy wife is into vending of fruits and vegetables at home while I do the same after work here in the CBD, Ngara said, referring to the central business district.\n\nBy day, Ngara is a government worker at the Ministry of National Housing and Social Amenities. After hours, he sets up shop vending groceries on the streets [Calvin Manika/Al Jazeera]\n\nThe Ngaras are not alone.\n\nOut on Harares streets, a growing number of civil servants are turning to vending once their official workday ends.\n\nMost work until 9 or 10pm, although Ngara heads home at about 8pm.\n\nMany of those turning to vending work are teachers. Takavafira Zhou is the president of the Progressive Teachers Union of Zimbabwe and says teachers are taking on these extra, informal jobs because salaries are pathetic and families cannot make ends meet.\n\nPeople are failing to pay school fees, to feed their families, to pay medical bills, to pay rentals, he explained. Therefore, government workers have designed methods of survival.\n\nAccording to Zhou, the majority of government workers have now turned to some sort of vending, although there is no data to confirm this.\n\nAccording to ZimStats, the government statistics agency, the informal sector in Zimbabwe contributes 18 percent to the countrys gross domestic product (GDP) and 20 percent of employment. But experts say the government downplays the numbers and that a majority of Zimbabweans work in the informal sector.\n\nIt is a situation where you have a choice to starve or to find survival methods, bearing in mind that the employer is uncaring, Zhou added, accusing the state of offering unreasonable salaries and not improving working conditions for teachers.\n\nBefore November 2018, most Zimbabwean civil servants, including teachers, earned a basic monthly salary of about $540.\n\nHowever, since the economic downturn in 2019, the government stopped offering full US dollar-pegged payments. Salaries are now split into two portions: a US dollar (USD) component  $160 for most civil servants  and an amount in local currency, which equals less than $100 when converted.\n\nLate one afternoon, Ngara and his 21-year-old son spread out their wares on the pavement in front of registered supermarkets and stores selling the same goods they do.\n\nLast year, in a bid to tackle hyperinflation, the government introduced a new gold-backed currency, the ZiG, and imposed stricter regulations on the use of foreign currency. As a result, registered stores must trade in the local currency or use official USD exchange rates.\n\nInformal vendors, meanwhile, use black market exchange rates, meaning their products are cheaper for customers. They also trade in hard USD currency. Most Zimbabweans keep USD notes instead of local bills, as it is more stable, and prefer buying from vendors.\n\nWe do not accept the local currency, explained Tariro Musekiwa, a street vendor sitting on a cardboard box, who only trades in USD.\n\nCurrently, the official exchange rate is $1 to 26.4 ZiG, while the unofficial black-market rate ranges from 36 to 40 ZiG per USD, giving consumers more for less on the informal market.\n\nPeople need to buy goods at a lower cost, said Musekiwa, who sells soaps, cordial drinks and yoghurts. Because the same products are more expensive in stores, he believes the vendors are offering an important service.\n\nNgara agreed. If you look in the streets, all pavements and corners are filled with people selling something. So I try to sell goods which sell quickly at lower prices, he said.\n\nWe are in a jungle, and it is the survival of the fittest.\n\nFor registered store owners, though, the influx of vendors has not been a blessing.\n\nTrymore Chirozva, the manager at Food World, a supermarket retailer in Harare, expressed dismay that vendors sell similar products outside on the pavement.\n\nUnlike before, when vendors would sell fruits and vegetables only, of recent they have become mini-stores, affecting our business, he said.\n\nHarares CBD has just five official vending sites, which accommodate fewer than 200 vendors. Yet, thousands of informal vendors flock to the streets every day.\n\nNgara and many others admit they operate without official permits but say they find ways around the rules. The officers just demand some bribes, or sometimes just pass [us by].\n\nVendor Tariro Musekiwa says she trades only in USD [Calvin Manika/Al Jazeera]\n\nChirozva believes stores like his are negatively affected because vendors are not regulated as strictly as big businesses.\n\nPatience Maodza, an economist, believes vendors are leveraging on the regulation gap.\n\nThe government overregulates shops but not vendors, creating [an] unfair business environment for the registered entities which are tax compliant.\n\nIn the past 12 months, Zimbabwe has witnessed the closure of leading regional chain stores and clothing lines, most citing two reasons: the restrictions on the use of USD and an influx of vendors taking over their business without government intervention.\n\nOne of Zimbabwes largest wholesale hardware companies, N Richards Group, has closed two branches.\n\nSpeaking to Zimbabwes parliament, Archie Dongo, the director of the N Richards Group, said the government is overburdening those who already pay tax.\n\nReduce the taxation level and the tax heads, but collect that tax from as many players as possible. In that way, we will not have a problem of fiscal mobilisation in the economy; we actually believe well get more tax that way, Dongo said.\n\nOK Zimbabwe, the countrys top supermarket retailer, has struggled to restock its branches over the past year  a challenge compounded by the introduction of the ZiG, which disrupted supply chains and pricing structures. The retailer closed five of its supermarkets in January.\n\nEconomist Kajiva believes that the governments economic policies have played a significant role in the business sectors struggles.\n\nThe policy has resulted in a sharp reduction in money supply, placing considerable pressure on businesses, including major retailers like OK Zimbabwe and N Richards, he said.\n\nThese companies have been forced to downsize in response to a challenging economic climate driven by tight fiscal conditions.\n\nStreet vendor Portia Mbano, centre, quit her government job and works full-time, selling groceries on the street [Calvin Manika/Al Jazeera]\n\nAs traditional businesses struggle, so do traditional workers.\n\nWhile many like Ngara are embracing side hustles, some have abandoned their government jobs altogether.\n\nPortia Mbano, 39, left her job as a civil servant to become a full-time vendor.\n\nAt first, she started as a small-time seller after office hours. But she soon realised she was ageing and needs something tangible.\n\nI realised that I was losing a lot by spending time at the offices [rather] than to take this as a full-time job, she said.\n\nShe now sells a variety of groceries and small household items from a pavement stall in the CBD.\n\nSamuel Mangoma, the director of Vendors Initiative for Social and Economic Transformation (VISET), an organisation advancing the rights of informal economy workers across Africa, told Al Jazeera there has been a sharp rise in street vendors in central Harare.\n\nThis is as a result of limited opportunities in the formal job market, he said, with many people now finding refuge in the informal sector.\n\nHowever, he frowns on vendors operating in front of stores, selling the same goods for cheaper prices.\n\nPeople are trying to survive in this very difficult economic environment. But, we dont encourage our members to go and occupy spaces in front of grocery shops and big retailers. We encourage our members to operate from spaces where we dont create conflict unnecessarily with other business players, he said.\n\nNevertheless, out on the streets, government workers continue to set up their informal shops, with Ngara saying he plans to continue until his family is stable enough to survive without it.\n\nI need my son to go to university and at least own a property for my family, so I need both jobs until such a time, Ngara said.\n\nDespite challenges we face in the streets, including the government through the council and police trying to remove us from the CBD, we continue the cat and mouse game  at least for now.\n\n*Name changed to protect privacy\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27183104/Vendor-standing-by-her-cart-1743056370.jpg",
            "description": "<p>Al Jazeera Every morning, Dumisani Ngara* gets up at dawn to catch a 6:30am bus to work at Zimbabwe’s Ministry of National Housing and Social Amenities. The government-provided bus is free for civil servants in Harare, and on his $250 monthly salary, he tries to save every cent he can. Once at work, Ngara –</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cat-and-mouse-game-zimbabwe-govt-workers-moonlight-as-street-vendors/\">‘Cat and mouse game’: Zimbabwe govt workers moonlight as street vendors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        },
        {
            "title": "Zim monthly inflation rate tumbles to 0% – statistics agency",
            "url": "https://www.newzimbabwe.com/zim-monthly-inflation-rate-tumbles-to-0-statistics-agency/",
            "content": "By Alois Vinga\n\nTHE monthly inflation rate tumbled to 0% in the month of March 2025 on the back of a sustained tight liquidity stance and a cocktail of measures.\n\nLatest data released by the Zimbabwe National Statistics Agency (ZIMSTAT) shows that the weighted month-on-month inflation rate was 0.0 percent in March 2025, shedding 0.3 percentage points on the February 2025 rate of 0.3 percent.\n\nThe USD month-on-month inflation rate was 0.1 percent in March 2025, shedding 0.1 percentage points on the February 2025 rate of 0.2 percent. The USD year-on-year inflation rate (annual percentage change) for the month of March 2025 as measured by the all-items USD Consumer Price Index (CPI), was 15%.\n\nThe ZWG month-on-month inflation rate was -0.1% in March 2025, shedding -0.6 percentage points on the February 2025 rate of 0.5 percent, said ZIMSTAT.\n\nThe Food Poverty Line (FPL) for one person in March 2025 was ZWG864.20. FPL represents the amount of money that an individual requires to afford a daily minimum energy intake of 2,100 calories. ZIMSTAT uses the consumer basket for an individual deemed to be extremely poor to calculate the poverty line.\n\nThe Total Consumption Poverty Line (TCPL) for one person was ZWG 1,260.52 in March 2025. TCPL is derived by adding the non-food consumption expenditures of an individual deemed to be extremely poor and the FPL.\n\nDuring the period, the total value of exported goods in February 2025 was US$ 512.6 million, representing a 21.4% decrease from USD 652.0 million reported in January 2025.\n\nImports for February 2025 amounted to US$730.3 million, a decrease of 2.5 % from US$749.2 million recorded in January 2025. The February 2025 trade deficit for goods was US$ 217.7 million, translating to a 124.2% increase from a deficit of USD 97.1 million recorded in January 2025.\n\nAmong the countrys major export destinations in February 2025 were the United Arab Emirates (42.6%), South Africa (23.3%) and China (19.3%). The three countries accounted for around 85% of the total export value of US$512.6 million.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga THE monthly inflation rate tumbled to 0% in the month of March 2025 on the back of a sustained tight liquidity stance and a cocktail of measures. Latest data released by the Zimbabwe National Statistics Agency (ZIMSTAT) shows that the weighted month-on-month inflation rate was 0.0 percent in March 2025, shedding 0.3</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-monthly-inflation-rate-tumbles-to-0-statistics-agency/\">Zim monthly inflation rate tumbles to 0% – statistics agency   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "29 Mar 2025"
        }
    ]
}