{
    "news": [
        {
            "title": "Mnangagwa renames Tomlinson Depot to Chimoio Camp",
            "url": "https://www.newzimbabwe.com/mnangagwa-renames-tomlinson-depot-to-chimoio-camp/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has officially renamed the Tomlinson Depot to Chimoio Camp Depot as a way of dismantling colonial legacies.\n\nThe renaming ceremony also included the commissioning of four blocks residential flats, now called the Chimoio Police Camp Flats.\n\nSpeaking at the ceremony Friday, Mngangagwa said name changing is an important tool for preserving a countrys heritage.\n\nIt is with great honour and a sense of pride that I join you at this momentous occasion, to officiate at this ceremony marking the unveiling of the new name of Tomlinson Depot. This cantonment area will now be called, Chimoio Camp Depot.\n\nToday, we also witness the commissioning of residential flats, hereafter called the Chimoio Police Camp Flats, Mnangagwa said.\n\nThe 82-year-old Zanu PF leader also acknowledged shortage of decent accommodation for the uniformed forces, challenging relevant authorities to scale up efforts in addressing the housing needs.\n\nI am aware that with the current strength of men and women, the magnitude of resources required to provide institutional accommodation for our Police Service throughout the country, cannot be underestimated.\n\nAs such, my administration will continue to explore innovative ideas and strategies to provide decent institutional accommodation for officers.\n\nThis should ensure that the deployment or transfer of officers and their families to other stations is seamless, with minimum disruptions.\n\nI challenge the Zimbabwe Republic Police, ministries of Home Affairs and Cultural Heritage, Local Government and Public Works as well as National Housing and Social Amenities, among other stakeholders in the built environment, to scale up collaboration and innovation towards addressing the housing needs for the civil service in general, he added.\n\nThe bulk of police officers live in dilapidated and overcrowded housing across the country.\n\nThe police service also lacks sufficient resources to effectively execute their duties nationwide, particularly in rural areas where officers often have to walk long distances on foot to make arrests or escort suspects to court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>By Thandiwe Garusa  PRESIDENT Emmerson Mnangagwa has officially renamed the Tomlinson Depot to Chimoio Camp Depot as a way of “dismantling colonial legacies.” The renaming ceremony also included the commissioning of four blocks residential flats, now called the Chimoio Police Camp Flats. Speaking at the ceremony Friday, Mngangagwa said name changing is an important tool</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-renames-tomlinson-depot-to-chimoio-camp/\">Mnangagwa renames Tomlinson Depot to Chimoio Camp  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Police officer arrested for receiving US$40 bribe",
            "url": "https://www.newzimbabwe.com/police-officer-arrested-for-receiving-us40-bribe/",
            "content": "By Staff Reporter\n\nA POLICE officer stationed at Zengeza, Harare, landed in the dock after allegedly receiving a US$40 bribe to release a theft suspect.\n\nEdson Nangwani was caught red handed with trap money after he was reported to the Police Anti-Corruption Unit (PACU).\n\nNangwani appeared before a Chitungwiza magistrate charged with criminal abuse of office and extortion. He was granted US$100 bail.\n\nHe is expected back in court in two weeks time when he is expected to be furnished with a trial date.\n\nAllegations are that on June 7, 2025, a suspect, Tatenda Tichareva was arrested for allegedly possessing a stolen Samsung Galaxy A04E.\n\nThat same day, the suspects friend, Vincent Joni approached the investigating officer (the accused) to seek clarity on the case.\n\nInstead of offering a professional explanation, the accused demanded US$200 in exchange for the suspects release and for the matter to be shelved, said the State.\n\nThe friend reported the bribe demand to the CID Police Anti-Corruption Unit (PACU), triggering a carefully coordinated trap operation.\n\nOn the 9th of June 2025, a team of PACU detectives accompanied the friend to ZRP Zengeza, where the accused contacted the suspects friend and directed him to Office G13, and later to Office G16 for the transaction.\n\nThe court heard, under surveillance, the friend handed over US$40 in marked trap money:1 x US$20 (Serial: PH50115833C) 2 x US$10 (Serials: PK45658296B & PB36416637E) the accused received the cash inside Office G16, unaware he was being watched by detectives.\n\nMoments later, Nangwani was caught red-handed with the trap money in his left hand and immediately arrested.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/02234101/handcuffs.jpg",
            "description": "<p>By Staff Reporter A POLICE officer stationed at Zengeza, Harare, landed in the dock after allegedly receiving a US$40 bribe to release a theft suspect. Edson Nangwani was caught red handed with trap money after he was reported to the Police Anti-Corruption Unit (PACU). Nangwani appeared before a Chitungwiza magistrate charged with criminal abuse of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-arrested-for-receiving-us40-bribe/\">Police officer arrested for receiving US$40 bribe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Chivhayo gifts Highlanders with US$250,000 sponsorship",
            "url": "https://www.newzimbabwe.com/chivhayo-gifts-highlanders-with-us250000-sponsorship/",
            "content": "By Sports Reporter\n\nCONTROVERSIAL businessman Wicknell Chivhayo has donated US$250,000 to Zimbabwe football giants Highlanders.\n\nChivhayo announced this on his social media handles this Wednesday.\n\nIn recognition of my beloved uncles last wishes and my personal love for the game of football, it is my greatest pleasure to avail sponsorship worth US$250,000 in cash to Highlanders FC, as my small token to assist the club in its various administrative requirements, read part of Chivhayos post.\n\nChivhayos sponsorship to Bosso comes a few months after he settled the clubs US$26,500 debt to former coach Baltermir Britto, hence bailing out the club from a FIFA ban.\n\nThe flamboyant businessman added that the sponsorship is part of US$1 million package which he will further disburse next year.\n\nThis is just but part of a broader sponsorship package of US$1 million that will run over the next year to help the club to secure new talent and cover player sign-on fees in order to foster a more competitive 2025 Premier Soccer League, further read his post.\n\nBosso had a poor 2025 pre-season preparations due to lack of finances. The Bulawayo-based side even failed to make meaningful signings of new players after losing key players to better paying clubs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/31043415/Highlanders.png",
            "description": "<p>By Sports Reporter CONTROVERSIAL businessman Wicknell Chivhayo has donated US$250,000 to Zimbabwe football giants Highlanders. Chivhayo announced this on his social media handles this Wednesday. “In recognition of my beloved uncle’s last wishes and my personal love for the game of football, it is my greatest pleasure to avail sponsorship worth US$250,000 in cash to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chivhayo-gifts-highlanders-with-us250000-sponsorship/\">Chivhayo gifts Highlanders with US$250,000 sponsorship</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP",
            "url": "https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/",
            "content": "FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomonas recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid.\n\nGeo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under the then Ministry of Local Government, led by Winston Chitando (now Mines and Mining Minister).\n\nThe company was registered by Mirel Mrtiri, an Albanian businessman linked to corruption in his home country. Its Executive Chairman and CEO, Delish Nguwaya, is a regular attendee at state functions and is known to be a close associate of President Emmerson Mnangagwas son, Sean Mnangagwa.\n\nNguwaya was previously charged with corruption over Covid-19 procurement contracts involving his company, Drax International, in 2020, but was acquitted by court in September 2023.\n\nThey have no legal mandate to independently take over public waste management under our law, Mahere posted on her X account on Wednesday.\n\nMahere, a constitutional lawyer, argued that Geo Pomona should not impose itself on residents, as their obligations lie with the CoH, not individual households.\n\nFormer Mt Pleasant MP Fadzayi Mahere\n\nThey are not a statutory body. At best, if they have a contract with City of Harare, they are the citys agent. This means that the City of Harare is the principal and public facing party with Geo Pomona working under them as an agent. They cannot do their business independently of the city and force themselves onto people with whom they have no legal relationship.\n\nMahere questioned Geo Pomonas authority to bill residents directly, stating that the company lacks the legal basis to do so.\n\nFor the avoidance of doubt, they have no right to bill or otherwise engage residents directly absent a valid agreement with individual residents to do so. Only the City of Harare can do that in line with its powers as a local authority under Zimbabwes local government laws, she said.\n\nGeo Pomona is set to receive over US$162 million from the CoH over five years, with ratepayers ultimately footing the bill.\n\nThe 30-year agreement stipulated that Harare must deliver 550 tonnes of waste, or a minimum of 200,750 tonnes per year, resulting in US$8.03 million for the company in the first year.\n\nThis has opened doors for Geo Pomona to potentially take control of the entire waste management process, from street sweeping and refuse collection to waste disposal thereby billing residents directly.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/09034942/solid-waste.jpg",
            "description": "<p>By Staff Reporter FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomona’s recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid. Geo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/\">‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Harare’s roads patched with soil as city council fails to procure tar for over a year",
            "url": "https://www.newzimbabwe.com/harares-roads-patched-with-soil-as-city-council-fails-to-procure-tar-for-over-a-year/",
            "content": "By Darlington Gatsi\n\nCITY of Harare (CoH) has been without tar for over a year, with its workers resorting to using soil and rubble to patch roads in the capitalanother sign of deteriorating basic service delivery.\n\nCoH has been struggling to maintain road networks in residential areas, with blame being apportioned to the Zimbabwe National Road Administration (ZINARA) for disbursing insufficient funds to the local authority.\n\nThe majority of roads in Harare are riddled with potholes, with council, on numerous occasions, spotted using soil and rubble to give a semblance of road maintenance.\n\nRecently, during a full council meeting at the Town House, it emerged that CoH has not managed to buy tar, a key component in road construction.\n\nHarare Mayor Jacob Mafume attributed this to the local authoritys garnished accounts, before criticising Town House officials for failing to acquire basic supplies.\n\nRight now, I have messages from every government office in town. When they say the road is bad, people are going to pour dust. Everywhere, dust is being poured. We have money from City Parking and ZINARA that is being garnished in our bank accounts without buying tar.\n\nLook at the embarrassmentthe whole town is dusty. This is because we are patching potholes using dust, said Mafume.\n\nCoH receives remittances from its subsidiary, City Parking, and from ZINARA, which are supposed to be channelled towards road maintenance.\n\nThe citys procurement department has blamed the slow approval of purchases by the Procurement Regulatory Authority of Zimbabwe (PRAZ).\n\nHarare Councillor Denford Ngadziore accused officials of dishonesty, stating that they face no hurdles when purchasing vehicles and other luxury perks.\n\nThe challenge at the city council is that there is a cartel or a system that has to be broken. If we do not do that, we will not succeed.\n\nThe management at one time bought themselves vehicles without any challenges. The challenge is, if we do not break that [system], we will remain in one place, said Ngadziore.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/11130755/potholes-road.jpg",
            "description": "<p>By Darlington Gatsi CITY of Harare (CoH) has been without tar for over a year, with its workers resorting to using soil and rubble to patch roads in the capital—another sign of deteriorating basic service delivery. CoH has been struggling to maintain road networks in residential areas, with blame being apportioned to the Zimbabwe National</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-roads-patched-with-soil-as-city-council-fails-to-procure-tar-for-over-a-year/\">Harare’s roads patched with soil as city council fails to procure tar for over a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats",
            "url": "https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/",
            "content": "By Staff Reporter\n\nFORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF partys primary elections.\n\nKaroro spoke following Mutukudzis appearance as a State witness in a case he is facing charges of diverting agricultural inputs.\n\nHe said Mutukudzi and Chikwamba were bitter that they had failed to unseat him in 2015, 2018 and 2023 when he won the election while on remand as a result of the case.\n\nThe primaries sought a candidate from Mbire constituency to represent Zanu PF in Parliamentary elections.\n\nAt the time the allegations arose, Chikwamba was the partys District Coordinating Committee (DCC) Chairperson while Mutukudzi was his deputy.\n\nMutukudzi told the court that he was informed by a certain Zanu PF leader of suspicious trucks, allegedly linked to Karoro, that were loading fertiliser at GMB Mushumbi depot.\n\nHe said he then proceeded, with the blessing of Chikwamba, to file a report with the police. Chikwamba accompanied him.\n\nMutukudzi admitted that he lost thrice to Karoro in the race to represent Mbire in Parliament but said he was not bitter. He said it was just human nature to want to win.\n\nIt is human nature to want to win every election, said Mutukudzi, to which Karoros lawyer Admire Rubaya further asked if he was happy with the defeat.\n\nRubaya questioned why malpractices at GMB would be reported to him if he was neither a government official nor an interested party.\n\nThe matter continues on Friday before Regional Magistrate Marehwanazvo Gofa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Staff Reporter FORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF party’s primary elections. Karoro spoke following Mutukudzi’s appearance as a State witness</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/\">Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "A Fragile State: Zimbabwe Reckons With the Catastrophic Loss of US Aid",
            "url": "https://www.newzimbabwe.com/a-fragile-state-zimbabwe-reckons-with-the-catastrophic-loss-of-us-aid/",
            "content": "By Linda Mujuru and Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Eliza Mandove was a child when her brother was killed during Zimbabwes war for independence. She was beaten during the same attack and sustained injuries to her hands and legs. Now 46, Mandove has no motor function in her left hand and struggles to walk and carry heavy loads. She suffers from chronic headaches. She cant work in the fields. Her husband once farmed, but years of drought and erratic rainfall have led to diminishing yields.\n\nAid from the United States was crucial. It kept Mandoves family of seven fed.\n\nIn January, that food aid abruptly stopped. On his first day in office, US President Donald Trump signed an executive order that ended nearly all foreign aid. Mandove and her family  and many others  were left with very little.\n\nThe end of US foreign aid was abrupt. In Zimbabwe, the sudden suspension put many at immediate risk ofhunger. In Uganda, health workers told patients to collect their antiretroviral drugs before clinicsshut down. In Bangladesh, tuberculosis specialists were immediatelylaid off, leaving people with that illness without care.\n\nStories like this emerged around the world.\n\nThe sudden pullout has left a crisis behind. The aid had been a lifeline for millions since the United States Agency for International Development, the US foreign aid agency, was formed in 1961. At the same time, it failed to transform the economies and governance of low-income countries. In the worst cases, it enabled corruption.\n\nIn Zimbabwe alone, nearly US$7 billion in US aid poured in between 1980 and 2025. But in the four decades since its independence from colonial rule, the countrys per capita gross domestic product hasfallen by almost10%. It is poorer today than it was then.\n\nForeign aid, in most cases, feeds people and offers them medical aid one day at a time.\n\nInvestment from China, on the other hand, continues to sweep across the continent. Overall, that investment is creating stable jobs and infrastructure that has the potential to upend decades of reliance on that aid. The question now in Zimbabwe, as in other African countries, is whether this new era will be the one that, at last, brings economic transformation.\n\nTurning that corner wont be easy, says Persistence Gwanyanya, a member of the monetary policy committee of the Reserve Bank of Zimbabwe. Reliance on aid led to the countrys leadership being a bit relaxed when it comes to economic responsibility.\n\nDonors were coming in to fill the gap, he says.\n\nNow, he adds, is the time for change.\n\nWe just have to live within our budget, he says. We need to be more accountable.\n\nZimbabwe was one of the last African countries to gain its independence from European colonial occupation. In 1980, following a bitter civil war, a revolutionary movement led by Robert Mugabe succeeded in overthrowing a white minority government that had itself seceded from the British empire in 1965. The country benefited from infrastructure built under the white-controlled government that, for a while, sustained society.\n\nOur parents could take care of us with ease, says Tellmore Mutize, 63, a dressmaker from Harare who reached adulthood just as the country gained independence.\n\nThere were jobs, she says. Groceries were cheap, and schools were free. When she gave birth to her first child in a public hospital in 1980, she paid nothing and received top-quality care. When she had twins five years later, the experience was much the same.\n\nColonialism left many parts of Africa in shambles and with an impossible task: emerge from decades of oppressive foreign control to effectively manage natural resources, maintain infrastructure and meet peoples health care, humanitarian and economic needs.\n\nDuring the Cold War, a decadeslong showdown between the US and Russia, the US wielded soft power and won global influence with USAID. Since 1946, the US has budgeted over US$1.1 trillion in foreign assistance to Africa, for everything from emergency food aid to HIV/AIDS relief, from early childhood education programs to civil society development.\n\nDeep corruption was beginning to take root, and human rights abuses were a real threat. Poverty remained a problem. But for many black Zimbabweans, life was easier than it had been for generations.\n\nAbundant rainfall boosted agriculture, reinforcing Zimbabwes reputation as Africas breadbasket. The economy grew in bursts, and the health care systemdrew medical touristsfrom across Africa.\n\nThen came disaster. The regions worst drought set in in 1992, leading to a widespread food shortage. The price of groceries skyrocketed. The droughts effects rippled through many sectors, including health care, where hospitals struggled to maintain adequate services.\n\nAs crops dried up, so did public spending. The World Bank began to require countries receiving funding to agree to market reforms, often characterized by privatizing state-owned industries, ending food subsidies and enacting user fees at hospitals.\n\nMaize flour and cooking oil began to flow in from donors like the Red Cross and Save the Children.\n\nWhen they came, we were happy because in 1992, there was no food, Mutize says.\n\nEight years later, Mugabe began expropriating thousands of large, white-owned farms dating from the countrys colonialism era.\n\nFarm workers, villagers and veterans of Zimbabwes war for independence invaded those white-owned farms, leading to 40 deaths (34 black Zimbabweans and six white farmers) and countless assaults. Eventually, those large farms were converted into about 170,000 smaller properties. Much of the land was snatched up by powerful political players; other parcels went to ordinary people who reveled in owning land after generations of oppression.\n\nThe chaotic, rushed and violent nature of the land reforms led to a massive withdrawal of international investment. Zimbabwes central bank began recklessly printing cash. Hyperinflation took root. Corruption ballooned. Public services collapsed.\n\nBy the time Mutize was ready to give birth to her last child in 2003, public hospitals had deteriorated. She paid out of pocket to give birth at a private hospital.\n\nTwo-thirds of the population required food aid in 2002 and 2003. US aidquickly grew, from US$42 million in 2002 to US$120 million in 2007 and US$260 million in 2009. Even so, between 1999 and 2008, Zimbabwes GDP dropped by 49%  the most severe economic downturn in a country not at war, according to a2019 report from the African Development Bank.\n\nBetween 2014 and 2024, PEPFAR, a giant US health program aimed at treating and containing the spread of HIV/AIDS, supplied on average 18% of Zimbabwes national health budget. In 2019, amid chaotic inflation and massive cuts to the health budget, donor contributions to the health budget were 4.5 times larger than Zimbabwes contribution to its own health ministrys budget.\n\nTotal US aid to Zimbabwe peaked at US$340 million in 2022. In 2024, the last full year before the US slashed foreign aid, it totaled US$290 million.\n\nNevertheless, over a third of Zimbabweans continue to live in poverty: Around 35% of Zimbabwes close to 17 million people live on just US$2.15 per day.\n\nEconomists in Africa and throughout the world have struggled to understand why so much aid hasnt brought about structural transformation. Though health aid has had some big successes  new HIV infections in Zimbabwe, for example,declined more than tenfoldfrom a high in the early 1990s  the Zimbabwean economy is chronically unstable.\n\nIn February, Elon Musk, the unelected man who was tasked with dramatically downsizing the US government, claimed that USAID was corrupt. But theres scant evidence of widespread corruption in USAID projects in Zimbabwe. In 58 audits of USAID projects in Zimbabwe, commissioned by the USAID Office of Inspector General between 2017 and 2024, three projects were flagged for having unsupported costs totaling US$660,000. In at least two of those examples, the corruption was at the local level, not within USAID.\n\nThe real corruption is in Zimbabwes halls of power. In 2024, the US sanctioned President Emmerson Mnangagwa and 10 other Zimbabwean leaders for corruption and human rights abuses. The announcement from the US Department of Treasury, which implements such sanctions, noted that Mnangagwa, his wife and senior government leaders are engaged in corruption related to gold and diamond smuggling networks, as well as a host of other illicit financial schemes and human rights abuses.\n\nAnd thats just a small sampling of the known corruption.\n\nWe need to deal with some nefarious activities that have been resulting in the leakages of the revenue from the fiscus, says Gwanyanya. We need to be more efficient as a government. We need to be more efficient in terms of operations  but also in terms of dealing with the wastages and leakages.\n\nThat corruption ripples down into daily life. Bribery is rife. New mothers have to bribe nurses to getofficial birth cards for their infants. Ruling political party leadersgive away land to their supporters. The black market is now thebackbone of the local economy.\n\nEverything happening in Zimbabwe now is a part of the economic crisis that began in the 1990s, says Eldred Masunungure, a retired University of Zimbabwe political scientist.\n\nWe are still in that crisis, he says.\n\nFragility, he says, has become the countrys defining feature: fragile politics, fragile economy and a fragile social order. When corruption is so routine, he says, How do you uproot that?\n\nPeople are desperate, and those who can leave, do so. Masunungures children live in Canada.\n\nDecades of brain drainhave left the country with far fewer skilled people than it needs to fill the void left by aid agencies. Some African countries wont be able to fill the gap, and even with the resources, they might struggle to manage services that were previously run by donors, says Ken Opalo, an associate professor at the Walsh School of Foreign Service at Georgetown University. That, he says, is my biggest worry.\n\nEconomic transformation is possible  and China could make it happen, Opalo says.\n\nMore than any other donor, China has been willing to partner with countries of programs and projects that have the potential to deliver structural economic transformation, he says.\n\nMore than 70% of US funding focuses on health and saving lives, while more than 70% of Chinas investment goes toward infrastructure projects like electricity, roads and bridges to drive economic growth, says Deborah Brutigam, director of the China-Africa Research Initiative at Johns Hopkins University. Chinas influence in Zimbabwe includes mining claims worth billions of US dollars in the diamond, platinum, coal, chrome and lithium sectors.\n\nBetween 2000 and 2023, China loaned about US$182 billion throughout Africa  ranging from US$3 billion to Zimbabwe to US$46 billion to oil-rich Angola  according to the Boston University Global Development Policy Center. Most of these loans were for either energy or transportation projects  in line with Chinas US$1 trillion Belt and Road Initiative  and have an average interest rate of 3%, higher than World Bank rates but lower than private lender rates of 67%.\n\nChinas approach is often called debt trap diplomacy, meaning that the intent is to overwhelm low-income countries with debt they cant repay. But theres no evidence that these Chinese loans are somehow predatory, Brutigam says. So far, there are no examples of China deliberately entangling another country in debt, then using that debt to extract an unfair or strategic advantage, she adds.\n\nChina has also been keen to make symbolic donations. In 2022, China built Zimbabwe a parliament building at an estimated cost of US$120million. Its one of 15 African parliament buildings that China has either built or refurbished, though its the biggest and most expensive to date.\n\nMore investment from China isnt necessarily a good thing, says Sabiti Makara, a professor in the Department of Governance at Kabale University in Uganda.\n\nSeeing that America is withdrawing its influence, the Chinese might set new terms that may render Africa dependent on them, Makara says.\n\nOn the ground, Chinese investment brings jobs. Chinese Foreign Minister Wang Yi said in March at a press conference that China has created more than 1.1 million jobs in Africa over the past three years.\n\nBut Zimbabweans say those jobs arent necessarily good ones.\n\nNathan Chiwundo worked for a Chinese brick molding company in Harare. There were poor labor conditions and frequent regulation violations, he says. There were no days off  he worked weekends and public holidays.\n\nBut jobs are rare, Chiwundo says, so people will continue to fill them if China provides them.\n\nFor regular people, he says, more investment from China will be meaningless if employees are not well taken care of.\n\nZimbabwean leaders say theyve been able to respond to the countrys most urgent needs, despite the lack of aid.\n\nThere are enough antiretroviral drugs for all who need them, Dr. Douglas Mombeshora, minister of health and child care, told journalists at a media workshop in April. Spending has also been reprioritized to care for people who have tuberculosis and provide malaria treatment, and US$12 million has been earmarked to import medication.\n\nThere is no need to panic, he said.\n\nGwanyanya, the Reserve Bank of Zimbabwe committee member, says hes confident that everything will work out. We just need to adjust to the new reality, he says. Otherwise, we cant survive.\n\nMandove, the woman injured during the war for independence, isnt so sure.\n\nUS aid helped ensure that countless Zimbabweans  and people across the world  had enough to eat. China might invest in roads and factories, but USAID kept food on tables.\n\nNow, Mandove says, her family eats just two meals a day, usually wheat with wild okra. Its cheaper than maize, the countrys staple food. Her youngest son, just 10 years old, herds cattle for neighbors to earn money. But the family doesnt have what it needs.\n\nThe food is not enough, she says. I am usually hungry.\n\nApophia Agiresaasi, GPJ, contributed reporting to this story.\n\nGamuchirai Masiyiwais a Reporter-in-Residence based in Harare, Zimbabwe. An internationally acclaimed economic reporter, her award-winning work includes a Clarion Award for her innovative comic feature on Zimbabwean currency. Gamuchirai holds a bachelors degree in Political Science and a diploma in Journalism and Mass Communication from the University of Zimbabwe. She brings deep expertise and a fresh perspective to reporting on economic issues impacting her community.\n\nLinda Mujuruis a Reporter-in-Residence based in Harare, Zimbabwe. A renowned international reporter and public speaker, she has spent nearly a decade covering human rights, the mining sector, the economy, and public health. She holds an MBA from Midlands State University and both masters and bachelors degrees in Journalism and Media Studies from the National University of Science and Technology in Zimbabwe. Linda is one of Global Press most widely read and syndicated journalists. In 2023, she won the Community Champion Award from the Institute for Nonprofit News for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12110537/GPJ_Zim_Ug_DonorDependency_Illustration.png",
            "description": "<p>By Linda Mujuru and Gamuchirai Masiyiwa, GPJ Zimbabwe US aid helped save and sustain lives, but failed to build lasting prosperity. Now, the money’s gone. Can Zimbabwe become self-sufficient, or will it turn to China?  This story was originally published by Global Press Journal.  HARARE, ZIMBABWE — Eliza Mandove was a child when her brother</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-fragile-state-zimbabwe-reckons-with-the-catastrophic-loss-of-us-aid/\">A Fragile State: Zimbabwe Reckons With the Catastrophic Loss of US Aid </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Harare councillors fight undervaluation of land compensated to Chiyangwa’s Pinnacle Holdings",
            "url": "https://www.newzimbabwe.com/harare-councillors-fight-undervaluation-of-land-compensated-to-chiyangwas-pinnacle-holdings/",
            "content": "By Darlington Gatsi\n\nHARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands.\n\nThe Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate land to Pinnacle Holdings as compensation for property acquired by the government.\n\nPinnacle Holdings is owned by businessman Philip Chiyangwa, who is also a ZANU PF member.\n\nThe directive sparked a heated debate in a recent Council meeting, with Ward 16 Denford Ngadziore expressing concern that the council might part with the land at a value lower than its actual price.\n\nThe report is saying US$5 per square metre. So my argument is, in Malbereign and around Harare, we are selling at US$20 per square metre, whilst on the other side, it is going for US$5 per square metre.\n\nWe cannot transfer land whose value we do not know. We are not transferring tomatoes; this is land we are talking about, said Ngadziore.\n\nThe proposed compensation has angered residents, with associations labelling the move as unconstitutional and tantamount to government interference in the affairs of the local authority.\n\nAs a result, residents are calling for the compensation to Pinnacle Holdings to be halted.\n\nSeveral stands have been earmarked for compensation, subject to the Councils approval. However, anomalies have been raised regarding some of the stands.\n\nAdonia Shoko raised a red flag over stands in Kuwadzana, stating that some individuals already hold offer letters for the land.\n\nKudzai Kadzombe also raised a similar concern regarding land identified as part of the compensation to Pinnacle Holdings.\n\nI have a personal interest because, as Councillor of Ward 41, we have already raised this issue. We have a piece of land in Bluffhill which is on that list, but residents had already submitted a petition and begun mobilising to build a council school, said Kadzombe.\n\nThe HCC Finance Committee is set to deliberate on Garwes directive and conduct due diligence on the anomalies raised in the meeting.\n\nHowever, Mafume bluntly told the Council that those aggrieved should consider mounting a legal challenge.\n\nAnyone who feels aggrieved or has their property rights affected by the letter is advised to make a beeline to their lawyers, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/07224513/town-house.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands. The Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-councillors-fight-undervaluation-of-land-compensated-to-chiyangwas-pinnacle-holdings/\">Harare councillors fight undervaluation of land compensated to Chiyangwa’s Pinnacle Holdings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Jun 2025"
        }
    ]
}