{
    "news": [
        {
            "title": "Telecoms business leader Masiyiwa receives honorary doctorate in Engineering from Stellenbosch University",
            "url": "https://www.newzimbabwe.com/telecoms-business-leader-masiyiwa-receives-honorary-doctorate-in-engineering-from-stellenbosch-university/",
            "content": "Stellenbosch University\n\nTechnology entrepreneur and investor Strive Masiyiwa, a pioneer of the mobile telecommunications sector in Africa, received an honorary doctorate in Engineering from Stellenbosch University (SU) on 10 December 2024. The visionary leader has over the past four decades helped to cement Africas telecoms industry and business sector, while his philanthropy has improved socioeconomic development to the benefit of the continents people.\n\nThe Faculty is humbled that Mr Masiyiwa accepted this honorary doctorate in Engineering from Stellenbosch University. He is an exemplary example of an African who did well and is now doing good by improving the lives of many Africans. The Faculty looks forward to partnering with him in our endeavour to make an impact to improve the quality of life of people in Africa, says Prof Wikus van Niekerk, Dean of the SU Faculty of Engineering.\n\nMasiyiwa, whose career is rooted in engineering, was born in Zimbabwe in 1961 and now lives in the UK. He obtained a bachelors degree in Electrical and Electronic Engineering from the University of Cardiff in Wales in 1983, after which he returned to Zimbabwe to briefly work as a telecoms engineer before setting up his first business in 1986.\n\nThe business network of this founder and executive chair ofCassava Technologiesspans Africa, Europe, India, Latin America, the Middle East, and the USA. A pan-African and global technology group, Cassava Technology businesses include African Data Centres, cloud and cyber security services (Liquid C2), fibre infrastructure (Liquid Intelligent Technologies), renewable energy, and most recently, a new business unit, Cassava AI. As part of Masiyiwas mission to ensure that no African is left behind in the digital technology revolution, his companies have ensured that more than 110,000 kilometres of fibre provide connectivity across the continent, spanning East to West Africa, and Cape Town to Cairo.\n\nAmong his other prominent start-up companies and investments over the years are Mascom Wireless Botswana, Econet Wireless Zimbabwe, Liquid Telecom, Airtel Nigeria, 2Degrees Mobile, and Trilogy Capital Partners Canada.\n\nMasiyiwa has served as a special envoy to the African Union in terms of its response to Covid-19 and an Ebola outbreak in the mid-2015s and served on various commissions of the United Nations.\n\nHis commitment to promoting education and healthcare in Africa is evident in the endeavours of his family foundations, Higherlife Foundation and Delta Philanthropies, which are led by his wife Tsitsi and eldest daughter Elizabeth Tanya. Signatories of the Giving Pledge, these foundations have supported more than 300 000 scholarships to children in Africa to date, as well as various catalytic social impact investments and initiatives in the fields of public health, the empowerment of women and girls, youth mentorship, rural transformation, sustainable livelihoods, disaster relief and preparedness. He has also been involved in pan-African initiatives that target AIDS, cholera, cervical cancer, Ebola, and most recently, Covid-19.\n\nHe was listed in 2020 as one of Bloombergs 50 most influential people in the world, and one of the ten most powerful men in Africa byForbesmagazine in 2015. In 2014, 2017 and 2021, he was included inFortunemagazines list of the worlds 50 greatest leaders. In 2019, he received the World Food Prize Borlaug Medallion for his role as Chair of the Alliance for a Green Revolution in Africa, which focused on strengthening food systems and supporting Africas smallholder farmers. He was selected in 2023 as an international honorary member of the American Academy of Arts and Sciences, and in October 2024 was awarded the W.E.B. Du Bois Medal by the Hutchins Centre of African and African American Research at Harvard University. Most recently, in November 2024, his revolutionising of telecommunications and mobile money services in Zimbabwe was recognised by the countrys ICT Excellence Award.\n\nMasiyiwa has previously received honorary doctorates from Yale University, Morehouse College in the UK, South Africas Nelson Mandela University, and his alma mater, Cardiff University. He currently serves on the boards of Netflix Inc., Bill & Melinda Gates Foundation and National Geographic Society, as well as on global advisory councils including that of Bank of America, Stanford University and Bloomberg New Economy Forum. Previously, he held board positions at Unilever Plc, The Rockefeller Foundation and Morehouse College, among others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/30040500/Strive-Masiyiwa.jpg",
            "description": "<p>Stellenbosch University Technology entrepreneur and investor Strive Masiyiwa, a pioneer of the mobile telecommunications sector in Africa, received an honorary doctorate in Engineering from Stellenbosch University (SU) on 10 December 2024. The visionary leader has over the past four decades helped to cement Africa’s telecoms industry and business sector, while his philanthropy has improved socioeconomic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/telecoms-business-leader-masiyiwa-receives-honorary-doctorate-in-engineering-from-stellenbosch-university/\">Telecoms business leader Masiyiwa receives honorary doctorate in Engineering from Stellenbosch University</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "ZIMRA cracks whip on churches, taxes anointing oil, merchandise",
            "url": "https://www.newzimbabwe.com/zimra-cracks-whip-on-churches-taxes-anointing-oil-merchandise/",
            "content": "By Staff Reporter\n\nZIMBABWE Revenue Authority (ZIMRA says churches are compelled to pay taxes on profits generated from the sale of church merchandise.\n\nZIMRA is expecting churches to pay taxes from the sale of goods such as anointingoil, and t-shirts among others which are being produced as part of fundraisingactivities.\n\nHowever, tithes and donations havenotbeen charged by ZIMRA.\n\nZIMRA in a noticepublished Thursday said it will be engaging churches on tax compliance.\n\nThe Zimbabwe Revenue Authority (ZIMRA), wishes to inform all churches of an upcoming Stakeholder Engagement dedicated to addressing tax compliance across all applicable tax categories.\n\nIncome derived from trading activities is subject to income tax. Examples of taxable income include but are not limited to: Proceeds from the sale of church literature, books, or music, revenue from the sale of church-branded merchandise (e.g., apparel, anointing oils, artefacts, etc.), Income from the sale of meals, clothing, or similar items. Additionally, such sales may attract Value Added Tax (VAT) depending on the sales thresholds, read the notice.\n\nReligious organisations have been engaged in fundraising activities and some have been reportedly failing to declare tax.\n\nIn 2019 the State dragged Prophetic, Healing, and Deliverance Ministries leader Walter Magaya to court for failing to declare tax of more than $28 million accrued from 2018 to 2019 contravening the Value Added Tax Act.\n\nThe church generated revenue from regalia, anointing oil and a guest house at Yadah Hotel in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/08/17062813/Churches-e1629178113164.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE Revenue Authority (ZIMRA says churches are compelled to pay taxes on profits generated from the sale of church merchandise. ZIMRA is expecting churches to pay taxes from the sale of goods such as anointing oil, and t-shirts among others which are being produced as part of fundraising activities. However, tithes and donations have not been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimra-cracks-whip-on-churches-taxes-anointing-oil-merchandise/\">ZIMRA cracks whip on churches, taxes anointing oil, merchandise </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "2025 National Budget: Mthuli Ncube’s ‘blood-sucking’ taxes draws fire from Industry",
            "url": "https://www.newzimbabwe.com/2025-national-budget-mthuli-ncubes-blood-sucking-taxes-draws-fire-from-industry/",
            "content": "By Alois Vinga\n\nTHE gruelling tax measures introduced by Finance Minister Mthuli Ncube in his latest 2025 National Budget have spilt over to parliament following concerns raised by Industry hinting the interventions are set to destroy whatever is left of the formal sector.\n\nRattled by the endless piling up of taxes on the industry, which experts warn may diminishthe little gains of what remainsin the delicate formal sector, Business Member Organisations (BMOs) concerns exposedgrave inconsistencies in the National Budget Blueprint requiring urgent redress.\n\nA Non-Adverse Report received by the Parliamentary Legal Committee contains several concerns raised by Industry.\n\nFor instance, the Confederation of Zimbabwe Industries (CZI)says withthe reduction of the degree of export orientation from 100% to 80% for manufacturing companies under SEZ it will be difficult to penetrate the export market due to highproductioncosts.\n\nWe are of the view that the 25% tax on rental income istoo high as there are other costs to be met by rental income collections, like renovations, maintenance costs among others. The proposal is to ensure that the tax is applied on net rental income as opposed to gross revenue from rentals, the industry lobby group said.\n\nCZI further submitted that IMTT taxes the whole value chain resulting in up to 10% additional costs to products leaving local products priced relatively higher than regional products.\n\nThe Confederation of Zimbabwe Retailers (CZR) CZR proposed the removal of tax on fast foods and betting tax which seem to target the poor.\n\nThere are a number of taxes charged on the purchase of food such as VAT, IMTT and the proposed fast-food tax which further burdens the poor. Such taxes need stakeholder consultations before they are introduced, the retailers group said.\n\nThe Chamber of Mines noted that the 2025 National Budget Statement was announced at a time when the mining industry is operating below its potential on the back of a challenging environment characterised by weak commodity prices, foreign currency shortfalls, capital shortages and fragile power supply.\n\nCoupled with a high-cost structure on the backdrop of high royalties and taxes, high electricity tariff, exchange rate losses and high cost of funding mining projects, the viability of mining companies has been severely compromised. These challenges have combined to weigh down on the performance of the mining industry with mineral revenue coming down significantly and mining companies struggling to meet their production targets.\n\nThe proposal to extend the royalty on coal to all types of coal, including coking and industrial coal, will increase production costs in the energy sector. This extension translates into higher operational expenses, impacting various downstream industries. Specifically, the cost of generating thermal power is likely to rise, as this additional cost will be passed down to Zimbabwe Power Company (ZPC), the miners group said.\n\nThe grouping contends that the agriculture industry, particularly the tobacco sector, will be directly affected by the increased cost of industrial coal used for tobacco curing.\n\nMiners also expressed dissatisfaction over Ncubespolicy to the effect that minerals will be deemed sold at the value determined on either the date the sales contract is entered or the date on which the purchaser receives the product, whichever is higher.\n\nThe proposed measure may lead to disputes between ZIMRA and taxpayers, as during periods of price declines, ZIMRA may require miners to pay royalties on unrealised cash proceeds, the Chamber of Mines said.\n\nMiners also contested the 20% Capital Gains Tax as too high and way beyond the regional averages. They were of the view that the tax must not be applied in retrospect and that the rate be maintained at 5% as effected in 2017.\n\nRoyalty for platinum is high at 7%, the Chamber of Mines recommends a commodity price-linked royalty framework for platinum as follows: a base royalty of 3 % for the platinum price of up to US$1,100 / ounce, a royalty rate of 5% for a platinum price between US$1,100 /ounce and US$1,400, a royalty rate of 7% for platinum price between US$1,400/ounce and US$2,000/ounce and a royalty of 10% for platinum price above US$2,000 ounce.\n\nRoyalty for diamonds at 10% is also impacting negatively on the viability of diamond projects. Producers of alluvial diamonds which are predominantly low quality are the most affected as their prices have taken a huge knock, the report reads.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01093427/mthuli-1.jpg",
            "description": "<p>By Alois Vinga THE gruelling tax measures introduced by Finance Minister Mthuli Ncube in his latest 2025 National Budget have spilt over to parliament following concerns raised by Industry hinting the interventions are set to destroy whatever is left of the formal sector. Rattled by the endless piling up of taxes on the industry, which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/2025-national-budget-mthuli-ncubes-blood-sucking-taxes-draws-fire-from-industry/\">2025 National Budget: Mthuli Ncube’s ‘blood-sucking’ taxes draws fire from Industry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "In Tune with the Mind: Happy Hormones",
            "url": "https://www.newzimbabwe.com/in-tune-with-the-mind-happy-hormones/",
            "content": "By Nqoba M Sibenke\n\nOne thing I find fascinating is the mechanism that regulates our mood. Mood refers to a state of the mind at a certain time for example happiness, sadness, gloom, excitement etc.\n\nOur body has mood regulators in the form of hormones which determine our mood at a particular time. Hormones are chemicals that the body produces for specific functions. When we feel unhappy and stressed certain hormones are responsible for unhappiness. Similarly, there are also happy hormones or happy juices. These enhance our happiness and reduce stress. These are Oxytocin, endorphins, serotonin and Dopamine. These four juices work differently from each other. They also have different roles and characteristics.\n\nDOPAMINE\n\nDopamine is also known as the feel good hormone. It is both a neurotransmitter and a hormone. A neurotransmitter is a chemical that relays information between nerve cells in the brain and the rest of the body. As a neuro hormone, it is produced by the hypothalamus in the brain. Dopamine has several functions which include movement, memory, pleasurable reward and motivation, behaviour and cognition, attention, sleep and arousal, mood, and learning.\n\nDopamine has been said to function based on motivation and reward. When we do a pleasurable activity we feel motivated which stimulates the secretion of Dopamine. As Dopamine is released we feel good and motivated to do more of the pleasurable activity. However, this can also lead to addiction.\n\nWhen we have balanced levels of Dopamine we will feel happy, motivated, alert and focused. On the other hand low levels of the hormone result in poor memory, fatigue, sadness, mood swings, and poor concentration among others. There is also a relationship between levels of Dopamine and mental disorders like schizophrenia, Mania, ADHD, Parkinsons and Addictions. To have healthy Dopamine levels we need to engage more in activities that give us pleasure however moderation is essential.\n\nENDORPHINS\n\nEndorphins function as painkillers. They are in actual fact natural pain killers. They get their name from a combination of two words endogenous  and morphine . Most of us are aware of the function of morphine which is to ease pain. When we are hurt or are experiencing pain, nerves communicate with the brain and the brain releases Endorphins.\n\nEndorphins can be naturally stimulated by engaging in activity that rewards like eating, massage, intimacy, dancing and such activities. It should be noted that Endorphins might have similarities with Dopamine however their function is different.\n\nA deficiency of Endorphins can result in a number of negative symptoms such as anxiety, depression, addiction, and sleep disorders among many others.\n\nSEROTONIN\n\nLike Dopamine, Serotonin also doubles as a neurotransmitter. Its key functions include learning, memory, and happiness as well as regulating body temperature, sleep, sexual behaviour and hunger. It is a key hormone which is mostly found in the gut.\n\nSerotonin has been known to be a mood stabilizer. It creates a feeling of calmness and emotional stability. Lack of Serotonin may result in mood disorders, depression, anxiety, sleep disorders, digestive disorders, suicidal behaviour, OCD, phobia and many other issues. It is therefore important to ensure good production of Serotonin, this can be done by exercising and sunbathing moderately.\n\nOXYTOCIN\n\nThe love hormone  as it is commonly known, Oxytocin is responsible for enhancing happiness through bonding. It is produced in the hypothalamus. Oxytocin has been proven to be responsible for smooth labour during childbirth. After childbirth, it helps in lactation which is the production of milk for the baby.\n\nAmong its many functions, Oxytocin helps in regulating sleep and moods. It promotes overall wellness and mental stability. It is enhanced mostly by intimate actions like touch, hugging, cuddling, and sexual activity among many others.\n\nCONCLUSION\n\nHaving discussed briefly about hormones that regulate mood and produce positive emotions, it is apparent that we can be deliberate in determining our mood.\n\nAn exception is in cases where the body is unable to produce the particular hormones. In such cases, medication is usually given for example Selective serotonin reuptake inhibitors which help boost Serotonin levels and control Depression. Similarly, in the case of Dopamine, the doctor can prescribe antidepressants and dopamine reuptake inhibitors.\n\nMood has a huge impact on our total wellness hence the importance of acquiring knowledge on how we can harness the faculties that regulate mood.\n\nAs we approach the festive season, a season of joy, giving and all good things let us make the best of our happy hormones and help others to be happy too.\n\nNqoba Sibenke is a registered intern Counselling Psychologist and can be reached atnqoba.sibenke@icloud.com/ +263715330911\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12112138/happyhormones.png",
            "description": "<p>By Nqoba M Sibenke One thing I find fascinating is the mechanism that regulates our mood. Mood refers to a state of the mind at a certain time for example happiness, sadness, gloom, excitement etc. Our body has mood regulators in the form of hormones which determine our mood at a particular time. Hormones are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-tune-with-the-mind-happy-hormones/\">In Tune with the Mind: Happy Hormones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "Mahala! Gayton McKenzie is ‘officially opening ke Dezemba’ by giving away tickets to Makhadzi and Chris Brown’s concerts",
            "url": "https://www.newzimbabwe.com/mahala-gayton-mckenzie-is-officially-opening-ke-dezemba-by-giving-away-tickets-to-makhadzi-and-chris-browns-concerts/",
            "content": "IOL\n\nGayton McKenzie is giving away tickets to see the Makhadzi and Chris Brown concerts.\n\nTaking to X, the countrys Minister of Sports, Arts and Culture said the giveaway was for those who cannot afford the ticket prices.\n\nChris Brownofficially landed in South Africathis week, ahead of his two concerts taking place at the FNB Stadium in Soweto, this weekend.\n\nInitially Brown was due to perform at one concert on December 14 at the FNB Stadium, however, due to tickets selling out in minutes,a second concert date was added, at the same venue.\n\nMeanwhile, Makhadzi is set to perform at the Peter Mokaba Stadium on December 21.\n\nIn October,IOL reported that McKenzie bought more than 200 tickets to Makhadzis concert,this after the minister and the singing sensation clashed publicly earlier this year over claims that Makhadzi received no support from the government after the Limpopo musician bagged an award at the BET Awards.\n\nMeanwhile,McKenziespost was met with mixed reaction.\n\nX user, @AndriesAR said he will be giving away free airtime to feminists wanting to stop Browns concert.\n\nWhooooo, halala Minister of the year! This is what we like to hear. You are such a good person. God Bless \n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12103559/Chris-Brown-is-in-SA.webp",
            "description": "<p>IOL Gayton McKenzie is giving away tickets to see the Makhadzi and Chris Brown concerts. Taking to X, the country’s Minister of Sports, Arts and Culture said the giveaway was for those who cannot afford the ticket prices. Chris Brown officially landed in South Africa this week, ahead of his two concerts taking place at the FNB</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mahala-gayton-mckenzie-is-officially-opening-ke-dezemba-by-giving-away-tickets-to-makhadzi-and-chris-browns-concerts/\">Mahala! Gayton McKenzie is ‘officially opening ke Dezemba’ by giving away tickets to Makhadzi and Chris Brown’s concerts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "Merc burnt to a shell as 3 perish in road accident",
            "url": "https://www.newzimbabwe.com/merc-burnt-to-a-shell-as-3-perish-in-road-accident/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Republic Police has confirmed a tragic road accident that claimed three lives on Tuesday at the 220-kilometre peg along the Harare-Mutare Road, near Die Guns Turn Off.\n\nIn a statement, ZRP Commissioner Paul Nyathi said, Three people were killed while two others were injured when a Mercedes Benz vehicle with two passengers on board was involved in a head-on collision with a Honda Fit vehicle carrying two passengers.\n\nAs a result of the accident, the Mercedes Benz vehicle caught fire and was burnt to shell.\n\nThe victims have since been identified by the ZRP.\n\nAdded Nyathi, The three victims were positively identified by their next of kin as listed: Charles Saurombe (31), a male adult of Tsvingwe, Penhalonga, Mutare Tafadzwa Jemwa (47), a female adult of Zambuko Trust, Harare > Desire Tinarwo (31), a male adult of Zambuko Trust, Mutare The bodies of the victims were taken to Victoria Chitepo Provincial Hospital mortuary for post mortem while the injured were admitted at the same hospital.\n\nThe Zimbabwe Republic Police reiterates that motorists should abide by all road rules and regulations and avoid speeding to curb road accidents.\n\n",
            "image_url": null,
            "description": "<p>By Staff Reporter The Zimbabwe Republic Police has confirmed a tragic road accident that claimed three lives on Tuesday at the 220-kilometre peg along the Harare-Mutare Road, near Die Guns Turn Off. In a statement, ZRP Commissioner Paul Nyathi said, “Three people were killed while two others were injured when a Mercedes Benz vehicle with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/merc-burnt-to-a-shell-as-3-perish-in-road-accident/\">Merc burnt to a shell as 3 perish in road accident </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "Controversial ex-Zanu MP Wadyajena, Matutu, 45 others stampede for anti-corruption commission jobs",
            "url": "https://www.newzimbabwe.com/controversial-ex-zanu-mp-wadyajena-matutu-45-others-stampede-for-anti-corruption-commission-jobs/",
            "content": "By Staff Reporter\n\nNAMES of prominent citizens, including politicians, are featured on the list of aspiring commissioners of the Zimbabwe Anti-Corruption Commission (ZACC).\n\nAccording to an interview schedule released by the Parliament of Zimbabwe, a total of 47 candidates have been shortlisted for the ZACC posts.\n\nInterviews are set to be held on December 19, 2024, with interviewees facing the grill until nearly midnight.\n\nThe ZACC shortlist includes former Information Deputy Minister, Kindness Paradza, former Zimbabwe Electoral Commission (ZEC) commissioner Quabani Moyo and Zanu PF returnee Tongai Matutu.\n\nControversial Zanu PF politician, Justice Mayor Wadyajena, as well as the losing Zanu PF Chegutu West candidate in the 2023 election, Last Farai Chigavazira are also vying for positions in the anti-graft body.\n\nThe bloated list of 47 also includes human rights lawyer Wilbert Mandinde, Zanu PF apologist Gabriel Chaibva, and former Zimbabwe Republic Police (ZRP)s Outpost magazine editor, Resistant Ncube.\n\nThe ZACC is an independent commission created to combat corruption and crime.\n\nIt was established on September 8, 2005, in accordance with the Constitution of Zimbabwe and the Anti-Corruption Commission Act, which outline its powers, functions and objectives. The commission is administered under the Office of the President and Cabinet (OPC).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/06230523/Mayor-Justice-Wadyejena.png",
            "description": "<p>By Staff Reporter NAMES of prominent citizens, including politicians, are featured on the list of aspiring commissioners of the Zimbabwe Anti-Corruption Commission (ZACC). According to an interview schedule released by the Parliament of Zimbabwe, a total of 47 candidates have been shortlisted for the ZACC posts. Interviews are set to be held on December 19,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/controversial-ex-zanu-mp-wadyajena-matutu-45-others-stampede-for-anti-corruption-commission-jobs/\">Controversial ex-Zanu MP Wadyajena, Matutu, 45 others stampede for anti-corruption commission jobs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "SA taxi driver arrested for smuggling children from Zimbabwe",
            "url": "https://www.newzimbabwe.com/sa-taxi-driver-arrested-for-smuggling-children-from-zimbabwe/",
            "content": "TimesLive\n\nThe Border Management Authority (BMA) apprehended an SA minibus taxi driver allegedly trying to smuggle undocumented foreign children into the country through the Beitbridge port of entry.\n\nThe BMA said the taxi driver was carrying 25 undocumented foreigners when he was intercepted on Monday. His passengers included 20 children aged between five and 14 years old, who were unlawfully transported under dangerous and inhuman conditions, BMA spokesperson Mmemme Mogotsi said.\n\nThe vehicle used was impounded. The driver has been charged and is in police custody and a conveyance fine of R375,000 has been issued in accordance with the Immigration Act, Mogotsi said.\n\nFollowing standard protocols, the children were handed over to the Zimbabwean child welfare authorities for their safety and care while investigations continued.\n\nBMA acting commissioner Jane Thupana said the operation highlighted the BMAs efforts to disrupt criminal networks that exploited vulnerable people, particularly children.\n\nThe trafficking and smuggling of people undermines human dignity and border security and the BMA remains vigilant in its efforts to safeguard South Africas ports of entry and protect those at risk, she said.\n\nThe commissioner said the BMA will continue to work closely with other law enforcement to curb illegal activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12060042/children.png",
            "description": "<p>TimesLive The Border Management Authority (BMA) apprehended an SA minibus taxi driver allegedly trying to smuggle undocumented foreign children into the country through the Beitbridge port of entry. The BMA said the taxi driver was carrying 25 undocumented foreigners when he was intercepted on Monday. His passengers included 20 children aged between five and 14</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sa-taxi-driver-arrested-for-smuggling-children-from-zimbabwe/\">SA taxi driver arrested for smuggling children from Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "Mnangagwa rewards Sables for winning Rugby Africa Cup",
            "url": "https://www.newzimbabwe.com/mnangagwa-rewards-sables-for-winning-rugby-africa-cup/",
            "content": "By Sport Reporter\n\nFour months after winning the Rugby Africa Cup, Zimbabwes senior mens rugby team was on Wednesday rewarded with US$6 500 each by President Emerson Mnangagwa at the State House.\n\nThe Sables reward comes barely a week after Mnangagwa rewarded the Warriors for 2025 AFCON qualification.\n\nZimbabwe rugby team won the Africa Cup in August to end a 12-year trophy drought, an achievement masterminded by team coach Piet Benade.\n\nSpeaking during the presentation, Mnangagwa applauded the Sables for winning the countrys second Rugby Africa Cup title in history saying it is a true sign of hard work.\n\nThe nation honours the teamwork and patriotism that you demonstrated throughout the championship, which brought the team this success of being crowned champions.\n\nThis historic achievement reflects your dedication and perseverance as players, coaches, and support staff.\n\nI am aware that the journey that led to this momentous occasion was not an easy one. As a team, you endured rigorous training sessions and extraordinary pressure on and off the field as you faced competitive as well as aggressive opponents, he said.\n\nZimbabwe senior mens rugby team had a good 2024 season campaign, other than winning the Rugby Africa Cup, the team ended its 23-year-old winless run against fellow Southern Africa rivals Namibia.\n\nApart from continental success, Zimbabwe recently recorded its first victory against a team outside the African continent when it won against the United Arab Emirates and South Korea during its Middle East  Asia tour last month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12055541/Sables-money.jpg",
            "description": "<p>By Sport Reporter Four months after winning the Rugby Africa Cup, Zimbabwe’s senior men’s rugby team was on Wednesday rewarded with US$6 500 each by President Emerson Mnangagwa at the State House. The Sables reward comes barely a week after Mnangagwa rewarded the Warriors for 2025 AFCON qualification. Zimbabwe rugby team won the Africa Cup</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-rewards-sables-for-winning-rugby-africa-cup/\">Mnangagwa rewards Sables for winning Rugby Africa Cup </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        },
        {
            "title": "Tanganda ‘reverses’ full-scale VFEX listing decision",
            "url": "https://www.newzimbabwe.com/tanganda-reverses-full-scale-vfex-listing-decision/",
            "content": "By Alois Vinga\n\nLISTED horticulture concern, Tanganda Tea Company (TTC) has rescinded the decision to migrate its stocks to the Victoria Falls Exchange (VFEX), instead opting to pursue a special listing on the US$-only denominated stocks market.\n\nLast month, Tanganda board of directors announced plans to hold discussions aimed at relocating the companys listing to capitalise on VFEXs stable currency environment and incentives, reflecting a growing trend among Zimbabwean firms.\n\nThe firm, which rejoined the ZSE on February 3, 2022, with an initial market capitalisation of US$134.29 million, has faced significant losses attributed to currency volatility and economic shifts. Following the scrapping of the Zimbabwe dollar and the introduction of the Zimbabwe Gold (ZiG) currency in April, Tangandas valuation dropped to US$21.67 million, marking a loss of approximately US$112.62 million in market value since its ZSE listing.\n\nBut in a major climb down this week, Tanganda informed its shareholders that the decision for a full-scale migration will no longer be the case.\n\nReference is made to the Cautionary Announcements published on 28 October 2024 and 18 November 2024 regarding the proposed migration of Tanganda listing from the Zimbabwe Stock Exchange (ZSE) to the Victoria Falls Stock Exchange (VFEX) and the subsequent capital raise by way of a Renouncable Rights Offer to raise approximately US$7,7 million.\n\nThe Directors no longer recommend the migration of Tangandas listing to VFEX. Instead, they propose the creation of a class of shares to be known as Class A ordinary shares, which will be subsequently listed on the VFEX as a Secondary listing, the company said.\n\nThe company said a capital raise by way of a Renounceable Rights Offer to raise US$8 million will follow soon after the issuing, listing and allotment of Class A ordinary shares to the existing ordinary shareholders in proportion to their shareholding in the company.\n\nTanganda believes such initiatives are intended to enhance the companys capital structure, diversify shareholder offerings and ensure liquidity of the companys shares.\n\nFurther details regarding the transactions will be provided in a Circular to shareholders that is being finalized.\n\nThe transactions, if successful, may have a material effect on the Companys share price. Accordingly, shareholders are advised to exercise caution when dealing in the Companys shares, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/09174617/tanganda-tea-estate.gif",
            "description": "<p>By Alois Vinga LISTED horticulture concern, Tanganda Tea Company (TTC) has rescinded the decision to migrate its stocks to the Victoria Falls Exchange (VFEX), instead opting to pursue a special listing on the US$-only denominated stocks market. Last month, Tanganda board of directors announced plans to hold discussions aimed at relocating the company’s listing to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanganda-reverses-full-scale-vfex-listing-decision/\">Tanganda ‘reverses’ full-scale VFEX listing decision</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-12 20:41:14"
        }
    ]
}