{
    "news": [
        {
            "title": "Elvis Chipezeze wins Carling Knockout Cup Player of the Tournament award",
            "url": "https://www.newzimbabwe.com/elvis-chipezeze-wins-carling-knockout-cup-player-of-the-tournament-award/",
            "content": "By Sports Reporter\n\nWarriors goalkeeper Elvis Chipezeze has been crowned Carling Knockout Cup Player of the Tournament at the 2024/25 Betway Premiership Awards held on Tuesday evening.\n\nChipezeze edged out Iqraam Rayners and Magesi FC teammate Edmore Chirambadare to claim the prestigious accolade.\n\nThe veteran shot-stopper was instrumental in Magesi FCs Cup success, earning four Player of the Match awards during the tournament, which the club went on to win.\n\nChipezeze also played a pivotal role in helping Magesi survive relegation, a run highlighted by him being named Betway Premiership Player of the Month for March.\n\nHe finished the season as one of the leagues top goalkeepers, keeping 12 clean sheets in 30 matches.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14051412/Elvis-Chipezeze.jpg",
            "description": "<p>By Sports Reporter Warriors goalkeeper Elvis Chipezeze has been crowned Carling Knockout Cup Player of the Tournament at the 2024/25 Betway Premiership Awards held on Tuesday evening. Chipezeze edged out Iqraam Rayners and Magesi FC teammate Edmore Chirambadare to claim the prestigious accolade. The veteran shot-stopper was instrumental in Magesi FC’s Cup success, earning four</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elvis-chipezeze-wins-carling-knockout-cup-player-of-the-tournament-award/\">Elvis Chipezeze wins Carling Knockout Cup Player of the Tournament award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "Maswanhise voted Motherwell Player of the Month",
            "url": "https://www.newzimbabwe.com/maswanhise-voted-motherwell-player-of-the-month/",
            "content": "By Sports Reporter\n\nWarriors forward Tawanda Maswanhise has been voted Motherwell FCs Player of the Month for July, following an impressive run in the Premier Sports Cup.\n\nThe 22-year-old netted four goals in as many games, helping the Scottish side reach the Round of 16, where they will face St Johnstone.\n\nThank you for voting me for the Player of the Month. Thank you for the support, and hopefully many more Player of the Months for me and others, Maswanhise said after receiving the award.\n\nHe edged out fellow nominees Lukas Fadinger, Apostolos Stamatelopoulos, and Callum Slattery to clinch the honour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30155431/t.-maswanhise.jpeg",
            "description": "<p>By Sports Reporter Warriors forward Tawanda Maswanhise has been voted Motherwell FC’s Player of the Month for July, following an impressive run in the Premier Sports Cup. The 22-year-old netted four goals in as many games, helping the Scottish side reach the Round of 16, where they will face St Johnstone. “Thank you for voting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhise-voted-motherwell-player-of-the-month/\">Maswanhise voted Motherwell Player of the Month</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "VP Chiwenga celebrates ex-wife Marry’s assets forfeiture, auctioning in SA – says he reported her criminal activities",
            "url": "https://www.newzimbabwe.com/vp-chiwenga-celebrates-ex-wife-marrys-assets-forfeiture-auctioning-in-sa-says-he-reported-her-criminal-activities/",
            "content": "By Staff Reporter\n\nVice President Constantino Chiwenga has disclosed that he was the one who reported his ex-wife, Marry Mubaiwas alleged criminal activities, and has welcomed the recent forfeiture and auctioning of her assets in South Africa.\n\nMubaiwa has lost her luxury home in Pretoria, along with two high-end vehicles, in the neighbouring country.\n\nOn Monday, the National Prosecuting Authority (NPA) confirmed the Gauteng High Courts ruling from 5 December 2022, which stipulated that Mubaiwas assets, a property in Sterrewag and two Land Rover Range Rovers, were the products of money laundering and illicit financial flows.\n\nOne of the vehicles has already been auctioned off, with the funds intended to compensate victims.\n\nThe ruling, which follows a preservation order issued in 2022, strengthens cross-border efforts to recover assets suspected of being gained through criminal activity. For Mubaiwa, the loss represents yet another setback in her ongoing legal battles.\n\nIn a statement released through his legal representatives, Machingura Legal Practitioners, Chiwenga hailed the development as significant and praised the collaborative efforts between the National Prosecuting Authority of Zimbabwe and its South African counterparts.\n\nOur client welcomes this significant development and commends the collaborative efforts between the NPA of Zimbabwe and its South African counterparts in pursuing justice across borders. The ruling by the Gauteng High Court affirms the principle that proceeds of crime have no sanctuary within the region, the statement read.\n\nChiwengas lawyers also stated that the forfeiture of Mubaiwas property would see the proceeds repatriated to Zimbabwe, in line with the global fight against illicit financial flows and the recovery of assets acquired through unlawful means.\n\nThe VP maintains that he reported his ex-wife after becoming aware of her alleged criminal activity.\n\nOur client wishes to place on record that upon becoming aware of the unlawful activities in question, he promptly reported the matter and has since rendered his full cooperation to the NPA. His actions were motivated solely by the national interest and in furtherance of justice and accountability, the statement added.\n\nMubaiwa, who has been in ill health for some time, has endured significant personal losses beyond the forfeiture of assets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22055746/Chiwenga-and-Wife.jpeg",
            "description": "<p>By Staff Reporter Vice President Constantino Chiwenga has disclosed that he was the one who reported his ex-wife, Marry Mubaiwa’s alleged criminal activities, and has welcomed the recent forfeiture and auctioning of her assets in South Africa. Mubaiwa has lost her luxury home in Pretoria, along with two high-end vehicles, in the neighbouring country. On</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vp-chiwenga-celebrates-ex-wife-marrys-assets-forfeiture-auctioning-in-sa-says-he-reported-her-criminal-activities/\">VP Chiwenga celebrates ex-wife Marry’s assets forfeiture, auctioning in SA – says he reported her criminal activities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "Mutapa Investment Fund in drive to resuscitate Cottco, increase profitability",
            "url": "https://www.newzimbabwe.com/mutapa-investment-fund-in-drive-to-resuscitate-cottco-increase-profitability/",
            "content": "By Anna Chibamu\n\nMUTAPA Investment Fund (MIF) is on a massive drive to resuscitate its entities so that they can increase profitability and production.\n\nGiving oral evidence to the Lands and Agriculture Parliamentary Portfolio Committee on the Cotton Company of Zimbabwe (Cottco) debt legacy issues in Mt Hampden this Tuesday, the MIF Chief Executive Officer (CEO) John Mangudya said revamping all its 30 entities will reduce fiscal risk.\n\nCottco has been owing its workers, transporters and farmers for a while, and MIF chipped in recently to rescue all loss-making entities under its arm to make sure they start on a new page and realise profits for self-sustainability.\n\nMangudya said it was the governments mandate to ensure those entities are viable, but not to remain under debt, disadvantaging employed citizens and other contracted stakeholders.\n\nWe are putting in place some facilities, finding facility structures to ensure that the Cottco will be able to purchase cotton from the farmers, and pay the money that they owe to the workers.\n\nCottco owes US$3.1 million to its employees, US$1 million to transporters and US$6 million to farmers.\n\nMutapa Investment Fund has put in place a US$10 million facility towards a payment structure for those being owed.\n\nThe payment to those being owed is expected to be complete by December 2025, said Mangudya.\n\nSo we are putting in place those structures to ensure that Cottco will be able to pay.\n\nWe are starting by the current crop, and we have worked this past US$5 million so far out of the US$10 million for them to be able to purchase the cotton whilst we are putting in place measures to pay the outstanding leg as it is., said Mangudya, adding that out of the 30 entities that are under Mutapa, 53% of them were profit-making entities, and 4% of them are loss-making.\n\nMangudya told this committee that MIF needed to continue to feed those entities so that, at the end of the day, they become bigger companies in terms of profit-making and crop production.\n\nWe are, therefore, looking at all of them, we have done a decrease assessment of all our entities, and those who are loss-making, we are putting in place turn- around measures and strategies, so that at the end of the day, they will be able to produce more, increase their production, include self-delivery, and increase commercial viability, so that they become a less burden to the fiscus, which you call fiscal risk.\n\nWe want to reduce that fiscal risk in these companies, and we have managed to do that, said the MIF CEO.\n\nIn an interview with the media after the committee oral evidence hearing, Mangudya said MIF was looking forward to having these entities go onto the global distribution system so that they will be able to pay for online tickets, do travel agents, as well as increase their volume of business.\n\nIf you look at NRZ, for example, we are doing the same, we are looking at NRZ and assessing what needs to be done. There are four things we are trying to do in NRZ, with what we have on our track, which is our rail, with the working ones, with the locomotives, and the signalling, and all what we are doing there is to show that the rail will fix the questions on the rail, on the track, and the one that is done, its working good, working perfectly in time.\n\nWe have been doing this, and we are happy that at least we are now seeing a turnaround in all these entities, said Mangudya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/20195538/mangudya.jpg",
            "description": "<p>By Anna Chibamu MUTAPA Investment Fund (MIF) is on a massive drive to resuscitate its entities so that they can increase profitability and production. Giving oral evidence to the Lands and Agriculture  Parliamentary Portfolio Committee on the Cotton Company of Zimbabwe (Cottco) debt legacy issues in Mt Hampden this Tuesday, the  MIF Chief  Executive Officer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-investment-fund-in-drive-to-resuscitate-cottco-increase-profitability/\">Mutapa Investment Fund in drive to resuscitate Cottco, increase profitability</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home",
            "url": "https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/",
            "content": "IOL\n\nMany Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation.\n\nThese were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa forthe 2025 Liberation Movements Summit hosted by the African National Congress (ANC) in Kempton Park.\n\nThe summit concluded on Monday and was hosted under the theme: Defending the liberation gains, advancing integrated socio-economic development, strengthening solidarity for a better Africa.\n\nSouthern African liberation movements, including the ANC, Peoples Movement for the Liberation of Angola (MPLA), Namibias ruling party, the South West Africa Peoples Organisation (Swapo); Mozambiques Frente de Libertao de Moambique (Frelimo); Zanu-PF, and Tanzanias ruling Chama Cha Mapinduzi (CCM) were represented at high level at the summit in Gauteng.\n\nMutsvangwa, in an interview withbroadcaster Newzroom Afrika, was asked for his views on the prevailing political and economic situation in Zimbabwe, which has resulted in the extensive migration of Zimbabweans into South Africa, estimated in the millions, sparking tensions in South African communities.\n\nIn his response, Mutsvangwa said Zimbabweans in South Africa are seeking greener pastures, but the situation back home has significantly improved.\n\nIt is the search for better pastures, that is natural. South Africa had the advantage of having comparative access to capital as a white apartheid state. In colonial times, capital into Africa followed white, and South Africa has the biggest white population on the African continent. All those Western countries gave South Africa a certain edge in access to capital.\n\nWe in Zimbabwe/Rhodesia were second in terms of our white population. We also had comparatively better access to capital than any other African country, and we had migration of labour from Mozambique, Malawi, and Zambia into Zimbabwe.\n\nThe former Zimbabwean ambassador to the Peoples Republic of China said people follow where they see an advantage in terms of development and capital.\n\nNow things have changed. We are now having capital in a flat global world where China can supply capital, India can supply capital, Riyadh can supply capital, so we now have an Africa that is going to global markets, getting capital. That discrepancy in access to capital, which was the case for the colonial era, is beginning to disappear.\n\nYou cannot believe it, there is now a seamless environment between life in Zimbabwe and life abroad. That is why our diaspora is coming back to Zimbabwe, putting a lot of money  our diaspora feels at home, they are now beginning to invest at home. For your information, the biggest diaspora migration is white.\n\nHe said the white Zimbabweans who had fled the country at the onset of majority rule in 1980 make up a good number of the people moving back into the landlocked Southern African nation ruled by President Emmerson Mnangagwa.\n\nSo the return of the white diaspora back to Zimbabwe is actually an indication that things are getting better in Zimbabwe. Remember we are operating the hardest currency in the world, the US dollar, and if you can make your economy succeed on the back of the US dollar, it means you are doing very well as a country, said theWar Veterans Association chairperson.\n\nSpeaking to IOL,Dr Alexander Rusero, head of the department of international relations and diplomacy at the Africa University situated in Mutare, Zimbabwe, said the landlocked country seemingly has its worst times behind it  economically and politically.\n\nI think in all fairness, Zimbabwe has had its bad tide and we are definitely past that in as much as the mess we were once in as a country is concerned. That explains why you hear an opposition voice. We are as good as not having an opposition in Zimbabwe, and if you want to look at Zimbabwes dynamics currently, just look at the balance of forces within Zanu-PF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>IOL Many Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation. These were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/\">‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:50",
            "date": "30 Jul 2025"
        },
        {
            "title": "Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says",
            "url": "https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/",
            "content": "By Alois Vinga\n\nA total 49,2% of Zimbabwes youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed.\n\nThe stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET category. Females are the worst affected with 57, 4% compared to 40,4% men under the bracket.\n\nThe worst affected province during the period was Mashonaland Central with a rate of 58, 1% followed by Matabeleland North at 53, 8% and Matabeleland South at 52,4%. Bulawayo Province had the lowest rate at 38,5%.\n\nThe data shows that across the provinces, female youths are the worst affected after scoring much higher percentages than their male counterparts. Proportions of youth not in education, employment or training (NEET) for the age group 15-24 years, was 38.5 percent in Bulawayo province and 46.0 percent in Masvingo province.\n\nThe United NationsPopulationFund has since reported that Zimbabwe is likely to miss its opportunity to derive thedemographicdividend(DD) from its youthfulpopulation.\n\nDD  refers to the temporary economic benefits that can arise from a significant increase in that can arise from a significant increase in the ratio of working age adults as a result of rapid fertility decline. The firstdemographic dividendopened before 1990 and reached a peak in 2013 and is now in the diminishing returns phase.\n\nAccording to the report, the expanded Unemployment Rate for the country stood at 37,1% , with youth in the 15 to 24 age band being hardest hit at 58,2% and those between 15 to 35 standing at 46,1%.\n\nThe unemployment rate for Midlands province was 21.8 percent. Female unemployment rate for the province was 20.8 percent while the male unemployment rate was 23.3 percent.\n\nThe unemployment rate for persons with at least one form of functional disability was 23.8 percent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/16221726/Youth-Unemployment.png",
            "description": "<p>By Alois Vinga A total 49,2% of Zimbabwe’s youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed. The stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/\">Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:50",
            "date": "30 Jul 2025"
        }
    ]
}