{
    "news": [
        {
            "title": "Zimbabwe has $9billion plan to join African electricity drive",
            "url": "https://www.newzimbabwe.com/zimbabwe-has-9billion-plan-to-join-african-electricity-drive/",
            "content": "The plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of the countrys power production from hydro, wind, solar and biomass plants.\n\nZimbabwe laid out plans to raise more than $9 billion to boost energy access at a conference in London on Wednesday, an event organized by multilateral lenders to promote a flagship African electrification program to private investors.\n\nThe plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of the countrys power production from hydro, wind, solar and biomass plants, a copy of the presentation sent to Bloomberg showed. Zimbabwe has been hit by regular power outages in recent years, often lasting most of the day, due to a lack of generation capacity.\n\nMission 300, which the banks unveiled at a conference in Tanzania in January, aims to bring electricity to 300 million people in sub-Saharan Africa by 2030 at a cost of tens of billions of dollars sourced from development finance institutions and private investors. The region is home to about 83% of the 680 million people globally who dont have access to electricity.\n\nDespite having abundant renewable energy potential, Zimbabwe continues to face critical energy challenges, July Moyo, the countrys energy minister, wrote in the plan, titledZimbabwes National Energy Compact.As of 2024, 38% of the population lacks access to electricity.\n\nZimbabwes ambitions of benefiting from the program are complicated by the fact that it has been in default to multilateral lenders  including the World Bank  for a quarter of a century. That means it cant borrow money from them and the finance it needs will have to come largely from private investors.\n\nUnder the plan Zimbabwe plans to seek:\n\nGhana, Togo, Mozambique and Burundi are also scheduled to present their plans at the conference, which isnt open to the media, on Wednesday. Eleven countries, including the Democratic Republic of Congo and Nigeria, disclosed their blueprints to boost electrification at the Tanzania conference.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04192823/solar-in-harare.jpg",
            "description": "<p>Bloomberg The plan, which falls under the World Bank and African Development Bank’s Mission 300 program, envisages a more than doubling of the country’s power production from hydro, wind, solar and biomass plants. Zimbabwe laid out plans to raise more than $9 billion to boost energy access at a conference in London on Wednesday, an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-has-9billion-plan-to-join-african-electricity-drive/\">Zimbabwe has $9billion plan to join African electricity drive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "05 Jun 2025"
        },
        {
            "title": "Calls grow to ban pitbulls in Zimbabwe",
            "url": "https://www.newzimbabwe.com/calls-grow-to-ban-pitbulls-in-zimbabwe/",
            "content": "By Darlington Gatsi\n\nPRESSURE is mounting on the government to ban pit bulls as domestic pets, as Zimbabwe continues to record deaths and injuries caused by the vicious dogs.\n\nThis follows the fatal attack of a Harare man, Samuel Machara, by a pitbull in Bluffhill.\n\nMacharas death is not an isolated incident, as similar cases have been recorded, raising concerns over the safety of keeping the dogs as pets.\n\nGospel musician Tembalami has initiated apetitionto push for a ban on pitbulls.\n\nHe argues that the dogs have become a danger and threaten public safety.\n\nWe have had countless deaths caused by pit bulls. Now its time to act. For years, the pit bull breed has been associated with savage attacks resulting in serious injuries and, tragically, fatalities in our communities. Despite taking necessary precautions, the inherent aggressive nature of these dogs has led to unforeseen and heartbreaking incidents involving our loved ones.\n\nThe increasing number of pit bull attacks highlights the urgent need for action. In countries like the United Kingdom and Canada, legislation has been implemented that bans or severely restricts the breeding and ownership of pit bulls. Such measures have led to a decrease in dangerous encounters and have proven effective in enhancing public safety, read the petition.\n\nAn estimated 12 countries worldwide have enforced a ban on keeping pit bulls, and calls are growing louder for Zimbabwe to follow suit.\n\nRecently, Harare Mayor Jacob Mafume indicated that the City Council would address the menace caused by the vicious animals.\n\nTembalamis petition further reads, Zimbabwe must take a similar approach to ensure the well-being of its citizens. A nationwide ban on pit bull ownership as pets and as security dogs will significantly reduce the risk of attacks. Pet owners can opt for other breeds that are known for their kindness and loyalty, providing a safer environment for all.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/01174941/pitbull-e1748796599291.jpeg",
            "description": "<p>By Darlington Gatsi PRESSURE is mounting on the government to ban pit bulls as domestic pets, as Zimbabwe continues to record deaths and injuries caused by the vicious dogs. This follows the fatal attack of a Harare man, Samuel Machara, by a pitbull in Bluffhill. Machara’s death is not an isolated incident, as similar cases</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/calls-grow-to-ban-pitbulls-in-zimbabwe/\">Calls grow to ban pitbulls in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "05 Jun 2025"
        },
        {
            "title": "ZWG annual inflation will not affect consumer purchasing power – Central Bank",
            "url": "https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics.\n\nThis comes afterinflation statistics by the Zimbabwe National Statistics Agency (Zimstat)revealedthat annual inflation surged to 92,1% in the month of September 2025.\n\nThe developments recently triggered an outcry from industry, which blamed the September 2024 43% local currency devaluation directive for pushing up the inflationary pressures. The business community also contends that the high ZWG annual inflation rates pose challenges for businesses, particularly due to the impact on interest rates.\n\nBut in a statement Wednesday, the RBZ governor, Dr John Mushayavanhu, said the transition from the ZW$ to ZWG-denominated prices inevitably created a statistical gap in the calculation of annual inflation figures. This resulted in Zimstat computing and publishing yearly inflation in April 2015 after obtaining a full year of ZWG prices.\n\nThe RBZ therefore, advised the public that the recorded rise in year-on-year ZWG inflation in April and May 2025 is primarily due to the base effect emanating from the once-off spike in monthly inflation from 5,8% in September 2024 to 37,2% in October 2024.\n\nThe current trend in annual inflation is expected to continue up to September 2025 and decline thereafter to align with the current low and stable monthly inflation. The current annual inflation will therefore not affect consumer purchasing power and value preservation, as the inflation impact has already been realised, said Mushayavanhu.\n\nThe central bank exchequer said going forward, the economy is projected to decline to 30% by 31 December 2025 and to further decline towards single-digit levels in the outlook period.\n\nConsidering the current pricing circumstances where annual ZiG inflation is not reflective of the current pricing dynamics, the RBZ encourages economic agents to focus on month-on-month inflation, which has a more direct link to current ZWG purchasing power expectations.\n\nThe monthly ZWG inflation will remain low and stable as Monetary Policy remains appropriately tight to balance price stability and economic growth, added Mushayavanhu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics. This comes after inflation statistics by the Zimbabwe National Statistics Agency (Zimstat) revealed that annual inflation surged to 92,1% in the month of September 2025. The developments recently triggered an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/\">ZWG annual inflation will not affect consumer purchasing power – Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "05 Jun 2025"
        },
        {
            "title": "VAR saves Warriors to pick a draw against Mauritius",
            "url": "https://www.newzimbabwe.com/var-saves-warriors-to-pick-a-draw-against-mauritius/",
            "content": "By Sport Reporter\n\nThe Warriors COSAFA Cup tournament campaign started with a nil-all draw against Mauritius in a Group A match played on Wednesday evening at Free State stadium in South Africa.\n\nZimbabwe sent a youthful squad to COSAFA, with goalkeeper Martin Mapisa (27) as the oldest.\n\nZimbabwe could have gone a goal up before the break, but Tinotenda Meke failed to convert two clear chances in the 32ndand 41stminutes.\n\nComing back to the second half, Mauritiusproved to be a better side, as they made several attacks in search of a goal.\n\nThe Dodos went on to score a goal in the 72nd minute, only for it to be cancelled after the intervention of VAR.\n\nDespite making a few changes, the Warriors failed to create meaningful chances upfront, although they dominated possession in the final ten minutes.\n\nTeam captain Andrew Mbeba almost gave Zimbabwe the much-needed goal in the 91stminute, only for his header to slightly miss the target.\n\nZimbabwe is now sitting third in the group with one point, the same as second-place occupiers Mauritius.\n\nMozambique is topping Group A with 3 points after beating South Africa 1-0, Wednesday afternoon.\n\nThe Warriors will be back in action on Saturday when they face neighbours South Africa in the second match of the campaign.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04194541/warriors-mauritius.jpeg",
            "description": "<p>By Sport Reporter The Warriors’ COSAFA Cup tournament campaign started with a nil-all draw against Mauritius in a Group A match played on Wednesday evening at Free State stadium in South Africa. Zimbabwe sent a youthful squad to COSAFA, with goalkeeper Martin Mapisa (27) as the oldest. Zimbabwe could have gone a goal up before</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/var-saves-warriors-to-pick-a-draw-against-mauritius/\">VAR saves Warriors to pick a draw against Mauritius</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "05 Jun 2025"
        },
        {
            "title": "Sponsored lies – Chamisa dismisses claims he is forming new party",
            "url": "https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has dismissedas sponsored liessocial media rumours suggesting he is launching a new movement at the end of this month.\n\nSince his resignation as Citizens Coalition for Change (CCC)president in January 2024, following what he described as the hijacking of his party by Zanu PF,Chamisa has kept both supporters and opponents guessing over his next move.\n\nChamisa has repeatedly emphasised that he has not left politics but was forced to abandon the CCC due to its takeover.\n\nIn recent days, social media has been awash with flyers claiming Chamisa has launched a new party.\n\nIgnore these lies and falsehoods, Chamisa posted on his X account.\n\nOverwhelmed and flooded by calls from anxious, restless and expectant citizens. Disregard these sponsored lies from scared propagandists.\n\nA new nation founded on love, Zimbabwe shall be a new and great nation governed by love, truth and justice, not hate, violence, lies, deceit and corruption.\n\nLove is the missing essential! Love is the foundation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/21132503/DSC06267-copy-scaled.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has dismissed as “sponsored lies” social media rumours suggesting he is launching a new movement at the end of this month. Since his resignation as Citizens Coalition for Change (CCC) president in January 2024, following what he described as the hijacking of his party by Zanu PF, Chamisa has kept both supporters</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/\">Sponsored lies – Chamisa dismisses claims he is forming new party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "05 Jun 2025"
        },
        {
            "title": "Oreo maker sues Aldi in US over ‘copycat’ packaging",
            "url": "https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/",
            "content": "BBC\n\nThe corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of blatantly copying the packaging of its famous snacks.\n\nCourt documents showed that Mondelz International said Aldi uses similar packaging likely to deceive consumers and ride the coattails of the companys attraction, fame and prestige.\n\nThe snack giant also is behind Wheat Thins, Nutter Butter, Chips Ahoy!, and Ritz  all products the company accuses Aldi of copying with its discount versions.\n\nAldi US didnt respond to the BBCs request for comment, but its British counterpart stressed that it is not involved in the lawsuit.\n\nA spokesperson for Aldi UK told the BBC, that they are under the same ownership but operate as completely separate businesses.\n\nMondelz, which submitted the lawsuit in May, said it had reached out to Aldi several times about the confusingly similar packaging.\n\nAlthough Aldi did discontinue or alter the packaging of some products, the supermarket has continued making unacceptable copies, the lawsuit stated.\n\nThe company claimed that if Aldi is allowed to continued with its product lines, it will irreparably harm the Mondelz brand.\n\nThe lawsuit included side-by-side pictures comparing the appearances of Mondelz product with Aldis.\n\nMondelz lawsuit The snack giant included side-by-side pictures of their products (L) next to Aldis biscuit brands (R)\n\nIn the lawsuit, Aldi is accused of trademark infringement, unfair competition and unjust enrichment. Mondelz said it is seeking damages.\n\nMondelz described Aldis business model as hinging on low-priced private label products that resemble the look and feel of well-known brands.\n\nAldi, which has its headquarters in Germany, is known as a discount supermarket offering affordable alternatives to well-known brands.\n\nThere are over 2,500 Aldi shops in the US.\n\nThis is not the first time Aldi has been embroiled in a trademark battle. Earlier this year, it lost a battle with Cider producers Thatchers, which accused the supermarket of copying its drink in taste and appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04041224/oreo.webp",
            "description": "<p>BBC The corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of “blatantly” copying the packaging of its famous snacks. Court documents showed that Mondelēz International said Aldi uses similar packaging likely to “deceive” consumers and “ride the coattails” of the company’s “attraction, fame and prestige”. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/\">Oreo maker sues Aldi in US over ‘copycat’ packaging</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "05 Jun 2025"
        },
        {
            "title": "Scotts Maphuma faces backlash for missing major children’s festival in Mozambique",
            "url": "https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/",
            "content": "IOL\n\nAmapiano artistScotts Maphuma, real name Mpho Lebajoa,is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform.\n\nThe ShayiMoto singer was set to perform in the country over the weekend at an annual Childrens Day festival in Matola, Mozambique.\n\nHowever, he did not show up to the event, and he later discovered that things work differently in Mozambique, finding himself in trouble with the local authorities.\n\nIt all started when a video of the artist in a police holding cell circulated on social media and sparked mixed reactions as well as questions from fans.\n\nLocal reporters from Mz Magazine News posted the video on their Instagram with a caption that reads: Scotts Maphuma  levado a esquadra por no ter chegado a tempo de actuar.\n\nIt translates to: Scotts Maphuma is taken to the police station for not arriving on time to perform.\n\nMaphuma was meant to headline the Childrens Day festival on Sunday, June 1, at an event known as Lizha s festas in Matola, a vibrant Mozambican suburb.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/09064854/scotts.webp",
            "description": "<p>IOL Amapiano artist Scotts Maphuma, real name Mpho Lebajoa, is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform. The “Shayi’Moto” singer was set to perform in the country over the weekend at an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/\">Scotts Maphuma faces backlash for missing major children’s festival in Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "05 Jun 2025"
        }
    ]
}