{
    "news": [
        {
            "title": "A ploy to push me out – Kwekwe United president dismisses claims he has stepped down",
            "url": "https://www.newzimbabwe.com/a-ploy-to-push-me-out-kwekwe-united-president-dismisses-claims-he-has-stepped-down/",
            "content": "By Sports reporter\n\nKwekwe United club president Phil Makekera has dismissed claims that he has stepped down and is selling the cash-strapped Castle Lager Premier Soccer League franchise.\n\nMakekera said the rumour is simply a ploy topush him out oftheclub.\n\nI will not just walk away from my project unless someone buys me out.\n\nI am selling shares in the team, and I remain as of today 100% shareholder, and I know there are people who want to force me out, he told NewZimbabwe.com.\n\nReports were that the Kwekwe United boss had onWednesday morning notified membersofthe clubs executive group that he was stepping down as president so as to create time for his family.\n\nSince promotion from the Central Region Division One League, Kwekwe United has been facing financial challenges which have seen players protesting for outstanding signing-on fees and salaries.\n\nIn April, the club failed to fulfil a home match against Herentals after the players did not show up in protest over unpaid salaries.\n\nKwekwe United is facing possible relegation as they are sitting bottom of the log with only 8 points from 18 games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02171854/Phil-Makekera-e1751473150113.webp",
            "description": "<p>By Sports reporter Kwekwe United club president Phil Makekera has dismissed claims that he has stepped down and is selling the cash-strapped Castle Lager Premier Soccer League franchise. Makekera said the rumour is simply a ploy to push him out of the club. “I will not just walk away from my project unless someone buys me out. “I</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-ploy-to-push-me-out-kwekwe-united-president-dismisses-claims-he-has-stepped-down/\">A ploy to push me out – Kwekwe United president dismisses claims he has stepped down</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "02 Jul 2025"
        },
        {
            "title": "JSC cancels Chitepo Ideology workshop for judges after uproar from lawyers, activists",
            "url": "https://www.newzimbabwe.com/jsc-cancels-chitepo-ideology-workshop-for-judges-after-uproar-from-lawyers-activists/",
            "content": "By Staff Reporter\n\nThe Judicial Service Commission (JSC) has suspended a planned training programme for judges led by Zanu PFs Herbert Chitepo School of Ideology following strong backlash from lawyers and civil society groups, who criticised the move as an attempt to indoctrinate the judiciary.\n\nThe training was being organised by the Presidency and was to feature the principal of Zanu PFs Herbert Chitepo School of Ideology, Ishmael Mada, the CIO director, Fulton Mangwanya, and President Mnangagwas chief secretary, Martin Rushwaya.\n\nIn a memorandum dated 2 July 2025 from the Judiciary Service Commission, Chief Secretary Walter Chikwana announced that the training seminar has been cancelled to allow for the development of content that will ensure the judiciary maintains its independence.\n\nFollowing the initial consultations and continued discussions with OPC on the implementation framework, I wish to inform you that a decision has been taken to cancel the IRBM training with the view of coming up with a programme content administered by the judiciary and suitable to the requirement for Judicial Independence, Chikwana stated.\n\nEarlier, in a statement, the Zimbabwe Catholic Lawyers Guild described the compulsory training of judges on the Chitepo School of Ideology as stripping away the last remaining integrity of the judiciary, after years of it being perceived as a captured institution.\n\nSubjecting judges who must at all times be independent and be seen to be independent to an ideology of one party to the exclusion of others not only compromises the judiciary but attacks its independence and impartiality.\n\nWe note that this is all happening at a time when public confidence in the judiciary is low, given the widely held public perception that the Judiciary is captured by the Executive.\n\nRenowned lawyer Thabani Mpofu has been rallying fellow lawyers and activists to stage a demonstration at the High Court of Zimbabwe tomorrow in protest against the compulsory training of judges.\n\nMpofu on Tuesday posted on his X account, mobilising lawyers and other officers of the court to protest against the erosion of judicial independence, stating that even if Chitepo were alive, he would not have approved the training programme named after him.\n\nAs legal professionals, we must uphold the integrity of the judiciary and ensure its independence. Any attempt to impose partisan ideology on judges through training programmes conducted by the Herbert Chitepo School of Ideology would undermine the rule of law and erode public trust.\n\nI mean, not even Chitepo himself would abase himself to the point of receiving training from this school named after him. We stand in defence of judicial independence, honouring the legacy of those who fought for justice and fairness. In Chitepos name; lets collectively rage against this unnecessary attack on judicial independence, Mpofu said.\n\nThe Chitepo School of Ideology has stirred controversy in the country; last year, there was uproar over Local Government Minister Daniel Garwes invitation to all councillors, including those from the opposition, to attend the workshop in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/04/05165803/Zimbabwe-judges-wigs.jpg",
            "description": "<p>By Staff Reporter The Judicial Service Commission (JSC) has suspended a planned training programme for judges led by Zanu PF’s Herbert Chitepo School of Ideology following strong backlash from lawyers and civil society groups, who criticised the move as an attempt to indoctrinate the judiciary. The training was being organised by the Presidency and was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jsc-cancels-chitepo-ideology-workshop-for-judges-after-uproar-from-lawyers-activists/\">JSC cancels Chitepo Ideology workshop for judges after uproar from lawyers, activists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "02 Jul 2025"
        },
        {
            "title": "Catholic lawyers say judges ‘indoctrination’ discredits Chitepo’s legacy",
            "url": "https://www.newzimbabwe.com/catholic-lawyers-say-judges-indoctrination-discredits-chitepos-legacy/",
            "content": "By Alois Vinga\n\nCATHOLIC Lawyers Guild in Zimbabwe (CLGZ) has slammed the impending order for judges to sit for training exercises by Zanu PF through its Herbert Chitepo School of Ideology, arguing that such plans violate the late national heros legacy.\n\nThe backlash follows a leaked communiqu which revealed that all judges were scheduled to participate in an induction led by the Zanu PF-affiliated institution at the Harare International Conference Centre (HICC) from the 4thto the 5thof July.\n\nThe lawyers group questioned the rationale behind organising such an exercise in the first place, arguing that it even violates the legacy of Herbert Chitepo, whom the institution is named after.\n\nForcing judges to sit through the Chitepo School of Ideology is contrary to what the late national liberation hero fought for. At the African Conference on the Rule of Law in 1961, the late national hero said that;\n\nThe legal profession consists of judges, practitioners and teachers of the law. It is to these persons that the protection and defense of the Rule of Law is entrusted. All must be as far as possible from both executive and social pressures,CLZG said.\n\nThe frustrated barristers collectively condemned the politicisation of judges training and called on all arms of the government to respect the principle of separation of powers and the rule of law, which are embedded in the supreme law of the country.\n\nThey maintained that subjecting Judges to the indoctrination exercise directly contravenes Section 164 of the Constitution, which bars any vested interests from interfering with the judiciary.\n\nSubjecting Judges who must at all times be independent and seen to be independent to an ideology of one party to the exclusion of others not only compromises the judiciary but attacks its independence and impartiality.\n\nWe note that this is all happening at a time when the public confidence in the judiciary is low, given the widely held public perception that the judiciary is captured by the Executive, added CLZG|.\n\nMeanwhile, authorities wereforced to fold their tails and cancel the training program after incessantcriticism of the exercise.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02165458/herbert-chitepo.jpg",
            "description": "<p>By Alois Vinga CATHOLIC Lawyers Guild in Zimbabwe (CLGZ) has slammed the impending order for judges to sit for training exercises by Zanu PF through its Herbert Chitepo School of Ideology, arguing that such plans violate the late national hero’s legacy. The backlash follows a leaked communiqué which revealed that all judges were scheduled to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/catholic-lawyers-say-judges-indoctrination-discredits-chitepos-legacy/\">Catholic lawyers say judges ‘indoctrination’ discredits Chitepo’s legacy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "02 Jul 2025"
        },
        {
            "title": "Zimbabwe Independent editor Zaba remanded in custody",
            "url": "https://www.newzimbabwe.com/zimbabwe-independent-editor-zaba-remanded-in-custody/",
            "content": "By Mary Taruvinga\n\nPrivately owned weekly newspaper Zimbabwe Independent editor Faith Zaba has been remanded in custody to this Thursday for her bail hearing.\n\nShe briefly appeared before Harare magistrate Vakayi Chikwekwe, facing charges of undermining the authority of the President.\n\nBail application could not be heard after the State asked for time to verify her medical background.\n\nOn the issue of bail. We request that bail hearing be heard on July 3 at 11.15 am.\n\nThis has been necessitated by the presentation of certain documents which contain the medical history for the accused, which we need to verify before we make our submissions on the application for bail. So we request for the matter to be rolled over to July 3 for bail inquiry, said prosecutor Takudzwa Jambawu.\n\nZabas lawyer, Chris Mhike, said, We are naturally disappointed that the accused must spend another night in custody at a time she is not feeling well.\n\nShe had been on bed rest at the time of her arrest on the orders of her medical doctor. A prison is not the best of places for people who are unwell but your worship you must place on record that the State has not dismissed our submissions on the state of health of the accused.\n\nWe so believe that the request by the State is in the best interests of the accused person.\n\nIt is our hope that such an allowance would enable the state to attend to all the necessary administrative processes.\n\nWe only seek the prosecutions assurance that there will be no further delay on tomorrows proceedings and that the accused will be allowed to receive medical attention while in detention, Mhike said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02115828/ZABA-FAITH.png",
            "description": "<p>By Mary Taruvinga Privately owned weekly newspaper Zimbabwe Independent editor Faith Zaba has been remanded in custody to this Thursday for her bail hearing. She briefly appeared before Harare magistrate Vakayi Chikwekwe, facing charges of undermining the authority of the President. Bail application could not be heard after the State asked for time to verify</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-independent-editor-zaba-remanded-in-custody/\">Zimbabwe Independent editor Zaba remanded in custody </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "02 Jul 2025"
        }
    ]
}