{
    "news": [
        {
            "title": "Mnangagwa being cheated into signing off deals by corrupt cronies around him – claims firebrand Geza",
            "url": "https://www.newzimbabwe.com/mnangagwa-being-cheated-into-signing-off-deals-by-corrupt-cronies-around-him-claims-firebrand-geza/",
            "content": "By Kingston Ndabatei\n\nPRESIDENT Emmerson Mnangagwa is now forgetful and being cheated into signing off multi-million dollar deals by corrupt individuals around him, firebrand war veteran Blessed Geza has claimed in his latest video.\n\nGeza, who is leading calls to have Mnangagwa removed from office before completion of his second term, made the claims just two days after successfully calling for national protests cum shutdown.\n\nHe claims to have engaged Members of Parliament (MPs) to ensure Mnangagwa is impeached for gross economic mismanagement, corruption and targeted stripping of state-owned entities that are being sold for a song to his cronies.\n\nWe are impeaching him so that he can rest. Mnangagwa is no longer mentally fit to lead the country, he is suffering from vascular dementia; we have got copies of his medical results, said Geza in the video shared Wednesday night.\n\nHis doctors have already told him; his family is aware and the looting mafia is also aware.\n\nUnfortunately, some members of his family and the looting mafia are taking advantage of his memory loss and forgetfulness and making him sign documents they are using in looting the country.\n\nBecause of his vascular dementia Mnangagwa is no longer aware of what is going on around him. It is so serious that on Thursday last week he even forgot who July Moyo was or what ministry he runs.\n\nHe even argues with his aides whether he is at home or the office, at work.\n\nMnangagwa, who was handed the presidential seat post a November 2017 coup that toppled his long-time ally Robert Mugabe, is currently engaged in a long-running factional fight with his deputy Constantino Chiwenga, the man who led Zimbabwes army to seize power for him.\n\nChiwenga is eyeing the countrys presidency with alleged backing of the same army he used to prop up Mnangagwa.\n\nThe former army general is said to be targeting criminals around the presidency, a statement also used to justify Mugabes ouster.\n\nThese criminals, according to Geza, are now taking advantage of Mnangagwas mental state and using him to sign off deals and tenders in their favour\n\nAdded Geza: Vultures are circling around him, they are looting in his name, they are selling state-owned companies in his name, they are even firing and hiring state employees in his name.\n\nDubious characters you did not elect are now exercising presidential powers.\n\nThey follow him to his farm to give out tenders in his name, they take away your farms in his name and even appoint and disappoint army generals on his behalf.\n\nIt is a free-for-all for criminals around him. This has to stop.\n\nThey are now using him to sign anything that they come up with and they have actually devised a way of looting through his weaknesses.\n\nSection 97(1)(d) provides for removal of the President on the grounds that he is no longer able to perform duties as a result of his mental state.\n\nThis is the section cited by Geza in his latest call for impeachment.\n\nThe Senate and National Assembly, by a joint resolution passed by at least one half of their total membership, may resolve that the question whether or not the president or a Vice President should be removed from office for inability to perform the functions of the office because of physical or mental incapacity, should be investigated in terms of this section, reads Section 97(1)(d).\n\nGeza wants Chiwenga to take over. He has insinuated that Chiwenga will be the right tonic to Zimbabwes increasing cases of grand corruption.\n\nChiwenga has yet to comment on any of the issues raised.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Kingston Ndabatei PRESIDENT Emmerson Mnangagwa is now forgetful and being cheated into signing off multi-million dollar deals by corrupt individuals around him, firebrand war veteran Blessed Geza has claimed in his latest video. Geza, who is leading calls to have Mnangagwa removed from office before completion of his second term, made the claims just</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-being-cheated-into-signing-off-deals-by-corrupt-cronies-around-him-claims-firebrand-geza/\">Mnangagwa being cheated into signing off deals by corrupt cronies around him – claims firebrand Geza</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Peter Ndoro bags new SABC show",
            "url": "https://www.newzimbabwe.com/peter-ndoro-bags-new-sabc-show/",
            "content": "TshisaLive\n\nSeasoned news anchor Peter Ndoro is to host a new show that takes an insight on Africa.\n\nPeter will host the show with Asanda Beda Africa Rising(6am to 9am) on SABC Channel Africa.\n\nIn 2018 Ndoro took a break from presenting the evening news.He told managementhe was fatigued and theyagreed on an indefinite break. Thisafter an error during a Thursdayevening newscast in which he announced the death of newly elected President Cyril Ramaphosa, instead of Zimbabwean opposition leader Morgan Tsvangirai.\n\nThis week, the SABC confirmed the presenter has landed a new show. The SABCs Lydia Mtshali said: Peter Ndoro has been at Channel Africa for more than a year. His show isRise and Shinewith co-host Asanda Beda.\n\nThe show is about news and current affairs in Africa and the world. It touches on breaking news, up to date news and empowering stories.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/03060709/peter-ndoro.jpg",
            "description": "<p>TshisaLive Seasoned news anchor Peter Ndoro is to host a new show that takes an insight on Africa. Peter will host the show with Asanda Beda — Africa Rising (6am to 9am) on SABC Channel Africa. In 2018 Ndoro took a break from presenting the evening news. He told management he was fatigued and they agreed on an indefinite break.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/peter-ndoro-bags-new-sabc-show/\">Peter Ndoro bags new SABC show</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Magesi FC in-demand goalkeeper Chipezeze to stay put",
            "url": "https://www.newzimbabwe.com/magesi-fc-in-demand-goalkeeper-chipezeze-to-stay-put/",
            "content": "The Citizen\n\nDespite turning 35 earlier this month, the Zimbabwean shot stopper is believed to have attracted interest from a number of Betway Premiership teams around the country, including one in Gauteng.\n\nChipezeze has once again re-established himself as top goalkeeper in top flight football with Magesi after spending some time in the lower league. He led the unfancied Limpopo club to the Carling Knockout title in their maiden season in the Premiership.\n\nHaving first made his name at Baroka FC between 2018 and 2022, Chipezeze is back to his best. He has kept 11 clean sheets in 22 league matches for Dikwena tsa Meetse who are slowly moving away from the relegation zone after the 1-0 win over Stellenbosch FC last Sunday.\n\nElvis wants to be loyal to Magesi FC who gave him a chance when no one else wanted him. I know a few clubs have inquired about him for next season but I dont see him leaving, said a source close to the club.\n\nI think clubs are surprised as to how good he still is and you know goalkeepers can play until late in their 30s. Elvis will stay at Magesi even though hes aware that other clubs would like to have him on their books.\n\nThe one interest that is serious was from a team in Gauteng which I dont want to mention just in case Magesi are open to the idea of letting him go. Having said that, I dont see the move happening because he also wants to win his place back in the national team of Zimbabwe and play at the Africa Cup of Nations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/03060421/chipezeze.webp",
            "description": "<p>The Citizen Magesi FC veteran goalkeeper Elvis Chipezeze is staying put, despite interest from other clubs in the Betway Premiership. Despite turning 35 earlier this month, the Zimbabwean shot stopper is believed to have attracted interest from a number of Betway Premiership teams around the country, including one in Gauteng. Chipezeze has once again re-established</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magesi-fc-in-demand-goalkeeper-chipezeze-to-stay-put/\">Magesi FC in-demand goalkeeper Chipezeze to stay put</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "R40,000 fine for Zim man who tried to smuggle cigarettes without declaring",
            "url": "https://www.newzimbabwe.com/r40000-fine-for-zim-man-who-tried-to-smuggle-cigarettes-without-declaring/",
            "content": "TimesLive\n\nThe Lehurutshe regional court in the North West has sentenced Joseph Kusekwa to 48 months imprisonment or a fine of R40,000 after finding him guilty of failing to declare goods upon entering South Africa.\n\nAdditionally, Kusekwa, 43, from Zimbabwe, received a wholly suspended sentence of 24 months or a fine of R20,000, suspended for five years, on condition that he is not convicted of contravening the provisions of the Customs and Excise Act during the suspension period.\n\nThe conviction stems from an incident on July 21 2023, when a truck with two trailers was stopped and searched at the Skilpadshek port of entry, National Prosecuting Authority spokesperson Sivenathu Gunya said.\n\nKusekwa granted permission for the search, which led to the discovery of 1,119 master cases of Derby cigarettes concealed in the truck.\n\nKusekwa was unable to provide documentation for the cigarettes. A Sars customs officer called to the scene confirmed that while the cigarettes complied with the Tobacco Product Control Act regulations, they were not declared in terms of the Customs and Excise Act.\n\nKusekwa was arrested and both the truck and cigarettes were seized by customs officials.\n\nThe court heard that had the cigarettes been legally imported, the payable duties would have amounted to R29m. However, Sars suffered no direct financial loss since the goods were intercepted before reaching the illicit local market.\n\nIn court, Kusekwa pleaded guilty in terms of a plea and sentencing agreement.\n\nDuring sentencing, state advocate Cain Nontenjwa emphasised that illicit trade in goods results in significant tax losses and negatively affects the legal cigarette market.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/03055234/cigarettes.jpg",
            "description": "<p>TimesLive The Lehurutshe regional court in the North West has sentenced Joseph Kusekwa to 48 months’ imprisonment or a fine of R40,000 after finding him guilty of failing to declare goods upon entering South Africa. Additionally, Kusekwa, 43, from Zimbabwe, received a wholly suspended sentence of 24 months or a fine of R20,000, suspended for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/r40000-fine-for-zim-man-who-tried-to-smuggle-cigarettes-without-declaring/\">R40,000 fine for Zim man who tried to smuggle cigarettes without declaring</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Trump unveils new global tariffs, Zimbabwe faces 18% reciprocal tax",
            "url": "https://www.newzimbabwe.com/trump-unveils-new-global-tariffs-zimbabwe-faces-18-reciprocal-tax/",
            "content": "NDTV\n\nUS President Donald Trump on Wednesday acted on his campaign promises to build that wall and announced a raft of tariffs targeting countries around the world, including some of Americas closest trading partners, in a move that risks sparking a ruinous trade war.\n\nSpeaking in the White House Rose Garden, the American commander-in-chief set out plans for most stinging import taxes, ranging from 10 per cent to more than 49 per cent on what he called Liberation Day.\n\nFor decades, our country has been looted, pillaged, raped and plundered by nations near and far, both friend and foe alike, Trump said.\n\nThe President reserved some of the heaviest blows for what he called the nations that treat us badly, including 34 percent on goods from superpower rival China, 26 per cent on India, 24 percent on Japan and 20 percent on key ally the European Union.\n\nBut the 78-year-old Republican  who held up a chart with a list of levies  said that he was very kind and so was only imposing half the amount that those countries taxed US exports.\n\nFor the rest, Trump said he would impose a baseline tariff of 10 percent, including Britain.\n\nThis is Liberation Day, Trump said, adding that it would forever be remembered as the day American industry was reborn, the day Americas destiny was reclaimed.\n\nSweeping auto tariffs of 25 percent that Trump announced last week are also due to take effect at 12:01 am Thursday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/26074320/donald_trump.jpg",
            "description": "<p>NDTV US President Donald Trump on Wednesday acted on his campaign promises to “build that wall” and announced a raft of tariffs targeting countries around the world, including some of America’s closest trading partners, in a move that risks sparking a ruinous trade war. Speaking in the White House Rose Garden, the American commander-in-chief set</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-unveils-new-global-tariffs-zimbabwe-faces-18-reciprocal-tax/\">Trump unveils new global tariffs, Zimbabwe faces 18% reciprocal tax</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zimbabwe’s economy crashed – so how do citizens still cling to myths of urban and economic success?",
            "url": "https://www.newzimbabwe.com/zimbabwes-economy-crashed-so-how-do-citizens-still-cling-to-myths-of-urban-and-economic-success/",
            "content": "The Conversation\n\nIt is common for nations to have myths, or narratives, that form the basis of theirnationalism, or their ideas of themselves as a political community. Such popular narratives are often rooted in a romanticised or idealised view of the past. This is certainly the case in Zimbabwe, where national myths about its urban modernity and economic exceptionalism have stood the test of time in contrast with the reality.\n\nThe idea of urban modernity has its roots in colonial times. At the time of independence in 1980, following a liberation warfrom 1965 to 1979, Zimbabwes economy was looking strong. Urban residents, especially, could think of themselves as modern: they had middle- and working-class lifestyles, social protection, social mobility opportunities and fixed working hours. Urban modernity meant order, steady employment, education.\n\nZimbabwes economy was exceptional in sub-Saharan Africa:diversified and robust.\n\nHowever, rapid socio-economic changes followed in the 1990s and 2000s. Zimbabwe was hit by a series ofeconomic, financial and political crises. This led to the collapse of urban middle- and working-class modernity and the rise of visibleinformal economic activitiesin the urban space. By 2004,over 80% of peoplehad informal livelihoods in Zimbabwe.\n\nMyPhD thesis(2021) examined Harares shift to informality and the impact of this on peoples everyday experiences of citizenship. The respondents in interviews carried out between 2016 and 2018 included vendors, cross-border traders, manufacturers, residents associations, informal sector organisations, local authorities and urban planners.\n\nThese interviews also form the basis of my recentresearch paper. My analysis sought to examine how people deal with the fact that current circumstances dont support their myths of urban nationalism.\n\nTell us here\n\nDuring a crisis, people rethink old ideas and adjust them to fit their new situation. As they do this, their notions of urban modernity and economic exceptionalism change. At the same time, they remember a past when their country was economically successful. This memory shapes how they think about the countrys future  and it also makes them question the government, which hasnt lived up to those past ideals.\n\nSo, what do the myths of urban modernity and economic exceptionalism mean in Zimbabwe today? Some people cling to the early postcolonial notions nurtured by the government. Others reluctantly accept economic informality while seeking to upgrade the idea of the informal sector. But there are others who challenge altogether the view that street vending is not modern and formal enough.\n\nThe prevalent informality was seen as a temporary phenomenon which would end soon. Then the country would return to having a modern urban lifestyle and strong economy.\n\nTo many of the respondents in 2016-2018, working and having a job meant being employed and having regular wages, job security and social protection.\n\nAt the same time, people also reluctantly accepted economic informality and some of the changes it made to their lives, while seeking to upgrade the idea of the informal sector. Some informal sector associations, for example, attempted to teach their members to see their activities as businesses and themselves as business people, as I reported in anotherpaper.\n\nRead more:How informal sector organisations in Zimbabwe shape notions of citizenship\n\nSome respondents drew a line between economic activities that were acceptable in the city centre and those that were not. These were similar to the early postcolonial notions enforced by the government. They suggested, for example, that street vending had no place in the city centre. It should only occur in limited designated spaces, and in residential areas.\n\nSome street vendors, though, defied the notion of street vending not being modern and formal enough. They dressed smartly to emphasise that street vending could also be done in a modern way and be a part of the mainstream economy.\n\nAt the beginning of colonial rule in the late 19th and early 20th centuries, the colonisers planned for thecitiestoremain white. Unless Africans lived in their employers facilities, they were required to live indedicated areas.\n\nAt the same time, the colonial administration introduced and enforced the concept of order in Salisbury, now Harare, the capital. It punishedpoor, marginalised and homeless people. The same with economic and social activities it deemed undesirable.\n\nToday,over 32%of Zimbabweans live in urban areas.\n\nThe establishment in the 1930s of theAfrican middle classwas an important part of the urban modernity project. Those who sought to belong to it largely used education as their primary social mobility tool.\n\nRead more:Education in Zimbabwe has lost its value: study asks young people how they feel about that\n\nAfterindependencein 1980, the cities werederacialised. Everyone was free to enter and use the urban space. But the new government stillheld tight controland dictated who had the right to the city.\n\nNumerous operationswere conducted from the 1980s to clear the street of undesirable people and activities.For example, informal settlements were removed. Manywomenwere arrested on the pretext of clearing the city of prostitution. The most notorious clean-up operation was the2005 Operation Murambatsvina. It effectively punished all those considered unproductive and not deserving to be in the city.\n\nRead more:Dogs in the city: on the scent of Zimbabwes urban history\n\nThose high and, frankly, brutal standards of urban modernity have a long history in Zimbabwe and became a part of its urban nationalism.\n\nColonial and early postcolonial Zimbabwe had an exceptional anddiversifiedeconomy with strong mining, agricultural, and industrial sectors. Zimbabwes manufacturing sector contributed25% to GDP by 1974.\n\nDespite the economic decline, it is still a common narrative that Zimbabwes industrial sector wassecond onlyto South Africas in sub-Saharan Africa and that Zimbabwe was the breadbasket ofAfrica.\n\nHowever,manufacturing in colonial Zimbabwebenefited a small number of white industrialists. Black Zimbabweans did not have theopportunities. Theycould not own profitable manufacturing businesses or access finance.\n\nAfter independence, the government madeconsiderable effortsto deracialise the economy and public services.\n\nThe early postcolonial ideas about urban modernity and economic exceptionalism were severely undermined in Zimbabwe. But people try to give new meanings to these ideas in the changed social and economic circumstances. There is ongoing reluctance to accept that informality altered Zimbabwe for good. And many of my respondents wanted to find ways that the myths of modernity and economic exceptionalism could keep their meaning in the changed circumstances.\n\nContinuity and change in the myths of urban nationalism also raise the questions of legitimacy. In this case, it is about legitimacy of informal economic practices and legitimacy of the government that did not uphold the myths.\n\nIdeas can be very powerful in explaining peoples understanding of the political community they belong to. And when such ideals cannot be upheld, people will find new meanings in their material reality that let them hold on to old ideas or reinterpret them.\n\nLeverhulme Early Career Research Fellow, University of Edinburgh\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/28044227/food-vendor.jpeg",
            "description": "<p>The Conversation It is common for nations to have myths, or narratives, that form the basis of their nationalism, or their ideas of themselves as a political community. Such popular narratives are often rooted in a romanticised or idealised view of the past. This is certainly the case in Zimbabwe, where national myths about its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-economy-crashed-so-how-do-citizens-still-cling-to-myths-of-urban-and-economic-success/\">Zimbabwe’s economy crashed – so how do citizens still cling to myths of urban and economic success?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Still no compensation for victims of George building collapse",
            "url": "https://www.newzimbabwe.com/still-no-compensation-for-victims-of-george-building-collapse/",
            "content": "GroundUp\n\nConstruction workers who survived thecollapse of a five-storey apartment blockunder construction in George almost a year ago, are yet to receive compensation from the Department of Labour.\n\nThey, along with the families of the workers who died, are entitled to compensation under the Compensation for Occupational Injuries and Diseases Act (COIDA).\n\nThe five-storey apartment block collapsed on 6 May 2024, killing 34 workers, at least 26 of whom were immigrants, and leaving most of the 28 survivors injured, some with permanent disabilities.\n\nA criminal case is being investigated by the police, and the Department of Human Settlements has said that a preliminary report by the National Home Builders Registration Council (NHBRC) suggests several procedures were not followed and laws not adhered to.\n\nIn terms of COIDA, the Compensation Fund is supposed to cover medical expenses and provide regular payouts to people who have been disabled, or to the family members of those who died. For permanently disabled people this can be a pension for life. The Compensation Fund is not confined to South African citizens; it covers immigrants who have been working in South Africa for more than a year.\n\nWith the help of local volunteers, at least 11 of the George building survivors have lodged claims with the Compensation Fund. The Fund has paid the medical expenses of some of them, but none of the survivors, or families of the deceased, have received any compensation payment.\n\nSome workers have been left with permanent disabilities.Mozambican Ivaldo Macomolost a leg and will likely never be able to work as a bricklayer again. His friend, Virgilio Sitoe, also from Mozambique, had nerve damage to both feet and was unable to work for several months. Although his medical treatment has ended, he is still in pain and struggles to work.\n\nAccording to COIDA, Macomo is entitled to receive a lifelong pension, and Sitoe should be compensated for the period he was unable to work.\n\nIvaldo Macamo lost his leg when a building under construction collapsed in George in May 2024. Archive photo: Daniel Steyn.\n\nMacomo, who lives in Thembalethu township in George, said his doctor told him his claim had been approved, but he has yet to receive any payment. Sitoe, who also lives in Thembalethu, said when he last visited the Department of Labour he was told he looks fine and his compensation claim will not succeed.\n\nShadrack Maine, from Lesotho, lost his right arm and right leg. He has also not yet received any funds.\n\nElelwani Mawela, from Zimbabwe, had her face crushed in the incident, but had to submit a Promotion of Access to Information Application (PAIA) to the Western Cape Premiers office in order to get her medical records from Groote Schuur Hospital where she had several weeks of reconstruction surgery.\n\nObtaining her medical records cost Mawela hundreds of rands in administration fees and printing costs, but when she took these documents to the Department of Labour, she was told she needed to obtain more documents.\n\nThe spouses and children of those who died are also entitled to a pension but It has been an equally difficult battle for the families. Child Kayuni is the husband of Tiwonge Muhango, who was employed as a cleaner at the site and was killed in the building collapse. Kayuni, who has a valid passport and work permit, has still not received any compensation for his wifes death at her workplace.\n\nPublic interest lawyer at Richard Spoor Inc. George Kahn says the challenges the building collapse victims face in getting their compensation are very typical. He says people often give up, even though they have valid claims.\n\nKahn says that labour department officials are usually incompetent with respect to correctly interpreting and timeously implementing the COIDA and that the systems and infrastructure are defective. Employees often have to submit the same documents again and again because officials lose the documents, he says.\n\nKhan saysone of hisclients waited 20 years before getting his compensation.\n\nMany of the immigrants working on the site were not properly documented. Khan says COIDA should cover all workers regardless of immigration status, but that is not always the reality on the ground. Workers who are not registered with the Compensation Fund should also be able to claim, but claims are often rejected in these cases, and this has to be challenged in appeal, says Kahn.\n\nGroundUp hasreportedthat the Compensation Fund has had 12 years of adverse audit opinions, along with findings of fraud. The disarray means medical expense claims take months to be paid out, some legitimate claims are never paid, and sometimes claims are paid twice by accident.\n\nIn response to detailed questions from GroundUp, the Department of Labour stated: The departments processes are still unfolding therefore no comment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/07063903/george.jpeg",
            "description": "<p>GroundUp The collapse of a building under construction in George killed 34 people and left 28 survivors almost a year ago. The survivors and family members of the deceased are entitled to payouts from the Compensation Fund, but have not received anything. A labour lawyer says this experience is “typical” for people trying to claim</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/still-no-compensation-for-victims-of-george-building-collapse/\">Still no compensation for victims of George building collapse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Tongaat Hulett’s business rescue: New investors secure credit approval",
            "url": "https://www.newzimbabwe.com/tongaat-huletts-business-rescue-new-investors-secure-credit-approval/",
            "content": "IOL\n\nTongaat Huletts (THL) business rescue has reached a pivotal point after the sugar and property groups new investors, The Vision Parties confirmed to the Business Rescue Practitioners (BRPs) that they have secured credit approval to meet the balance of their payment obligations owed to lenders.\n\nThis means that the Vision Parties headed by businessman Robert Gumede, will be able to complete their acquisition of the claims held by the consortium of lenders, which comprise mainly South African banks and which had provided funding to the group prior to it entering business rescue.\n\nThe due date of the payment to the lenders had been March 31, 2025, but the Vision Parties had informed the BRPs that they had requested, and obtained, the Lender Groups consent to extend the date for payment of the balance of the final purchase consideration to the end of this month.\n\nThis extension is required to enable the necessary agreements that will govern the credit approval to be drafted and executed, a statement from THL said.\n\nVisions outstanding payment obligation to the Lender Group will be discharged through the aforementioned credit facility, THL said Wednesday. Previous reports show that when THL entered business rescue in October 2022, the Lender Group was owed about R6.9 billion.\n\nThe credit approval that has been obtained by the Vision Parties further demonstrates the veracity of both the Lender Group and Vision Parties prior assertions, that the Vision Parties were able to fulfil all of their payment obligations to the Lender Group in terms of the Vision Business Rescue Plan, the statement said.\n\nThis marks a pivotal milestone in the successful implementation of the Plan and again fortifies the BRPs belief that the Plan remains capable of implementation, the group said.\n\nTHL said they and the BRPs recognise this journey has been arduous for all involved, and that the rescue of THL had, in part, been complicated by a number of ill-founded court proceedings brought by minor creditors who have sought to stifle the successful implementation of the plan.\n\nSince the approval of the Plan, all of the applications that have been argued in the High Court have been dismissed with costs being awarded in THL and the BRPs favour, THL said. Successful implementation of the Plan would represent a new chapter for the business, which has an extensive economic footprint in KwaZulu-Natal, Zimbabwe, Mozambique, and Botswana.\n\nTHLs continued survival is critical for the regional and national economies given that in KwaZulu-Natal alone the business employs 2 600 people, supports 25 500 jobs in surrounding rural communities, and sources sugar from 15 000 small-scale growers.\n\nTHL said last month it was prepared for the upcoming 2025/26 sugar season, with all operations set to open and run smoothly as scheduled this month and early May.\n\nOff-season maintenance and investment to the value of R460 million was undertaken over the past few months across the companys Maidstone, Amatikulu, and Felixton mills along with its central refinery in Durban and the Voermol animal feeds facility.\n\nAs a result, the company would be ready to welcome sugar cane deliveries from growers, ensuring a strong start to the season, the group said.\n\nIndustrial Development Corporation (IDC) post-commencement financing had helped to ensure that off-crop maintenance on the mills and refinery could continue over the past three financial years. This saw THL allocating a total of R1.43bn to strengthen its infrastructure, ensuring reliability and efficiency in production.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/29151203/Tongaat-Hulett.jpeg",
            "description": "<p>IOL Tongaat Hulett’s (THL) business rescue has reached a pivotal point after the sugar and property group’s new investors, The Vision Parties confirmed to the Business Rescue Practitioners (BRPs) that they have secured credit approval to meet the balance of their payment obligations owed to lenders. This means that the Vision Parties headed by businessman</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tongaat-huletts-business-rescue-new-investors-secure-credit-approval/\">Tongaat Hulett’s business rescue: New investors secure credit approval</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "South Africa seeks US talks as carmakers face 25% tariff hit",
            "url": "https://www.newzimbabwe.com/south-africa-seeks-us-talks-as-carmakers-face-25-tariff-hit/",
            "content": "Bloomberg\n\nSouth Africas trade ministry will seek talks with the US as its auto industry braces for a hit from Washingtons new tariffs this week, saying the duties could hurt local manufacturers and the economy.\n\nWashington will impose a 25% levy on imports of automobiles and some parts to address what it perceived to be a threat to its national security starting April 3.\n\nSouth African vehicles currently enjoy duty-free access to the worlds biggest economy because of a preferential trade pact, but the new taxes will override that, which could have a potential negative effect on the South African economy, the Department of Trade, Industry and Competition said in a statement Tuesday.\n\nUS President Donald Trumps latest wave of duties expand his trade war and come as relations between Pretoria and Washington have soured, stoking fear over the fate of trade arrangements such as the African Growth and Opportunity Act, through which thousands of South African goods enter the US duty-free.\n\nAuto exports from Africas most industrialised economy accounted for 64% of the nations shipments to the US under AGOA, with the DTIC estimating shipments of cars and parts at $2.4 billion last year. The nations car industry accounts for more than 5% of gross domestic product and employs more than 116,000 people.\n\nConversely, South Africas exports of automobiles account for only 0.99% of total US vehicle imports and 0.27% for auto parts and thus do not constitute a threat to US industry, the department said.\n\nThe DTICs statement sheds light on on whether the new US duties would apply to South African shipments under AGOA. The department said it expects they will because similar determinations on steel and aluminum nullified preferences bestowed by the act. Washington is using section 232 of the Trade Expansion Act of 1962 to institute the taxes on national-security grounds.\n\nSouth Africas Automotive Business Council  also known as Naamsa and whose members include Volkswagen AG and Toyota Motor Corp.  is in talks with the DTIC and the Department of International Relations and Cooperation to lobby for exemption from Washingtons executive action, ABC Chief Economist Paulina Mamogobo said.\n\nSouth Africa is preparing to pitch a bilateral trade agreement to the US in case the nations preferential access to the country is revoked. President Cyril Ramaphosas government considers a bilateral accord better than preferential treatment because it would be a negotiated deal, and it would prefer to transition away from AGOA.\n\nPretoria wants to reset US relations that have deteriorated since Trumps return to the White House. He has frozen aid to the country amid false claims of land seizure at the expense of White farmers. South Africa hasnt confiscated any land since the end of apartheid in 1994.\n\nWashington has also taken Pretoria to task over its relations with Iran and its proxy Hamas, and for filing a case in the International Court of Justice in which it alleges that Israels actions in the Gaza Strip were an act of genocide.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/03051404/Screenshot-2025-04-03-at-06.02.47.png",
            "description": "<p>Bloomberg South Africa’s trade ministry will seek talks with the US as its auto industry braces for a hit from Washington’s new tariffs this week, saying the duties could hurt local manufacturers and the economy. Washington will impose a 25% levy on imports of automobiles and some parts to address what it perceived to be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-seeks-us-talks-as-carmakers-face-25-tariff-hit/\">South Africa seeks US talks as carmakers face 25% tariff hit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Wicknell Chivayo’s in-laws robber jailed 60 years",
            "url": "https://www.newzimbabwe.com/wicknell-chivayos-in-laws-robber-jailed-60-years/",
            "content": "By Staff Reporter\n\nBigboy Nampungo (27), who was part of an armed gang that robbed controversial businessman Wicknel Chivayos in-laws of US$74,000 has been jailed for 60 years by a Harare magistrate.\n\nNampungo was sentenced by magistrate Jesse Kufa after pleading guilty to the charges.\n\nHe was charged with six armed robbery counts and was given 10 years for each count.\n\nHe will, however, serve 30 years effectively as the sentencing for the counts will be running concurrently.\n\nNampungos suspected accomplices are Garikai Shangwa, Temptation Dinhidza, Arnold Tafirei, Tawanda Mushayatu and Mike Mhaka, Maramba Vhiya and Takudzwa Maisvoreva.\n\nThey are all denying the allegations and are currently at Harare remand prison awaiting finalisation of their case.\n\nProsecutor Shambidzeni Fungura said Nampugorobbed six people at the same house in Marondera.\n\nThe State, however, split each of the complainants ordeals into a charge, bringing the counts to six.\n\nThose who were robbed at Alpha and Omega farm are Zex Mutasha Rusike, Petros Mabhunu, Medic Zhakata, Tinotenda Shonhiwa, Gerald Muteke and Vimbai Muteke.\n\nIt is the States case that on March 18, 2025 at around 0100 hours, the accused persons and their accomplices who are still at large, hatched a plan to rob the complainants.\n\nIn pursuit of their plan, they proceeded to Alpha and Omega Farm in Marondera armed with three rifles, two pistols, two bolt cutters, machetes and iron bars.\n\nUpon their arrival, they confronted Mabunhu, the security guard, grabbed him and assaulted him with iron bars and booted feet all over the body, demanding to know the whereabouts of the other guards on duty, Mutsokoti said.\n\nThey tied his hands from behind and legs with cable ties. They marched him into the yard where they confronted Rusike who is employed at the farm as the internal security guard and they disarmed him of his CBC shotgun, force-marched him to the front guardroom.\n\nThey also confronted Zhakata who is a security guard, they struck him several times on the head with iron bars before they tied both his hands and legs with cable tiers, the State alleges.\n\nThe court heard that two of the security guards were left under the guard of two of the accused persons, armed with a pistol and an iron bar as the rest force-marched the other security guard to the main house.\n\nOn approaching the main entry, the accused allegedly cut the key on the burglar screen with a bolt cutter, forced open the main door and entered the house.\n\nThey allegedly went on to force open the kitchen door and force-marched the guard to Geralds bedroom where they met him in the passage and demanded cash.\n\nFearing for his life, he surrendered cash, US$18,000, a Sarsilmaz pistol loaded with eight rounds and two phones.\n\nThe accused persons then demanded to be shown the safe and on their way, they passed through Vimbais bedroom where they demanded cash and safe keys and she surrendered cash, US$1,100, a Chubb safe key and a Samsung Galaxy A35 without a SIM card.\n\nThey took her to the main bedroom where she opened the safe and surrendered cash US$55,000.\n\nWhilst the accused persons were still in the bedroom, Elphas Maruta, who was armed with a rifle loaded with four rounds, got information of the robbery and advanced towards the house and fired two shots towards the accused persons who also fired back three shots before they fled from the scene with the stolen property, Mutsokoti further told the court.\n\nAccording to the State, the stolen goods and properties amounted to US$74,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/25122450/chivayo-lulu.webp",
            "description": "<p>By Staff Reporter Bigboy Nampungo (27), who was part of an armed gang that robbed controversial businessman Wicknel Chivayo’s in-laws of US$74,000 has been jailed for 60 years by a Harare magistrate. Nampungo was sentenced by magistrate Jesse Kufa after pleading guilty to the charges. He was charged with six armed robbery counts and was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wicknell-chivayos-in-laws-robber-jailed-60-years/\">Wicknell Chivayo’s in-laws robber jailed 60 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Apr 2025"
        }
    ]
}