{
    "news": [
        {
            "title": "We had already planned to take over – says govt on health sector following Trump’s ‘unexpected’ orders",
            "url": "https://www.newzimbabwe.com/we-had-already-planned-to-take-over-says-govt-on-health-sector-following-trumps-unexpected-orders/",
            "content": "By Leopold Munhende\n\nSTRUGGLING to provide basics at public hospitals, the government has sensationally claimed it had already decided to takeover the health sector before American President Donald Trumps unexpected executive order.\n\nTrump, on January 20, ordered a 90-day freeze on all funding and a programme-by-programme review of all activities financed through USAID, Americas largest humanitarian organisation.\n\nWith it playing a central role in public health services provision in Zimbabwe and the rest of Africa, fears abound that gains realized in the fight against HIV/AIDS, TB and malaria would be reversed.\n\nWe had already planned to take over all health workers to be employed by the ministry because we were facing challenges of accountability, we did not even know the reporting structure of those employed by NGOs, said health minister Douglas Mombeshora.\n\nAlthough the suspension on funding health-related programmes was later reversed, medicines are yet to be delivered with current stocks lasting up to June, three months from now.\n\nSpeaking to journalists in Harare on Monday, Mombeshora said government had already planned for this and procured medicines that would cover the period after June to September.\n\nIn a heavily contradictory statement, Mombeshora said the challenge government was facing was that its procurement had been stopped before saying that it will be coming in phases and later, that they had called for tenders to also procure the same medicines as government waits for Trumps review of USAID.\n\nAdded Mombeshora: The challenges that I can say still remain,relate to procurement, we had medicines for HIV/AIDS, TB and Malaria which we had procured by they will be coming in phases.\n\nWe have enough stocks up to the end of June, but the stocks that were coming to cover the period after June have been stopped, and we cannot wait to see what happens after the 90 days which they said they were using to review.\n\nWe have actually floated a tender to do procurement of medicines that will cover from June to the end of September while we see how other resources can be covered.\n\nUSAID not only financed the procurement of medicines meant for treatment of HIV/AIDS, TB and malaria, it also ensured the provision of condoms and payment of nurses and doctors manning opportunistic clinics across the country.\n\nThose who are on HIV treatment will not have any disruption, no one should be scared, no one should be seen hoarding, he added.\n\nOver 19,000 village health workers, more than a thousand nurses and doctors were on USAIDs payroll according to Mombeshora.\n\nThe Zimbabwean and African health services situation, battered by little to no investment since the attainment of independence, has been worsened by a further flight of other humanitarian organisations in the wake of Trumps decision.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/08044936/mombeshora.webp",
            "description": "<p>By Leopold Munhende STRUGGLING to provide basics at public hospitals, the government has sensationally claimed it had already decided to ‘takeover’ the health sector before American President Donald Trump’s unexpected executive order. Trump, on January 20, ordered a 90-day freeze on all funding and a programme-by-programme review of all activities financed through USAID, America’s largest</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-had-already-planned-to-take-over-says-govt-on-health-sector-following-trumps-unexpected-orders/\">We had already planned to take over – says govt on health sector following Trump’s ‘unexpected’ orders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "‘Only 3,000 out of 16,000 kombis operating in Harare are registered’— say police amid clampdown on errant operators",
            "url": "https://www.newzimbabwe.com/only-3000-out-of-16000-kombis-operating-in-harare-are-registered-say-police-amid-clampdown-on-errant-operators/",
            "content": "By James Muonwa\n\nPOLICE have launched a major clampdown on unregistered commuter omnibuses amid a shocking revelation that less than 20 percent of them are compliant with the law.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi said the blitz on illegal public transporters is aimed at forcing operators to comply with the law and make clean money.\n\nIts sad, for Harare alone we have close to 16,000 kombis but only 2,500 or lets say 3,000 are registered, Nyathi said during a press conference in Harare this Wednesday.\n\nThe rest are playing hide-and-seek with the law. Yet the government has put in place regulatory mechanisms to assist people to get into business, but they dont want to. They want to take money and put it into the pocketno safety for Zimbabweans and no compliance.\n\nRoads need to be maintained, police officers need to be paid by the government, where is the money coming from? The next thing is, you say the government is not providing a service; what contribution have you made?\n\nSo, first and foremost, all kombis must be registered, and kombi operators must lead by example in their operations by being responsible Zimbabweans, said the ZRP spokesman.\n\nOn enforcement of the law, Nyathi said all police officers are under instructions to carry out their duties professionally in accordance with police standards.\n\nZRP will take action against any police officer who will try to endanger the lives of Zimbabweans, Nyathi added.\n\nIn some instances, police officers have been blamed for road traffic accidents as they smash windscreens and chase after fleeing commuter omnibuses.\n\nMotorists were urged to comply with police officers and avoid running away. Also, Nyathi warned members of the public who try to interfere with police officers on duty.\n\nWhen you are arrested, you are not being killed. Youre simply being taken in to ensure the law takes its course. Why do you want to run away? Comply with the law; if you have to go to court, go to court and if you have to pay a fine, pay the fine, and go back to your business, Nyathi cautioned.\n\nThe ZRP Commissioner Paul Nyathi has urged the public not to board unregistered kombis as they are not insured.pic.twitter.com/sIKV4cHbKq\n\n NewZimbabwe.com (@NewZimbabweCom)March 12, 2025\n\nThe clampdown on unregistered kombis will be implemented without fear or favour, he added.\n\nThere is no going back in enforcing the governments law, and we are unapologetic about that, he said.\n\nOn corruption, Nyathi said bribe-taking police officers will be arrested alongside the motorists paying them off.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10145359/Kombi.jpg",
            "description": "<p>By James Muonwa POLICE have launched a major clampdown on unregistered commuter omnibuses amid a shocking revelation that less than 20 percent of them are compliant with the law. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi said the blitz on illegal public transporters is aimed at forcing operators to comply with the law</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/only-3000-out-of-16000-kombis-operating-in-harare-are-registered-say-police-amid-clampdown-on-errant-operators/\">‘Only 3,000 out of 16,000 kombis operating in Harare are registered’— say police amid clampdown on errant operators </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "Only the interbank market sets the official rate – RBZ",
            "url": "https://www.newzimbabwe.com/only-the-interbank-market-sets-the-official-rate-rbz/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has said only the interbank market has the authority to determine the official rate, clearing the confusion around the interpretation of market-determined exchange rates.\n\nThis follows confusion triggered by some Business Member Organizations in the tourism sector which recently interpreted the Monetary Policy Statements mention of market-determined exchange rates as implying that markets are now free to set their own exchange rates, prompting traders to violate the stipulated exchange rates.\n\nBut in a statement, the RBZ governor, Dr John Mushayavanhu implored stakeholders and the public to take note of the fact that the country is operating under a floating Exchange Rate system where the exchange rate is determined in the interbank market for foreign exchange under the Willing Buyer Willing Seller arrangement.\n\nHe said this rate is purely determined through the authorized dealers (Banks) based on trades that would have been transacted through them.\n\nFor clarity, market determined rate simply means a rate determined on the interbank foreign exchange market by banks is the one that should be used to guide the pricing of all other goods and services in the economy. Therefore, no other business entity outside the interbank market should determine the exchange rate.\n\nThe February 2025 Monetary Policy Statement again provided clarity that the 5% trading margin communicated in previous Interbank Foreign Exchange Trading Guidelines was only applicable for the determination of the starting exchange rate at the introduction of ZWG, he said.\n\nMushayavanhu added that banks are free to on-sell foreign currency purchased from willing sellers (including the RBZ) at a margin consistent with international best practices.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171550/mushayavanhu-200-zig.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has said only the interbank market has the authority to determine the official rate, clearing the confusion around the interpretation of market-determined exchange rates. This follows confusion triggered by some Business Member Organizations in the tourism sector which recently interpreted the Monetary Policy Statement’s mention of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/only-the-interbank-market-sets-the-official-rate-rbz/\">Only the interbank market sets the official rate – RBZ</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "Hanke ranks Zimbabwe’s ZIG second worst in the world – says it lost 50% of value in a year",
            "url": "https://www.newzimbabwe.com/hanke-ranks-zimbabwes-zig-second-worst-in-the-world-says-it-lost-50-of-value-in-a-year/",
            "content": "By Staff Reporter\n\nINTERNATIONALLY acclaimed economist and currency expert Professor Steve Hanke has ranked Zimbabwes ZiG currency as the second worst in the world after Venezuelas Bolivar.\n\nAccording to Hankes latest analysis, the ZiG has lost 50% of its value against the US dollar over the last 10 months due to inflationary pressures.\n\nThe Bolivar lost 52% while the third-worst Iranian Rial and the fourth-ranked Ethiopian Birr lost 24%.\n\nIntroduced at a rate of US$1: ZiG2.50 last year, the currency has significantly lost value and now trades between ZiG33 and ZiG40 on the black market.\n\nA lack of trust in the gold-backed currency has been blamed for its loss in value.\n\nBecause of the informal nature of Zimbabwes economy, very few are adhering to a government directive for all businesses to use the official US$1: ZiG26 rate.\n\nHankes analysis comes at a time when the Reserve Bank of Zimbabwe (RBZ) recently said it was committed to ensuring the success of the ZiG, primarily its stability.\n\nIts instability has been blamed on the governments failure to direct its use in the purchase of goods such as fuel and payment of passport fees.\n\nThere are adequate use case scenarios for ZiG at the moment, said RBZ governor Dr. John Mushayavanhu at a meeting with the Tourism Business Council of Zimbabwe (TBCZ) recently.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Staff Reporter INTERNATIONALLY acclaimed economist and currency expert Professor Steve Hanke has ranked Zimbabwe’s ZiG currency as the second worst in the world after Venezuela’s Bolivar. According to Hanke’s latest analysis, the ZiG has lost 50% of its value against the US dollar over the last 10 months due to inflationary pressures. The Bolivar</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hanke-ranks-zimbabwes-zig-second-worst-in-the-world-says-it-lost-50-of-value-in-a-year/\">Hanke ranks Zimbabwe’s ZIG second worst in the world – says it lost 50% of value in a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "AFM pastor jailed for incest",
            "url": "https://www.newzimbabwe.com/afm-pastor-jailed-for-incest/",
            "content": "By Staff Reporter\n\nAN Apostolic Faith Mission in Zimbabwe (AFM) pastor who was having an incestuous relationship with his stepdaughter has been convicted.\n\nThe 34-year-old clergyman, whose identity was withheld, was sentenced to 30 months in prison.\n\nThe court heard that between 2022 and 2024, the man-of-the-cloth repeatedly had sexual intercourse at different locations with his stepdaughter, who is now 18 years old.\n\nThe illicit affair began in 2022 when the girls mother left her in the stepdads custody. They first became intimate in his bedroom while they were watching videos.\n\nThe relationship continued over the years, leading to a pregnancy in 2023, which he later arranged to be terminated.\n\nA tip-off led to investigations and his arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12181823/afm.jpg",
            "description": "<p>By Staff Reporter AN Apostolic Faith Mission in Zimbabwe (AFM) pastor who was having an incestuous relationship with his stepdaughter has been convicted. The 34-year-old clergyman, whose identity was withheld, was sentenced to 30 months in prison. The court heard that between 2022 and 2024, the man-of-the-cloth repeatedly had sexual intercourse at different locations with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afm-pastor-jailed-for-incest/\">AFM pastor jailed for incest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "Mutapa Fund targets parastatals in the ‘graveyard’",
            "url": "https://www.newzimbabwe.com/mutapa-fund-targets-parastatals-in-the-graveyard/",
            "content": "By Alois Vinga\n\nTHE Mutapa Investment Fund (MIF) has devoted efforts to turn around the fortunes of State Owned Enterprises (SOEs) which had been relegated to the corporate graveyards.\n\nZimbabwes first Sovereign Wealth Funds (SWF) origins can be traced back to a mining sector policy study conducted in2012that recommended the establishment of the fund to drive long-term investment leveraging on mining, natural and other resources that would anchor inclusive economic growth and development.\n\nFormerly the SWF, the MIF was established by an Act of Parliament in 2014 called the Sovereign Wealth Fund Act (Chapter 22:20). In September 2023, it was renamed to Mutapa Investment Fund through Statutory Instrument 156 of 2023 by President Emmerson Mnangagwa using the Presidential Powers (Temporary Measures Act).\n\nMIF chief executive officer, Dr John Mangudya, told state controlled media that said strategies to turn around some parastatals were employed in the funds first year of existence.\n\nMIF is working on with its investee companies including putting in place a package for the procurement of buses by ZUPCO to augment Public transport.\n\nWorking with the National Railways of Zimbabwe (NRZ) to rehabilitate rail infrastructure and rolling stock, promoting rewarding Joint Ventures especially in the mining sector, developing sustainable operational models at Cottco, Silo Foods, Air Zimbabwe and the Cold Storage Commission (CSC), he said.\n\nThe entities mentioned by Mangudya were largely viewed as dead due to bad corporate governance with very little to offer to the countrys fiscus after degenerating into tiny shadows of their former selves before the coming in of the MIF, prompting many to regard the current initiatives as mammoth graveyard resurrection efforts.\n\nMIF CEO said the fund has made great strides within the first year of its operations geared to transform the economic and financial performance of portfolio companies under its purview in order to drive sustainable growth and development.\n\nApart from rescuing the ailing companies, the fund has also completed a diagnostic assessment of its investee companies and has come up with a strategic plan to catalyse national building by the entities under MIF.\n\nFor instance, the fund is closely working with the Zimbabwe Electricity Supply Authority (ZESA) to enhance energy security in Zimbabwe through various initiatives that include prepaid metering, net metering, smart metering and enhancing base load through the implementation of independent power producers projects that include rehabilitating of Hwange Units 1 to 6 aimed at increasing electricity by around 600MW.\n\nThe fund is also focusing on strengthening board effectiveness, performance management and client centric across its entities. Also, we are working on enhancing value for money practices by optimizing capital management and practices within the group, added Mangudya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/21044343/Mangudya-2.jpg",
            "description": "<p>By Alois Vinga THE Mutapa Investment Fund (MIF) has devoted efforts to turn around the fortunes of State Owned Enterprises (SOEs) which had been relegated to the ‘corporate graveyards’. Zimbabwe’s first Sovereign Wealth Fund’s (SWF) origins can be traced back to a mining sector policy study conducted in 2012 that recommended the establishment of the fund to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-targets-parastatals-in-the-graveyard/\">Mutapa Fund targets parastatals in the ‘graveyard’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "Zimbabwe records 49 human-crocodile conflicts in two months, 9 killed, 11 injured",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-49-human-crocodile-conflicts-in-two-months-9-killed-11-injured/",
            "content": "By Thandiwe Garusa\n\nA surge in crocodile attacks has claimed the lives of at least nine people and left 11 others injured over the past two months, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has revealed.\n\nIn a statement Wednesday, ZimParks raised concerns over the increasing number of fatalities.\n\nZimParks has noted with concern the rising number of fatalities from crocodile attacks, which have resulted in nine deaths and 11 injuries in the last two months.\n\nAt least 44 cattle and 60 goats were also killed during the same period in 49 reported cases of human-crocodile conflict, the statement reads.\n\nThe authority also urged communities to remain vigilant around water bodies during the rainy season, ensuring that children and livestock are not left unattended near rivers or lakes.\n\nWe urge communities to be especially cautious around water bodies during this rainy season.\n\nLivestock and children must not be left unattended near rivers or lakes to prevent them from becoming easy targets.\n\nAdditionally, when engaging in water activities such as fishing, swimming, or domestic chores, it is essential to set up barriers around these areas to enhance safety, the statement added.\n\nZimParks also assured the public that it remains committed to finding a balance between ensuring public safety and conserving wildlife.\n\nThe authority also said it will continue collaborating with local authorities and conservation partners in various initiatives aimed at educating the public on crocodile behavior, improving safety practices, and increasing awareness and preparedness.\n\nAccording to ZimParks statistics, around 300 people were killed in human-wildlife conflicts across the country between 2019 and 2023.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/13165408/crocodile.jpg",
            "description": "<p>By Thandiwe Garusa A surge in crocodile attacks has claimed the lives of at least nine people and left 11 others injured over the past two months, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has revealed. In a statement Wednesday, ZimParks raised concerns over the increasing number of fatalities. “ZimParks has noted with concern</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-49-human-crocodile-conflicts-in-two-months-9-killed-11-injured/\">Zimbabwe records 49 human-crocodile conflicts in two months, 9 killed, 11 injured</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "Zanu PF Mazowe North MP acquitted of rape",
            "url": "https://www.newzimbabwe.com/zanu-pf-mazowe-north-mp-acquitted-of-rape/",
            "content": "By Staff Reporter\n\nZANU PF legislator for Mazowe North Tsungai Makumbe has been found not guilty and acquitted of raping his ex-wife at gun point.\n\nThe ex-wife got the lawmaker arrested last year claiming that the rape resulted in pregnancy,further accusing Makumbe of infecting her with STIs and and HIV.\n\nBut Harare magistrate Clever Tsikwa dismissed the claims, ruling that the State had no sufficient evidence to nail Makumbe.\n\nIt was State case that Makumbe raped the woman in November 2022 in his car and at the entrance to her place of residence in Mt Pleasant.\n\nIt was alleged that Makumbe went to the complainants residence, where he called her outside.\n\nIt was around 11 pm and she complied.\n\nIt was also alleged that Makumbe proposed love, and she turned down his requests.\n\nHe allegedly pulled out a gun proswcutors accused him of having gone to the passenger seat where he dragged her and raped her once without protection.\n\nThe accused person suddenly pulled the complainants left leg down and twisted it, and that led the complainant to stand on the ground, said the state.\n\nHe allegedly gave her US$20 to buy morning-after pills, but she declined.\n\nThe woman was later treated at Parirenyatwa, and she tested HIV positive and also found out that she was pregnant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/04021648/MakumbeT-scaled-1.jpg",
            "description": "<p>By Staff Reporter ZANU PF legislator for Mazowe North Tsungai Makumbe has been found not guilty and acquitted of raping his ex-wife at gun point. The ex-wife got the lawmaker arrested last year claiming that the rape resulted in pregnancy, further accusing Makumbe of infecting her with STIs and and HIV. But Harare magistrate Clever Tsikwa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-mazowe-north-mp-acquitted-of-rape/\">Zanu PF Mazowe North MP acquitted of rape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "We have to be realistic – Nees speaks on Warriors World Cup Qualification chances",
            "url": "https://www.newzimbabwe.com/we-have-to-be-realistic-nees-speaks-on-warriors-world-cup-qualification-chances/",
            "content": "By Sport Reporter\n\nWarriors coach Michael Nees says realistic expectations need to be set when Zimbabwe, currently sitting at the bottom of Group C, plays in the 2026 World Cup Qualifiers.\n\nThe gaffer made these remarks on Wednesday when he announced the Warriors squad to face Benin and Nigeria on the 20th and 25th of March, respectively.\n\nSitting bottom in the group with two points from four games, the Warriors are yet to win a match in the ongoing qualifying campaign as they have only managed two draws against Rwanda and Nigeria.\n\nCommenting on the teams chances of qualifying, Nees said, We have to be realistic, although we have to make decisions on the pitch rather than to grow a big mouth.\n\nWe have a big challenge that is ahead of us; there is Benin if you look at their results, they are good and they have also qualified for AFCON.\n\nWe are not in the best of positions; why do we need to lie to ourselves?\n\nThe good thing is there are still 18 points to play for, we will see as we go\n\nNees will be the third coach to lead Zimbabwe in the ongoing 2026 World Cup Qualifiers campaign, as it started under former Highlanders coach Baltermir Brito on an interim basis in 2023 before Jairos Tapera took over last year.\n\nBrito led the side in two games against Rwanda and Nigeria in November 2023, picking up two points.\n\nZimbabwes campaign then continued under Jairos Tapera in June last year, and they lost two matches against Lesotho (2-0) and South Africa (3-1).\n\nWith slim chances for Zimbabwe to qualify, Nees, however, added that all remaining World Cup qualifier games will also be used to build the squad for the upcoming AFCON to be hosted by Morocco in December.\n\nFor us, these games are a hybrid, so its a double approach.\n\nWe to perfom to turn the page in the World Cup qualification and at the same time we have to look at AFCON and prepare for it in the same period, added Nees.\n\nGroup C World Cup Qualifiers Standings\n\n1)Rwanda = 7points\n\n2)South Africa = 7 points\n\n3)Benin = 7 points\n\n4)Lesotho = 5 points\n\n5)Nigeria = 3 points\n\n6)Zimbabwe = 2 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sport Reporter Warriors coach Michael Nees says realistic expectations need to be set when Zimbabwe, currently sitting at the bottom of Group C, plays in the 2026 World Cup Qualifiers. The gaffer made these remarks on Wednesday when he announced the Warriors squad to face Benin and Nigeria on the 20th and 25th of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-have-to-be-realistic-nees-speaks-on-warriors-world-cup-qualification-chances/\">We have to be realistic – Nees speaks on Warriors World Cup Qualification chances </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        },
        {
            "title": "Motsepe is re-elected unopposed as CAF president",
            "url": "https://www.newzimbabwe.com/motsepe-is-re-elected-unopposed-as-caf-president/",
            "content": "BBC\n\nPatrice Motsepe has been re-elected unopposed as Confederation of African Football (Caf) president for a second term in office.\n\nThe 63-year-old South African, who has been Caf president since 2021, had announced his decision to stand again in October 2024.\n\nHis re-election for another four-year reign was confirmed at the Caf extraordinary general assembly in Cairo on Wednesday where Fifa president Gianni Infantino was in attendance.\n\nMotsepe, a mining magnate who also owns South African club Mamelodi Sundowns, had said he was looking tocontinue the good progresshe had made since coming to office four years ago.\n\nAlthough Motsepes re-election was a formality, elections were held for positions on Cafs executive committee with Cameroonian football legend Samuel Etoo winning a seat.\n\nThe continents representatives on the Fifa council were also voted in during Wednesdays executive general assembly.\n\nMotsepes second term in charge of African football was decided before Wednesdays events in Cairo after he became the first and only contender to run for office.\n\nThe lack of challengers could be seen as a vote of confidence in the South Africans presidency so far, having come to Caf at a time of crisis.\n\nIn 2021 he succeeded Ahmad of Madagascar who hadbecome the first Caf president to be banned by Fifa.\n\nSince then, the African football body has grown financially, making a $72m (55.5m) profit from last years Africa Cup of Nations (Afcon)  a sum 18 times bigger than that generated by the previous edition in 2022.\n\nWhen declaring his intent to run for a second term, Motsepe told the BBC progress had been made, but there is still a lot of work to be done.\n\nDuring his speech on Wednesday, he highlighted the issue of national stadiums across Africa as one of his key areas of focus.\n\nIn 2021, there were 36 countries that were not playing football in their countries. The number has come down to 12 but for us, this is still a big number, he said.\n\nAt Caf and Fifa, it is our job to continue supporting the development of sports infrastructure.\n\nThe election of four-time African Footballer of the Year Samuel Etoo on to Cafs decision-making executive committee was among the big talking points from Wednesdays events in Cairo.\n\nEtoo, president of the Cameroon Football Federation (Fecafoot), was elected unopposed as he was the only candidate from the central Africa region.\n\nLast week,the Court of Arbitration for Sport upheld an appeal by Etoo,externalwho won the right to be included on the list of candidates after initially being ruled out of the contest by Cafs governance committee in January.\n\nThe 44-year-old former Cameroon striker was suspended last year by both Fifa and Caf for violating disciplinary regulations.\n\nCaf had banned him after an inquiry into purported breaches of its ethical and integrity standards when he took up a role as ambassador for a betting company.\n\nThe ban and a $200,000 finewere later lifted on appeal.\n\nEtoo was greeted warmly by delegates around him when his name was announced along with the five other elected members on Cafs executive committee.\n\nThe former Barcelona and Inter Milan striker has been in charge of Fecafoot since December 2021 but has seen his tenure mired in controversy.\n\nLast September he received asix-match banfrom attending Cameroon games while one former international team-mate described him as adictatorfor his handling of the appointment of Indomitable Lions head coach Marc Brys.\n\nThere was also a vote to decide the six African representatives on the Fifa Council with Hany Abo Rida of Egypt and Fouzi Lekjaa of Morocco retaining their places.\n\nKanizat Ibrahim (Comoros), Hamidou Djibrilla Hima (Niger), Ahmed Yahya (Mauritania) and Souleymane Waberi (Djibouti) were elected for the first time.\n\nOn Cafs executive committee, five others were elected unopposed alongside Samuel Etoo.\n\nMustapha Ishola Raji of Liberia retained his seat for another four years, while Bestine Kazadi Ditabala (Democratic Republic of Congo), Wallace Karia (Tanzania), Kurt Simeon-Okraku (Ghana) and Sadi Walid (Algeria) are new to the committee.\n\nElvis Chetty of the Seychelles lost his place when Feizal Sidat (Mozambique) and Samir Sobha of Mauritius were voted in to represent southern Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/01202444/Confederation-of-African-Football-CAF-president-Patrice-Motsepe.png",
            "description": "<p>BBC Patrice Motsepe has been re-elected unopposed as Confederation of African Football (Caf) president for a second term in office. The 63-year-old South African, who has been Caf president since 2021, had announced his decision to stand again in October 2024. His re-election for another four-year reign was confirmed at the Caf extraordinary general assembly</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motsepe-is-re-elected-unopposed-as-caf-president/\">Motsepe is re-elected unopposed as CAF president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "13 Mar 2025"
        }
    ]
}