{
    "news": [
        {
            "title": "ZETDC blames private contractor for negligence after fatal electrocution of teen student",
            "url": "https://www.newzimbabwe.com/zetdc-blames-private-contractor-for-negligence-after-fatal-electrocution-of-teen-student/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Electricity Transmission and Distribution Company (ZETDC) has blamed a private contractor for failing to adhere to safety procedures following the fatal electrocution of a 19-year-old student in Budiriro 1 Extension, Harare.\n\nThe student, who was on an industrial attachment, was electrocuted on Wednesday after power was restored to a line he was working on.\n\nIn a statement issued Thursday, ZETDC clarified that the deceased was not one of its employees.\n\nZETDC extends its deepest and most sincere condolences to the family, friends, and colleagues of the 19-year-old student, who was reportedly attached to a private contractor, read the statement.\n\nAccording to the company, preliminary investigations revealed that no permit or authorisation had been issued for work on the affected Medium Voltage (MV) line, and that the contractor had acted independently.\n\nZETDCs preliminary investigations have established that ZETDC had not issued a permit or authorisation for any work on the MV line at this location. The contractor was operating outside of ZETDCs jurisdiction and safety protocols, said the power utility.\n\nThe company urged the public to engage it directly for any electrical work involving its infrastructure so as to ensure compliance with safety standards.\n\nThe safety of our customers and the public remains our highest priority. We urge everyone to engage ZETDC for all electrical works on the electricity grid, added the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23164441/ZESA-ZETDC.webp",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Electricity Transmission and Distribution Company (ZETDC) has blamed a private contractor for failing to adhere to safety procedures following the fatal electrocution of a 19-year-old student in Budiriro 1 Extension, Harare. The student, who was on an industrial attachment, was electrocuted on Wednesday after power was restored to a line</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zetdc-blames-private-contractor-for-negligence-after-fatal-electrocution-of-teen-student/\">ZETDC blames private contractor for negligence after fatal electrocution of teen student</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Oct 2025"
        },
        {
            "title": "Warriors to play Algeria and Qatar ahead of AFCON Finals",
            "url": "https://www.newzimbabwe.com/warriors-to-play-algeria-and-qatar-ahead-of-afcon-finals/",
            "content": "By Sports Reporter\n\nThe Warriors are set to play Algeria and Qatar in international friendly matches as part of their preparations for the 2025 Africa Cup of Nations (AFCON), ZIFA President Nqobile Magwizi has confirmed.\n\nThe matches will take place during the November FIFA window on dates yet to be announced.\n\nDuring the FIFA break in November, we have a match with Algeria, and we also have a match with Qatar.\n\nOf course, Algerias choice was very deliberate, knowing that in AFCON we will be playing Egypt, and the style of play between Egypt and Algeria is almost the same, said Magwizi.\n\nZIFA will also host a ten-day training camp for the Warriors, which will help the technical team select players.\n\nWe have also put in place a camp that will happen, a 10-day camp that will take place when we are preparing for the AFCON.\n\nBut pre that campaign, that camp, we are also going to put in place even a local camp where the new technical team will have an opportunity to spend a lot more time with the players, he said.\n\nZimbabwe will have a new coach at the 2025 AFCON after Michael Nees was dismissed on Wednesday following a string of poor results.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sports Reporter The Warriors are set to play Algeria and Qatar in international friendly matches as part of their preparations for the 2025 Africa Cup of Nations (AFCON), ZIFA President Nqobile Magwizi has confirmed. The matches will take place during the November FIFA window on dates yet to be announced. “During the FIFA break</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-to-play-algeria-and-qatar-ahead-of-afcon-finals/\">Warriors to play Algeria and Qatar ahead of AFCON Finals </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Oct 2025"
        },
        {
            "title": "Crisis looms as Treasury slashes Health Ministry’s 2026 national budget bid",
            "url": "https://www.newzimbabwe.com/crisis-looms-as-treasury-slashes-health-ministrys-2026-national-budget-bid/",
            "content": "By Anna Chibamu\n\nA major funding crisis is looming in Zimbabwes public health sector after the Ministry of Health and Child Care was directed by Treasury to cut its 2026 national budget bid, further threatening already-strained health services.\n\nPresenting the ministrys 2025 budget performance, priorities, and 2026 bids to a joint sitting of the Parliamentary Portfolio Committee on Health and the Thematic Committee on Health, Permanent Secretary for Health, Aspect Maunganidze, revealed that Treasury had capped the 2026 allocation at just ZWL$24.19 billion, representing only 28% of the ministrys initial request.\n\nWe have been advised that our cap for allocation will be ZWL$24.19 billion. This speaks to about only 28%. If you recall our 2025 figures, we requested about ZWL$94 billion and got around ZWL$28 billion, roughly 30%. So, this years allocation is actually lower than that of 2025, Maunganidze said.\n\nOut of the ministrys four major programmes: Policy and Administration, Public Health, Curative Services and Biomedical Engineering, Science, Pharmaceuticals and Biopharmaceutical Protection, the total budget bid for 2026 stands at ZWL$85.3 billion.\n\nMaunganidze explained that the ministry made a ZWL$94.9 billion bid in 2024, but only received ZWL$28.3 billion, or 30% of its needs. This allocation, he said, remained well below the Abuja Declaration target, which recommends that at least 15% of national budgets be allocated to health.\n\nOver the years, our health budget allocation has ranged from as low as 9.82% in 2024 to between 12% and 25% in 20212023. The 2025 allocation of 13.01% was actually the highest in the last five years, said Maunganidze.\n\nOf the ZWL$27.2 billion allocated for 2025, the ministry had received ZWL$11.4 billion by September, just 41% of the total expected.\n\nThis is what we have received up to the end of September 2025. The question has always been, even though we received little, are we utilising it? Of that $11.4 billion, we have spent about $10.5 billion, representing 92% utilisation, the permanent secretary added.\n\nMaunganidze also warned that the countrys health financing landscape has worsened since 2020, partly due to reduced donor support.\n\nThis has resulted in the need for much more robust resource mobilisation. Its a challenge that has always been looming, but for sustainable health interventions, we must invest locally, he said.\n\nDespite the financial challenges, Maunganidze highlighted notable improvements, including increased life expectancy, achievement of HIV/AIDS targets and progress in human resource development.\n\nWe have seen a marked improvement in several health indicators despite the challenges. Our life expectancy has gone up; women still live longer than men, as usual. Our HIV/AIDS targets have been achieved, and we are continuing to upskill our health workforce, he said.\n\nHowever, the situation has been further compounded by significant cuts in U.S. funding, particularly from the United States Agency for International Development (USAID) and the Presidents Emergency Plan for AIDS Relief (PEPFAR). These programmes have historically supported Zimbabwes HIV, tuberculosis, and maternal health efforts.\n\nThe reduction in donor financing has widened the countrys health funding gap, putting essential services such as drug procurement, HIV prevention, and maternal care at greater risk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on-e1746463851506.jpg",
            "description": "<p>By Anna Chibamu A major funding crisis is looming in Zimbabwe’s public health sector after the Ministry of Health and Child Care was directed by Treasury to cut its 2026 national budget bid, further threatening already-strained health services. Presenting the ministry’s 2025 budget performance, priorities, and 2026 bids to a joint sitting of the Parliamentary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crisis-looms-as-treasury-slashes-health-ministrys-2026-national-budget-bid/\">Crisis looms as Treasury slashes Health Ministry’s 2026 national budget bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Oct 2025"
        },
        {
            "title": "Nurse Bridget Makaza jailed 27 years for cold-blooded murder of her husband",
            "url": "https://www.newzimbabwe.com/nurse-bridget-makaza-jailed-27-years-for-cold-blooded-murder-of-her-husband/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Emelia Muchawa has sentenced Harare nurse Bridget Makaza to 27 years in prison for the cold-blooded murder of her husband, Kurai Bus company owner Macloud Zvavovaviri Mapanga, whom she shot three times as he slept in their Strathaven home in 2018.\n\nMakaza was last week convicted of what the court described as a calculated act of vengeance fuelled by jealousy, polygamy and deceit. Justice Muchawa said Makaza executed her husband and then staged a fake robbery to conceal the crime.\n\nThe accused unlawfully and with intent to kill, executed her husband while he slept, ruled Justice Muchawa. She aimed at the upper part of his body and delivered three fatal shots, then staged an armed robbery to cover her tracks.\n\nWhen handing down the sentence, the judge said:\n\nWhereupon, after reading documents filed of record and hearing counsel, it is ordered that the offender who was found guilty of murder as defined in section 47 (1) of the Criminal Law (Codification and Reform) Act [Chapter 9:23] is hereby sentenced to 27 (twenty-seven) years imprisonment.\n\nThe court heard Makaza used a .38 Amadeo Rossi revolver with an erased serial number, smuggled from South Africa under the pretext of buying medication. After killing her husband, she screamed Thief! Thief! and falsely claimed robbers had stolen US$12,000.\n\nProsecutor B. Murevanhema said, There were no robbers. There was no break-in. The story was a fabrication to mask premeditated murder.\n\nPolice investigations confirmed there were no signs of forced entry. The firearm and gloves were later recovered from a swamp in Belvedere after Makaza led detectives to the spot.\n\nMakaza fled to South Africa after being granted bail and was re-arrested in December 2024 upon returning to Zimbabwe, claiming she missed her children.\n\nDuring the trial, she claimed self-defence, alleging her husband tried to attack her, but the judge dismissed this as a lame and incredible fabrication. Forensic expert Admire Mutizwa testified that the revolver required deliberate trigger pressure and could not have discharged accidentally.\n\nJustice Muchawa concluded that Makaza procured the weapon, waited for her husband to sleep, and executed him in cold blood.\n\nShe was methodical, the judge said. Her conduct before, during, and after the murder shows beyond doubt that this was a planned execution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23063548/Bridget-Makaza-1.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Emelia Muchawa has sentenced Harare nurse Bridget Makaza to 27 years in prison for the cold-blooded murder of her husband, Kurai Bus company owner Macloud Zvavovaviri Mapanga, whom she shot three times as he slept in their Strathaven home in 2018. Makaza was last week convicted of what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nurse-bridget-makaza-jailed-27-years-for-cold-blooded-murder-of-her-husband/\">Nurse Bridget Makaza jailed 27 years for cold-blooded murder of her husband</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Oct 2025"
        },
        {
            "title": "Blow for Dynamos as Denver Mukamba is ruled out of Chibuku Cup semi-final clash against Highlanders",
            "url": "https://www.newzimbabwe.com/blow-for-dynamos-as-denver-mukamba-is-ruled-out-of-chibuku-cup-semi-final-clash-against-highlanders/",
            "content": "By Sports Reporter\n\nDynamos FC have suffered a major setback ahead of Sundays Chibuku Super Cup semi-final, with star midfielder Denver Mukamba ruled out through suspension.\n\nMukamba, who has been instrumental since rejoining the club in July, will miss the crucial encounter after accumulating five yellow cards, triggering an automatic one-match ban under league regulations.\n\nDynamos will also be without striker Jairos Kasondo, who is suspended for the same reason. Kasondo was Dembares hero last Sunday, scoring the equaliser in their 11 draw against Highlanders at Barbourfields Stadium.\n\nThe semi-final showdown comes as both traditional giants search for redemption following inconsistent league performances that have left them hovering near the lower half of the table.\n\nHead-to-head in league competitions, Dynamos have not beaten Highlanders in open play since 2015, adding extra pressure ahead of Sundays clash.\n\nHowever, Dembare have already made history by becoming the first team to reach the Chibuku Super Cup semi-finals for three consecutive seasons, a feat they will be hoping to build on despite the absence of two key players.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23062100/mukamba_denver.jpg",
            "description": "<p>By Sports Reporter Dynamos FC have suffered a major setback ahead of Sunday’s Chibuku Super Cup semi-final, with star midfielder Denver Mukamba ruled out through suspension. Mukamba, who has been instrumental since rejoining the club in July, will miss the crucial encounter after accumulating five yellow cards, triggering an automatic one-match ban under league regulations.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blow-for-dynamos-as-denver-mukamba-is-ruled-out-of-chibuku-cup-semi-final-clash-against-highlanders/\">Blow for Dynamos as Denver Mukamba is ruled out of Chibuku Cup semi-final clash against Highlanders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Oct 2025"
        },
        {
            "title": "‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid",
            "url": "https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/",
            "content": "IOL\n\nFormer Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movements bold plans to extend President Emmerson Mnangagwas term of office to 2030, warning that the move will end badly for both the president and Zimbabwe.\n\nSpeaking to IOL, Kasukuwere said:He (Mnangagwa) is dreaming and he has set himself up for a gigantic failure. Greediness knows no boundaries, and this will lead to a huge disaster for the country.\n\nEarlier this week,IOL reported that Zanu PF has emboldened its move to push through a proposal allowing Mnangagwa to remain in powerbeyond his current constitutional term, which ends in 2028. The party recently adopted a resolution at its annual conference backing the extension to align with the governments so-called Vision 2030 development agenda.\n\nKasukuwere, once a senior figure in the Zanu PF government led by Robert Mugabe before going into exile during the 2017 military intervention, became one of the most prominent former insiders to condemn the partys Mnangagwa plan publicly.\n\nZanu-PF party has announced plans to begin the process of extendingMnangagwas term of officeby two years  a move that, if successful, would keep him in power until 2030.\n\nThe proposal was formally endorsed at the partys annual national peoples conference in the eastern city of Mutare over the weekend. Delegates instructed government structures to start work on legislation to amend the constitution.\n\nAccording to State-ownedThe Herald, delegates argued that the extension would allow Mnangagwa to complete ongoing national development programmes aligned with the governments Vision 2030 agenda.\n\nThe conference adopted the resolution unanimously, describing it as a step toward ensuring policy continuity and consolidating the gains made under Mnangagwas leadership.\n\nZanu-PFs acting political commissar, Munyaradzi Machacha, toldThe Heraldthat the resolution formed part of the official conference outcomes and would be referred to the partys central committee for consideration.\n\nOur president has demonstrated exceptional leadership in driving national development. The conference agreed he should be supported to continue implementing Vision 2030, Machacha said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/15191341/Kasukuwere.jpg",
            "description": "<p>IOL Former Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movement’s bold plans to extend President Emmerson Mnangagwa’s term of office to 2030, warning that the move will end badly for both the president and Zimbabwe. Speaking to IOL, Kasukuwere said: “He (Mnangagwa) is dreaming and he has set himself up</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/\">‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Oct 2025"
        }
    ]
}