{
    "news": [
        {
            "title": "77 deaths, 401 injuries recorded in festive season road traffic accidents – police",
            "url": "https://www.newzimbabwe.com/77-deaths-401-injuries-recorded-in-festive-season-road-traffic-accidents-police/",
            "content": "By Staff Reporter\n\nA total of 77 people lost their lives in 1,211 road accidents that occurred between December 15 and 26, the Zimbabwe Republic Police (ZRP) has said.\n\nAccording to the latest statistics released by the police, 401 people were injured during the same period.\n\nWhile the number of accidents decreased slightly from 1,454 recorded during the same time last year, the number of fatalities and injuries showed an increase.\n\nThe number of deaths rose by six, from 71 in December 2023 to 77 this year, while the number of injuries increased by eight, from 393 to 401.\n\nMost of these accidents involved private vehicles, with only one incident involving public service vehicles, where three South Africa-bound buses collided, resulting in two fatalities.\n\nIn a statement Friday, police spokespersonCommissionerPaul Nyathi said some of the accidents were caused by fatigue and the negligent conduct of drivers.\n\nAccidents involving pedestrians trying to cross the roads have also been recorded.\n\nDrivers are urged to be observant, especially when approaching built-up areas or places frequented by the public, including residential areas.\n\nMeanwhile, the Zimbabwe Republic Police reiterates that drivers should avoid speeding and overtaking in circumstances that are clearly not safe to do so.\n\nAbove all, motorists are implored not to overload vehicles when travelling on the countrys roads, Nyathi said.\n\nThe public has also been urged to report any bad driving to the police.\n\nOn the other hand, motorists have been urged to be responsible and effectively contribute towards road safety in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/22172738/IMG-20241222-WA0013.jpg",
            "description": "<p>By Staff Reporter A total of 77 people lost their lives in 1,211 road accidents that occurred between December 15 and 26, the Zimbabwe Republic Police (ZRP) has said. According to the latest statistics released by the police, 401 people were injured during the same period. While the number of accidents decreased slightly from 1,454</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/77-deaths-401-injuries-recorded-in-festive-season-road-traffic-accidents-police/\">77 deaths, 401 injuries recorded in festive season road traffic accidents – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "Illegal trade booms in South Africa’s ‘super-strange looking’ plants",
            "url": "https://www.newzimbabwe.com/illegal-trade-booms-in-south-africas-super-strange-looking-plants/",
            "content": "BBC\n\nA biodiversity hotspot in a remote part of South Africa has become the hub of an illegal trade in protected plant species, with organised crime groups capitalising on overseas demand.\n\nTheyve not just stolen our land or our plants, theyve stolen our heritage as well, a livestock farmer angrily tells the BBC, as she expresses dismay at the social and ecological crisis that the poaching has caused.\n\nMost of the plants in question are a variety known as succulents, named for their ability to hold water and survive in arid climates.\n\nMany of the worlds succulent species are only found in the Succulent Karoo desert, which spans South Africa and Namibia.\n\nSucculent species range in size, shape and colour  some look like small multi-coloured buttons and some look like cacti, sprouting colourful flowers at certain times of the year.\n\nWhile these varieties can be cultivated in nurseries, global demand is also fuelling the poaching of these plants from the wild which are then smuggled and sold online to buyers in the US, Europe and East Asia.\n\nIn Kamieskroon, a small town in the centre of South Africas Namaqualand region, the rolling hills have become a haven for poachers.\n\nSome of the species are highly localised, and so can be wiped out by just a small amount of poaching.\n\nIn South Africa, we know already of seven species that has been wiped out completely and there are certainly more species that will go extinct very soon, says Pieter van Wyk, a nursery curator at the/Ai /Ais-Richtersveld Transfrontier Park.\n\nIt is hard to obtain figures for how many plants are being poached, but the non-governmental organisation Traffic reports that1.6 million illegally harvested succulents were seizedby South Africas law enforcement agencies between 2019 and 2024. This only represents the contraband that was detected, so the true figure is likely to be far higher.\n\nThe South African government is well aware of the problem, and unveiled a strategy in 2022 to combat poaching. It includes running community programmes about the need to protect the environment.\n\nAccording to Mr Van Wyk and other conservationists, plant poaching has been booming since the Covid-19 lockdown in 2020.\n\nWith international traders unable to travel to South Africa during that time, they turned to local people to collect succulents for them and post them out of the country.\n\nMr Van Wyk says this coincided with an increase in global demand.\n\nPeople had more time to try to find something to keep busy with, and plants were one of the only things that in your house, could connect you to the outside world.\n\nThis has been seized upon by organised crime syndicates who hire teams of plant poachers and then market the wild plants on social media and e-commerce platforms.\n\nThe syndicates saw this as an opportunity of making something viral telling a wide as possible public: We have this super-strange looking thing that comes from the African continent,' Mr Van Wyk says.\n\nThen the public just loses their heads and they say: I want to buy one, and [the syndicates] arrange for the species to be poached, he adds.\n\nThe uptick in organised crime activity in the region is having knock-on effects on local communities.\n\nThis is a low-income area, people are not rich here, and people will exploit opportunities for income, explains Malinda Gardiner from Conservation South Africa.\n\nExpressing a similar view, the livestock farmer whom the BBC spoke to says there is always an influx of money in her community when poaching takes place.\n\nWhen we see young men going up in the mountain areas, we know theyre poachers, adds the farmer, who asks not to be identified for fear of reprisals.\n\nThey use screwdrivers to uproot the succulents and they carry backpacks and sacks to keep the stolen plants.\n\nA few days after that, there is an outbreak of binge drinking and illegal activity.\n\nWhen they get the money, theres more drugs, more alcohol, children are neglected because mummy is drunk, daddy is drunk, theres no food, adds the farmer.\n\nMs Gardiner worries that the tensions will have longer-term effects.\n\nSmall communities here really need each other but this brings distrust. It brings a split in the communities as well, she says.\n\nMr Van Wyks assessment is starker: People are being abused and enslaved by syndicates and buyers.\n\nAttempts are being made to raise awareness among buyers about the importance of understanding where a plant might have come from.\n\nChina has become a major source of demand for wild succulents in the last few years, but an internet campaign there to educate people about the illegal succulent trade has seen some results.\n\nThe Clean Internet for Conophytum campaign was launched in March 2023 by the China Biodiversity Conservation and Green Development Foundation.\n\nAccording to the foundations deputy secretary-general Linda Wong, they have seen an 80% reduction in online adverts for conophytum  a type of succulent  with an unknown source, and buyers are starting to ask questions about where plants being sold online have come from.\n\nThe key is awareness. Once people know, they want to take action. They want to take responsibility to consume those plants and enjoy their beauty in a very responsible way, she tells the BBC.\n\nConservationists advise customers all over the world to ask about the origin of a plant, and under no circumstances should they buy those advertised as wild.\n\nTraffic and the UKs Kew Gardens recently announced that they were teaming up with eBayto develop new ways of preventing the sale of wild succulents on its platform.\n\nIn South Africa, Mr Van Wyk says more should be done to promote the cultivation of succulents that can be grown and harvested legally, to reduce the demand for poaching.\n\nWe as a country need to say that: We have this resource, and there are other countries that are majorly benefiting from this, why arent we?' he tells the BBC.\n\nMr Van Wyk now runs a nursery at the /Ai /Ais-Richtersveld Transfrontier Park which looks after plants that have been confiscated by law enforcement, and he says they have received more than 200,000 so far.\n\nIts obviously stressful seeing things disappearing. But if you study these plants, it brings so much joy and pleasure and you just forget about all the nonsense thats happening in the world, Mr Van Wyk says.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/27053445/84b81310-bd64-11ef-a0f2-fd81ae5962f4.jpg.webp",
            "description": "<p>BBC A biodiversity hotspot in a remote part of South Africa has become the hub of an illegal trade in protected plant species, with organised crime groups capitalising on overseas demand. “They’ve not just stolen our land or our plants, they’ve stolen our heritage as well,” a livestock farmer angrily tells the BBC, as she</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/illegal-trade-booms-in-south-africas-super-strange-looking-plants/\">Illegal trade booms in South Africa’s ‘super-strange looking’ plants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "Williams praises Curran’s ‘intent’ as Zimbabwe find their scoring touch",
            "url": "https://www.newzimbabwe.com/williams-praises-currans-intent-as-zimbabwe-find-their-scoring-touch/",
            "content": "Zimbabwe had as many as three debutants in theBoxing Day Test against Afghanistanin Bulawayo. One of them, opening batterBen Curran, went on to score 68 on day one, while the other two debutants were pace bowlersTrevor GwanduandNewman Nyamhuri.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/27053204/currant.webp",
            "description": "<p>ESPNCricinfo Zimbabwe had as many as three debutants in the Boxing Day Test against Afghanistan in Bulawayo. One of them, opening batter Ben Curran, went on to score 68 on day one, while the other two debutants were pace bowlers Trevor Gwandu and Newman Nyamhuri. Curran reached his half-century off just 54 balls, and hit 11 boundaries during his stay</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/williams-praises-currans-intent-as-zimbabwe-find-their-scoring-touch/\">Williams praises Curran’s ‘intent’ as Zimbabwe find their scoring touch</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "Zanu PF’s plans to keep Mnangagwa in office beyond 2028 trigger a wave of violence",
            "url": "https://www.newzimbabwe.com/zanu-pfs-plans-to-keep-mnangagwa-in-office-beyond-2028-trigger-a-wave-of-violence/",
            "content": "By Darlington Gatsi\n\nAN ambitious plan to extend President Emmerson Mnangagwas tenure beyond the constitutionally mandated two terms has triggered a wave of violence and intimidation, a recent report has revealed.\n\nDespite Mnangagwa saying he will respect the constitution and leave office after the end of his current and final term some ruling party officials are pushing for the octogenarian to remain in power.\n\nSeveral officials, including former cabinet ministers Supa Mandiwanzira and Owen Ncube have been clamouring in their respective provinces for Mnangagwa to rule beyond 2028.\n\nThis is in contrast to the partys resolution at this years conference in Bulawayo, which declared that Mnangagwa is serving his final term as president.\n\nThe Zimbabwe Peace Project (ZPP) latest report revealed that those opposed to Mnangagwa extending his term have faced violence from Zanu PF officials in Midlands province.\n\nSeveral incidents of intimidation included the harassment of known political activists by Zanu PF supporters who are focused on promoting the ED2030 campaign, which seeks to extend President Mnangagwas rule beyond 2028. The incidents were reported in Chiwundura and Kwekwe, among other areas.\n\nIn Chiwundura, Zanu PF activists Calvin Mhondiwa, Forbes Choto, and Adam Dhliwayo threatened a male victim belonging to a group supporting former CCC leader Nelson Chamisa. They allegedly harassed him for campaigning against the ongoing Mnangagwa beyond 2028 movement, promising to deal with the victim violently and extending such treatment to anyone opposed to the campaign, the report reads.\n\nZanu PF must amend Sections 91(2) and 382(7) of the constitution to allow Mnangagwa to extend his term.\n\nZPP has called on the police to take action on the allegations levelled against Zanu PF officials.\n\nThe ZRP should take concrete steps to prevent and investigate incidents of violence, particularly those related to the ED2030 campaign. The police must also ensure that perpetrators are held accountable and that victims receive adequate protection, said ZPP.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Darlington Gatsi AN ambitious plan to extend President Emmerson Mnangagwa’s tenure beyond the constitutionally mandated two terms has triggered a wave of violence and intimidation, a recent report has revealed. Despite Mnangagwa saying he will respect the constitution and leave office after the end of his current and final term some ruling party officials</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pfs-plans-to-keep-mnangagwa-in-office-beyond-2028-trigger-a-wave-of-violence/\">Zanu PF’s plans to keep Mnangagwa in office beyond 2028 trigger a wave of violence </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "WATCH: Holy Ten’s regrettable Christmas as angry fans bay for his blood, bolts for dear life",
            "url": "https://www.newzimbabwe.com/watch-holy-tens-regrettable-christmas-as-angry-fans-bay-for-his-blood-bolts-for-dear-life/",
            "content": "By Staff Reporter\n\nMUSICIAN Holy Ten is lucky to be alive after dodging a volley of missiles from angry fans, who attended a Kariba gig on Christmas Day.\n\nThe hip-hop artisthadperformed only one song just after midnight before announcing he could not continue due to poor sound quality from the PAsystem.\n\nThe sizeable crowd that thronged Lake Harvest Sports Club got agitated when Holy Ten made the unwelcome announcement leading to chaos.\n\nAs the barrage of objects, including beer bottles, were thrown onto the stage, the 26-year-old hip-hopper bolted and disappeared into the darkness.\n\nVideos of the melee were circulating on social media on Boxing Day, confirming the unfortunate incident that befell the songwriter and music producer nicknamed Mujaya or Ba Ju by his legion of fans.\n\nA reveller and music analyst, Eramus Meza, who spoke to NewZimbabwe.com, said Holy Ten was soiling his brand.\n\nI was in attendance and witnessed the crowd trouble which was evidently sparked by Holy Ten himself. Fame has gotten into his head and takes fans for granted, which is very damaging to his name and reputation, said Meza.\n\nEfforts to get a comment from Holy Ten or the event organisers were fruitless by the time of publishing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/01113945/Holy-Ten-1.png",
            "description": "<p>By Staff Reporter MUSICIAN Holy Ten is lucky to be alive after dodging a volley of missiles from angry fans, who attended a Kariba gig on Christmas Day. The hip-hop artist had performed only one song just after midnight before announcing he could not continue due to poor sound quality from the PA system. The sizeable crowd that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-holy-tens-regrettable-christmas-as-angry-fans-bay-for-his-blood-bolts-for-dear-life/\">WATCH: Holy Ten’s regrettable Christmas as angry fans bay for his blood, bolts for dear life </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "9-month-old baby dies on Christmas Eve after getting trapped between bed and wall",
            "url": "https://www.newzimbabwe.com/9-month-old-baby-dies-on-christmas-eve-after-getting-trapped-between-bed-and-wall/",
            "content": "By Staff Reporter\n\nA baby died after she rolled off and got trapped between the bed and the wall in Waterfalls, Harare, according to the police.\n\nPolice spokesperson Paul Nyathi confirmed the unfortunate incident which occurred on December 24.\n\nThe mother was busy with house chores when this happened.\n\nZRP confirms a sad incident which occurred in Waterfalls, Harare on 24/12/24 in which a 9-month-old minor died after she fell from the bed and was trapped in-between the wall and the bed.\n\nThe victim had been left on the bed by her mother who was doing her household chores, Nyathi said.\n\nNyathi recently implored parents and guardians to monitor children and to leave them in the custody of a responsible person to ensure their safety.\n\nIn a separate incident a few days ago a two-year-old female toddler from Crowborough Phase 3, Harare, died after allegedly consuming an unknown substance.\n\nThe substance was picked from a garbage pit container during child play.\n\nThe victim was taken to a local clinic where she died upon admission.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/13080322/baby-feet.jpg",
            "description": "<p>By Staff Reporter A baby died after she rolled off and got trapped between the bed and the wall in Waterfalls, Harare, according to the police. Police spokesperson Paul Nyathi confirmed the unfortunate incident which occurred on December 24. The mother was busy with house chores when this happened. “ZRP confirms a sad incident which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/9-month-old-baby-dies-on-christmas-eve-after-getting-trapped-between-bed-and-wall/\">9-month-old baby dies on Christmas Eve after getting trapped between bed and wall</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "ZimParks dismisses claims cyanide poisoning causing Lake Chivero Recreational Park wildlife deaths",
            "url": "https://www.newzimbabwe.com/zimparks-dismisses-claims-cyanide-poisoning-causing-lake-chivero-recreational-park-wildlife-deaths/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has refuted claims that the recent deaths of wildlife, livestock, and aquatic life at Lake Chivero Recreational Park were due to cyanide poisoning.\n\nTwo weeks ago, the authority reported that four white rhinos, among other wildlife and livestock, died after ingesting water contaminated by cyanobacteria from Lake Chivero.\n\nThis publication later revealed that an algal bloom in the lake caused the suffocation of aquatic life and the death of thousands of fish.\n\nSubsequent social media posts claimed there was intentional poisoning at the park.\n\nZimParks spokesperson Tinashe Farawo said these allegations were unfounded, clarifying that their investigations determined that the cyanobacteria were caused by the ongoing discharge of raw sewage into the lake by the Harare City Council.\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) has noted with concern a letter circulating on social media alleging that the recent deaths of wildlife and fish at Lake Chivero are attributed to cyanide poisoning.\n\nWe wish to assure the public that thorough investigations conducted by the University of Zimbabwe and our own Veterinary and Capture Unit have conclusively shown that the deaths are, in fact, caused by cyanobacteria.\n\nThe Authority categorically distances itself from any misinformation circulating on various social media platforms. We urge the public to disregard such unfounded claims and rely on official communication channels for accurate information, Farawo stated.\n\nFarawo emphasised that ZimParks is dedicated to rectifying the issues currently affecting Lake Chivero to protect the nations natural heritage.\n\nWe are working tirelessly with relevant stakeholders to address the issue and prevent future occurrences, he added.\n\nIn a viral letter posted on social media a user named Simba Mhofu alleged that the poisoning of the lake was part of a scheme to engineer a crisis that would allow a selected company to be awarded a contract for remediation.\n\nHe wrote, Now here is how the plot will unfold. A company called Watermark was corruptly awarded a tender by Harare City Council to install sewage pipes (Amalinda project), and this tender is being vigorously contested as it was highly inflated. The tender was previously quoted for under US$2 million by another company, and Watermark quoted US$16 million and was awarded this tender through corruption and as I mentioned this is in the process of being challenged.\n\nThe owners of Watermark then decided to come up with an evil plot and create a crisis by poisoning the water at Lake Chivero thereby killing thousands of fish and the four rhinos you mentioned.\n\nThe poisoning is meant to get people in positions of authority to panic and approve plus fund the sewage pipe project. In their evil plot they are pushing a false narrative blaming raw sewage which is overflowing into Lake Chivero as the source of the rhino poisoning.\n\nSo in the next few days the government will declare a state of disaster and this company called Watermark will be awarded money to sort out the problem which they created themselves.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18163502/chivero-entrance.jpeg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority (ZimParks) has refuted claims that the recent deaths of wildlife, livestock, and aquatic life at Lake Chivero Recreational Park were due to cyanide poisoning. Two weeks ago, the authority reported that four white rhinos, among other wildlife and livestock, died after ingesting water contaminated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-dismisses-claims-cyanide-poisoning-causing-lake-chivero-recreational-park-wildlife-deaths/\">ZimParks dismisses claims cyanide poisoning causing Lake Chivero Recreational Park wildlife deaths</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "Recent earthquakes had no effect on Kariba Dam, structure still safe – Zambezi River Authority says",
            "url": "https://www.newzimbabwe.com/recent-earthquakes-had-no-effect-on-kariba-dam-structure-still-safe-zambezi-river-authority-says/",
            "content": "By Thandiwe Garusa\n\nThe Zambezi River Authority (ZRA) has said multiple earthquakes which occurred in Kariba and nearby areas had no effect on Kariba Dam wall which exhibited normal behaviour when it was inspected and data from monitoring instruments analysed.\n\nThe most recent was a magnitude 4.9 tremor recorded on December 23 with an epicentre approximately 19 kilometres south-southeast of Kariba Dam in Zimbabwe, at a depth of 10 kilometres.\n\nIn a statement Thursday, the ZRA saidthat six additional earthquakes were recorded in the region between December 1 and December 20.\n\nThese included tremors ranging from magnitude 4.1 to 4.7, with epicentres predominantly located within the Kariba reservoir or nearby Charara Safari Area.\n\nOne earthquake, a magnitude 4.3 event on December 11, occurred farther away in Zimbabwes Hurungwe District, about 106 kilometres from Kariba Dam.\n\nAs part of emergency preparedness and Standing Operating Procedures (SOP) requirementsregarding the operation of Kariba Dam following the occurrence of unusual incidents, the authority inspects the dam and analyses data from the various dam monitoring instrumentseach time that there is an occurrence of an earthquake incident including that which took placeon 23rd December 2024.\n\nThe inspections and analysis of data from the various monitoringinstruments after the earthquakes referred to above did not reveal any unusual observationsand the dam continued to exhibit normal behaviour that is consistent with prevailing loadingconditions.\n\nThe authority further wishes to reiterate its commitment to carrying out and delivering on its mandate in respect of ensuring that the long-term safety and reliability of the Kariba Dam is maintained for public safety and the benefit of the Republics of Zambia and Zimbabwe and the region at large, ZRA said.\n\nThe earthquakes affected other areas like Hurungwe in Zimbabwe and Siavonga in Zambia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/28032644/Kariba-Dam-Zim.png",
            "description": "<p>By Thandiwe Garusa The Zambezi River Authority (ZRA) has said multiple earthquakes which occurred in Kariba and nearby areas had no effect on Kariba Dam wall which exhibited “normal behaviour” when it was inspected and data from monitoring instruments analysed. The most recent was a magnitude 4.9 tremor recorded on December 23 with an epicentre</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/recent-earthquakes-had-no-effect-on-kariba-dam-structure-still-safe-zambezi-river-authority-says/\">Recent earthquakes had no effect on Kariba Dam, structure still safe – Zambezi River Authority says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "Madzingo named Diaspora Male Entrepreneur of the year",
            "url": "https://www.newzimbabwe.com/madzingo-named-diaspora-male-entrepreneur-of-the-year/",
            "content": "By UK correspondent\n\nBIRMINGHAM:DIASPORA InsuranceCEO, Jeff Madzingo, was named Male Entrepreneur of the year at the 2024 Zimbabwe Diaspora Homecoming Celebration and Business Summit.\n\nHeld at the Golden Conifer Conference Centre in Harare on December 20, the annual event brought together Zimbabweans returning home for the holidays from across the world, enabling them to not just reconnect but also explore business opportunities.\n\nMadzingowas one of the expatriate entrepreneurs honoured at the event after being named Diaspora Male Entrepreneur of the Year.\n\nTrained as a banker in Zimbabwe before relocating to the United Kingdom, Madzingo has overseen the phenomenal growth ofDiaspora Insuranceinto a multi-million-dollar company with operations and clients in UK, EU, USA, Canada, Australia, New Zealand, Middle East and across Africa.\n\nFrom its base in Birmingham, the company now covers 19 African nationalities wherever they are based across the world and recently acquired a new head office complex as its operations continue to expand.\n\nThe company boasts double digit growth in gross written premiums while claim settlements now run into US$ millions as thousands of bereaved families have benefited from timely financial intervention to deal with the financial shocks of diaspora death.\n\nCommenting on the award, Madzingo said, This is for you, all our DiasporaInsurance.com family, we owe it to you. Ours is a calling, not work and thank you the wider community for acknowledging our efforts.\n\nMadzIngo was also honoured by the Zim-UK Business Chamber, winning the Business Driver of the Year Award at the associations annual conference which was held at the Sketchley Grande Hotel and Spa in Hinkley, near Leicester.\n\nIn addition, theDiaspora InsuranceCEO was nominated for the Top 1OO African Business Leaders and Entrepreneurs in the United Kingdom (UK) for 2024 by the UK-based African Business Chamber (AfBC).\n\nResponding to the many recognitions, Madzingo quipped, Its been a year of Awards!\n\nSince its launch, Diaspora Insurance has offered the groundbreaking and bespoke Diaspora Funeral Cash Plan which has proved to be popular with the global African diaspora, ensuring families are spared the double trauma of grieving and begging in times of bereavement.\n\nMillions in US dollar cash has been paid to bereaved families across the globe the company says.\n\nIn addition, the newly introduced and innovative products like COS Funeral Scheme, Diaspora Students Shield have completely changed the narrative when it comes to Diaspora bereavement by guaranteeing everyone a dignified send off and a celebrated life.\n\nThis year aloneDiaspora Insurancehas been involved in supporting over 350 community groups and charities as its focus on community empowerment and capacitation span continents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/16181635/Jeff-Madzingo-CEO.png",
            "description": "<p>By UK correspondent BIRMINGHAM: DIASPORA Insurance CEO, Jeff Madzingo, was named Male Entrepreneur of the year at the 2024 Zimbabwe Diaspora Homecoming Celebration and Business Summit. Held at the Golden Conifer Conference Centre in Harare on December 20, the annual event brought together Zimbabweans returning home for the holidays from across the world, enabling them</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/madzingo-named-diaspora-male-entrepreneur-of-the-year/\">Madzingo named Diaspora Male Entrepreneur of the year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        },
        {
            "title": "Man caged 20 years for raping four-year-old niece",
            "url": "https://www.newzimbabwe.com/man-caged-20-years-for-raping-four-year-old-niece/",
            "content": "By Staff Reporter\n\nA Mutasa man will spend 17 years behind bars after he was found guilty of raping his four-year-old niece.\n\nThe man was convicted after a full trial during which he denied the allegations.\n\nHe was initially slapped with a 20-year jail term.\n\nHowever, three years of his sentence were suspended conditionally leaving him to serve 15 years of effective jail time.\n\nProsecutors proved that the incident occurred on an unknown date this year during the afternoon when the offender lured the child to his bedroom.\n\nIn the bedroom, he undressed himself and the child, lay on his back, placed her on his stomach, and raped her.\n\nThe offence came to light when a neighbour overheard the complainant disclosing the incident to another child during playtime on the 7th of June 2024, and advised her mother, it was proved.\n\nThe complainant was taken to the hospital for a medical examination and penetration was confirmed leading to the perpetrators arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter A Mutasa man will spend 17 years behind bars after he was found guilty of raping his four-year-old niece. The man was convicted after a full trial during which he denied the allegations. He was initially slapped with a 20-year jail term. However, three years of his sentence were suspended conditionally leaving</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-caged-20-years-for-raping-four-year-old-niece/\">Man caged 20 years for raping four-year-old niece</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:25",
            "date": "27 Dec 2024"
        }
    ]
}