{
    "news": [
        {
            "title": "A coronation not a contest – Tanzania’s first female president faces little opposition",
            "url": "https://www.newzimbabwe.com/a-coronation-not-a-contest-tanzanias-first-female-president-faces-little-opposition/",
            "content": "BBC\n\nWith no heavyweightopposition candidates cleared to compete in Wednesdays election, many Tanzanians feel the vote is less like a contest and more like a coronation for President Samia Suluhu Hassan, as she faces her first presidential election.\n\nThe 65-year-old became the East African nations first female head of state after the death in 2021 of sitting President John Magufuli. He was admired on the one hand for his no-nonsense drive to stamp out corruption but criticised on the other for his authoritarian clampdown on dissent and controversial attitude towards the Covid pandemic.\n\nPresident Samia, who had been vice-president, seemed like a breath of fresh air  and with her warmer and friendlier style, she initiated reforms that seemed to represent a radical departure from her predecessors policies.\n\nHer four Rs policy  reconciliation, resilience, reform and rebuilding  reopened Tanzania to foreign investors, restored donor relations and mollified the International Monetary Fund (IMF) and World Bank.\n\nShe made a difference, the lost relationship between Tanzania and international organisations such as World Bank was restored, political analyst Mohammed Issa told the BBC.\n\nBut over the last two years or so, the political space has drastically shrunk  and the targeting of government critics and opposition voices is said to be more ruthless now than it ever was under Magufuli, with regular abductions and killings now reported.\n\nSamia came in with a conciliatory tone, but now she has become bold and makes tough decisions that many did not expect from her, said Mr Issa.\n\nShe is now widely blamed for some things like abductions, killings, repression of opposition and other issues on security.\n\nThis is reflected in reports by Freedom House, a US-based democracy and human rights advocacy group, which ranked Tanzania as partly free in 2020 and not free last year.\n\nThe government has not commented on the allegations.\n\nSamias CCM has won every election since the reintroduction of multi-party democracy in 1992, but the campaigns are usually vibrant with robust debate between the rival parties.\n\nWhile the electoral commission has cleared 17 presidential candidates to stand this time, the main opposition party, Chadema, is barred with its leader, Tundu Lissu, currentlyon trial for treason.\n\nHe had been calling for electoral reforms before his arrest in April  and the party is now urging its supporters to boycott the poll.\n\nHis deputy, John Heche,was also arrested last week and told the BBC just before his detention that President Samias so-called reforms were hollow: Yes, rallies were allowed again, but today Chadema cant do its mandate because the promises were fake.\n\nMeanwhile, presidential hopeful Luhana Mpina, from the second largest opposition party, ACT Wazalendo, has also been disqualified  twice.\n\nHe had managed to get his candidacy reinstated by the High Court after he was barred over a procedural issue  but when the Attorney General appealed last month, the electoral commission decided to uphold the disqualification.\n\nThis leaves smaller opposition parties like Chaumma and CUF in the race, but in reality there is no chance of them stopping Samia winning her first personal mandate.\n\nThe ruling partys control, exclusion of the opposition and institutional bias undermine electoral credibility. Limited civic space and low voter engagement further weaken inclusiveness, said political analyst Nicodemus Minde in a recent report for the Institute for Security Studies (ISS) think-tank.\n\nThis has left some would-be voters, like Dar es Salaam resident Godfrey Lusana, despondent.\n\nWe do not have an election without a strong opposition. The electoral system is not independent. We already know who will win. I cant waste time to vote, he told the BBC. If the electoral commission was really independent, I would have voted.\n\nThe islanders elect their own regional president and incumbent Hussein Mwinyi of the CCM is seeking another term, but faces stiff competition from ACT-Wazalendos Othman Masoud  who has been serving as his deputy in a unity administration.\n\nOn the campaign trail on the mainland, President Samia has capitalised on the initial praise she received for her motherly approach  seeking to govern through dialogue rather than decree.\n\nThis earned her the nickname Mama Samia  and at her rallies she has been promising to bring widespread development through better infrastructure, health and education.\n\nMany women, especially those in rural communities, see her as a stabilising force.\n\nShe brings dignity, we young women look up to her. We feel her presence as the president and that gives us confidence that we can be reliable to our communities now and in the future, first-time voter Queen Castoric from the northern city of Tanga told the BBC.\n\nBut some women in urban areas, like Celina Ponsiana, who will also be casting her ballot for the first time in Dar es Salaam, are more equivocal: Leadership isnt only about tone.\n\nI believe the president has a task to do, first on unemployment. She has been supporting some but many still need help, she said.\n\nAnother young woman in Morogoro, near Dar es Salaam, said she supported the president but refused to give her name to the BBC in case she faced a backlash from her contemporaries.\n\nSamia made us believe women can lead. I would love to say more, but many youth dont talk positively about her, she said.\n\nYoung people make up the majority of Tanzanias 37.7 million people registered voters  and there is anger from some over the presidents silence on issues like the shocking abductions.\n\nAnd while some give credit to President Samia for stabilising the economy, in some quarters there is even nostalgia for Magufuli given the rising reports of corruption.\n\nHer tougher approach of late may come down to several issues.\n\nIn a traditionally male-dominated society, she has faced problems asserting her authority. At recent rallies she has been reminding voters who is boss: Dont forget I am chief of the defence forces.\n\nShe may also feel undermined by colleagues. Within the CCM, there was some opposition to the fact that she became the partys presidential candidate unchallenged.\n\nThere is also a suggestion that she has in fact become the pawn of a powerful network of business tycoons and other influential CCM backers, known colloquially as Mtandao, according to Mr Minde in his ISS report.\n\nInternal [CCM] party democracy has been stifled through an orchestrated move to make President Samia the sole candidate. While this has deepened divisions within the party, a faade of unity is being presented to the public, he said.\n\nIt is believed that Magufuli refused to take orders from the Mtandao, preferring to stick to his own anti-corruption agenda.\n\nMr Minde warns that this has all contributed to a prevailing sense of fear in the East African nation. With the self-censorship of the media and the shrinking of political discourse, public debate has retreated to private conversations and social media.\n\nAnalysts warn that such detachment, especially among young people, could hollow out Tanzanias democracy further  and create problems down the road for President Samia should there not be a big turnout and if protests kick off.\n\nFor Tito Magoti, a lawyer and young political activist, the demands remain simple.\n\nWe want a free Tanzania where anyone has the freedom to speak, he told the BBC.\n\nThe freedom of movement and the freedom to do anything they wish.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/07022606/Tanzanias-president-Samia-Suluhu-Hassan.png",
            "description": "<p>BBC With no heavyweight opposition candidates cleared to compete in Wednesday’s election, many Tanzanians feel the vote is less like a contest and more like a coronation for President Samia Suluhu Hassan, as she faces her first presidential election. The 65-year-old became the East African nation’s first female head of state after the death in 2021</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-coronation-not-a-contest-tanzanias-first-female-president-faces-little-opposition/\">A coronation not a contest – Tanzania’s first female president faces little opposition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "27 Oct 2025"
        },
        {
            "title": "From Zimbabwe to Bay of Plenty: Family builds future on truffle farm",
            "url": "https://www.newzimbabwe.com/from-zimbabwe-to-bay-of-plenty-family-builds-future-on-truffle-farm/",
            "content": "NZ Herald\n\nZimbabwean couple Nikki and Lance Dodd met at university in Cape Town, South Africa, where she was studying interior design and he was studying horticulture. Their future plans were abruptly halted by the start of political unrest in Zimbabwe, leading to a long journey searching for a place to call home.\n\nWe are both from farming backgrounds and after university we intended to return to my parents farm in Zimbabwe and diversify from tobacco into berries and stone fruit, says Lance.\n\nThen we got the call in early 2000 saying dont come home, get a job. Both family farms had been requisitioned by the Zimbabwean Government and with no farms to go back to, everything was lost for both families.\n\nBy the early 2000s, Nikkis mum, dad, sister and two brothers had emigrated to New Zealand. Lances family went overseas but his father remains in Zimbabwe.\n\nA few fresh starts\n\nI followed Lance, and we went to the UK on an ancestral visa as we both had UK grandparents, says Nikki. It gave us the space to earn over there and work out what to do next.\n\nThis path led them back to Africa in 2003. Lance worked for a British company on a Kenyan flower farm that exported to Europe.\n\nThe couple had two children Hayley (now 17) and Matthew (now 14) and enjoyed living on a 20,000ha game farm with 200-300ha set aside for the flowers. They describe it as beautiful and remained there for 10 years until political unrest between Kenya, Somalia and Sudan made life dangerous once more and the family left the country.\n\nWe had visited my family in New Zealand several times over the years, so it made sense to come here. They lived a safe and peaceful life with their families, says Nikki.\n\nNikki in the truffire training Indie the springer spaniel pup to hunt for truffles. Photo / Supplied\n\nThe Dodds moved to the Bay of Plenty in 2012, with Lance finding work in the kiwifruit packhouses and later working in a management role.\n\nIts hard starting again from scratch, but we knew we had finally found somewhere safe and around family and where we could finally put down roots, says Lance.\n\nA place of their own\n\nThe couple began looking at lifestyle properties where they could live, work and give their children a rural life similar to the one they experienced when young.\n\nWhen Lance first saw a truffle farm near Te Puke for sale it was out of budget, but he noticed it again 10 months later and the price was now within reach.\n\nLance looked at it with a friend and before he even had time to tell us, hed put an offer on and approached the bank for finance! says Nikki.\n\nThe property was an 8ha block where previous owners Maureen and Colin Binns had established a truffle farm and ran truffle tasting tours to teach people about an almost mystical fungus, the black Prigord truffle.\n\nLance saw the possibilities and luckily so did his family when they visited for the first time. They moved in December 2024.\n\nAs well as the truffiere, we have an idyllic 3.5ha of QEII covenanted New Zealand bush and a crystal-clear waterway, which Maureen and Colin looked after so well. We are certainly happy to take over their legacy and have plans to resurrect the 8km of walkways through the forest and share the beauty with others, says Lance.\n\nHaving never seen a truffle before buying the property, its been a steep learning curve for Nikki and Lance. Despite being four hours drive away, Maureen and Colin have returned several times to pass on their wisdom and knowledge, something the Dodds are hugely grateful for.\n\nThis included using truffles for culinary delights and how to train a dog to hunt for truffles.\n\nSix-month-old springer spaniel Indie is doing well and Nikki says that she already goes into the truffiere and finds truffles.\n\nShe still rushes a bit but Im finding it amazing to be forming a strong bond with a dog and learning to read her, says Nikki.\n\nHayley Dodd with pet piglet Piggywig. Photo / Supplied\n\nHayley has a pet pig and Lance is interested in seeing if he can train it to truffle hunt as pigs are traditionally used for that role in Europe.\n\nOther animals include three cows, 12 sheep for mowing, 18 chickens and beehives from a local beekeeper.\n\nBy July 2025, Lance had committed to working fulltime on their property. Alongside the summer and winter truffle seasons and the summer truffle tours, the couple intend to grow exotic mushrooms such as oyster, shiitake and enoki to provide a consistent, year-round income.\n\nAfter being caught up in turbulent times overseas, the family has finally found peace and a home to call their own.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27064937/DOD-FAMILY.jpg",
            "description": "<p>NZ Herald Zimbabwean couple Nikki and Lance Dodd met at university in Cape Town, South Africa, where she was studying interior design and he was studying horticulture. Their future plans were abruptly halted by the start of political unrest in Zimbabwe, leading to a long journey searching for a place to call home. “We are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-zimbabwe-to-bay-of-plenty-family-builds-future-on-truffle-farm/\">From Zimbabwe to Bay of Plenty: Family builds future on truffle farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "27 Oct 2025"
        },
        {
            "title": "Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’",
            "url": "https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/",
            "content": "By Mary Taruvinga\n\nComedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 for making the President laugh.\n\nThis comes a few daysafter President Emmerson Mnangagwa personally handed hima brand-new Ford Raptor.\n\nIn a lengthy social media post, Chivayo said the cash gift was a small token of appreciation for the comedians talent and humour.\n\nFor a young comedian to make the President of the Republic laugh is never a small achievement!His Excellencys words  Ndafara newe mfana  set you apart. Ukafadza President, neniwo unenge wandifadza and wafadza nyika yese!\n\nThe controversial tenderpreneur, known for showering public figures with luxury cars and cash gifts, told Comic Elder to collect US$150,000 from his lawyer Sikhumbuzo Mpofu andbuy a decent house.\n\nFor safety, the money can be transferred directly to your preferred bank account, Chivayo added. Or my lawyer can facilitate the purchase of your desired house and transfer it into your name. The choice is entirely yours.\n\nComic Elderscharacters,including Anna Mugwaku, Obvious Mututu, Alfred Mweya, Nichodimas Chigovanyika, and Potipher Zvombo, have become household favourites.\n\nChivayos lavish spending on public figures landed him in a corruption dossier reportedly authored by Vice President Constantino Chiwenga, calling for investigations into possible siphoning of state funds through dubiously awarded tenders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27064152/comic-elder.jpg",
            "description": "<p>By Mary Taruvinga Comedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 “for making the President laugh.” This comes a few days after President Emmerson Mnangagwa personally handed him a brand-new Ford Raptor. In a lengthy social</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/\">Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "27 Oct 2025"
        },
        {
            "title": "Storm brews over Zimbabwe presidential extension plan",
            "url": "https://www.newzimbabwe.com/storm-brews-over-zimbabwe-presidential-extension-plan/",
            "content": "By AFP\n\nThe Zimbabwe ruling partys backing of a term extension for President Emmerson Mnangagwa, which requires a change to the constitution, has fuelled anger and fears of deepening authoritarianism.\n\nZanu-PF, accused of corruption and misrule during its 45 years in power, announced a week ago that its annual congress supported moves to keep Mnangagwa in office until 2030, and required legislative amendments would be initiated.\n\nProminent lawyer Tendai Biti immediately pledged to defend the constitution against its capture while opposition figures called a press conference for Tuesday to respond to the constitutional crisis.\n\nMnangagwa, 83, came to power in 2017 in a military-backed coup that ousted Robert Mugabe, who was president for 30 years.\n\nElected in 2018 and re-elected in 2023, Mnangagwa has been accused of allowing rampant corruption and suppressing human rights, while ordinary Zimbabweans endure hardship even though the economy is growing.\n\nMoves to keep him on were a huge scandal, said Moses Msipa, a former soldier living in the second largest city of Bulawayo.\n\nAs Zimbabweans, we must say no to this, the 48-year-old told AFP. One of the main reasons Mugabe became reviled is because he became a dictator and overstayed, and now they want to take us back to that.\n\nOrdinary Zimbabweans have suffered under years of economic crisis while ruling party elites are accused of corruption  Zinyange Auntony / AFP\n\nZanu-PFs 2030 agenda had been on the cards for months before it was announced as the party position on October 18.\n\nAttempts over the past months to demonstrate against the plan were met with a harsh police crackdown that put scores of people in jail.\n\nOnly mass popular expression of dissent may change course, but prospects of such are low at the moment on account of weak grassroots organising and mobilising, said Musa Kika, director of the Institute for Human Rights and Development in Africa.\n\nResistance is highly unlikely under such circumstances, notwithstanding the public anger that they harbour, political analyst and university professor Eldred Masunungure told AFP.\n\nThe constitutional limit of two five-year presidential terms was introduced in 2013. Any change would require a series of legal steps, including the approval of two-thirds of both houses of parliament and a national referendum.\n\nIf the term extension agenda was put to a referendum, it would be defeated, said Stephen Chan, a professor at the School of Oriental and African Studies in London.\n\nThe Zimbabwean people also want No Kings, he said, referring to rallies in the United States this month critical of President Donald Trump.\n\nResistance within the Zanu-PF could see a faction backing Vice President Constantino Chiwenga join forces with the opposition to block any constitutional amendment, he said.\n\nThe analysts warned that the party that has governed since independence in 1980 would not be above bypassing constitutional safeguards.\n\nZanu-PF uses the law as a tool to achieve its ends, never as a boundary for compliance and accountability, said Kika. The party is good at manipulating the institutions that operationalise the law through coercion and capture.\n\nEfforts to keep Mnangagwa in office were led by self-serving party elites seeking immunity from accountability for past and present wrongs, and assurance for continued accumulation of wealth, he said.\n\nMnangagwa was useful for party members who abuse state power and its resources more or less unhindered, added Masunungure.\n\nWith the opposition splintered and weak after years of repression, unemployed Bulawayo university graduate Tafadzwa Moyo told AFP he understood the nervousness about standing up to the government.\n\nStill, the 29-year-old said, it was time for citizens to unite across political divisions and fight to reclaim democracy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By AFP The Zimbabwe ruling party’s backing of a term extension for President Emmerson Mnangagwa, which requires a change to the constitution, has fuelled anger and fears of deepening authoritarianism. Zanu-PF, accused of corruption and misrule during its 45 years in power, announced a week ago that its annual congress supported moves to keep Mnangagwa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/storm-brews-over-zimbabwe-presidential-extension-plan/\">Storm brews over Zimbabwe presidential extension plan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "27 Oct 2025"
        },
        {
            "title": "Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final",
            "url": "https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/",
            "content": "By Sports Reporter\n\nHARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals.\n\nDembares ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time.\n\nSundays win gave Dynamos a chance to defend the Chibuku Super Cup, which they won in 2023 and 2024.\n\nDynamos took a first-half lead, thanks to Emmanuel Jalais 15th-minute strike.\n\nHowever, Bosso came back in the second half with determination and focus, which saw them score an equaliser in the 68th minute through Melikhaya Ncube.\n\nAfter playing a one-all draw in regulation time, the match headed straight for penalty shootouts, where they scored all their spot kicks, taking advantage of Bosso, who missed their fourth kick through Prince Ndlovu.\n\nDynamos coach Kelvin Kaindu could not hide his happiness as he praised his charges performance.\n\nIm happy; if you look, there is an improvement in how we are keeping possession as a team.\n\nOur performance was good; even in penalty shootouts, we proved to be the best, and I have to praise the boys, said Kaindu.\n\nDynamos will now play Triangle FC in the final, which is scheduled for next month on a date to be announced.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter HARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals. Dembare’s ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time. Sunday’s win gave Dynamos a chance to defend</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/\">Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "27 Oct 2025"
        }
    ]
}