{
    "news": [
        {
            "title": "Security guard kills woman, rapes another",
            "url": "https://www.newzimbabwe.com/security-guard-kills-woman-rapes-another/",
            "content": "By Staff Reporter\n\nIN a chilling incident that has rocked Matobo, Matebeleland South province, a drunk securityguardshot dead a local woman before raping her colleague at gunpoint.\n\nThe heinous crimes occurred Monday after the accused person reported for duty while drunk but was instructed to leave the premises. Before he left, he stole a firearm, which he used in the commission of the offences.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP is investigating heinous cases of murder and rape which occurred on April 14, 2025 at a mining company in Matobo.\n\nA security guard, Lloyd Mutsengi (50), allegedly reported for duty drunk at the mine and was denied duty, said Nyathi.\n\nIn response, the suspect allegedly stole a shotgun rifle from a co-worker and confronted two women. He threatened to rape the victims before shooting one of the victims dead, after she resisted.\n\nThe suspect went on to sexually abuse the other victim before fleeing the scene\n\nThe suspect is on the run, he added.\n\nZRP is appealing to anyone with information that may lead to Mutsengis arrest to report to their nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter IN a chilling incident that has rocked Matobo, Matebeleland South province, a drunk security guard shot dead a local woman before raping her colleague at gunpoint. The heinous crimes occurred Monday after the accused person reported for duty while drunk but was instructed to leave the premises. Before he left, he stole a firearm,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/security-guard-kills-woman-rapes-another/\">Security guard kills woman, rapes another</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "18 killed, 32 injured in human-wildlife conflicts in four months",
            "url": "https://www.newzimbabwe.com/18-killed-32-injured-in-human-wildlife-conflicts-in-four-months/",
            "content": "By Mary Taruvinga\n\nA total of 18 people were killed in human-wildlife conflict during the first quarter of this year, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has revealed.\n\nThe authority also recorded 32 injuries during the same period.\n\nIn a statement issued on Wednesday, ZimParks spokesperson Tinashe Farawo said the number of livestock killed by wildlife had increased compared to last year.\n\nThe Authority received 579 cases of human-wildlife conflict and managed to respond to all of them.\n\nCommunities around the country have lost at least 53 cattle and 85 goats, showing a significant increase from 18 and 21, respectively, during the same period in 2024, he said.\n\nDistricts mainly affected include Binga, Hwange, Kariba, Chiredzi, Hurungwe, Nyaminyami, and Mbire, among others.\n\nZimParks also translocated 129 animals back into the protected areas and eliminated 158.\n\nFarawo said ZimParks is currently engaging in various community initiatives to ensure that those sharing boundaries with parks are aware of potential risks and are equipped with strategies to manage wildlife encounters effectively.\n\nZimParks remains dedicated to fostering a harmonious coexistence between humans and wildlife and our teams are tirelessly working to raise awareness about wildlife behaviours and effective preventive measures.\n\nWe encourage communities to continue reporting incidents to ZimParks Problem Animal Control numbers listed below and local leadership, such as Councillors, Traditional Leaders and Rural District Council Authorities to ensure that we preserve lives, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/27132224/3a91133b-12fc-411f-8119-b3e26987629b-elephant_aspR_1.504_w627_h417_e.jpg",
            "description": "<p>By Mary Taruvinga A total of 18 people were killed in human-wildlife conflict during the first quarter of this year, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has revealed. The authority also recorded 32 injuries during the same period. In a statement issued on Wednesday, ZimParks spokesperson Tinashe Farawo said the number of livestock</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/18-killed-32-injured-in-human-wildlife-conflicts-in-four-months/\">18 killed, 32 injured in human-wildlife conflicts in four months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zimbabwe’s ZiG currency risks extinction stoked by policy choices",
            "url": "https://www.newzimbabwe.com/zimbabwes-zig-currency-risks-extinction-stoked-by-policy-choices/",
            "content": "Business Insider Africa\n\nZimbabwes ZiG is heading toward failure, not through rapid devaluation, but through growing irrelevance, according to Imara Asset Management, the countrys oldest independent brokerage.\n\nUnlike past currency collapses, which were driven by hyperinflation, the ZiGs downfall is being shaped by policy missteps and a prolonged liquidity crunch in its sixth month,Bloombergreported.\n\nThe ZiG is Zimbabwes sixth attempt in 15 years to establish a stable local currency. Launched a year ago, it is backed by 2.5 tons of gold and $100 million in foreign currency reserves held by the central bank.\n\nAbout 80% of transactions in the country are still conducted in U.S. dollars, with some also made in South African rand. Last year, Zimbabwean President Emmerson Mnangagwa declared that the ZiG would become the sole legal tender by 2030, phasing out the existing multicurrency system.\n\nDespite its gold backing, the ZiG has failed to win public confidence. Its value has declined, and efforts by authorities to encourage widespread adoption have largely fallen flat.\n\nPersistence Gwanyanya, a member of the Reserve Bank of Zimbabwes monetary policy committee, pushed back against the Imara report, stating that the liquidity issues are limited to the parallel market, and not the formal banking system.\n\nIts not extinction of ZiG, but unwinding of US dollar positions into the local currency thats next and will help release credit into the economy,Gwanyanya said.\n\nStill, Imara argues that the central banks strategy, particularly its decision to raise interest rates to support the ZiG and fight inflation, is backfiring by encouraging more people to rely on the U.S. dollar.\n\nThe Imara executives emphasized that monetary policy alone wont solve Zimbabwes economic challenges. They urged the government to focus on boosting revenues and curbing deficit spending.\n\nIn a blunt conclusion, they said: It would be better simply to scrap [the ZiG] and move on.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171606/mushayavanhu-zig-3.jpg",
            "description": "<p>Business Insider Africa Zimbabwe’s local currency, the ZiG, is at risk of failure due to policy missteps and prolonged liquidity crunch. The currency, backed by gold and foreign currency reserves, has failed to gain public confidence. Authorities’ efforts to encourage widespread adoption of the ZiG have largely been ineffective. Zimbabwe’s ZiG is heading toward failure,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-zig-currency-risks-extinction-stoked-by-policy-choices/\">Zimbabwe’s ZiG currency risks extinction stoked by policy choices</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Afrikaner business delegation welcomed in Harare, as Zimbabwe warms to Washington",
            "url": "https://www.newzimbabwe.com/afrikaner-business-delegation-welcomed-in-harare-as-zimbabwe-warms-to-washington/",
            "content": "MoneyWeb\n\nA delegation from the Afrikaner business community received a warm welcome from Zimbabwean President Emmerson Mnangagwa last week in Harares State House, according to a Zanu-PF official contacted by Moneyweb.\n\nAfrikaners are African,reportedTimesLive after the meeting, which was intended to rebuild regional integration and overcome past hostilities.\n\nThey are African. They live here. They built their lives and businesses here, and they must be part of Africas future, Zanu-PF spokesman Christopher Mutsvangwa is reported as saying.\n\nAfrikaners, like all Africans, have a duty to reinvest in the continent and contribute to its growth.\n\nMnangagwa said it is time to focus on rebuilding Zimbabwe, and that required acknowledging past challenges while working together for a united future.\n\nCapital knows no race, and we are calling on all who identify with this continent to invest in it.\n\nShifting political winds\n\nThe meeting comes the same week that Zimbabwe started compensating dispossessed white farmers with an initial payment of $3.1 million (R58 million) out of a total of $3.5 billion (R66 billion) agreed under the governments 2020 Global Compensation Deed (GCD) pledge.\n\nThis is an agreement to compensate nearly 4 000 former farm owners for the seizure of their farms under the Fast Track Land Reform Programme initiated under former president Robert Mugabe nearly 20 years ago. Payments will be made for improvements to the land, not the land itself.\n\nIn another sign of the shifting political winds in the region, Zimbabwe became the first African country to suspend all tariffs on goods originating in the US, just three days after the US imposed 18% tariffs on exports from Zimbabwe.\n\nIn the spirit of constructing a mutually beneficial and positive relationship with the United States of America, under the leadership of President Trump, I will direct the Zimbabwean government to implement a suspension of all tariffs levied on goods originating from the United States, wrote Mnangagwa on X.\n\nThis measure is intended to facilitate the expansion of American imports within the Zimbabwean market, while simultaneously promoting the growth of Zimbabwean exports destined for the United States.\n\nThis action underscores our commitment to a framework of equitable trade and enhanced bilateral cooperation.\n\nThe dropping of tariffs on US goods and paying out dispossessed white farmers is part of a charm offensive by Harare to unlock international financing and re-engage with international financial institutions like the International Monetary Fund and the World Bank.\n\nMixed reactions in Zimbabwe\n\nThe outreach to the Afrikaner business community, with representatives from sectors such as agriculture and energy, has drawn mixed reactions in Zimbabwe.\n\nSome, such as political analyst Alex Rungunda, see this as a rhetorical departure for Zanu-PF, which historically adopted a confrontational stance on land and race. However, it may also be a sign of desperation, he says, as the country urgently needs capital and goodwill.\n\nWar veterans and land reform activists were less accommodating of the softening stance on historical injustices.\n\nOn Zimbabwes dropping of tariffs on US goods, journalist Hopewell Chinono says the move is more political than economic. Perhaps the president believes this could serve as a sweetener for his removal from the Global Magnitsky Human Rights Accountability Act sanctions. A long shot though! hewroteon X.\n\nZimbabwe did not coordinate the move with its regional partners, whereas the EU will put forward its response to tariffs as a bloc.\n\nEconomically, it does not make much sense for Mnangagwa to prioritise appeasing the United States in this way  especially through unilateral concessions or alignments, given Zimbabwes trade realities and regional context, says Chinono.\n\nANC uncomfortable with all this\n\nAdvocate Simba Chitando, chair of the Zanu-PF Sandton branch, speaking in his private capacity, says many members of the ANC are uncomfortable with the bridges Zanu-PF is building with the West and with white farmers, which will lead to rapid economic growth.\n\nThey dont want Harare to reach its potential, because they believe Pretoria would be weaker, and black South Africans poorer than black Zimbabweans, he said.\n\nA fear that is at the root of xenophobia, and tensions between the two people.\n\nHowever, the world can no longer ignore the fact that Zimbabwe is on the rise while South Africa is on the decline.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>MoneyWeb A delegation from the Afrikaner business community received a warm welcome from Zimbabwean President Emmerson Mnangagwa last week in Harare’s State House, according to a Zanu-PF official contacted by Moneyweb. “Afrikaners are African,” reported TimesLive after the meeting, which was intended to rebuild regional integration and overcome past hostilities. “They are African. They live here.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afrikaner-business-delegation-welcomed-in-harare-as-zimbabwe-warms-to-washington/\">Afrikaner business delegation welcomed in Harare, as Zimbabwe warms to Washington</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Former Harare Mayor Manyenyeni cost the city US$20 million in revenue; due in court for corruption",
            "url": "https://www.newzimbabwe.com/former-harare-mayor-manyenyeni-cost-the-city-us20-million-in-revenue-due-in-court-for-corruption/",
            "content": "By StaffReporter\n\nFormer Harare Mayor Bernard Manyenyeni and ex-Acting Town Clerk Josephine Ncube are set to appear in court this Thursday following their arrest by the Zimbabwe Anti-Corruption Commission (Zacc) on corruption allegations.\n\nThe two are being charged with criminal abuse of duty.\n\nAllegations are that Manyenyeni and Ncube unlawfully amended a land development agreement between the City of Harare and Shelter Zimbabwe, costing the city an estimated $20 million in revenue, said Zacc in a statement\n\nIt is alleged that sometime in 2013, Harare City Council entered into an agreement authorising the development of 1 500 residential stands on 657 hectares in Tafara, Mabvuku, with Shelter Zimbabwe responsible for infrastructure.\n\nUnder the original terms, the Council was to allocate and sell the stands after servicing and reimburse Shelter Zimbabwe thereafter.\n\nHowever, in 2017, Ncube and Manyenveni altered the agreement and authorised Shelter Zimbabwe to sell unserviced stands.\n\nShelter Zimbabwe then sold the stands but failed to develop the land and remit the money to the local authority.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172253/Benard-Manyenyeni.jpg",
            "description": "<p>By Staff Reporter Former Harare Mayor Bernard Manyenyeni and ex-Acting Town Clerk Josephine Ncube are set to appear in court this Thursday following their arrest by the Zimbabwe Anti-Corruption Commission (Zacc) on corruption allegations. The two are being charged with criminal abuse of duty. “Allegations are that Manyenyeni and Ncube unlawfully amended a land development agreement</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-harare-mayor-manyenyeni-cost-the-city-us20-million-in-revenue-due-in-court-for-corruption/\">Former Harare Mayor Manyenyeni cost the city US$20 million in revenue; due in court for corruption</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Baccarat Academy: Why to Choose Baccarat.Wiki to Learn More About the Game?",
            "url": "https://www.newzimbabwe.com/baccarat-academy-why-to-choose-baccarat-wiki-to-learn-more-about-the-game/",
            "content": "Baccarat is a classic casino game that attracts millions of players worldwide. Its easy to learn but hard to master. Many enjoy the fast-paced and simple betting options, while others look for deeper strategies and smarter ways to win. Still, despite the games popularity, good learning resources are not always easy to find.\n\nSome websites only explain the rules, while others focus too much on gambling promotions. Players who want to improve their game often feel stuck. Thats why Baccarat.Wiki is worth your attention. Its a platform built for learningoffering clear guides, tools for practice, and a strong community of players who share your goal: to play baccarat better.\n\nBaccarat.Wiki is an educational website that focuses only on baccarat. Its free to use and created for players of all experience levels. If youre just starting, youll find basic tutorials that explain how the game works, what bets you can make, and what the odds are. If youve been playing for a while, there are strategy breakdowns, betting systems, and tools to test your approach.\n\nThe site doesnt ask you to sign up, and it doesnt push online casinos. This makes it different from other sites that often mix in gambling ads or try to sell expensive systems on Baccarat.Wiki, the main focus is knowledge.\n\nThe platform includes:\n\nIts a full academy for baccaratbuilt by people who understand the game and want to help others learn.\n\nThere are several reasons why Baccarat.Wiki is trusted by players. First, the information is presented clearly, without confusing terms or vague promises. Each strategy or tip is logically explained and supported by real math or practical testing.\n\nAlso, the site is kept up to date. Baccarat doesnt change much, but new strategies and betting styles always appear. The site often adds new tools or expands sections based on what players ask for.\n\nMost importantly, many peoplevisit Baccarat Wikibecause its focused only on baccarat. Youre not distracted by slots, roulette, or poker content. This means the site can go deeper into the game and cover topics other places skip.\n\nFor example, one article breaks down banker vs. player bets across thousands of hands, showing exact outcomes and house edges. Another explains why chasing a tie bet is usually bad, with stats and easy-to-read charts.\n\nTrust also comes from the lack of sales tactics. No flashy buttons trying to make you gamble, no secret winning systems. Just clear, honest content that teaches you how to play smarter.\n\nLearning about baccarat isnt enoughyou have actually to practice. Thats why Baccarat.Wiki has several tools that help you train and improve without risk. Here are some of the most useful features:\n\nThedemo baccaratsimulator is especially useful. You can test dozens of hands without spending any money. This way, you can learn how to deal with win/loss streaks, try flat betting, or experiment with patternsall in a safe environment.\n\nLets say youre trying a 1-3-2-4 system. Using the strategy tester, you can see if it holds up during long sessions. Suppose it doesnt adjust, and try again. This is how real improvement happensnot through guesswork but smart practice.\n\nOne of the most valuable things about Baccarat.Wiki is its active and growing community. Learning is faster and easier when youre part of a group of players with similar goals.\n\nTheBaccarat Wiki subredditis a great example. Players post questions, share their results, discuss tools, and help each other learn. Youll often find strategy debates, betting system reviews, or even people sharing their progress week by week.\n\nFor instance, a user recently shared how they avoided going on tilt by following a strict stop-loss rule, something they picked up from the sites bankroll section. Others replied with similar experiences, turning it into a mini-discussion that was both helpful and honest.\n\nBeing part of this community can keep you motivated and give you new ideas to try. You dont feel alone in your journeyand thats important when youre trying to improve a skill.\n\nIts one thing to read a guide. Its another to learn from people who have played hundreds or thousands of baccarat sessions and can explain what works.\n\nTheBaccarat Wiki on Quorais full of user-submitted questions, with answers from experienced players and contributors to the main site. These arent copy-paste responsestheyre detailed, direct, and based on real play.\n\nSample questions youll find:\n\nYou get honest, practical answersoften backed by testing or stats. This adds real-world value you cant always get from general gambling forums.\n\nYou can even ask your questions and get helpful responses in hours or days, depending on the topic. That level of interaction is rare and makes the learning process feel more personal.\n\nThere are other places where people go to learn baccaratYouTube channels, online forums, and paid strategy courses. But most of them have trade-offs. Lets compare:\n\nWhat makes Baccarat.Wiki is better because you dont have to guess. The tools are tested, the content is organized, and the advice comes from players whove already made the mistakes youre trying to avoid. Its like having a full baccarat classroombut youre in charge of how fast or slow you go.\n\nBaccarat.Wiki is a valuable resource for anyone looking to play baccarat with more confidence and understanding. It doesnt pressure you to gamble or sell you empty promisesit simply gives you the tools to learn and improve.\n\nIf youre new to the game, youll find clear explanations and free practice games that let you build skills without risk. If you already have experience, the site helps you go deeper by offering smart strategies, helpful calculators, and detailed analysis of your play. And for those who play regularly, it becomes a place to fine-tune methods, stay sharp, and connect with others who take the game seriously.\n\nNo matter your level, Baccarat.Wiki makes it easier to enjoy the game while learning something new every time you play.\n\n",
            "image_url": null,
            "description": "<p>Baccarat is a classic casino game that attracts millions of players worldwide. It’s easy to learn but hard to master. Many enjoy the fast-paced and simple betting options, while others look for deeper strategies and smarter ways to win. Still, despite the game’s popularity, good learning resources are not always easy to find. Some websites</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/baccarat-academy-why-to-choose-baccarat-wiki-to-learn-more-about-the-game/\">Baccarat Academy: Why to Choose Baccarat.Wiki to Learn More About the Game?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Potential new antibiotic for treating gonorrhoea",
            "url": "https://www.newzimbabwe.com/potential-new-antibiotic-for-treating-gonorrhoea/",
            "content": "BBC\n\nScientists believe they have found a new effective antibiotic for gonorrhoea, which could be one of the most promising in decades.\n\nGepotidacin can treat and clear the sexually transmitted infection just as well as existing antibiotics and appears to be able to tackle some emerging drug-resistant superbug strains too, say researchers inThe Lancet journal.\n\nThe work was funded by pharmaceutical company GSK which makes the new tablets.\n\nGonorrhoea is one of the most common STIs and cases have been rising.\n\nIn 2023, over 85,000 gonorrhoea diagnoses were reported in England alone  the highest number since records began in 1918.\n\nMost of the cases were treatable, but there isgrowing concernthat some strains cant be dealt with so easily.\n\nOver time, the bacterium has developed resistance to most classes of available antibiotics and experts fear it may become untreatable in the future, unless new drugs are found.\n\nUntreated gonorrhoea can lead to serious health issues, including pelvic inflammatory disease and infertility.\n\nGepotidacin works differently to other antibiotics and stops gonorrhoea from replicating by blocking two essential enzymes.\n\nIts already approved in the US for treating urinary tract infections.\n\nThe trial, being presented at the ESCMID conference, involved 628 patients randomly allocated to receive gepotidacin or an existing antibiotic.\n\nThe new pill was equally effective for treating gonorrhoea and worked against strains of the infection that were resistant to current first-line treatments, such as ceftriaxone.\n\nSide-effects were reported more frequently with gepotidacin, but they were generally mild, such as nausea or some stomach discomfort.\n\nGepotidacine is not the only new oral antibiotic for gonorrhoea that researchers are exploring.\n\nAnother, called zoliflodacin, has also shownpromise in phase 3 clinical trials.\n\nMeanwhile, the UK is consideringa vaccineto help stop the spread of gonorrhoea.\n\nIn November 2023, the Joint Committee on Vaccination and Immunisation (JCVI) recommended a targeted roll-out of the MenB vaccine.\n\nPrimarily designed to tackle Meningitis B in children, the JCVI found the treatment was roughly 40% effective at preventing people from contracting and spreading gonorrhoea.\n\nDr Katy Sinka, consultant epidemiologist and head of the STI section at UK Health Security Agency, said it was really promising to see a successful trial for a new antibiotic to treat gonorrhoea.\n\nAs gonorrhoea becomes increasingly resistant to antibiotics, it could become untreatable in future and cause serious problems like pelvic inflammatory disease and infertility. Trials like this are so important to help us discover new treatment options.\n\nShe said the best way to prevent an STI is by using a condom. If someone has had condom-less sex with a new or casual partner, they should get tested.\n\nEarly detection not only protects a persons health but prevents transmission to others. Testing is quick, free and confidential, she said.\n\nSource: NHS\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/15071638/130916164210-drug-resistant-bacteria-gonorrhoeae.webp",
            "description": "<p>BBC Scientists believe they have found a new effective antibiotic for gonorrhoea, which could be one of the most promising in decades. Gepotidacin can treat and clear the sexually transmitted infection just as well as existing antibiotics and appears to be able to tackle some emerging drug-resistant ‘superbug’ strains too, say researchers in The Lancet journal.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/potential-new-antibiotic-for-treating-gonorrhoea/\">Potential new antibiotic for treating gonorrhoea</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Gospel star Benjamin Dube parts ways with Spirit of Praise to focus on his calling",
            "url": "https://www.newzimbabwe.com/gospel-star-benjamin-dube-parts-ways-with-spirit-of-praise-to-focus-on-his-calling/",
            "content": "TshisaLive\n\nBenjamin Dube has parted ways with gospel group Spirit of Praise.\n\nThe singer and reverend, who has been the anchor of the group since its inception in 2008, took to his timeline on Monday to announce the news in an official statement.\n\nBenjamin said the decision was not easy but after prayer, reflection and conversations with key stakeholders he chose to walk away.\n\nThe decision was not made lightly as Spirit of Praise has been an important part of reverend Dubes ministry journey over the years. Through the platform, countless lives have been touched, worship has been elevated and the message of Christ has reached multitudes locally and globally. However, as seasons change, so do assignments, read the statement.\n\nReverend Dube believes the time has come to focus fully on the next phase of his calling, which includes expanding his personal ministry, mentoring the next generation of gospel artists and pursuing projects aligned with the unique mandate God has placed on his life.\n\nHe remains deeply and eternally grateful to Spirit Music Group, the Spirit of Praise team, and the owners of Spirit of Praise, Aubrey Peacock and Matthew Nkabinde, for the years of fruitful partnership, mutual respect and impactful ministry. Reverend Dube departs with nothing but love, honour and profound appreciation in his heart.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/07165700/benjamin-dube-lyrics-songs-video-gospellyricsng.png",
            "description": "<p>TshisaLive Benjamin Dube has parted ways with gospel group Spirit of Praise. The singer and reverend, who has been the anchor of the group since its inception in 2008, took to his timeline on Monday to announce the news in an official statement. Benjamin said the decision was not easy but after prayer, reflection and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gospel-star-benjamin-dube-parts-ways-with-spirit-of-praise-to-focus-on-his-calling/\">Gospel star Benjamin Dube parts ways with Spirit of Praise to focus on his calling</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "Ghana orders foreigners to exit gold market by April 30",
            "url": "https://www.newzimbabwe.com/ghana-orders-foreigners-to-exit-gold-market-by-april-30/",
            "content": "Reuters\n\nGhana has ordered foreigners to exit its gold trading market by the end of the month, a new government body said on Monday, as the West African country looks to streamline gold purchases from small-scale miners, increase earnings and reduce smuggling.\n\nAfricas leading gold producer is shifting away from a system in which local and foreign companies with export licences can buy and export gold from artisanal or small-scale mining.\n\nUnder the new system, the newly created gold board known as GoldBod is the only entity allowed to buy, sell, assay and export artisanal gold, Mondays statement said, and older licences have ceased to be valid.\n\nForeigners must leave the local gold trading market by April 30 though they can apply to buy or take-off gold directly from the GoldBod, the statement said.\n\nFinance minister Cassiel Ato Forson said in January the creation of GoldBod would allow Ghana to benefit more from gold sales while maintaining the national currencys stability.\n\nGhanas gold exports grew by 53.2% in 2024 to $11.6bn (R218,6bn), of which nearly $5bn (R94.2bn) was from legal small-scale miners.\n\nGold prices vaulted on Friday over the $3,200 (R60,330) per ounce mark for the first time.\n\nThe trade war between the US and China has rattled global markets and driven investors into gold, which is traditionally viewed as a hedge against geopolitical and economic uncertainty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/12155643/Gold-e1622992406237.jpg",
            "description": "<p>Reuters Ghana has ordered foreigners to exit its gold trading market by the end of the month, a new government body said on Monday, as the West African country looks to streamline gold purchases from small-scale miners, increase earnings and reduce smuggling. Africa’s leading gold producer is shifting away from a system in which local</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ghana-orders-foreigners-to-exit-gold-market-by-april-30/\">Ghana orders foreigners to exit gold market by April 30</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        },
        {
            "title": "NRZ train catches fire while transporting coal to Zambia",
            "url": "https://www.newzimbabwe.com/nrz-train-catches-fire-while-transporting-coal-to-zambia/",
            "content": "By Staff Reporter\n\nA National Railways of Zimbabwe (NRZ) train caught fire on Monday after its fuel tanks exploded.\n\nThe locomotive was transporting export coal to Zambia when the incident occurred between Kalala and Matetsi sidings in Hwange District.\n\nIn a statement, the NRZ said its crew members escaped unharmed.\n\nInvestigations are underway to ascertain the cause of the fire.\n\nOur crews managed to escape unhurt. The incident took place between Kalala Matetsi sidings when the locomotives fuel tanks exploded. The load was not affected. A rescue train with crews was quickly sent to the site and they managed to extinguish the fire. Investigations are already underway to establish the cause of the fire and the amount of damage to the locomotive, reads NRZs statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/28193158/NRZ.jpg",
            "description": "<p>By Staff Reporter A National Railways of Zimbabwe (NRZ) train caught fire on Monday after its fuel tanks exploded. The locomotive was transporting export coal to Zambia when the incident occurred between Kalala and Matetsi sidings in Hwange District. In a statement, the NRZ said its crew members escaped unharmed. Investigations are underway to ascertain</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nrz-train-catches-fire-while-transporting-coal-to-zambia/\">NRZ train catches fire while transporting coal to Zambia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "16 Apr 2025"
        }
    ]
}