{
    "news": [
        {
            "title": "“Circuit breaker supplying load tripped” – Parliament in damage control after blackout during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/circuit-breaker-supplying-load-tripped-parliament-in-damage-control-after-blackout-during-mnangagwas-sona/",
            "content": "By Anna Chibamu\n\nPreliminary investigations have revealed that a circuit breaker supplying the load tripped, causing a power outage at the new Parliament Building during President Emmerson Mnangagwas State of the Nation Address (SONA), Parliamenthas said.\n\nThe unexpected blackout forced Mnangagwa to complete his address using torchlight before electricity was restored approximately ten minutes later.\n\nThis is the second power outage to occur at the Parliament Building in Mnangagwas presence. The first incident took place during Finance Minister Mthuli Ncubes 2025 National Budget Presentation in November last year, which the Zimbabwe Electricity Supply Authority (ZESA) attributed to natural causes.\n\nDespite prior arrangements to ensure backup power, the latest blackout still occurred, prompting Speaker of Parliament Jacob Mudenda to hint at possible sabotage.\n\nMudenda warned that the culprit will regret the day of their existence.\n\nNow in damage control mode, Clerk of Parliament Kennedy Chokuda released a statement explainingthe technical cause of the outage.\n\nThe loss of power supply to key systems occurred when the Parliament Building was running on a generator as the main source of supply, with ZESA power as a standby. When supplies were lost, the generator was still running but not supplying power.\n\nPreliminary investigations indicate that a circuit breaker supplying the load had tripped. The restoration took longer than expected, resulting in part of the SONA being delivered without power, Chokuda said.\n\nParliament said it is working with the Ministry of Local Government, ZESA, and other relevant government agencies to investigate the incident. The findings will be made public once investigations are complete, and measures will be put in place to prevent a recurrence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>By Anna Chibamu Preliminary investigations have revealed that a circuit breaker supplying the load tripped, causing a power outage at the new Parliament Building during President Emmerson Mnangagwa’s State of the Nation Address (SONA), Parliament has said. The unexpected blackout forced Mnangagwa to complete his address using torchlight before electricity was restored approximately ten minutes later.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/circuit-breaker-supplying-load-tripped-parliament-in-damage-control-after-blackout-during-mnangagwas-sona/\">“Circuit breaker supplying load tripped” – Parliament in damage control after blackout during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Oct 2025"
        },
        {
            "title": "Cameroon opposition leader to face legal action over election unrest, government says",
            "url": "https://www.newzimbabwe.com/cameroon-opposition-leader-to-face-legal-action-over-election-unrest-government-says/",
            "content": "BBC\n\nCameroons Interior Minister Paul Atanga Nji says opposition leader Issa Tchiroma Bakary will face legal action over allegations he incited violent post-election demonstrations.\n\nAt least four protesters have been killed during clashes between security forces and opposition supporters since Cameroons election on 12 October, with92-year-old President Paul Biyawinning an eighth consecutive term.\n\nTchiroma Bakary insists he won the election, a claim dismissed by Biyas ruling party, the Cameroon Peoples Democratic Movement (CPDM).\n\nViolent crackdowns by police and security officers on protesters have alarmed the international community, with the UN, African Union and EU calling for restraint.\n\nOn Tuesday, Nji accused Tchiroma Bakary of organising what he said were illegal protests leading to the loss of lives, and also criticised him for declaring victory in the election.\n\nHe added that Tchiroma Bakarys accomplices responsible for an insurrectionary plan will also face legal action.\n\nPaul Biya, who came to power in 1982 and is now the worlds oldest head of state, won the 12 October election with 53.7% of the vote, compared to 35.2% for Tchiroma Bakary, according to Cameroons Constitutional Council.\n\nTchiroma Bakary is yet to respond to the governments decision to try him, but he had previously told the BBC thathe would not accept a stolen vote and that he was not afraid of being arrested.\n\nOn election result day, he said armed men opened fire on protesters assembled near his residence in Garoua, fatally wounding at least two civilians.\n\nOn Tuesday, the interior minister revealed that an investigation would be launched into violent incidents before and after the announcement of the election results.\n\nDuring these attacks, some of the criminals lost their lives, he said, without providing a specific number of protesters who have been killed in the clashes.\n\nNji added that several members of the security forces also sustained serious injuries.\n\nAlthough Nji insisted the situation nationwide was now under control, protesters remain active in some parts of the country, especially in Douala and Garoua, where demonstrators mounted roadblocks on Tuesday, and burnt tyres on the streets.\n\nAnalysts warn the post-electoral violence could plunge the country into a political crisis.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29045337/AFP-via-Getty-Images-Many-in-Cameroon-are-furious-that-Paul-Biya-has-won-an-eighth-term-as-president.webp",
            "description": "<p>BBC Cameroon’s Interior Minister Paul Atanga Nji says opposition leader Issa Tchiroma Bakary will face legal action over allegations he incited “violent post-election demonstrations”. At least four protesters have been killed during clashes between security forces and opposition supporters since Cameroon’s election on 12 October, with 92-year-old President Paul Biya winning an eighth consecutive term. Tchiroma Bakary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cameroon-opposition-leader-to-face-legal-action-over-election-unrest-government-says/\">Cameroon opposition leader to face legal action over election unrest, government says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mnangagwa hails tight policy impact on ZWG stability, inflation",
            "url": "https://www.newzimbabwe.com/mnangagwa-hails-tight-policy-impact-on-zwg-stability-inflation/",
            "content": "By Alois Vinga\n\nPresident Emmerson Mnangagwa on Tuesday praised the Reserve Bank of Zimbabwes (RBZ) tight monetary policy stance, describing it as favourable for sustaining economic activity and maintaining stability in the economy.\n\nSince taking over as RBZ Governor last year, Dr. John Mushayavanhu has implemented a restrictive monetary policy aimed at anchoring price, currency, and exchange rate stability. The approach involves maintaining a high bank policy rate, currently at 35%,to curb speculative borrowing, which has been a major driver of excess liquidity and illicit parallel market activity.\n\nOther measures, such as elevated reserve requirements, have also been introduced to control inflation while supporting long-term economic growth.\n\nAs a result, the policy has helped sustain the ZWG currency, which has enjoyed nearly a year of relative stability, encouraging broader acceptance and usage.\n\nPresenting the State of the Nation Address (SONA), Mnangagwa credited the RBZs monetary discipline for fostering a favourable economic environment.\n\nThe tight monetary and fiscal environment in the economy has remained favourable to support sustained economic activity. My Government is diligently implementing the necessary policies, measures, and initiatives to maintain the stability of the ZWG and inflation, he said.\n\nThe President added that the ongoing trend of macroeconomic stability is expected to become a permanent feature of Zimbabwes economy.\n\nHe also highlighted significant progress in the countrys foreign currency generation capacity.\n\nInflows stood at US$10.4 billion as of August 2025, an increase of 26.8% from the US$8.3 billion recorded during the same period in 2024. Consequently, foreign currency reserves rose to about US$900 million by the end of September 2025, up from US$700 million in June 2025.\n\nIn recognition of this progress, the World Bank recently ranked Zimbabwe first among the top 10 countries globally that have made significant gains in foreign currency reserve accumulation. On the fiscal front, I am pleased to advise that we remain steadfast in strengthening sustainable resource mobilisation strategies to ensure the continued provision of public services, Mnangagwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga President Emmerson Mnangagwa on Tuesday praised the Reserve Bank of Zimbabwe’s (RBZ) tight monetary policy stance, describing it as favourable for sustaining economic activity and maintaining stability in the economy. Since taking over as RBZ Governor last year, Dr. John Mushayavanhu has implemented a restrictive monetary policy aimed at anchoring price, currency,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-hails-tight-policy-impact-on-zwg-stability-inflation/\">Mnangagwa hails tight policy impact on ZWG stability, inflation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Oct 2025"
        },
        {
            "title": "It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa",
            "url": "https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/",
            "content": " claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga\n\nBy Leopold Munhende\n\nZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed.\n\nSpeaking to journalist Violet Gonda, Mliswa likened Tagwireis fast-track promotion to opposition leader Nelson Chamisa, describing it in similar terms that were used when the latter took over after the passing of pro-democracy icon Morgan Tsvangirai a generational consensus.\n\nAn ongoing factional fight within Zanu PF has pitted President Emmerson Mnangagwas deputy, Constantino Chiwenga with Tagwirei.\n\nThe two are in a race to succeed Mnangagwa, either in 2028 or beyond, if his term is illegally extended as is being rallied for by sections in the party.\n\nThat Tagwirei has become a strong contender is no longer secret, even hardline critics of the businessman such as Zanu PF spokesperson Christopher Mutsvangwa, have changed their stance.\n\nMliswa said it was time senior party members allowed younger members to take over.\n\nIt is a generational consensus just like when we had national consensus in making sure that people marched (in 2017). It is the generational consensus that Tagwirei must make it because he is young, said Mliswa.\n\nWe have given our liberators time to liberate us from an economic point of view but they have not done what we expected them to do, they have done their best but it is about time that we took over.\n\nWe do not have liberation history but we have economic ability to be able to transform the country and equally transform its fortunes.\n\nMliswa, who was fired from Zanu PF in 2015, has emerged as one of Tagwireis fervent supporters, frequently laying into Chiwenga.\n\nChiwenga is pushing for Tagwireis arrest on a string of corruption allegations. His attempts to get the partys stamp, however, fell by the wayside as he was advised to report all of the alleged graft to Zimbabwe Anti-Corruption Commission (ZACC) or the police.\n\nTagwireis meteoric rise is being supported by claims that he financed the 2017 coup that toppled late leader Robert Mugabe and governments agriculture programme, Command Agriculture.\n\nAdded Mliswa: It is a generational consensus which you cannot stop.\n\nThat is the reason why the opposition moved from the late Morgan Tsvangirai to Nelson Chamisa. Now Zanu PF has moved to Tagwirei.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>–  claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga By Leopold Munhende ZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed. Speaking to journalist Violet Gonda, Mliswa likened Tagwirei’s fast-track promotion to opposition leader Nelson Chamisa, describing it in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/\">It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Oct 2025"
        },
        {
            "title": "Chipezeze the hero as Magesi falls to Orlando Pirates",
            "url": "https://www.newzimbabwe.com/chipezeze-the-hero-as-magesi-falls-to-orlando-pirates/",
            "content": "By Sports Reporter\n\nWarriors goalkeeper Elvis Chipezeze was the standout performer for Magesi FC on Tuesday evening, earning the Man of the Match award despite his teams 2-1 loss to Orlando Pirates in the Carling Knockout Tournament quarter-finals.\n\nThe defeat saw Magesi crash out of the competition, ending their hopes of defending the title they won last year.\n\nAlthough his side lost, Chipezeze kept Magesi in contention throughout the first half, pulling off several crucial saves to deny Pirates at least three clear chances, ensuring the match remained goalless at halftime.\n\nThe Zimbabwean shot-stopper was eventually beaten five minutes into the second half by Thapelo Morena, who fired a powerful long-range strike to give Pirates the lead.\n\nChipezeze continued to frustrate the Buccaneers, producing another stunning save in the 60th minute to keep his team in the game. However, Pirates eventually doubled their lead in the 87th minute through Evidence Makgopa to make it 2-0.\n\nMagesi managed to pull one back in stoppage time, but it was too late to change the outcome.\n\nAfter the match, Chipezeze was voted Man of the Match and walked away with R100,000 in prize money.\n\nTuesdays accolade marks his second Man of the Match award this season in the tournament, and his sixth overall, including last seasons campaign.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28193935/chipezeze.jpeg",
            "description": "<p>By Sports Reporter Warriors goalkeeper Elvis Chipezeze was the standout performer for Magesi FC on Tuesday evening, earning the Man of the Match award despite his team’s 2-1 loss to Orlando Pirates in the Carling Knockout Tournament quarter-finals. The defeat saw Magesi crash out of the competition, ending their hopes of defending the title they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chipezeze-the-hero-as-magesi-falls-to-orlando-pirates/\">Chipezeze the hero as Magesi falls to Orlando Pirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mnangagwa warns foreign investors over pollution, labour abuses",
            "url": "https://www.newzimbabwe.com/mnangagwa-warns-foreign-investors-over-pollution-labour-abuses/",
            "content": "By Anna Chibamu\n\nPresident Emmerson Mnangagwa has issued a stern warning to foreign investors, particularly those in the mining sector, adding that government is finalising measures to hold polluters and labour rights violators accountable.\n\nDelivering his State of the Nation Address (SONA) at the new Parliament Building in Mt Hampden on Tuesday, Mnangagwa said authorities will no longer tolerate companies that exploit workers or degrade the environment.\n\nWe expect that they will adhere to the Constitution and laws of our country while respecting our people and our culture, Mnangagwa said.\n\nHis remarks come amid growing public outrage over the conduct of some foreign-owned mining firms, especially from China, accused of flouting labour laws, underpaying local workers, and causing extensive environmental damage.\n\nIn recent years, Zimbabwes investment drive has drawn criticism from communities who say many investors operate with impunity, polluting rivers, creating unsafe working conditions, and offering little benefit to surrounding areas.\n\nMnangagwas warning signals mounting government pressure on errant investors amid increasing calls for tighter regulation and enforcement in the mining sector, a key pillar of Zimbabwes struggling economy.\n\nMeanwhile, the President said the long-awaited Mines and Minerals Amendment Bill should be completed during the third session of the 10th Parliament.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164746/Mnangagwa-SONA.jpg",
            "description": "<p>By Anna Chibamu President Emmerson Mnangagwa has issued a stern warning to foreign investors, particularly those in the mining sector, adding that government is finalising measures to hold polluters and labour rights violators accountable. Delivering his State of the Nation Address (SONA) at the new Parliament Building in Mt Hampden on Tuesday, Mnangagwa said authorities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-warns-foreign-investors-over-pollution-labour-abuses/\">Mnangagwa warns foreign investors over pollution, labour abuses</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Oct 2025"
        }
    ]
}