{
    "news": [
        {
            "title": "Why is Zimbabwe’s President Mnangagwa facing pressure to resign?",
            "url": "https://www.newzimbabwe.com/why-is-zimbabwes-president-mnangagwa-facing-pressure-to-resign/",
            "content": "Al Jazeera\n\nZimbabwean President Emmerson Mnangagwa is facing what experts say is the biggest threat to his rule yet as a succession battle erupts ahead of general elections scheduled for 2028.\n\nRecent manoeuvrings by the president and his supporters to extend his rule to 2030 have led to calls andprotestsfrom within his party for the president to step down or be forced to do so. The upheavals have seen the dismissal of top security officials, a move experts say Mnangagwa is taking to avoid being overthrown in a coup.\n\nThe president has long faced criticism from Zimbabweans, but dissent within his ZANU-PF party is rare, and public calls for demonstrations against him are unprecedented. On Monday, demonstrators took to the streets in protests called by a top ZANU-PF member.\n\nZimbabwe has for decades been mired in political crises that have led toeconomic stagnation, a dearth of jobs, and general government dysfunction. Hyperinflation over the past two decades has pushed the South African countrys economy to its knees and wiped out the savings of common people.\n\nZimbabweans are tired and need a messiah, Blessing Vava, director of human rights group Crisis Zimbabwe, told Al Jazeera.\n\nHeres what to know about the latest crisis:\n\nAn internal split within the ruling ZANU-PF party, which has held power since Zimbabwes independence in 1980, is driving the current crisis.\n\nTwo main factions are at loggerheads, one supporting a prolonged term for Mnangagwa, 82, and another one supporting the ascendancy of Constantino Chiwenga, his 68-year-old vice president.\n\nMnangagwa came to power in 2017 amid promises of democratic and economic reforms. However, critics say corruption levels have remained high, the opposition has beentargeted, and the economy has continued to slide.\n\nZimbabwes constitution has a two-term limit for presidents. Mnangagwa is currently in his second elected term, which ends in 2028 when elections are due.\n\nHowever, some members of the ZANU-PF party have been chanting a 2030 agenda since last year, saying the president should stay in power for a third term to continue his reforms, although that would violate the constitution.\n\nAt a conference in December, the party officially adopted a motion to extend Mnangagwas rule till 2030. Thats subject to the approval of the Senate and a national referendum, but the motion has prompted nationwide debate and controversy.\n\nWithin ZANU-PF, a dissenting faction led by Blessed Bombshell Geza, a liberation war veteran and senior party member, has since held conferences to speak out against Mnangagwa. He has accused the government of being corrupt and called on people to protest. In one video published on social media, he regretted supporting the presidents rise to power.\n\nAs soon as he [Mnangagwa] had the taste of power, he escalated corruption, forgot the people, and only remembered his family, Geza said. The politician said Mnangagwa would be forced out and accused him of surrendering power to his wife and kids, who he said are powerful behind-the-scene actors in the presidents third term bid.\n\nFirst Lady Auxillia Mnangagwa, alongside her husband and several other government officials,were sanctioned by the United Statesin March 2024 for alleged involvement in illicit diamond and gold networks. In 2023, an Al Jazeera investigation revealed that Zimbabwean officials were usingsmuggling gangsto sell the countrys gold to soften the impact of sanctions.\n\nHowever, Gezas critics point out that he, too, is part of the establishment that has long controlled Zimbabwe. Analyst Takura Zhangazha told Al Jazeera that Gezas opposition is gaining broader traction only because it comes at a time when the countrys national economy is also struggling  which Zimbabweans blame on the ruling government. Any support that Gezas calls for Mnangagwa to resign gets is not because people believe he will fight for them, he added.\n\nMr Geza is representative of [the government] in the public eye, Zhangazha said. So he does not have an organic or popular authenticity.\n\nZANU-PF officials, as well as Mnangagwa, have called Gezas taunts treasonous. The politician, who has now reportedly gone into hiding, was ousted from the party on March 7. He is wanted by the police on several charges, including undermining the authority of the president and for allegedly inciting public violence.\n\nMeanwhile, Mnangagwa has shuffled the countrys national security leadership. General Anselem Sanyatwe, commander of the presidential guard, was fired last week. Earlier, Godwin Matanga, chief of police, and Isaac Moyo, head of the intelligence service, were dismissed.\n\nGeza had, in recent weeks, called for mass demonstrations this week against President Mnangagwa. By Friday, security officials had poured onto the streets, conducting stop-and-search on vehicles in the capital, Harare.\n\nOn Monday, some demonstrators gathered at the citys Robert Mugabe Square, even as social media videos showed armoured tanks rolling down the streets as security was beefed up.\n\nMost people, however, chose to stay at home to avoid potential violence. Businesses and offices were completely shut down across the country, as a result, although authorities had urged people to go to work. Vava, of Crisis Zimbabwe, said many Zimbabweans are fed up with ZANU PFs power struggles, but that they had protested in their way.\n\nZimbabweans feel cheated, and they dont want to be used again, Vava said. But the shutdown was also a success. By choosing to stay at home, what we saw was also Zimbabweans demonstrating, saying that we dont want to be dragged into your internal battles.\n\nMeanwhile, those who gathered were forcefully dispersed with tear gas. Police also arrested dozens of others. On Tuesday, officials said they had arrested 95 protesters on charges of public violence and breaches of peace. Officials said some people were arrested at the site of the demonstrations, while others were picked up because of their social media posts.\n\nState-owned newspapers, such as the Zimbabwe Herald, reported that the protests were a failure. Reacting to the low numbers, government spokesperson Farai Muroiwa Marapira said in a post on X that the demonstrators were put to shame.\n\nTo many, the current crisis is reminiscent of the fall of the lateRobert Mugabe, who held onto power for 37 years before being deposed in a coup in 2017.\n\nMugabe, who was forced out at the age of 93, led the countrys fight for independence. However, his subsequent rule was characterised by the repression of opposition members, election rigging, corruption and economic stagnancy. He refused to give up the presidency for decades.\n\nMnangagwa was a longtime ally of Mugabe and served as defence minister and then vice president in the final years of Mugabes rule. He had close ties to the military.\n\nHowever, the two men fell out over who would succeed Mugabe: Mnangwaga was backed by the army on the one hand, while Mugabe wanted to hand over to his wife Grace Mugabe on the other.\n\nOn November 6, 2017, Mugabe dismissed Mnangagwa, triggering the beginning of his downfall. A week later, the armed forcesseized control, and Mnangagwa took power.\n\nNow, the president, too, appears caught in the same spiral. Although he had once promised to hand over power to Vice President Chiwenga, who was a major player in the Mugabe coup, Mnangagwa has since changed his tune, analysts say.\n\nChiwenga, who Geza claims to be speaking for, has not publicly stated his desire to run for president or spoken out against Mnangagwa.\n\nMnangagwa is unlikely to be successful in prolonging his rule because of a citizenry fed up with political machinations and because of the deep internal splits in ZANU-PF, Vava told Al Jazeera.\n\nPeople dont want the 2030 agenda, he said. It will be a battle for survival for Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>Al Jazeera Zimbabwean President Emmerson Mnangagwa is facing what experts say is the biggest threat to his rule yet as a succession battle erupts ahead of general elections scheduled for 2028. Recent manoeuvrings by the president and his supporters to extend his rule to 2030 have led to calls and protests from within his party for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-is-zimbabwes-president-mnangagwa-facing-pressure-to-resign/\">Why is Zimbabwe’s President Mnangagwa facing pressure to resign?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "South Korea’s President Yoon removed from office over martial law decree",
            "url": "https://www.newzimbabwe.com/south-koreas-president-yoon-removed-from-office-over-martial-law-decree/",
            "content": "Al Jazeera\n\nSouth Koreas Constitutional Court has unanimously voted to remove President Yoon Suk-yeol over his declaration of martial law late last year.\n\nAs he read the verdict in court on Friday morning, acting chief justice Moon Hyung-bae dismissed each of Yoons reasons for declaring martial law and said the president had overstepped his authority by deploying troops on the streets of the capital in December.\n\nThe defendant mobilised military and police forces to dismantle the authority of constitutional institutions and infringed upon the fundamental rights of the people. In doing so, he abandoned his constitutional duty to uphold the constitution and gravely betrayed the trust of the Korean people, Moon said.\n\nSuch unlawful and unconstitutional conduct constitutes an act that cannot be tolerated under the constitution, the justice continued.\n\nThe negative consequences and ripple effects of these actions are substantial, and the benefit of restoring constitutional order through removal from office outweighs the national costs associated with the dismissal of a sitting president, he said.\n\nThe opposition Democratic Party described the verdict as a peoples victory, while Yoons ruling People Power Party said it humbly accepts the courts ruling, according to South Korean official Yonhap News Agency.\n\nYoon claimed at the time that anti-state and North Korean forces had infiltrated the government, butsenior military and police officials who were sent to shut down the countrys National Assembly have testified that he ordered them to detain rival politicians and prevent the assembly from voting to lift his military rule order.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/04065527/yoon.webp",
            "description": "<p>Al Jazeera South Korea’s Constitutional Court has unanimously voted to remove President Yoon Suk-yeol over his declaration of martial law late last year. As he read the verdict in court on Friday morning, acting chief justice Moon Hyung-bae dismissed each of Yoon’s reasons for declaring martial law and said the president had overstepped his authority</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-koreas-president-yoon-removed-from-office-over-martial-law-decree/\">South Korea’s President Yoon removed from office over martial law decree</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "Chipezeze scoops South Africa’s PSL Player of the Month",
            "url": "https://www.newzimbabwe.com/chipezeze-scoops-south-africas-psl-player-of-the-month/",
            "content": "By Sports Reporter\n\nZimbabwe international goalkeeper Elvis Chipezeze has scooped South Africas Betway Premiership Player of the Month, March.\n\nChipezeze managed 4 cleansheets in four matches in March, thebest by any goalkeeper in the league during the period.\n\nChipezezes saves have been key for Magesi FC, which is bidding to survive in the Betway Premiership.\n\nChipezeze, Magesi FCs goalkeeper, secured the Player of the Month award for an impressive four clean sheets in four matches in the month of March and has been a key figure as the last line of defence.\n\nThe Zimbabwean internationals acrobatic saves and composure in goals have been instrumental in his sides recent improvement on the Betway Premiership table, with only one goal concession against Kaizer Chiefs in a narrow 1-0 defeat away from home, announced South Africas PSL.\n\nChipezeze emerged victorious against equally strong competition from recently promoted Orlando Pirates defender, Mbekezeli Mbokazi, as well as Mamelodi Sundowns midfielder, Jayden Adams..\n\nOther than Chipezeze, Magesi FCs coach Owen Da Gama was also scooped an award as he was voted PSLs Coach of the Month for March.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14051412/Elvis-Chipezeze.jpg",
            "description": "<p>By Sports Reporter Zimbabwe international goalkeeper Elvis Chipezeze has scooped South Africa’s Betway Premiership Player of the Month, March. Chipezeze managed 4 cleansheets in four matches in March, the best by any goalkeeper in the league during the period. Chipezeze’s saves have been key for Magesi FC, which is bidding to survive in the Betway Premiership.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chipezeze-scoops-south-africas-psl-player-of-the-month/\">Chipezeze scoops South Africa’s PSL Player of the Month</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "ANSA awards a boost for Sables now eyeing second Rugby Africa Cup",
            "url": "https://www.newzimbabwe.com/ansa-awards-a-boost-for-sables-now-eyeing-second-rugby-africa-cup/",
            "content": "By Sports Reporter\n\nAfter winning the 2024 National Team Coach of The Year at the Annual National Sports Award (ANSA), Zimbabwe senior mens rugby team coach Piet Benade is dreaming big.\n\nThe ANSA awards are held annually by the Sports and Recreation Commission to honour Zimbabwes top sports performers.\n\nSundays awards, which were graced by the new Minister of Sports Anselem Sanyatwe, saw the Sables winning the team of the year award and their coach Piet Benade collecting the coach of the year accolade.\n\nThe Sables were honoured for winning the Rugby Africa Cup last year in Uganda, ending a 12-year jinx.\n\nFor Benade, his individual recognition is a big boost for him, hence he is now eyeing to retain the Africa Cup.\n\nBeing nominated was enough of an honor, and then winning it was just amazing that our sport was being put in the spotlight in such a positive way.\n\nThe goal now would be to continue helping the local boys reach their potential on the field and then, of course, creating a culture of success.\n\nWinning a second Africa Cup in 2 years and achieving World Cup qualification would be very special, Benade told NewZimbabwe.com.\n\nIf the Sables win this years Rugby Africa Cup, they will automatically qualify for the 2027 Rugby World Cup , ending a 33-year jinx.\n\nSince his appointment in March last year, Benade has yet to lose a match in charge of the Sables.\n\nThe former Sables player helped the team to win its first match in history last year during the UAE-South Korea tour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/04063829/487331623_18270456649252621_6417825791917050684_n.jpg",
            "description": "<p>By Sports Reporter After winning the 2024 National Team Coach of The Year at the Annual National Sports Award (ANSA), Zimbabwe senior men’s rugby team coach Piet Benade is dreaming big. The ANSA awards are held annually by the Sports and Recreation Commission to honour Zimbabwe’s top sports performers. Sunday’s awards, which were graced by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ansa-awards-a-boost-for-sables-now-eyeing-second-rugby-africa-cup/\">ANSA awards a boost for Sables now eyeing second Rugby Africa Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "Kanye West hints at marital troubles in new song ‘Bianca’",
            "url": "https://www.newzimbabwe.com/kanye-west-hints-at-marital-troubles-in-new-song-bianca/",
            "content": "By Bang Showbiz\n\nKanye Westhas suggested his wife has left him in the lyrics to a new song.\n\nThe Stronger hitmaker marriedBianca Censoriin a private ceremony in December 2023 but the words of new track Bianca claim she has walked out on him over his controversial anti-Semitic social media rants but not before she sought to have him committed.\n\nIn lyrics published to Genius and previews during a livestream by DJ Akademiks this week, West raps in Bianca: My baby she ran away.\n\nBut first she tried to get me committed / Not going to the hospital cause I am not sick I just do not get it.\n\nShes having a panic attack and she is not liking the way that I tweeted / Until Biancas back I stay up all night Im not going to sleep / I really dont know where shes at.\n\nThe song  which is from the 47-year-old rappers forthcoming album WW3  comes almost two weeks after West sparked rumours of problems in his marriage with a cryptic message about having his heart broken.\n\nHe wrote on X in part: When you look at that betrayal list I realized I was just a part of peoples strategies. I took the word love to mean love when it really meant I love the opportunity.\n\nI make decisions from my heart and mind. So when my heart is broken it breaks my mind too. Thats why I drank Henny to go to the awards that night. Just too many slaps in in the face.\n\nThe message was accompanied with a screenshot of a redacted text exchange, in which he said he would sign something and didnt care about the terms proposed.\n\nHe also seemingly texted: Just like to see people fulfill their dreams so they can s*** on me later.\n\nWest  who has children North, 11, Saint, nine, Chicago, seven, and five-year-old Psalm with ex-wifeKim Kardashian and Bianca have also unfollowed one another on Instagram.\n\nHowever, in February, the rappers representative denied the couple had split.\n\nMilo Yiannopoulos told The Hollywood Reporter: Ye and Bianca are in Los Angeles, about to enjoy Valentines Day together.\n\nAnnouncements about their private life will come from them directly, not unsourced rumour in the tabloid press.\n\nIs this the fifth or is it the sixth time the press has wrongly reported that Ye and Bianca are separating? Ive lost track.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/08094904/kanye-bianca.webp",
            "description": "<p>By Bang Showbiz Kanye West has suggested his wife has left him in the lyrics to a new song. The “Stronger” hitmaker married Bianca Censori in a private ceremony in December 2023 but the words of new track “Bianca” claim she has walked out on him over his controversial anti-Semitic social media rants but not before she</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kanye-west-hints-at-marital-troubles-in-new-song-bianca/\">Kanye West hints at marital troubles in new song ‘Bianca’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "Mutoko RDC threatens legal action against errant mining companies",
            "url": "https://www.newzimbabwe.com/mutoko-rdc-threatens-legal-action-against-errant-mining-companies/",
            "content": "By Alois Vinga\n\nTHE Mutoko Rural District Council has vowed to take legal action against mining companies which are not remitting dues as part of efforts to step up compliance in the mining town.\n\nThis follows revelations that mining companies operating in the community are owing the local authority money running into millions of dollars in unpaid taxes. In turn, the council is failing to fund critical services.\n\nSpeaking to stakeholders during the Road Rehabilitation and Other Development Projects Stakeholders Meeting in Mutoko recently, Mutoko Rural District Council CEO, Biriat Tasarira, said after exhausting all possible avenues, taking the legal route was the only way out.\n\nSome of the mining companies are not religiously paying taxes due to the local authorities. A situation where some of the companies are up to date while others are not is presenting challenges. Despite numerous follow-ups. You still find that we cant get data on production returns timeously from these companies.\n\nInasmuch as we are persuading them to pay, we are now forced to take action. All the companies that are not paying dues will be taken for litigation through our lawyers. Some of the companies have become so reluctant that they are not even coming up with any payment plans, he said.\n\nHe said the same companies which are not paying taxes are the ones which are found wanting when it comes to producing data on their production returns.\n\nTasarira also committed the Mutoko Rural District Council to work with other key stakeholders in the area in tracking Corporate Social Responsibility projects in the area in a bid to make sure that the companies in the locality are implementing meaningful activities.\n\nThe impending convergence of stakeholders comes after efforts invested by stakeholders such as Silveira House, which has implemented projects aimed at uniting miners, communities and government departments to identify and mitigate Environmental, Social and Governance (ESG) risks associated with the extraction of critical minerals in the targeted districts.\n\nThe flagship of such projects has empowered communities, enabling them to actively participate in advocacy for their environmental, economic, social, and cultural rights.\n\nThe companies go for half a decade giving a report that they are working on a certain project, which will never be completed. The local authority will have to organize meetings with councilors of the particular wards where the activities are taking place in order to appreciate the CSR activities under implementation.\n\nFor instance, building a classroom block should not last for five years. These meetings will go a long way to tracking progress, added Tasarira.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/04061007/Mutoko-RDC-CEO-scaled.jpg",
            "description": "<p>By Alois Vinga THE Mutoko Rural District Council has vowed to take legal action against mining companies which are not remitting dues as part of efforts to step up compliance in the mining town. This follows revelations that mining companies operating in the community are owing the local authority money running into millions of dollars</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutoko-rdc-threatens-legal-action-against-errant-mining-companies/\">Mutoko RDC threatens legal action against errant mining companies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "Employee in court for stealing biscuits",
            "url": "https://www.newzimbabwe.com/employee-in-court-for-stealing-biscuits/",
            "content": "By Staff Reporter\n\nA local company, Synergy Biscuits, has dragged its employee to court on allegations of stealing biscuits worth US$250,000.\n\nThe employee Richard Musungwa appeared before Magistrate Marewanazvo Gofa, who remanded him in custody to April 8 for bail hearing.\n\nHe is charged with theft of trust property.\n\nProsecutor Lancelot Mutsokoti alleged that on dates unknown to the prosecutor but for the period between 2013 to April 1 2025, accused person, who is employed by the complainant as a driver and sales representative.\n\nIt is alleged that Musungwa and his accomplices, who are still at large, hatched a plan to steal from the complainant.\n\nThe company received an order to supply biscuits worth US$250,000 to clients and collected US$250,000, which they were supposed to hand over to the company.\n\nAccused person and his accomplices delivered the biscuits, collected cash and converted the money to their own use in violation of the trust agreement, the State alleges.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/04055206/biscuits.png",
            "description": "<p>By Staff Reporter A local company, Synergy Biscuits, has dragged its employee to court on allegations of stealing biscuits worth US$250,000. The employee Richard Musungwa appeared before Magistrate Marewanazvo Gofa, who remanded him in custody to April 8 for bail hearing. He is charged with theft of trust property. Prosecutor Lancelot Mutsokoti alleged that on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/employee-in-court-for-stealing-biscuits/\">Employee in court for stealing biscuits</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "We will not allow any non-cricketing event at Queens Sports Club –  Zimbabwe Cricket",
            "url": "https://www.newzimbabwe.com/we-will-not-allow-any-non-cricketing-event-at-queens-sports-club-zimbabwe-cricket/",
            "content": "By Staff Reporter\n\nZimbabwe Cricketsays no permission has been granted for the Bulawayo Shutdown showheadlined by Winky D and Uncle Waffles on April 26 to take place atQueens Sports Club.\n\nFlyers circulating for the Bulawayo Shutdown concert show Queens Sports Club as the set venue but the clubs custodians, Zimbabwe Cricket, said legal action will be taken against the promoters responsible for the misrepresentation.\n\nLocal and regional artists, including Winky D, Uncle Waffles, Zee Nxumalo, EEMOH, DJ Tira, Nasty C, Emtee, Enzo Ishall, Oriyano, Bazooker, Killer T, and Mzoe 7 are set to perform at the shutdown.\n\nIn a statement, Zimbabwe Cricket said it will not sanction any non-cricketing event to take place at the Queens Sports Club.\n\nZimbabwe Cricket (ZC) has noted with concern the circulation of advertising material falsely claiming that a musical show is scheduled to take place at Queens Sports Club in Bulawayo on 26 April 2025.\n\nZC wishes to categorically state that it has not granted the organisers of the said event any consent to hold a concert at Queens Sports Club, venue of our upcoming Test series.\n\nAny claims suggesting otherwise are misleading and should be disregarded.\n\nAs the custodians of the venue, ZCs priority remains the game of cricket, and we will not permit the concert or any other non-cricketing event to take place at Queens Sports Club. ZC therefore strongly warns the show organisers to desist from misleading the public with false advertisements, reads the statement.\n\nZimbabwe is set to host a Test series against South Africa and New Zealand in June and August at Queens Sports Club.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/04054601/queens.jpg",
            "description": "<p>By Staff Reporter Zimbabwe Cricket says no permission has been granted for the Bulawayo Shutdown show headlined by Winky D and Uncle Waffles on April 26 to take place at Queens Sports Club. Flyers circulating for the Bulawayo Shutdown concert show Queens Sports Club as the set venue but the club’s custodians, Zimbabwe Cricket, said legal action will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-not-allow-any-non-cricketing-event-at-queens-sports-club-zimbabwe-cricket/\">We will not allow any non-cricketing event at Queens Sports Club –  Zimbabwe Cricket</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "New OK Zimbabwe management seeks to raise US$30 million to cover funding gap, blames tough economic environment",
            "url": "https://www.newzimbabwe.com/new-ok-zimbabwe-management-seeks-to-raise-us30-million-to-cover-funding-gap-blames-tough-economic-environment/",
            "content": "By Alois Vinga\n\nA cautionary statement issued under the guidance of OK Zimbabwe management still blames the giant retailers problems on the tough economic environment.\n\nLast month, the retailer fired its management team led by Max Karombo and recalled former chief executive Willard Zireva from retirement to lead its revival.\n\nMarket speculators said the decisions effectively hinted that Karombos team had failed to deliver. Throughout his tenure, Karombos team pleaded with authorities to address the tough economic environment.\n\nThe new managementnow appears to have come head on with the tough operating environment,recitingpast problems raised by the sacked executive.\n\nThe difficult operating environment has been characterized by: macroeconomic volatility, including pricing issues related to the exchange rate, while informal players operated without this constraint, giving them a competitive advantage.\n\nAdditionally, inflationary pressures have impacted cost structures and pricing strategies; liquidity constraints in the broader economy, affecting consumer spending and the Companys ability to generate sufficient cash flows; and working capital challenges leading to disruptions in supply chain and reduced stock availability, OK Zimbabwe Company Secretary, Margaret Munyuru said.\n\nThe company, Munyuru said has been unable to maintain adequate stock levels as many suppliers can no longer continue providing goods and services due to outstanding unpaid balances directly impacting product availability across the Companys stores, affecting revenue generation and overall business performance, particularly in the last six months where trading levels were not adequate to cover costs.\n\nAs a result of all the above, the company now anticipates making a significant loss for the year ended 31 March 2025.\n\nIn light of the foregoing, the Board of Directors has resolved to undertake a capital raise in the sum of up to US$30 million to bridge the funding gap and stabilize the Companys financial position. The capital raise will be a combination of a rights issue, private placement and debt instruments.\n\nThe capital-raising initiative is expected to strengthen the companys balance sheet and liquidity position; enhance working capital availability to ensure smooth business operations; and support the Companys strategic turnaround plan, she said.\n\nThe Company plans to publish a circular to shareholders incorporating notice of an Extraordinary General Meeting of Members for the purpose of considering and approving the capital raise.\n\nAccordingly, shareholders and the investing public are advised to exercise caution when dealing in the Companys shares. Further announcements will be made in accordance with regulatory requirements as and when there are material developments, added Munyuru.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga A cautionary statement issued under the guidance of OK Zimbabwe management still blames the giant retailer’s problems on the tough economic environment. Last month, the retailer fired its management team led by Max Karombo and recalled former chief executive Willard Zireva from retirement to lead its revival. Market speculators said the decisions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-ok-zimbabwe-management-seeks-to-raise-us30-million-to-cover-funding-gap-blames-tough-economic-environment/\">New OK Zimbabwe management seeks to raise US$30 million to cover funding gap, blames tough economic environment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        },
        {
            "title": "ZANU PF laughs off Geza’s audacious bid to remove Mnangagwa",
            "url": "https://www.newzimbabwe.com/zanu-pf-laughs-off-gezas-audacious-bid-to-remove-mnangagwa/",
            "content": "By Darlington Gatsi\n\nZANU PF has scoffed at war veteran Blessed Gezas bid to oust President Emmerson Mnangagwa, presenting a united front despite glaring factionalism within the ruling party.\n\nGeza called for nationwide demonstrations which led to a stayaway on Monday. The expelled Zanu PF Central Committee member is registering his displeasure with Mnangagwas government, which he accuses of overseeing corruption in the country.\n\nThe move has been laughed off as a failure by the government, but observers have signalled the stayaway as a sign of discontent among Zimbabweans.\n\nSpeaking recently in Harare, ZANU PF spokesperson Christopher Mutsvangwa said the ruling party shows no signs of waning, taking a swipe at the militant Geza.\n\nZANU PF is a mass party; we are not a vanguard party. Along the way, in a mass party, there are bound to be other individuals who may have certain ideas, and every once in a while, they may try to test their mettle along those ideas. But in this instance, the party has shown that it is very much united.\n\nWe are proceeding with the affairs of the party in a united way, and the rejection of that individual and his agenda of thuggeryof unprocedural removal of leadership from powerwas rejected by the people, said Mutsvangwa.\n\nThere are reports of factionalism in ZANU PF, one faction backing an extension of President Mnangagwas rule beyond the constitutionally stipulated two terms, while another is pushing for a renewal of the partys leadership.\n\nGeza is leading a faction that insists Mnangagwa steps down before the end of his final term and has pledged to remove him from power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/02203435/marapira-mutsvangwa-e1743740148148.jpeg",
            "description": "<p>By Darlington Gatsi ZANU PF has scoffed at war veteran Blessed Geza’s bid to oust President Emmerson Mnangagwa, presenting a united front despite glaring factionalism within the ruling party. Geza called for nationwide demonstrations which led to a stayaway on Monday. The expelled Zanu PF Central Committee member is registering his displeasure with Mnangagwa’s government,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-laughs-off-gezas-audacious-bid-to-remove-mnangagwa/\">ZANU PF laughs off Geza’s audacious bid to remove Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "04 Apr 2025"
        }
    ]
}