{
    "news": [
        {
            "title": "Dynamos through to the Chibuku Super Cup semi finals",
            "url": "https://www.newzimbabwe.com/dynamos-through-to-the-chibuku-super-cup-semi-finals/",
            "content": "By Sports Reporter\n\nFOR the third time this season, Dynamos won through penalty shootouts in the Chibuku Super Cup tournament after beating ZPC Kariba at Rufaro Stadium on Sunday.\n\nThe Harare-based outfit and Kariba played a 0-0 draw in regulation time in a match thay had very few meaningful chances from both sides.Heading for penalty shootouts, Dynamos coach Kelvin Kaindu introduced goalkeeper Tatenda Makoni from the bench in the 92nd minute, a move which paid off as the goalie made a critical save during shootouts.Other than Makonis save, ZPC Kariba were also denied by the post giving the home side an advantage, hence the shootouts ended 4-2.Dynamos win saw them making history, becoming the first team ever in history to play three consecutive Chibuku Super Cup semi finals.Dembare currently boast of winning the previous two Chibuku Super Cup editions and all eyes will be on the current squad, which is eyeing to make it three in a row.Meanwhile, at Sakubva Stadium Triangle FC beat Manica Diamonds 2-0 to book a place in the semi finals of the tournament.Dynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.Sundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nThe Harare-based outfit and Kariba played a 0-0 draw in regulation time in a match thay had very few meaningful chances from both sides.\n\nHeading for penalty shootouts, Dynamos coach Kelvin Kaindu introduced goalkeeper Tatenda Makoni from the bench in the 92nd minute, a move which paid off as the goalie made a critical save during shootouts.Other than Makonis save, ZPC Kariba were also denied by the post giving the home side an advantage, hence the shootouts ended 4-2.Dynamos win saw them making history, becoming the first team ever in history to play three consecutive Chibuku Super Cup semi finals.Dembare currently boast of winning the previous two Chibuku Super Cup editions and all eyes will be on the current squad, which is eyeing to make it three in a row.Meanwhile, at Sakubva Stadium Triangle FC beat Manica Diamonds 2-0 to book a place in the semi finals of the tournament.Dynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.Sundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nHeading for penalty shootouts, Dynamos coach Kelvin Kaindu introduced goalkeeper Tatenda Makoni from the bench in the 92nd minute, a move which paid off as the goalie made a critical save during shootouts.\n\nOther than Makonis save, ZPC Kariba were also denied by the post giving the home side an advantage, hence the shootouts ended 4-2.Dynamos win saw them making history, becoming the first team ever in history to play three consecutive Chibuku Super Cup semi finals.Dembare currently boast of winning the previous two Chibuku Super Cup editions and all eyes will be on the current squad, which is eyeing to make it three in a row.Meanwhile, at Sakubva Stadium Triangle FC beat Manica Diamonds 2-0 to book a place in the semi finals of the tournament.Dynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.Sundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nOther than Makonis save, ZPC Kariba were also denied by the post giving the home side an advantage, hence the shootouts ended 4-2.\n\nDynamos win saw them making history, becoming the first team ever in history to play three consecutive Chibuku Super Cup semi finals.Dembare currently boast of winning the previous two Chibuku Super Cup editions and all eyes will be on the current squad, which is eyeing to make it three in a row.Meanwhile, at Sakubva Stadium Triangle FC beat Manica Diamonds 2-0 to book a place in the semi finals of the tournament.Dynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.Sundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nDynamos win saw them making history, becoming the first team ever in history to play three consecutive Chibuku Super Cup semi finals.\n\nDembare currently boast of winning the previous two Chibuku Super Cup editions and all eyes will be on the current squad, which is eyeing to make it three in a row.Meanwhile, at Sakubva Stadium Triangle FC beat Manica Diamonds 2-0 to book a place in the semi finals of the tournament.Dynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.Sundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nDembare currently boast of winning the previous two Chibuku Super Cup editions and all eyes will be on the current squad, which is eyeing to make it three in a row.\n\nMeanwhile, at Sakubva Stadium Triangle FC beat Manica Diamonds 2-0 to book a place in the semi finals of the tournament.Dynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.Sundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nMeanwhile, at Sakubva Stadium Triangle FC beat Manica Diamonds 2-0 to book a place in the semi finals of the tournament.\n\nDynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.Sundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nDynamos and Triangle now await Sundays two fixtures to see who will join them in the semi finals.\n\nSundays Chibuku Super Cup fixtures.Highlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nSundays Chibuku Super Cup fixtures.\n\nHighlanders vs Scottland FC (Barbourfields)Bikita Minerals vs MWOS FC (Gibbo).\n\nHighlanders vs Scottland FC (Barbourfields)\n\nBikita Minerals vs MWOS FC (Gibbo).\n\nBikita Minerals vs MWOS FC (Gibbo).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter FOR the third time this season, Dynamos won through penalty shootouts in the Chibuku Super Cup tournament after beating ZPC Kariba at Rufaro Stadium on Sunday. The Harare-based outfit and Kariba played a 0-0 draw in regulation time in a match thay had very few meaningful chances from both sides. Heading for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-through-to-the-chibuku-super-cup-semi-finals/\">Dynamos through to the Chibuku Super Cup semi finals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Sep 2025"
        },
        {
            "title": "Ambulance technician, accomplices in court for stealing US$1,200 and airtime vouchers from accident victim",
            "url": "https://www.newzimbabwe.com/ambulance-technician-accomplices-jailed-for-stealing-us1200-and-airtime-vouchers-from-accident-victim/",
            "content": "By Staff Reporter\n\nA KWEKWE magistrate has convicted an ambulance technician and his two accomplices for stealing money from a road accident victim they were supposed to assist.\n\nEdius Mugonegwa (40), employed by Redcliff Municipality, together with Pride Makamba (25) and Anashe Mukwamba (23), were found guilty of theft after they pocketed US$1,260 cash and US$10 airtime from the injured man.\n\nAccording to the National Prosecuting Authority (NPA), the crime occurred on September 7, 2025, along the Kwekwe-Redcliff Road when Mugonegwa responded to an accident scene.\n\nWhile administering First Aid, bloodstained cash fell from the victims pocket.\n\nInstead of safeguarding it, Mugonegwa, Makamba, and Mukwamba connived to convert the money to their personal use, the NPA said.\n\nThe victim only realised his cash was missing after regaining consciousness at Kwekwe General Hospital and immediately reported the matter to police.\n\nSwift investigations by the Criminal Investigations Department (CID) Kwekwe led to the arrest of the trio, with part of the stolen money recovered.\n\nMagistrates handed Mugonegwa 18 months in prison, with three months suspended for five years. The remaining 15 months were converted to 825 hours of community service.\n\nMakamba and Mukwamba were each sentenced to 12 months imprisonment, with three months suspended, and the balance converted to 315 hours of community service each.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/29060624/kwekwe-mag.jpg",
            "description": "<p>By Staff Reporter  A KWEKWE magistrate has convicted an ambulance technician and his two accomplices for stealing money from a road accident victim they were supposed to assist. Edius Mugonegwa (40), employed by Redcliff Municipality, together with Pride Makamba (25) and Anashe Mukwamba (23), were found guilty of theft after they pocketed US$1,260 cash and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ambulance-technician-accomplices-jailed-for-stealing-us1200-and-airtime-vouchers-from-accident-victim/\">Ambulance technician, accomplices in court for stealing US$1,200 and airtime vouchers from accident victim </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Sep 2025"
        },
        {
            "title": "President Mnangagwa commissions accommodation flats for students, residents",
            "url": "https://www.newzimbabwe.com/mnangagwa-commissions-accommodation-flats-for-students-residents/",
            "content": "By Mary Taruvinga\n\nPRESIDENT Emmerson Mnangagwa has officially commissioned a US$37,7 million state-of-the-art housing project in Zvishavane, marking a milestone he described as a major one towards provision of dignified living space for Zimbabweans.\n\nThe launch coincided with the celebration of his 83rd birthday, which was held in the mining town on Monday.\n\nAddressing thousands at the gathering, Mnangagwa said the project was a source of pride for his government and liberation struggle veterans, who pushed for better living standards for citizens.\n\nThe multimillion-dollar project was a collaboration between the Public Service Commission (PSC), through the Public Service Pension Fund (PSPF), and First Mutual Holdings.\n\nI want to congratulate the PSC and its partners for this strategic project. Our country Zimbabwe is, indeed, on a reversible journey towards vision 2030.\n\nThis modern infrastructure serves as a source of pride for the veterans of the liberation struggle, who fought so that all our people can have a higher quality of life, he said.\n\nThe project will provide 300 residential flats and 750 student apartments.\n\nThe project also provided over 3 000 job opportunities benefiting members of the Zvishavane community and others.\n\nThe local community also benefitted from upgraded water and sanitary systems as well as improved road networks following the introduction of the project.\n\nWork resumed in March last year and has been completed.\n\nMnangangwa said project is a symbol of national unity and progress, adding his government will continue pushing towards achieving such high-quality projects countrywide.\n\nThis is the standard and work we must uphold across all our entities.The residential flats are investments in the dignity of our people through quality living space.\n\nMnangagwa also said the success of this project demonstrates the power of private public partnerships, further applauding the PSPF and its partners.\n\nFirst Mutual Wealth provided the land, while the majority of the capital, approximately 97%, was invested by the PSPF, with First Mutual acting as project manager, according to Douglas Hoto, chairman and group chief executive officer of First Mutual Holdings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/20055751/DJI_0191.jpg",
            "description": "<p>By Mary Taruvinga  PRESIDENT Emmerson Mnangagwa has officially commissioned a US$37,7 million state-of-the-art housing project in Zvishavane, marking a milestone he described as a major one towards provision of dignified living space for Zimbabweans. The launch coincided with the celebration of his 83rd birthday, which was held in the mining town on Monday. Addressing thousands</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-commissions-accommodation-flats-for-students-residents/\">President Mnangagwa commissions accommodation flats for students, residents</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Sep 2025"
        },
        {
            "title": "City of Harare has abandoned core mandate amid rot worsened by ongoing workers’ strike— say disgruntled residents",
            "url": "https://www.newzimbabwe.com/city-of-harare-has-abandoned-core-mandate-amid-rot-worsened-by-ongoing-workers-strike-say-disgruntled-residents/",
            "content": "By Darlington Gatsi\n\nHARARE City Fathers have abandoned their constitutional mandate, leaving the capital in a state of neglect, residents have said.\n\nThis is contained in the newly released report by the Harare Residents Trust (HRT), which paints a grim picture of the state of the local authority.\n\nThe HRT contends that service delivery continues to deteriorate under the watch of the Jacob Mafume-led city council.\n\nThe report reveals that residents are at the mercy of the poor operations at the council, which is failing to provide basic services, including water provision, garbage collection, streetlighting, among others.\n\nThe residents report that they have been receiving water twice a week on average. The water has impurities when it is available. When it is left in containers, the water turns greenish and brownish, which reduces confidence among residents to drink it.\n\nObservations by a lot of residents are that the city water dries their skin, probably due to the treatment chemicals they are using, read the report.\n\nThe plight of Harare residents was further compounded by the local authoritys workers, who embarked on a strike, citing incapacitation and protesting the death of two fellow employees who died in Budiriro.\n\nConsequently, the council could not attend to burst pipes, leaving areas like Mufakose as a ticking health time bomb.\n\nThe report further stated that the state of the roads in Harare is dire, leaving residents to patch up the potholes themselves.\n\nThe majority of the roads in Harares high-density residential suburbs are in bad shape, with potholes everywhere. The situation is better in the low-density areas, where the residents sometimes use their personal resources to do road patching, and council workers put more energy into repairing and maintaining roads leading to the homes of the powerful elites in society.\n\nIn Mbare, residents are disgruntled by the poor state of their streets. Vehicles passing by leave a trail of dust filling their homes. This has forced many households to keep their windows and doors closed most of the time. If not closed, sofas and floors will be covered in dust. Due to the dust, residents now fear contracting diseases, the report read.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/04203500/Harare-Water-Crisis.jpeg",
            "description": "<p>By Darlington Gatsi  HARARE City Fathers have abandoned their constitutional mandate, leaving the capital in a state of neglect, residents have said. This is contained in the newly released report by the Harare Residents Trust (HRT), which paints a grim picture of the state of the local authority. The HRT contends that service delivery continues</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-has-abandoned-core-mandate-amid-rot-worsened-by-ongoing-workers-strike-say-disgruntled-residents/\">City of Harare has abandoned core mandate amid rot worsened by ongoing workers’ strike— say disgruntled residents </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Sep 2025"
        },
        {
            "title": "Illicit cigarettes: Undocumented Zimbabweans found hiding in SANDF base",
            "url": "https://www.newzimbabwe.com/illicit-cigarettes-undocumented-zimbabweans-found-hiding-in-sandf-base/",
            "content": "IOL\n\nFive members of the South African National Defence Force (SANDF) have been released on bail after they appeared before the Musina Magistrates Court oncharges related to illicit cigarette smuggling.\n\nTheir two co-accused, both undocumented Zimbabwean nationals, were found hiding at the military base where the smuggling operation took place.\n\nLimpopo regional spokesperson for the National Prosecuting Authority (NPA), Mashudu Malabi-Dzhangi, said the five soldiers are Macdonald Tshabadira, 28; Waydon Peterson, 29; Khuliso Tshivhenga, 42; Khodani Abel Maphukhumela, 29; and Evah Mmaphuthi Modisa, 39. Each was granted bail of R5,000.\n\nTheir two co-accused, Livhuwani Mutavhatsindi, 27, and Perfious Chauke, 27, were remanded in custody without bail. The Zimbabwean nationals also face charges under the Immigration Act.\n\nMalabi-Dzhangi said the group faces charges of possession of illicit cigarettes, possession of ammunition, and defeating the ends of justice.\n\nThe arrests on September 16, 2025, followed an incident at the Artonvilla military base, where the SANDF members allegedly intercepted a group of smugglers transporting 24 master boxes of illicit Remington Gold cigarettes, valued at an estimated R300,000.\n\nIt is alleged that the soldiers only declared 18 of the boxes to SA Revenue Service Customs, while the remaining six boxes were later found hidden under their beds.\n\nPolice were alerted to the discrepancy and, upon searching the premises, found six master boxes of Remington Gold cigarettes concealed under the SANDF members beds. Two civilians were also discovered hiding at the base. The accused were immediately arrested, said Malabi-Dzhangi.\n\nOn the other hand, the SANDF has confirmed that the operation was unauthorized and has reiterated its zero-tolerance stance on corruption, with disciplinary processes to run concurrently with the criminal proceedings.\n\nPreliminary reports indicate that, at approximately midnight on 16 September 2025, a group of SANDF members allegedly conducted an unauthorised operation at Artonvilla, Musina (also known as Sediba sa Tlou base). It is alleged that the members, acting in concert with two Zimbabwean nationals, attempted to unlawfully intercept a group of smugglers transporting illicit cigarettes into South Africa, said SANDF spokesperson, Rear Admiral Prince Tshabalala.\n\nDuring the incident, shots were reportedly fired, illicit goods were seized, and some contraband was unlawfully concealed at the base.\n\nFollowing credible intelligence, the SANDF military police, military intelligence, and the SAPS launched a joint operation later that morning.\n\nThe case has been adjourned until November 14, 2025, for further investigation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19074507/sandf-base.png",
            "description": "<p>IOL Five members of the South African National Defence Force (SANDF) have been released on bail after they appeared before the Musina Magistrate’s Court on charges related to illicit cigarette smuggling. Their two co-accused, both undocumented Zimbabwean nationals, were found hiding at the military base where the smuggling operation took place. Limpopo regional spokesperson for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/illicit-cigarettes-undocumented-zimbabweans-found-hiding-in-sandf-base/\">Illicit cigarettes: Undocumented Zimbabweans found hiding in SANDF base</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Sep 2025"
        },
        {
            "title": "Zimbabwe ditches South Africa, chooses Botswana venue for Bafana Bafana clash",
            "url": "https://www.newzimbabwe.com/zimbabwe-ditches-south-africa-chooses-botswana-venue-for-bafana-bafana-clash/",
            "content": "IOL\n\nThe Zimbabwe Football Association (Zifa) have announced a dramatic venue change, in an unexpected twist in the lead-up to the 2026 FIFA World Cup qualifiers next month.\n\nTheir pivotal clash against South Africas Bafana Bafana, originally slated for South African soil, will now take place at the Obed Itani Chilume Stadium in Francistown, Botswana, on October 10, 2025.\n\nThis decision comes about because Zimbabwe have issues with hosting international matches at home due to a FIFA ban stemming from stadium concerns.\n\nZimbabwe have previously held their home qualifiers in South Africa, specifically utilising popular venues such as Orlando Stadium. The transition to Botswana is seen as a move to create a more logistical and fan-friendly environment for their supporters.\n\nLocal sources from the Zimbabwe Football Association (Zifa) report that the decision aims to make the match more accessible for both the Warriors fans. The move is significant as the fixture serves as a milestone in South Africas quest for World Cup qualification.\n\nAs it stands, South Africa leads the standings in Group C with 17 points from eight matches, putting them in pole position for qualification. Meanwhile, Zimbabwe languishes at the bottom with only four points, a stark reflection of their struggleshaving won merely two of their last 27 qualifiers since 2010.\n\nThis latest venue change adds further intrigue to a match that, while less critical for Zimbabwes aspirations, could serve as a defining moment for a Bafana squad looking to solidify their World Cup journey.\n\nThe Obed Itani Chilume Stadium, which boasts a capacity of 26,000, has been recognised as a reliable venue, previously hosting Namibia during their World Cup qualifiers, thus demonstrating its capability to cater to international football standards.\n\nThis choice of location not only provides a neutral ground but also enhances accessibility for Zimbabwean fans, who usually faced no challenges attending matches in South Africa.\n\nDespite Zimbabwes elimination from World Cup contention following a disappointing series of resultsincluding losses to Benin and Rwandathis encounter with the Bafana is unlikely to diminish local interest. Providing a stage to showcase talent, the upcoming match may serve more as a platform for national pride and a precursor to the upcoming 2025 Africa Cup of Nations.\n\nHowever, the venue shift has left many fans puzzled; while the location changes, Zimbabwes hopeless position in the qualifiers is still unchanged. The decision ultimately raises questions about ZIFAs administrative strategy, especially as Zimbabwe prepares to face South Africa, Nigeria, and Lesotho, a task that seems more metaphorical than consequential.\n\nThe president of the Botswana Football Association, Tariq Babitseng, confirmed the hosting arrangement, emphasising the significance of this contest for Bafana as they aim for a win to bolster their World Cup bid.\n\nWith anticipation building, all eyes will be on Francistown this October, regardless of the unpredictable journey Zimbabwes Warriors have faced in their World Cup qualifiers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>IOL The Zimbabwe Football Association (Zifa) have announced a dramatic venue change, in an unexpected twist in the lead-up to the 2026 FIFA World Cup qualifiers next month. Their pivotal clash against South Africa’s Bafana Bafana, originally slated for South African soil, will now take place at the Obed Itani Chilume Stadium in Francistown, Botswana,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ditches-south-africa-chooses-botswana-venue-for-bafana-bafana-clash/\">Zimbabwe ditches South Africa, chooses Botswana venue for Bafana Bafana clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Sep 2025"
        },
        {
            "title": "Local miners shun ZIDA’s Mining Claims Matchmaking platform despite investment potential",
            "url": "https://www.newzimbabwe.com/local-miners-shun-zidas-mining-claims-matchmaking-platform-despite-investment-potential/",
            "content": "ByAlois Vinga\n\nThe Zimbabwe Investment Development Agency (ZIDA) has expressed concern that local miners are not taking advantage of its Mining Claims Matchmaking platform, despite its vast potential to unlock critical investment opportunities.\n\nThe platform was created to connect mining claim holders in Zimbabwe with both local and international investors. It is designed to facilitate partnerships for technical support, tributary agreements, joint ventures, debt funding, or even the outright sale of mining claims.\n\nAccording to ZIDA, the service is open to all mining claim holders in Zimbabwe, whether individuals, companies, or syndicates, regardless of their scale of operation.\n\nTo use the platform, claim holders are required to upload their identification documents, claim registration certificate, valid inspection certificate, and a site map.\n\nBut speaking during a plenary discussion at the 2025 Environmental Social Governance Conference convened by the Zimbabwe Environmental Law Organisation (ZELO) and Silveira House on the sidelines of the Zimbabwe Alternative Mining Indaba in Bulawayo, the ZIDA Legal Manager, Chidochashe Ncube, said local miners were not tapping into the platforms potential.\n\nThere seems to be a lack of trust by locals who suspect the risk of losing their claims. Locals want to go behind the scenes and the few who come forth only do after being shortchanged by the potential investors.\n\nThe public must be aware that this platform has a number of benefits like assistance in identifying ethical investors, contract drafting and professional advice on business-related issues, she said.\n\nNcube said such platforms also enhance the strengthening of ESG standards since matched parties easily fall under the authorities surveillance.\n\nQuizzed by one David Bote on why ZIDA appears to be pro-foreign investors as opposed to locals in rendering assistance, Ncube dismissed the claims, arguing that locals are not willing to come forth and exhaust available opportunities.\n\nIt is incorrect. The fact of the matter is that foreigners first port of call is usually the ZIDA because they do not know anyone around. In contras,t locals often bypass the Agency, opting to engage their connections instead, only to look for us when this goes off hand, added Ncube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/18082827/chido-ncube.png",
            "description": "<p>By Alois Vinga The Zimbabwe Investment Development Agency (ZIDA) has expressed concern that local miners are not taking advantage of its Mining Claims Matchmaking platform, despite its vast potential to unlock critical investment opportunities. The platform was created to connect mining claim holders in Zimbabwe with both local and international investors. It is designed to facilitate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-miners-shun-zidas-mining-claims-matchmaking-platform-despite-investment-potential/\">Local miners shun ZIDA’s Mining Claims Matchmaking platform despite investment potential</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Sep 2025"
        }
    ]
}