{
    "news": [
        {
            "title": "Zimbabwe has $9billion plan to join African electricity drive",
            "url": "https://www.newzimbabwe.com/zimbabwe-has-9billion-plan-to-join-african-electricity-drive/",
            "content": "The plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of the countrys power production from hydro, wind, solar and biomass plants.\n\nZimbabwe laid out plans to raise more than $9 billion to boost energy access at a conference in London on Wednesday, an event organized by multilateral lenders to promote a flagship African electrification program to private investors.\n\nThe plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of the countrys power production from hydro, wind, solar and biomass plants, a copy of the presentation sent to Bloomberg showed. Zimbabwe has been hit by regular power outages in recent years, often lasting most of the day, due to a lack of generation capacity.\n\nMission 300, which the banks unveiled at a conference in Tanzania in January, aims to bring electricity to 300 million people in sub-Saharan Africa by 2030 at a cost of tens of billions of dollars sourced from development finance institutions and private investors. The region is home to about 83% of the 680 million people globally who dont have access to electricity.\n\nDespite having abundant renewable energy potential, Zimbabwe continues to face critical energy challenges, July Moyo, the countrys energy minister, wrote in the plan, titledZimbabwes National Energy Compact.As of 2024, 38% of the population lacks access to electricity.\n\nZimbabwes ambitions of benefiting from the program are complicated by the fact that it has been in default to multilateral lenders  including the World Bank  for a quarter of a century. That means it cant borrow money from them and the finance it needs will have to come largely from private investors.\n\nUnder the plan Zimbabwe plans to seek:\n\nGhana, Togo, Mozambique and Burundi are also scheduled to present their plans at the conference, which isnt open to the media, on Wednesday. Eleven countries, including the Democratic Republic of Congo and Nigeria, disclosed their blueprints to boost electrification at the Tanzania conference.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04192823/solar-in-harare.jpg",
            "description": "<p>Bloomberg The plan, which falls under the World Bank and African Development Bank’s Mission 300 program, envisages a more than doubling of the country’s power production from hydro, wind, solar and biomass plants. Zimbabwe laid out plans to raise more than $9 billion to boost energy access at a conference in London on Wednesday, an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-has-9billion-plan-to-join-african-electricity-drive/\">Zimbabwe has $9billion plan to join African electricity drive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Jun 2025"
        },
        {
            "title": "Calls grow to ban pitbulls in Zimbabwe",
            "url": "https://www.newzimbabwe.com/calls-grow-to-ban-pitbulls-in-zimbabwe/",
            "content": "By Darlington Gatsi\n\nPRESSURE is mounting on the government to ban pit bulls as domestic pets, as Zimbabwe continues to record deaths and injuries caused by the vicious dogs.\n\nThis follows the fatal attack of a Harare man, Samuel Machara, by a pitbull in Bluffhill.\n\nMacharas death is not an isolated incident, as similar cases have been recorded, raising concerns over the safety of keeping the dogs as pets.\n\nGospel musician Tembalami has initiated apetitionto push for a ban on pitbulls.\n\nHe argues that the dogs have become a danger and threaten public safety.\n\nWe have had countless deaths caused by pit bulls. Now its time to act. For years, the pit bull breed has been associated with savage attacks resulting in serious injuries and, tragically, fatalities in our communities. Despite taking necessary precautions, the inherent aggressive nature of these dogs has led to unforeseen and heartbreaking incidents involving our loved ones.\n\nThe increasing number of pit bull attacks highlights the urgent need for action. In countries like the United Kingdom and Canada, legislation has been implemented that bans or severely restricts the breeding and ownership of pit bulls. Such measures have led to a decrease in dangerous encounters and have proven effective in enhancing public safety, read the petition.\n\nAn estimated 12 countries worldwide have enforced a ban on keeping pit bulls, and calls are growing louder for Zimbabwe to follow suit.\n\nRecently, Harare Mayor Jacob Mafume indicated that the City Council would address the menace caused by the vicious animals.\n\nTembalamis petition further reads, Zimbabwe must take a similar approach to ensure the well-being of its citizens. A nationwide ban on pit bull ownership as pets and as security dogs will significantly reduce the risk of attacks. Pet owners can opt for other breeds that are known for their kindness and loyalty, providing a safer environment for all.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/01174941/pitbull-e1748796599291.jpeg",
            "description": "<p>By Darlington Gatsi PRESSURE is mounting on the government to ban pit bulls as domestic pets, as Zimbabwe continues to record deaths and injuries caused by the vicious dogs. This follows the fatal attack of a Harare man, Samuel Machara, by a pitbull in Bluffhill. Machara’s death is not an isolated incident, as similar cases</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/calls-grow-to-ban-pitbulls-in-zimbabwe/\">Calls grow to ban pitbulls in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Jun 2025"
        },
        {
            "title": "Rights Commission slams authorities over unlawful detention of 66 irregular migrants",
            "url": "https://www.newzimbabwe.com/rights-commission-slams-authorities-over-unlawful-detention-of-66-irregular-migrants/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has condemned the detention of 66 irregular migrants of various nationalities, stating that their continued imprisonment violates their rights as they are neither facing criminal charges nor awaiting trial.\n\nAccording to ZHRC, the 66 detained at Harare Remand Prison are from Burundi, Ethiopia, Malawi, South Africa, Libya, Mozambique, China, Pakistan, Taiwan, India, the United Kingdom, France and Cape Verde.\n\nIn a press statement Wednesday following its recenthuman rights monitoringvisitto Harare Remand Prison, ZHRC urged authorities to immediately endthe practice of detaining migrants indefinitely.\n\nThere were 66 irregular migrants of different nationalities whose detention was in violation of their rights as they were not facing any criminal charges and were not awaiting trial.\n\nIn light of these findings, ZHRC urged relevant authorities to take immediate action to desist from imprisonment of irregular migrants whose issues should be handled without resorting to indefinite detention, the statement reads.\n\nZimbabwe currently does not have detention facilities for irregular immigrants that are not prisons.\n\nSome illegal immigrants end up staying in prison for more than ten years awaiting deportation.\n\nAccording to Immigration Chief Director Respect Gono last year, as of September 23, there were 368 jailed illegal immigrants, 274 were awaiting deportation, 61 were serving prison sentences, and 33 were awaiting trial for various offences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Commission (ZHRC) has condemned the detention of 66 irregular migrants of various nationalities, stating that their continued imprisonment violates their rights as they are neither facing criminal charges nor awaiting trial. According to ZHRC, the 66 detained at Harare Remand Prison are from Burundi, Ethiopia, Malawi, South Africa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-commission-slams-authorities-over-unlawful-detention-of-66-irregular-migrants/\">Rights Commission slams authorities over unlawful detention of 66 irregular migrants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Jun 2025"
        },
        {
            "title": "Musk calls Trump’s tax bill a ‘disgusting abomination’",
            "url": "https://www.newzimbabwe.com/musk-calls-trumps-tax-bill-a-disgusting-abomination/",
            "content": "BBC\n\nElon Musk has hit out at President Donald Trumps signature tax and spending bill, describing it as a disgusting abomination, in a widening rift between the two.\n\nThe tech billionaire posted on X that the bill would add to the US budget deficit and saddle Americans with crushing debt.\n\nThe budget, which includes huge tax breaks and more defence spending, was passed by the House of Representatives last month and is now being considered by senators.\n\nShame on those who voted for it, said Musk, hinting that he may try to unseat the politicians responsible at next years midterm elections.\n\nThe bill has the backing of President Donald Trump and would be the legislative linchpin of his second-term agenda if it passes Congress.\n\nMusk left the administration abruptly last week after 129 days working to cut costs with his team, known as Doge.\n\nThe comments mark his first public disagreement with Trump since leaving government, after having previously called the plan disappointing.\n\nThe South African-born tech billionaires time in the Trump administration came to an end on 31 May, although Trump said that he will, always, be with us, helping all the way.\n\nIn its current form, the bill  which Trump refers to as the big beautiful bill  has been estimated to increase the budget deficit  the difference between what the government spends and the revenue it receives  by about $600bn (444bn) in the next fiscal year.\n\nIn a series of posts on X on Tuesday, Musk said that the outrageous, pork-filled spending bill will massively increase the already gigantic budget deficit to $2.5 trillion (!!!) and burden America [sic] citizens with crushingly unsustainable debt.\n\nIn American politics pork refers to spending on projects in lawmakers constituencies.\n\nMusk has previously vowed to fund campaign challenges against any Republican that votes against Trumps agenda. But on Tuesday he fired a warning to those who backed the bill.\n\nIn November next year, we fire all politicians who betrayed the American people, he wrote.\n\nAsked about Musks comments soon after the first post, White House press secretary Karoline Leavitt said the President already knows where Elon Musk stood on this bill.\n\nThis is one, big, beautiful bill, she added. And hes sticking to it.\n\nThe legislation also pledges to extend soon-to-expire tax cuts passed during the first Trump administration in 2017, as well as an influx of funds for defence spending and to fund the administrations mass deportations of undocumented immigrants.\n\nTo the dismay of fiscal conservatives, it would lift the limit on the amount of money the government can borrow, known as the debt ceiling, to $4tn.\n\nThe comments from Musk reflect wider tensions among Republicans over the plan, which faced stiff opposition from different wings of the party as it worked its way through the House.\n\nThe Senate has now taken it up, and divisions are already emerging in that chamber, which is also narrowly controlled by Republicans.\n\nKentucky Senator Rand Paul has said over the last few days he will not support the bill if it raises the debt ceiling.\n\nThe GOP [the Republican Party] will own the debt once they vote for this, he told CBS News, the BBCs US partner, over the weekend.\n\nTrump responded to Paul with a series of social media posts, accusing him of having very little understanding of the bill and saying that the people of Kentucky cant stand him.\n\nHis ideas are actually crazy, Trump wrote.\n\nRepublican lawmakers pushed back on Musks comments, with Senate majority leader John Thune telling reporters the party plans to proceed full speed ahead despite a difference of opinion.\n\nWe have an agenda that everybody campaigned on, most notably the president, he said.\n\nMike Johnson  the Republican Speaker who has ushered the legislation through the House  told reporters on Capitol Hill that my friend Elon is terribly wrong.\n\nIts a very important first start. Elon is missing it, Johnson said.\n\nJohnson said he had a 20-minute phone call with the tycoon about the bill on Monday, adding that its phasing out of electric vehicle tax credits could have an effect on Tesla, Musks firm.\n\nI lament that, Johnson said, expressing surprise that Musk criticised the bill despite their call. I just deeply regret hes made this mistake.\n\nAmong the issues that upset Musk involved air traffic control at the Federal Aviation Administration (FAA), according toAxios.\n\nMusk was hoping it would be run on his Starlink satellite system, but he was denied because of issues relating to the technology and the appearance of a conflict of interest, the political outlet reported.\n\nSome Democrats welcomed Musks comments despite their previous criticism of him and the work of Doge.\n\nEven Elon Musk, whos been part of the whole process, and is one of Trumps buddies, said the bill is bad, Senate Minority Leader Chuck Schumer said. We can imagine how bad this bill is.\n\nTrump and Republicans in Congress have set a deadline of 4 July to get the measure passed and signed into law.\n\nMusk supported Trump in last years November election with donations of more than $250m.\n\nTo make peace with spending hawks, Trump is also asking Congress to pass a plan that would reduce current spending by $9.4bn, a figure derived from Doges work.\n\nIt would mainly slash funding for foreign aid, the United States Agency for International Development (USAID) and for broadcasters NPR and PBS.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/26043006/esla-and-SpaceX-CEO-Elon-Musk.jpeg",
            "description": "<p>BBC Elon Musk has hit out at President Donald Trump’s signature tax and spending bill, describing it as a “disgusting abomination”, in a widening rift between the two. The tech billionaire posted on X that the bill would add to the US budget deficit and saddle Americans with “crushing” debt. The budget, which includes huge</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musk-calls-trumps-tax-bill-a-disgusting-abomination/\">Musk calls Trump’s tax bill a ‘disgusting abomination’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Jun 2025"
        },
        {
            "title": "Sponsored lies – Chamisa dismisses claims he is forming new party",
            "url": "https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has dismissedas sponsored liessocial media rumours suggesting he is launching a new movement at the end of this month.\n\nSince his resignation as Citizens Coalition for Change (CCC)president in January 2024, following what he described as the hijacking of his party by Zanu PF,Chamisa has kept both supporters and opponents guessing over his next move.\n\nChamisa has repeatedly emphasised that he has not left politics but was forced to abandon the CCC due to its takeover.\n\nIn recent days, social media has been awash with flyers claiming Chamisa has launched a new party.\n\nIgnore these lies and falsehoods, Chamisa posted on his X account.\n\nOverwhelmed and flooded by calls from anxious, restless and expectant citizens. Disregard these sponsored lies from scared propagandists.\n\nA new nation founded on love, Zimbabwe shall be a new and great nation governed by love, truth and justice, not hate, violence, lies, deceit and corruption.\n\nLove is the missing essential! Love is the foundation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/21132503/DSC06267-copy-scaled.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has dismissed as “sponsored lies” social media rumours suggesting he is launching a new movement at the end of this month. Since his resignation as Citizens Coalition for Change (CCC) president in January 2024, following what he described as the hijacking of his party by Zanu PF, Chamisa has kept both supporters</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/\">Sponsored lies – Chamisa dismisses claims he is forming new party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Jun 2025"
        },
        {
            "title": "Oreo maker sues Aldi in US over ‘copycat’ packaging",
            "url": "https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/",
            "content": "BBC\n\nThe corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of blatantly copying the packaging of its famous snacks.\n\nCourt documents showed that Mondelz International said Aldi uses similar packaging likely to deceive consumers and ride the coattails of the companys attraction, fame and prestige.\n\nThe snack giant also is behind Wheat Thins, Nutter Butter, Chips Ahoy!, and Ritz  all products the company accuses Aldi of copying with its discount versions.\n\nAldi US didnt respond to the BBCs request for comment, but its British counterpart stressed that it is not involved in the lawsuit.\n\nA spokesperson for Aldi UK told the BBC, that they are under the same ownership but operate as completely separate businesses.\n\nMondelz, which submitted the lawsuit in May, said it had reached out to Aldi several times about the confusingly similar packaging.\n\nAlthough Aldi did discontinue or alter the packaging of some products, the supermarket has continued making unacceptable copies, the lawsuit stated.\n\nThe company claimed that if Aldi is allowed to continued with its product lines, it will irreparably harm the Mondelz brand.\n\nThe lawsuit included side-by-side pictures comparing the appearances of Mondelz product with Aldis.\n\nMondelz lawsuit The snack giant included side-by-side pictures of their products (L) next to Aldis biscuit brands (R)\n\nIn the lawsuit, Aldi is accused of trademark infringement, unfair competition and unjust enrichment. Mondelz said it is seeking damages.\n\nMondelz described Aldis business model as hinging on low-priced private label products that resemble the look and feel of well-known brands.\n\nAldi, which has its headquarters in Germany, is known as a discount supermarket offering affordable alternatives to well-known brands.\n\nThere are over 2,500 Aldi shops in the US.\n\nThis is not the first time Aldi has been embroiled in a trademark battle. Earlier this year, it lost a battle with Cider producers Thatchers, which accused the supermarket of copying its drink in taste and appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04041224/oreo.webp",
            "description": "<p>BBC The corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of “blatantly” copying the packaging of its famous snacks. Court documents showed that Mondelēz International said Aldi uses similar packaging likely to “deceive” consumers and “ride the coattails” of the company’s “attraction, fame and prestige”. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/\">Oreo maker sues Aldi in US over ‘copycat’ packaging</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Jun 2025"
        }
    ]
}