{
    "news": [
        {
            "title": "Electronic Know Your Customer (eKYC) Explained",
            "url": "https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/",
            "content": "As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently?\n\nThe answer lies in eKYCshort for electronic Know Your Customer. This digital approach to verifying customer identity is now a cornerstone of modern financial services, enabling fast, secure, and scalable customer onboarding.\n\neKYCis the digital counterpart of traditional KYC procedures. It allows companies to verify identities without requiring physical presence or paper-based documentation. By using biometric data, document scanning, and real-time analytics, eKYC systems authenticate users remotely, ensuring compliance and security while streamlining the user experience.\n\nWhile both eKYC and traditional KYC aim to prevent financial crime such as money laundering and terrorism financing, the key difference lies in how they operate. Traditional KYC relies on physical documents and in-person checks, whereaseKYC solutionsare fully automated, using facial recognition, liveness detection, and AI to validate identities.\n\nAdopted globally, eKYC technology has become especially prominent since 2022. Regulatory bodies, such as the Qatar Central Bank, have already established frameworks for eKYC verification, including allowing non-residents to onboard digitally with official approval.\n\nThe debate of eKYC vs KYC is really about automation and scale. Heres how they differ:\n\nAspect\n\nTraditional KYC\n\neKYC\n\nDocument Submission\n\nIn-person, physical documents\n\nOnline upload, real-time capture\n\nVerification Method\n\nManual inspection\n\nAutomated checks with AI and biometrics\n\nSpeed\n\nDays\n\nSeconds\n\nAccessibility\n\nLimited to branch hours\n\n24/7 global access\n\nCost\n\nHigh operational costs\n\nLower due to automation\n\nUltimately, eKYC solutions provide a faster, more efficient route to customer identity verificationespecially for remote and mobile-first environments.\n\nLets break down how a typical eKYC verification workflow works:\n\nIn a well-optimized flow, all these steps occur in secondsthanks to automated eKYC verification and seamless eKYC processes.\n\nAdopting eKYC technology offers organizations numerous advantages:\n\nThere are multiple eKYC types, depending on the channel and depth of verification:\n\nEach type offers a different balance of user convenience, speed, and regulatory compliance.\n\neKYC verification is being rapidly adopted across various sectors:\n\nExample: N26, a German neobank, uses automated eKYC solutions to autofill user data after scanning a document, expediting form completion.\n\nExample: Binance restricts unverified users to withdrawals only. Kraken mandates full eKYC verification to trade.\n\nAcross these industries, eKYC technology ensures security, compliance, and a frictionless customer experience.\n\nAs AI-generated photos and videos become more convincing, electronic Know Your Customer systems face rising fraud risks. A Regula study found over half of firms in Crypto and FinTech had encountered AI-driven spoofing.\n\nRegulations vary by region. For example, the Qatar Central Bank now mandates active liveness detectione.g., head movementson mobile apps and kiosks.\n\nRobust eKYC systems require high-performance servers, secure APIs, and advanced IDV tools. Companies must balance security with usability.\n\nFraudsters may exploit customer eKYC by mimicking reverification requests. Customers who recently completed verification are more likely to fall for scams.\n\nSolution: Launch fraud awareness hubs like Danske Banks support portal to educate users.\n\nThe shift toward digital banking and identity services makes eKYC more important than ever. With eKYC verification now a regulatory expectation in many countries, businesses that adopt this approach early will gain a competitive edge.\n\nWhether youre launching a neobank, enhancing a FinTech app, or optimizing compliance in crypto, investing in eKYC technology ensures secure and seamless customer onboarding. And as digital identity wallets and verifiable credentials evolve under initiatives like the EUs eIDAS update, eKYC solutions will only grow more robust and reusable.\n\nNow is the time to modernize your identity verification strategy. With partners like Regula, you can deploy advanced document verification, facial recognition, and liveness detection toolsready to support your transformation into the future of secure digital finance.\n\n",
            "image_url": null,
            "description": "<p>As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently? The answer lies in eKYC—short for electronic Know Your Customer. This digital</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/\">Electronic Know Your Customer (eKYC) Explained</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Former Minister Mzembi challenges placement on remand",
            "url": "https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/",
            "content": "By Mary Taruvinga\n\nFormer Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand.\n\nMzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application.\n\nHis lawyer, Killian Mandiki, intends to file written submissions before the State responds.\n\nFollowing his arrest last month, Mzembi had his bail revoked by a Harare magistrate who trashed his application for cancellation of arrest warrants, ruling that he failed to report back on time when he got the opportunity.\n\nMandiki had told the court that the former minister was not in wilful default.\n\nMzembi said he was sick with a life-threatening condition and was hospitalised most of the time.\n\nHe also said he only decided to come back home after noticing that his health had improved.\n\nBut the magistrate said Mzembi was not sick to the extent that he could not attend court.\n\nIn revoking Mzembis bail, the magistrate also noted that Mzembi was the campaigning manager for fellow former minister Saviour Kasukuwere, who is currently exiled in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01102551/mzembi.png",
            "description": "<p>By Mary Taruvinga Former Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand. Mzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application. His lawyer, Killian Mandiki, intends to file written submissions before the State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/\">Former Minister Mzembi challenges placement on remand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Train runs over lifeless man, another killed while lying on rail tracks",
            "url": "https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/",
            "content": "By Staff Reporter\n\nA NATIONAL Railways of Zimbabwe (NRZ) trainon Mondayran over a man who is believed to have already been dead.\n\nThe incident happened atOdzi Siding near the eastern border city of Mutare.\n\nThe NRZ confirmed the incident in a statement.\n\nA man was run over by a train early this morning at Odzi Siding near Mutare. The man was lying lifeless on the tracks and did not respond to the approaching trains sounding horn.\n\nThe train crew suspect the man was already dead by the time he was run over. The man had no identity particulars on him and the scene was attended by ZRP, reads the statement.\n\nIn a separate but similar incident, a man identified as Peter Vengesayi was run over by a train near Zvishavane, Midlands province.\n\nIn yet another tragic incident today, a man died after being run over by a train near Zvishavane.\n\nPeter Vengesayi of Village 1, Zeederburg under Chief Mafala was lying on the tracks when the incident occured. The NRZ extends its condolences to his family, said NRZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/17224403/National-Railways-of-Zimbabwe.jpg",
            "description": "<p>By Staff Reporter A NATIONAL Railways of Zimbabwe (NRZ) train on Monday ran over a man who is believed to have already been dead. The incident happened at Odzi Siding near the eastern border city of Mutare. The NRZ confirmed the incident in a statement. “A man was run over by a train early this morning at Odzi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/\">Train runs over lifeless man, another killed while lying on rail tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Ladysmith Black Mambazo honoured with prestigious award",
            "url": "https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/",
            "content": "TshisaLive\n\nLadysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence.\n\nThegroup, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing ofumculo wesintu, South Africas indigenous music.\n\nIn their acceptance speech, the group thanked Ukhozi FM for this recognition.\n\nWe stand humbled and honoured. Ukhozi FM celebrated us for the role weve played in nurturing and growingumculo wesintu our indigenous music. From the hills of Ladysmith to stages around the world, weve carried the sounds of our ancestors with pride,said Sibongiseni Tshabalala, the son of the founder of Ladysmith Black Mambazo,JosephTshabalala.\n\nThank you, Ukhozi FM, for this beautiful recognition.Siyabonga,thank you for walking this journey with us.\n\nThe group were among other notable artists  Nothembi Mkhwebane, Ringo and Makhadzi  who graced the stage with captivating performances.\n\nThis year marks 65 years of Ladysmith Black Mambazo in the music industry and to celebrate the milestone they are undertaking a special tour.\n\nAfter wrapping up their US tour and the first instalment of the national tour in Johannesburg, the group have performances lined up in Durban and Cape Town.\n\nIts such an amazing experience to walk in the footsteps of our father, the founder of the group Joseph Shabalala, and all others who founded the group. I have realised that I have been with the group for more than 30 years now, said Sibongiseni.\n\nThis means the legacy of the group is continuing to grow from glory to glory. In a few years from now we will celebrate 70 years, an incredible milestone in the history of music. We thank South Africans , the continent and the world for supporting us throughout this journey.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01014629/black-mambazo.png",
            "description": "<p>TshisaLive Ladysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence. The group, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing of umculo wesintu, South Africa’s indigenous music. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/\">Ladysmith Black Mambazo honoured with prestigious award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "EJWP backs gender policy to advance equality across Zimbabwe",
            "url": "https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/",
            "content": "By Alois Vinga\n\nTHE Economic Justice for Womens Project (EJWP) says the recently approved gender policy will go a long way inharnessinggender equality nationwide.\n\nCabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and womens empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives.\n\nIt provides a unified structure for monitoring gender equality and addresses systemic inequalities across various sectors of Zimbabwean society.\n\nSpeaking to NewZimbabwe.com this week, EJWP Executive Director, Margaret Mutsamvi, described the enactment of the blueprint as a giant step.\n\nThe recent Cabinets approval of the National Gender Policy (2025) is a significant milestone in Zimbabwes journey toward gender equality and womens empowerment. This development follows EJWPs submission of an urgent petition on 14 March 2025, calling for the renewal of the policy, which had lapsed in 2021  a gap that threatened to reverse hard-earned gains in gender equity, she said.\n\nThe CSO described the new policy as a foundation for a more inclusive, equitable and gender-responsive Zimbabwe, with clearly defined strategies to address systemic barriers across legal, economic, health, education, climate, and digital spheres.\n\nThe new policy, EJWP said, marks a shift from aspiration to action  offering a renewed national mandate to address entrenched gender disparities.\n\nAs EJWP, we remain deeply committed to supporting the full implementation of this policy, particularly around inclusive economic empowerment and accountability in public resource management. We will continue to monitor progress, engage with duty bearers, and amplify the voices of women, especially those in marginalised and economically excluded communities, added Mutsamvi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/27052230/Margaret-Mutsamvi.jpg",
            "description": "<p>By Alois Vinga THE Economic Justice for Women’s Project (EJWP) says the recently approved gender policy will go a long way in harnessing gender equality nationwide. Cabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and women’s empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives. It provides</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/\">EJWP backs gender policy to advance equality across Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Zimbabwean farmers embrace AI and digital tools through FAO-led rural initiative",
            "url": "https://www.newzimbabwe.com/zimbabwean-farmers-embrace-ai-and-digital-tools-through-fao-led-rural-initiative/",
            "content": "TechAfricaNews\n\nThe Food and Agriculture Organization of the United Nations(FAO)is advancing agrifood systems through integration of effective digital technologies in Zimbabwe. Through the Fostering Digital Villages Initiative (FDiVi), FAO hosted a Digital Fair in the Masvingo province.\n\nThe digital fair brought together digital service providers, farmers, agri-entrepreneurs, and other stakeholders, creating a dynamic platform for knowledge exchange and real-time onboarding to digital agriculture solutions. The digital fair is part of the broader Fostering Digital Villages through innovative advisory and profitable market services project, which aims to transform agrifood systems in rural Malawi, Rwanda, and Zimbabwe using effective digital technologies, including artificial intelligence.\n\nThis project facilitates delivery of innovative agricultural extension services for increased productivity, enhanced market access, and advance inclusive rural transformation. It will also support local farmers, extension officers, agro-dealers, and processors, particularly the youth and women.\n\nPatrice Talla, FAO Subregional Coordinator for Southern Africa and Representative, Zimbabwe.\n\nThe digital fair held in the Bikita district is part of a series of the ongoing campaign by FAO targeting digital service providers, rural farmers, agri-entrepreneurs and other stakeholders to interact and integrate digital technologies in agriculture. The digital fair sparked renewed enthusiasm for digital transformation in agriculture among local communities.\n\nSpeaking during the digital fair, Bernard Hadzirambwi, the District Development Coordinator, praised the initiative and encouraged farmers to adopt digital technologies to enhance productivity and resilience.\n\nRural innovation thrives when communities connect and interact with digital technology.\n\nBernard Hadzirambwi, the District Development Coordinator, Zimbabwe.\n\nDuring the digital fair, our farmers explored AI-powered advisory tools, mobile market platforms, and digital extension services. I am truly encouraged by how quickly the community is embracing these innovations. Digital technologies are not just tools, they are enablers of climate-smart agriculture and inclusive rural development in our district.\n\nNobert Chiduza, District Agricultural Extension Officer in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Zimbabwe.\n\nThe FDiVi is one of FAOs corporate initiatives and flagship programmes. It is an integrated development vision that enshrines digitalization at the core of rural transformation and prosperity, addressing on-farm and off-farm socio-economic elements.\n\nThe project is being implemented in the Mhondoro-Ngezi and Bikita districts where digital hubs will be equipped with digital tools and services including free internet, computers and digital literacy training materials.\n\nThe project supports local farmers, extension officers, agro-dealers, and processors through facilitating access to innovative agricultural extension services, improving market access, and promoting inclusive rural transformation.\n\nBefore the digital fair, I didnt know how much technology could change the way I farm. Now, Ive learned about AI tools that help me plan better, and I can connect directly with buyers through my phone. As a young farmer, this gives me confidence in exploring new opportunities posed through digital technologies.\n\nSheunesu Njeke, a 26-year-old farmer, Zimbabwe.\n\nGoing forward, FAO will integrate Digital Fairs in the annual District and Ward level Agriculture Shows. The project will continue to support digital innovators and entrepreneurs in breaking into the rural market and will also support farmers and other rural stakeholders to safely onboard onto digital platforms and services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01012204/farmers-FAO.png",
            "description": "<p>TechAfricaNews The Food and Agriculture Organization of the United Nations (FAO) is advancing agrifood systems through integration of effective digital technologies in Zimbabwe. Through the Fostering Digital Villages Initiative (FDiVi), FAO hosted a Digital Fair in the Masvingo province. The digital fair brought together digital service providers, farmers, agri-entrepreneurs, and other stakeholders, creating a dynamic platform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-farmers-embrace-ai-and-digital-tools-through-fao-led-rural-initiative/\">Zimbabwean farmers embrace AI and digital tools through FAO-led rural initiative</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Insider in US$500k robbery at ex-Dynamos chairman’s shop in court, remanded in custody",
            "url": "https://www.newzimbabwe.com/insider-in-us500k-robbery-at-ex-dynamos-chairmans-shop-in-court-remanded-in-custody/",
            "content": "By Mary Taruvinga\n\nThe alleged insider behind the recent US$500,000 robbery at a shop owned by former Zimbabwe Warriors team manager and Dynamos chairman, Rafiq Adam, appeared in court Monday, charged with armed robbery.\n\nSamson Gora (35) of Acadia in Harare appeared before Magistrate Donald Ndirowei who denied him bail.\n\nHe will be back in court on July 16 for his routine remand.\n\nAccording to the state, June 16 2025 and at around 0900 hours the accused person hatched a plan to rob his employer, Adam of Merchantman Enterprises at number 93 Cameroon street, Harare.\n\nIt is alleged that he supplied information to his accomplices about where the money was being kept at his workplace.\n\nIn pursuant of their plan his accomplices Nyengerayi\n\nChikwadze alias Chipato, Oscar Muchenje and other 2 unknown South Africans, whilst armed with a pistol, approached the complainant who was seated in his reception pretending to be genuine clients.\n\nOne of the accused withdrew a pistol from his pocket and hit the complainant with a pistol butt on his forehead demanding for money, the court heard.\n\nThe complainant surrendered US$500 and safe keys, which were in his pockets.\n\nThe accused persons later force marched the complainant to his office where they unlocked a safe with those keys and stole US$600,000 which was inside.\n\nThey allegedly ransacked the offices and took an iPhone 13 Pro and a Samsung Fold cellphones which were in the Directors office, a Samsung galaxy, a Samsung 04, an Iphone 16 Promax and a V-lion cellphones from four employees who were in the cash office.\n\nThe gang then left the shop and they dropped an iPhone 16 Promax and a Samsung Galaxy along Leopold Takawira near ENBEE shop and they went away with the rest of their loot.\n\nOn 27 June 2025, Detectives from CID Homicide Harare received information to the effect that Gora was involved in the armed robbery.\n\nDetectives swiftly reacted to the information and arrested Gora who was at his place of work.\n\nThe court heard Gora was interviewed and he indicated that indeed he had supplied information about that money at his workplace to his accomplices.\n\nHe was further interviewed and indicated that he was given US$10,000 as his share by Nyengerayi Chipadze alias Chipato who alleged to have been given a total of US$20,000 by Oscar and the South Africans.\n\nGora then led the police to his brother Willard Gora where he had concealed his loot leading to the recovery of cash US$4,400, 3x Samsung Note 20 cellphones, 3x Samsung Galaxy cellphones bought for US$1,500 and a Toyota Hiace on registration numbers AFT1573 which had been bought from the proceeds.\n\nRufaro Chonzi prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga The alleged insider behind the recent US$500,000 robbery at a shop owned by former Zimbabwe Warriors team manager and Dynamos chairman, Rafiq Adam, appeared in court Monday, charged with armed robbery. Samson Gora (35) of Acadia in Harare appeared before Magistrate Donald Ndirowei who denied him bail. He will be back in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/insider-in-us500k-robbery-at-ex-dynamos-chairmans-shop-in-court-remanded-in-custody/\">Insider in US$500k robbery at ex-Dynamos chairman’s shop in court, remanded in custody</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "With tobacco output record already set, Zimbabwe eyes 400m kg milestone",
            "url": "https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/",
            "content": "Tobacco Reporter\n\nTwo weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this years crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million kg.\n\nDriving the surge is a sharp increase in smallholder participation, government-led reforms, and research-driven innovations. More than 127,000 farmers, 85% of them smallholders, are registered this season, which ensures access to inputs, training, and markets.\n\nDr. Frank Magama, CEO of Kutsaga, Zimbabwes leading tobacco research institute, credited the Tobacco Value Chain Transformation Plan introduced in 2021 for boosting productivity through better farming practices, climate-smart seed varieties, and sustainability initiatives.\n\nOver 80% of our crop was produced under contract, ensuring inputs, technical support, and guaranteed markets, Magama said. While expansion has occurred, what is more exciting is the productivity increase per unit area. With improved post-harvest handling, energy-efficient barns, and better training, the numbers are speaking for themselves.\n\nHe also warned, however, of the risks from global oversupply and stressed the importance of environmental compliance to maintain competitiveness.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31054919/Tobacco-Agriculture.jpg",
            "description": "<p>Tobacco Reporter Two weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this year’s crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/\">With tobacco output record already set, Zimbabwe eyes 400m kg milestone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Three days of protests leave seven dead in Togo, rights groups say",
            "url": "https://www.newzimbabwe.com/three-days-of-protests-leave-seven-dead-in-togo-rights-groups-say/",
            "content": "BBC\n\nCivic rights groups say at least seven people have been killed during a crackdown on protesters who are calling for Togos leader, Faure Gnassingb, to step down and release political prisoners.\n\nSeven bodies were recovered from rivers in the capital city Lom, according to a coalition called Le Front Citoyen Togo Debout which accuses security forces and militias of committing abuses.\n\nThe Togolese government has denied these deaths were linked to last weeks demonstrations.\n\nIt is now threatening legal action against the protest organisers, calling the protests a campaign of disinformation and hatred that was orchestrated from abroad.\n\nThere is growing anger in Togo due to a crackdown on critical voices, and changes to the constitution labelled by labelled by critics and opposition figures as an institutional coup dtat.\n\nThese protests comes weeks after Gnassingb  who was president for two decades and whose family has ruled the country for 58 years  wassworn into a new post of President of the Council of Ministers, which has no official term limits.\n\nDemonstrations have been banned in the West African country since 2022, with the authorities citing security reasons.\n\nThree days of demonstrations by online activists and youth-led movements began in Lom on Thursday, before taking a violent turn on Friday and Saturday.\n\nTear gas was fired by anti-riot police at protesters, who pelted them with stones and other missiles.\n\nSome determined anti-government protesters engaged security forces in street battles in several areas considered to be opposition strongholds, including B, where police chased demonstrators into their hideouts.\n\nA coalition of 23 Togolese civil rights groups  known as the National Platform for Civic Space and Development Effectiveness  has since asked the authorities to carry out investigations into the bloody police repression.\n\nThey condemned what they described as the use of disproportionate force against peaceful demonstrators, adding that peaceful protest is a fundamental right, recognized both by the Togolese Constitution and by international instruments ratified by our country.\n\nBy Sunday calm had returned to most of Lom, with shops reopened at the main central market at Assigam and businesses operating as usual.\n\nThe recent change of regime orchestrated by the Togolese leader continues to fuel resentment. In addition to the new post which he can keep for life, constitutional reform in Togo has ended presidential elections, and introduced a parliamentary system.\n\nLast months arrest and psychiatric detention of the Togolese rapper Narcisse Essow Tchalla, also known as Aamron, acted as a catalyst for public outrage, culminating in over 50 arrests during protests earlier this month.\n\nThough most have been released, at least three people remain in custody.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01005735/Screenshot-2025-07-01-at-01.55.48.png",
            "description": "<p>BBC Civic rights groups say at least seven people have been killed during a crackdown on protesters who are calling for Togo’s leader, Faure Gnassingbé, to step down and release political prisoners. Seven bodies were recovered from rivers in the capital city Lomé, according to a coalition called Le Front Citoyen Togo Debout which accuses</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-days-of-protests-leave-seven-dead-in-togo-rights-groups-say/\">Three days of protests leave seven dead in Togo, rights groups say</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        }
    ]
}