{
    "news": [
        {
            "title": "Free to Worship brings spirit-filled legacy concerts to Australia, headlined by Mathias Mhere",
            "url": "https://www.newzimbabwe.com/free-to-worship-brings-spirit-filled-legacy-concerts-to-australia-headlined-by-mathias-mhere/",
            "content": "By Chipo Sabeta\n\nCelebrated gospel artist Mathias Mhere is set to headline the Free to Worship Legacy Concerts in Australia, a series of worship events bringing together believers from around the world for nights of praise, unity, and celebration.\n\nSupported byDiaspora Insurance, the highly anticipated concerts will be held across three major cities next month: Melbourne on November 7, Sydney on November 8, and Perth on November 9, marking one of the most significant international tours for the Free to Worship movement.\n\nFree to Worship began as a small group of passionate singers united by a common mission: to worship God freely. Over the years, the choir, part of ZAOGA Forward in Faith Ministries International (FIFMI),has grown into a globally recognised ensemble of gifted vocalists and musicians who embody the energy, unity, and faith of FIFs vision.\n\nThrough dedication, teamwork, and steadfast partnerships,including long-standing support from Diaspora Insurance,Free to Worship has transformed from humble beginnings into a global phenomenon. The groups mission is to demonstrate that when people are truly free to worship, lives are changed, hearts are healed, and nations are uplifted.\n\nDiaspora Insurance CEO Jeff Madzingo (left), ZAOGA Forward in Faith Australia Bishop Masaka (centre), and Free to Worship Chairman Tawanda Sarireni (right) were recently pictured at the FIFMI Australia Believers Convention, celebrating the enduring partnership between Diaspora Insurance and Free to Worship.\n\nFor over a decade,Diaspora Insurancehas been a faithful partner of the movement, supporting its efforts to spread hope and faith through music.\n\nKnown for their powerful and spirit-filled concerts, Free to Worship events have become landmark gatherings on the FIF calendar, drawing thousands of worshippers across cities and nations. Each concert brings an atmosphere of revival, joy, and community through original music, dynamic praise, and heartfelt worship that transcends cultures and languages.\n\nWe have been praising God from our humble beginnings until now, when we are having sold-out shows, said Chairman Tawanda Sarireni. With Free to Worship concerts selling out and packing arenas over three consecutive years, there has been a longing to see the group live by many overseas fans.\n\nFree to Worship\n\nBeyond the stage, Free to Worship also serves as a training ground for young believers, helping them discover and nurture their God-given musical talents. Many alumni have gone on to inspire others in both local and international ministries, carrying the same anointing and excellence that define the group.\n\nSarireni said the choir continues to unite worship leaders, gospel singers, and instrumentalists from various churches and nations, strengthening the message of unity in faith.\n\nFounded by the late Archbishop Ezekiel Guti, Free to Worship continues to shine as a vessel of praise, reminding believers everywhere that music, faith, and devotion can transform communities and touch nations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/22052508/free-to-worship-3.jpeg",
            "description": "<p>By Chipo Sabeta Celebrated gospel artist Mathias Mhere is set to headline the Free to Worship Legacy Concerts in Australia, a series of worship events bringing together believers from around the world for nights of praise, unity, and celebration. Supported by Diaspora Insurance, the highly anticipated concerts will be held across three major cities next</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/free-to-worship-brings-spirit-filled-legacy-concerts-to-australia-headlined-by-mathias-mhere/\">Free to Worship brings spirit-filled legacy concerts to Australia, headlined by Mathias Mhere</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "22 Oct 2025"
        },
        {
            "title": "From cancer survivor to ZOC CEO: The inspiring journey of Marlene Chiedza Gadzirayi",
            "url": "https://www.newzimbabwe.com/from-cancer-survivor-to-zoc-ceo-the-inspiring-journey-of-marlene-chiedza-gadzirayi/",
            "content": "By Chipo Sabeta\n\nWhen life tested her with one of its toughest battles, Marlene Chiedza Gadzirayi faced it with remarkable courage and grace. Today, she stands not only as a cancer survivor but also as the Chief Executive Officer of the Zimbabwe Olympic Committee (ZOC), a symbol of resilience, leadership, and hope.\n\nMarlenes journey took a sudden turn in September 2019 when she was diagnosed with stage three colorectal cancer, a diagnosis that would challenge her both physically and emotionally. The road to recovery was far from easy, marked by surgery, 40 sessions of radiotherapy and chemotherapy, uncertainty and moments that tested her strength.\n\nYet, through it all, the 30-year-old accountant remained steadfast and determined, drawing on her faith, her support system, and her deep inner resolve.\n\nMarlene undergoing cancer treatment\n\nBy 2020, Marlene had entered remission, emerging from her treatment with renewed gratitude for life and an unshakable sense of purpose. Now, five years in remission, though not yet officially declared cancer-free, she continues to live with courage and conviction. It is a daily reminder that healing is both a physical and spiritual journey.\n\nChoosing not to keep her story private, Marlene uses her voice to inspire others and advocate for cancer awareness, encouraging early screening, open conversations about health, and emotional support for those facing similar struggles.\n\nMarlene uses her voice to inspire others and advocate for cancer awareness\n\nHer message is simple yet profoundly powerful: Cancer is not the end. With courage, treatment, and support, there is life beyond diagnosis.\n\nProfessionally, Marlene is a force of determination and excellence. She holds a bachelors degree in accountancy (BAcc), a Master of Science in Management and Finance, and an MBA, academic achievements that mirror her commitment to growth, integrity, and leadership. Her career has spanned several significant roles, including with the Footballers Union of Zimbabwe and Education Matters Africa, before taking on her current position as CEO of the Zimbabwe Olympic Committee.\n\nIn her role at ZOC, Marlene continues to lead with vision, empathy, and integrity, championing initiatives that empower athletes and promote inclusivity, sustainability, and good governance in sport. Her leadership is shaped not only by her professional expertise but also by the compassion and resilience honed through her personal journey of survival.\n\nMarlene celebrated her victory over cancer in 2020, a joyful moment that embodies her strength and resilience.\n\nMarlenes story is more than one of professional success. It is a living testament to faith, perseverance, and the unbreakable power of the human spirit.\n\nThrough her life and work, she reminds us of all that even in the face of adversity, strength and purpose can prevail. She reminds us that surviving cancer can mark the beginning of a renewed mission to live boldly and lead with heart.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21125707/Marlene-2.jpeg",
            "description": "<p>By Chipo Sabeta When life tested her with one of its toughest battles, Marlene Chiedza Gadzirayi faced it with remarkable courage and grace. Today, she stands not only as a cancer survivor but also as the Chief Executive Officer of the Zimbabwe Olympic Committee (ZOC), a symbol of resilience, leadership, and hope. Marlene’s journey took</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-cancer-survivor-to-zoc-ceo-the-inspiring-journey-of-marlene-chiedza-gadzirayi/\">From cancer survivor to ZOC CEO: The inspiring journey of Marlene Chiedza Gadzirayi</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "22 Oct 2025"
        },
        {
            "title": "TIGERE moves to expand property portfolio",
            "url": "https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/",
            "content": "By Alois Vinga\n\nTigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million.\n\nThe REIT said the proposed acquisitions are subject to unitholder approval and will be fully funded through the issuance of 770.5 million new Tigere REIT units.\n\nThis marks Tigere REITs second acquisition since its initial public offering (IPO), following the successful purchase of Highland Park Phase 2. The move aligns with the funds strategy of securing high-quality, income-generating real estate assets supported by long-term, US dollar-denominated leases, a key driver for stable returns and capital growth.\n\nThe total acquisition consideration reflects the combined net asset value (NAV) of the target properties. Upon completion, Tigere REITs total units in issue will increase to 1.84 billion, with the newly issued units representing 41.8% of the enlarged unit base.\n\nThe implied issuance price per unit for the transaction stands at US$3.26 cents, representing a 2.536% premium over Tigere REITs NAV per unit of US$3.18 as of June 30, 2025.\n\nThe bulk of the transaction involves the Greenfields Retail Centre, acquired on a leasehold basis. The property, whose development began in December 2024, features 54 tenants across 14,000m of gross lettable area (GLA) and is currently fully occupied.\n\nTigere REIT said the acquisitions will further strengthen its portfolio of high-quality retail assets, supporting consistent returns and sustainable long-term growth for investors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21180820/greenfields-retail.jpg",
            "description": "<p>By Alois Vinga Tigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million. The REIT said the proposed acquisitions are subject to unitholder approval</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/\">TIGERE moves to expand property portfolio</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "22 Oct 2025"
        },
        {
            "title": "DNC bus that killed 43 people was unroadworthy, overloaded and speeding – Limpopo Premier",
            "url": "https://www.newzimbabwe.com/dnc-bus-that-killed-43-people-was-unroadworthy-overloaded-and-speeding-limpopo-premier/",
            "content": "IOL\n\nLimpopo Premier Dr Phophi Ramathuba has describedthe deadly N1 bus crash that claimed 43 livesas a preventable disaster and an act of criminal negligence, following revelations that the vehicle was overloaded, unroadworthy and speeding when it plunged down a steep embankment near Louis Trichardt last week.\n\nOn Monday, Ramathuba met with the families and relatives of the deceased at Siloam Hospital in the Vhembe District, where she extended her condolences and expressed solidarity with those mourning the loss of their loved ones. Addressing the gathering, she said the tragedy was not an unavoidable act of fate but the result of lawlessness and greed within the cross-border transport industry.\n\nThe victims  mostly Zimbabwean and Malawian nationals  were travelling home when the bus veered off the N1 North near Louis Trichardt on 13 October, killing 43 passengers and injuring 40 others.\n\nAccording to a technical report by the Road Traffic Management Corporation (RTMC), the bus was operating without meeting roadworthiness standards, carried passengers beyond its legal limit and was travelling at an unsafe speed along a mountainous route. Ramathuba said such conditions made the tragedy not just an accident, but a crime against humanity.\n\nThe government will not allow lives to be lost due to greed, lawlessness and disregard for human life, she said. We condemn reckless driving, non-compliance with transport regulations, and the operation of unroadworthy vehicles. The law must take its course, and those responsible must be held accountable.\n\nLimpopo Premier Dr Phophi Ramathuba\n\nRamathuba also commended the emergency services and hospital staff who responded to the scene, saying their swift action saved lives under difficult and dangerous conditions. Our rescue teams risked their own lives to retrieve bodies and transport survivors to safety. Their commitment gave dignity to the deceased and comfort to the grieving, she said.\n\nThe Limpopo government has partnered with the diplomatic missions of Zimbabwe and Malawi to identify and repatriate the deceased. Forensic teams have completed postmortem examinations and begun DNA testing to ensure accurate identification of remains.\n\nFamilies of the victims were provided with counselling and logistical support as they began the painful process of identifying their loved ones.\n\nThe tragedy has reignited concerns over South Africas road safety record and the persistent operation of unsafe, overloaded cross-border buses. Transport experts and activists have long warned that weak enforcement and corruption in vehicle inspections allow dangerous operators to remain on the road, turning long-distance routes into death corridors.\n\nFor many families, the loss goes beyond the immediate grief  it also means the loss of breadwinners who had been working in South Africa to support relatives in neighbouring countries.\n\nEvery life lost on our roads is a blow to a family, a community, and to our shared humanity, Ramathuba said.\n\nAs the province continues to assist with repatriations and investigations, the premier urged all road users to prioritise safety and accountability.\n\nLife has no duplicate, she said.\n\nEvery journey must begin with responsibility. Let us not wait for another disaster to remind us of the value of a single human life.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14083758/dnc-bus.webp",
            "description": "<p>IOL Limpopo Premier Dr Phophi Ramathuba has described the deadly N1 bus crash that claimed 43 lives as “a preventable disaster” and “an act of criminal negligence,” following revelations that the vehicle was overloaded, unroadworthy and speeding when it plunged down a steep embankment near Louis Trichardt last week. On Monday, Ramathuba met with the families</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-that-killed-43-people-was-unroadworthy-overloaded-and-speeding-limpopo-premier/\">DNC bus that killed 43 people was unroadworthy, overloaded and speeding – Limpopo Premier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "22 Oct 2025"
        },
        {
            "title": "There is no legal mechanism – Madhuku trashes Zanu PF plans to illegally extend Mnangagwa’s second term to 2030",
            "url": "https://www.newzimbabwe.com/there-is-no-legal-mechanism-madhuku-trashes-zanu-pf-plans-to-illegally-extend-mnangagwas-second-term-to-2030/",
            "content": "By Leopold Munhende\n\nCONSTITUTIONAL law expert Professor Lovemore Madhuku has trashed Zanu PFs attempts to illegally extend President Emmerson Mnangagwas second term to 2030.\n\nDespite initially professing ignorance, analysts believe it is now clear Mnangagwa wants to hang on beyond his constitutionally mandated two terms using a combination of possible legal lacuna, manipulation of constitutional provisions and monetary rewards for Parliamentarians.\n\nMadhuku, who is strongly opposed to the idea, was speaking to online news platform 263Chat.\n\nWe do not know how they intend to do it; they have not indicated how they would want to amend the constitution but what is very clear is that it is not possible to ensure that when the presidents term ends in 2028, he remains in office beyond 2028, said Madhuku.\n\nThere is no legal mechanism of doing it as it currently stands.\n\nPassed as a resolution at Zanu PFs Bulawayo congress in 2024, extending Mnangagwas term has dominated Zimbabwean politics since then, further dividing an already fragile society that is still traumatised by late President Robert Mugabes lengthy stay in power.\n\nMugabe was in power for 37 years, eventually losing power in a military-backed coup in 2017.\n\nWith Section 91 (2) limiting Presidents stay in office to two five-year terms and demanding a referendum to change it, Zanu PF is understood to have devised a way around it, completely avoiding the general populations involvement.\n\nAdded Madhuku: The kind of amendments they are talking about are not possible without a referendum. There are a few things you can amend without going for a referendum but if you want to tamper with the term of office of the president, the exercise of executive powers or the structure of the state, you cannot avoid a referendum.\n\nThis idea of avoiding a referendum means that they know that this proposal is not popular with the people.\n\nExiled former government minister, Jonathan Moyo, who is behind a document (Breaking Barriers Initiative) said to not just map the way for Zanu PF but suspend elections, believes Mnangagwas term can legally be lengthened without going to a referendum.\n\nA well-respected think-tank, Moyos work with Zanu PF indicates a party determined to extend Mnangagwas term, which will mean shutting the door of succession on his deputy Constantino Chiwenga, who is eagerly waiting for a shot at the presidency.\n\nThe Constitutions sole presidential term limit on the officeholder lies in Section 91(2)s two-term bar, which would remain untouched by a term length amendment to Section 95(2)(b), said Moyo on X.\n\nAmending section 95(2)(b) to seven years, for instance, would simply recalibrate this flexible duration, enabling the extension to 2030 via a two-thirds vote in each House in Parliamentfree from the dictates of sections 328(6) (9).\n\nProfessor Lovemore Madhuku\n\nAttempts to extend Mnangagwas stay are part of factional fights within the ruling party.\n\nMnangagwas continued stay will be a boon for his preferred successor, businessman Kudakwashe Tagwirei, who recently joined the partys powerful Central Committee.\n\nFor Chiwenga, it would mean going back to the drawing board, or as some have predicted, planning and executing another coup as he did in 2017.\n\nIt is wrong for any political party on its own to want to impose a constitution on the people, added Madhuku.\n\nTerm limits are actually imposed to limit very good presidents. They were invented to ensure that a person would not remain in office merely because they were doing wellwhich is why some of the best presidents have had to leave.\n\nTerm limits are for good presidents; you do not need term limits for a poor president who will obviously be removed in an election.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19070809/mnangagwa-cc.jpeg",
            "description": "<p>By Leopold Munhende CONSTITUTIONAL law expert Professor Lovemore Madhuku has trashed Zanu PF’s attempts to illegally extend President Emmerson Mnangagwa’s second term to 2030. Despite initially professing ignorance, analysts believe it is now clear Mnangagwa wants to hang on beyond his constitutionally mandated two terms using a combination of possible legal lacuna, manipulation of constitutional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/there-is-no-legal-mechanism-madhuku-trashes-zanu-pf-plans-to-illegally-extend-mnangagwas-second-term-to-2030/\">There is no legal mechanism – Madhuku trashes Zanu PF plans to illegally extend Mnangagwa’s second term to 2030</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "22 Oct 2025"
        },
        {
            "title": "French ex-president Sarkozy goes to jail over Gaddafi money",
            "url": "https://www.newzimbabwe.com/french-ex-president-sarkozy-goes-to-jail-over-gaddafi-money/",
            "content": "BBC\n\nNicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi.\n\nNot since World War Two Nazi collaborationist leader Philippe Ptain was jailed for treason in 1945 has any French ex-leader gone behind bars.\n\nSarkozy, who was president from 2007-2012, has appealed against his jail term at La Sant prison, where he will occupy a small cell in the its isolation wing.\n\nMore than 100 people applauded and shouted Nicolas! as he left his villa in the exclusive 16th district of Paris, holding his wife Carla Bruni-Sarkozy by the hand.\n\nHis son Louis, 28, had appealed to supporters for a show of support, while another son, Pierre, called for a message of love  nothing else, please.\n\nNicolas Sarkozy, 70, was driven through the entrance of the notoriously overcrowded 19th-Century prison in the Montparnasse district south of the River Seine at 09:40 local time (07:40 GMT), while dozens of police officers cordoned off most of the surrounding streets.\n\nHe continues to protest his innocence in the highly controversial Libyan money affair and posted a message on X as he was driven to the jail, saying: I have no doubt. Truth will prevail. But how crushing the price will have been.\n\nWith unwavering strength I tell [the French people] it is not a former president they are locking up this morning  it is an innocent man, he wrote. Do not feel sorry for me because my wife and my children are by my side but this morning I feel deep sorrow for a France humiliated by a will for revenge.\n\nMoments after Sarkozy entered jail, his lawyer Christophe Ingrain said a request for his release had been filed. Nothing justified his imprisonment, said Mr Ingrain, adding: Hell be inside for at least three weeks or a month.\n\nSarkozy has said he wants no special treatment at La Sant prison, although he has been put in its isolation section for his own safety as other inmates are infamous drugs dealers or have been convicted for terror offences.\n\nSarkozys cell in the prisons isolation wing is believed to be on the top floor and will measure between 9-11 sq m (95-120 sq ft). There had earlier been talk of him serving his term in the another wing for vulnerable people, where other VIPs have been jailed in the past.\n\nHe will have a toilet, a shower, a desk, a small electric hob and a small TV, for which he will have to pay a monthly 14 (12) fee, and the right to a small fridge.\n\nThe former president has the right to receive information from the outside world and family visits as well as written and phone contact.\n\nBut he is in effect in solitary confinement, allowed just one hour a day for exercise, by himself in the wings segregated courtyard.\n\nConditions of detention in an isolation wing are pretty hard, La Sant ex-deputy head Flavie Rault told BFMTV. You are alone, all the time. The only contact you have is with prison staff. You never come across another detainee for security reasons and theres a type of social isolation which makes life difficult.\n\nAt the end of last week, Sarkozy was received at the lyse Palace by President Emmanuel Macron, who told reporters on Monday it was normal that on a human level I should receive one of my predecessors in that context.\n\nMacron stressed on Tuesday that it was not his role to comment on or criticise judicial decisions, but he said it was normal that for many in France the sight of a president jailed by this judicial decision would provoke comment.\n\nIn a further measure of official support for the ex-president, Justice Minister Grald Darmanin said he would go to visit him in prison as part of his role in ensuring Sarkozys safety and the proper functioning of the jail.\n\nI cannot be insensitive to a mans distress, he added.\n\nEver since he left office in 2012, Sarkozy has been dogged by criminal inquiries and for months had to wear an electronic tag around his ankle after a conviction last December for trying to bribe a magistrate for confidential information about a separate case.\n\nLate next month, Frances highest administrative court will give its verdict on Sarkozys appeal against a six-month jail term in another illegal campaign financing case known as the Bygmalion affair.\n\nAhead of his arrival at La Sant prison, Sarkozy gave a series of media interviews, telling La Tribune: Im not afraid of prison. Ill keep my head held high, including at the prison gates.\n\nSarkozy has always denied doing anything wrong in a case involving allegations that his 2007 presidential campaign was funded by millions of euros in Libyan cash.\n\nThe former centre-right leader was cleared of personally receiving the money but convicted of criminal association with two close aides, Brice Hortefeux and Claude Guant, for their role in secret campaign financing from the Libyans.\n\nThe two men both had talks with Gaddafis intelligence chief and brother-in-law in 2005, a meeting arranged by a Franco-Lebanese intermediary called Ziad Tiakeddine, who died in Lebanon shortly before Sarkozys conviction.\n\nAs he lodged an appeal, Sarkozy is still considered innocent but he has been told he must go to jail in view of the exceptional seriousness of the facts.\n\nSarkozy said he would take two books with him into prison, a life of Jesus by Jean-Christian Petitfils and the Count of Monte Cristo, Alexandre Dumass classic story of a man wrongly imprisoned who escapes to wreak vengeance on his prosecutors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21173512/sarkozy.webp",
            "description": "<p>BBC Nicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi. Not since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945 has any French ex-leader gone</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/french-ex-president-sarkozy-goes-to-jail-over-gaddafi-money/\">French ex-president Sarkozy goes to jail over Gaddafi money</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "22 Oct 2025"
        },
        {
            "title": "Zimbabwe faces intensified power cuts as ZESA shuts down Hwange Unit 8 for 10 days",
            "url": "https://www.newzimbabwe.com/zimbabwe-faces-intensified-power-cuts-as-zesa-shuts-down-hwange-unit-8-for-10-days/",
            "content": "By Staff Reporter\n\nZimbabweans are set to endure worsening power cuts after ZESA Holdings announced that Hwange Power Stations Unit 8 has been taken off the grid for 10 days due to a technical fault,further straining the countrys already fragile electricity supply.\n\nThe shutdown comes at a time when Unit 3 has been offline since September 10 for statutory maintenance, which is expected to be completed by October 24.\n\nAs of October 21, the Zimbabwe Power Company (ZPC) was generating 1,296MW, far below the countrys peak demand of around 2,000MW.\n\nIn a statement released Tuesday, ZESA said Unit 8 will remain out of service for 10 days to allow for restoration work.\n\nZESA Holdings wishes to inform its valued stakeholders that Hwange Unit 8 has been taken off the grid due to a technical fault. The unit will be out of service for 10 days while restoration work is carried out.\n\nDuring this outage, Hwange Unit 7 will remain in operation, generating 335MW to support system stability, the statement read.\n\nThe utility added that power generation at Kariba South has been increased to help mitigate the temporary shortfall.\n\nGeneration at Kariba South Power Station has also been ramped up, with careful management of water allocations, to help compensate for the temporary shortfall.\n\nWe sincerely apologise for any inconvenience this may cause and appreciate your understanding as we work to restore the unit to service.\n\nUrban areas across Zimbabwe have already been experiencing up to 20 hours of load-shedding daily, a situation expected to worsen during the Unit 8 shutdown period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/09033305/Hwange-Power-Station.png",
            "description": "<p>By Staff Reporter Zimbabweans are set to endure worsening power cuts after ZESA Holdings announced that Hwange Power Station’s Unit 8 has been taken off the grid for 10 days due to a technical fault, further straining the country’s already fragile electricity supply. The shutdown comes at a time when Unit 3 has been offline since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-faces-intensified-power-cuts-as-zesa-shuts-down-hwange-unit-8-for-10-days/\">Zimbabwe faces intensified power cuts as ZESA shuts down Hwange Unit 8 for 10 days</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "22 Oct 2025"
        }
    ]
}