{
    "news": [
        {
            "title": "‘I felt welcomed’: Zimbabwean rapper marries into Zulu royal heartland",
            "url": "https://www.newzimbabwe.com/i-felt-welcomed-zimbabwean-rapper-marries-into-zulu-royal-heartland/",
            "content": "The South African\n\nZimbabwean rapperAwa Khiwehas married a Qwabe man fromKwaNongomain KwaZulu-Natal, South Africa, marking not just a union of love, but a powerful moment of cultural fusion.\n\nThe intimate traditional wedding, held recently in KwaZulu-Natal, celebrated African heritage and cross-border unity.\n\nBorn Awakhiwe Sibanda, the musician expresses fierce pride in her Ndebele roots as a rapper.\n\nI felt welcomed, she said in an exclusive interview withThe South African.\n\nReferring to her Ndebele roots Awa Khiwe said: They call meumzukulu kaMashobane(the grand daughter of Mashobane). I think once you show people respect, they know you were raised well. Where you come from becomes a secondary issue.\n\nDespite cultural similarities, Awa Khiwe revealed that her upbringing in a Zimbabwean village in Nkayi prepared her for life in KwaNongoma.\n\nBeing raised in the village helped me shape my cultural identity. The KwaNongoma lifestyle is similar to that of Nkayi its not a huge adjustment.\n\nAwa Khiwe, renowned for championing Ndebele pride on global stages, has opened up about embracing a more traditional role in her personal life.\n\nNow living in a new home, the outspoken rapper revealed that while many know her as a fierce and fearless queen, she proudly takes on the role of being a loved,spoiled and submissive wife to her Zulu husband.\n\nSpeaking candidly, she said she respects both Zulu and Ndebele cultures, describing the union as a beautiful exchange rather than a clash.\n\nAwa said her open-mindedness allows her to find strength in unity and mutual respect, rather than division, even in deeply rooted cultural differences.\n\nVeteran actor Ernest Ndlovu joined Awa Khiwe in KwaNongoma to celebrate her wedding day. Image: Pixel Visuals\n\nWhile fans speculated that new music inspired by the wedding might be on the way, Awa was quick to set the record straight:\n\nI have new music, but it has nothing to do with the wedding, she said. I juggle music and family, Im old enough to handle the situation.\n\nHer husband, a Qwabe man involved in the construction industry, has been in her life for years. The two met through a mutual friend, Macingwana, and nurtured their relationship quietly before tying the knot in a ceremony that honoured both families.\n\nOn social media, she called it the best day of my life and added in a heartfelt tribute:\n\nThank you for keeping your promise, my love. I promise to love, honour, respect and protect you, till death do us part.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/08064403/awa-khiwe.jpeg",
            "description": "<p>The South African Zimbabwean rapper Awa Khiwe has married a Qwabe man from KwaNongoma in KwaZulu-Natal, South Africa, marking not just a union of love, but a powerful moment of cultural fusion. The intimate traditional wedding, held recently in KwaZulu-Natal, celebrated African heritage and cross-border unity. Born Awakhiwe Sibanda, the musician expresses fierce pride in her Ndebele roots</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-felt-welcomed-zimbabwean-rapper-marries-into-zulu-royal-heartland/\">‘I felt welcomed’: Zimbabwean rapper marries into Zulu royal heartland</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "08 Aug 2025"
        },
        {
            "title": "Doctors Without Borders calls for urgent action as anti-migrant groups block access to essential medical care for foreigners in South Africa",
            "url": "https://www.newzimbabwe.com/doctors-without-borders-calls-for-urgent-action-as-anti-migrant-groups-block-access-to-essential-medical-care-for-foreigners-in-south-africa/",
            "content": "By Thandiwe Garusa\n\nDOCTORS Without Borders (MSF) in South Africa has raised serious concerns over the ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring countrys already overstretched public resources.\n\nThe targeted foreigners includeZimbabweans, who make up a large portion of undocumented immigrants.\n\nHowever,evensome ofthoseZimbabweanswho are legally living and working in South Africa are also being denied access to healthcare.\n\nAnti-migrant groups have camped outside dozens of clinics and hospitals in Gauteng, preventing non-South Africans from entering public health facilities to seek medical care regardless of their legal documentation status.\n\nIn a statement issued Thursday, MSF warned that the lives of pregnant women, children, people living with HIV, and chronic patients are now at risk, with some having gone weeks without the medication they need, urging authorities to put an end to the xenophobic acts.\n\nDoctors Without Borders (MSF) is deeply concerned by the persistent and systematic physical blocking of non-South Africans from accessing healthcare, including pregnant women, people living with HIV, chronic patients and children, particularly in Gauteng and KwaZulu-Natal.\n\nWe call for immediate action by the National Department of Health (NDoH) and relevant Provincial Departments of Health to guarantee the right of access to healthcare for all, as enshrined in the countrys Constitution and the National Health Act, the statement reads.\n\nMSF also noted that some patients who tried to retrieve their medical files from clinics in an effort to seek care elsewhere were unsuccessful, leaving them uncertain about their next steps.\n\nOthers, lacking prescriptions to refill their medication, are now unable to purchase the medicine they need from pharmacies.\n\nSouth African authorities have for long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>By Thandiwe Garusa DOCTORS Without Borders (MSF) in South Africa has raised serious concerns over the ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring country’s already overstretched public resources. The targeted foreigners include Zimbabweans, who make up a large portion of undocumented immigrants. However, even some of those Zimbabweans who are legally</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/doctors-without-borders-calls-for-urgent-action-as-anti-migrant-groups-block-access-to-essential-medical-care-for-foreigners-in-south-africa/\">Doctors Without Borders calls for urgent action as anti-migrant groups block access to essential medical care for foreigners in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "08 Aug 2025"
        },
        {
            "title": "RBZ moves to salvage ‘fragile’ ZWG ahead of monocurrency plans",
            "url": "https://www.newzimbabwe.com/rbz-moves-to-salvage-fragile-zwg-ahead-of-monocurrency-plans/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) Thursday upheld the tight Monetary Policy stance as a strategy to conserve the local currency.\n\nPresenting the Mid-Term Monetary Policy Statement (MPS), premised under the theme Walking The Talk And Staying The Course, the central bank governor, Dr John Mushayavanhu, once again stated that the bank was receiving widespread acclaim for its sustained exchange rate stability.\n\nThe RBZ projected inflation to end the year at around 30%, giving a positive real interest rate of 5% and maintained the Bank Policy rate at 35% despite sustained outcry from industry on the need to ease the cost of borrowing.\n\nThe high policy rate has choked productivity in the recent past by worsening the cost of capital to fund critical industry needs. However, on its part, the RBZ believes that such rates are necessary to curb speculative borrowing.\n\nOn bank charges, the MPS implored banks to adhere to the measures announced in the February 2025 Monetary Policy Statement to exempt from bank charges all accounts that maintain a balance below US$100 or its equivalent in ZiG.\n\nIn addition, Point of Sale (POS) transactions for amounts less than US$5 or its equivalent in ZiG were also exempted from transaction charges for both banking institutions and Payment System Providers (PSPs).\n\nWhile a noble step, the move falls far short of addressing the thorn in flesh for the transacting public who are ordinarily forced to part ways with US$3,00 per every US$100 withdrawn from banks, a position which increases the cost of doing business, especially for corporates who withdraw large volumes of money.\n\nThe current statutory reserve requirements are set between 15% and 30% depending on the nature of the deposits. Banking institutions can, therefore, easily reduce the effective statutory reserve requirements towards 15% by attracting more long-term deposits.\n\nThe statutory reserve ratios, therefore, remain unchanged and will be reviewed when appropriate and consistent with the monetary policy thrust, reads the MPS in part.\n\nThis is despite complaints from the banking sector alleging that high statutory reserves are mopping up excess resources necessary to support productive lending.\n\nThe MPS maintained the export surrender thresholds at 30% but did not address the pertinent concerns raised by exporters who allege they have not been paid the ZWG portion for a prolonged period of time in what experts believe to be one of the strategies to protect the local unit.\n\nMarket watchers suspect that the move to withhold the export surrender thresholds for fear of weakening ZWG is an indication of a currency facing the crisis of fragility.\n\nDespite having triggered fears across the markets on impending monocurrency by 2030, Dr Mushayavanhus MPS did not disclose the practical roadmap to his course of action, instead opting to give assurances of a workable process.\n\nThe de-dollarisation roadmap will be crystallised in the National Development Strategy II and the Reserve Bank, which is chairing the NDS2 Thematic Working Group on Macroeconomic Stability and Financial Deepening (MESFIND) is currently seized with consultations on the issue.\n\nThe roadmap will undoubtedly encapsulate the need to maintain the current stability, preserve the foreign currency accounts and the value of the existing USD-denominated contracts. Consideration will always be made to ensure that there is business continuity and certainty, the MPS added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) Thursday upheld the tight Monetary Policy stance as a strategy to conserve the local currency. Presenting the Mid-Term Monetary Policy Statement (MPS), premised under the theme “Walking The Talk And Staying The Course,” the central bank governor, Dr John Mushayavanhu, once again stated that the bank</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rbz-moves-to-salvage-fragile-zwg-ahead-of-monocurrency-plans/\">RBZ moves to salvage ‘fragile’ ZWG ahead of monocurrency plans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "08 Aug 2025"
        },
        {
            "title": "Construction of Hills Townhouses begins September",
            "url": "https://www.newzimbabwe.com/construction-of-hills-townhouses-begins-september/",
            "content": "By Staff Reporter\n\nThe Hills Luxury Golf Estate is entering a thrilling new chapter as construction of its first townhouses and villas officially begins this September.\n\nThis milestone marks a major leap forward in transforming the estate into Zimbabwes premier lifestyle and investment destination.\n\nWhile the architectural elegance of the residences is set to redefine luxury living, current efforts are focused on laying the foundation literally. Asphalt roadworks are progressing swiftly, ensuring seamless access across the estate and setting the tone for a world-class infrastructure network. These roads will not only enhance mobility but also elevate the overall aesthetic and functionality of the development.\n\nAt the heart of The Hills lies its crown jewel: a meticulously designed championship golf course. Earthworks are well underway, with fairways beginning to take shape and greens being sculpted to international standards. Water bodies are shaping and well attracting aquatic and birdlife into the estate.\n\nOnce complete, the course will offer a challenging yet rewarding experience for golfers of all levels, surrounded by breathtaking views and lush landscaping.\n\nFor investors, The Hills Luxury Golf Estate presents a rare blend of lifestyle and financial upside. Early buyers are gaining from capital Appreciation as property values are expected to rise significantly as infrastructure and amenities come online.\n\nThere will be huge rental income because of the high demand for high-end accommodation. Owners of the properties will have bragging rights as ownership of a property in a gated live, work, shop and play estate gives unmatched prestige and privacy.\n\nAs the estate evolves, The Hills is not just building homesit is crafting a legacy. Whether youre a homeowner, investor, or golf enthusiast, this is your chance to be part of something extraordinary.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/28121101/hills-e1740744691562.jpeg",
            "description": "<p>By Staff Reporter The Hills Luxury Golf Estate is entering a thrilling new chapter as construction of its first townhouses and villas officially begins this September. This milestone marks a major leap forward in transforming the estate into Zimbabwe’s premier lifestyle and investment destination. While the architectural elegance of the residences is set to redefine</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/construction-of-hills-townhouses-begins-september/\">Construction of Hills Townhouses begins September</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "08 Aug 2025"
        }
    ]
}