{
    "news": [
        {
            "title": "Sandvik secures SEK280 million mining equipment order from Zim miner",
            "url": "https://www.newzimbabwe.com/sandvik-secures-sek280-million-mining-equipment-order-from-zim-miner/",
            "content": "By Alois Vinga\n\nSANDVIK has secured a major order worth about Swedish Krona (SEK) 280 million from Zimbabwe Platinum Mines (Zimplats) to supply underground mining equipment for the Ngezi mines complex.\n\nThe orderincludes 12 Toro LH209L loaders, six Sandvik DD211L development jumbos, five Sandvik DS211L-V bolters, three Toro TH545i trucks, and two Sandvik TH430L trucks.\n\nDeliveries are scheduled to begin in the third quarter of 2025 and continue through the second quarter of 2026. The contract also covers parts and service kits to support long-term performance.\n\nThe Ngezi operation is one of the countrys largest platinum group metals (PGM) producers. Following the transition from open-pit to underground mining, the local miner is investing heavily in expanding underground capacity through new mines and concentrators.\n\nWe are proud to partner with Zimplats on this significant investment in the Ngezi underground operations, said Mats Eriksson, President of Sandvik Mining. This order reflects our strong commitment to providing reliable, fit-for-purpose equipment and services that help our customers achieve their productivity, safety and sustainability targets.\n\nZimplats, 87% owned by Impala Platinum Holdings Ltd, said the fleet investment is part of its long-term strategy to strengthen underground capabilities.\n\nThis new Sandvik fleet is a strategic step in enhancing our underground capabilities and ensuring we continue to operate safely, efficiently and sustainably. Partnering with Sandvik gives us the confidence that our operations will be supported by proven equipment and dependable service, said Zimplats CEO Alexander Mhembere.\n\nThe deal is also expected to generate significant aftermarket value as Sandvik provides ongoing parts and service support to the Ngezi complex.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24060751/Alexander-Mhembere.jpg",
            "description": "<p>By Alois Vinga SANDVIK has secured a major order worth about Swedish Krona (SEK) 280 million from Zimbabwe Platinum Mines (Zimplats) to supply underground mining equipment for the Ngezi mines complex. The order includes 12 Toro® LH209L loaders, six Sandvik DD211L development jumbos, five Sandvik DS211L-V bolters, three Toro TH545i trucks, and two Sandvik TH430L trucks.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sandvik-secures-sek280-million-mining-equipment-order-from-zim-miner/\">Sandvik secures SEK280 million mining equipment order from Zim miner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        },
        {
            "title": "Ferrari, a football club and over US$4 million debts: Zimbabwean care director Mtungwazi leaves Australia as disability empire crashes",
            "url": "https://www.newzimbabwe.com/ferrari-a-football-club-and-over-us4-million-debts-zimbabwean-care-director-mtungwazi-leaves-australia-as-disability-empire-crashes/",
            "content": "Brisbane Times\n\nA disability care director has left Australia despite claims his company owes more than A$6.4 million (US$4.2 million) to the tax office, employees and other creditors, while facing allegations from a liquidator of insolvent trading and funnelling money into offshore property and luxury assets.\n\nA preliminary liquidator report from last month, which is subject to further investigations, alleges Adachi Disability Services directors Adrian Tafari Mtungwazi, 53, and wife Chiedza Mtungwazi, 45, misused company funds, drawing more than A$2 million in director loans, buying a Ferrari, and a shopping centre and football club in Zimbabwe.\n\nAdrian Mtungwazi is being sought by the Australian Taxation Office for A$3 million in tax.\n\nIn the report, Pitcher Partners liquidator Andrew Yeo told creditors Mr Mtungwazi left Australia in May citing family reasons, and has not communicated directly with liquidators since.\n\nHis wife remains in Perth, with a Pitcher Partners spokesperson confirming she was cooperating fully with the ongoing investigation.\n\nIf the claims of insolvent trading are prosecuted and proven, the directors face hefty fines and potentially criminal charges that carry up to five years jail time. No charges have been laid to date.\n\nAccording to the Australian Securities and Investments Commission, directors are not prevented from leaving Australia while their company is in liquidation, as long as they continue cooperating with investigators.\n\nAdrian Mtungwazi left Australia after his business became insolvent.\n\nAn Australian Taxation Office spokesperson said in certain cases, directors could be issued an order preventing them leaving the country if they had significant debts, but would not confirm whether such an order was placed on Mr Mtungwazi.\n\nWhere specific circumstances are met, such as where there is a high risk of non-payment and alternate recovery options are limited, we may issue (these orders) to ensure taxpayers do not leave Australia without paying or making appropriate arrangements to pay outstanding debts, the spokesperson said.\n\nThe ATO is unable to comment [on Mr Mtungwazi] due to taxpayer confidentiality laws, and it would not be appropriate to comment on matters before the courts.\n\nAdachi was recognised by the Zimbabwe Association of WA.Credit:Linkedin\n\nSeparately, earlier this month, the Deputy Commissioner of Taxation escalated matters by personally suing Mr Mtungwazi, filing a writ with the WA Supreme Court seeking to recover what it claimed was more than A$3 million in Adachis unpaid tax and superannuation debts.\n\nAttempts by this masthead to contact Mr Mtungwazi for comment has not been successful.\n\nMs Mtungwazi has not provided a response for publication.\n\nThe couple established Adachi Disability Services in Perth in 2019 as a registered provider under the National Disability Insurance Scheme.\n\nThe organisation offered daily living assistance and services and, at its peak, employed about 300 staff, supporting 40 clients and operating from offices in Cannington, Gosnells and Maddington.\n\nIn 2021, Mr Mtungwazi was recognised by the Zimbabwe Association of WA with an Innovation and Entrepreneurship Award. On LinkedIn, a peer described him as an inspiration to many migrants  a proven visionary.\n\nWhile Adachi was unravelling, Mr Mtungwazi was projecting wealth. A video posted to social media two years ago shows Mr Mtungwazi standing in front of five sports cars, boasting about how many he owns.\n\nThese cars are worth a million dollars US, he tells the person filming.\n\nIve got another 40 cars  theres five here. But its hard work. You got to live life. You gotta do what you gotta do.\n\nBehind the rapid expansion and image of success, Yeos liquidation report claimed Adachi was drowning in debt and mismanagement.\n\nThe report said the company began facing regulatory issues in 2021, including audits and compliance concerns related to the mismanagement of client complaints.\n\nYeo said it was in his opinion that by August 2022, the company was insolvent, at which time it already owed about $4 million to the tax office, and it appeared to continue to accumulate millions in further debt.\n\nIn February 2024, the NDIS banned Adachi from providing care.\n\nAdachi won an award in 2024 despite owing millions in debt.\n\nBut a month later, the company was named Best Family-Run Care & Disability Services Company in Western Australia in the Asia Pacific Accreditation Cooperations Australian Enterprise awards.\n\nAPAC is an international organisation that helps countries in the Asia-Pacific trust each others certificates, so businesses dont have to repeat tests in other countries.\n\nYeo also alleged in his report the directors established new ventures under different names, including New Seasons Health Care Services and Daily Living Disability Services in Traralgon, Victoria  both in April, 2024  in what he described as an attempt to keep new businesses separated from the company.\n\nThe liquidator report states the directors had agreed to a payment plan with the ATO in 2023, but made only four instalments, before the Deputy Commissioner of Taxation issued a legal demand in November 2024.\n\nBy the time Adachi was wound up in May 2025, the company owed more than $6.4 million, with the bulk of claims to the ATO, but also to staff, Revenue WA, QBE Insurance and Optus, the liquidator report noted.\n\nMore than 80 employees were owed about $450,000 in unpaid wages and superannuation.\n\nThe liquidators report detailed how Adachi allegedly used a web of related companies to shuffle money and assets.\n\nYeo said at the time of his appointment in May, Adachi Disability Services was owed more than $8.6 million by associated entities, including A$6 million owed by Adachi Assets Pty Ltd.\n\nEffectively all assets utilised by the company in the conduct of its business were actually owned by Adachi Assets, even though the purchase of any assets were funded by income generated by the company, Yeo wrote.\n\nAmong these were numerous vehicles and properties, including a Ferrari, which Yeo said was purchased purely for the directors personal use.\n\nOn top of this, director loans to Adrian and Chiedza Mtungwazi totalled more than A$2.3 million, according to the report.\n\nMs Mtungwazi said these should be seen as salary substitutes, but Yeo said he strongly disagreed with that reasoning.\n\nYeo also found $335,000 was transferred to South Africa, the UK, Philippines and Zimbabwe, between 2022-24.\n\nHe said Adachis money was even used to establish a Zimbabwean football club, Adachi FC, and to purchase property in Bulawayo, including the Morningside Shops for A$1.3 million. Bulawayo is listed as the birthplace for the directors on their ASIC record.\n\nA liquidator has the ability to investigate potential offences that may have been committed by directors and submit a report to ASIC.\n\nIf the liquidator alleges there have been breaches, ASIC can investigate and lay civil charges, or refer the case to the Commonwealth Director of Public Prosecutions, if criminal charges are warranted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24052751/mtungwazi.webp",
            "description": "<p>Brisbane Times A disability care director has left Australia despite claims his company owes more than A$6.4 million (US$4.2 million) to the tax office, employees and other creditors, while facing allegations from a liquidator of insolvent trading and funnelling money into offshore property and luxury assets. A preliminary liquidator report from last month, which is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ferrari-a-football-club-and-over-us4-million-debts-zimbabwean-care-director-mtungwazi-leaves-australia-as-disability-empire-crashes/\">Ferrari, a football club and over US$4 million debts: Zimbabwean care director Mtungwazi leaves Australia as disability empire crashes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        },
        {
            "title": "Life’s journey leads Zimbabwean accountant to farming in Central Otago",
            "url": "https://www.newzimbabwe.com/lifes-journey-leads-zimbabwean-accountant-to-farming-in-central-otago/",
            "content": "Otago Daily Times\n\nFrom rural Zimbabwe to the rolling hills of Central Otago, Conrad Kamotas journey has come full circle  from finance professional to aspiring farmer.\n\nRaised in a family deeply rooted in agriculture, Mr Kamotas story began in Guruve, Northern Zimbabwe, where his father, a former soldier, returned to farming life alongside his wife.\n\nThe family grew cotton and maize and kept goats and cattle, with one of their proudest moments being Mr Kamotas father receiving a regional award for excellence in cotton farming.\n\nHowever, Mr Kamota took a different initial path.\n\nA standout student, he earned scholarships through high school and later graduated with a degree in finance from the National University of Science and Technology in Bulawayo.\n\nHis qualifications launched a successful career as a chartered accountant, working across sectors including aviation, health, hospitality and education in Zimbabwe, Malawi and South Africa.\n\nIn 2023, Mr Kamota and his wife Karen, a qualified early childhood education (ECE) teacher, migrated to New Zealand under the skilled migrant category. After initially settling in Auckland with their two children, the family moved south to Central Otago.\n\nMr Kamota took on the role of financial director at Central Otago Health Services Ltd and now serves as financial manager for Dunedin Kindergartens, splitting his time between Central Otago and Dunedin.\n\nDespite a thriving career in finance, his passion for farming remains strong.\n\nOutside of work, I have a passion for farming.\n\nI have Boer goats, and the plan is to get a farm and continue to grow and increase the herd for export, he said.\n\nTo help turn this vision into a viable business, Mr Kamota applied for a mentor through the Newcomers Business Mentorship Programme.\n\nHis goal was clear: To build confidence in business in a developed structure, with someone who can help me network, give me practical advice and provide a safe space to share mistakes and understand the context of New Zealand.\n\nThe programme, a collaboration between Business Mentors NZ, Business South and Central Otagos Welcoming Communities initiative, has paired Mr Kamota with a mentor for a year-long journey.\n\nOrganisers say they are thrilled to support his agricultural ambitions.\n\nWere excited to see where Mr Kamota takes his farming venture and look forward to following his progress, a spokesperson said.  Allied Media\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24052213/kamota.png",
            "description": "<p>Otago Daily Times From rural Zimbabwe to the rolling hills of Central Otago, Conrad Kamota’s journey has come full circle — from finance professional to aspiring farmer. Raised in a family deeply rooted in agriculture, Mr Kamota’s story began in Guruve, Northern Zimbabwe, where his father, a former soldier, returned to farming life alongside his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lifes-journey-leads-zimbabwean-accountant-to-farming-in-central-otago/\">Life’s journey leads Zimbabwean accountant to farming in Central Otago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        },
        {
            "title": "Dairibord milk intake surpasses 20 million litres",
            "url": "https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/",
            "content": "By Alois Vinga\n\nListed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges.\n\nPresenting the companys half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3 million litres, which accounts for 38% of national production.\n\nThe milk supply development unit continues to recruit new producers, including small and medium-scale farmers, to meet growing demand. The group achieved an 18% growth in overall sales volume, with food sales up 18%, driven by strong yoghurt and tomato sauce sales, Chiromo said.\n\nNational raw milk production also increased by 3.9% year-on-year, from 55.1 million litres to 57.3 million litres.\n\nDZLs beverages segment surged by 28%, buoyed by exceptional performances from Pfuko and Cascade, alongside a recovery in tea due to improved availability. Liquid milk volumes posted modest growth of 1%.\n\nAs of 30 June 2025, DZL reported total assets of US$53.84 million, compared to US$53.49 million in December 2024, while total liabilities stood at US$27.67 million, down from US$28.54 million in the previous period.\n\nEquity attributable to ordinary shareholders rose to US$26.16 million, up from US$24.95 million.\n\nRevenue for the period reached US$64.32 million, an 18% increase compared to the same period in 2024. Profit before tax jumped 51% year-on-year to US$2.08 million, boosted by lower finance costs. Basic and diluted earnings per share stood at US$0.34 cents.\n\nRetained earnings climbed to US$16.28 million, from US$15.07 million as of December 2024, largely driven by profit growth. No dividend was declared for the period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/22172046/Dairibord.jpg",
            "description": "<p>By Alois Vinga Listed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges. Presenting the company’s half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/\">Dairibord milk intake surpasses 20 million litres</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        },
        {
            "title": "High Court joins developer Arosume to upmarket Carrick Creagh land dispute",
            "url": "https://www.newzimbabwe.com/high-court-joins-developer-arosume-to-upmarket-carrick-creagh-land-dispute/",
            "content": "By Mary Taruvinga\n\nThe High Court has ordered Arosume Property Development (Pvt) Ltd to be joined in a bitter property dispute involving businesswoman Farai Olivia Mashonganyika and the Minister of Local Government, ruling that the developer has a direct and substantial interest in the contested Carrick Creagh land.\n\nDelivering judgment on September 5, 2025, Justice Siyabona Musithu said, The applicant not only has a substantial interest in the issues raised in HCH 884/24 concerning the property, but the applicants rights in the said property will be affected by any judgment that may be rendered without its involvement.\n\nHe said that excluding Arosume from the ongoing litigation would risk an incomplete determination of the matter.\n\nRule 32(12) bestows upon the court the discretion to order any person whose presence before the court is necessary to ensure that all issues in dispute may be effectually and completely determined, he said.\n\nThe case centres on stand 91 Kidron Valley Road, Carrick Creagh Estate, Borrowdale, transferred to Mashonganyika under Deed of Transfer 5690/2011. In 2022, the Ministry of Local Government moved to cancel her title deed, accusing her of failing to pay over US$520,195 in development costs and claiming she was not a member of the Sally Mugabe Housing Cooperative, which was part of the project.\n\nArosume, the developer in a Public-Private Partnership (PPP) with the State and the cooperative, argued it was deliberately excluded when Mashonganyika filed a review application challenging the ministrys cancellation order. The firm alleged that the deed was fraudulently obtained and that it had already filed an urgent application to block Mashonganyika from building on the land.\n\nMashonganyika, however, insists she bought the property legitimately in 2011, paying US$4,000 directly to the ministry after previously being misled by Arosume to part with US$10,000. She maintains the government acted unlawfully by cancelling her deed without a court order.\n\nA deed of transfer confers real rights of ownership which cannot be terminated without a court order, she argued in her opposing affidavit.\n\nShe further accused the ministry of acting at Arosumes behest, alleging connivance between the developer and government to wrestle away her property.\n\nJustice Musithu dismissed her objections, finding that Arosumes interest arose from the tripartite PPP agreement governing Carrick Creagh. He noted that Mashonganyika herself had acknowledged the existence of a dispute with the developer in earlier court filings.\n\nThe dispute is much broader than the mere administrative process that the first respondent claims she wants regularised, the judge said. Any judgment affecting the property will also impact the developers rights under the tripartite arrangement.\n\nThe court granted Arosumes joinder, directing the company to file its opposing papers in the main matter (HCH 884/24) within five days. The question of costs was deferred to that case.\n\nThe ruling paves the way for a full trial in which the High Court will weigh competing claims of fraud, non-payment, and unlawful cancellation in one of Harares most high-profile land battles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/23072643/carrick-creagh.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ordered Arosume Property Development (Pvt) Ltd to be joined in a bitter property dispute involving businesswoman Farai Olivia Mashonganyika and the Minister of Local Government, ruling that the developer has a “direct and substantial interest” in the contested Carrick Creagh land. Delivering judgment on September 5, 2025, Justice</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-joins-developer-arosume-to-upmarket-carrick-creagh-land-dispute/\">High Court joins developer Arosume to upmarket Carrick Creagh land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        },
        {
            "title": "Developer Felix Munyaradzi loses legal battle in Sandton property dispute",
            "url": "https://www.newzimbabwe.com/developer-felix-munyaradzi-loses-legal-battle-in-sandton-property-dispute/",
            "content": "By Mary Taruvinga\n\nThe High Court has ruled in favour of Harare resident Cephas Tapiwa Muneri, declaring him the rightful holder of rights and interests in a contested Haydon Park stand, after a protracted legal battle with Delatfin Civil Engineering and controversial land developer Felix Munyaradzi.\n\nIn a judgment delivered on September 8, Justice Siyabona Musithu declared that Muneri is the lawful owner of Stand 1650, Haydon Park, Sandton, measuring 1,097 square metres, and blocked attempts by Munyaradzis firm to repossess the property.\n\nThe applicant is hereby declared the lawful holder of rights and interests in Stand Number 1650 Haydon Park, Sandton, ruled Justice Musithu. The attempt by the first and second respondents to repossess the stand from the applicant is hereby declared unlawful.\n\nMuneri bought the property in 2017 through Rawson Properties, later formalising the deal directly with Delatfin Civil Engineering, represented by Munyaradzi. He paid all fees, including a US$650 regularisation charge to Zvimba Rural District Council, and had been living at the property since 2017.\n\nBut in December 2024, Muneri was shocked to see a public notice threatening repossession unless he paid for the land again, this time at US$55 per square metre.\n\nDelatfin argued it had never received the original purchase price, claiming the money was misappropriated by rogue employees, including convicted fraudster Saymore Mutakura.\n\nMuneri insisted he had done his due diligence and dealt directly with Munyaradzi, who personally signed off on the agreements. He accused the company of trying to extort him, telling the court: The alleged fraud was an internal matter to be resolved between the first respondent and its employee. I cannot be made to pay for the property twice.\n\nJustice Musithu rejected Delatfins defence, noting that Munyaradzi had signed the agreements himself and never moved to invalidate them.\n\nMerely denying their legality in an opposing affidavit did not have the desired effect of nullifying them, the judge said. The first respondents arguments were ill-conceived for as long as no attempt was made to have the agreements declared null and void.\n\nThe court found Muneri had demonstrated a direct and substantial interest in the property, and that his rights were under threat from what it described as unlawful attempts to repossess.\n\nThe High Court ordered Zvimba Rural District Council to officially register Muneri as the lawful rights holder, and directed Delatfin to pay his legal costs.\n\nThe ruling is the latest twist in Zimbabwes long-running land disputes involving private developers and residents who often face double allocations, fraudulent sales, or threats of repossession years after purchase.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ruled in favour of Harare resident Cephas Tapiwa Muneri, declaring him the rightful holder of rights and interests in a contested Haydon Park stand, after a protracted legal battle with Delatfin Civil Engineering and controversial land developer Felix Munyaradzi. In a judgment delivered on September 8, Justice Siyabona</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/developer-felix-munyaradzi-loses-legal-battle-in-sandton-property-dispute/\">Developer Felix Munyaradzi loses legal battle in Sandton property dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        },
        {
            "title": "Munetsi on target as Wolves beat Everton in Carabao Cup",
            "url": "https://www.newzimbabwe.com/munetsi-on-target-as-wolves-beat-everton-in-carabao-cup/",
            "content": "By Sports Reporter\n\nWarriors vice-captain Marshall Munetsi was on target for Wolverhampton Wanderers in their 2-0 Carabao Cup victory over Everton on Tuesday night.\n\nMunetsi broke the deadlock in the 28th minute, pouncing on a rebound to hand Wolves a 1-0 halftime lead. His effort was later complemented by Tolu Akodares 87th-minute strike, which sealed the win.\n\nThe goal was Munetsis first of the season and his third since joining Wolves in January. The midfielder has become a key figure at Molineux, particularly following the departure of last seasons star man, Matheus Cunha, to Manchester United.\n\nDespite the cup success, Wolves have endured one of their worst starts in Premier League history, losing all five of their opening league matches. They now turn their attention to a tough weekend fixture away to Tottenham in London.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24044639/marshall-munetsi-celebrates-carabao-cup-goal-for-wolves-e1758659846671-1.jpg",
            "description": "<p>By Sports Reporter Warriors vice-captain Marshall Munetsi was on target for Wolverhampton Wanderers in their 2-0 Carabao Cup victory over Everton on Tuesday night. Munetsi broke the deadlock in the 28th minute, pouncing on a rebound to hand Wolves a 1-0 halftime lead. His effort was later complemented by Tolu Akodare’s 87th-minute strike, which sealed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/munetsi-on-target-as-wolves-beat-everton-in-carabao-cup/\">Munetsi on target as Wolves beat Everton in Carabao Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        },
        {
            "title": "Bank staffer, security guard steal US$58,000 from National Building Society",
            "url": "https://www.newzimbabwe.com/bank-staffer-security-guard-steal-us58000-from-national-building-society/",
            "content": "By Staff Reporter\n\nA BANK teller and a security guard have appeared at the Harare Magistrates Court facing charges of stealing US$58,417 from the National Building Society (NBS).\n\nThe duo of Smith Mativenga Chigwagwa (45), who is employed by the bank as a cash deposit teller, allegedly connived to commit theft with Stalin Rundora (30), who is employed by Atharvan Investments (Pvt) Limited as a security guard responsible for collecting cash.\n\nCourt heard that between September 5 and 10, 2025, the two, in pursuance of their plan, withdrew cash amounting to US$58,417 from Atharvan Investments NBS account and converted part of it to their personal use.\n\nIt was further heard that an alert security manager at the bank, identified as Michael Smoko, observed anomalies in the transaction and checked with the company, which confirmed it had not received any cash.\n\nThe matter was then reported to police and on September 21, 2025, detectives from the Criminal Investigations Department (CID) Commercial Crimes Division in Harare conducted a probe, which prompted Chigwagwa to surrender US$51,420 to the bank.\n\nThe accused persons were subsequently arrested and of the stolen cash, US$6,997 was not recovered.\n\nAccused persons were remanded in custody until October 23, 2025 for trial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24050559/nbs_bank.jpg",
            "description": "<p>By Staff Reporter A BANK teller and a security guard have appeared at the Harare Magistrates Court facing charges of stealing US$58,417 from the National Building Society (NBS). The duo of Smith Mativenga Chigwagwa (45), who is employed by the bank as a cash deposit teller, allegedly connived to commit theft with Stalin Rundora (30),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bank-staffer-security-guard-steal-us58000-from-national-building-society/\">Bank staffer, security guard steal US$58,000 from National Building Society </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Sep 2025"
        }
    ]
}