{
    "news": [
        {
            "title": "Mutodi removed as Parliamentary Committee chair over bribery claims against Finance Ministry PS Guvamatanga",
            "url": "https://www.newzimbabwe.com/mutodi-removed-as-parliamentary-committee-chair-over-bribery-claims-against-finance-ministry-ps-guvamatanga/",
            "content": "By Staff Reporter\n\nBikita South MP Energy Mutodi has been removed from his position as Chairperson of Parliaments Portfolio Committee on Budget, Finance and Economic Development following allegations he made against Finance Ministry Permanent Secretary George Guvamatanga, accusing him of receiving multi-million dollar kickbacks from government contractors.\n\nIn a post on X last week, Mutodi claimed Parliament had received complaints regarding Guvamatangas conduct and alleged that he was demanding payments of between 5% and 10% from ministries and departments to facilitate Treasury disbursements.\n\nMutodi further alleged that Guvamatangas wealth, which he said includes several mansions and over 5,000 dairy cattle, was built from illicit proceeds amounting to more than US$1 billion.\n\nThe MP repeated his claims in Parliament, calling for Guvamatanga to be summoned to clear his name, before later retracting the allegations and issuing a public apology.\n\nA letter seen byNewZimbabwe.comfrom Speaker of Parliament Jacob Mudenda informed Mutodi of his dismissal from the committee chairmanship. He has since been replaced by Chipinge East MP Lincoln Dhliwayo.\n\nThis serves to notify you that pursuant to Standing Order No. 19 of the National Assembly, the Committee on Standing Rules and Orders (CSRO) has resolved to terminate your tenure as Chairperson of the Portfolio Committee on Budget, Finance and Investment Promotion with immediate effect.\n\nConsequently, all benefits and entitlements attendant upon the said role shall likewise be discontinued forthwith. Please be guided accordingly, reads the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/05195520/Energy-Mutodi.jpg",
            "description": "<p>By Staff Reporter Bikita South MP Energy Mutodi has been removed from his position as Chairperson of Parliament’s Portfolio Committee on Budget, Finance and Economic Development following allegations he made against Finance Ministry Permanent Secretary George Guvamatanga, accusing him of receiving multi-million dollar kickbacks from government contractors. In a post on X last week, Mutodi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutodi-removed-as-parliamentary-committee-chair-over-bribery-claims-against-finance-ministry-ps-guvamatanga/\">Mutodi removed as Parliamentary Committee chair over bribery claims against Finance Ministry PS Guvamatanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Oct 2025"
        },
        {
            "title": "Daring thief targets President’s and Home Affairs offices, steals property worth over US$23,000",
            "url": "https://www.newzimbabwe.com/daring-thief-targets-presidents-and-home-affairs-offices-steals-property-worth-over-us23000/",
            "content": "By Mary Taruvinga\n\nNotorious theft suspect Romeo Kurai Pemba (39), once convicted of theft in 2015,has once again found himself in court, this time accused of breaking into multiple government offices, including those under the Office of the President and Cabinet, and stealing property worth over US$23,000.\n\nPemba was arrested on October 2, 2025, after an extensive investigation by the CID Stores and Business Unitin Harare. According to police, he was captured on CCTVcommitting the crimes and later led detectives to the recovery of part of the stolen propertyvalued at US$1,400.\n\nHe appeared before Harare magistrate Tapiwa Kuhudzai, who remanded him in custody after he pleaded to all nine counts of unlawful entry. His plea recording is expected to continue on Tuesday before sentencing.\n\nThe State alleges that between June and September 2025, Pemba went on a burglary spree targeting high-security government officeslocated in Mukwati and Kaguvi Buildings, including those belonging to the Office of the President and Cabinet, the Ministry of Home Affairs, the Ministry of Womens Affairs, Gender and Wellness, and ZimStat.\n\nPemba allegedly used unknown tools to force open office doors and stole laptops, CPUs, monitors, and other electronic equipment. Several items have since been positively identifiedby the affected departments.\n\nThe accused person was captured on CCTV committing the crime and the footage is held as an exhibit, reads part of the police remand request. He led to the recovery of part of the stolen property and indicated how he committed the crime. Fingerprints uplifted at the scene matched those of the accused.\n\nPolice strongly opposed bail, citing Pembas previous conviction and high flight risk. Detective Assistant Inspector Christopher Lloyd Tarenyikastated that Pemba has no fixed addressand could easily abscond or interfere with witnesses.\n\nThe accused person has known previous convictions under CRB HREP 10833/15, Tarenyika said. He is facing a serious offence which, if convicted, attracts a lengthy custodial sentence. There is overwhelming evidence linking him to the crime, and if granted bail, he may abscond or interfere with witnesses.\n\nThe charges fall under Section 131(1)(a)as read with Section 131(2)(e)of the Criminal Law (Codification and Reform) Act [Chapter 9:23], which covers aggravated unlawful entry.\n\nPembas latest arrest adds to his record of theft-related offences. Police say he was convicted in 2016following similar allegations. Investigations into related cases are ongoing, with at least 15 witnessesexpected to testify. The total value of stolen property is pegged at US$23,020, with only a fraction recovered so far.\n\nHe remains in custody pending his next court appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga Notorious theft suspect Romeo Kurai Pemba (39), once convicted of theft in 2015, has once again found himself in court, this time accused of breaking into multiple government offices, including those under the Office of the President and Cabinet, and stealing property worth over US$23,000. Pemba was arrested on October 2, 2025, after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/daring-thief-targets-presidents-and-home-affairs-offices-steals-property-worth-over-us23000/\">Daring thief targets President’s and Home Affairs offices, steals property worth over US$23,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Oct 2025"
        },
        {
            "title": "Zimplow cuts losses by 70% as cost controls, asset sales pay off",
            "url": "https://www.newzimbabwe.com/zimplow-cuts-losses-by-70-as-cost-controls-asset-sales-pay-off/",
            "content": "By Alois Vinga\n\nZimplow Holdings Limited has significantly reduced its losses in the first half of 2025, reporting a deficit of US$499,500,a 70% improvement from the US$1.66 million loss recorded during the same period last year.\n\nThe turnaround follows the companys aggressive cost-cutting measures, which included staff reductionsand streamlined administrative expenses. Zimplow also disposed of outdated equipment to free up capital for reinvestment. Proceeds from the sale of its Dagenham Road property have been channelled toward the establishment of a new mining and logistics hub in Msasa.\n\nThe groups strategic shift toward the mining sector is part of efforts to cushion itself from the volatility of the agriculture industry. However, a poor weather outlook,with forecasts predicting below-average rainfall,is expected to weigh heavily on its agriculture-focused subsidiaries, Farmec and Mealie Brand, which depend on rain-fed farming. This could dampen sales and create financial pressure, compounded by potential inventory build-ups from trade loans that may increase storage costs and force price cuts.\n\nDespite these headwinds, Zimplows mining-related operations remain robust. Subsidiaries such as Scanlink and Tractive Power Solutions continue to perform well, buoyed by sustained demand for heavy equipment in Zimbabwes mining sector. Similarly, Powermec is benefiting from increased demand for solar-powered generators amid persistent power shortages caused by drought conditions.\n\nThe company is also exploring drought-adaptive innovations, including modular irrigation kits and scalable solar power solutions, to diversify its revenue streams.\n\nHowever, smuggling continues to undermine operations at Trentyre and CT Bolts, with the influx of grey market imports eroding revenues.\n\nZimplows diversification strategy, supported by cost discipline and its pivot toward mining and renewable energy solutions, positions the group for potential recovery in the second half of 2025,provided it successfully navigates the prevailing economic and regulatory challenges.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/18224140/Zimplow.jpeg",
            "description": "<p>By Alois Vinga Zimplow Holdings Limited has significantly reduced its losses in the first half of 2025, reporting a deficit of US$499,500, a 70% improvement from the US$1.66 million loss recorded during the same period last year. The turnaround follows the company’s aggressive cost-cutting measures, which included staff reductions and streamlined administrative expenses. Zimplow also disposed of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimplow-cuts-losses-by-70-as-cost-controls-asset-sales-pay-off/\">Zimplow cuts losses by 70% as cost controls, asset sales pay off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Oct 2025"
        },
        {
            "title": "Trump says chance of Gaza peace deal ‘really good’ as talks to continue in Egypt",
            "url": "https://www.newzimbabwe.com/trump-says-chance-of-gaza-peace-deal-really-good-as-talks-to-continue-in-egypt/",
            "content": "BBC\n\nIndirect talks aimed at reaching a final agreement on a US peace plan to end the war in Gaza are set to continue on Tuesday in the Egyptian city of Sharm El-Sheikh.\n\nPalestinian and Egyptian officials have told the BBC that the sessions are focused on creating the field conditions for a possible exchange that would see the release of all Israeli hostages in return for a number of Palestinian prisoners.\n\nIsraels prime minister said on Saturday that he hoped to announce the release of hostages in the coming days.\n\nAs the officials met on Monday, US President Donald Trump told reporters at the White House: We have a really good chance of making a deal, and itll be a lasting deal.\n\nHamas has said it agrees to the peace plan proposals in part, but has not responded to several key demands  including its disarmament andnot having any future role in the governance of Gaza.\n\nA senior Israeli security source said the talks initially would focus only on the release of hostages and give Hamas a few days to complete that phase.\n\nThe second day of thetalks, which will see Egyptian and Qatari officials holding shuttle meetings with delegations from both Israel and Hamas separately, will be taking place on the second anniversary of the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\n\nThe Israeli military launched a campaign in Gaza in response. Since then, 67,160 have been killed by Israeli military operations in Gaza, including 18,000 children, according to the territorys Hamas-run health ministry.\n\nIn a statement commemorating the 7 October anniversary, United Nations Secretary-General Antonio Guterres said Trumps plan presents an opportunity that must be seized to bring this tragic conflict to an end.\n\nUK Prime Minister Sir Keir Starmer reiterated his support for the plan in his statement commemorating the anniversary, saying: We welcome the US initiative towards peace in the Middle East, and this government will do everything in our power to bring about the day where every child of Israel can live peacefully, alongside their Palestinian neighbours, in safety and security.\n\nThese discussions are expected to be among the most consequential since the start of the war and could determine whether a path toward ending the conflict is finally within reach.\n\nUS special envoy Steve Witkoff, Trumps son-in-law Jared Kushner and Qatari foreign minister Sheikh Mohammed bin Abdulrahman Al Thani are among those attending.\n\nTrump, writing on social media, has urged everyone involved in efforts to end the Gaza war to move fast and says he has been told the first phase of the peace plan  which includes the hostage release  should be completed this week.\n\nOn Monday, he told reporters at the White House that Hamas has been agreeing to things that are very important.\n\nI really think were going to have a deal, he added.\n\nA Palestinian official close to the negotiations told the Reuters news agency that the first session ended late Monday evening, and more talks were due to take place on Tuesday.\n\nState-affiliated Al-Qahera News also said talks would continue on Tuesday  and that the first day had ended amid a positive atmosphere.\n\nThe 20-point plan, which has been agreed upon by Trump and Israeli Prime Minister Benjamin Netanyahu, proposes an immediate end to fighting and the release of 48 hostages, only 20 of whom are thought to be alive, in exchange for hundreds of detained Gazans.\n\nThe plan stipulates that once both sides agree to the proposal full aid will be immediately sent into the Gaza Strip.\n\nIt also states that Hamas would have no role in governing Gaza, and it leaves the door open for an eventual Palestinian state.\n\nHowever, after the plan was announced publicly a week ago, Netanyahu reinstated his longstanding opposition to a Palestinian state, saying in a video statement: Its not written in the agreement. We said we would strongly oppose a Palestinian state.\n\nOn Friday,Hamas responded to the proposalin a statement, in which the groupagreed to release all Israeli prisoners, both living and dead, according to the exchange formula contained in Trumps proposal  if the proper conditions for the exchanges are met.\n\nIt did not specifically mention or accept Trumps 20-point plan but said it renews its agreement to hand over the administration of the Gaza Strip to a Palestinian body of independents (technocrats), based on Palestinian national consensus and Arab and Islamic support.\n\nThe statement made no mention of the demands that Hamas agree to its disarmament and to playing no further role in the governance of Gaza.\n\nIt added that the part of the proposals dealing with the future of Gaza and the rights of Palestinian people was still being discussed within a national framework, of which it said Hamas will be a part.\n\nMany Palestinians described Hamas response to the peace plan as unexpected, after days of indications that the group was preparing to reject or at least heavily condition its acceptance of Trumps peace plan proposal.\n\nInstead, Hamas refrained from including its traditional red lines in the official statement, a move many interpret as a sign of external pressure.\n\nEuropean and Middle Eastern leaders have welcomed the proposal. The Palestinian Authority (PA), which governs parts of the Israeli-occupied West Bank, has called the US presidents efforts sincere and determined.\n\nIran  which has been one of Hamass main sponsors for many years  has also now signalled its support for Trumps Gaza peace plan.\n\nIsraeli bombardment continued in several parts of the Gaza Strip on Monday ahead of the talks beginning.\n\nIsrael is carrying out an offensive in the city, which it has said is aimed at securing the release of the remaining hostages.\n\nMahmoud Basal, spokesman for Gazas Hamas-run civil defence, told the BBC that no aid trucks have been allowed into Gaza City since the offensive began four weeks ago.\n\nThere are still bodies we cannot retrieve from areas under Israeli control, he said.\n\nHundreds of thousands of Gaza City residents have been forced to flee after the Israeli military ordered evacuations to a designated humanitarian area in the south, but hundreds of thousands more are believed to have remained.\n\nIsraels defence minister has warned that those who stay during the offensive would be terrorists and supporters of terror.\n\nIn the last 24 hours, 21 Palestinians have been killed in Gaza and a further 96 injured, the Hamas-run health ministry said in its latest update.\n\nInternational journalists have been banned by Israel from entering the Gaza Strip independently since the start of the war, making verifying claims from both sides difficult.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07055500/gaza-city.webp",
            "description": "<p>BBC Indirect talks aimed at reaching a final agreement on a US peace plan to end the war in Gaza are set to continue on Tuesday in the Egyptian city of Sharm El-Sheikh. Palestinian and Egyptian officials have told the BBC that the sessions are focused on “creating the field conditions” for a possible exchange</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-says-chance-of-gaza-peace-deal-really-good-as-talks-to-continue-in-egypt/\">Trump says chance of Gaza peace deal ‘really good’ as talks to continue in Egypt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Oct 2025"
        },
        {
            "title": "Smartphones become tools of resistance in queer film project",
            "url": "https://www.newzimbabwe.com/smartphones-become-tools-of-resistance-in-queer-film-project/",
            "content": "Beyond the Margins\n\nIt took four years, from conception to completion, to put together the anthology film,Map Your Love. Shot entirely on smartphones, by activists in countries such as Burkina Faso, Tunisia, Tanzania, Zimbabwe, Ghana, Ethiopia, Kenya, Jamaica, Peru and Canada, the four films that make up the anthology showcase deeply personal stories that explore the complexities of queer love, identity, and resilience in nations where homosexuality is criminalised.\n\nIn 2024, screenings of the anthology were held in various countries across Africa.\n\nKarin Haz is the founder and director of75 Shots, the Canada-based organisation which spearheaded the project. Haz says: Every screening in Africa was conducted underground, ranging from private gatherings in homes where traditional coffee ceremonies and food were shared, to full-scale festivals at undisclosed locations for safety reasons. Some were also held in community centres run by feminist activists. Each screening was unique, courageous, and extraordinary.\n\nFor Beyond the Margins,Carl Collisonspoke to three queer rights activists  Ghanas Prince Frimpong, TanzaniasMwamba T Nyanda and Zimbabwe-based Kudzai Kay-Dee  all of whomparticipated in the creation of this anthology and also put together a screening of the four-part film in their respective countries.\n\nIn this conversation, the activists discuss what drew them to film as an advocacy tool, how the medium is shaping their activism, and how, especially in repressive contexts, there is great power in telling ones story.\n\nKayuure (Nameless): The short documentary, Kayuure (Nameless), looks into the life of a transgender man from Burkina Faso, offering a glimpse into their journey of resilience, love, and self-discovery. Image: Supplied\n\nCarl Collison (CC):So, tell us about the screenings. How did it go? What stood out for you?Kudzai Kay-Dee (KK):So, I engaged an LBQ organisation. They were having a meetingSo, I took that opportunity to go there and screen our films. What stood out for me the most in terms of the people who were watching is that they realised that were using really simple gadgets to come up with something so beautiful; something so movingWe also had conversations around privilege and how we can be more supportive in our communities; how we can support each other, encourage each other to, you know, live our lives to the fullest.\n\nPrince Frimpong (PF):I collaborated with a youth-led organisation, called Let It Shine, in Lagos, and we did the screening together. They were doing a couple of activities for Pride in LagosSo, yeah, we did a screening, and (about 25) LGBTQI youth (attended). It was very amazing, you know, to witness this community coming together to watchMap Your Love. How it resonated with them was powerful to watch. And I think what really struck me was how people decode theMap Your Lovefilm in their own ways; in their own understandingIt felt so surreal. And it felt like, you know, people are really getting into the film that weve made. People are really, you know, resonating with it in their own waysand how they see themselves in the film that we made.\n\nAnd they were surprised that the film was even made (on) a mobile phone. You know, when the film started, I told them, Dont have any expectations. It is not the traditional way of making films. Just watch with an open-mindedness, and just like, you know, let yourself flow in what youre about to watch. They did, and they were stunned.\n\nIn Wildly Authentic, a young soul raised by two loving mothers, ponders the enigma of belonging. Image: Supplied\n\nMwamba T Nyanda (MN):The movie screening we did was done on 30thof June. We wanted to share these narrative stories of our lives on the African continent. And also to tell people that it is possible to narrate a story through the use of a phone, for example an iPhone or Samsung. And that, as an activist, a smartphone can be a tool for advocacy. Luckily, the turnout was good. A lot of members showed up (and) a lot were intrigued and also interested in learning how to create movies through mobile phones. Because most of the queer people in our society are very shy, but they are willing to tell the stories (from)( behind the camera. So, that was a good take-away for me.\n\nCC:None of you are filmmakers, right? All of you are queer activists in your respective countries. What made you decide to use film as a tool for your advocacy?\n\nKK:I think the first thing is accessibility So, (with traditional filmmaking,) by the time you get to the camera, and you know, all that editing, it kind of takes away from the rawness of the story. So, the phone is the one thing thats in your pocket that you can randomly take out and start creating something.\n\nPF:Mobile filmmaking is a powerful tool. And in my advocacy work, I feel like it is a way to establish the visibility of the LGBT community in Ghana and also across Africa. Ive always been someone who loves employing creative elements when it comes tojust putting our work online and utilising digital tools to drive positive change. So, to me, using mobile filmmaking or even arriving to doMap Your Loveits a way for me to, you know, tell stories that have been overlooked and tell it my own way. And utilise these mechanisms, or these tools, to tell these stories with no restrictions, with no boundaries and tell it unapologetically.\n\nMN:Ive always been interested in knowing about films and how to create (them), because I knew that at one point in my life this could be a good tool to sustain myself. I am also very interested in telling our stories. Because, as Africans, we have a lot of untold stories which we hide under the rugs due to the country contexts. I think narrating stories through film is a great way to reach people. So, I thought that being equipped myself with film skills can also help me to run my advocacy well.\n\nCC:How has this experience with film shaped your activism?\n\nInThe Sourcea trans man in Tanzania spends a day at the beach with his Rastafarian father, who shares life lessons with him and teaches him to swim. Image: Supplied\n\nMN:Filming has definitely shaped my activism because, number one, I have evolved from the strategies that I (employ) in the organisation. Because for many years we have been giving people capacity. We have been providing emergency support. We have been providing entrepreneurship skills. But we never have dealt with art or arti-vism; using art  music, dancing and filming  in advocating for our rights, visibility and freedom. So, this category of art, which is filming, has given me power. To me, its like a superpower because I get to narrate the stories, and create them however I want (in order) to pass on messages to the community at large.\n\nKK:I think, going forward, Ill definitely continue to use film and maybe not just film, but even pictures (created with) my mobile phone. Because its the one thing that is always in my pocket  other than my wallet. And I can always use that to tell different stories. Like you were saying, these are stories that are not told. These are stories that were telling in repressive countries. We dont stop telling the stories because of the nature of the environment. (So,) this is actually a very innovative and creative way to continue telling these stories in otherwise unsafe environment(s).\n\nCC:And for you, Prince?\n\nPF:You know, as part of my advocacy, Im always preaching about queer joy, queer liberation, queer freedom, and living our authentic self, unapologetically. You know, we are living in a homophobic country. And that is how its going to be. I feel like how does it all end when we are being killed and discriminated (against)? But when we take ownership of our own stories and tell them authentically, I feel like that is a way for us to mobilise more support networks, gain more resources, and invite people to the table to (discuss) critical issues that we face as a queer community. And these (things) can be done through filmmaking. So, it has really shaped my activism in so many ways. I mean, you know, its a new wave of activism. Its a new way of telling queer stories and giving us that kind of visibility or recognition that we need as a queer community. So, for me, it is something that Im always going to adopt in my advocacy: continue telling queer stories, continue telling Ghanaian queer stories and using these tools to Africanise and reshape our narrative. Also, as a side, teaching people the ways of using mobile (phones) to tell their own stories. And, you know, keep the movement going, and create positive change in this way.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07055151/prince-fimpong.png",
            "description": "<p>Beyond the Margins It took four years, from conception to completion, to put together the anthology film, Map Your Love. Shot entirely on smartphones, by activists in countries such as Burkina Faso, Tunisia, Tanzania, Zimbabwe, Ghana, Ethiopia, Kenya, Jamaica, Peru and Canada, the four films that make up the anthology “showcase deeply personal stories that explore</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smartphones-become-tools-of-resistance-in-queer-film-project/\">Smartphones become tools of resistance in queer film project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Oct 2025"
        },
        {
            "title": "No talk of succession at Zanu PF conference – says Marapira, dismisses ongoing Chiwenga, Mnangagwa tussle for power",
            "url": "https://www.newzimbabwe.com/no-talk-of-succession-at-zanu-pf-conference-says-marapira-dismisses-ongoing-chiwenga-mnangagwa-tussle-for-power/",
            "content": "By Leopold Munhende\n\nTHERE will not be any discussions on President Emmerson Mnangagwas succession at the upcoming Zanu PF National Peoples conference, the partys Information and Publicity Director Farai Marapira has said.\n\nParty members, supporters and onlookers, intrigued by the ongoing tussle for power between Mnangagwa and his deputy Constantino Chiwenga, were expecting that the issue would be addressed at the upcoming conference to be held in Mutare.\n\nMnangagwas supporters are pushing for him to hang on beyond his constitutionally mandated two terms by extending his second one up to 2030.\n\nThose backing Chiwenga are against such a move and are silently working towards thwarting it and taking over before Mnangagwa hands power to his business partner and close associate, Kudakwashe Tagwirei, as is being pushed for by a considerable section of the party.\n\nSuccession is dealt with at congress; we are not going to congress, we have congress in 2027, we are going to a conference, said Marapira.\n\nThe issue of succession is not an issue within Zanu PF. Most of the purveyors of this succession issue are known not to be members of Zanu PF; they are known not to be within the structures of Zanu PF.\n\nAs Zanu PF, we will not allow a conversation to be imported into the party. We are going to a conference to check on the mandate which we received from the people in 2023.\n\nAlthough party slogans declaring that Mnangagwa will be in power up until 2030 appear to have been silenced, at provincial, district or cell meetings, they continue being chanted, even in the presence of party bigwigs such as Kazembe Kazembe and Owen Ncube in the Midlands Province.\n\nRecent Politburo meetings have been nothing short of explosive, with Chiwenga standing up to Mnangagwa and bringing dossiers to nail his allies and fear abounds that their tussle could result in another coup.\n\nChiwenga, then Commander of Zimbabwes military, led the 2017 coup that installed Mnangagwa as state leader. Although his influence in the army might have been diluted by his decision to join politics, there is fear that he has a lot of sympathisers within its ranks.\n\nMnangagwa has most of Zimbabwes cash-rich individuals, all of whom would be ready to defend his stay to protect their interests.\n\nAdded Marapira: The relationship between the President and his two Vice Presidents is friendly.\n\nAll this talk of animosity, hatred and fighting is a narrow agenda by other parties hoping to bring alarm and despondency within our rank and file.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/02060218/Farai-Marapira-1.jpg",
            "description": "<p>By Leopold Munhende THERE will not be any discussions on President Emmerson Mnangagwa’s succession at the upcoming Zanu PF National People’s conference, the party’s Information and Publicity Director Farai Marapira has said. Party members, supporters and onlookers, intrigued by the ongoing tussle for power between Mnangagwa and his deputy Constantino Chiwenga, were expecting that the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-talk-of-succession-at-zanu-pf-conference-says-marapira-dismisses-ongoing-chiwenga-mnangagwa-tussle-for-power/\">No talk of succession at Zanu PF conference – says Marapira, dismisses ongoing Chiwenga, Mnangagwa tussle for power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Oct 2025"
        },
        {
            "title": "Chinese cement firm director jailed for defying court order in Hurungwe land dispute",
            "url": "https://www.newzimbabwe.com/chinese-cement-firm-director-jailed-for-defying-court-order-in-hurungwe-land-dispute/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Philda Muzofa has found executives of Wih-Zim Construction Material Investments in contempt of court for defying a previous order to halt construction of a cement manufacturing plant in Magunje, Hurungwe.\n\nIn a recent judgment delivered in Chinhoyi, Justice Muzofa ordered the immediate halt of all works at the controversial site, ruling that the company and its director had acted in flagrant disregard of a court order issued on February 4, 2025.\n\nThe application for contempt of court be and is hereby granted, Justice Muzofa ruled. The first and second respondents (Labenmon Investments and the director Daniel Mlalazi) and are hereby found to be in contempt of this courts provisional order issued under Case Number HCCC15/25.\n\nShe further directed that the respondents are hereby ordered to immediately stop all works at the Wih-Zim Construction Material Investments Cement Manufacturing plant in Magunje, Hurungwe until the matter under HCCC15/25 is finalised.\n\nThe first respondent was fined US$3,000 payable within one month, while Mlalazi was sentenced to 30 days imprisonment, wholly suspended on condition that the company complies with the court order.\n\nMuzofas ruling comes after villagers from Kapere and Chasara under Ward 11 in Hurungwe, represented by Zimbabwe Lawyers for Human Rights (ZLHR) lawyers Tinashe Chinopfukutwa and Kelvin Kabaya, challenged the setting up of the cement plant, saying it was encroaching on their grazing and farming land.\n\nAccording to the villagers, the Chinese firm Labenmon Investments, which is linked to Wih-Zim, arrived in July 2024 and began fencing off the land without consultation.\n\nThe villagers later learnt that Labenmon Investments was going to establish a cement manufacturing plant on the pegged area, and they were prohibited from accessing their grazing fields and farming land, ZLHR said in a statement.\n\nThe lawyers argued that the Environmental Management Agency (EMA) erred in law by issuing an Environmental Impact Assessment (EIA) certificate to Labenmon Investments without receiving or properly evaluating the companys EIA report  a violation of sections 100(1) and 100(2) of the Environmental Management Act.\n\nThe Director-General of EMA violated the principles of natural justice as espoused in section 136 by failing to consult the appellants who are affected by the proposed cement manufacturing plant and giving them an opportunity to be heard, the lawyers said.\n\nThey further contended that the Director-General of EMA failed to exercise his powers by not inviting the developers and affected villagers to a consultative meeting as required by law.\n\nAbout 23 families are reportedly affected by the project, which has sparked outrage in the rural community for displacing farmers and cutting off access to communal grazing land.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Philda Muzofa has found executives of Wih-Zim Construction Material Investments in contempt of court for defying a previous order to halt construction of a cement manufacturing plant in Magunje, Hurungwe. In a recent judgment delivered in Chinhoyi, Justice Muzofa ordered the immediate halt of all works at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-cement-firm-director-jailed-for-defying-court-order-in-hurungwe-land-dispute/\">Chinese cement firm director jailed for defying court order in Hurungwe land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "07 Oct 2025"
        }
    ]
}