{
    "news": [
        {
            "title": "Sugar producer Triangle to retrench workers, cites rising operational costs and unfair competition",
            "url": "https://www.newzimbabwe.com/sugar-producer-triangle-to-retrench-workers-cites-rising-operational-costs-and-unfair-competition/",
            "content": "By James Muonwa\n\nONE of Zimbabwes biggest sugar producers, Triangle Limited will next month retrenchan undisclosed number of workers.\n\nThe company will roll out a three-phased employee retrenchment programme after citing escalating operational costs, currency losses, and competition from low-cost, duty-free imported sugar as key factors driving the unwelcome decision.\n\nThe severance process, which will be done in phases, begins late February 2025 and ends August this year.\n\nIn a recent statement, Triangle Managing Director, Tendai R. Masawi said myriad militating factors had necessitated the job cut.\n\nThe current economic environment in Zimbabwe has presented unprecedented challenges for Triangle Limited over the past three years, Masawi said.\n\nAmong other factors, Masawi said inflationary pressures, rising maintenance costs, and the inability to claim value-added tax (VAT) on inputs after sugar was exempted from VAT, have negatively impacted on the companys operations.\n\nEscalating operational costs, particularly in areas such as fertilizer, fuel, maintenance costs, and imported goods/services, combined with inflationary pressures, currency losses, the inability to claim VAT on inputs after sugar was exempted from VAT, and competition from low-cost duty-free imported sugar, have severely impacted our ability to sustain current levels of operation, said the managing director.\n\nSince 2022, we have seen profit margins decline significantly by 55%, manpower costs increasing by 133% as a proportion of revenue, and debt levels rising to unsustainable levels.\n\nThe company has been unable to generate positive cash flows from its operating activities for the past three years and has faced a very constrained working capital position since the implementation of the revised cane supply arrangements, which has necessitated constant trade-offs between what the business needs and what it can afford.\n\nThe decision to cut jobs was arrived at in order to ensure the company remains viable in the wake of an unrelenting and unfavourable economic climate.\n\nDespite implementing numerous cost-reduction and revenue-enhancement initiatives, these efforts have proven insufficient to stabilize the business. This decision has been taken to protect the long-term sustainability of our organization and ensure that Triangle Limited continues to play its vital role in Zimbabwes economy and the livelihoods of communities in the Lowveld region, Masawi said.\n\nThe company pledged to provide fair severance packages and support programmes for affected employees. Its also a committee to work closely with union representatives and other stakeholders to ensure the process is conducted transparently and fairly.\n\nTriangle said the decision is unrelated to the business rescue process of its South African shareholder or its acquisition by the Vision Consortium.\n\nSince 2022, Triangles profit margins have declined by 55%, while manpower costs have risen by 133% as a proportion of revenue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/29151203/Tongaat-Hulett.jpeg",
            "description": "<p>By James Muonwa ONE of Zimbabwe’s biggest sugar producers, Triangle Limited will next month retrench an undisclosed number of workers. The company will roll out a three-phased employee retrenchment programme after citing escalating operational costs, currency losses, and competition from low-cost, duty-free imported sugar as key factors driving the unwelcome decision. The severance process, which will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sugar-producer-triangle-to-retrench-workers-cites-rising-operational-costs-and-unfair-competition/\">Sugar producer Triangle to retrench workers, cites rising operational costs and unfair competition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "High Court to hear Magaya’s challenge against disqualification from ZIFA Presidential race on Friday",
            "url": "https://www.newzimbabwe.com/high-court-to-hear-magayas-challenge-against-disqualification-from-zifa-presidential-race-on-friday/",
            "content": "By Mary Taruvinga\n\nAn urgent chamber application by Yadah Stars leader Walter Magaya who is challenging his disqualification fromthe ZIFA presidential racewill be heardon FridayJanuary 17.\n\nHigh Court judge Justice Tawanda Chitapi agreed that the matter was urgent when parties met on Tuesday for case management.\n\nTo this end, the urgent application and the main matter will be heard on Friday, a week before electionsset forJanuary 25.\n\nRELATED:\n\nMagayas lawyer, Tavonga Makamure from Rubaya and Chatambudza Legal Practitioners said they have a strong case.\n\nSo we have so much confidence in the matter and we think we have a very good case because our client Mr Magaya has done so much in football and we just want him to get a chance to contest, said his lawyer Tavonga Makamure.\n\nOur understanding is that our clients name should be on the list even though they might have to mention that he is subject to hearing. Our client is not to be disqualified illegally,Makamure said.\n\nMakamure said the matter is of national interestas such Magayashould be heard.\n\nOur client should be given a chance to contest. However, there is an issue that the elections should be held on the 25th of this month before the elections so we met to push for a quick hearing because this is a matter of public interest and a notional matter so we managed to push for the matter to be heard this Friday.\n\nThe cleric and others including former Zimbabwe captain Benjani Mwaruwari, CAPS United owner Farai Jere and Temba Mliswa are notable figures who failed to pass the eligibility test.\n\nThe barring of the four candidates left Nqobile Magwizi, Twine Phiri, Marshal Gore, Philemon Machana, Martin Kweza and Makwinje Phiri contesting for the presidency.\n\nAccording to the ZIFA statutes, the barred candidates have the option to seek remedy from the Court of Arbitration for Sports (CAS) in Switzerland.\n\nMwaruwari and former ZIFA deputy president Gift Banda have since filed joint appeals at CAS challenging their disqualification.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga An urgent chamber application by Yadah Stars leader Walter Magaya who is challenging his disqualification from the ZIFA presidential race will be heard on Friday January 17. High Court judge Justice Tawanda Chitapi agreed that the matter was urgent when parties met on Tuesday for case management. To this end, the urgent application and the main</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-to-hear-magayas-challenge-against-disqualification-from-zifa-presidential-race-on-friday/\">High Court to hear Magaya’s challenge against disqualification from ZIFA Presidential race on Friday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Judiciary commends UNICEF for contribution to Zimbabwe’s justice delivery system",
            "url": "https://www.newzimbabwe.com/judiciary-commends-unicef-for-contribution-to-zimbabwes-justice-delivery-system/",
            "content": "By Mary Taruvinga\n\nThe Judiciary Services Commission (JSC) has hailed UNICEF for its significant contributions to improving the justice delivery system in Zimbabwe, particularly through the establishment and support of Victim Friendly Courts (VFC).\n\nDuring the official opening ceremony of the 2025 judicial year in Harare on Monday, Deputy Chief Justice Elizabeth Gwaunza remarked that the VFC initiative represents the JSCs most notable success, highlighting that public confidence in the victim-friendly system is stronger than ever.\n\nVFCs are specifically designed to protect vulnerable witnesses, such as victims of sexual abuse.\n\nIt is important to acknowledge the critical role played by UNICEF in the Victim Friendly Court System.\n\nThrough our partnership, UNICEF has significantly contributed to the training of judicial officers, police, and prosecutors, while also providing vital equipment and supporting witnesses.\n\nThis collaboration has been one of the judiciarys greatest success stories, with the system now operating at national, provincial, and district levels.\n\nPublic confidence in the victim-friendly system is stronger than ever, and we are grateful for UNICEFs continued support and involvement, she said.\n\nVFCs feature separate rooms where survivors can give their testimonies in a protective environment, minimizing trauma. Key elements include a closed-circuit television for recording the survivors statement and an intermediary who assists and guides the survivor throughout the court process.\n\nIn Zimbabwe, 22 regional courts serve as VFCs.\n\nUNICEF, with support from Sweden through the Child Protection Fund, the EU via the Spotlight Initiative, and various other donors, has been instrumental in setting up and operating VFCs in the country for the past decade.\n\nGwaunza also acknowledged the active participation of other stakeholders in fostering an environment where justice could flourish, particularly in the rollout of the Integrated Electronic Case Management System (IECMS) in the upper courts.\n\nAs expected with a project of such national significance, challenges arose, but through cooperation and resilience, we overcame them.\n\nOver time, public confidence in the IECMS has grown, and more litigants now rely on the system. Stakeholders are therefore encouraged to maintain this positive momentum as we expand the IECMS to the busiest courts, the magistrates courts, she explained.\n\nGwaunza emphasized that all JSC stakeholders will play a crucial role this year, aligning with the theme of building public confidence in the judiciary through multi-stakeholder participation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14102529/WhatsApp-Image-2025-01-14-at-12.24.53.jpeg",
            "description": "<p>By Mary Taruvinga The Judiciary Services Commission (JSC) has hailed UNICEF for its significant contributions to improving the justice delivery system in Zimbabwe, particularly through the establishment and support of Victim Friendly Courts (VFC). During the official opening ceremony of the 2025 judicial year in Harare on Monday, Deputy Chief Justice Elizabeth Gwaunza remarked that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judiciary-commends-unicef-for-contribution-to-zimbabwes-justice-delivery-system/\">Judiciary commends UNICEF for contribution to Zimbabwe’s justice delivery system</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Warriors striker Chirewa returns to Wolves after Derby County loan",
            "url": "https://www.newzimbabwe.com/warriors-striker-chirewa-returns-to-wolves-after-derby-county-loan/",
            "content": "By Sport Reporter\n\nWarriors forward Tawanda Chirewa has returned to his parent club Wolverhampton after his loan spell at Derby County was cut short.\n\nHe joined Derby County in August on a season loan deal, which has been terminated with six more months to go.\n\nTawanda Chirewa has returned to parent club Wolverhampton Wanderers after spending the first half of the 2024/25 campaign with Derby County.\n\nThe 21-year-old Zimbabwe international forward initially linked up with the Rams back in August on a season-long loan from the Premier League side.\n\nDerby have opted to exercise the right to end the loan agreement during the current transfer window.\n\nDerby County would like to wish Tawanda every success in the future and for his efforts during his time, posted Derby County on their social media platforms.\n\nAt Derby County, Charewa made six appearances, five of them were in the league.\n\nChirewa is one of the promising youngsters at Wolves where he made his English Premier Soccer League debut last season in January against Brighton & Hove.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/05173252/chirewa.jpg",
            "description": "<p>By Sport Reporter Warriors forward Tawanda Chirewa has returned to his parent club Wolverhampton after his loan spell at Derby County was cut short. He joined Derby County in August on a season loan deal, which has been terminated with six more months to go. “Tawanda Chirewa has returned to parent club Wolverhampton Wanderers after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-striker-chirewa-returns-to-wolves-after-derby-county-loan/\">Warriors striker Chirewa returns to Wolves after Derby County loan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Dead bodies seen in videos from South African mine",
            "url": "https://www.newzimbabwe.com/dead-bodies-seen-in-videos-from-south-african-mine/",
            "content": "BBC\n\nDisturbing videos have emerged showing the dire situation at a disused gold mine in South Africa where scores of illegal miners have reportedly been living underground for months.\n\nThey have been there since police operations targeting illicit mining started last year across the country.\n\nIn one of the videos, which the BBC has not independently verified, corpses wrapped in makeshift body bags can be seen. A second shows the emaciated figures of some miners who are still alive.\n\nA long-delayed rescue operation, that last week a court ordered the government to facilitate, is continuing for a second day after beginning on Monday.\n\nLast year, arguing that the miners had entered the shaft in Stilfontein deliberately without permission, the authorities took a hard line, blocking food and water supplies.\n\nIn November, one government minister said: We are going to smoke them out.\n\nMore than 100 of the illegal miners, known locally as zama zamas, have reportedly died underground since the crack down began at the mine some 145km (90 miles) south-west of Johannesburg.\n\nThe authorities however, have not confirmed this figure as it is yet to be verified by an official source, a spokesperson told the BBC.\n\nHundreds are thought to be still in the mine while more than 1,000 have surfaced in the past few months.\n\nIn one of the videos released by a trade union, the General Industries Workers of South Africa (Giwusa), dozens of shirtless men can be seen sitting on a dirty floor. Their faces have been blurred. A male voice off camera can be heard saying that the men are hungry and need help.\n\nWere starting to show you the bodies of those who died underground, he says.\n\nAnd this is not all of them Do you see how people are struggling? Please we need help.\n\nIn the other video, a man says: This is hunger; people are dying because of hunger. He then puts the death toll at 96 and begs for help, food and supplies.\n\nThe union says the footage was filmed on Saturday.\n\nIn a briefing held on Monday near the site of the rescue operation, Giwusa leadership, alongside community figures, said the videos shared painted a very dire picture of the situation underground.\n\nWhat has transpired here has to be called what it is; this is a Stilfontein massacre. Because what this footage does is show a pile of human bodies, of miners that died needlessly, Giwusa president Mametlwe Sebei said.\n\nHe blamed the authorities for what he described as a treacherous policy that was deliberately pursued.\n\nThe department of mineral resources, leading the rescue effort, told the BBC that Mondays operation included lowering down a cage that is then hoisted up once loaded with people.\n\nThis structure is designed to hold six or seven people, depending on their weight, according to Giwusa. It has been going down the shaft  descending about 2km  every hour. The union said that by the end of Monday 26 miners had been brought up alive, along with nine bodies.\n\nDepartment of mineral resources spokesperson Makhosonke Buthelezi could not confirm whether the priority will be to retrieve those who had died or those in need of medical attention.\n\nA briefing will be held by the department, together with the police ministry, on Tuesday to provide an update on the operation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>BBC Disturbing videos have emerged showing the dire situation at a disused gold mine in South Africa where scores of illegal miners have reportedly been living underground for months. They have been there since police operations targeting illicit mining started last year across the country. In one of the videos, which the BBC has not</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dead-bodies-seen-in-videos-from-south-african-mine/\">Dead bodies seen in videos from South African mine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Makarati leaves Dynamos for TelOne after getting an enticing offer",
            "url": "https://www.newzimbabwe.com/makarati-leaves-dynamos-for-telone-after-getting-an-enticing-offer/",
            "content": "By Sport Reporter\n\nAfter spending three seasons at Dynamos, Frank Makarati is leaving the side to join Gweru-based TelOne.\n\nThe move was confirmed by Dynamos via its social media platforms.\n\nThe 30-year-old defender was left with a year on his Dynamos contract, but the Gweru-based side is said to have tabled an irresistible offer for both Makarati and Dynamos.\n\nDynamos Football Club would like to confirm that we have reached an agreement with TelOne FC for the transfer of our captain and defender, Frank Makarati.\n\nThe number #4 was still contracted to Dynamos and had a year left on his deal.\n\nThe move brings to an end a hugely successful four-year stay at DeMbare for the center back, who joined us from Ngezi Platinum Stars in February 2021.\n\nDuring his time at the Club, the 30-year-old became a regular feature at the heart of the Glamour Boys defense,read part of Dynamos statement.\n\nAt Dynamos, Makarati wrote himself in the clubs history books after guiding it to two Chibuku Super Cup trophies in 2023 and 2024.\n\nAt TelOne, Makarati will make a re-union with his former coach Herbert Maruwa, who was fired at Dynamos in 2023.\n\nAnnouncing his departure, Makarati said captaining Dynamos was an honour.\n\nThe opportunity to captain the team and win prestigious trophies like the Chibuku Super Cup not once but twice, and to lead the team in the CAF Confederation Cup, has been an absolute honour.\n\nDynamos has been a warm and welcoming home for me and will always be home, he posted.\n\nOther than Makarati Dembare has so far lost seven other players, Tanaka Shandirwa, Issa Sadiki, Donald Mudadi, Emmanuel Zioocha, Sadney Urkhob, Elvis and Kelvin Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/06185218/makarati-f.jpeg",
            "description": "<p>By Sport Reporter  After spending three seasons at Dynamos, Frank Makarati is leaving the side to join Gweru-based TelOne. The move was confirmed by Dynamos via its social media platforms. The 30-year-old defender was left with a year on his Dynamos contract, but the Gweru-based side is said to have tabled an irresistible offer for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/makarati-leaves-dynamos-for-telone-after-getting-an-enticing-offer/\">Makarati leaves Dynamos for TelOne after getting an enticing offer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Zambia awards UAE company contract to print ballot papers after Chivayo-linked Ren Form CC failed to fulfil contractual obligations",
            "url": "https://www.newzimbabwe.com/zambia-awards-uae-company-contract-to-print-ballot-papers-after-chivayo-linked-ren-form-cc-failed-to-fulfil-contractual-obligations/",
            "content": "By ZNBC, Staff Reporter\n\nThe Electoral Commission of Zambia (ECZ) has awarded a three-year contract to Al Ghurair Printing and Publishing of the United Arab Emirates to print and deliver ballot papers and other election materials.\n\nThis decision came after the Commission could not proceed with the contract with Ren Form CC of South Africa, as the bidder failed to comply with an action required by the solicitation document. The company linked to controversial businessman Wicknell Chivayo won a similar tender for Zimbabwes elections held in 2024 and was implicated in inflating election-related costs in a US$100 million deal with the Zimbabwe Electoral Commission (ZEC).\n\nRen Form CC was awarded another contract to design, print, supply, and deliver ballot papers in Namibia last year which was objected to by the opposition Popular Democratic Party (PDP) which argued that due to Chivayos history and his alleged connections to corrupt dealings reported in the mediathe integrity and credibility of the presidential and national elections would be undermined.\n\nECZ Chief Electoral Officer Brown Kasaro says this prompted the Commission to engage the second-best evaluated bidder instead.\n\nDuring a media briefing held in Lusaka, Monday, Kasaro said the Commission has since notified the public.\n\nKasaro also announced that the Commission will conduct a mass voter registration in the second quarter of 2025 ahead of the 2026 General Elections.\n\nHe said the mass voter registration will run for 60 days.\n\nKasaro added that the Commission will carry out the Certification of the Register of Voters for the 2026 General Election in April 2026.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14060118/ecz.webp",
            "description": "<p>By ZNBC, Staff Reporter The Electoral Commission of Zambia (ECZ) has awarded a three-year contract to Al Ghurair Printing and Publishing of the United Arab Emirates to print and deliver ballot papers and other election materials. This decision came after the Commission could not proceed with the contract with Ren Form CC of South Africa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambia-awards-uae-company-contract-to-print-ballot-papers-after-chivayo-linked-ren-form-cc-failed-to-fulfil-contractual-obligations/\">Zambia awards UAE company contract to print ballot papers after Chivayo-linked Ren Form CC failed to fulfil contractual obligations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Schools reopen to a worsening economic crisis as parents make tough sacrifices",
            "url": "https://www.newzimbabwe.com/schools-reopen-to-a-worsening-economic-crisis-as-parents-make-tough-sacrifices/",
            "content": "By Staff Reporter\n\nSCHOOLS across the country reopen Tuesday, amid an economic meltdown characterised by an underperforming local currency.\n\nMonday, parents gathered at Robert Mugabe Square in Harare to see off boarding school students heading to various learning institutions for the start of the first term.\n\nEmotions and excitement filledthe air as Form One students embarked on a new academic journey.\n\nHowever, many parents could not share in theexcitement as they were burdened by the deteriorating economy while preparing to send their children to boarding schoolsand had to make tough sacrifices.\n\nPrecious Chitemere who spoke to NewZimbabwe.com bemoaned the poor economic environment for hampering back-to-schoolpreparations.\n\nI have to be honest with you, for some of us who have form one students, it was challenging. Firstly money was not circulating as it should,making it difficult to have proper preparations for the children, said Chitemere.\n\nHarare was a hive of activity Monday as parents made last-minute preparations for the reopening of schools.\n\nStationery and uniform shops were abuzz with parents making a beeline, and some taking advantage to make a killing by hiking the prices of school necessities.\n\nWith big supermarkets short on some goods, many resorted to informal shops in the downtown Harare Central Business Districts to purchase vital school materials.\n\nThe financial strain on some was exacerbated by the just-ended festive season which hit hard the pockets of many.\n\nOne parent identified as Chirisamhuru said the reopening of schools has left him breathing through the wound.\n\nPreparations were not easy. It started during the festive period when we also spent the little that we had. We have sacrificed for my children with one in form six and another one in form two. Essentials were a bit expensive but we did not have an option but to purchase, said Chisiyamhuru.\n\nAs the new yearbegins, Zimbabwes economy continues to tank, picking up where it left in 2024.\n\nAt the heart of the meltdown is the underperforming local currency, Zimbabwe Gold (ZiG), which was introduced nine months ago in an attempt to stabilise the faltering economy.\n\nHowever, ZiG has continued to lose valueagainst the United States dollar with many preferring to transact in the US dollar.\n\nSchools have not been immune to the economic pressures, as many now demand tuition fees in US dollars.\n\nChirisamhuru said the shunning of ZiG by many shops left many, like him,who earn in the local currency in a dilemma.\n\nWe had to reach an agreement with the school to allow kids to go to school after paying a part of the fees and then pay the remaining later. I do not even know ZiG. It is scarce I do not know why maybe it is circulating at RBZ and we are working with what is being demanded, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/13190041/Back-to-school-6-scaled.jpg",
            "description": "<p>By Staff Reporter SCHOOLS across the country reopen Tuesday, amid an economic meltdown characterised by an underperforming local currency. Monday, parents gathered at Robert Mugabe Square in Harare to see off boarding school students heading to various learning institutions for the start of the first term. Emotions and excitement filled the air as Form One students</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/schools-reopen-to-a-worsening-economic-crisis-as-parents-make-tough-sacrifices/\">Schools reopen to a worsening economic crisis as parents make tough sacrifices</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Simba Bhora takes pre-season training to South Africa",
            "url": "https://www.newzimbabwe.com/simba-bhora-takes-pre-season-training-to-south-africa/",
            "content": "By Sport Reporter\n\nCastle Lager Premier Soccer League reigning champions Simba Bhora are set to leave the country for South Africa where they will have their pre-season tour in Pretoria.\n\nThe tour is part of the teams preparations for the upcoming 2025 league season in which they will be eyeing to defend their title.\n\nLed by new head coach Joel Lupahla who came in as Tonderai Ndirayas replacement, Simba Bhora is scheduled to leave the country on January 19.\n\nIn Pretoria, the team will play several clubs in South Africa as part of its preparations before returning home on February 3.\n\nSimba Bhora will be using this time away from home to try and create new combinations after a mass exodus which saw 13 players leaving the side including team captain and 2024 Soccer Star of the Year Walter Musona.\n\nTo control the damage, the Shamva-based side has made several new signings including Liberty Chakoroma from Manica Diamonds, Donald Mudadi from Dynamos, Tonderai Mateyaunga from CAPS United and Blessed Ndereki from Yadah.\n\nSimba Bhora will return home for a Castle Challenge Cup match against Dynamos on a date to be announced in February.\n\nThe Cup match is a season curtain raiser and is played between reigning league champions and Chibuku Super Cup winners.\n\nOther than competing in the league this season, the Go Buju Go side will be out on a hunt in the African safari where they are set to compete in the CAF Champions League.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/03022207/66e849f05b6406.12113889.jpg",
            "description": "<p>By Sport Reporter Castle Lager Premier Soccer League reigning champions Simba Bhora are set to leave the country for South Africa where they will have their pre-season tour in Pretoria. The tour is part of the team’s preparations for the upcoming 2025 league season in which they will be eyeing to defend their title. Led</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/simba-bhora-takes-pre-season-training-to-south-africa/\">Simba Bhora takes pre-season training to South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        },
        {
            "title": "Zimbabwe records 28 cholera cases, 2 deaths",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-28-cholera-cases-2-deaths/",
            "content": "Xinhua\n\nZimbabwe has recorded 28 cholera cases and two deaths in the latest cholera outbreak that began in November last year, health authorities said Monday.\n\nIn an update on the cholera cases, Zimbabwes Ministry of Health and Child Care said the current outbreak, which began in the Kariba district of Mashonaland West Province, has since spread to seven districts in the country, including Harare, Zimbabwes capital.\n\nZimbabwe has recorded 282 suspected cholera cases and 275 recoveries and a total of 4, 923 people have been administered with oral cholera vaccine in a four-day campaign covering the most affected farms and residential areas in Glendale and Mazowe districts of Mashonaland Central Province, currently the epicentre of the current outbreak.\n\nThe current outbreak came just a few months after the government declared in August of last year an end to another nationwide outbreak that began in February 2023. According to the United Nations Childrens Fund, the outbreak caused more than 700 confirmed or suspected deaths in the African country.\n\nZimbabwe has faced persistent cholera outbreaks over the past years due to poor water and sanitation infrastructure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/26200440/Cholera_h1.jpeg",
            "description": "<p>Xinhua Zimbabwe has recorded 28 cholera cases and two deaths in the latest cholera outbreak that began in November last year, health authorities said Monday. In an update on the cholera cases, Zimbabwe’s Ministry of Health and Child Care said the current outbreak, which began in the Kariba district of Mashonaland West Province, has since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-28-cholera-cases-2-deaths/\">Zimbabwe records 28 cholera cases, 2 deaths</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:29",
            "date": "14 Jan 2025"
        }
    ]
}