{
    "news": [
        {
            "title": "Extradite Bushiri to South Africa – Malawian Court rules",
            "url": "https://www.newzimbabwe.com/extradite-bushiri-to-south-africa-malawian-court-rules/",
            "content": "Malawi24\n\nA Court in Malawi has ruled that Prophet Shepherd Bushiri and his wife, Mary, be extradited to South Africa to face multiple charges, including fraud, rape, and bail-jumping.\n\nBushiri, a self-proclaimed prophet, fled South Africa while out on bail, prompting authorities to seek his return. The fight has been ongoing since November 2020 and today, the Chief Resident Magistrate Court in Lilongwe has today ruled for their extradition to South Africa andthat the couple remain in custody until they are handed over to South African authorities.\n\nHowever, the legal battle is far from over. The case is expected to move to the High Court and could ultimately reach the Supreme Court of Appeal.\n\nDespite the ruling, the Bushiris lawyer, Wapona Kita, has requested bail for the couple, arguing that the extradition order should be paused. The state has not objected to the bail request, leaving the court to decide on the matter.\n\nBushiris dramatic escape from South Africa in November 2020 remains a mystery. It was widely speculated that he and his wife used President Lazarus Chakweras presidential plane to flee.\n\nThe aircraft was subjected to rigorous searches by South African authorities before Chakwera was allowed to depart for Malawi. The circumstances surrounding their escape continue to raise questions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31030228/shepherd-bushiri-750x500.jpg",
            "description": "<p>Malawi24 A Court in Malawi has ruled that Prophet Shepherd Bushiri and his wife, Mary, be extradited to South Africa to face multiple charges, including fraud, rape, and bail-jumping. Bushiri, a self-proclaimed prophet, fled South Africa while out on bail, prompting authorities to seek his return. The fight has been ongoing since November 2020 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/extradite-bushiri-to-south-africa-malawian-court-rules/\">Extradite Bushiri to South Africa – Malawian Court rules</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Journalist Mhlanga’s bail appeal hearing indefinitely adjourned after State failed to produce evidence",
            "url": "https://www.newzimbabwe.com/journalist-mhlangas-bail-appeal-hearing-indefinitely-adjourned-after-state-failed-to-produce-evidence/",
            "content": "By Staff Reporter\n\nAlpha Media Holdings journalist Blessed Mhlanga, who is currently locked up on allegations of publishing information inciting violence, had his bail appeal hearing indefinitely adjourned following the States failure to produce evidence of electronic and video graphic recordings which it said it has.\n\nHis lawyer, Chris Mhike, requested for further particulars which he said would enable the defence to argue its case in seeking Mhlangas freedom.\n\nThe lawyer said the evidence will direct the court in coming up with a meaningful determination because what is written on the request for remand form is different from what was allegedly uttered in the recordings.\n\nWe can have an adjournment to midday to allow the State to avail the evidence, Mhike said.\n\nAccording to Mhike, the State showed unwillingness to give him what he requested.\n\nThe prosecution has a warned and cautioned statement which they cannot release because of the privilege they have on the docket.\n\nWe believe the importance of video graphic evidence will cure our arguments, hesaid.\n\nThe State insists this should have been requested on Mhlangas initial appearance.\n\nBut Mhike reminded the State that the defence had already challenged the credibility of that evidence before Magistrate Farai Gwitima.\n\nWe are raising this issue for the second time with the hope that the High Court will have a fairer hearing as the Magistrate Court did not want to hear anything of that sort, Mhike said.\n\nThe presiding judge, Gibson Mandaza ,indefinitely adjourned the hearing for him to have an opportunity to determine the application for a request of further particulars.\n\nMhlanga was arrested following interviews he allegedly had with Blessed Geza, a war veteran and a staunch opponent of President Emmerson Mnangagwas 2030 agenda.\n\nThe police have since launched a manhunt for Geza to answer to incitement, undermining the authority of the President and theft charges.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Staff Reporter Alpha Media Holdings journalist Blessed Mhlanga, who is currently locked up on allegations of publishing information inciting violence, had his bail appeal hearing indefinitely adjourned following the State’s failure to produce evidence of electronic and video graphic recordings which it said it has. His lawyer, Chris Mhike, requested for further particulars which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-mhlangas-bail-appeal-hearing-indefinitely-adjourned-after-state-failed-to-produce-evidence/\">Journalist Mhlanga’s bail appeal hearing indefinitely adjourned after State failed to produce evidence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Knowledge Musona returns as Nees names Warriors squad for 2026 World Cup Qualifiers",
            "url": "https://www.newzimbabwe.com/knowledge-musona-returns-as-nees-names-warriors-squad-for-2026-world-cup-qualifiers/",
            "content": "By Staff Reporter\n\nWarriors head coach Micheal Nees has named the Warriors squad which will play Group C opponents Benin and Nigeria in the 2026 World Cup Qualifiers.\n\nThe Warriors are set to host Benin at Moses Mabhidha stadium in South Africa on March 20 before travelling to Nigeria for a date with the Super Eagles five days later.\n\nZimbabwe is currently bottom in Group C with two points from the four matches it has played.\n\nThe biggest surprise inclusion in Nees squad is Al Akhdoud forward Knowledge Musona, who has marked his return to the Warriors fold since 2022 when he retired from national duty.\n\nMusona led the Warriors as a captain at two AFCON editions -2019 in Egypt and 2021in Cameroon.\n\nI am happy Knowledge came back he gives us exprience.\n\nWe need to make sure that we have a back up in each position as we build up to AFCON, said Nees on Musonas return.\n\nThe coach added that Musona could have returned last year to feature for the Warriors during the 2025 AFCON Qualifiers.\n\nKnowledge was always willing to come back, infact he should have been with the team in November last year.\n\nIf we would have a crisis last year in Cameroon, he was ready, and let me say he is one person who did not want to impose himself, he added.\n\nMoney bags side Scottland have dominated the squad with five players, Godkows Murwira, Khama Billiat, Tymon Machope, Mthokozisi Msebe and Peter Mudhuwa.\n\nNess, however, revealed that there are a number of players on standby who will only be called up in case of an injury crisis in camp.\n\nWarriors 23-men Squad To Face Benin and Nigeria\n\nGOALKEEPERS:\n\nWashington Arubi (Marumo Gallants), Marley Tavaziva (Brentford), Martin Mapisa (MWOS FC)\n\nDEFENDERS:\n\nJordan Zemura (Udinese), Divine Lunga (Sundowns), Gerald Takwara (Al Minaa SC). Munashe Garananga (FC Copenhagen), Isheanesu Mauchi (Simba Bhora), Peter Muduhwa (Scottland), Godknows Murwira (Scottland), Emmanuel Jalai (Dynamos)\n\nMIDFIELDERS:\n\nMarshall Munetsi (Wolves ), Andy Rinomhota (Cardiff City), Marvelous Nakamba (Luton Town), Mthokozisi Msebe (Scottland), Khama Billiat (Scottland), Knowledge Musona (Al-Okhdood). Tawanda Chirewa (Huddersfield Town)\n\nFORWARDS:\n\nPrince Dube (Young Africans), Tawanda Maswanhise (Motherwell), Terrence Dzvukamanja (Supersport United), Tymon Machope (Scottiand), Walter Musona\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12095834/Zimbabwe_captain_Knowledge_Musona_during_the_2021_Africa_Cup_of_Nations.JPG.webp",
            "description": "<p>By Staff Reporter Warriors head coach Micheal Nees has named the Warriors squad which will play Group C opponents Benin and Nigeria in the 2026 World Cup Qualifiers. The Warriors are set to host Benin at Moses Mabhidha stadium in South Africa on March 20 before travelling to Nigeria for a date with the Super</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/knowledge-musona-returns-as-nees-names-warriors-squad-for-2026-world-cup-qualifiers/\">Knowledge Musona returns as Nees names Warriors squad for 2026 World Cup Qualifiers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Environmentalist Mabvirakure found ‘disoriented’ days after going missing; police say Green Rebirth owner a suspect and abduction claims are misleading",
            "url": "https://www.newzimbabwe.com/environmentalist-mabvirakure-found-disoriented-days-after-going-missing-police-say-green-rebirth-owner-a-suspect-and-abduction-claims-are-misleading/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Republic Police (ZRP) has disputed information on social media regarding the alleged abduction of environmentalist Nadia Mabvirakure, stating that she is a suspect in a theft of trust property case and investigations are ongoing.\n\nMabvirakure, who owns Green Rebirth Trust, a project involving a carbon credit tree-planting initiative, was allegedly abducted on March 5 from her Chitungwiza home before she was found in Mutare on Monday, five days later.\n\nAt a press briefing held in the capital on Tuesday, Green Rebirth Trust board member Abigail Mupambi said Mabvirakure was found in a state of shock, further accusing Zanu PF member Batsirai Matiza of having a hand in the alleged abduction.\n\nThroughout the project, Matiza never once visited. However, for the first time, during Nadias disappearance, he showed up, taking pictures and posting them on social media in a celebratory mode.\n\nThat is extremely primitive at a time when we are searching for a woman who has invested so much in a national development, Mupambi said.\n\nIn a statement, police spokesperson Commissioner Paul Nyathi said the information is misleading.\n\nThe information is misleading the public on the exact position on the ground and police investigations.\n\nVongai Nadia Mabvirakure is a suspect in a case of contravening Section 113 of the Criminal Law (Codification and Reform) Act, Chapter 9: 23, Theft of trust property.\n\nThe complainant is Tichabaiwa Gwadu, who represents Matiza Foundation.\n\nIn September 2024, the suspect, through her company, Green Rebirth Trust, went into a partnership with Matiza Foundation to construct a greenhouse or shed net at Chomupunga Business Centre, Murewa, Nyathi said.\n\nAccording to ZRP, Mabvirakure was given US$15,200 cash to acquire the required materials based on her quotation.\n\nInstead of paying cash to Brickforce Hardware, Murewa, the suspect converted the money to personal use and went on to acquire the building materials on credit using false pretence under Matiza Foundation.\n\nBrickforce management later contacted Matiza Foundation Company, raising a complaint and demanding payments.\n\nA report was then made at ZRP Murewa, Nyathi said.\n\nNyathi added that a team from CID Murewa checked for the suspect at her known address in Chitungwiza on 05th March 2025.\n\nThey failed to locate her. They were told by her son, Patrick Mabvirakure that his mother was away.\n\nThe Zimbabwe Republic Police has since located the suspect. She is currently in hospital under Police Guard, he said.\n\nNyathi said full-scale investigations are currently underway in relation to the Theft of trust property case and her familys allegations.\n\nLinda Masarira, who was part of the Mabvirakures search party, shot back at Nyathi, accusing him of lying.\n\n@PoliceZimbabwe are you not ashamed of lying to the world. I spent the day looking for a safe hospital for Nadia. When police officers came to get her statement, I was there and they couldnt because she is disoriented. Why Mr Nyathi are you not doing due diligence and publishing falsehoods. I am coming to your office tomorrow with journalists so you can go and show us where she is hospitalised under police guard. she wrote on X.\n\nMashura akaboiliswa.@PoliceZimbabweare you not ashamed of lying to the world. I spent the day looking for a safe hospital for Nadia. When police officers came to get her statement I was there and they couldng because she is disoriented. Why Mr Nyathi are you not doing duehttps://t.co/RXqy5PvDoe\n\n Linda Tsungirirai Masarira (@lilomatic)March 11, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12075441/Nadia-Mabvirakare-e1741762685138.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Republic Police  (ZRP) has disputed information on social media regarding the alleged abduction of environmentalist Nadia Mabvirakure, stating that she is a suspect in a theft of trust property case and investigations are ongoing. Mabvirakure, who owns Green Rebirth Trust, a project involving a carbon credit tree-planting initiative, was allegedly</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/environmentalist-mabvirakure-found-disoriented-days-after-going-missing-police-say-green-rebirth-owner-a-suspect-and-abduction-claims-are-misleading/\">Environmentalist Mabvirakure found ‘disoriented’ days after going missing; police say Green Rebirth owner a suspect and abduction claims are misleading </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Zambian couple arrested for attempting to smuggle three Zimbabwean children",
            "url": "https://www.newzimbabwe.com/zambian-couple-arrested-for-attempting-to-smuggle-three-zimbabwean-children/",
            "content": "ZNBC\n\nA Livingstone couple has been detained after allegedly attempting to smuggle three Zimbabwean children, aged between 4 and 12 years into Zambia.\n\nHumphrey Likando (62) and Maggie Phiri (51) of Dambwa Central were apprehended following an attempt to smuggle the Children at the Victoria Falls Border Control.\n\nImmigration Department Public Relations Officer Namatu Nshiinka says officers intercepted James Simaundu, a taxi driver, who was transporting the children.\n\nNshiinka says upon questioning, Simaundu failed to provide a satisfactory account of the childrens identities or their origins, leading to his detention.\n\nHe says further investigation revealed that Simaundu was hired by the couple to transport the children from Zimbabwe into Zambia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/31071600/prison-e1559283452384.jpg",
            "description": "<p>ZNBC A Livingstone couple has been detained after allegedly attempting to smuggle three Zimbabwean children, aged between 4 and 12 years into Zambia. Humphrey Likando (62) and Maggie Phiri (51) of Dambwa Central were apprehended following an attempt to smuggle the Children at the Victoria Falls Border Control. Immigration Department Public Relations Officer Namatu Nshiinka</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambian-couple-arrested-for-attempting-to-smuggle-three-zimbabwean-children/\">Zambian couple arrested for attempting to smuggle three Zimbabwean children</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Reggae icon Cocoa Tea dies after long health battle as emotional tributes pour in",
            "url": "https://www.newzimbabwe.com/reggae-icon-cocoa-tea-dies-after-long-health-battle-as-emotional-tributes-pour-in/",
            "content": "MirrorUK\n\nReggaestar Cocoa Tea has been flooded with tributes from the musicworldafter his death aged 65.\n\nCocoa Tea  born Calvin George Scott inJamaicain 1959  died at a hospital in Fort Lauderdale, Florida, during the early hours of March 11 following a long health battle, according to his wife.\n\nI got a call early this morning to say that he had been transferred from the facility to the hospital which is like five minutes away because he was vomiting, his wife Malvia Scott confirmed to theJamaica Gleaner. He was initially diagnosed with lymphoma in 2019, but for the last six months he was also struggling with pneumonia.\n\nMalvia revealed that during his final months the reggae star remained in good spirits, sharing: He was definitely very brave. He was positive throughout it all. About three weeks ago when he was admitted in the hospital he asked if I was worried and I said I am always worried. He told me not to worry because everything was going to be all right. He was always very hopeful.\n\nFollowing Cocoa Teas death, Jamaican Minister of Culture, Gender, Entertainment and Sport, Olivia Grange also spoke to the publication, and shared that she was very saddened by the passing of Sweet Sweet Cocoa Tea.\n\nMinister Grange added: He has been a staple in the industry for so long. He is one of the greatest reggae singers who has ever lived and his work will stand the test of time. We salute him at this time  condolences to his family.\n\nIt has been a pleasure working with him over these years and we are glad that we had the opportunity to give him some of flowers while he was here with us. May his soul rest in peace.\n\nOn X, formerly known asTwitter, others rushed to honour Cocoa Tea  who started out in music aged just 14 and had hits including Rocking Dolly, Rikers Island, and I Lost My Sonia.\n\nMany of Scotts songs were attributed to influencing Jamaican culture and the youth, sharing his Rastafarian morals and encouraging young people to stay in education and work.\n\nGrammy Award-winning reggae artist Morgan Heritage wrote: May your light never fade away big brother. You now rest in Zion with the angels but we will never forget the moments weve shared beloved. Our condolences go out to your entire family. Long live the great legendary icon Cocoa Tea!\n\nThe Wailers, who formed as a separate band following the death of memberBob Marleyin 1981, shared: Rest in power, Cocoa Tea. Your voice and music will always be remembered.\n\nDavid RodiganMBE, known for his work on severalBBCRadio stations, penned: The Reggae world is mourning the loss of one of its finest voices, Cocoa Tea died this morning from cardiac arrest in Fort Lauderdale.\n\nHe leaves behind a catalogue of classic recordings which will forever be played in the pantheon of great Jamaican music. RIP sweet Cocoa Tea.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12060623/0_Cocoa-Tea.webp",
            "description": "<p>MirrorUK Reggae star Cocoa Tea has been flooded with tributes from the music world after his death aged 65. Cocoa Tea – born Calvin George Scott in Jamaica in 1959 – died at a hospital in Fort Lauderdale, Florida, during the early hours of March 11 following a long health battle, according to his wife. “I got a call early</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/reggae-icon-cocoa-tea-dies-after-long-health-battle-as-emotional-tributes-pour-in/\">Reggae icon Cocoa Tea dies after long health battle as emotional tributes pour in</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Annual jab for HIV protection passes trial hurdle",
            "url": "https://www.newzimbabwe.com/annual-jab-for-hiv-protection-passes-trial-hurdle/",
            "content": "BBC\n\nAn annual injection designed to guard against Human Immunodeficiency Virus (HIV) has completed an important early safety trial, researchers report inThe Lancetmedical journal.\n\nLenacapavir stops the virus from replicating inside cells.\n\nIf future trials go well  now it has passed the first, Phase I, testing hurdle  it could become the longest-acting form of HIV prevention available.\n\nCurrently,people can take daily pills or sometimes have injections every eight weeks, for pre-exposure prophylaxis (PrEP), to reduce their risk.\n\nPrEP tablets are highly effective but taking them every day can be difficult.\n\nAbout 39.9 million people are living with HIV, 65% of them in the World Health Organization African Region, according to the most recent figures, for 2023.\n\nAnd the WHO, Global Fund and Joint United Nations Programme on HIV and Aids (UNAids) are all working on strategies to end the HIV epidemic by 2030, which include improving access to medicines such as PrEP.\n\nFor the trial, 40 people without HIV were injected into the muscle with lenacapavir, with no major side effects or safety concerns.\n\nAnd after 56 weeks, the medicine was still detectable in their bodies.\n\nFuture trials must include more diverse participants, the researchers told the 2025Conference on Retroviruses and Opportunistic Infections.\n\nBut they added: Yearly dosing of lenacapavir has the potential to further decrease current barriers to PrEP by increasing the uptake of, persistence on, and, therefore, scalability of PrEP.\n\nRichard Angell, from the Terrence Higgins Trust HIV charity, said: PrEP as a daily pill has been a game-changer in our HIV response.\n\nThe prospect of safe annual injectable PrEP is as exciting as it is transformational.\n\nIts great to see these early results that suggest injectable PrEP might be effective for up to 12 months.\n\nWe need to get ready for its rollout now and fund sexual-health clinics to do so.\n\nAccess to PrEP had been variable, Mr Angell said, creating inequalities.\n\nThe oral pill is still not available in prisons, online or in community pharmacy, he said.\n\nThe Scottish Medicines Consortium has finally approved two-monthly PrEP injections for use in Scotland  but we are waiting for NICE [National Institute for Health and Care Excellence] approval for use in England.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12060332/hiv-jab.webp",
            "description": "<p>BBC An annual injection designed to guard against Human Immunodeficiency Virus (HIV) has completed an important early safety trial, researchers report in The Lancet medical journal. Lenacapavir stops the virus from replicating inside cells. If future trials go well – now it has passed the first, Phase I, testing hurdle – it could become the longest-acting form</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/annual-jab-for-hiv-protection-passes-trial-hurdle/\">Annual jab for HIV protection passes trial hurdle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Chipezeze tipped to make Warriors return",
            "url": "https://www.newzimbabwe.com/chipezeze-tipped-to-make-warriors-return/",
            "content": "By Sport Reporter\n\nMagesi FC goalkeeper Elvis Chipezeze is tipped to make a return to the Warriors during the upcoming 2026 World Cup Qualifiers matches.\n\nZimbabwe is set to play two matches during the coming FIFA international break against Benin and Nigeria, respectively.\n\nWith less than eight days to go to the match against Benin, Warriors coach Michael Nees has yet to announce his squad.\n\nAlready, Benin and Nigeria have released their squads to face the Warriors, who have been set back by an injury crisis.\n\nZimbabwe will be without key players, captain Marvelous Nakamba, Brandon Galloway and veteran goalkeeper Washington Arubi.\n\nThe absence of Arubi is a headache for the coach as Zimbabwe, in previous games in the competition, conceded six goals with Bernard Donavan and Godfrey Chisango as goalkeepers.\n\nSports analysts are tipping for Elvis Chipezezes return so he can replace Arubi.\n\nI think bringing back Chipezeze to the national team will be ideal because his recent performance is testament to how good he is.\n\nAt the end of the day, we need an experienced player, and Chipezeze is that player, said football analyst Forget Maringa.\n\nAnother football analyst, Blessing Chirara said Chipezezes form in the Betway Premiership should not go unnoticed by the Warriors gaffer.\n\n I think Nees should just call Chipezeze for duty. Yes, the young man might have his past with the national team but that is now a thing of the past; he deserves a new chance, he said.\n\nChipezeze is the captain for Magesi FC in the Betway Premiership.\n\nThe former Chicken Inn goalie helped his side win the Carling Cup in November last year, a tournament in which he bagged three Man Of The Match awards.\n\nHis return, however, might not be welcomed by some fans following his poor performance against DRC at the 2019 AFCON finals when he conceded four goals in a match Zimbanwe lost 4-0.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14051412/Elvis-Chipezeze.jpg",
            "description": "<p>By Sport Reporter Magesi FC goalkeeper Elvis Chipezeze is tipped to make a return to the Warriors during the upcoming 2026 World Cup Qualifiers matches. Zimbabwe is set to play two matches during the coming FIFA international break against Benin and Nigeria, respectively. With less than eight days to go to the match against Benin,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chipezeze-tipped-to-make-warriors-return/\">Chipezeze tipped to make Warriors return</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Education Ministry Director in soup for forcing accountant to pay her dubious US$600 allowance",
            "url": "https://www.newzimbabwe.com/education-ministry-director-in-soup-for-forcing-accountant-to-pay-her-dubious-us600-allowance/",
            "content": "By Staff Reporter\n\nA MINISTRY of Primary and Secondary Education (MoPSE) top official has been dragged to court for allegedly using her privileged position to force an accountant to process her a US$600 travel and subsistence (T&S) allowance.\n\nLinda Chinoda, who is Director of Finance, Administration and Human Resources at the MoPSE in Masvingo, was arraigned before Masvingo Magistrates Court for misusing public funds.\n\nThe state alleges that on January 20, 2024, accused person submitted incomplete and fraudulent T&S allowance claim forms for US$600 despite not having participated in the Chivi District Accounts Verification Exercise held between October 1 and 10, 2023.\n\nChinoda allegedly pressured the district accountant to include her claim when withdrawing funds from the Chivi Better Schools Programme in Zimbabwe (BSPZ) CBZ Bank account, resulting in the unauthorised payment of US$600 to her.\n\nThe court heard that the accused person, alongside the district schools inspector, used intimidation and threats to coerce the district accountant into processing the fraudulent claim.\n\nIt was further heard that when the accountant resisted, he was suspended.\n\nInvestigations by the Zimbabwe Anti-Corruption Commission (ZACC) confirmed that the accused person was not present during the verification exercise for which she claimed the T&S allowance, but was instead attending activities in other districts.\n\nThe prosecutor argued that Chinodas actions violated the Public Finance Management Act, which mandates public officials to ensure transparent and lawful use of public resources.\n\nThe State alleges that schools under MoPSE in Chivi district suffered a financial prejudice amounting to US$600 and nothing was recovered.\n\nThe matter was remanded to March 19, 2025 for further proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/01164657/masvingo-magistrates-court-680x380-1.jpg",
            "description": "<p>By Staff Reporter A MINISTRY of Primary and Secondary Education (MoPSE) top official has been dragged to court for allegedly using her privileged position to force an accountant to process her a  US$600 travel and subsistence (T&S) allowance. Linda Chinoda, who is Director of Finance, Administration and Human Resources at the MoPSE in Masvingo, was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/education-ministry-director-in-soup-for-forcing-accountant-to-pay-her-dubious-us600-allowance/\">Education Ministry Director in soup for forcing accountant to pay her dubious US$600 allowance </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Stop FIU’s enforcement of US$ exchange rate – CZI tells RBZ",
            "url": "https://www.newzimbabwe.com/stop-fius-enforcement-of-us-exchange-rate-czi-tells-rbz/",
            "content": "By Alois Vinga\n\nTHE Confederation of Zimbabwe Industries (CZI) has implored the central bank to stop the enforcement of exchange rate policies through the deployment of the Financial Intelligence Unit (FIU) as a strategy to end US$ inflation.\n\nThe US$ year-on-year inflation for the month of February 2025 increased to 15,1%, which was a 0,5%gain from a rate of 14,6% in January 2025. Unlike the trend for the month-on-month inflation, there was no sudden drop in the trend for year-on-year inflation, as the February USD inflation rate is showing an upward trend.\n\nThe increase in the year-on-year inflation is a cause of concern and underlines the need for US$ inflation stabilisation measures to be prioritised, for example, stopping the enforcement of the exchange rate regime by the FIU, said the industry lobby groups inflation developments tracker.\n\nMarket watchers contend that the rise in US$ inflation is largely influenced by traders habit of evading tight ZWG official rate pricing, which forces them to increase greenback prices to create room for pegging higher local currency prices at premiums that are not far from the parallel market rates.\n\nThe inflation movements confirm that USD inflation is influenced by ZiG inflation, as retailers adjust their prices in line with ZiG prices to avoid prosecution by RBZs Financial Intelligence Unit (FIU) for using the parallel market rates, said CZI.\n\nDespite acknowledging the positive impact of the current easing of month-on-month inflation rates to 0.5% for February 2025, the industry said a month-on-month inflation rate of below 1% is crucial to instilling confidence in monetary policy.\n\nWhile the overall month-on-month inflation is still low at only 0.5%, there are still some high-inflation products in the food basket. High-inflation products include sport equipment (7%), information (6%), university fees (4%), and fruits (4%) among others, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171554/mushayavanhu-rbz-3.jpg",
            "description": "<p>By Alois Vinga THE Confederation of Zimbabwe Industries (CZI) has implored the central bank to stop the enforcement of exchange rate policies through the deployment of the Financial Intelligence Unit (FIU) as a strategy to end US$ inflation. The US$ year-on-year inflation for the month of February 2025 increased to 15,1%, which was a 0,5% gain</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stop-fius-enforcement-of-us-exchange-rate-czi-tells-rbz/\">Stop FIU’s enforcement of US$ exchange rate – CZI tells RBZ   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "12 Mar 2025"
        }
    ]
}