{
    "news": [
        {
            "title": "Olorato Mongale: Suspect in South African student’s murder killed in police shootout",
            "url": "https://www.newzimbabwe.com/suspect-in-south-african-students-murder-killed-in-police-shootout/",
            "content": "BBC\n\nA suspect wanted for the murder of a South African university student has been killed in a shootout with the police.\n\nThe man was linked to the death of Olorato Mongale, whose body was found in Johannesburg on Sunday, about two hours after she was reported missing having gone on a date.\n\nIn the early hours of Friday morning, police officers found the main suspect hiding at a residential complex in the coastal town of Amanzimtoti, police spokesperson Athlenda Mathe said.\n\nThe suspect, who has not been named by the police, shot at the officers, who returned fire and killed him, Brigadier Mathe added.\n\nMs Mongales death has sparked a fierce debate about the levels of violence faced by women in South Africa.\n\nIn an impassioned statement, Police Minister Senzo Mchunu called the killing inhumane and gruesome, adding: To all men, this is a plea  simple, urgent, and human: Please, stop killing women.\n\nThe search for two other men linked to Mongales killing continues, while police have arrested the parents of the deceased suspect.\n\nThe suspects mother is accused of enabling him to evade arrest by tipping him off about the polices presence at her house.\n\nThe police also said that the suspects father is the owner of a VW Polo allegedly used in Ms Mongales murder.\n\nEarlier this week, the police named the three suspects linked to the killing as Fezile Ngubane, Philangenkosi Sibongokuhle Makhanya and Bongani Mthimkhulu.\n\nTwo of them  Mr Makhanya and Mr Mthimkhulu  were last month arrested for kidnapping and robbing a woman in KwaZulu-Natal, using the same VW Polo involved in Ms Mongales murder but had been freed on bail, police said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/30111037/3d2900f0-3c6b-11f0-bd09-85867b04fa4e.jpg.webp",
            "description": "<p>BBC A suspect wanted for the murder of a South African university student has been killed in a shootout with the police. The man was linked to the death of Olorato Mongale, whose body was found in Johannesburg on Sunday, about two hours after she was reported missing having gone on a date. In the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/suspect-in-south-african-students-murder-killed-in-police-shootout/\">Olorato Mongale: Suspect in South African student’s murder killed in police shootout</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 May 2025"
        },
        {
            "title": "Students demand government intervention as UZ strike disrupts academics",
            "url": "https://www.newzimbabwe.com/students-demand-government-intervention-as-uz-strike-disrupts-academics/",
            "content": "By Staff Reporter\n\nZIMBABWE National Students Union (ZINASU) has requested an audience with the government over the chaos at the University of Zimbabwe, which has seen lecturers embarking on industrial action for more than 40 days.\n\nUZ is on the edge with this years graduation risking being postponed as lecturers are on strike demanding an increase to their salaries.\n\nLecturers have been picketing at UZ registering their displeasure on the reluctanceby the institutionto increase their wages. They are demanding US$2,500 salaries.\n\nThe strike has consequently suspended examinations with planned sittings also facing a potential icing, further derailing the academic year.\n\nIn a letter addressed to the Ministry of Higher and Tertiary Education, ZINASU Secretary General Devine Nyakudya said the students are bearing the brunt of the continued deadlock between UZ and the striking lecturers.\n\nWe are writing to express our deep concern regarding the ongoing strike by university lecturers at the University of Zimbabwe, which has resulted in significant losses for students.\n\nDespite the university administrations claim that it is business as usual, students have not received academic services for over three weeks, despite paying their tuition fees, read the letter.\n\nUZ and the government have been silent on the ongoing strike, with ZANU PF recently urging that the impasse be resolved.\n\nNyakudya said the government and UZ should urgently address the salary demands of the lecturers.\n\nThe high tuition costs are already a burden for many students, and the lack of academic services exacerbates the situation. We believe that the universitys failure to address the needs of both students and lecturers has led to this impasse.\n\nA demotivated lecturer cannot provide quality education, and it is essential that their concerns are addressed, read the letter further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181203/Zinasu-1.png",
            "description": "<p>By Staff Reporter ZIMBABWE National Students Union (ZINASU) has requested an audience with the government over the chaos at the University of Zimbabwe, which has seen lecturers embarking on industrial action for more than 40 days. UZ is on the edge with this year’s graduation risking being postponed as lecturers are on strike demanding an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/students-demand-government-intervention-as-uz-strike-disrupts-academics/\">Students demand government intervention as UZ strike disrupts academics </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 May 2025"
        },
        {
            "title": "Procurement Authority recommended jailed Chimombe, Mpofu’s company – former  Agriculture Permanent Secretary tells court",
            "url": "https://www.newzimbabwe.com/procurement-authority-recommended-jailed-chimombe-mpofus-company-former-agriculture-permanent-secretary-tells-court/",
            "content": "By Mary Taruvinga\n\nThe trial in which businessmen Mike Chimombe and Moses Mpofu are accused of swindling the state of US$7 million in a goats deal continued Thursday with former Agriculture Ministry Permanent Secretary John Basera taking to the witness stand.\n\nBasera told the High Court Justice Pisirayi Kwenda that the duos company, Blackdeck, had met all the fundamentals required by the Procurement Regulatory Authority (PRAZ) when it was selected for the Presidential Goat Scheme.\n\nBasera also said Blackdeck was the lowest bidder, adding that conflict arose when the company failed to meet its end of the bargain.\n\nWe got a no-objection letter from PRAZ, and we signed a contract with Blackdeck which was the lowest bidder, Basera said.\n\nBasera also told the court that the tender evaluation committee had confirmed that the company had met all the requirements.\n\nThe former PS, however, stated that the two had submitted forged documents for them to win the tender.\n\nHe said this came to light in 2024 when investigations against the two started.\n\nBasera also told the court that as an accounting officer for the ministry, he pointed out that the price of the goats was too much.\n\nI realised that US$7 million for 600,000 goats was exorbitant.\n\nI suggested that we had a meeting to discuss the price of each goat because their price range was between US$175 and US$250, he said.\n\nBasera said the ministry then engaged the supplier and reduced the prices to US$75  US$95 per goat, depending on the breed. Then we agreed to proceed with the deal, he said.\n\nAccording to Basera, Chimombe and Mpofu were advanced ZW$1,9 billion, which was equivalent to US$7,9 million.\n\nHe said the two then told the ministry that they had managed to mobilise 32,000 goats and they had kept them in holding pens.\n\nHe said when representatives went to confirm, they were shocked to find less than 3,000 goats in the holding pens.\n\nBasera said the ministry wanted Chimombe and Mpofu to pay back the money or supply the goats as agreed.\n\nAnother option was to call for a guarantee.\n\nHearing continues Friday with the duos lawyers cross-examining Basera.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga The trial in which businessmen Mike Chimombe and  Moses Mpofu are accused of swindling the state of US$7 million in a goats deal continued Thursday with former Agriculture Ministry Permanent Secretary John Basera taking to the witness stand. Basera told the High Court Justice Pisirayi Kwenda that the duo’s company, Blackdeck, had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/procurement-authority-recommended-jailed-chimombe-mpofus-company-former-agriculture-permanent-secretary-tells-court/\">Procurement Authority recommended jailed Chimombe, Mpofu’s company – former  Agriculture Permanent Secretary tells court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 May 2025"
        },
        {
            "title": "African Sun places Caribbea Bay Resort on the market",
            "url": "https://www.newzimbabwe.com/african-sun-places-caribbea-bay-resort-on-the-market/",
            "content": "By Alois Vinga\n\nLISTED hospitality group, African Sun Limited (ASL) has placed another asset, the Caribbea Bay Resort, on the market.\n\nThis was revealed in a Cautionary Statement issued by ASL informing shareholders of the impending transaction.\n\nShareholders and the investing public are advised that, in keeping with the strategy of unlocking value, negotiations for the disposal of a selection of hospitality assets are still underway. Pursuant to the above, the Company has placed the Monomotapa Hotel as well as the Caribbea Bay Resort on the market for sale, reads the statement in part.\n\nThe negotiations if successful, will constitute a Category 1 transaction; accordingly, the company would be seeking the approval of its shareholders at an Extraordinary General Meeting (EGM) to be convened at the appropriate time.\n\nSaid ASL, Shareholders and the investing public are therefore advised to continue exercising caution when dealing with the Companys securities until advised of the conclusion of the said ongoing processes. By order of the Board.\n\nThe move follows the recent sale of the Great Zimbabwe Hotel in Masvingo, which was sold along with its associated business operations for US$4.2 million as part of a capital-raising initiative.\n\nAfrican Suns current property portfolio includes Holiday Inn Mutare, Troutbeck Resort, Elephant Hills Resort and Conference Centre and Hwange Safari Lodge.\n\nThe group also leases three strategic properties: Holiday Inn Harare, Holiday Inn Bulawayo and The Victoria Falls Hotel.\n\nThe moves are in line with the groups long-term value creation and asset optimisation strategies in response to the industrys dynamism.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29192711/caribbea-bay.jpg",
            "description": "<p>By Alois Vinga LISTED hospitality group, African Sun Limited (ASL) has placed another asset, the Caribbea Bay Resort, on the market. This was revealed in a Cautionary Statement issued by ASL informing shareholders of the impending transaction. “Shareholders and the investing public are advised that, in keeping with the strategy of unlocking value, negotiations for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-places-caribbea-bay-resort-on-the-market/\">African Sun places Caribbea Bay Resort on the market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 May 2025"
        },
        {
            "title": "Joshlin Smith’s mother, two others sentenced to life imprisonment for human trafficking",
            "url": "https://www.newzimbabwe.com/joshlin-smiths-mother-two-others-sentenced-to-life-imprisonment-for-human-trafficking/",
            "content": "Sowetan Live\n\nThe trio received their sentences on Thursday morning. The 10-year kidnapping terms will run concurrently with their life sentences and theyve also been added to the child protection register.\n\nThis sentence is aimed at protecting the vulnerable in society and restoring dignity, presiding judge Nathan Erasmus said.\n\nDuring sentencing, Erasmus noted that the trio committed the crimes under the influence of drugs but stressed that substance abuse was not an excuse.\n\nAddressing Appollis directly, Erasmus said: You are a father of an 11-year-old daughter and acted as a father figure to Joshlin and Kelly Smiths other children. Your attitude in this court showed that you dont care, not only here, but when Pietersen [social worker] asked about Joshlins whereabouts, you said you didnt care.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29195204/kelly-smith.jpg",
            "description": "<p>Sowetan Live The Western Cape High Court has sentenced Joshlin Smith’s mother, Racquel “Kelly” Smith, Jacquen Appollis and Steveno van Rhyn to life imprisonment for human trafficking and 10 years for the kidnapping of the six-year-old girl. “This sentence is aimed at protecting the vulnerable in society and restoring dignity,” Judge Nathan Erasmus. The trio</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/joshlin-smiths-mother-two-others-sentenced-to-life-imprisonment-for-human-trafficking/\">Joshlin Smith’s mother, two others sentenced to life imprisonment for human trafficking</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 May 2025"
        },
        {
            "title": "Former Mauritanian Finance Minister Tah Elected President of AfDB",
            "url": "https://www.newzimbabwe.com/former-mauritanian-finance-minister-tah-elected-president-of-afdb/",
            "content": "By Boakai Fofana\n\nFormer Mauritanian finance minister, Sidi Ould Tah, was elected president of the Africa Development Bank, the AfDBannounced. Tah, who also headed the Arab Bank for Economic Development in Africa, won after three rounds of voting by the AfDBs Board of Governors at their meeting in Abidjan, securing more than 76% of the votes in the end, according toreports.\n\nIn the weeks leading up to Thursdays vote, Tahpromisedto undertake internal reforms if elected. He spoke of the needto improve key functions of the Bank, such as reducing the time frame for the implementation of projects and attracting the necessary talent.\n\nAmongst what he said were thefour main pillars  forming the basis of his leadership  are scaling up financing for development and strengthening the continents financial architecture.\n\nThe Mauritanian becomes the ninth president of the AfDB since its founding in 1964. He ran against four candidates: Amadou Hott of Senegal, Zambias Samuel Maimbo, Mahamat Abbas Tolli of Chad, and the only woman candidate, Bajabulile Swazi Tshabalala from South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29193432/afdb.jpg",
            "description": "<p>By Boakai Fofana  Former Mauritanian finance minister, Sidi Ould Tah, was elected president of the Africa Development Bank, the AfDB announced. Tah, who also headed the Arab Bank for Economic Development in Africa, won after three rounds of voting by the AfDB’s Board of Governors at their meeting in Abidjan, securing more than 76% of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-mauritanian-finance-minister-tah-elected-president-of-afdb/\">Former Mauritanian Finance Minister Tah Elected President of AfDB</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 May 2025"
        }
    ]
}