{
    "news": [
        {
            "title": "Over 1,000 jobs cut off as retail sector crisis deepens",
            "url": "https://www.newzimbabwe.com/over-1000-jobs-cut-off-as-retail-sector-crisis-deepens/",
            "content": "By Alois Vinga\n\nZimbabwes embattled retail sector has so far cut more than 1,000 jobs on the back of calls for the government to institute progressive measures to save the carnage.\n\nRegional retailer Choppies Enterprise Limited (Choppies) and fast-moving consumer goods firm Unilever Plc have indicated their intention to leave the country. Khayah Cement Limited and clothing retailer Truworths Limited entered corporate rescue in December and August 2024, respectively.\n\nAlso, British multinational and professional services provider PriceWaterHouseCoopers International Limited is on its way out of Zimbabwe.\n\nEven long-surviving resilient brands like OK Zimbabwe, TM Pick n Pay are currently battling to keep their heads above the waters.\n\nAt the heart of the crisis, authorities have identified a plethora of problems with the spiraling informal sector being the most prominent.\n\nSpeaking to NewZimbabwe.com Tuesday, the Commercial Workers Union of Zimbabwe (CWUZ) General Secretary, Cuthbert Chikwekwete said an analysis of the situation on the employment side is heartbreaking.\n\nCuthbert Chikwekwete\n\nThe challenges in the retail sector started escalating in late 2023 and have been worsening over the past year until they deteriorated this year. Our records show that over 1,000 jobs have been cut off and the majority of those affected are workers on fixed-term contracts, he said.\n\nThe workers leader said the majority of workers leaving their jobs are facing severe hardships as they struggle to put food on their tables.\n\nThe net effects of these job cuts are choking livelihoods. Many of these employees are failing to support their families heightening the chances of chronic illnesses. The fact that the retail sector was hiring employees on renewable fixed term contracts leaves them without any fallback position like pension payouts and when they lose their jobs what it means is that they are nose-diving into poverty, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga Zimbabwe’s embattled retail sector has so far cut more than 1,000 jobs on the back of calls for the government to institute progressive measures to save the carnage. Regional retailer Choppies Enterprise Limited (Choppies) and fast-moving consumer goods firm Unilever Plc have indicated their intention to leave the country. Khayah Cement Limited</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-1000-jobs-cut-off-as-retail-sector-crisis-deepens/\">Over 1,000 jobs cut off as retail sector crisis deepens</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "RTG sinks US$500,000 in New Ambassador Hotel refurb",
            "url": "https://www.newzimbabwe.com/rtg-sinks-us500000-in-new-ambassador-hotel-refurb/",
            "content": "By Alois Vinga\n\nTOP hospitality concern, Rainbow Tourism Group (RTG) has sunk US$500,000 in refurbishing the New Ambassador Hotel as part of efforts to up the ante in line with global trends.\n\nExtensive renovations at the Harare CBD-based property which kicked off early this year include a complete transformation of guest rooms and bathrooms, aimed at enhancing comfort and elevating the overall guest experience.\n\nSpeaking to NewZimbabwe.com on the sidelines of a media tour Wednesday, RTG Corporate Affairs and Quality Manager, Pride Khumbula, highlighted that all 72 rooms are undergoing a complete overhaul.\n\nAll 72 rooms are undergoing a complete transformation. The refurbishment includes reconfiguring and reconstruction of the room layout to maximize space, the bathrooms have been overhauled with the installation of brand-new modern fixtures which include bathroom vanities, and a walk-in shower.\n\nThere are modern toilets which are low flow systems to reduce water consumption in line with the Groups sustainability drive, she said.\n\nThe hotel is set to reopen on 10 February 2025, and will host delegates during the SADC summit at the end of February.\n\nWe are pleased to advise that the New Ambassador Hotel will be ready to host the delegations attending the SADC Ministers meeting in February and March, she said.\n\nThe New Ambassador Hotel has incorporated water-saving low-flow toilet flushing systems, LED energy-efficient lighting, and other environmentally conscious measures to reduce its carbon footprint.\n\nThe hotel will also feature state-of-the-art technology, including smart televisions and internet-based telephone systems. In line with RTGs commitment to enhancing guest connectivity, the hotels WiFi infrastructure is being\n\nupgraded with enhanced wireless access points to ensure seamless, high-speed internet performance.\n\nAdditionally, the door access and locking system will transition to an RFID Key Card system, supporting mobile key technology for a streamlined check-in process while improving security and overall guest convenience.\n\nConveniently located within Harares CBD, the New Ambassador Hotel is within walking distance of major financial, commercial, and government institutions, as well as retail shops, cinemas, and cultural landmarks such as the National Museum and Art Gallery.\n\nRTG has invested US$26 million in hotel refurbishments over the past five years. In July 2024, the Group completed a US$5.2 million renovation of the Rainbow Towers Hotel and Harare International Conference Centre (HICC).\n\nFurther solidifying its position as a leader in Zimbabwes hospitality sector, RTG is investing US$380,000 in the refurbishment of its Victoria Falls properties, including Victoria Falls Rainbow Hotel and AZambezi River Lodge.\n\nThe transformation of the 3 properties reflects a commitment to quality, innovation and sustainability, echoing the aspirations of the Zimbabwean Government to foster an inclusive economy that benefits all citizens.\n\nThe Group is also not only enhancing its service offerings but also contributing to the broader goal of attracting tourism and investment, essential pillars of the 2030 vision.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06050633/Pride-Khumbula-2-680x380-1.jpg",
            "description": "<p>By Alois Vinga TOP hospitality concern, Rainbow Tourism Group (RTG) has sunk US$500,000 in refurbishing the New Ambassador Hotel as part of efforts to up the ante in line with global trends. Extensive renovations at the Harare CBD-based property which kicked off early this year include a complete transformation of guest rooms and bathrooms, aimed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rtg-sinks-us500000-in-new-ambassador-hotel-refurb/\">RTG sinks US$500,000 in New Ambassador Hotel refurb</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "Prince Dube’s brace inspires Young Africa to victory",
            "url": "https://www.newzimbabwe.com/prince-dubes-brace-inspires-young-africa-to-victory/",
            "content": "By Sports Reporter\n\nWarriors striker Prince Dube was on target Wednesday evening, nettinga brace which helped his side to secure a 6-1 win over KenGold FC in the Tanzanian topflight league.\n\nMgadafias Dube is known,scored in each half of the match,the 16th and 56th minute.\n\nYoung Africa had a field day on the pitch as they overpowered opponents in both halves.\n\nThe defending champions went for the break leading 4-0, only to come and add two more goals in the second half in which the opponents salvaged a consolation goal.\n\nWednesdays victory saw Yanga stretching their tally on top of the log to 45 points, two more than second-place occupiers Simba SC who are on 43 with a game in hand.\n\nDubes side is enjoying a purple patch in the league as they have gone for nine games without dropping a single point in the league and a win against JKT Tanzania this weekend will see them going for ten consecutive straight wins in the league.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06050109/FB_IMG_1738796011616.jpg",
            "description": "<p>By Sports Reporter Warriors striker Prince Dube was on target Wednesday evening, netting a brace which helped his side to secure a 6-1 win over KenGold FC in the Tanzanian topflight league. Mgadafi as Dube is known, scored in each half of the match, the 16th and 56th minute. Young Africa had a field day on the pitch as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prince-dubes-brace-inspires-young-africa-to-victory/\">Prince Dube’s brace inspires Young Africa to victory</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "“I want to achieve great things at Huddersfield Town” – Zimbabwe international Tawanda Chirewa",
            "url": "https://www.newzimbabwe.com/zimbabwes-tawanda-chirewa-i-want-to-achieve-great-things-at-huddersfield-town/",
            "content": "Pan Africa Football\n\nZimbabwe international Tawanda Chirema has talked for the first time since sealing a deadline day transfer move to Huddersfield Town from Premier League side Wolverhampton Wanderers until the end of the 2024/25 season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/04055610/chirewa.jpeg",
            "description": "<p>Pan Africa Football Zimbabwe international Tawanda Chirema has talked for the first time since sealing a deadline day transfer move to Huddersfield Town from Premier League side Wolverhampton Wanderers until the end of the 2024/25 season. The 21-year-old Chirewa spent the first half of the 2024/25 season on loan with Sky Bet Championship side Derby</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-tawanda-chirewa-i-want-to-achieve-great-things-at-huddersfield-town/\">“I want to achieve great things at Huddersfield Town” – Zimbabwe international Tawanda Chirewa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "Shunned by the West, Zimbabwe’s UAE gamble hands economy a lifeline",
            "url": "https://www.newzimbabwe.com/shunned-by-the-west-zimbabwes-uae-gamble-hands-economy-a-lifeline/",
            "content": "Bloomberg\n\nZimbabwean President Emmerson Mnangagwas six years of wooing the United Arab Emirates has given a lifeline to a nation that the West has ostracised for a quarter century and is unable to repay its loans to China.\n\nThe wealthy Gulf state has overtaken China to become the resource-rich nations biggest export partner and since 2022 has plowed $1.4 billion into everything from gold trading to real estate. The steps are part of a wider effort by the UAE to build influence across Africa thats seen it become the country that routinely pledges the most foreign direct investment into the continent.\n\nThe UAE has gone within a few years from being unknown in commerce to becoming the nations foremost trading partner, Eldred Masunungure, a political science professor at the University of Zimbabwe, said.\n\nIn Mount Hampden, 11 miles northeast of Harare, Shaji Ul Mulk, a Dubai-based businessman who owns Mulk International, is developing a flagship cyber city for the rich to replace the capital, which is in ruin. The Dubai Gold & Commodities Exchange has a pact to establish a gold market and miner Bluefin Gold Group plans to set up in the country.\n\nThe oil-rich Gulf state is also consistently among the southern African nations top five foreign direct investment sources, according to the Zimbabwe Investment and Development Agency. And it doesnt plan to let up.\n\nThe UAE wants to maintain and expand its relationships with Zimbabwe in line with its broader foreign policy objectives, a UAE official who asked not to be identified said.\n\nStill, caution may be warranted because of the state of Zimbabwes economy. The southern African nations debt pile has ballooned to $21 billion since a default in 1999. Its sixth attempt at a viable local currency in 16 years is foundering less than nine months after debut. The economy is largely informal, high inflation, the economys Achilles heel, persists, making it difficult for big businesses to flourish.\n\nGulf states are increasingly using their petrodollars to build influence in Africa, as China pares back loans to the continent, Europe scales back its presence and the US becomes more domestically focused.\n\nThe UAE has invested $110 billion in Africa spread across trade, investment, renewable energy, logistics, food security and infrastructure, according to its government.\n\nIts strategic investments are made with the prospect of earning outsized returns, said Jim Krane, a fellow at Rice Universitys Baker Institute for Public Policy in Houston. The investing firms, which are mostly state-linked, target countries where they can advance the strategic interests of the UAE and are willing to overlook some of the risks that have otherwise prevented firms from entering these frontier markets, he added.\n\nThere are diplomatic motivations that go beyond profitability, but profits are still expected, said Krane.\n\nLast year, the Abu Dhabi wealth fund ADQ agreed to invest $35 billion in Egypt, most of it to develop prime land on the North African nations Mediterranean coast.That rescued the economy from its worst foreign-exchange crisis in decades.\n\nThe UAEs decision to invest in Zimbabwe came after Mnangagwa visited the country in 2019 as part of a roadshow to attract investment into an economy that was in freefall and locked out of capital markets because of sanctions, the debt default and decades of misrule by Robert Mugabe.\n\nThe UAE was mainly attracted to Zimbabwes gold which has become a bright spot for the economy, Lyle Begbie, an economist at Oxford Economics said. Last year output rose to a record 36 tons.\n\nTies to the UAE provided Zimbabwe with options for survival, senior officials in Mnangagwas administration said in 2019  and still do, said Hasnain Malik, an emerging market strategist at Tellimer in Dubai.\n\nUAE investment inflows are nowhere near large enough, on their own, to build up the foreign reserves needed to support a stable currency, he said. The economic solution for Zimbabwe requires addressing sovereign debt arrears, committing to a credible fiscal path, unlocking multilateral finance and foreign direct investment, and, ultimately, allowing a freer float of the currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>Bloomberg Zimbabwean President Emmerson Mnangagwa’s six years of wooing the United Arab Emirates has given a lifeline to a nation that the West has ostracised for a quarter century and is unable to repay its loans to China. The wealthy Gulf state has overtaken China to become the resource-rich nation’s biggest export partner and since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shunned-by-the-west-zimbabwes-uae-gamble-hands-economy-a-lifeline/\">Shunned by the West, Zimbabwe’s UAE gamble hands economy a lifeline</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "Mnangagwa welcomes Trump’s decision to deport Zimbabweans illegally staying in America",
            "url": "https://www.newzimbabwe.com/mnangagwa-welcomes-trumps-decision-to-deport-zimbabweans-illegally-staying-in-america/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has welcomed his American counterpart Donald Trumps decision to deport illegal immigrants including some 545 Zimbabweans set to be shipped back.\n\nThe 545 Zimbabweans are part of a November 2024 list that has 1,445,549 noncitizens expected to be deported from America in the coming months.\n\nThey are on Americas Immigration and Customs Enforcements (ICE) list of noncitizens who were delegated for removal last November.\n\nThe government of Zimbabwe supports the United States governments decision to repatriate and return our Zimbabwean citizens who may have been residing in the US illegally, said Mnangagwa.\n\nRELATED:545 Zimbabweans set to be deported as Trump administration cranks up fight on illegal immigrants\n\nMillions of Zimbabweans have fled the country for Western nations, legally and illegally, over the past three decades because of the countrys worsening economy which has meant fewer jobs, poor remuneration and inhospitable working conditions.\n\nMillions are reported to be residing and working in South Africa illegally, while tens of thousands have opted for menial work in Australia, Dubai, Canada and on cruise ships.\n\nTrump, who was recently reelected as Americas President, is proceeding with his America First policy that has seen a raft of changes to the superpowers foreign policy, humanitarian funding and international financial support across the globe.\n\nHis administration has initiated raids in areas known to be populated by illegal immigrants, with reports indicating that over 500 are being nabbed daily.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has welcomed his American counterpart Donald Trump’s decision to deport illegal immigrants including some 545 Zimbabweans set to be shipped back. The 545 Zimbabweans are part of a November 2024 list that has 1,445,549 noncitizens expected to be deported from America in the coming months. They are on America’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-welcomes-trumps-decision-to-deport-zimbabweans-illegally-staying-in-america/\">Mnangagwa welcomes Trump’s decision to deport Zimbabweans illegally staying in America</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "Former CAPS United player Muganiwa donates to Total Football Academy",
            "url": "https://www.newzimbabwe.com/former-caps-united-player-muganiwa-donates-to-total-football-academy/",
            "content": "By Sport Reporter\n\nTotal Football Academy received a huge boost ahead of the 2025 league season after former CAPS United player Itayi Muganiwa donated a new kit.\n\nMuganiwas donation is part of his company IB Sports social cooperate responsibility.\n\nWith a lengthy football career that saw him playing for several local teams including CAPS United, Lengnthens, Mushowani Stars, Zimbabwe Saints and others, the former footballer said his support is a small way of addressing some of the challenges he faced in junior football.\n\nI grew up at CAPS United juniors and saw how important and how difficult it is to support junior football because it is where most attention is needed.\n\nJunior football is very key, especially in Zimbabwe this is why most players are failing to do basic things when playing professionally it is because they have no sound foundation, said Muganiwa.\n\nLast year Muganiwamade a similar donation to Harare City Football Club, through his company IB Sports.\n\nMuganiwas relationship with Total Football Academy traces back to his playing days as the academy played a critical role in keepinghim in the game.\n\nWhen I got my first premier league contract at Lengthens FC, I got a career threatening injury and my PSL club could not afford my medical bills.\n\nThe directors of Total Academy contributed and covered my bills, despite no legal contract between myself and Total they still covered my bills, added Muganiwa.\n\nThe former CAPS United football is one of the benefactors who has been supporting the club for years.\n\nTotal Football Academy is a fully registered academy that meets FIFA-required standards in Zimbabwe.\n\nBased at Churchill High School in Harare, the academy has produced several stars, among them Warriors defender Munashe Garananga who is plying his trade in Europe for Copenhagen, Denmark.\n\nOther than Garananga, the academy boasts of producing other players like Colleen Mujuru, Munashe Pini, Charles Moffat, Prince Milanzi and Dinoleen Masukuta.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06045024/IMG-20250203-WA0038.jpg",
            "description": "<p>By Sport Reporter Total Football Academy received a huge boost ahead of the 2025 league season after former CAPS United player Itayi Muganiwa donated a new kit. Muganiwa’s donation is part of his company IB Sports’ social cooperate responsibility. With a lengthy football career that saw him playing for several local teams including CAPS United,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-caps-united-player-muganiwa-donates-to-total-football-academy/\">Former CAPS United player Muganiwa donates to Total Football Academy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "NPA says it only works on quality investigations, as its cold war with ZACC rages on",
            "url": "https://www.newzimbabwe.com/npa-says-it-only-works-on-quality-investigations-as-its-cold-war-with-zacc-rages-on/",
            "content": "By Staff Reporter\n\nTHE National Prosecuting Authority (NPA) has responded to reported disgruntlement within ZACC over its recent decision to withdraw fraud cases against several senior Harare City Council officials.\n\nQuestions were asked after the acquittal of town clerk Hosiah Chisango and five others in a US$9 million tender fraud issue that also involves incarcerated Moses Mpofu and Mike Chimombe.\n\nThrough a statement released Wednesday, NPA said successful prosecutions were only determined by quality investigations, in what can be seen as a clear dig at ZACC.\n\nThe statement also points out that the decision to prosecute rests with them.\n\nThe NPA operates with independence, without fear or favour, and is dedicated to upholding the rule of law with diligence and integrity, reads the statement.\n\nThe success of prosecution is directly linked to the quality of conducted investigations.\n\nNPAZ takes pride in presenting only ready and complete matters in court, adhering to high standards and constitutional responsibilities.\n\nThe decision on how to proceed with cases rests on our constitutional prerogative to initiate criminal proceedings, and we are dedicated to fostering productive partnerships with supportive government agencies for a robust justice system.\n\nNPA prioritises thoroughness in its processes and does not rush to set down matters for trial that are incomplete or lack sufficient evidence.\n\nA cold war between the two has been on for years.\n\nZACC believes its investigations are watertight and should amount to successful prosecutions while the NPA has always dismissed them as poorly done or lacking adequate evidence.\n\nAccording to the statement ZACC sent 314 dockets to the NPA last year.\n\nAdded NPA: It is important to note that, while not all these dockets were immediately ready for trial, they have been meticulously reviewed and scheduled for prosecution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/07/04223133/ZACC-Chairperson-Loice-Matanda-Moyo.jpg",
            "description": "<p>By Staff Reporter THE National Prosecuting Authority (NPA) has responded to reported disgruntlement within ZACC over its recent decision to withdraw fraud cases against several senior Harare City Council officials. Questions were asked after the acquittal of town clerk Hosiah Chisango and five others in a US$9 million tender fraud issue that also involves incarcerated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/npa-says-it-only-works-on-quality-investigations-as-its-cold-war-with-zacc-rages-on/\">NPA says it only works on quality investigations, as its cold war with ZACC rages on</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "Matthew Parris: Why I decided to go it alone in Zimbabwe",
            "url": "https://www.newzimbabwe.com/matthew-parris-why-i-decided-to-go-it-alone-in-zimbabwe/",
            "content": "Matthew Parris | The Times\n\nDont hesitate. Dont look down. Just do it. And it was my turn.\n\nFrom the cliffs edge I stared across to the other side of the ravine, a wall of sharp rocks half hidden in racing clouds of mist. Beneath me  2,500 feet down  came the sound of a river crashing through the thick African forest that packed the ravines floor. To one side was a leg-wobbling view of the Mutarazi waterfall, Africas second highest, teeming down into the Mutarazi River. To the other lay the great valley into which the river flowed. Above, the blue of the wide Zimbabwe sky.\n\nAnd in front of me? A 1,200-yard steel cable, spanning the chasm. Zip wire doesnt do it justice. This was the Skyline,the highest anywhere on the planet, and I, crash-helmeted and harnessed beneath it, was readying myself to fly. Then, to the metallic scream of the pulley above my head, I was for 40 seconds reincarnated as an eagle.\n\nThere was no danger. Far and Wide, the intrepid Zimbabwean company that set up the Skyline, takes its zip technology seriously and there has never been an accident, I was assured by the reassuringly named and very capable experts, Justice and Wisdom, who checked my harness straps and launched me into thin air.\n\nAfter hitting a peak of 25mph or so, I slowed as the cliff on the far side neared before automatic brakes landed me on my feet, my heart and head buzzing from the ride. Already that morning I had crossed the SkyWalk  two thin bridges strung over the gorge on cables  which was just as spectacular but a little more sedate than the zip line (89 for both; farandwide.co.zw). This, it seemed, was going to be an African adventure rather different to the usual sun-baked safari searching for lions, hippos and elephants.\n\nJust hire a car, get a map and go. This country and its range of super places to stay is open for business. We were five, four friends and I, following our own itinerary and paying our own way, and wed reached the Nyanga mountains in the Eastern Highlands. Cool, green and damp, and rising to the countrys highest peak, the 8,500ft Mount Nyangani (we climbed it with a cheerful National Park guide, a steep but lovely mornings walk), the Eastern Highlands are one of Zimbabweans favourite places places for rest and recreation.\n\nThere are acres of conifer plantations and for a moment you can fool yourself youre in Scotland  until the sun bursts out and a little blue duiker buck darts though the forest, or monkeys chatter from the trees, or the view opens up of distant mountains forming the border with Mozambique and the Indian Ocean beyond.\n\nThis is a land I love  I spent my boyhood and teenage years in what is now Zimbabwe and came on holiday then to Nyanga, when the roads were even rougher, the hotels more basic and no one had dreamt of stringing a zip line across the cliffs. These days you can stay in the SkyDeck Mountain Retreat, the glamorous ultra-modern lodge also run by Far and Wide, where Jeremy Clarkson last year began his epic-comic final grand tour in Zimbabwe (not cheap: all-inclusive doubles are from 1,948 a night; skydeckretreat.com).\n\nWe chose something cheaper and a little more traditional, renting two of its sweet stone cottages on the edge of the native forest, cooking and eating our own meals in front of blazing log fires, our evenings lit by oil lamps. Theres mains power too  at least some of the time, since the national supply is erratic  but nothing beats a whisky by oil lamp as the rapid dark of an African evening falls (a nights self-catering for two from 106; wildnyanga.com).\n\nMention Zimbabwe in Britain and you usually get two reactions. People worry about the politics and safety  more on that in a moment  and they assume tourism is limited to the Victoria Falls and safaris in the many magnificent national parks.\n\nThe falls, massive, roaring walls of water, are extraordinary. So many wonders of the world disappoint. These dont. And Zims national parks are among Africas treasures. Welcoming, scholarly guides share knowledge from their years of training (standards of English are generally high) and there are luxurious lodges if you can afford them, and well-run, affordable campsites and chalets if simplicity attracts instead.\n\nBut theres so much more to Zimbabwe and on this visit I wanted to remind myself how much. So we started in Harare, the capital city I remember as Salisbury when I spent my boyhood there. Many tourists fly direct to Victoria Falls but that is to miss so much.\n\nHarare is gentler and quieter than Africas more manic big capitals. The traffic lights dont always work but then there isnt much traffic. Years of economic difficulty have had an impact  in places the city can look a touch knocked-about  but the jacaranda trees still carry their heavy blue blossom along avenues each spring, the hotels and restaurants are good, the shops are well-stocked and if there are potholes in the roads, well, arent we used to that in Britain anyway? Harare is a fine introduction to the country.\n\nWhere to stay? I love the long-standing Bront Garden Hotel, set around a courtyard of lush gardens (doubles from 110; brontehotel.com), but this time we began at Amanzi Lodge, which sits in the wealthy, leafy northern suburbs. To call its thatched free-standing rooms cabins would be to underplay: our suite was furnished with antiques and had a vast bath and a private terrace with a hammock. Sadly I only found out when we left that everything in the minibar was included in the price (doubles from 227; amanzi.co.zw).\n\nAmanzis gardens, complete with tiny African squirrels and vervet monkeys, are a botanical reserve all of their own and the restaurant one of the best in the capital, chosen by the president, Emmerson Mnangagwa, when, after replacing Robert Mugabe, he lunched with a western journalist to explain how he wanted to change the country for the better.\n\nHas he? Well, I tend to steer clear of politics when abroad. All I can say is that every Zimbabwean we met, black and white, was pleased to see tourists. End of the day its simple: people visiting keeps the animals alive! one local friend told me. As for safety, its always sensible to watch your possessions in towns but for the most part the country is gentle, friendly and relaxed. Security is light years ahead of Johannesburg, Cape Town or Nairobi. And if you stick to the higher central areas the malaria risk is minimal too. These are high plains and mountains: the skies are blue but the temperatures moderate, even chilly on winter mornings.\n\nDriving (on the left) is fine. We hired a 44 from Impala Car Rental, a helpful local company, though the big global brands are available too (impala.co.zw). Go carefully, smile at police roadblocks  they mostly wave you through  and use Google Maps to navigate. Buy an e-sim at the airport to save hideous mobile roaming and keep a fistful of US dollars to pay road tolls. We stocked up with food and wine. A supermarket in the northern suburbs was packed with everything you could need. Add a cold box and a string of boerewors (the ubiquitous and tasty southern African sausage) and you are all set for a braai, or barbecue.\n\nFrom the Eastern Highlands we cut across the country by road, on tarmac and then, by choice, dirt tracks past villages of round thatched huts. Children waved, goats darted out and the sun shone on the great hills of weather-rounded granite, which are the emblematic landscape of Zimbabwe.\n\nWe were in the country over new year, in the warm summer, as clouds gathered, lightning flashed and sudden heavy rainstorms broke 18 months of cruel drought. I hope it rains all through your holiday! one farmer told us but it didnt. Its not the time most tourists go but we loved it.\n\nWe spent a night on the way at Imire Lodge, which has done precious work protecting and breeding the rhinos we met (162pp; imire.co.zw). Not far from the comfortable rooms I reacquainted myself with an elephant that has, since birth, identified as a buffalo and seems happy in her buffalo herd. I tried feeding her. Do remember: the trunk is an elongated nose, not a mouth.\n\nA day later and we were racing down the main route into Zimbabwes charming second city, Bulawayo, its colonial-era buildings lining streets wide enough (they say) to turn an ox cart around in. Our destination was a place Ive long admired: the Bulawayo Club, still an elegant, antique city institution with dark panelling, portraits of long-gone settlers and farmers, and a billiard room where three Edwardian tables wait for players. You neednt be a member to stay, its great value and the huge bar still has a pith helmet hanging in one corner. I like the place so much Ive applied to join (doubles from 95; booking.com).\n\nThere was just time for one last trip into the wilderness. An hour out of Bulawayo, the Matobo National Park is a tumble of rocky valleys and boulder-strewn peaks, wrapped in deep bush. One well-guarded section is alive with game but I wanted to walk so we scrambled up signed paths to caves with some of the most evocative rock art in Africa. People danced among animals in pictures perhaps twice as old as Stonehenge. I looked out across the mountains, where afternoon rain clouds were boiling up above the plains, and looked forward to dinner at the spectacularly sited Big Cave Lodge (doubles from 268; bigcavematopos.com)  but most of all I looked ahead, making plans already to return to Zim.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05151040/PARRIS.jpg",
            "description": "<p>Matthew Parris | The Times Don’t hesitate. Don’t look down. Just do it. And it was my turn. From the cliff’s edge I stared across to the other side of the ravine, a wall of sharp rocks half hidden in racing clouds of mist. Beneath me — 2,500 feet down — came the sound of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/matthew-parris-why-i-decided-to-go-it-alone-in-zimbabwe/\">Matthew Parris: Why I decided to go it alone in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        },
        {
            "title": "Hilmax Engineering directors who defrauded ZIMRA of R10million out on bail",
            "url": "https://www.newzimbabwe.com/hilmax-engineering-directors-who-defrauded-zimra-of-r10million-out-on-bail/",
            "content": "By Staff Reporter\n\nHilmax Engineering directors who were arrested on allegations of defrauding the Zimbabwe Revenue Authority (ZIMRA) of ZAR 10.7 million in a foreign scheme appeared in court Wednesday charged with fraud.\n\nThe two are the operations director, Rugare Murwira (59) and Patrick Musavaya (57) the finance director.\n\nThey are facing seven counts of fraud and violating the Exchange Control Act.\n\nThe two were not asked to plead when they appeared before Magistrate Tilda Mazhande and will be back in court in two weeks for their routine remand.\n\nThe two were arrested for allegedly orchestrating a multi-million-rand fraud scheme through forged import documents, prejudicing the Zimbabwe Revenue Authority (ZIMRA) of ZAR 10 755 880.00.\n\nIt is the States case that they allegedly submitted falsified Bills of Entry to Stanbic Bank to acquire foreign currency for purported imports from South African firms, which never materialised. \n\nThe court heard between January 2021 and March 2022, Hilmax Engineering (Pvt) Ltd applied for over ZAR 10.7 million through the Stanbic Bank, claiming to import goods.\n\nThey allegedly used or backdated Bills of Entry assigned to other companies, to justify payments.\n\nAn investigation into the foreign currency acquittals revealed that no goods were imported and the two directors allegedly fabricated release orders to conceal the scheme.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter Hilmax Engineering directors who were arrested on allegations of defrauding the Zimbabwe Revenue Authority (ZIMRA) of ZAR 10.7 million in a foreign scheme appeared in court Wednesday charged with fraud. The two are the operations director, Rugare Murwira (59) and Patrick Musavaya (57) the finance director. They are facing seven counts of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hilmax-engineering-directors-who-defrauded-zimra-of-r10million-out-on-bail/\">Hilmax Engineering directors who defrauded ZIMRA of R10million out on bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "06 Feb 2025"
        }
    ]
}