{
    "news": [
        {
            "title": "Chinese national jailed 18 years for wildlife trafficking in Zimbabwe",
            "url": "https://www.newzimbabwe.com/chinese-national-jailed-18-years-for-wildlife-trafficking-in-zimbabwe/",
            "content": "By James Muonwa\n\nA CHINESE national caught with rhino horns worth over US$240,000 has been sentenced to an effective 18-year jail term.\n\nCong Yanzhong (57) was convicted of unlawfully dealing in wildlife when he appeared at the Harare Magistrates Court for sentencing this Wednesday.\n\nHe was facing two counts of wildlife trafficking.\n\nIt was the States case that on July 16, 2025, police detectives received a tip-off to the effect that a Chinese national was involved in illegal wildlife products.\n\nActing on the information, detectives located and trailed Yanzhong, who was spotted carrying a black satchel and a brown carrier bag, matching the description provided by the informant.\n\nHe was apprehended by detectives from the CID Minerals, Flora and Fauna Unit (MFFU) at his residence in Harare.\n\nDuring the raid, officers discovered three rhinoceros horns shrink-wrapped and concealed within the premises, weighing 7.70 kilogrammes, with an estimated street value of US$240,000.\n\nPolice also found four pieces of raw ivory weighing 36.15 kilogrammes valued at US$6,146.\n\nYanzhong failed to produce any permits authorising possession of the horns.\n\nThe court ruled that he acted unlawfully.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said the harsh sentence sends a strong message that Zimbabwe has zero tolerance for wildlife crimes.\n\nWe will continue to work tirelessly to protect our precious natural heritage and ensure that those who seek to profit from the destruction of our wildlife face the full force of the law, the NPAZ said.\n\nRhino horns are among the most valuable wildlife products on the black market, fuelling poaching in national parks and conservation areas across Southern Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By James Muonwa A CHINESE national caught with rhino horns worth over US$240,000 has been sentenced to an effective 18-year jail term. Cong Yanzhong (57) was convicted of unlawfully dealing in wildlife when he appeared at the Harare Magistrates Court for sentencing this Wednesday. He was facing two counts of wildlife trafficking. It was the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-national-jailed-18-years-for-wildlife-trafficking-in-zimbabwe/\">Chinese national jailed 18 years for wildlife trafficking in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Govt gives unregistered schools until December to regularise or face closure",
            "url": "https://www.newzimbabwe.com/govt-gives-unregistered-schools-until-december-to-regularise-or-face-closure/",
            "content": "By Anna Chibamu\n\nPrimary and Secondary Education Minister Torerayi Moyo says his ministry has given unregistered schools until December 31, 2025, to regularise their operations or risk closure.\n\nResponding to questions in Parliament during a Wednesday Question and Answer session, Moyo said government had extended a four-month grace period for illegal private schools and colleges to comply.\n\nHe explained that authorities were cautious not to disadvantage learners who had already registered for examinations, hence the extension to the end of the year or early 2026.\n\nZanu PF legislator for Mt Pleasant, George Mashavave, had asked whether government had a policy framework to monitor and regularise the mushrooming of unregistered schools and colleges across the country.\n\nMoyo confirmed the existence of such a framework and stressed the need to act carefully.\n\nWe have given illegal schools a grace period of four months because we did not want to close them haphazardly, as this would disadvantage learners and violate their fundamental right to education.\n\nI want to assure this august House that very soon in November, or perhaps early next year, we may extend to January 2026. Come January, however, those schools still operating illegally and failing to regularise will be closed, said Moyo.\n\nThe minister admitted that unregistered schools were mushrooming countrywide but insisted that the ministrys Schools Psychological Services and Special Needs Education (SPPRS) department was responsible for school registration and providing technical advice to prospective investors.\n\nHe said circulars had already been sent out warning directors of illegal schools.\n\nI have made a clarion call to those directors of illegal schools to regularise their operations or face penalties at our disposal. All schools that are not registered are operating illegally. While we have avoided immediate closures to protect learners, the grace period expires on December 31, after which circulars will be enforced, and closures implemented, he added.\n\nMoyo also highlighted the governments progress in addressing the countrys school infrastructure deficit.\n\nAccording to a 2022 survey, Zimbabwe required 3,000 additional schools. Since then, more than 600 have been constructed.\n\nFrom 2022 to date, we have built over 600 schools. This year alone, we are targeting at least 200 more, he said.\n\nHowever, Citizens Coalition for Change (CCC) MP Ellen Shiriyedenga argued that the school deficit could be fuelling the growth of illegal institutions.\n\nWe were told there is a deficit of 3,000 schools. This gap may be the reason for mushrooming schools, as children should not have to walk long distances. How far has the ministry gone in addressing this deficit? she asked.\n\nOther MPs raised concerns about exploitation, quality of education, and adherence to government policy in unregistered institutions.\n\nZanu PF legislator Clemence Chiduwa questioned whether private schools were being monitored to ensure local languages were taught at primary level.\n\nIn response, Moyo said this was precisely why government insisted on registration.\n\nOur policy is clear, schools must regularise so that we can monitor compliance, including adherence to curriculum and language policy. As it stands, we do not know what is happening in many backyards where illegal schools exist. That is why registration is critical, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/13122654/torerai-moyo.jpg",
            "description": "<p>By Anna Chibamu Primary and Secondary Education Minister Torerayi Moyo says his ministry has given unregistered schools until December 31, 2025, to regularise their operations or risk closure. Responding to questions in Parliament during a Wednesday Question and Answer session, Moyo said government had extended a four-month grace period for illegal private schools and colleges</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-gives-unregistered-schools-until-december-to-regularise-or-face-closure/\">Govt gives unregistered schools until December to regularise or face closure</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Young Warriors face Mozambique in COSAFA Cup opener",
            "url": "https://www.newzimbabwe.com/young-warriors-face-mozambique-in-cosafa-cup-opener/",
            "content": "By Sports Reporter\n\nZimbabwe boys under 17 team will kick off its CAF Africa Cup of Nations COSAFA Qualifiers campaign with a clash against Mozambique at Ngoni Stadium in Norton, Thursday afternoon.\n\nWith 12 participants from across Southern Africa battling for honours, the Young Warriors will be hoping to take advantage of playing on home turf as they quest for an Under-17 Africa Cup of Nations qualification.\n\nZimbabwe is in group A together with Mozambique, Comoros and Eswatini, while group B consists of Malawi, South Africa, Madagascar and defending champions Zambia and Group C has Angola, Botswana, Lesotho and Mauritius.\n\nThe tournaments games will be played at Ngoni Stadium, Norton and Heart Stadium, Waterfalls.\n\nSpeaking ahead of Thursdays opener, Zimbabwe team coach Thulani Sibanda expressed confidence in his side.\n\nIm confident with the team that we will do our best and make the nation proud.\n\nFootball is an unpredictable sport, but I think the preparations are according to plan and we are ready, said Sibanda.\n\nZimbabwe will be hoping to win the trophy and end an 18-year jinx; the last time they lifted the Cup was in 2007.\n\nZIMBABWE\n\nLast five tournament finishes:\n\n2019  Did not enter\n\n2020  Disqualified\n\n2021  Did not enter\n\n2022  Did not enter\n\n2024  Semifinals\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/11073444/young-warriors.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe boys under 17 team will kick off its CAF Africa Cup of Nations COSAFA Qualifiers campaign with a clash against Mozambique at Ngoni Stadium in Norton, Thursday afternoon. With 12 participants from across Southern Africa battling for honours, the Young Warriors will be hoping to take advantage of playing on home</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-warriors-face-mozambique-in-cosafa-cup-opener/\">Young Warriors face Mozambique in COSAFA Cup opener</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Charlie Kirk shooting: police search for suspect amid condemnation of ‘targeted’ killing",
            "url": "https://www.newzimbabwe.com/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing/",
            "content": "The Guardian\n\nAuthorities in the US were still searching for a suspect in the shooting of conservative activist Charlie Kirk, hours after the close ally ofDonald Trumpwas killed at a Utah university, sparking condemnation from both sides of politics and grave threats from the president.\n\nThis shooting is still an active investigation, theUtahdepartment of public safety said in a statement, adding it was working with the FBI and local police departments.\n\nTwo suspects were taken into custody, but subsequently released. The Governor of Utah, Spencer Cox, called it a political assassination, despite the motive and identity of the shooter remaining unclear.\n\nBeau Mason, the commissioner of Utahs department of public safety, said investigators were reviewing security camera images of the suspect, who wore dark clothing and possibly fired a longer distance shot from a roof.\n\nIn a video message from the Oval Office, Trump vowed that his administration would track down the suspect.\n\nMy administration will find each and every one of those who contributed to this atrocity and to other political violence, including the organisations that fund it and support it, Trump said.\n\nKirkwas shot while addressing a crowdof an estimated 3,000 people at Utah Valley University in Orem, near Salt Lake City. Video footage posted online showed Kirk being questioned by an audience member about gun violencein the moments before he was shot.\n\nVideo footage shows students scrambling to run from the sound of gunfire. Kirk was transported to a nearby hospital, where he later died, authorities said.\n\nLocal officials said the shooting was believed to be a targeted attack by a shooter from the roof of a building.\n\nHis death prompted outrage from Democrats and Republicans, while the president ordered flags to be lowered to half mast to honour him.\n\nThis is a dark day for our state. Its a tragic day for our nation, Cox, a Republican, said at a press conference, appealing for an end to the political violence.\n\nKirkwas the co-founder of Turning Point USA, the largest conservative youth organisation in the country which, played a key role in driving young voter support for Trump in November.\n\nHis appearances on podcasts and across social media brought him fame and notoriety, as he helped to amplify the presidents agenda. Kirk frequently attacked the mainstream media and engaged with culture-war issues around race, gender and immigration, often in a provocative style.\n\nThe event in Utah on Wednesday was the first in his American Comeback Tour at universities around the country. He often used such events, which typically drew large crowds of students, to invite attendees to debate him live.\n\nExperts have warned his death marks a watershed moment, with fears it could inflame an already fractured country and inspire more unrest.\n\nTrump, who routinely describes political rivals and others who stand in his way as radical left lunatics who pose an existential threat to the nation, decried violent political rhetoric in his statement on Wednesday night.\n\nViolence and murder are the tragic consequences of demonising those you disagree with  For years, those on the radical left have compared wonderful Americans like Charlie to Nazis and the worlds worst mass murderers and criminals, he said.\n\nPromising to crackdown on political violence, the president cited recent incidents including the attempts on his life last year, the killing of United Healthcare CEO Brian Thompson and the 2017 shooting of Republican congressman Steve Scalise.\n\nThe presidents list notably did not include violence against Democrats, such asthe murder of Melissa Hortman, a Minnesota state lawmaker, and her husband, or the attack on former House speakerNancy Pelosis husband.\n\nFormer president Barack Obama condemned political violence as despicable, while sending his prayers to Kirks wife and two young children. Joe Biden said there was no no place in our country for this kind of violence.\n\nHakeem Jeffries, the Democratic House minority leader, expressed a similar sentiment: Political violence of any kind and against any individual is unacceptable and completely incompatible with American values.\n\nOn Capitol Hill, an attempt to observe a moment of silence for Kirk on the floor of the House of Representatives degenerated into shouting and finger-pointing. Republican representative Anna Paulina Luna, who worked as Kirks director of Hispanic engagement at Turning Point USA yelled at Democrats, telling them You caused this!\n\nThat prompted Democratic representative Jahana Hayes, a leader on the gun violence prevention taskforce, to shout: Pass some gun laws!\n\nThe US is undergoing its most sustained period of political violence since the 1970s, according to data compiled by the Reuters news agency, which has documented more than 300 cases of politically motivated violent acts since supporters of Trump attacked the US Capitol on 6 January 6 2021.\n\nIn the first six months of the year, the US experienced about 150 politically motivated attacks, nearly twice as many as over the same period last year, Mike Jensen, a researcher at the University of Maryland, told Reuters.\n\nI think we are in a very, very dangerous spot right now that could quite easily escalate into more widespread civil unrest if we dont get a hold of it, Jensen said. This could absolutely serve as a kind of flashpoint that inspires more of it.\n\nWith Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/11071600/kirk-charlie.jpg",
            "description": "<p>The Guardian Authorities in the US were still searching for a suspect in the shooting of conservative activist Charlie Kirk, hours after the close ally of Donald Trump was killed at a Utah university, sparking condemnation from both sides of politics and grave threats from the president. “This shooting is still an active investigation,” the Utah department of public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing/\">Charlie Kirk shooting: police search for suspect amid condemnation of ‘targeted’ killing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Kaindu named Coach of the Month, Machope shines in players’ category",
            "url": "https://www.newzimbabwe.com/kaindu-named-coach-of-the-month-machope-shines-in-players-category/",
            "content": "By Sports Reporter\n\nDynamos coach Kelvin Kaindu has hit the ground running at Dembare, scooping the Premier Soccer League (PSL) Coach of the Month award for August.\n\nKaindu, who took charge at the end of July, enjoyed an unbeaten run throughout August, guiding Dynamos to both league and cup victories.\n\nThe Zambian gaffer began his tenure with a 1-0 league win over MWOS on August 2, before edging Yadah on penalties in the preliminary round of the Chibuku Super Cup just five days later. Dynamos then produced another strong performance in the first round of the same competition, beating Simba to book a quarter-final spot.\n\nIn league action, Kaindus side went on to defeat ZPC Kariba and Kwekwe, before closing the month with a thrilling 3-2 win against title contenders Scotland FC.\n\nMeanwhile, Scotland FC striker Tymon Machope was named Player of the Month after a sensational run of form that saw him score seven goals in August.\n\nMachopes exploits have pushed him to second place in the Golden Boot race, just one goal shy of Tel Ones Washington Navaya, who leads with 13 goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/12193425/KELVIN-KAINDU-10.gif",
            "description": "<p>By Sports Reporter Dynamos coach Kelvin Kaindu has hit the ground running at Dembare, scooping the Premier Soccer League (PSL) Coach of the Month award for August. Kaindu, who took charge at the end of July, enjoyed an unbeaten run throughout August, guiding Dynamos to both league and cup victories. The Zambian gaffer began his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kaindu-named-coach-of-the-month-machope-shines-in-players-category/\">Kaindu named Coach of the Month, Machope shines in players’ category</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Judge slams lenient sentence for mother caught with 1kg of dagga",
            "url": "https://www.newzimbabwe.com/judge-slams-lenient-sentence-for-mother-caught-with-1kg-of-dagga/",
            "content": "By Mary Taruvinga\n\nA High Court judge has blasted a magistrate for imposing a lenient sentence on a single mother of four caught with almost a kilogram of dagga, ruling that the punishment fell short of real and substantial justice.\n\nJustice Esther Muremba reviewed the case of Christine Chambati (39), who was arrested at Madokero Mall in June with 962.6 grammes of dagga hidden in her satchel. The drugs had an estimated street value of US$96.20.\n\nChambati admitted the charge and was convicted, but the magistrate gave her a suspended jail term and 420 hours of community service, citing her guilty plea, remorse and her status as a mother.\n\nJustice Muremba said the magistrate misapplied the Criminal Procedure (Sentencing Guidelines) Regulations, 2023, which set a presumptive penalty of three years imprisonment for cases involving large quantities of drugs or possession in public spaces.\n\nThe sentence imposed was not only inconsistent with the regulatory framework but also failed to reflect the structured approach intended to promote fairness, proportionality, and consistency in sentencing, Justice Muremba ruled.\n\nMuremba criticised the magistrates view that 962.6g was a small amount, saying precedent showed even 700g warranted prison time. Citing past cases, the judge said: Quantities well below this threshold constitute substantial amounts.\n\nThe judge stressed that being caught at a busy shopping mall aggravated the offence: Possession of dangerous drugs in a public setting attracts the presumptive penalty of three years imprisonment.\n\nWhile confirming Chambatis conviction, Justice Muremba refused to certify the sentence, leaving the door open for a harsher penalty.\n\nLenient sentences such as community service for possession of nearly a kilogram of dagga fall short of the justice systems duty to protect society, she warned.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/19165033/marijuana-mbanje-e1614188096779.jpg",
            "description": "<p>By Mary Taruvinga A High Court judge has blasted a magistrate for imposing a lenient sentence on a single mother of four caught with almost a kilogram of dagga, ruling that the punishment “fell short of real and substantial justice.” Justice Esther Muremba reviewed the case of Christine Chambati (39), who was arrested at Madokero</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-slams-lenient-sentence-for-mother-caught-with-1kg-of-dagga/\">Judge slams lenient sentence for mother caught with 1kg of dagga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "11 Sep 2025"
        }
    ]
}