{
    "news": [
        {
            "title": "Political and religious organisations want justice for Cwecwe",
            "url": "https://www.newzimbabwe.com/political-and-religious-organisations-want-justice-for-cwecwe/",
            "content": "eNCA\n\nSouth Africa  ANC Secretary General Fikile Mbalula has condemned the rape of Cwecwe, at her school in the Eastern Cape.\n\nThe seven-year-old girl was attacked on school premises while waiting for her scholar transport.\n\nThe Polices Head of Family Violence, Child Protection and Sexual Investigations Unit has been deployed to Matatiele to help with Cwecwes case.\n\nSAPS spokesperson Brigadier Athlenda Matheconfirmed this, saying the National Police Department has taken over the investigation.\n\nProtest marches against gender based violence and femicide, took place nationwide.\n\nThe South African Council of Churches in the Eastern Cape, has joined in and condemned the alleged violation of the little girl.\n\nThe country has grappled with pervasive rape and gender based violence for many years,that seems impossible to eliminate once and for all.\n\nIts a problem that has been acknowledged by those in power, but its clear the proposed interventions are not working.\n\nReverend Zukile Makula, chairperson of the South African Council of Churches in the Eastern Cape spoke to eNCA about this sensitive case that has the whole country in uproar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/02103609/Uyinene-Mrwetyana-Foundation-demands-urgent-action-for-Cwecwe-s-case.webp",
            "description": "<p>eNCA South Africa – ANC Secretary General Fikile Mbalula has condemned the rape of Cwecwe, at her school in the Eastern Cape. The seven-year-old girl was attacked on school premises while waiting for her scholar transport. The Police’s Head of Family Violence, Child Protection and Sexual Investigations Unit has been deployed to Matatiele to help</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/political-and-religious-organisations-want-justice-for-cwecwe/\">Political and religious organisations want justice for Cwecwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "Mutsvangwa says recent demotion of army commander meant to weaken Chiwenga – as factionalism threatens to rip Zanu PF apart",
            "url": "https://www.newzimbabwe.com/mutsvangwa-says-recent-demotion-of-army-commander-meant-to-weaken-chiwenga-as-factionalism-threatens-to-rip-zanu-pf-apart/",
            "content": "By Kingston Ndabatei\n\nZANU PF spokesperson Christopher Mutsvangwa has confirmed widely held assumptions that President Emmerson Mnangagwas recent redeployment of army commander Anselem Sanyatwe was meant to neutralise his deputy Constantino Chiwengas influence in the military.\n\nSanyatwe was the Zimbabwe National Army (ZNA) commander before being appointed as Sports Minister, replacing International Olympic Committee (IOC) president-elect Kirsty Coventry in cabinet.\n\nHe was replaced by Lieutenant General Emmanuel Matatu, who is believed to be Mnangagwas homeboy and a close associate of his ally Zimbabwe Defence Forces (ZDF) Commander Valerio Sibanda.\n\nAlthough government communication has insinuated that his was a promotion, power struggles within the ruling party indicate Mnangagwa has considerably weakened his deputy and rival Chiwengas influence in the army.\n\nMutsvangwa, who spoke to journalists on Tuesday, described last weeks announcement that Sanyatwe had been immediately retired, appointed minister and quickly sworn in as dramatic.\n\nHe said that was meant to ensure loyalty as protests that had been announced by war veteran Blessed Geza on March 31 approached.\n\nThe unwritten fear had been that the army would listen to Gezas calls and participate in the ouster of President Emmerson Mnangagwa as is being demanded.\n\nTo make sure that the state apparatus was in safe hands, he (Mnangagwa) made dramatic changes in its (army) structure, said Mutsvangwa.\n\nI want to congratulate the new leaders who were put in place as we approached the 31st of March.\n\nThey have proved their mettle by making sure that they are loyal to the people of Zimbabwe, they defend the interests of the people of Zimbabwe and that they keep the professional traditions of our state apparatus.\n\nMutsvangwa is not only on Mnangagwas side of the fight, but also harbours presidential aspirations.\n\nHe was recently recorded by a UK based investigative publication laying into Chiwenga, calling him daft, unelectable and evil.\n\nAnalysts have pointed to the possibility of another coup as factionalism within the party heats up. Pride Mkono described Mnangagwas appointments as simple coup-proofing.\n\nGeza, widely believed to be under the protection of Chiwenga, has been in hiding for over three weeks and riling up the masses through social media to rise up and depose Mnangagwa even before he finishes his second term.\n\nThe argument being put forward by Geza is that Mnangagwa has been corrupted by elements he keeps around him. The outspoken former Central Committee member in Zanu PF who has been publishing videos periodically, is campaigning for Chiwenga to take over power.\n\nMondays protest turned into a stay away, after people excused themselves from the fight and chose to watch and follow online. Only about 98 were arrested for participating in a gathering with the intent to promote violence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>By Kingston Ndabatei ZANU PF spokesperson Christopher Mutsvangwa has confirmed widely held assumptions that President Emmerson Mnangagwa’s recent ‘redeployment’ of army commander Anselem Sanyatwe was meant to neutralise his deputy Constantino Chiwenga’s influence in the military. Sanyatwe was the Zimbabwe National Army (ZNA) commander before being appointed as Sports Minister, replacing International Olympic Committee (IOC)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutsvangwa-says-recent-demotion-of-army-commander-meant-to-weaken-chiwenga-as-factionalism-threatens-to-rip-zanu-pf-apart/\">Mutsvangwa says recent demotion of army commander meant to weaken Chiwenga – as factionalism threatens to rip Zanu PF apart</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "Former City of Harare bosses up for US$465,000 fraud in failed Mbare bio-digester project",
            "url": "https://www.newzimbabwe.com/former-city-of-harare-bosses-up-for-us465000-fraud-in-failed-mbare-bio-digester-project/",
            "content": "By James Muonwa\n\nTWO former top officials at City of Harare (CoH) have been dragged to court for allegedly awarding a US$465,290 tender to an undeserving company.\n\nThe contract was for the establishment of a biodigester in Mbare, Harare after the municipality secured 350,000 from the European Union (EU)\n\nAccused persons, former Director of Works Phillip Mabingo Pfukwa (75) and ex-Chamber Secretary Josephine Ncube (62) appeared at the Harare Regional Anti-Corruption Magistrates Court.\n\nThe court heard that sometime in 2013, CoH got a grant from the EU for the design and construction of biogas digesters and the installation of a 100KVA biogas generator for the Mbare Biogas Project.\n\nThe procurement process, which was expected to be transparent, was overseen by the Town Clerk and the procurement committee.\n\nHowever, in March 2015 after receiving four bids, then Director of Works and Chamber Secretary by-passed procurement procedures and unlawfully awarded the tender to Synlak (Private) Limited, a company owned by Moses Mpofu. This was despite that the applicant failed to meet standard requirements.\n\nPfukwa and Ncube are also accused of falsifying internal memos and misrepresenting Synlaks eligibility, thereby ensuring the undeserving firm won the contract.\n\nState further alleges that in December 2015, Ncube fraudulently signed off the contract, allowing Synlak (Pvt) Ltd to receive full payment of US$465,290 despite the company failing to deliver on the project.\n\nThe duo was remanded to May 14 pending indictment at the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25025158/Harare-Town-House.png",
            "description": "<p>By James Muonwa TWO former top officials at City of Harare (CoH) have been dragged to court for allegedly awarding a US$465,290 tender to an undeserving company. The contract was for the establishment of a biodigester in Mbare, Harare after the municipality secured €350,000 from the European Union (EU) Accused persons, former Director of Works</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-city-of-harare-bosses-up-for-us465000-fraud-in-failed-mbare-bio-digester-project/\">Former City of Harare bosses up for US$465,000 fraud in failed Mbare bio-digester project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "ZEC appoints new Chief Elections Officer",
            "url": "https://www.newzimbabwe.com/zec-appoints-new-chief-elections-officer/",
            "content": "By James Muonwa\n\nTHE Zimbabwe Electoral Commission (ZEC) has appointed Simbarashe Tongayi as the new substantive Chief Elections Officer.\n\nTongayi replaces Utoile Silaigwana, who was retired last year and appointed Commissioner in the Zimbabwe Prisons and Correctional Service (ZPCS) Commission.\n\nZEC announced the latest development at the elections management body in a statement on Tuesday.\n\nThe Zimbabwe Electoral Commission (ZEC) is pleased to announce the appointment of Mr Simbarashe Tongayi as its new substantive Chief Elections Officer (CEO) with effect from 1 April 2025.\n\nMr Tongayi has been the ZEC Acting CEO since December 2024. He also served as the Deputy CEO responsible for Administration, where he played a pivotal role in streamlining administrative processes and enhancing organisational efficiency, ZEC said.\n\nTongayi is a seasoned public administration and election management expert with experience in both regional and international elections.\n\nHis wealth of experience positions him to lead ZEC in achieving its long-term goals.\n\nBefore joining the Commission, Mr Tongayi was the General Manager Human Resources and Administration for the National Peace and Reconciliation Commission (NPRC). He spent over a decade within the Public Service Commission (PSC) secretariat, where he served as a Deputy Manager and District Human Resources Manager, further reads the statement.\n\nTongayi is a final year Doctorate student in Strategic Management with the Chinhoyi University of Technology. He is a holder of a Masters Degree in Human Resources as well as another Masters Degree in Peace, Leadership and Conflict Resolution. He recently completed a Masters of Science Degree in Defence and Security Studies.\n\nHe is also a holder of a Bachelor of Science Degree in Social Work as well as being a Building Resources in Democracy, Governance and Elections (BRIDGE) accredited facilitator.\n\nZEC is excited to embark on this new phase under Mr Tongayis leadership and is confident in his ability to lead the organization to new heights.\n\nThe Chairperson, Deputy Chairperson, Commissioners and the whole Secretariat congratulate Mr Tongayi on his new appointment, said the electoral body.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/02052426/simba-tongayi.jpeg",
            "description": "<p>By James Muonwa THE Zimbabwe Electoral Commission (ZEC) has appointed Simbarashe Tongayi as the new substantive Chief Elections Officer. Tongayi replaces Utoile Silaigwana, who was retired last year and appointed Commissioner in the Zimbabwe Prisons and Correctional Service (ZPCS) Commission. ZEC announced the latest development at the elections management body in a statement on Tuesday.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zec-appoints-new-chief-elections-officer/\">ZEC appoints new Chief Elections Officer </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "Zim Diaspora Property Showcase: Seeff Properties floats lucrative deals for diasporans in US, Canada",
            "url": "https://www.newzimbabwe.com/seeff-properties-floats-lucrative-deals-for-diasporans-in-us-canada/",
            "content": "By Alois Vinga\n\nSeeff Properties says Zimbabweans in the United States and Canada must take advantage of lucrative property management products and other services, easing burdensome responsibilities on their part.\n\nSpeaking ahead of the Zim Diaspora Property Showcase scheduled to take place at The Westin Hotel, Dallas Fort Worth, Texas, USA, from the 25thto the 27thof April 2025, Seeff Properties Managing Director, Patience Patongamwoyo encouraged the diaspora community to seize the available opportunities.\n\nWe offer property management services which involve agency management of rental properties on behalf of landlords, whether they are present or absent. This includes: placing suitable tenants, collecting rent, and overseeing repairs and maintenance.\n\nWe represent the landlords interests while adhering to Zimbabwean law. Essentially, we handle all aspects of property administration, providing peace of mind to landlords, she said.\n\nPatongamwoyo said over and above the services, Seeff Properties specializes in property management, purchases and sales, valuations, Real Estate Advisory, property development and project management.\n\nSeeff Properties has a traceable reputation of acting as a reliable partner and addressing the challenges diasporans face in managing their property affairsback home.\n\nAs a real estate agency, we connect buyers with sellers. Many of our listed developments offer flexible payment terms. We guide buyers through the available options, helping them find arrangements that align with their financial situations.\n\nWe understand the importance of your investments back home. Trust Seeff Properties to be your reliable partner, ensuring your property goals are achieved with professionalism and integrity. We are looking forward to the Zim Diaspora Property showcase, and to meeting you, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23073043/SEEFFUK-24143of205-scaled.jpg",
            "description": "<p>By Alois Vinga Seeff Properties says Zimbabweans in the United States and Canada must take advantage of lucrative property management products and other services, easing burdensome responsibilities on their part. Speaking ahead of the Zim Diaspora Property Showcase scheduled to take place at The Westin Hotel, Dallas Fort Worth, Texas, USA, from the 25th to the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seeff-properties-floats-lucrative-deals-for-diasporans-in-us-canada/\">Zim Diaspora Property Showcase: Seeff Properties floats lucrative deals for diasporans in US, Canada</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "UN Rights experts slam Zimbabwe’s prolonged pretrial detentions; judicial interference",
            "url": "https://www.newzimbabwe.com/un-rights-experts-slam-zimbabwes-prolonged-pretrial-detentions-judicial-interference/",
            "content": "By Alois Vinga\n\nTHE United Nations (UN) Human Rights Committee has urged authorities to align pretrial detentions with international best practices, an end to judicial interference, among other rights-related recommendations.\n\nIn a report published Tuesday, the Committee on Civil and Political Rights (CCPR), also known as the UN Human Rights Committee, established a number of gaps after analyzing progress made by Zimbabwe in the implementation of the International Covenant on Civil and Political Rights (ICCPR) by its State Parties.\n\nThe recommendations coincide with a series of complaints raised by a number of arrested rights activists who believe they were placed in unfair pretrial detentions.\n\nThere is a need to ensure that pretrial detention is reviewed in a prompt, thorough and impartial manner by the relevant judicial authorities, including through the effective implementation of the right to habeas corpus, and that anyone detained arbitrarily is released without conditions and is adequately compensated, the report reads.\n\nThe Committee expressed concerns about reports of threats, intimidation, and dismissal of judges who issue rulings that are unfavorable to the government. It raised concerns about the persistent shortage of judges, which contributes to significant delays in the administration of justice, particularly in high-profile cases related to human rights violations and corruption.\n\nThe State Party must take immediate steps to prevent and eradicate all threats, intimidations and other forms of undue influence on the judiciary by the executive branches of government and to ensure in law and in practice the full independence and impartiality of judges, including by adopting procedures for the selection, appointment, promotion, sanction and removal of judges that are transparent and impartial, the report added.\n\nWhile commending the measures taken by the State party to enhance judicial efficiency and reduce case backlogs through the rollout of the Integrated Electronic Case Management System and the decentralisation of the High Court, the Committee noted the barriers to accessing this system due to low smartphone and internet coverage, high data costs and digital literacy gaps, particularly in rural communities.\n\nThe report also challenged the Statepartyto elucidate all cases of enforced disappearances and conduct impartial and thorough investigations without delay, ensuring that the victims and their relatives are informed of the progress and results of the investigation.\n\nIt called for the identification of those responsible and ensuring that they are prosecuted and, if convicted, punished with appropriate penalties that are commensurate with the gravity of their crimes and that victims of enforced disappearance and their families are provided with full reparation.\n\nThe experts said the government should allocate sufficient human and financial resources to the Zimbabwe Human Rights Commission to enable it to discharge its mandate effectively and independently, including plans to enhance its field presence in full compliance with the principles relating to the status of national institutions for the promotion and protection of human rights (the Paris Principles).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/25092442/prisoners-.png",
            "description": "<p>By Alois Vinga THE United Nations (UN) Human Rights Committee has urged authorities to align pretrial detentions with international best practices, an end to judicial interference, among other rights-related recommendations. In a report published Tuesday, the Committee on Civil and Political Rights (CCPR), also known as the UN Human Rights Committee, established a number of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-rights-experts-slam-zimbabwes-prolonged-pretrial-detentions-judicial-interference/\">UN Rights experts slam Zimbabwe’s prolonged pretrial detentions; judicial interference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "Mnangagwa grooming Tagwirei for Presidency – Geza",
            "url": "https://www.newzimbabwe.com/mnangagwa-grooming-tagwirei-for-presidency-geza/",
            "content": "By Darlington Gatsi\n\nAFTER being recommended for a Central Committee post by ZANU PFs Harare Province, war veteran Blessed Geza has claimed that Kudakwashe Tagwirei is being clandestinely groomed to take over the presidency by President Emmerson Mnangagwa, thwarting his deputy Constantino Chiwengas leadership ambitions.\n\nTagwirei is manoeuvring into the structures of the ruling party after his name was put forward by the provincial leadership to assume a role in the Central Committee, one of the partys most powerful organs.\n\nHowever, the move has not gone down well with the militant Geza, who has lashed out at Tagwirei.\n\nThe last time I mentioned that you (Tagwirei) have monopolised government contracts. We know all about this corruption.\n\nWhere you are now goinginto politicsdo not undermine me. You are conniving with Mnangagwa to become president  now you want to lead the country through the back door, said Geza.\n\nZANU PF is at loggerheads, with one faction pushing for Mnangagwa to retain the presidency beyond 2030, while another supports Chiwenga to succeed the octogenarian leader.\n\nTagwirei has been accused of benefiting from his close ties to Mnangagwa through lucrative government contracts.\n\nHe secured a multimillion-dollar deal to construct the Mbudzi Interchange flyover and has expanded his business empire into mining while maintaining a near-monopoly in the fuel sector.\n\nAdditionally, Tagwirei has been leading the Command Agriculture programme and currently chairs the Land Tenure Implementation Committee.\n\nGeza accused Tagwirei of seeking to reverse the land reform programme.\n\nWhere have you ever seen a genuine programme being overseen by two banks? This issue of trying to reverse the land reform programmeleave it, added Geza.\n\nEfforts to get a comment from Tagwirei were futile as he had not responded to questions sent to him by the time of publishing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Darlington Gatsi AFTER being recommended for a Central Committee post by ZANU PF’s Harare Province, war veteran Blessed Geza has claimed that Kudakwashe Tagwirei is being clandestinely groomed to take over the presidency by President Emmerson Mnangagwa, thwarting his deputy Constantino Chiwenga’s leadership ambitions. Tagwirei is manoeuvring into the structures of the ruling party</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-grooming-tagwirei-for-presidency-geza/\">Mnangagwa grooming Tagwirei for Presidency – Geza </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "Mnangagwa’s regime panics – forces police officers to sign loyalty forms",
            "url": "https://www.newzimbabwe.com/mnangagwas-regime-panics-forces-police-officers-to-sign-loyalty-forms/",
            "content": "By Kingston Ndabatei\n\nZIMBABWE Republic Police (ZRP) officers have been forced to sign loyalty forms that declare that they will not go against any order given by Commissioner General Stephen Mutamba, NewZimbabwe.com has learnt.\n\nThe forms, one of which was seen by NewZimbabwe.com, were being circulated across police stations and posts across the country before and after Mondays stay away.\n\nPresented as an Oath of Service, the form follows a US$50 unexplained allowance to all ZRP officers, which was deposited days before war veteran Blessed Gezas March 31stdemonstration.\n\nI will faithfully, truly and to the best of my judgment, skill and ability, execute and perform the duties required of me as a member of the ZRP, reads part of the oath.\n\nI will not, without due authority, disclose or make known any matter that comes to my knowledge by reason of such employment.\n\nOn Monday, police officers patrolled virtually empty streets in most of Zimbabwes towns as citizens chose to stay away from a demonstration organised by war veterans protesting President Emmerson Mnangagwas proposed illegal stay in power till 2030.\n\nAdds the oath of service: As a police officer, I shall be deemed to be available for duty at all times and may at any time be assigned by the Commissioner General of Police to any post, department, section or station within any part of Zimbabwe to perform any function conferred upon or assigned to me.\n\nPolitical Analyst Pride Mkono said these forms were not a surprise as Mnangagwas regime was fast realising that its exit was now closer.\n\nThis is part of a cocktail of strategies employed by authoritarian regimes. In Zimbabwe, they come ahead of possible uprising given how unpopular the Zanu PF regime has become, said Mkono.\n\nYou will probably see a lot of other deployments in other state security agencies. This is not shocking; Mnangagwa knows that his exit is closer.\n\nIt is a sign that his regime is panicking. This regime consolidation is coming at a time when factionalism has ripped apart the ruling party.\n\nGeza had, in publicly shared addresses, called on state security agents to stand with the people in unseating Mnangagwa, who wants to stay in power beyond his constitutionally mandated two terms.\n\nHe promised better working conditions and improved wages, comparing his promises to the US$50 allowance given to the officers.\n\nDespite his promises, truckloads of button-stick-wielding anti-riot officers could be seen crisscrossing Harare, Masvingo and Bulawayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/14031149/Riot-Police.png",
            "description": "<p>By Kingston Ndabatei ZIMBABWE Republic Police (ZRP) officers have been forced to sign loyalty forms that declare that they will not go against any order given by Commissioner General Stephen Mutamba, NewZimbabwe.com has learnt. The forms, one of which was seen by NewZimbabwe.com, were being circulated across police stations and posts across the country before</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-regime-panics-forces-police-officers-to-sign-loyalty-forms/\">Mnangagwa’s regime panics – forces police officers to sign loyalty forms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "South Africa’s wrestling match with Trump",
            "url": "https://www.newzimbabwe.com/south-africas-wrestling-match-with-trump/",
            "content": "By Adekeye Adebajo\n\nPRETORIA  The Irish playwright George Bernard Shaw is often credited with saying, I learned long ago never to wrestle with a pig. You get dirty, and besides, the pig likes it. Such is South Africas dilemma in dealing with US President Donald Trumps bombastic administration.\n\nA struggle of some kind cannot be avoided, because Trump already threw down the gauntlet (probably at the urging of Elon Musk, a South African migr) when he offered white South African farmers refuge in the United States, falsely claiming that they are being persecuted. His administration then topped that off by ending all US aid to South Africa and expelling South Africas ambassador, Ebrahim Rasool, for suggesting that Trump had tapped into a supremacist instinct.\n\nWhile these moves ought to have been enough to freeze bilateral relations, the two governments will be interacting regularly, because South Africa is due to hand over the rotating G20 presidency to the US in November. That process will not be easy. Trump has already taken a wrecking ball to multilateral institutions and the broader international order, having withdrawn the US from the World Health Organization and the Paris climate agreement, gutted USAID, and sought to undermine the sovereignty of Canada, Denmark, and Panama  all longstanding US allies. The Trump administrations refusal to send its Secretary of State and Treasury secretary to the G20 meetings in Johannesburg and Cape Town last month suggests that much turbulence lies ahead.\n\nSouth Africa has four key priorities for its G20 presidency: strengthening global disaster resilience and response; ensuring debt sustainability; mobilizing funding for a just energy transition; and using critical minerals for sustainable development and inclusive growth. It has also pushed the G20s 23 working groups to stick to technical issues, while leaving political matters  such as the wars in Ukraine and Gaza  to the sherpas, foreign ministers, and heads of state. And there are a variety of G20 task forces focusing on inclusive economic growth, industrialization, employment, inequality, food security, AI, data governance, and innovation for sustainable development.\n\nAt the G20 foreign ministers meeting in Johannesburg on February 20-21, South Africas Minister of International Relations and Cooperation, Ronald Lamola, outlined his governments full agenda for the group. He pushed for accelerated implementation of the United Nations Sustainable Development Goals (SDGs). He bemoaned the rise of supply-chain disruptions, trade restrictions, unilateral sanctions, and economic coercion. And he warned that political divisions are creating a global climate of distrust.\n\nLamola then called for renewed efforts to address the high debt burdens across the Global South, and urged the G20 to focus on conflict prevention and peacebuilding, climate change, pandemic prevention, nuclear nonproliferation, development financing, and reforms to global governance institutions. He then concluded by promising a report evaluating the first full cycle of G20 presidencies by November 2025. The G20 finance meeting, held shortly thereafter, covered similar issues.\n\nThe US, now controlled by a personality cult that rejects the very principle of multilateralism, has played a spoiler role within the G20 since late January. It is almost as if Trump has exported his domestic war on wokeness to the international stage. One obvious reason for boycotting the recent ministerial meetings, for example, was to punish South Africa for bringing a genocide case against Israel at the International Court of Justice.\n\nMeanwhile, lower-level American officials who do attend international meetings dutifully repeat their dear leaders words. The US was the only country to oppose a recent UN General Assembly resolution reaffirming the right of everyone to an education; and, within the G20, it has opposed commonsense clean-energy proposals  reflecting Trumps insistence that climate change is a hoax.\n\nRather than support South Africas theme of solidarity, equality, and sustainability, Trump has embraced unilateralism, inequality, and nationalism. In obstructing the G20s agenda, his administration has occasionally been joined by Italys right-wing government and Argentinas anarcho-capitalist regime. This terrible triplet sees issues such as gender equality, clean energy, and the SDGs as somehow threatening their own sovereignty. They are the reason why the G20 failed to issue the traditional diplomatic communiqus following the recent ministerial meetings. Instead, the South African chair released non-binding short summaries that sought to capture the key outcomes of both meetings.\n\nFortunately, the European Union has provided consistently strong support for the South African G20 presidency. At a summit this month, the EU pledged to invest $5.1 billion (in grants and loans) in South Africa, which many saw as a move to replace the aid that Trump recently cut. The EU has also offered its support for the African Unions Agenda 2063, the G20 Compact with African economies, the SDGs, UN Security Council reform, development financing, World Trade Organization reform, and climate action.\n\nBut many EU countries are also cutting development aid to Africa  albeit in a quieter fashion than the Trump administration has done. Across the Global South, many fear that those pushing a vision of Fortress Europe  anti-migration policies, agricultural protectionism, and draconian trade policies toward Africa  are gaining momentum.\n\nBy contrast, South Africa continues to receive much support from other governments across Africa and the rest of the Global South. Brazilian President Luiz Incio Lula da Silva, for example, has emerged as an especially strong ally.\n\nSouth Africas indefatigable, overstretched diplomats arrived in New York last week (March 24-30) to outline their priorities at the UN General Assembly and try to mend fences with a surly US administration. Though South African President Cyril Ramaphosas government has laid a solid foundation for future progress despite US-led disruptions, the next round of negotiations at the Johannesburg G20 summit in November will be immensely challenging. Trump, who once described Africa as a continent of shithole countries, is not expected to attend.\n\nAdekeye Adebajo, a professor and a senior research fellow at the University of Pretorias Centre for the Advancement of Scholarship in South Africa, served on UN missions in South Africa, Western Sahara, and Iraq. He is the author of Global Africa: Profiles in Courage, Creativity, and Cruelty (Routledge, 2024) and The Eagle and the Springbok: Essays on Nigeria and South Africa (Routledge, 2023).\n\nCopyright: Project Syndicate, 2025. www.project-syndicate.org.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/01203707/ramaphosa-trump.png",
            "description": "<p>By Adekeye Adebajo PRETORIA – The Irish playwright George Bernard Shaw is often credited with saying, “I learned long ago never to wrestle with a pig. You get dirty, and besides, the pig likes it.” Such is South Africa’s dilemma in dealing with US President Donald Trump’s bombastic administration. A struggle of some kind cannot</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-wrestling-match-with-trump/\">South Africa’s wrestling match with Trump</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        },
        {
            "title": "Zambia president orders ministers to stop sleeping in cabinet",
            "url": "https://www.newzimbabwe.com/zambia-president-orders-ministers-to-stop-sleeping-in-cabinet/",
            "content": "BBC\n\nZambian President Hakainde Hichilema has warned ministers against dozing off during meetings, attributing their lack of attentiveness to indulgence and an absence of self-control.\n\nIn cabinet somebodys sleeping at 10 hours  the question is where were they if you can start conking there? To me that is a crime, a serous crime,Hichilema said during a swearing-in ceremonyfor a new minister.\n\nHe did not spell out what exactly he meant by indulgence but local media have interpreted this as referring to excessive alcohol drinking and late-night partying.\n\nThe president warned that such behaviour risked exposing state secrets and delayed service delivery to the public.\n\nHichilema won a landslide victory in 2021 with ambitious plans to turn around the economy of Africas second largest copper producer.\n\nSince assuming office, he has sacked several senior officials including ministers over performance issues.\n\nSpeaking on Monday as he welcomed newly appointed Local Government Minister Gift Sialubalo, the president said he has now gone public with his concerns about cabinet members after saying it in private over and over.\n\nWithout naming anyone, he said that some ministers develop a knack of revealing confidential state information on social media especially during happy hours.\n\nI have advised cabinet that we must have a self-censure. When youre in public office you must have self-control, not to over-indulge, the president added.\n\nCiting the Bible, he warned such behaviour could lead to self-destruction.\n\nSo how do you participate in a meeting when you are sleeping? The message is very clear: you are not interested in cabinet deliberations on behalf of Zambians. So why are you sitting there? he asked.\n\nThe president is expected to seek a second term in next years general election. He could face stiff competition from his predecessor, Edgar Lungu, who has mounted a political come back but is currently barred from running.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/30203305/licensed-image-3.jpeg",
            "description": "<p>BBC Zambian President Hakainde Hichilema has warned ministers against dozing off during meetings, attributing their lack of attentiveness to “indulgence” and an absence of self-control. “In cabinet somebody’s sleeping at 10 hours – the question is where were they… if you can start conking there? To me that is a crime, a serous crime,” Hichilema said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambia-president-orders-ministers-to-stop-sleeping-in-cabinet/\">Zambia president orders ministers to stop sleeping in cabinet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "02 Apr 2025"
        }
    ]
}