{
    "news": [
        {
            "title": "Kwaito star Doc Shebeleza passes away at the age of 51",
            "url": "https://www.newzimbabwe.com/kwaito-star-doc-shebeleza-passes-away-at-the-age-of-51/",
            "content": "By SABC\n\nSOUTH Africas music industry is mourning the death of another music star. Kwaito music star Victor Bogopane, popularly known as Doc Shebeleza has passed away.\n\nThe Ebumnandini and Gets Getsa hitmaker died at his home in Fairlands, north of Johannesburg, on Thursday morning.\n\nHe was 51.\n\nDoc Shebeleza was admitted to hospital and underwent surgery in December.\n\nHis death comes just days after the death of musician and actor Winnie Khumalo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09151550/e506839a3c374c3b9122c6e702f12b6f.jpg",
            "description": "<p>By SABC SOUTH Africa’s music industry is mourning the death of another music star. Kwaito music star Victor Bogopane, popularly known as Doc Shebeleza has passed away. The “Ebumnandini” and “Gets Getsa” hitmaker died at his home in Fairlands, north of Johannesburg, on Thursday morning. He was 51. Doc Shebeleza was admitted to hospital and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwaito-star-doc-shebeleza-passes-away-at-the-age-of-51/\">Kwaito star Doc Shebeleza passes away at the age of 51</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Opposition CCC camp suspends self-styled secretary-general Tshabangu as factional fight rages",
            "url": "https://www.newzimbabwe.com/opposition-ccc-camp-suspends-self-styled-secretary-general-tshabangu-as-factional-fight-rages/",
            "content": "By Staff Reporter\n\nOPPOSITION Citizens Coalition for Changes (CCC) all-too-powerful secretary general, Sengezo Tshabangu has been suspended from the party.\n\nThe latest development follows a fallout between Tshabangu and acting president Welshman Ncube opening another chapter of the partys ongoing factional fights.\n\nIn a statement, the CCC aligned to Ncube announced Tshabangus suspension.\n\nActing in terms of Article 9.1.2.3 of the CCC Constitution the Acting President Prof Welshman Ncube has suspended Sengezo Tshabangu with immediate effect, said presidential spokesperson Kurauone Chihwayi.\n\nThis decision was made in light of Tshabangus actions, which were deemed to be in contravention of the partys constitution.\n\nTshabangus suspension is pending a disciplinary hearing, which will be conducted in accordance with the partys internal processes.\n\nHaving been catapulted to prominence after initiating a round of parliamentary and council recalls soon after the August 2023 general elections, Tshabangu stands accused acting in contravention of the partys Constitution.\n\nThe recalls, which were unsuccessfully challenged in court by then party leader Nelson Chamisa, dismantled what was then the strongest opposition to the ruling Zanu PF party.\n\nDespite having been its founder, Chamisa eventually resigned, leaving the party in the hands of Tshabangu, Ncube, Tendai Biti and Harare Mayor Jacob Mafume. Biti was to be forced out.\n\nTimba now leads another distinct CCC faction reportedly loyal to Chamisa.\n\nThis time, Tshabangu stands accused of unilaterally and illegally making appointments to the partys local government caucus and other committees.\n\nOn Thursday last week he appointed Mafume head of the partys local government caucus and named other councillors as officials in a move dismissed by another faction of CCC represented by its spokesperson Willias Madzimure.\n\nThe battle for control of the party between Tshabangu and Ncube has been ongoing since the two reportedly connived to push out other senior members.\n\nTshabangu is also accused of failing to account for government-allocated political party funds released to the opposition formation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Staff Reporter OPPOSITION Citizens Coalition for Change’s (CCC) all-too-powerful secretary general, Sengezo Tshabangu has been suspended from the party. The latest development follows a fallout between Tshabangu and acting president Welshman Ncube opening another chapter of the party’s ongoing factional fights. In a statement, the CCC aligned to Ncube announced Tshabangu’s suspension. “Acting in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-ccc-camp-suspends-self-styled-secretary-general-tshabangu-as-factional-fight-rages/\">Opposition CCC camp suspends self-styled secretary-general Tshabangu as factional fight rages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Mbuyiseni Ndlozi resigns as EFF Member of Parliament",
            "url": "https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-as-eff-member-of-parliament/",
            "content": "By News24\n\nPOPULAR Economic Freedom Fighters (EFF) legislator and the partys former national spokesperson, Mbuyiseni Ndlozi, has resigned from Parliament.\n\nThe party announced his resignation on Thursday.\n\nThe Economic Freedom Fighters (EFF) has received the voluntary resignations of fighter Yazini Tetyana and fighter Dr Mbuyiseni Ndlozi as representatives of the EFF in the Parliament of South Africa, read a press statement.\n\nThe voluntary requests to be released from deployment, which were sent to the secretary-general of the EFF (Marshall Dlamini) consecutively and within days of each other, expressed gratitude to the EFF for the opportunity to serve the organisation and the people of South Africa.\n\nThe EFF said it accepted the requests to be released from deployment, adding that they had diligently served the organisation in their respective deployments since the EFF has had representation in the legislative sphere.\n\nNdlozi has served in the National Assembly since 2014.\n\nHe skipped the partys third elective congress which was held in Johannesburg in December, following reports of a fallout with party leader Julius Malema and questions about his future in the party.\n\nTetyana was EFF leader in the Eastern Cape and also served as a member of the Eastern Cape legislature before joining national Parliament.\n\nThey have both been exemplary in their deployments and acted as commendable public representatives, the EFF said as it wished them well in their future endeavours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09110456/220895a3eaa34f428f68223bcc13bdad.jpg",
            "description": "<p>By News24 POPULAR Economic Freedom Fighters (EFF) legislator and the party’s former national spokesperson, Mbuyiseni Ndlozi, has resigned from Parliament. The party announced his resignation on Thursday. “The Economic Freedom Fighters (EFF) has received the voluntary resignations of fighter Yazini Tetyana and fighter Dr Mbuyiseni Ndlozi as representatives of the EFF in the Parliament of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mbuyiseni-ndlozi-resigns-as-eff-member-of-parliament/\">Mbuyiseni Ndlozi resigns as EFF Member of Parliament </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Mozambique opposition leader returns from exile as police fire tear gas at his supporters",
            "url": "https://www.newzimbabwe.com/mozambique-opposition-leader-returns-from-exile-as-police-fire-tear-gas-at-his-supporters/",
            "content": "By Agencies\n\nMOZAMBIQUES main opposition leader, Venancio Mondlane returned from exile Thursday as security forces fired tear gas at hundreds of his supporters, who gathered near the main international airport to welcome him home.\n\nHe was seen walking off a plane at Mavalane International Airport in the capital, Maputo. He had left the country in October following a disputed election that has sparked months of violent protests and thrown the country into turmoil.\n\nEmerging from the airport with a Bible in hand, Mondlane prayed and took an oath, mimicking a presidential swearing-in ceremony. He declared himself the legitimately elected president, rejecting the official results that favored Frelimos candidate, Daniel Chapo, who is set to be inaugurated on Wednesday, January 15.\n\nMondlane stated that he is ready for dialogue with the government. He says his return is to stop the killings of his supporters and lead protests.\n\nSince October, hundreds of people have reportedly been killed, many shot by police, during protests sparked by allegations of electoral fraud.\n\nMondlane said he left Mozambique fearing for his life after two senior members of his opposition party were killed in their car by unknown gunmen in a late-night shooting in the aftermath of the election.\n\nPolice on Thursday blocked roads leading to the airport after Mondlane said on social media earlier this week he would return to the southern African country. Tear gas drifted over the airport and surrounding roads and a helicopter hovered overhead.\n\nThousands of Mondlanes supporters were expected to gather in Maputo for his return, prompting the clampdown by security forces.\n\nMore than 100 people have been killed by security forces since Mozambique erupted in protests that Mondlane called for after the long-ruling Frelimo party was declared the winner of the Oct. 9 election.\n\nMondlane and other opposition candidates accused the ruling party of rigging the election and international observers reported irregularities in the vote and the alteration of some results.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09090456/download-1-1.webp",
            "description": "<p>By Agencies  MOZAMBIQUE’S main opposition leader, Venancio Mondlane returned from exile Thursday as security forces fired tear gas at hundreds of his supporters, who gathered near the main international airport to welcome him home. He was seen walking off a plane at Mavalane International Airport in the capital, Maputo. He had left the country in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambique-opposition-leader-returns-from-exile-as-police-fire-tear-gas-at-his-supporters/\">Mozambique opposition leader returns from exile as police fire tear gas at his supporters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Chinese-owned gold mine stirs controversy in eastern Zimbabwe",
            "url": "https://www.newzimbabwe.com/chinese-owned-gold-mine-stirs-controversy-in-eastern-zimbabwe/",
            "content": "By VOA\n\nGOVERNMENT officials in Zimbabwe have been scrutinizing a Chinese mining company that has been operating a gold mine in the countrys east since at least 2021.\n\nThe scrutiny comes as residents voice concern about the impact on health and the environment.\n\nThe company in question is Sino Africa Huijin Holdings, which faces accusations of severe environmental destruction and community harm.\n\nIts gold prospecting operations have been taking place in an area known as Premier Estate in the Mutasa District of Manicaland.\n\nVillagers and community groups have complained about the blasting that has taken place at the mine. Nearby residents have reported widespread ecological damage, including the decimation of a mountain and the displacement of wildlife. They also say tremors from the blasts have caused structural damage to homes.\n\nResidents further complain of dust pollution and the potential contamination of water sources due to alleged leaching of cyanide. Cyanide leaching is a method of extracting gold from ore that can pollute water resources.\n\nAdding to these concerns, Sino Africa is accused of forging community signatures on their Environmental Impact Assessment document, raising questions about the transparency and legitimacy of their operations.\n\nThe complaints prompted the government to shut down the mines operations twice in 2024. In the past two months, however, mining has resumed.\n\nWe are between a rock and a hard place. If its possible, let them compensate us and relocate us because its no longer appealing, Ishewedenga Moyo, one of 30 residents living within some 300 meters of the Sino Africa Huijin mine, told VOA in December.\n\nThe vibrations and noise generated by mining blasting are disrupting wildlife habitats and ecosystems, damaging biodiversity, and causing cracks in our homes, Moyo added.\n\nGovernment-ordered suspensions\n\nA Manicaland Joint Command Task Force, composed of a number of government entities, ordered the temporary closure of Sino Africa Huijins gold mining operations twice. Officials say the shutdowns were enforced to ensure the mine met all necessary requirements.\n\nThe first suspension occurred in October and lasted two weeks. Sino Africa Huijin made pledges to improve the situation and was allowed to resume operations. Then, the task force ordered the mine to close a second time in mid-November.\n\nTraditional Chief James Kurauone of the Mutasa district told VOA on Dec. 11 that officials forced Sino Africa Huijings operations to stop each time because the company failed to address critical concerns raised by the local community.\n\nThese concerns that led to the temporary closure included severe air pollution, destructive blasting activities impacting local homes, and the companys failure to fulfill its corporate social responsibility obligations, said Mutasa in recent comments.\n\nMutasa added that he plans to convene a meeting with mining officials and members from the community to discuss a path forward in a couple of weeks.\n\nMining compliance\n\nMining operations resumed on November 25 at the conclusion of discussions among government officials, community leaders and company representatives.\n\nDaniel Panganai, the current HR manager of Sino Africa Huijin, was involved in the discussions. He told VOA in mid-December that the company complied with all the requirements outlined in writing, but I cannot divulge much information at this time.\n\nMisheck Mugadza, the Manicaland minister of state, also said in December that Sino Africa Huijin committed to adhering to all mining and environmental regulations. He said the Chinese company had acted on its social responsibility obligations by donating to the local hospital and drilling a well to provide water to the local school.\n\nThe government is closely monitoring the companys operations, Mugadza said, and some households have already received full compensation for damages. He further stated that the company is obligated to compensate all affected residents.\n\nChinese investments in Zimbabwean mines\n\nThe controversy surrounding the Sino Africa Huijin mine is not isolated, according to a September report by the Center for Natural Resource Governance, or CNRG, a Harare-based community rights organization.\n\nThe report, which assessed the impact of Chinese investment on Zimbabwes mining industry, found that Chinese mining ventures have led to widespread environmental degradation, disregard for the cultural rights of host communities, and, in many cases, the violation of the countrys labor laws, often with apparent impunity.\n\nChinese investors control an estimated 90% of the of Zimbabwes mining industry, according to the report.\n\nIn 2023 alone, Sino investments in Zimbabwes mining sector saw 121 investors contributing a staggering $2.79 billion, said CNRG Executive Director Farai Maguwu, who was quoted in a post on the organizations website.\n\nSeparately, another area resident voiced criticism of the governments response to the mining.\n\nThere are times when the mine uses explosives of higher magnitude, and there will be tremors, said area resident Thobekile Mhenziwamukuru.\n\nWhen we call the government officials about the crisis, they always go directly alone to the Sino mine offices without any community leaders, then they will come and address us, just saying they will use explosives of low magnitude next time and we now know that its now their cash cow.\n\nEven in terms of closing and reopening of the mine, instead of solving our grievances, there is no fairness in everything because money is being exchanged to slow the progress and we hope higher offices in government will come to rescue us, she concluded.\n\nMaguwu accused local lawmakers of corruption, saying, Instead of enforcing the law, they are cashing in on this illegality by forcing them to close down, demanding bribes for reopening, and then returning to close them down again and demand another bribe.\n\nDespite repeated phone calls and visits to the offices of government stakeholders to address these accusations, including the Ministry of Mines and the Environmental Management Agency, VOA received no response.\n\nThis cycle goes on and on while the environment is being sacrificed, Maguwu said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/16012655/Chinese-Miners-Zimbabwe.png",
            "description": "<p>By VOA GOVERNMENT officials in Zimbabwe have been scrutinizing a Chinese mining company that has been operating a gold mine in the country’s east since at least 2021. The scrutiny comes as residents voice concern about the impact on health and the environment. The company in question is Sino Africa Huijin Holdings, which faces accusations</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-owned-gold-mine-stirs-controversy-in-eastern-zimbabwe/\">Chinese-owned gold mine stirs controversy in eastern Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Government appeals for hospital beds to furnish drug rehabilitation centres",
            "url": "https://www.newzimbabwe.com/government-appeals-for-hospital-beds-to-furnish-drug-rehabilitation-centres/",
            "content": "By Anna Chibamu\n\nLOCAL Government ministry permanent secretary, John Basera is appealing for donations in the form of hospital beds for drug rehabilitation centres countrywide.\n\nAccording to a letter addressed to provincial medical directors, district medical officers, private hospitals, corporates, faith-based organisations and civil society, Basera said most rehabilitation institutions are in dire need of hospital admission beds.\n\nThe country has sixty-three (63) facilities for drug rehabilitation and livelihood centres that have been identified to date.\n\nThe Resource Mobilization Pillar in the National Committee on Drug and Substance Abuse is mandated to seek, coordinate and pool resources together for all seven (7) pillars so as to enable them to manage the menace of drug and substance abuse in Zimbabwe.\n\nMost of the availed rehabilitation institutions are in dire need of hospital admission beds.\n\nThe National Committee on Drug and Substance Abuse is kindly appealing to all private and government institutions to donate beds which are not in use at their facilities, read part of the letter.\n\nCases of drug and substance use have been on the increase over the past few years with most families affected.\n\nTo demonstrate the prevalence of the scourge, recently there were reports of the expulsion of eight (8) girls from Dominican Convent High School over allegations of violating the schools anti-drug policy.\n\nMost government institutions do not have enough medical equipment and even such consumables as gloves and syringes are not found in major referral centres or hospitals.\n\nOn drug and substance use, government has put in place policies to curb the misuse, but not much has been achieved as shown by a surge in cases reported or arrests made last year.\n\nArrests of drug and substance use culprits have also surged in 2024, with close to 2,400 people said to have been taken into custody.\n\nOfficials say economic difficulties are hampering efforts to curb the problem.\n\nFines ranging from $30 to $400 or imprisonment not exceeding two years for any business convicted of selling illicit drugs have been imposed by Cabinet, Information minister Jenfan Muswere told the media recently.\n\nIn addition to the 2,373 people who were arrested in 2024, 48 bases in six provinces were raided and dismantled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22144959/Empty-hospital-ward-1.jpg",
            "description": "<p>By Anna Chibamu LOCAL Government ministry permanent secretary, John Basera is appealing for donations in the form of hospital beds for drug rehabilitation centres countrywide. According to a letter addressed to provincial medical directors, district medical officers, private hospitals, corporates, faith-based organisations and civil society, Basera said most rehabilitation institutions are in dire need of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-appeals-for-hospital-beds-to-furnish-drug-rehabilitation-centres/\">Government appeals for hospital beds to furnish drug rehabilitation centres</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "‘We are confident of defending PSL title despite player mass exodus’— says Simba Bhora",
            "url": "https://www.newzimbabwe.com/we-are-confident-of-defending-psl-title-despite-player-mass-exodus-says-simba-bhora/",
            "content": "By Sports Reporter\n\nFOLLOWING a mass exodus which saw 13 players leaving the club, reigning Premier Soccer League (PSL) champions, Simba Bhora, are confident of defending the title this coming season.\n\nThe Shamva-based side did not only lose players as team head coach Tonderai Ndiraya together with his technical team also deserted the side.\n\nDespite losing a number of its key players including team captain and 2024 Castle Lager PSL Soccer Star of The Year Walter Musona, club chairman Isiah Mupfurutsa is of the belief that they can still defend the title.\n\nWe are the defending champions, and we will be one of the teams to beat.\n\nWe are not going to surrender the title rather we want to fight and make sure we defend it, said Mupfurutsa.\n\nThe Go Buju Go side has made a number of new acquisitions to try and cover the void with new signings Donald Mudadi from Dynamos, Liberty Chakoroma from Manica Diamonds and Blessed Ndereki from Yadah FC.\n\nAs replacement to departed coach Ndiraya, the club has appointed former Highlanders and Dynamos assistant coach Joel Lupahla.\n\nWith a task to compete in the CAF Champions League lying ahead, Mupfurutsa is basing on the experience of incoming players whom he said are groomed for the task.\n\nIts not going to be an easy season because we will be fighting on two fronts, that is the local league and CAF Champions League.\n\n So, in our replacements we have taken note of this, and we are bringing players with experience and quality to meet these demands, Mupfurutsa added.\n\nSimba Bhora were promoted into the premiership in 2023 and made history last year after becoming the first team from Mashonaland Central to win the league title in Zimbabwean football.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09045209/GdF2D7NW0AAmBht-1.jpeg",
            "description": "<p>By Sports Reporter  FOLLOWING a mass exodus which saw 13 players leaving the club, reigning Premier Soccer League (PSL) champions, Simba Bhora, are confident of defending the title this coming season. The Shamva-based side did not only lose players as team head coach Tonderai Ndiraya together with his technical team also deserted the side. Despite</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-confident-of-defending-psl-title-despite-player-mass-exodus-says-simba-bhora/\">‘We are confident of defending PSL title despite player mass exodus’— says Simba Bhora </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Harare’s clogged sewer systems pose headaches as cholera outbreak looms",
            "url": "https://www.newzimbabwe.com/harares-clogged-sewer-systems-pose-headaches-as-cholera-outbreak-looms/",
            "content": "By Staff Reporter\n\nBURST sewer systems have for years been a problem in most high-density suburbs of Harare, especially in Glenview and Budiriro, which are two cholera hotspots.\n\nResearch recently made revealed that the major cause of diarrheal diseases being treated in Harare is drinking contaminated water due to broken sewer systems.\n\nZimbabwe is already trying to curb a cholera outbreak as 104 positive cases and one death have been recorded in Mashonaland Central province from December to date.\n\nIn an effort to curb the water borne disease, government, together with City of Harare (CoH) went on a tour of Mbare high density suburb, which is another potential hotspot.\n\nAfter coming across several streams of raw sewer in Mbare, Health and Child Care Deputy Minister, Sleiman Kwidini said there is urgent need for government to work closely with the local authority to fix the compromised sewer systems.\n\nWe have seen that sewer problems in this area are a big problem.\n\nSo, we have agreed to work hand in hand with the CoH to help in addressing this problem.\n\nWe have agreed that we will come up with a team combining people from both Ministry of Health and CoH so as to see how best we can tackle these ever-growing sewer problems.\n\nThe only way we can be successful in defeating cholera is by solving such problems like poor sewer systems, said Kwidini.\n\nSpeaking during the same tour, CoH Health Services Director, Prosper Chonzi, said solving sewer problem in the capital is beyond council hence, there is a need for all stakeholders to come together and create a solution.\n\nWe need to put our hands together because cholera knows no political boundary.\n\nWe need government to support us in dealing with this problem, it should not be a CoH problem, everyone needs to come on board, and we fix this once and for all, said Chonzi.\n\nThe country recently witnessed a cholera outbreak, which ended May 2024, in which there were 88 confirmed deaths and 631 suspected deaths from 34,550 suspected cholera cases.\n\nZimbabwe experienced a devastating cholera crisis in 2008, which saw 4,200 people dying with more than 100,000 being infected.\n\nStatistics from research made during the time indicated that 60% of the cause of infections was poor sewer system in the hotspots.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/17041733/Matapi-sewage.jpg",
            "description": "<p>By Staff Reporter BURST sewer systems have for years been a problem in most high-density suburbs of Harare, especially in Glenview and Budiriro, which are two cholera hotspots. Research recently made revealed that the major cause of diarrheal diseases being treated in Harare is drinking contaminated water due to broken sewer systems. Zimbabwe is already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-clogged-sewer-systems-pose-headaches-as-cholera-outbreak-looms/\">Harare’s clogged sewer systems pose headaches as cholera outbreak looms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Teachers’ union vows to push back ‘illegal’ setting of retirement age at 70",
            "url": "https://www.newzimbabwe.com/teachers-union-vows-to-push-back-illegal-setting-of-retirement-age-at-70/",
            "content": "By Staff Reporter\n\nAMALGAMATED Rural Teachers Union of Zimbabwe (ARTUZ) has vowed to fight government over what it terms illegal elevation of the retirement age.\n\nARTUZ president, Obert Masaraure said his organisation will not sit and relax whilst civil servants rights are trampled upon by President Emmerson Mnangagwas administration.\n\nThe elevation of the retirement age of civil servants is illegal on the front of the right to collective bargaining.\n\nIf you go through the Constitution of Zimbabwe, particularly Section 203 (i) (b), states that the conditions of service shall be fixed by the Commission but following through what is set out in Section 65 (v) were the right to bargaining so where a retirement age is part of the whole retirement package for the civil servants.\n\nThis cannot be unilaterally fixed by a bunch of people from the employers side wherever they meet in Cabinet or wherever they meet, we do not care, Masaraure said.\n\nHe added: As long as they have not engaged the employee side to then say, what is rational of this particular change, we find such a change both inappropriate and illegal.\n\nThat is why we are up against it.\n\nGovernment recently extended the retirement age from 45 years to 55 for police officers whilst the military will be allowed to retire at 65 from 50 with an allowance to get to 70 years.\n\nwe understand that the ruling elites are locked in power tussles. We however have a responsibility to fight for labour justice and right to education. Our responsibilities will not be shelved to allow factions of the ruling elites to settle their power issues. We will continue with the fight demanding urgent solutions to the questions of the day.\n\nWe are getting ready to push back against underpayment and the illegal elevation of the retirement age, Masaraure wrote on social media.\n\nDuring an interview with NewZimbabwe.com this Wednesday, Masaraure argued that factionalism had taken centre stage in the ruling Zanu PF party causing destructive decisions which do not take into consideration youths, who are supposed to be given a chance to occupy the few available jobs in the country.\n\nMost young graduates are unemployed as government amid government failure to create jobs for those churned out of universities and colleges yearly.\n\nWe look at the rate of unemployment of our young people and realise that this government cannot create jobs.\n\nWhy then do they want to keep old people occupying the little jobs that are there in the Republic, Masaraure queried.\n\nThere are issues to do with mental capacity of the person to say as we grow old, we get incapacitated. So why are we not giving the best brains; young people who are fresh graduates an opportunity to provide services to the people of Zimbabwe?\n\nWe need to build a strong State bureaucracy and that needs competent people who are highly energetic and young, but if we are going to be retaining our old friends in the interest of power retention, we are sabotaging the agenda of national development and unfortunately this is the path that has been chosen by the regime.\n\nWe will be protesting against it and rejecting it, and it will be reversed, Masaraure vowed.\n\nFundamentals such as the life expectancy of Zimbabweans which is now below 60 are some of the issues to include when a government changes laws or policies, said the trade unionist.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/25160906/Obert-Masaraure.jpg",
            "description": "<p>By Staff Reporter  AMALGAMATED Rural Teachers Union of Zimbabwe (ARTUZ) has vowed to fight government over what it terms “illegal elevation of the retirement age.” ARTUZ president, Obert Masaraure said his organisation will not sit and relax whilst civil servants’ rights are trampled upon by President Emmerson Mnangagwa’s administration. “The elevation of the retirement age</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teachers-union-vows-to-push-back-illegal-setting-of-retirement-age-at-70/\">Teachers’ union vows to push back ‘illegal’ setting of retirement age at 70</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Go Beer Brewery to reopen after decade closure",
            "url": "https://www.newzimbabwe.com/go-beer-brewery-to-reopen-after-decade-closure/",
            "content": "By Staff Reporter\n\nGO Beer Brewery, a liquor manufacturing company located in Gweru, is set to reopen soon thereby creating 50 job opportunities.\n\nThe liquor undertaking concern run by City of Gweru was closed nearly a decade ago due to financial mismanagement that saw the company swimming in a staggering US$2.6 million debt.\n\nIn an interview, Gweru Mayor, Martin Chivoko said the reopening will boost Gwerus economy.\n\nWith the resuscitation of Go Beer Brewery, we are excited to announce that the brewery will create employment opportunities for at least 50 people for a start.\n\nThis is a significant boost to our local economy and will help stimulate economic growth, he said.\n\nThe premier also added that, Were thrilled to have partnered with Crest Street Industries to revive the brewery and restore it to its former glory.\n\nHe said the revival of Go Beer Brewery is crucial for the councils revenue generation which will also improve service delivery.\n\nWe put 23 hectares under winter wheat at the Go Beer Farm, which we are going to use as raw materials for the brewery. We aim to produce our own raw materials for the brewery to make the business viable, Chivoko told the media recently.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/09042604/ytrgf55543.jpg",
            "description": "<p>By Staff Reporter  GO Beer Brewery, a liquor manufacturing company located in Gweru, is set to reopen soon thereby creating 50 job opportunities. The liquor undertaking concern run by City of Gweru was closed nearly a decade ago due to financial mismanagement that saw the company swimming in a staggering US$2.6 million debt. In an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/go-beer-brewery-to-reopen-after-decade-closure/\">Go Beer Brewery to reopen after decade closure</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Jan 2025"
        }
    ]
}