{
    "news": [
        {
            "title": "Sports Commission Director-General Nengomasha resigns",
            "url": "https://www.newzimbabwe.com/sports-commission-director-general-nengomasha-resigns/",
            "content": "By Sports Reporter\n\nSPORTS and Recreation Commission (SRC) Director-General Eltah Nengomasha has resigned.\n\nThis was revealed by the SRC in a statement released on Friday afternoon.The Sports and Recreation Commission (SRC) advises stakeholders that its Director General, Ms. Eltah Nengomasha, who tendered her resignation three months ago, will conclude her tenure with the Commission today, Friday the 19th of September 2025.The SRC Board extends its appreciation to Ms. Nengomasha for her service and contributions during her time in office, particularly in strengthening governance structures and stakeholder engagement across the sporting sector.To ensure smooth continuity of operations, the SRC has appointed Mr. Peter Mudzimiri, Director Legal and Corporate Services, as Acting Director General with immediate effect, read part of SRC statement.Nengomashas resignation comes two months after her reinstatement after months of suspension over allegations of misconduct.SRC further stated that the appointment of a new substantive director-general will be announced in due course.The process for appointing a substantive Director Gcneral will be announced in due course.The Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nThis was revealed by the SRC in a statement released on Friday afternoon.\n\nThe Sports and Recreation Commission (SRC) advises stakeholders that its Director General, Ms. Eltah Nengomasha, who tendered her resignation three months ago, will conclude her tenure with the Commission today, Friday the 19th of September 2025.The SRC Board extends its appreciation to Ms. Nengomasha for her service and contributions during her time in office, particularly in strengthening governance structures and stakeholder engagement across the sporting sector.To ensure smooth continuity of operations, the SRC has appointed Mr. Peter Mudzimiri, Director Legal and Corporate Services, as Acting Director General with immediate effect, read part of SRC statement.Nengomashas resignation comes two months after her reinstatement after months of suspension over allegations of misconduct.SRC further stated that the appointment of a new substantive director-general will be announced in due course.The process for appointing a substantive Director Gcneral will be announced in due course.The Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nThe Sports and Recreation Commission (SRC) advises stakeholders that its Director General, Ms. Eltah Nengomasha, who tendered her resignation three months ago, will conclude her tenure with the Commission today, Friday the 19th of September 2025.\n\nThe SRC Board extends its appreciation to Ms. Nengomasha for her service and contributions during her time in office, particularly in strengthening governance structures and stakeholder engagement across the sporting sector.To ensure smooth continuity of operations, the SRC has appointed Mr. Peter Mudzimiri, Director Legal and Corporate Services, as Acting Director General with immediate effect, read part of SRC statement.Nengomashas resignation comes two months after her reinstatement after months of suspension over allegations of misconduct.SRC further stated that the appointment of a new substantive director-general will be announced in due course.The process for appointing a substantive Director Gcneral will be announced in due course.The Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nThe SRC Board extends its appreciation to Ms. Nengomasha for her service and contributions during her time in office, particularly in strengthening governance structures and stakeholder engagement across the sporting sector.\n\nTo ensure smooth continuity of operations, the SRC has appointed Mr. Peter Mudzimiri, Director Legal and Corporate Services, as Acting Director General with immediate effect, read part of SRC statement.Nengomashas resignation comes two months after her reinstatement after months of suspension over allegations of misconduct.SRC further stated that the appointment of a new substantive director-general will be announced in due course.The process for appointing a substantive Director Gcneral will be announced in due course.The Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nTo ensure smooth continuity of operations, the SRC has appointed Mr. Peter Mudzimiri, Director Legal and Corporate Services, as Acting Director General with immediate effect, read part of SRC statement.\n\nNengomashas resignation comes two months after her reinstatement after months of suspension over allegations of misconduct.SRC further stated that the appointment of a new substantive director-general will be announced in due course.The process for appointing a substantive Director Gcneral will be announced in due course.The Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nNengomashas resignation comes two months after her reinstatement after months of suspension over allegations of misconduct.\n\nSRC further stated that the appointment of a new substantive director-general will be announced in due course.The process for appointing a substantive Director Gcneral will be announced in due course.The Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nSRC further stated that the appointment of a new substantive director-general will be announced in due course.\n\nThe process for appointing a substantive Director Gcneral will be announced in due course.The Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nThe process for appointing a substantive Director Gcneral will be announced in due course.\n\nThe Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\nThe Board and management remain fully committed to the SRCs mandate of promoting and regulating sport and recreation in Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19153713/images-9-3.jpeg",
            "description": "<p>By Sports Reporter SPORTS and Recreation Commission (SRC) Director-General Eltah Nengomasha has resigned. This was revealed by the SRC in a statement released on Friday afternoon. “The Sports and Recreation Commission (SRC) advises stakeholders that its Director General, Ms. Eltah Nengomasha, who tendered her resignation three months ago, will conclude her tenure with the Commission</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sports-commission-director-general-nengomasha-resigns/\">Sports Commission Director-General Nengomasha resigns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Sep 2025"
        },
        {
            "title": "Illicit cigarettes: Undocumented Zimbabweans found hiding in SANDF base",
            "url": "https://www.newzimbabwe.com/illicit-cigarettes-undocumented-zimbabweans-found-hiding-in-sandf-base/",
            "content": "IOL\n\nFive members of the South African National Defence Force (SANDF) have been released on bail after they appeared before the Musina Magistrates Court oncharges related to illicit cigarette smuggling.\n\nTheir two co-accused, both undocumented Zimbabwean nationals, were found hiding at the military base where the smuggling operation took place.\n\nLimpopo regional spokesperson for the National Prosecuting Authority (NPA), Mashudu Malabi-Dzhangi, said the five soldiers are Macdonald Tshabadira, 28; Waydon Peterson, 29; Khuliso Tshivhenga, 42; Khodani Abel Maphukhumela, 29; and Evah Mmaphuthi Modisa, 39. Each was granted bail of R5,000.\n\nTheir two co-accused, Livhuwani Mutavhatsindi, 27, and Perfious Chauke, 27, were remanded in custody without bail. The Zimbabwean nationals also face charges under the Immigration Act.\n\nMalabi-Dzhangi said the group faces charges of possession of illicit cigarettes, possession of ammunition, and defeating the ends of justice.\n\nThe arrests on September 16, 2025, followed an incident at the Artonvilla military base, where the SANDF members allegedly intercepted a group of smugglers transporting 24 master boxes of illicit Remington Gold cigarettes, valued at an estimated R300,000.\n\nIt is alleged that the soldiers only declared 18 of the boxes to SA Revenue Service Customs, while the remaining six boxes were later found hidden under their beds.\n\nPolice were alerted to the discrepancy and, upon searching the premises, found six master boxes of Remington Gold cigarettes concealed under the SANDF members beds. Two civilians were also discovered hiding at the base. The accused were immediately arrested, said Malabi-Dzhangi.\n\nOn the other hand, the SANDF has confirmed that the operation was unauthorized and has reiterated its zero-tolerance stance on corruption, with disciplinary processes to run concurrently with the criminal proceedings.\n\nPreliminary reports indicate that, at approximately midnight on 16 September 2025, a group of SANDF members allegedly conducted an unauthorised operation at Artonvilla, Musina (also known as Sediba sa Tlou base). It is alleged that the members, acting in concert with two Zimbabwean nationals, attempted to unlawfully intercept a group of smugglers transporting illicit cigarettes into South Africa, said SANDF spokesperson, Rear Admiral Prince Tshabalala.\n\nDuring the incident, shots were reportedly fired, illicit goods were seized, and some contraband was unlawfully concealed at the base.\n\nFollowing credible intelligence, the SANDF military police, military intelligence, and the SAPS launched a joint operation later that morning.\n\nThe case has been adjourned until November 14, 2025, for further investigation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19074507/sandf-base.png",
            "description": "<p>IOL Five members of the South African National Defence Force (SANDF) have been released on bail after they appeared before the Musina Magistrate’s Court on charges related to illicit cigarette smuggling. Their two co-accused, both undocumented Zimbabwean nationals, were found hiding at the military base where the smuggling operation took place. Limpopo regional spokesperson for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/illicit-cigarettes-undocumented-zimbabweans-found-hiding-in-sandf-base/\">Illicit cigarettes: Undocumented Zimbabweans found hiding in SANDF base</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Sep 2025"
        },
        {
            "title": "Zimbabwe ditches South Africa, chooses Botswana venue for Bafana Bafana clash",
            "url": "https://www.newzimbabwe.com/zimbabwe-ditches-south-africa-chooses-botswana-venue-for-bafana-bafana-clash/",
            "content": "IOL\n\nThe Zimbabwe Football Association (Zifa) have announced a dramatic venue change, in an unexpected twist in the lead-up to the 2026 FIFA World Cup qualifiers next month.\n\nTheir pivotal clash against South Africas Bafana Bafana, originally slated for South African soil, will now take place at the Obed Itani Chilume Stadium in Francistown, Botswana, on October 10, 2025.\n\nThis decision comes about because Zimbabwe have issues with hosting international matches at home due to a FIFA ban stemming from stadium concerns.\n\nZimbabwe have previously held their home qualifiers in South Africa, specifically utilising popular venues such as Orlando Stadium. The transition to Botswana is seen as a move to create a more logistical and fan-friendly environment for their supporters.\n\nLocal sources from the Zimbabwe Football Association (Zifa) report that the decision aims to make the match more accessible for both the Warriors fans. The move is significant as the fixture serves as a milestone in South Africas quest for World Cup qualification.\n\nAs it stands, South Africa leads the standings in Group C with 17 points from eight matches, putting them in pole position for qualification. Meanwhile, Zimbabwe languishes at the bottom with only four points, a stark reflection of their struggleshaving won merely two of their last 27 qualifiers since 2010.\n\nThis latest venue change adds further intrigue to a match that, while less critical for Zimbabwes aspirations, could serve as a defining moment for a Bafana squad looking to solidify their World Cup journey.\n\nThe Obed Itani Chilume Stadium, which boasts a capacity of 26,000, has been recognised as a reliable venue, previously hosting Namibia during their World Cup qualifiers, thus demonstrating its capability to cater to international football standards.\n\nThis choice of location not only provides a neutral ground but also enhances accessibility for Zimbabwean fans, who usually faced no challenges attending matches in South Africa.\n\nDespite Zimbabwes elimination from World Cup contention following a disappointing series of resultsincluding losses to Benin and Rwandathis encounter with the Bafana is unlikely to diminish local interest. Providing a stage to showcase talent, the upcoming match may serve more as a platform for national pride and a precursor to the upcoming 2025 Africa Cup of Nations.\n\nHowever, the venue shift has left many fans puzzled; while the location changes, Zimbabwes hopeless position in the qualifiers is still unchanged. The decision ultimately raises questions about ZIFAs administrative strategy, especially as Zimbabwe prepares to face South Africa, Nigeria, and Lesotho, a task that seems more metaphorical than consequential.\n\nThe president of the Botswana Football Association, Tariq Babitseng, confirmed the hosting arrangement, emphasising the significance of this contest for Bafana as they aim for a win to bolster their World Cup bid.\n\nWith anticipation building, all eyes will be on Francistown this October, regardless of the unpredictable journey Zimbabwes Warriors have faced in their World Cup qualifiers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>IOL The Zimbabwe Football Association (Zifa) have announced a dramatic venue change, in an unexpected twist in the lead-up to the 2026 FIFA World Cup qualifiers next month. Their pivotal clash against South Africa’s Bafana Bafana, originally slated for South African soil, will now take place at the Obed Itani Chilume Stadium in Francistown, Botswana,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ditches-south-africa-chooses-botswana-venue-for-bafana-bafana-clash/\">Zimbabwe ditches South Africa, chooses Botswana venue for Bafana Bafana clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Sep 2025"
        },
        {
            "title": "Local miners shun ZIDA’s Mining Claims Matchmaking platform despite investment potential",
            "url": "https://www.newzimbabwe.com/local-miners-shun-zidas-mining-claims-matchmaking-platform-despite-investment-potential/",
            "content": "ByAlois Vinga\n\nThe Zimbabwe Investment Development Agency (ZIDA) has expressed concern that local miners are not taking advantage of its Mining Claims Matchmaking platform, despite its vast potential to unlock critical investment opportunities.\n\nThe platform was created to connect mining claim holders in Zimbabwe with both local and international investors. It is designed to facilitate partnerships for technical support, tributary agreements, joint ventures, debt funding, or even the outright sale of mining claims.\n\nAccording to ZIDA, the service is open to all mining claim holders in Zimbabwe, whether individuals, companies, or syndicates, regardless of their scale of operation.\n\nTo use the platform, claim holders are required to upload their identification documents, claim registration certificate, valid inspection certificate, and a site map.\n\nBut speaking during a plenary discussion at the 2025 Environmental Social Governance Conference convened by the Zimbabwe Environmental Law Organisation (ZELO) and Silveira House on the sidelines of the Zimbabwe Alternative Mining Indaba in Bulawayo, the ZIDA Legal Manager, Chidochashe Ncube, said local miners were not tapping into the platforms potential.\n\nThere seems to be a lack of trust by locals who suspect the risk of losing their claims. Locals want to go behind the scenes and the few who come forth only do after being shortchanged by the potential investors.\n\nThe public must be aware that this platform has a number of benefits like assistance in identifying ethical investors, contract drafting and professional advice on business-related issues, she said.\n\nNcube said such platforms also enhance the strengthening of ESG standards since matched parties easily fall under the authorities surveillance.\n\nQuizzed by one David Bote on why ZIDA appears to be pro-foreign investors as opposed to locals in rendering assistance, Ncube dismissed the claims, arguing that locals are not willing to come forth and exhaust available opportunities.\n\nIt is incorrect. The fact of the matter is that foreigners first port of call is usually the ZIDA because they do not know anyone around. In contras,t locals often bypass the Agency, opting to engage their connections instead, only to look for us when this goes off hand, added Ncube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/18082827/chido-ncube.png",
            "description": "<p>By Alois Vinga The Zimbabwe Investment Development Agency (ZIDA) has expressed concern that local miners are not taking advantage of its Mining Claims Matchmaking platform, despite its vast potential to unlock critical investment opportunities. The platform was created to connect mining claim holders in Zimbabwe with both local and international investors. It is designed to facilitate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-miners-shun-zidas-mining-claims-matchmaking-platform-despite-investment-potential/\">Local miners shun ZIDA’s Mining Claims Matchmaking platform despite investment potential</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Sep 2025"
        },
        {
            "title": "Mnangagwa shifts focus to 2028 elections, brushing aside party’s ‘2030 Agenda’",
            "url": "https://www.newzimbabwe.com/mnangagwa-shifts-focus-to-2028-elections-brushing-aside-partys-2030-agenda/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has seemingly set aside Zanu PFs long-touted 2030 Agenda, now shifting focus to the 2028 general elections, which he insists the ruling party must resoundingly win.\n\nThis comes as Zanu PF prepares for its 22nd National Peoples Conference, scheduled for Mutare. Mnangagwa is serving his second and final constitutional term, ending in 2028, though his allies have been lobbying for the postponement of elections to 2030.\n\nAt last years National Peoples Conference in Bulawayo, Zanu PF passed a resolution to extend Mnangagwas tenure until 2030 or beyond. The move, however, met resistance from rival factions within the party and war veterans believed to be backing Vice President Constantino Chiwenga, widely tipped as Mnangagwas likely successor.\n\nAddressing the Central Committee this Thursday, Mnangagwa hinted that the upcoming Mutare conference would be crucial in setting the partys direction, with the thorny succession question expected to dominate discussions.\n\nWe gather today, a few weeks before we hold the 22nd National Peoples Conference in the scenic City of Mutare, Manicaland Province.\n\nFurther, this meeting is being convened at a time when we have passed the halfway mark since our last Harmonised General Elections in 2023.\n\nIt is, therefore, of critical importance that we introspect as a Party, not only with regards to our short-term activities, but also in view of the bigger objective of ensuring that our party resoundingly wins the 2028 Harmonised General Elections, said Mnangagwa.\n\nTensions remain high within Zanu PF over the succession race. Business tycoon Kudakwashe Tagwirei, recently co-opted into the Central Committee, is reportedly eyeing the presidency, while Chiwenga is believed to command strong support from within party structures.\n\nMnangagwa urged members to stay grounded in the partys founding ethos while remaining focused on Vision 2030.\n\nLet us, as the leadership, continually align the membership of the Party to the founding ideology, values, principles and the overall provisions of the Party Constitution.\n\nThe wheels of our revolution should be kept moving, our grassroots membership and structures well-organised, mobilised and informed.\n\nAll of us must work harder, with determination and focus across all sectors, as we accelerate the realisation of Vision 2030, he said.\n\nMeanwhile, in Parliament on Wednesday, opposition MPs pressed government to clarify its position on implementing reforms outlined in the 2023 SADC Election Observer Report, recommendations critical ahead of future polls.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19070809/mnangagwa-cc.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has seemingly set aside Zanu PF’s long-touted ‘2030 Agenda’, now shifting focus to the 2028 general elections, which he insists the ruling party “must resoundingly win.” This comes as Zanu PF prepares for its 22nd National People’s Conference, scheduled for Mutare. Mnangagwa is serving his second and final constitutional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-shifts-focus-to-2028-elections-brushing-aside-partys-2030-agenda/\">Mnangagwa shifts focus to 2028 elections, brushing aside party’s ‘2030 Agenda’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Sep 2025"
        },
        {
            "title": "ZIMRA officials in court over US$6.3 million fraud",
            "url": "https://www.newzimbabwe.com/zimra-officials-in-court-over-us6-3-million-fraud/",
            "content": "By Mary Taruvinga\n\nTwo senior employees of the Zimbabwe Revenue Authority (ZIMRA) have appeared in court accused of masterminding a sophisticated cyber fraud that cost the tax authority more than US$6.34 million.\n\nThe accused are Shupikai Mary Nicola Marongwe (52), a database administrator, and Paradzai Mutasa (35), a systems developer.\n\nThe two appeared before Harare magistrate Marewanazvo Gofa, who remanded them in custody to this Friday pending bail finalisation.\n\nBoth were entrusted with managing ZIMRAs critical tax systems, but now stand charged with abusing their positions for personal gain.\n\nAccording to prosecutor Rufaro Chonzi, the pair exploited their roles during the rollout of the Zimbabwe Electronic Single Window (ZESW) project, which was designed to integrate with the ASYCUDA customs system. Instead of creating a limited-access account as requested by a United Nations consultant working on the project, they allegedly built a hidden account with full administrative rights.\n\nUsing this backdoor, they manipulated clearing agents prepayment accounts, inserting fictitious deposits to make it appear as if customs duties had been paid. In reality, no money was received by ZIMRA. \n\nThe agents were then able to clear goods duty-free while the accused allegedly collected cash from them, sharing the proceeds.\n\nThe scam ran undetected for months, with prosecutors telling the court that by abusing their positions, the accused acted contrary to their duties as public officers, showing favour to themselves and prejudice to ZIMRA.\n\nNothing has been recovered from the multi-million-dollar fraud.\n\nThe two were remanded in custody pending finalisation of their bail hearing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga Two senior employees of the Zimbabwe Revenue Authority (ZIMRA) have appeared in court accused of masterminding a sophisticated cyber fraud that cost the tax authority more than US$6.34 million. The accused are Shupikai Mary Nicola Marongwe (52), a database administrator, and Paradzai Mutasa (35), a systems developer. The two appeared before Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimra-officials-in-court-over-us6-3-million-fraud/\">ZIMRA officials in court over US$6.3 million fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Sep 2025"
        },
        {
            "title": "No sacred cows – Mnangagwa vows to punish corrupt Zanu PF members",
            "url": "https://www.newzimbabwe.com/no-sacred-cows-mnangagwa-vows-to-punish-corrupt-zanu-pf-members/",
            "content": "By Anna Chibamu\n\nPresident Emmerson Mnangagwa has issued a stern warning to Zanu PF members, urging them to shun corruption and stop abusing party empowerment initiatives.\n\nAddressing the Zanu PF Central Committee in Harare on Thursday, Mnangagwa said corruption had no place in the ruling party and vowed that those implicated would face decisive action.\n\nHis remarks follow repeated calls by Vice President Constantino Chiwenga to clamp down on corruption, which he has often associated with individuals flaunting ill-got wealth, dismissively labelling themzviganandas.\n\nAccording to Transparency International, Zimbabwe was ranked the most corrupt country in the SADC region in 2024, further intensifying pressure on the government to act.\n\nMnangagwa said the partys constitution empowers it to act firmly against members tarnishing its image through self-serving and unethical conduct.\n\nCorruption of any kind and excesses that alienate us from the people can never be condoned. Integrity, discipline and unity, concern for the people and clean governance must be synonymous with Zanu PF.\n\nAs provided for in our Party Constitution, we have a duty to boldly and decisively deal with those who put the name of the Party into disrepute. Winning the hearts and minds of our people remains a critical role of every cadre and structure of the Party, Mnangagwa said.\n\nHe also warned against the abuse of empowerment facilities designed to benefit grassroots communities, citing the recently launched Presidential Womens League Empowerment Fund as an example.\n\nRecently, I launched the Presidential Womens League Empowerment Fund to facilitate the expansion and diversification of various income-generating projects being implemented by women.\n\nAbuse of these facilities will not be accepted. We are a Party that honours the grassroots. We must maintain our character as an inclusive, fair and people-centred Party, he added.\n\nDespite the government rolling out various youth and womens empowerment programmes, critics argue that most of these facilities rarely reach the intended beneficiaries, particularly young people struggling to break into the formal economy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19063012/mnangagwa-zanu.jpeg",
            "description": "<p>By Anna Chibamu President Emmerson Mnangagwa has issued a stern warning to Zanu PF members, urging them to shun corruption and stop abusing party empowerment initiatives. Addressing the Zanu PF Central Committee in Harare on Thursday, Mnangagwa said corruption had no place in the ruling party and vowed that those implicated would face decisive action.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-sacred-cows-mnangagwa-vows-to-punish-corrupt-zanu-pf-members/\">No sacred cows – Mnangagwa vows to punish corrupt Zanu PF members</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Sep 2025"
        }
    ]
}