{
    "news": [
        {
            "title": "WestProps Hills Luxury Golf Estate transforms Harare West",
            "url": "https://www.newzimbabwe.com/westprops-hills-luxury-golf-estate-transforms-harare-west/",
            "content": "By Staff Reporter\n\nIn the heart of Harare West, once dismissed by skeptics as an unlikely canvas for luxury  a bold vision has taken root. The Hills Luxury Golf Estate is rewriting the rules of real estate, sport, and lifestyle in Zimbabwe.\n\nWhat was once called a project of impossibilities is now the countrys most iconic urban development. The lead developer Ken Sharpe, CEO of Westprop Holdings is upbeat with progress so far.\n\nHe feels the project has all the ingredients of luxury, modernity and the future. Last week he hosted an elite gathering of customers to serenade them with progress so far. The customers felt the vibe and committed to the project.\n\nCritics had scoffed at the idea of a baobab forest thriving in Harare West. They doubted that global attention could be drawn to this corner of the capital. Today, those doubts have been silenced by a living, breathing masterpiece  where ancient trees meet modern luxury, and every detail is curated for excellence.\n\nAt the heart of this transformation is a golf course designed by none other than Peter Matkovich, the current world number one golf architect. His signature blends natural beauty with championship precision, creating a course that is both a sanctuary and a stage for greatness.\n\nThe Hills is not just a place to live  itnis a place to belong. Exclusive features include:\n\nBranded Residences: Architecturally stunning homes with direct access to the golf course.\n\nSpeaking at a recent customer familiarization tour of the project Simukai Whande WestProp Digital Marketing Manager had this to say: This is a rare moment in time. Early investors will benefit from pre-launch pricing, securing premium assets at unmatched value. Once the ceremonial first tee is struck, prices will rise by an average of 40%, reflecting the true worth of this landmark estate.\n\nThe Hills is proof that vision, courage, and excellence can defy geography and expectation. Its a celebration of Zimbabwean pride, global standards, and the power of belief. What was once deemed impossible is now inevitable, and those who act early will own a piece of history.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18182919/the-hills.webp",
            "description": "<p>By Staff Reporter In the heart of Harare West, once dismissed by skeptics as an unlikely canvas for luxury – a bold vision has taken root. The Hills Luxury Golf Estate is rewriting the rules of real estate, sport, and lifestyle in Zimbabwe. What was once called “a project of impossibilities” is now the country’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/westprops-hills-luxury-golf-estate-transforms-harare-west/\">WestProps Hills Luxury Golf Estate transforms Harare West</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        },
        {
            "title": "ZIFA blocks PSL bid to suspend relegation, says proposal is invalid",
            "url": "https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer Leagues (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, cannot be implemented.\n\nAt an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under PSLs proposal, eight teams that were facing relegation this season would survive, while the four regional division champions would be promoted to the topflight, bringing the league to 22 clubs.\n\nThe meetingwas convened after ZIFA had earlier recommended a 20-team league structure.\n\nIn a statement, ZIFA, however, trashed the PSLs resolution,\n\nThe Association wishes to make it unequivocally clear that this proposal cannot be implemented. Promotion and relegation are fundamental components of football competition and are essential to maintaining the integrity, fairness, and sporting merit of the league system.\n\nZIFA confirmed that four clubs will be relegated at the conclusion of the 2025 Castle Lager Premier Soccer League season, which officially ends on 23 November 2025.\n\nThe association also reminded the PSL to follow proper procedure when proposing structural changes in the future.\n\nShould the Premier Soccer League or any other member wish to propose an adjustment to the number of participating teams or propose any other resolution, such a request must be formally submitted to the Association. In accordance with ZIFA statutes, the proposal will then be tabled for consideration at the next ZIFA Congress, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer League’s (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, “cannot be implemented.” At an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/\">ZIFA blocks PSL bid to suspend relegation, says proposal is invalid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        },
        {
            "title": "PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season",
            "url": "https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/",
            "content": "By Sports Reporter\n\nPremier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign.\n\nThe decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare.\n\nZIFA had initially proposed increasing the number of participating teams from 18 to 20, but PSL clubs went further, opting for a 22-team league next year.\n\nAs a result, all eight teams that were facing relegation this season will survive, while the four regional division champions will be promoted to the topflight, bringing the league to 22 clubs.\n\nIn a statement PSL revealed that the league will be trimmed back to 20 teams in 2027.\n\nThe PSL resolved to suspend relegation for the 2025 season.\n\nThe League will accommodate the newly promoted teams, resulting in an expanded league of twenty-two teams for a transitional period during the 2026 season.\n\nAfter the conclusion of the 2026 season, the League will revert to the proposed twenty team format beginning in the 2027 season, read part of PSL statement.\n\nThe move is meant to help ZIFA adopt a National First Division League which will feed the topflight league.\n\nIn addition, the PSL proposed a phased approach to the implementation of the National First Division League with the possibilities of it being fully operational within the next three years, PSL added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18152309/psl-zim-1-e1763479504235.jpg",
            "description": "<p>By Sports Reporter Premier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign. The decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare. ZIFA had initially proposed increasing the number of participating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/\">PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        },
        {
            "title": "Magaya slams State for conducting investigations on social media, says he is ready for rape, fraud trial",
            "url": "https://www.newzimbabwe.com/magaya-slams-state-for-conducting-investigations-on-social-media-says-he-is-ready-for-rape-fraud-trial/",
            "content": "By Mary Taruvinga\n\nLawyers representing Prophetic Healing and Deliverance Ministries founder Walter Magaya and his wife on Tuesday accused the State of conducting investigations through social media, insisting their clients are ready to proceed to trial.\n\nMagaya and his wife face 13 fraud charges, while the cleric is also charged separately with rape. Their companies, Planet Africa and Yadah Connect, are jointly charged.\n\nThe accused persons are ready and the State should investigate the matter in a manner which is not prejudicial to the accused persons, said lead counsel Admire Rubaya.\n\nThe couple appeared before Harare magistrate Marewanazvo Gofa for routine remand, and the matter was postponed to December 9 as investigations continue.\n\nProsecutors requested the postponement, arguing that inquiries were still underway. However, Rubaya, together with lawyer Malvern Mapako, countered that the State should proceed to trial instead of issuing statements on social media.\n\nThis follows several police statements, one calling for victims to come forward and another alleging a US$200,000 scheme to bribe the justice system, remarks which Magaya says are prejudicial.\n\nThe State should bring the accused to trial. They have been investigating the matter since 2022. They should take a leaf from the police homicide department which investigates and bring people to court and not statements.\n\nThey are busy issuing statements as if matters are won on social media. Recently, the accused complained that the police issued a statement alleging there is a fund of 200 thousand to bribe judges, magistrates and instead of arresting the people they are putting out statements.\n\nThere is no need for megaphone investigations. They have been investigating this case and should not develop jelly legs.\n\nThis matter should not just be a statistic that in 2025 there was a case involving Magaya, Rubaya said.\n\nProsecutors allege the couple misrepresented to congregants and followers that they had secured large tracts of land for residential developments in Chishawasha, Norton, Westgate, Fern Valley (Mutare), Bulawayo, Kwekwe, Arcturus, Ruwa, Manyame, and Nyatsime. The companies allegedly collected about US$50,000 and R190,000 from prospective homeowners for stands that never materialised.\n\nIn his bail application, Magaya addressed the rape allegations, dismissing them as fabrications at the instance of the Zimbabwe Gender Commission, which he said has misused its powers to force these two complainants into concocting all manner of allegations against him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Lawyers representing Prophetic Healing and Deliverance Ministries founder Walter Magaya and his wife on Tuesday accused the State of conducting investigations “through social media”, insisting their clients are ready to proceed to trial. Magaya and his wife face 13 fraud charges, while the cleric is also charged separately with rape. Their companies,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-slams-state-for-conducting-investigations-on-social-media-says-he-is-ready-for-rape-fraud-trial/\">Magaya slams State for conducting investigations on social media, says he is ready for rape, fraud trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        },
        {
            "title": "Eli Lilly weight-loss drug appears to suppress binge-eating signal, small study finds",
            "url": "https://www.newzimbabwe.com/eli-lilly-weight-loss-drug-appears-to-suppress-binge-eating-signal-small-study-finds/",
            "content": "Researchers monitoring the brain activity of a patient with a severe binge-eating problem reported that Eli Lillys GLP-1 weight-loss drug appeared to temporarily suppress food-craving signals in the reward center of the brain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18053406/weight-loss-injections.jpg",
            "description": "<p>Reuters Researchers monitoring the brain activity of a patient with a severe binge-eating problem reported that Eli Lilly’s GLP-1 weight-loss drug appeared to temporarily suppress food-craving signals in the “reward center” of the brain. These are the first direct measurements of brain activity in a person receiving tirzepatide, sold as Mounjaro for diabetes and Zepbound</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eli-lilly-weight-loss-drug-appears-to-suppress-binge-eating-signal-small-study-finds/\">Eli Lilly weight-loss drug appears to suppress binge-eating signal, small study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        },
        {
            "title": "Zimbabwe’s miners spending a paltry US$11 million on exploration",
            "url": "https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/",
            "content": "By Alois Vinga\n\nA mineral asset valuation expert has raised alarm over Zimbabwes mining sectors paltry US$11 millionannual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more.\n\nMining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical and geochemical methods. It is the first and most critical stage of mining, involving mapping, surveys and exploratory drilling to identify potential ore bodies before mining decisions are made.\n\nSpeaking toNewZimbabwe.comon the sidelines of the inaugural Zimbabwe Gold Investment Conference on Monday, Ernst & Young Associate Partner Dr Godknows Njowasaid Zimbabwes exploration spending remains far too low.\n\nErnst & Young Associate Partner Dr Godknows Njowa\n\nIn terms of exploration, Zimbabwe spends only 0.2% of annual global exploration expenditure, and within Africa, we contribute just 2%. Yet Africas total share is around 9%, he said.\n\nSo this shows that in Zimbabwe, we are not spending enough money on exploration. During my presentation, I gave the example of Canada, which is the highest spender in the world at about 20% of the annual global exploration budget.\n\nNjowa warned that Zimbabwe continues to lose opportunities, saying the country has the potential to double its current gold outputif it adequately explores and develops new deposits.\n\nFor decision makers,both government and private sector,more money must be allocated to exploration. Gold mining companies globally are making super profits because prices are at levels not seen in the past 30 or 40 years.\n\nSo some of that money should be reinvested into exploration. You need to spend between US$50 and US$80 per ounceof what you produce on exploration, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga A mineral asset valuation expert has raised alarm over Zimbabwe’s mining sector’s paltry US$11 million annual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more. Mining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/\">Zimbabwe’s miners spending a paltry US$11 million on exploration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        },
        {
            "title": "ZimbosAbantu’s solar-powered mobile clinics deliver healthcare to villages in rural Zimbabwe",
            "url": "https://www.newzimbabwe.com/zimbosabantus-solar-powered-mobile-clinics-deliver-healthcare-to-villages-in-rural-zimbabwe/",
            "content": "Hackster\n\nRemoteness from care is a major challenge to health services worldwide. Half of the worlds population resides in rural areas, but only 36% of the global nursing workforce lives there. This means infant mortality, maternal death, and poor health outcomes are much prevalent in rural areas than in urban locations.\n\nTelehealth (healthcare delivery via electronic means) has helped in overcoming some barriers, but it requires internet access. One in three people globally will still live in a rural area by 2050, and there is a critical need for healthcare access solutions that are built to work in rural areas.\n\nIn rural Zimbabwe, a person who is sick might walk 15 to 20 kilometres to reach a clinic.ZimbosAbantu a social enterprise in Harare, Zimbabwes capital has a fleet of mobile clinics that offer medical services to vulnerable populations in the rural and peri-urban areas of the city. Its goal is to reduce the distance that women, youth, and children walk to access primary healthcare from 15km to 3km.\n\nZimbosAbantu roughly translates to Zimbabwean people. It operates five mobile clinics, offering services like dental care, maternal health, immunisation, eye care, and nutrition education.\n\nEach mobile clinic has a wind turbine and solar panels generating enough power for a 190-litre vaccine freezer. They are equipped with examination rooms, vital monitoring machines, diagnostic kits, and medications. They operate 12 hours a day and are staffed full-time by health professionals. Each clinic serves an average of 18-20 patients per day, or about 1000 patients per month.\n\nThe social enterprise was founded by Chiedza and Tawanda Mushawedu in 2021. Chiedza serves as the organizations executive director and previously worked for a private hospital. While working there, she saw people suffering from undiagnosed chronic conditions and dying from treatable conditions, simply because care was out of reach.\n\nZimbosAbantu offers a subsidised healthcare scheme to solve affordability disparities. Men, women, and youth are organized in groups of 10 or 20, and each member pays about $3 every month for access to healthcare, drugs, and other benefits. About 1,000 people are currently enrolled in the scheme.\n\nRemoteness from care is a wide-scale problem that needs a similarly-sized solution. ZimbosAbantu has recently added more vehicles to its fleet and expanded its operations to a second province. In a conversation with Africa Business Radio, Chiedza admits that there is still a large gap to be addressed, and ZimbosAbantu is a drop in the ocean. She emphasizes the need for investors and partners to help expand the organizations reach and impact.\n\nZiplineis another company working to improve medical access in Africa, but with autonomous drones.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18050427/zimbosabantu.jpg",
            "description": "<p>Hackster Remoteness from care is a major challenge to health services worldwide. Half of the world’s population resides in rural areas, but only 36% of the global nursing workforce lives there. This means infant mortality, maternal death, and poor health outcomes are much prevalent in rural areas than in urban locations. Telehealth (healthcare delivery via</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbosabantus-solar-powered-mobile-clinics-deliver-healthcare-to-villages-in-rural-zimbabwe/\">ZimbosAbantu’s solar-powered mobile clinics deliver healthcare to villages in rural Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        },
        {
            "title": "AfriForum seeks G20 countries’ intervention on South Africa’s property rights and farm murders",
            "url": "https://www.newzimbabwe.com/afriforum-seeks-g20-countries-intervention-on-south-africas-property-rights-and-farm-murders/",
            "content": "IOL\n\nLobby group AfriForum has called on G20 countries to usethe upcoming summit in Johannesburgand subsequent diplomatic engagements with South Africa to urge the government to respect property rights and take stronger action to address farm murders.\n\nThe organisation stated that it had written to the embassies of G20 member states, outlining concerns about what it described as the erosion of property rights and the rise in violent attacks on farmers, and had also presented what it called practical solutions to both issues.\n\nAfriForum CEO Kallie Kriel stated that the lack of progress in addressing these matters had already impacted the G20 summit,pointing out that the United States had decided to boycott the gathering due to such concerns.\n\nG20 countries can play a constructive role in stabilising both local and international relations by pledging their support for efforts to protect property rights and combat farm murders, Kriel said.\n\nHe argued that it was in the G20s own interest to ensure that property rights in South Africa were safeguarded, warning that uncertainty in this area could deter foreign investment.\n\nThe disregard for property rights in places like Zimbabwe and Venezuela has caused great suffering for ordinary people, leading to hyperinflation, unemployment and growing poverty, Kriel added.\n\nAfriForum has been a vocal critic of the Expropriation Act, which allows for the taking of property without compensation under certain conditions. Kriel said the organisations campaign against the policy was motivated by what it saw as the potentially catastrophic consequences for all South Africans.\n\nAmong the measures AfriForum is proposing are:\n\nOn property rights, AfriForum has called for amendments to the Expropriation Act, including the scrapping of Section 12(3), which allows for expropriation without compensation.\n\nAfriForum said it is set to launch a report regarding what it termed the violation of minorities human rights in South Africa.\n\nLast week,IOL reported that Argentinas President Javier Milei will not attend the G20 leaders summit in Johannesburg, aligning witha boycott of the key meeting backed by United States President Donald Trump.\n\nAccording to reports in Argentine media, Milei will instead send Foreign Minister Pablo Quirno to represent the country, along with G20 negotiator Federico Pinedo.\n\nThe decision marks a show of solidarity with Trump, who announced that the United States would not participate in the G20 summit in South Africa, citing alleged human-rights abuses against Afrikaner farmers in the country.\n\nArgentinas government has not issued an official statement on the withdrawal, but presidential aides quoted in local outlets said the move was in line with Washingtons position.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18050036/Afriforum.jpg",
            "description": "<p>IOL Lobby group AfriForum has called on G20 countries to use the upcoming summit in Johannesburg and subsequent diplomatic engagements with South Africa to urge the government to respect property rights and take stronger action to address farm murders. The organisation stated that it had written to the embassies of G20 member states, outlining concerns about what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afriforum-seeks-g20-countries-intervention-on-south-africas-property-rights-and-farm-murders/\">AfriForum seeks G20 countries’ intervention on South Africa’s property rights and farm murders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:08",
            "date": "18 Nov 2025"
        }
    ]
}