{
    "news": [
        {
            "title": "Zimbabweans’ fear of politically motivated violence has declined – research by continental body reveals",
            "url": "https://www.newzimbabwe.com/zimbabweans-fear-of-politically-motivated-violence-has-declined-research-by-continental-body-reveals/",
            "content": "By Leopold Munhende\n\nResearch by Afrobarometer has revealed a significant decline in fear of politically motivated violence among Zimbabweans.\n\nAfrobarometer, the continents leading source of high-quality data on public opinion, noted in a recently published report that only about a third of Zimbabweans now fear the possibility of violence during elections,a sharp drop from four-fifthsrecordedin 2009.\n\nThe 2023 general elections were comparatively peaceful, with fewer violent incidents than in previous polls, a factor that could explain the reduction in fear.\n\nIn 2009, four out of five Zimbabweans expressed fear of politically motivated violence following the events of 2008, when a state-sponsored campaign of intimidation involving killings and other forms of brutality was launched to rescue the late President Robert Mugabe after his defeat by the late pro-democracy icon Morgan Tsvangirai.\n\nThousands were reported killed duringOperation Makavhotera Papi?(Where did you put your vote?), which targeted opposition strongholds, particularly in rural areas.\n\nReports of people having their hands chopped off made headlines, prompting Human Rights Watch and other international organisations to condemn the Zimbabwean government.\n\nFear of political intimidation or violence during election campaigns has declined markedly, from roughly four-fifths of the population in 2009 to fewer than one-third in 2024, while a growing share of citizens feel free to choose whom to vote for without pressure, reads the Afrobarometer report.\n\nHowever, the same report notes that only about half of survey participants trust the Zimbabwe Electoral Commission (ZEC).\n\nThe ZEC, which is responsible for managing all election-related processes, has long been accused of manipulating results in favour of the ruling Zanu PF party, which has remained in power since 1980.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04031733/Political-Violence.png",
            "description": "<p>By Leopold Munhende Research by Afrobarometer has revealed a significant decline in fear of politically motivated violence among Zimbabweans. Afrobarometer, the continent’s leading source of high-quality data on public opinion, noted in a recently published report that only about a third of Zimbabweans now fear the possibility of violence during elections, a sharp drop from four-fifths recorded in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-fear-of-politically-motivated-violence-has-declined-research-by-continental-body-reveals/\">Zimbabweans’ fear of politically motivated violence has declined – research by continental body reveals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Nov 2025"
        },
        {
            "title": "Police investigating abduction of two CUT students during SRC election campaigns",
            "url": "https://www.newzimbabwe.com/police-investigating-abduction-of-two-cut-students-during-src-election-campaigns/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Republic Police (ZRP) says investigations are underway following the reported abduction of two Chinhoyi University of Technology (CUT) students, Lindon Zanga and Malvin Madanda.\n\nThe two, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi during Students Representative Council (SRC) election campaigns.\n\nAccording to ZINASU, Zanga and Madanda were seized by unidentified individuals driving an unmarked grey Isuzu vehicle, which had reportedly been seen on campus earlier distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nThe students were found 12 hours later, allegedly tortured and dumped in Shamva.\n\nIn a statement issued Wednesday, ZRP spokesperson Assistant Commissioner Paul Nyathi confirmed that investigations were in progress and appealed to the public for information that could assist in identifying the perpetrators.\n\nZRP confirms that investigations are being conducted in connection with the alleged abduction of Chinhoyi University of Technology students, Lindon Zanga (21) and Malvin Madanda (29), alias Saint, on 10th November 2025.\n\nZRP urges anyone with information on what actually transpired, as well as the possible location or identification of suspects involved in this incident, to contact any nearest police station or the CID Chinhoyi, Nyathi said.\n\nZINASU has accused Zanu PF Youth League Political Commissar Taurai Kandishaya of being involved in the incident, alleging that he was using state resources to suppress dissent and manipulate the outcome of the student elections.\n\nAfter their release, the two students said they were subjected to 12 hours of torture for allegedly chanting slogans against the ruling Zanu PF party during their SRC campaign activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11111935/CUT-ZINASU.jpeg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Republic Police (ZRP) says investigations are underway following the reported abduction of two Chinhoyi University of Technology (CUT) students, Lindon Zanga and Malvin Madanda. The two, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi during Students</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-investigating-abduction-of-two-cut-students-during-src-election-campaigns/\">Police investigating abduction of two CUT students during SRC election campaigns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Nov 2025"
        },
        {
            "title": "‘It’s their loss’: South African leader hits back at Trump’s decision to skip G20 summit",
            "url": "https://www.newzimbabwe.com/its-their-loss-south-african-leader-hits-back-at-trumps-decision-to-skip-g20-summit/",
            "content": "BBC\n\nSouth Africas President Cyril Ramaphosa says boycott politics doesnt work as he hit back at US President Donald Trumps decision to skip the G20 leaders summit in Johannesburg later this month.\n\nTrump has said that no US official would attend the gathering over widely discredited claims that white people are being persecuted in South Africa.\n\nSpeaking outside parliament, Ramaphosa said the USs absence is their loss and that the boycott would not prevent the meeting from going ahead, according to the AFP news agency.\n\nHe added that the US was giving up the very important role that they should be playing as the biggest economy in the world.\n\nThe G20 summit is taking place between 22-23 November but in a post on social media, Trump said it was a total disgrace that South Africa was hosting it.\n\nHe had earlier said South Africa should not be in the G20 at all, and that he would send Vice-President JD Vance, instead of attending himself.\n\nThen over the weekend, he doubled down on his claims that Afrikaners [people who are descended from Dutch settlers, and also French and German immigrants] are being killed and slaughtered, and their land and farms are being illegally confiscated.\n\nNo US government official will attend as long as these human rights abuses continue, he added.\n\nTrump has previously said that while he is trying to restrict the number of refugees the US accepts,Afrikaners would be welcome.\n\nRamaphosa said boycotting never achieves anything of great impact, because decisions will be taken that will move the various issues ahead, AFP reports.\n\nSouth Africa is the current chair of the G20 grouping of the worlds largest economies.\n\nThe forthcoming summit will mark the first time it takes place on African soil.\n\nEvery year, a different member state holds the G20 presidency and sets the agenda for the leaders summit, where they discuss the major economic issues of the day  with the US due to take over from South Africa.\n\nTrump is not the only leader set to skip the G20. Hi close ally, Argentinian President Javier Milei, has also indicated he will not attend but will instead send his Foreign Minister Pablo Quirno, AFP reports.\n\nSouth Africas government has said that claims of a white genocide are widely discredited and unsupported by reliable evidence.\n\nIt also says that no white farmers have seen their land confiscated without compensation.\n\n",
            "image_url": "https://www.newzimbabwe.com/wp-content/uploads/2019/01/Cryril-Ramaphosa.jpg",
            "description": "<p>BBC South Africa’s President Cyril Ramaphosa says “boycott politics doesn’t work” as he hit back at US President Donald Trump’s decision to skip the G20 leaders’ summit in Johannesburg later this month. Trump has said that no US official would attend the gathering over widely discredited claims that white people are being persecuted in South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-their-loss-south-african-leader-hits-back-at-trumps-decision-to-skip-g20-summit/\">‘It’s their loss’: South African leader hits back at Trump’s decision to skip G20 summit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Nov 2025"
        },
        {
            "title": "Zambia’s Hakainde Hichilema to make first official visit to Zimbabwe since taking office",
            "url": "https://www.newzimbabwe.com/zambias-hakainde-hichilema-to-make-first-official-visit-to-zimbabwe-since-taking-office/",
            "content": "By Thandiwe Garusa\n\nZambian President Hakainde Hichilema is scheduled to make his first visit to Zimbabwe this Friday for the inaugural session of the ZambiaZimbabwe Bi-National Commission (BNC), which he will co-chair with President Emmerson Mnangagwa.\n\nThis will be Hichilemas first official visit to Zimbabwe since he took office in 2021.\n\nThe high-level visit marks a new phase in bilateral relations between the two neighbouring countries, focusing on strengthening cooperation in trade, energy, transport, and other key sectors.\n\nIn a statement released Wednesday, Zambias Foreign Affairs Minister Mulambo Haimbe said the establishment of the BNC demonstrates the two Presidents shared commitment to deepening cooperation and advancing joint development efforts.\n\nDuring the visit, President Hichilema and President Mnangagwa will co-chair the inaugural session of the ZambiaZimbabwe Bi-National Commission (BNC), which upgrades the existing Joint Permanent Commission on Cooperation (JPCC) to a higher framework of strategic engagement, Haimbe said.\n\nThe establishment of the BNC underscores the shared vision of the two Heads of State to strengthen bilateral cooperation, accelerate joint infrastructure projects, and deepen economic integration between the two nations.\n\nThe Zambian government also described the visit as a reaffirmation of the deep and enduring bonds of friendship, shared history, and mutual respect that have long defined relations between Harare and Lusaka.\n\nThe meeting, however, comes amid strained diplomatic ties following the August 2023 elections in Zimbabwe, when election observers led by former Zambian Vice President Nevers Mumba said some aspects of the polls fell short of democratic standards.\n\nZimbabwes ruling party, Zanu PF, accused Zambia of interference, while tensions escalated further after President Mnangagwas remarks to Russian President Vladimir Putin, in which he expressed concern over Zambias growing alignment with Western powers.\n\nMnangagwa suggested that the United States was extending its influence in Zambia, potentially threatening regional stability.\n\nIn response, Zambia accused Zimbabwe of undermining its sovereignty and urged SADC and the African Union (AU) to intervene to defuse tensions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/11/07154036/Mnangagwa-Hichilema.jpeg",
            "description": "<p>By Thandiwe Garusa Zambian President Hakainde Hichilema is scheduled to make his first visit to Zimbabwe this Friday for the inaugural session of the Zambia–Zimbabwe Bi-National Commission (BNC), which he will co-chair with President Emmerson Mnangagwa. This will be Hichilema’s first official visit to Zimbabwe since he took office in 2021. The high-level visit marks</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambias-hakainde-hichilema-to-make-first-official-visit-to-zimbabwe-since-taking-office/\">Zambia’s Hakainde Hichilema to make first official visit to Zimbabwe since taking office</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Nov 2025"
        },
        {
            "title": "Magaya pursues removal from remand at the High Court",
            "url": "https://www.newzimbabwe.com/magaya-pursues-removal-from-remand-at-the-high-court/",
            "content": "By Mary Taruvinga\n\nProphetic Healing and Deliverance (PHD) Ministries founder Walter Magaya has approached the High Court seeking a review of a magistrates decision to place him on remand, arguing that his detention was unconstitutional and a grave miscarriage of justice.\n\nIn his application filed through Rubaya and Chatambudza Legal Practitioners, Magaya cited Harare regional magistrate Marewanazvo Gofa and the Prosecutor-General of Zimbabwe as respondents, accusing the lower court of acting without jurisdiction after he was detained beyond the 48-hour constitutional limit before being brought to court.\n\nThe 1st Respondents decision to entertain an application for placement of Applicant on remand is so manifestly irrational and grossly outrageous in its defiance of logic that no sensible court would arrive at it, Magaya said in his founding affidavit.\n\nHe argued that under Section 50(3) of the Constitution, any person detained beyond 48 hours must be released immediately and not subjected to further remand proceedings. Must means must, he stressed. The phrase must be released immediately is not merely directory but peremptory, creating a constitutional obligation that admits of no judicial discretion.\n\nMagaya is facing five counts of rape and 13 counts of fraud.\n\nHe said the State had conceded in court that he was detained beyond the lawful time limit, yet Magistrate Gofa still proceeded to place him on remand. This breach is not a matter of conjecture, he said. It is factual and borne out by the express and unequivocal concession of the State Counsel for the 2nd Respondent.\n\nHe described his arrest on November 1 as deeply troubling, claiming that a large contingent of heavily armed police officers descended upon me while I was engaged in prayer.\n\nMagaya accused the magistrate of brazenly subverting the Constitution by ruling that his remedy lay in suing for damages rather than being released, warning that such reasoning takes the criminal justice system back to the Lancaster House Constitution.\n\nBy transforming this clear constitutional command into a mere precursor to civil litigation, the 1st Respondent effectively rewrote the peoples will as expressed in the Constitution, he said. If unchecked, this arbitrary erosion of liberty will metastasise emboldening law enforcement agents to regard themselves as a law unto their own.\n\nThe cleric also attacked the magistrates reliance on the Agripa Mloyi v The State precedent, arguing it was wholly inapposite and that she ignored the more relevant Panganai Davison Madondo v The State judgment.\n\nMagaya further accused the Zimbabwe Gender Commission of manufacturing allegations against him through a public advert that solicited rape complaints. The subsequently complainants only emerged after this public invitation, he claimed.\n\nIn his draft order, Magaya seeks to have the magistrates ruling of November 4, 2025, set aside and for him to be removed from remand on all charges of rape and fraud.\n\nHe argues that the High Courts intervention is necessary to prevent continuing violations of his constitutional rights. The principle that you cannot put something on nothing, it will collapse, applies with equal force here, Magaya submitted.\n\nHe is represented by Admire Rubaya, Everson Chatambudza and Advocate Sylvester Hashiti.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Prophetic Healing and Deliverance (PHD) Ministries founder Walter Magaya has approached the High Court seeking a review of a magistrate’s decision to place him on remand, arguing that his detention was unconstitutional and “a grave miscarriage of justice.” In his application filed through Rubaya and Chatambudza Legal Practitioners, Magaya cited Harare regional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-pursues-removal-from-remand-at-the-high-court/\">Magaya pursues removal from remand at the High Court </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Nov 2025"
        }
    ]
}