{
    "news": [
        {
            "title": "Mnangagwa is panicking – says Sikhala, vows to spearhead resistance against ZANU PF’s 2030 agenda",
            "url": "https://www.newzimbabwe.com/mnangagwa-is-panicking-says-sikhala-vows-to-spearhead-resistance-against-zanu-pfs-2030-agenda/",
            "content": "By Darlington Gatsi\n\nDESPITE law enforcement officers foiling the launch of a campaign against the extension of President Emmerson Mnangagwas term, opposition leaders remain resolute in their stance against the amendment of the constitution by ZANU-PF.\n\nZimbabwe Republic Police officers stormed the SAPES Trust on Tuesday morning, clamping down on a scheduled address by Tendai Biti, Job Sikhala, Munyaradzi Gwisai, and Jacob Ngarivhume.\n\nThe opposition figures have initiated a resistance against ZANU-PFs plot to extend President Mnangagwas tenure to 2030, beyond its expiry in 2028.\n\nThe launch, however, suffered a major setback when a conference room at the SAPES Trust was petrolbombed by suspected state agents.\n\nSikhala said the move would not deter the opposition from fighting the extension of President Mnangagwas hold on office.\n\nIt shows the state of national panic as we are speaking here, you can see the riot police officers are now approaching here, demonstrating that the dictatorship is in panic. Zimbabweans do not panic, we are going to announce the next course of action after this, said Sikhala.\n\nThe recently adopted resolution by the ruling party at its just-ended conference in Mutare, to set legal wheels in motion for President Mnangagwa to stay beyond 2028, has ignited political tensions.\n\nWithin ZANU-PF, a clique backing Vice President Constantino Chiwenga is opposing the move to amend the constitution, rooting for the former army general to succeed Mnangagwa.\n\nWorld Council of Churches (WCC) programmes director, Kenneth Mtata, said the move to extend Mnangagwas term will have ripple effects on the countrys position in the global community.\n\nThe proposal to extend the presidential term will hurt Zimbabwe at many levels. Here are five main reasons\n\nFirst, it will undermine all the hard work of international re-engagement pursued since 2017. It will signal to global partners that Zimbabwe cannot be trusted to honour its own constitutional and democratic commitments.\n\nSecond, it will jeopardise the ongoing debt restructuring efforts. Third, this extension will discourage investment. Recently, Forbes magazine is said to have identified Zimbabwe as one of the most attractive tourist destinations. Investors would be wary of systems that change rules to suit political convenience. Policy inconsistency and instability will scare away the very capital needed for national economic recovery.\n\nFourth, the term extension will shatter the fragile social trust that had begun to form after years of political violence. Coercive force and intimidation would likely return to our national life in order to enforce such an unpopular measure. This will reopen old wounds and further divide communities once again.\n\nFifth, this decision will remove any chances of the President leaving a positive legacy. He will be classified with all those leaders remembered for clinging to power, rather than those honoured for serving with integrity and stepping aside with dignity, said Mtata.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Darlington Gatsi DESPITE law enforcement officers foiling the launch of a campaign against the extension of President Emmerson Mnangagwa’s term, opposition leaders remain resolute in their stance against the amendment of the constitution by ZANU-PF. Zimbabwe Republic Police officers stormed the SAPES Trust on Tuesday morning, clamping down on a scheduled address by Tendai</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-is-panicking-says-sikhala-vows-to-spearhead-resistance-against-zanu-pfs-2030-agenda/\">Mnangagwa is panicking – says Sikhala, vows to spearhead resistance against ZANU PF’s 2030 agenda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Zimbabwe agrees to give Zambia more water at Kariba after it exhausted its allocation",
            "url": "https://www.newzimbabwe.com/zimbabwe-agrees-to-give-zambia-more-water-at-kariba-after-it-exhausted-its-allocation/",
            "content": "ZIMBABWE has agreed to allow ZESCO to use more water from the Kariba Dam in order to generate additional electricity after the utility exhausted its 2025 water allocation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/04140213/Kariba-Dam.jpeg",
            "description": "<p>Kalemba ZIMBABWE has agreed to allow ZESCO to use more water from the Kariba Dam in order to generate additional electricity after the utility exhausted its 2025 water allocation. This follows Energy Minister Makozo Chikote’s request to Zimbabwe to increase ZESCO’s 2025 water allocation for the Kariba North Bank Power Station, after the company had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-agrees-to-give-zambia-more-water-at-kariba-after-it-exhausted-its-allocation/\">Zimbabwe agrees to give Zambia more water at Kariba after it exhausted its allocation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Zimbabwe harvests 578,000 tonnes of wheat, surpassing national demand",
            "url": "https://www.newzimbabwe.com/zimbabwe-harvests-578000-tonnes-of-wheat-surpassing-national-demand/",
            "content": "Milling MEA\n\nZIMBABWEhas recorded its highest-ever wheat output, harvesting 578,059 metric tonnes during the 2025 winter season, a milestone that not only exceeds last years record but also surpasses the countrys annual wheat requirement.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Anxious Masuka announced the achievement, describing it as a confirmation of Zimbabwes strengthened agricultural capacity and food self-sufficiency.\n\nThe country now joinsEthiopiaas one of only two African nations to have achieved full wheat self-sufficiency.\n\nFrom a modest volume of 94,685 metric tonnes in 2019, to 562,091 metric tonnes in 2024, Zimbabwe is only one of two jurisdictions on the African continent that have become wheat self-sufficient, said Masuka.\n\nHe added that this years production already surpasses our national annual requirement, estimated at 360,000 metric tonnes.\n\nMasuka noted that production continues to rise steadily, supported by expanded irrigation, input support, and government-backed mechanisation programmes.\n\nThe 2025 season saw 122,566 hectares planted to wheat, of which an additional 12,023 hectares were still to be harvested by early November. This marks a 511% increase from 2019 levels, a remarkable turnaround in just six years.\n\nThe expansion aligns with Zimbabwes broader strategy to reduce dependence on imports, especially following the global grain price spikes triggered by theRussiaUkraineconflict.\n\nWheatis the countrys second most important cereal after maize, and domestic self-sufficiency is seen as critical to stabilising food prices and strengthening food security.\n\nFocus on export opportunities and market stability\n\nWith domestic needs fully met, Zimbabwe is now seeking export opportunities within the region, particularly in neighboring countries that continue to face wheat shortages.\n\nHowever, Masuka emphasized that local supply remains secure and that the government has taken measures to stabilise pricing and ensure smooth distribution.\n\nThe government has released 6,518 metric tonnes to millers in recent weeks to stabilise supply and pricing levels of wheat products, he said, noting that the Agricultural Marketing Authority (AMA) continues to coordinate marketing and distribution to maintain market balance.\n\nDespite the surplus, Zimbabwe will continue importing limited volumes of high-gluten wheat, which is preferred by some millers for specific bread formulations.\n\nCertain millers have indicated that their mills and bread styles require high gluten content wheat not achievable in locally produced wheat, Masuka explained.\n\nAccording to him, as per current policy, such wheat will continue to be imported under existing arrangements, without any additional costs.\n\nThe government is urging registered millers and industry players to collaborate closely with authorities under the AMA framework to ensure a consistent balance between production, demand, and market stability.\n\nZimbabwes wheat success story reflects years of deliberate investment in irrigation infrastructure, farmer training, and private-sector partnerships.\n\nAccording to the Food and Agriculture Organization (FAO), sub-SaharanAfricastill imports over 80% of its wheat consumption, underscoring Zimbabwes rare achievement in the region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/17093132/60d3955786e36.image_.jpg",
            "description": "<p>Milling MEA ZIMBABWE has recorded its highest-ever wheat output, harvesting 578,059 metric tonnes during the 2025 winter season, a milestone that not only exceeds last year’s record but also surpasses the country’s annual wheat requirement. Lands, Agriculture, Fisheries, Water and Rural Development Minister Anxious Masuka announced the achievement, describing it as a confirmation of Zimbabwe’s strengthened</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-harvests-578000-tonnes-of-wheat-surpassing-national-demand/\">Zimbabwe harvests 578,000 tonnes of wheat, surpassing national demand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Businessman Fabris told to live with lawyer’s negligence as court slams bid to overturn US$500,000 default judgment",
            "url": "https://www.newzimbabwe.com/businessman-fabris-told-to-live-with-lawyers-negligence-as-court-slams-bid-to-overturn-us500000-default-judgment/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed businessman Luka Ignatius Fabriss bid to overturn a US$500,000 default judgment granted in favour of Tendai Mashamhanda, ruling that Fabris must face the consequences of his lawyers negligence.\n\nJustice Jacob Manzunzu threw out Fabriss application for rescission of judgment, which sought to undo the ruling granted after he failed to respond to Mashamhandas lawsuit over an unpaid loan, describing his explanation as unreasonable and his defence as devoid of bona fides.\n\nThe applicant cannot entirely put the blame on his erstwhile legal practitioner because he too had a lackadaisical approach towards the case, said Justice Manzunzu.\n\nHe went into a deep slumber only to be awakened by the execution in September 2024.\n\nFabris had borrowed US$500,000 from Mashamhanda in December 2021, agreeing to repay the sum by February 2022 with 1% monthly interest. When he defaulted, Mashamhanda sued and obtained a default judgment in May 2024 after Fabris and his lawyer ignored several letters and court notices.\n\nThe businessman argued that his former lawyer, Alex Mambosasa, failed to file a plea because he was in South Africa and had left the parties to negotiate an out-of-court settlement. But the court found that documents had been both emailed and hand-delivered to the lawyers office, which confirmed receipt, making the excuse untenable.\n\nNo reason is given to suggest he was not in wilful default, said Justice Manzunzu. With the advent of the IECMS system, absence from the country can no longer be an excuse for failure to file a plea. Technology allows a lawyer in South Africa to file court documents from that location.\n\nThe judge emphasised that there was a limit to how far courts could sympathise with litigants blaming their lawyers negligence.\n\nTime has come when our courts should be slow in sympathising with litigants who fail to comply with the rules due to lack of diligence by their legal representatives, he ruled. Applicant made his choice of a legal representative and he must stand by his choice.\n\nJustice Manzunzu also questioned Fabriss claim that he had a solid defence, noting that his earlier correspondence with Mashamhanda contained admissions of liability and proposals to settle the debt through shares in his mining company, Hotburn Minerals (Pvt) Ltd.\n\nThis is incongruent with a party who denies liability, the judge said. The applicants conduct shows wilfulness and absence of prospects of success.\n\nFinding the rescission application to be a mere delaying tactic, the judge ordered Fabris to pay costs on a higher scale, citing the respondents unnecessary expenses caused by Fabriss negligence.\n\nThe respondent has been put out of pocket by the applicants conduct, he said. The circumstances of this case warrant the granting of costs on a higher scale.\n\nThe ruling means the default judgment stands, and Mashamhanda may proceed with execution to recover the US$500,000 loan plus interest and legal costs from Fabris.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23060127/high-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed businessman Luka Ignatius Fabris’s bid to overturn a US$500,000 default judgment granted in favour of Tendai Mashamhanda, ruling that Fabris must face the consequences of his lawyer’s negligence. Justice Jacob Manzunzu threw out Fabris’s application for rescission of judgment, which sought to undo the ruling granted after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessman-fabris-told-to-live-with-lawyers-negligence-as-court-slams-bid-to-overturn-us500000-default-judgment/\">Businessman Fabris told to live with lawyer’s negligence as court slams bid to overturn US$500,000 default judgment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Zimbabwean national arrested for selling illegal medicines in Khayelitsha",
            "url": "https://www.newzimbabwe.com/zimbabwean-national-arrested-for-selling-illegal-medicines-in-khayelitsha/",
            "content": "Cape Argus\n\nA Zimbabwean national has been arrested, admitting he has been selling illegal medicine to the public which he has been hiding under his bed in Khayelitsha.\n\nThe polices Operation Shanela II received information from intelligence teams of suspected illegal activity taking place at a premises in Ilitha Park.\n\nOnce inside the house, police found quantities of illegal medicine hidden inside a bedroom.\n\nPolice spokesperson,Constable Ndakhe Gwala explained: On Wednesday, October 29, members of Operation Shanela II received intelligence of suspected illegal activity taking place at an address in Ilitha Park, Khayelitsha.\n\nThe members found a 42-year-old Zimbabwean male in the house. And during the search, they found large quantities of medicine hidden under the bed.\n\nThe suspect admitted that he sells the medicine to his fellow countrymen. He was then arrested for Contravention of Medicine and related substances Act 101 of 1995.\n\nThe suspect is detained at Harare SAPS, and once charged, he will appear in the Khayelitsha Magistrates court.\n\nThe arrest comes just as the, South Africa launched its National Action Plan (NAP)to address the persistent threat of substandard and falsified medical products, marking a significant step toward safeguarding public health, protecting peoples health across South Africa and beyond, and strengthening regulatory collaboration.\n\nIt was unveiled by the South African Health Products Regulatory Authority (SAHPRA) in partnership with the National Department of Health and the World Health Organization (WHO), the NAP addresses a crisis that continues to harm and claim countless lives.\n\nAccording to WHO data, at least one in ten medical products in low- and middle-income countries (LMICs), including South Africa, is substandard or falsified. This leads to severe health complications, treatment failures and thousands of preventable deaths annually.\n\nWHO said economically, rogue products cost global health systems an estimated US$ 30.5 billion each year and further deepen the financial burdens on South African households, already strained by rising healthcare costs and limited access to quality care.\n\nIn South Africa, where falsified and substandard medicines often masquerade as essential treatments for HIV, tuberculosis and chronic conditions, the NAPs three pillar strategy, grounded in prevention at borders, rapid detection in supply chains, and decisive response through enforcement, aims to protect vulnerable populations from this silent threat, WHO said via a statement issued.\n\nDr Boitumelo Semete-Makokotlela, CEO of SAHPRA added: Through unwavering collaboration, weve transformed a fragmented challenge into a unified front, ensuring that every family, from rural clinics to urban pharmacies, can access medicines they can trust. The NAP will not only detect and destroy fake products but empower communities to report threats, turning passive victims into active guardians of health.\n\nMinister of Health Dr Aaron Motsoaledi said in his keynote address on the issue: Fake medicines dont discriminate! They strike the poorest the hardest, stealing futures from our children and hope from our elders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29142553/illegal-medicines.jpg",
            "description": "<p>Cape Argus A Zimbabwean national has been arrested, admitting he has been selling illegal medicine to the public which he has been hiding under his bed in Khayelitsha. The police’s Operation Shanela II received information from intelligence teams of suspected illegal activity taking place at a premises in Ilitha Park. Once inside the house, police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-national-arrested-for-selling-illegal-medicines-in-khayelitsha/\">Zimbabwean national arrested for selling illegal medicines in Khayelitsha</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "ZETDC Managing Director suspended over power outage during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/zetdc-managing-director-suspended-over-power-outage-during-mnangagwas-sona/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Electricity Supply Authority (ZESA) has suspended Zimbabwe Electricity Transmission and Distribution Company (ZETDC) acting Managing Director Abel Gurupira pending investigations into recent power failures that occurred during key events, including President Emmerson Mnangagwas State of the Nation Address (SONA) in Parliament on Tuesday.\n\nGurupiras suspension follows the embarrassing incident in which Mnangagwa was forced to complete his SONA using torchlight after an unexpected blackout plunged the new Parliament Building into darkness.\n\nPower was restored approximately ten minutes later, just after Mnangagwa had concluded his address.\n\nFollowing the incident, Speaker of Parliament Jacob Mudenda hinted at possible sabotage, warning that the culprit will regret the day they were born.\n\nParliament later issued a statement explaining that during the event, the building was running on generator power, with ZESA electricity on standby. However, a circuit breaker supplying the load tripped, resulting in the blackout.\n\nIn an internal memo seen by this publication, ZESA Group Chief Executive Officer Cletus Nyachowe informed Gurupira of his immediate suspension pending a full investigation.\n\nI am hereby suspending you from duty pending investigations, following a spate of power outages prior to the commencement of the ZANU PF Conference in Mutare and during the State of the Nation Address in Parliament on the 28th of October 2025, Nyachowe wrote.\n\nThe correspondence stated that Gurupira would remain on full pay and benefits during the suspension period.\n\nDuring the period of suspension, you are not to communicate with any ZESA Holdings Group staff, Nyachowe added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16170029/ZETDC-Gurupira.jpeg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Electricity Supply Authority (ZESA) has suspended Zimbabwe Electricity Transmission and Distribution Company (ZETDC) acting Managing Director Abel Gurupira pending investigations into recent power failures that occurred during key events, including President Emmerson Mnangagwa’s State of the Nation Address (SONA) in Parliament on Tuesday. Gurupira’s suspension follows the embarrassing incident in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zetdc-managing-director-suspended-over-power-outage-during-mnangagwas-sona/\">ZETDC Managing Director suspended over power outage during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "30 Oct 2025"
        }
    ]
}