{
    "news": [
        {
            "title": "WATCH | ‘Where must my family do business – Zimbabwe?,’ asks SA Deputy President Mashatile",
            "url": "https://www.newzimbabwe.com/watch-where-must-my-family-do-business-zimbabwe-asks-sa-deputy-president-mashatile/",
            "content": "African Insider\n\nDeputy President Paul Mashatile has denied any political interference inawarding South Africas lucrative national lottery licence to Sizekhaya Holdings, whose shareholders include Bellamont Gaming.\n\nAccording toThe Citizen, Bellamont is co-owned by Moses Tembe and Khumo Bogatsu  Bogatsu is the twin sister of Mashatiles wife, raising concerns over potential conflict of interest.\n\nSizekhaya was granted the licence for eight years, amid public scrutiny and fears of patronage, especially as Bellamont was registered just nine months prior, the report said.\n\nIn an interview withSowetan Times, Mashatile insisted he had no role in the process and says its unfair to accuse his relatives of wrongdoing simply due to their association with him.\n\nThere are so many people who know me in this country  family, children, cousins and friends. Where must they do business? In Zimbabwe? Out of this country?  Mashatile asked on Tuesday.\n\nThey can do business, as long as Im not involved, not because they know me. Because once you say Mr Mashatile is capable of influencing, even if he is sitting in his house, its unfair. You must be able to say he went there to interfere.\n\nThe deputy president stressed that only Trade and Industry Minister Parks Tau had the authority to select the winning bidder.\n\nTau announced Sizekhaya as the winner on 28 May after a lengthy evaluation process and has since promised Parliament that any allegations of conflicts of interest will be investigated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26052403/Paul-Mashatile_Cropped_Twitter_GovernmentZA.jpg",
            "description": "<p>African Insider Deputy President Paul Mashatile has denied any political interference in awarding South Africa’s lucrative national lottery licence to Sizekhaya Holdings, whose shareholders include Bellamont Gaming. According to The Citizen, Bellamont is co-owned by Moses Tembe and Khumo Bogatsu — Bogatsu is the twin sister of Mashatile’s wife, raising concerns over potential conflict of interest.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-where-must-my-family-do-business-zimbabwe-asks-sa-deputy-president-mashatile/\">WATCH | ‘Where must my family do business – Zimbabwe?,’ asks SA Deputy President Mashatile</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "Zimbabwe set to make Women’s Championship debut during New Zealand tour",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-to-make-womens-championship-debut-during-new-zealand-tour/",
            "content": "ESPN\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22053346/lady-chevrons.jpeg",
            "description": "<p>ESPN Zimbabwe will begin their quest to qualify for the Women’s ODI World Cup for the first time in their history when they tour New Zealand for a white-ball series in February-March 2026. The three ODIs on the tour, scheduled for March 5, 8 and 11 in Dunedin, will be Zimbabwe’s debut in the ICC Women’s Championship, the primary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-to-make-womens-championship-debut-during-new-zealand-tour/\">Zimbabwe set to make Women’s Championship debut during New Zealand tour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "Diddy prosecutors drop kidnapping and arson claims, narrowing racketeering charge in final days of trial",
            "url": "https://www.newzimbabwe.com/diddy-prosecutors-drop-kidnapping-and-arson-claims-narrowing-racketeering-charge-in-final-days-of-trial/",
            "content": "IndependentUK\n\nFederal prosecutors narrowed the racketeering conspiracy charges againstSean Diddy Combs, removing the claims of arson and kidnapping Wednesday justone day before closing argumentsbegin in the blockbuster sex trafficking trial.\n\nThemusic mogul faces five federal counts of racketeering conspiracy, sex trafficking and transportation to engage in prostitution. Hes pleaded not guilty.\n\nUnder the racketeering conspiracy charge, prosecutors accusedDiddy in the indictmentof creating a criminal enterprise whose members and associates engaged in, and attempted to engage in, among other crimes, sex trafficking, forced labor, kidnapping, arson, bribery, and obstruction of justice.\n\nIn a letter to the court, the government proposed dropping three theories related to the racketeering conspiracy charge as a way to streamline jury instructions. They still intend to pursue the racketeering charge but removed instructions related to attempted kidnapping, attempted arson and aiding and abetting sex trafficking.\n\nThe Government is no longer planning to proceed on these theories of liability so instructions are no longer necessary, prosecutors wrote in the letter.\n\nFederal prosecutors narrowed the racketeering charge against Diddy in final stage of trial (REUTERS)\n\nAll of the five federal charges against Diddy remain.\n\nThe move comes after Alexandra Shapiro, one of the 55-year-old moguls defense attorneys, passionately argued in court on Tuesdayfor a judgment of acquittal on all counts.She claimed there were deficiencies to each count and then walked through each charge, outlining why it should be dropped.\n\nShapiro argued that two of the three of the governments examples of kidnapping were insufficient.\n\nIn one kidnapping allegation, Capricorn Clark, Diddys former employee, testified about being driven by Diddys then-head of security to a dilapidated building where she was subjected tolie detector tests for five daysin a row. If she failed, a man told her she would be thrown in the East River, she testified. But Shapiro argued there was no evidence that Diddy knew this was happening or that a co-conspirator had kidnapped her.\n\nSean Diddy Combs hugs his lawyer Nicole Westmoreland as he enters the courtroom during Combs sex trafficking trial in New York City, New York, U.S., June 16, 2025. (Reuters)\n\nThe arson allegation stems from a claim by Scott Mescudi, better known as Kid Cudi, thatDiddy firebombed his Porschein early 2012 after he discovered the rapper had dated his longtime girlfriend Cassie Ventura. Shapiro argued that there was no evidence that her client was involved, noting that Mescudi didnt witness the incident. She added that there was female DNA found on the bottle used for the Molotov cocktail.\n\nProsecutors plan to focus the racketeering conspiracy charges instead on proving forced labor and sex trafficking.\n\nThe judge said he would reserve a decision on the defenses motion. Closing arguments are set to begin Thursday morning.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>IndependentUK Federal prosecutors narrowed the racketeering conspiracy charges against Sean “Diddy” Combs, removing the claims of arson and kidnapping Wednesday just one day before closing arguments begin in the blockbuster sex trafficking trial. The music mogul faces five federal counts of racketeering conspiracy, sex trafficking and transportation to engage in prostitution. He’s pleaded not guilty. Under the racketeering</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diddy-prosecutors-drop-kidnapping-and-arson-claims-narrowing-racketeering-charge-in-final-days-of-trial/\">Diddy prosecutors drop kidnapping and arson claims, narrowing racketeering charge in final days of trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "‘Not in Our Name’ – South African artists condemn Gayton McKenzie’s xenophobic tirade",
            "url": "https://www.newzimbabwe.com/not-in-our-name-south-african-artists-condemn-gayton-mckenzies-xenophobic-tirade/",
            "content": "IOL Entertainment\n\nActress Thandi Sebe has joined a growing chorus of South African artists condemning Minister of Sports, Arts and Culture,Gayton McKenzie,for spreading Afrophobic hate speech.\n\nIn a recent post on Instagram, Sebe said: As the South African Constitutional Court turns 30, we as South African artists call upon our leaders to protect the ideals of our beautiful constitution that guarantee the promise of a South Africa that belongs to all who live in it.\n\nWe condemn the hateful vitriol that the Minister for Arts and Culture spews about foreign citizens living in this country. We unequivocally condemn his tirades and say: Not in Our Name.\n\nMcKenzie came under firefollowing recent remarks targeting the employment of two Zimbabweans by the Market Theatre.\n\nHe is reported to have said: some of you here have the audacity to hire foreigners instead of South Africans; I dont care how you used to do it. But for as long as I am the minister, there will be no foreigner that will work in an entity while a South African can do the same thing; and foreigners employed bygovernment departmentsneeded to be out in three weeks I said it, I want them out, get them out.\n\nSebe went on to demand accountability from politicians, urging them to honour the constitution of the country.\n\nOther artists participating in the condemnation included Rafeeqah Galant, Marc Lottering, Hakeem Kae-Kazim, Mike van Graan, Tshamano Sebe, Rea Rangaka, Liza Scholtz, Lesedi Kolotsi, Matthew Griffiths, Ace Marcus, Liyema Duze, Mzu Ntantiso, Thandi Sebe, Rameez Cassiem, Danica Jones and Mihlali Kope.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/24011832/Minister-of-Sport-Arts-and-Culture-Gayton-Mackenzie-Picture-Ayanda-Ndamane-Independent-Media-File.webp",
            "description": "<p>IOL Entertainment Actress Thandi Sebe has joined a growing chorus of South African artists condemning Minister of Sports, Arts and Culture, Gayton McKenzie, for spreading Afrophobic hate speech. In a recent post on Instagram, Sebe said: “As the South African Constitutional Court turns 30, we as South African artists call upon our leaders to protect the ideals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-in-our-name-south-african-artists-condemn-gayton-mckenzies-xenophobic-tirade/\">‘Not in Our Name’ – South African artists condemn Gayton McKenzie’s xenophobic tirade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "Prince Dube’s Young Africans lift Tanzanian League Title",
            "url": "https://www.newzimbabwe.com/prince-dubes-young-africans-lift-tanzanian-league-title/",
            "content": "By Sports Reporter\n\nPrince Dubes club, Young Africans, on Wednesday afternoon won the NBC Tanzania Premier League trophy after beating rivals and fellow contenders Simba SC 2-0 in the final match of the season.\n\nThe title marks Prince Dubes first league title in his professional career, which started at Highlanders.\n\nYoung Africans lifted the league trophy with a record 82 points, four ahead of Simba SC, who finished on 78 points.\n\nWinning the title will see Yanga representing Tanzania in the coming 2025-26 Total CAF Champions League season.\n\nDube joined Young Africa in July last year after a three-year stint with another Tanzanian side, Azam FC.\n\nSince joining Yanga, the Zimbabwean forward has managed to score 14 league goals and three more in the CAF Champions League.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26045208/Screenshot-2025-06-26-at-05.50.42.png",
            "description": "<p>By Sports Reporter Prince Dube’s club, Young Africans, on Wednesday afternoon won the NBC Tanzania Premier League trophy after beating rivals and fellow contenders Simba SC 2-0 in the final match of the season. The title marks Prince Dube’s first league title in his professional career, which started at Highlanders. Young Africans lifted the league</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prince-dubes-young-africans-lift-tanzanian-league-title/\">Prince Dube’s Young Africans lift Tanzanian League Title</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "26 Jun 2025"
        },
        {
            "title": "Sixteen killed, hundreds injured, in antigovernment Kenyan protests",
            "url": "https://www.newzimbabwe.com/sixteen-killed-hundreds-injured-in-antigovernment-kenyan-protests/",
            "content": "Agencies\n\nAt least 16 people have been killed in nationwide rallies against police brutality and government corruption in Kenya, according to Amnesty International and the Kenya National Commission on Human Rights.\n\nAnother 400 people were injured on Wednesday, including protesters, police and journalists. The casualties included people hit by live fire and others who were wounded by rubber bullets, or were beaten, and were primarily in the Kenyan capital, Nairobi.\n\nDemonstrators had clashed with police, who hurled tear gas canisters and wielded batons. The protests mark one year since people stormed parliament at the peak of antigovernmentdemonstrations.\n\nThousands took to the streets to commemorate last years youth-led demonstrations against tax rises, during which at least 60 people were killed by security forces, according to rights groups.\n\nAmong the crowds in the capital, some waved Kenyan flags and placards with pictures of demonstrators killed last year and chanted Ruto must go, referring to President William Ruto, whose proposed tax hikes triggered last years youth-led protests.\n\nIve come here as a Kenyan youth to protest. It is our right for the sake of our fellow Kenyans who were killed last year. The police are here  they are supposed to protect us, but they kill us, Eve, a 24-year-old woman, told the AFP news agency.\n\nIt is extremely important that the young people mark June 25th because they lost people who look like them, who speak like them  who are fighting for good governance, said Angel Mbuthia, chair of the youth league for the opposition Jubilee Party.\n\nProtesters also gathered in various other parts of the country, including in the town of Matuu, approximately 100km (62 miles) from the capital, where there were reports of clashes.\n\nPolice blocked main roads leading into the capitals central business district, while government buildings were barricaded with razor wire.\n\nThe government ordered TV and radio stations to halt live coverage of the protests.\n\nNetBlocks, a global internet tracker, said social media platform Telegram had been restricted. And Kenyan broadcaster KTN was taken off the air later on Wednesday, a senior official at its parent company, Nation Media Group, said.\n\nAl Jazeeras Malcolm Webb, reporting from Nairobi, said protests across the country have been met with a lot of violence by the police.\n\nAbout a dozen people have been treated for gunshot wounds, he said, citing local media reports.\n\nKenyas Citizen TV reported that protesters torched court facilities in Kikuyu on the outskirts of Nairobi.\n\nIsolated clashes were reported in the port city of Mombasa, according to NTV, with protests also in the towns of Kitengela, Kisii, Matuu and Nyeri.\n\nThe anniversary comes amid soaring anger aboutpolice brutality, particularly after 31-year-old blogger and teacher, Albert Ojwang, was killed in custody earlier this month following his arrest for criticising a senior officer.\n\nSix people, including three police officers, were charged with murder on Tuesday for Ojwangs killing. They have all pleaded not guilty.\n\nPolice have said protests are permitted as long as they are peaceful and unarmed.\n\nBut a group of peaceful protesters was attacked last week by a large gang of motorbike-riding goons, as they are known in Kenya, armed with whips and clubs and working in tandem with the police.\n\nOn Tuesday, the embassies of the United States, the United Kingdom, Canada, and other Western nations released a joint statement on X urging all involved to facilitate peaceful demonstrations and to refrain from violence.\n\nThe use of plain clothed officers in unmarked vehicles erodes public trust, the statement said. Rights campaigners condemned the presence of unidentified police officers at protests last year.\n\nKenyas Ministry of Foreign Affairs said in a statement late on Tuesday that any policing violations would be addressed through government institutions, including the parliament and the judiciary.\n\nThe ministry reminds all that diplomatic partnerships flourish best in mutual respect, open channels and a recognition of each others unique governance contexts, it said.\n\nThere is also growing resentment among young people towards Ruto, who came to power in 2022, promising rapid economic progress.\n\nMany have been disillusioned by continued stagnation, corruption and high taxes, even after last years protests forced Ruto to cancel an unpopular finance bill. His government has been at pains to avoid direct tax rises this year.\n\nBut the frequent disappearances of government critics  rights groups have counted more than 80 since last years protests, with dozens still missing  have led many to accuse Ruto of returning Kenya to the dark days of its dictatorship in the 1980s and 90s.\n\nRuto previously promised an end to abductions but was unapologetic in a speech on Tuesday, pledging to stand by the police.\n\nYou cannot use force against the police or insult, or threaten the police, he warned protesters. You are threatening our nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26042000/AFP__20250625__63PB84A__v2__HighRes__TopshotKenyaUnrestPolitics-1750838089.webp",
            "description": "<p>Agencies At least 16 people have been killed in nationwide rallies against police brutality and government corruption in Kenya, according to Amnesty International and the Kenya National Commission on Human Rights. Another 400 people were injured on Wednesday, including protesters, police and journalists. The casualties included people hit by live fire and others who were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sixteen-killed-hundreds-injured-in-antigovernment-kenyan-protests/\">Sixteen killed, hundreds injured, in antigovernment Kenyan protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "26 Jun 2025"
        }
    ]
}