{
    "news": [
        {
            "title": "Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion",
            "url": "https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/",
            "content": "By Alois Vinga\n\nZIMBABWEs total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year.\n\nThe unsustainable debt continues to choke Zimbabwes capacity to unlock external funding, with local debt being criticised for crowding out the private sector.\n\nPresenting the 2025 Mid-Term Budget Review Thursday, Finance Minister Mthuli Ncube said the debt stock comprises local and external debt.\n\nIn US$ terms, the total PPG debt as at end March 2025, amounted to US$21.5 billion, comprising external debt stock of US$12.6 billion and domestic debt stock of US$8.9 billion. This brings the debt-to-GDP ratio to 44% as at 31 March 2025, he said.\n\nIn local currency terms, the countrys stock of Public and Publicly Guaranteed (PPG) debt stood at ZiG576.5 billion as at the end of March 2025. The debt was external debt totalling ZiG337.7 billion, and domestic debt amounting to ZiG238.8 billion, representing 58.6% and 41.4% respectively.\n\nThe external and domestic debt arrears as at end March 2025 amounted to US$7.8 billion, constituting 36% of total PPG debt. The accumulation of arrears since the year 2000 have been worsening the country`s debt situation, constraining access to external concessional financing.\n\nIn this regard, the government is implementing the Arrears Clearance and Debt Resolution Roadmap in order to restore debt sustainability and unlock critical external financing needed for the countrys development programs, he said.\n\nDomestic debt service in local currency totalled ZiG1.64 billion, comprising both principal and interest payments during the period January to June 2025.\n\nDuring the period January to June 2025, Treasury made payments amounting to US$176.28 million for external debt service, which includes US$93.72 million towards the active portfolio, US$79.75 million for legacy debts and US$2.81 million of token payments to the International Financial Institutions and the sixteen Paris Club Bilateral Creditors.\n\nOf this, ZiG39.52 million was paid towards interest payments and ZiG1.60 billion for principal payments related to ZiG-denominated Treasury Bills and bonds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01093427/mthuli-1.jpg",
            "description": "<p>By Alois Vinga ZIMBABWE’s total debt stock has surged to US$21.5 billion, rising by an estimated US$1 billion from the official figures disclosed during the same period last year. The unsustainable debt continues to choke Zimbabwe‘s capacity to unlock external funding, with local debt being criticised for crowding out the private sector. Presenting the 2025</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mid-term-budget-review-zimbabwes-debt-stock-hits-us21-5-billion/\">Mid-term Budget Review: Zimbabwe’s debt stock hits US$21.5 billion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        },
        {
            "title": "UK: Diaspora Insurance hosts Zimbabwe Embassy outreach for passports and other consular services",
            "url": "https://www.newzimbabwe.com/uk-diaspora-insurance-hosts-zimbabwe-embassy-outreach-for-passports-and-other-consular-services/",
            "content": "By UK Correspondent\n\nLONDON: THE Zimbabwe Embassy in the UK will next week take its outreach programme to the West Midlands, allowing Zimbabweans in the region to apply for passports and access other consular services.\n\nAccording to a notice from the embassy, the outreach will be hosted byDiaspora Insuranceat its global headquarters in Birmingham from Tuesday (05/08/25) to Thursday (07/05/25).\n\nServices available include passports, child registration, temporary travel documents, as well as police clearance.\n\nService is on first come first serve basis. No appointment is required. We look forward to meeting you soon for seamless Consular services, the embassy said in its public notice.\n\nThe global risk solutions specialist firm will host the embassy at Diaspora Insurance House, Parklands Business Centre, Parklands Business Park,Birmingham B45 9PZ.\n\nCommenting on the development, a company representative said, We are pleased to host the Zimbabwe Embassys consular services outreach programme.\n\nProviding a platform for such essential services not only helps facilitate easier access to consular assistance but also demonstrates our commitment to serving the needs of the Zimbabwean community here.\n\nWe look forward to continuing this collaboration and working together to ensure that our community members receive the support and services they deserve.\n\nFrom Birmingham, the outreach programme will also take in the Channel Islands of Jersy and Gurnsey towards the end of August.\n\nMeanwhileDiaspora Insurancesaid its head office is available not just to the Zimbabwe community but all the 20 African nationalities the company covers across the globe.\n\nEstablished more than 14 years ago,Diaspora Insurancehas grown exponentially over the years with its bespoke funeral cash plan product providing critical financial intervention which ensures Africans in the Diaspora do not endure the indignity of GoFundMe appeals to deal with end-of-life expenses.\n\nWith no medicals asked, African transnational citizens can cover themselves in the Diaspora as well as family back home with a product that removes the double trauma of bereaving a loved one while also begging for financial assistance to help with funeral costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31170830/Diaspora-Insurance-House.png",
            "description": "<p>By UK Correspondent LONDON: THE Zimbabwe Embassy in the UK will next week take its outreach programme to the West Midlands, allowing Zimbabweans in the region to apply for passports and access other consular services. According to a notice from the embassy, the outreach will be hosted by Diaspora Insurance at its global headquarters in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-diaspora-insurance-hosts-zimbabwe-embassy-outreach-for-passports-and-other-consular-services/\">UK: Diaspora Insurance hosts Zimbabwe Embassy outreach for passports and other consular services</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        },
        {
            "title": "Mid-term Budget Review: Despite just 35% expenditure, Finance Minister Mthuli Ncube declares ZWG3.3 billion surplus",
            "url": "https://www.newzimbabwe.com/mid-term-budget-review-despite-just-35-expenditure-finance-minister-mthuli-ncube-declares-zwg33-billion-surplus/",
            "content": "By Alois Vinga\n\nDespite the fact that just 35% of the 2025 National Budget allotted funds were spent six months into the year, Finance Minister Mthuli Ncube declared a ZWG3.3 billion budget surplus in theMid-Term Budget Review Statement.\n\nPresenting the much-awaited Mid-Term Budget Review Statement, Thursday themed,Building Resilience for Sustained Economic Transformation, the Treasury boss confirmed earlier speculation that much of the allotted resources are rarely disbursed efficiently\n\nFiscal outlays for the period January to June 2025 amounted to ZWG98 billion, which is approximately 35.5% of the approved Budget. Recurrent expenditures were ZWG74.4 billion, while financial and non-financial assets (capital expenditure and net lending) amounted to ZWG23.6 billion, he said.\n\nOf this amount, more than half with ZWG45.4 billion, went towards employment costs and operations ZWG18.8 billion, interest payments paltry at ZWG2.5 billion and capital expenditure, including devolution, amounted to ZWG23.6 billion, leaving very few resources for capital expenditure.\n\nHowever, speaking to the media shortly after the budget presentation, Ncube defended the 35% expenditure to slower drawdowns by Ministries in the first quarter of the year.\n\nMinistries often take time to put their papers in order and we often experience limited revenue inflows during the first parts of the year which partly explains the expenditure patterns. However, we are currently working on improving ways in which expenditures can improve, he said.\n\nNcube said during the years first half, Treasury mobilised resources for budget financing totalling ZWG1.3 billion, including US$90 million Treasury Bills, through the issuance of domestic securities.\n\nIn US dollar terms, the fiscal framework translates to revenues of US$7.5 billion and expenditures of US$7,7 billion, as well as a budget deficit of US$168.4 million.\n\nHe said during the first half of the year 2025, both inflation and exchange rate were relatively stable than envisaged. The budget has, therefore, been performing below target in local currency terms, although performance was significantly above target in foreign currency terms.\n\nRevenue collections during the period amounted to ZWG101.2 billion against a target of ZWG118.1 billion, whilst expenditures were ZiG98 billion against a target of ZWG127.5 billion.\n\nOn a cash accounting basis, a budget surplus of ZWG3.3 billion was recorded during the first six months of the year.\n\nNcube added that drastic reforms aimed at improving the ease of doing business and the eradication of multiple licensing fees would be aggressively implemented in the second half.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/24150814/Mthuli-1-e1669302803739.png",
            "description": "<p>By Alois Vinga Despite the fact that just 35% of the 2025 National Budget allotted funds were spent six months into the year, Finance Minister Mthuli Ncube declared a ZWG3.3 billion budget surplus in the  Mid-Term Budget Review Statement. Presenting the much-awaited Mid-Term Budget Review Statement, Thursday themed, “Building Resilience for Sustained Economic Transformation”, the Treasury</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mid-term-budget-review-despite-just-35-expenditure-finance-minister-mthuli-ncube-declares-zwg33-billion-surplus/\">Mid-term Budget Review: Despite just 35% expenditure, Finance Minister Mthuli Ncube declares ZWG3.3 billion surplus  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        },
        {
            "title": "Police officer jailed for pocketing US$15 bribe",
            "url": "https://www.newzimbabwe.com/police-officer-jailed-for-pocketing-us15-bribe/",
            "content": "By Staff Reporter\n\nA ZVISHAVANE-based police officer has been sentenced to imprisonment for demanding and receiving a bribe from a motorist.\n\nAbel Musimeki (35) was convicted at the Zvishavane Magistrates Court and sentenced to 16 months in jail.\n\nOf the sentence, four months were suspended for five years on condition of good behaviour, while a further two months were set aside on condition he restitutes the victim. He will, therefore, serve an effective 10 months imprisonment.\n\nCourt heard that on September 19, 2024, at Ruswa Complex in Mandava township, Zvishavane, the offender, who was based at ZRP Milton Park in Harare, stopped a Toyota Fun Cargo alleging it was improperly registered.\n\nMusimeki ordered the driver to locate the owner of the vehicle, Edwin Rangarirai Mahosi, an auto electrician.\n\nIt was further heard that, upon meeting Mahosi, the offender misrepresented that he was on an official vehicle licensing operation and threatened to impound the car unless he was bribed. Out of fear, the complainant handed over US$15.\n\nThe prosecutor told the court that, after consulting a friend, Mahosi grew suspicious and reported the matter to police, who tracked down and nabbed Musimeki.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said law enforcement officers have an obligation to maintain the trust of the public.\n\nLaw enforcement officers are entrusted with upholding the law and not abusing their authority for personal gain.\n\nThis conviction reinforces the NPAZs commitment to rooting out corruption and maintaining public trust in the justice delivery system, NPAZ noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Staff Reporter A ZVISHAVANE-based police officer has been sentenced to imprisonment for demanding and receiving a bribe from a motorist. Abel Musimeki (35) was convicted at the Zvishavane Magistrates’ Court and sentenced to 16 months in jail. Of the sentence, four months were suspended for five years on condition of good behaviour, while a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-jailed-for-pocketing-us15-bribe/\">Police officer jailed for pocketing US$15 bribe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        },
        {
            "title": "There was no mind or will of God – Mai Guti speaks on turning down Chivayo’s Land Cruiser, US$250,000 gift",
            "url": "https://www.newzimbabwe.com/there-was-no-mind-or-will-of-god-mai-guti-speaks-on-turning-down-chivayos-land-cruiser-us250000-gift/",
            "content": "By Staff Reporter\n\nEunor Guti, widow of the late ZAOGA founder and Archbishop Professor Ezekiel Guti, has spoken out on her decision to reject a brand-new 2025 Toyota Land Cruiser VXR 300 Series and US$250,000 in cash gift from controversial tenderpreneur Wicknell Chivayo.\n\nThe offer, made in May and publicised by Chivayo on his social media platforms, was framed as a tribute to the late Archbishop Ezekiel Guti. Chivayo stated that the vehicle had been fully paid for and was ready for delivery, pending approval by the churchs governing board.\n\nOrdinarily, I would say, please go and see Farai, but Farai from Faramatsi Motors, Club Chambers Showroom, along 4th Street, will come to you and deliver your 2025 brand new Toyota Land Cruiser 300 Series VXR, which is fully paid for and ready for delivery, subject to the Churchs Governing Boards consent. Furthermore, please accept USD250,000 in CASH for fuel and your personal use, he wroteon his social media pages.\n\nHowever, Guti said accepting the gift would have been a betrayal of her values and those of her late husband.\n\nThere was no mind or will of God in it, she told her congregation during a recent address.\n\nThey can use that money somewhere else. We dont want it,not even for our church projects.\n\nThe gesture sparked division among church leaders, with some urging her to accept and others warning it would damage the churchs reputation due to the questionable origins of Chivayos wealth.\n\nSomeone I dont even know was sent to plead with me to accept the offer, she recounted.\n\nThis man was very serious, trying to push me into accepting. I told him I needed to pray, but I already knew I was going to say no.\n\nGuti said she informed the Day-to-Day Board at ZAOGAs headquarters that she would not accept the Land Cruiser, explaining that she already owned one and saw no need for a new vehicle.\n\nShe added, We have never seen our father receiving that kind of money. How can we start doing that now?\n\nWere not desperate. We will not take money we do not understand.\n\n\"        ..       ,     ,\"      '  pic.twitter.com/dIXSSJPxJi\n\n NewZimbabwe.com (@NewZimbabweCom)July 30, 2025\n\nGuti said the church was recently approached with a separate offer of US$2 million by another individual. She turned that down as well, saying it did not align with what she felt was Gods will.\n\nChivayo, known for flaunting luxury car donations to clergy and politicians, has remained a polarising figure due to his links to questionable state tenders and source of wealth.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/06081323/eunor-guti.jpg",
            "description": "<p>By Staff Reporter Eunor Guti, widow of the late ZAOGA founder and Archbishop Professor Ezekiel Guti, has spoken out on her decision to reject a brand-new 2025 Toyota Land Cruiser VXR 300 Series and US$250,000 in cash gift from controversial tenderpreneur Wicknell Chivayo. The offer, made in May and publicised by Chivayo on his social</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/there-was-no-mind-or-will-of-god-mai-guti-speaks-on-turning-down-chivayos-land-cruiser-us250000-gift/\">There was no mind or will of God – Mai Guti speaks on turning down Chivayo’s Land Cruiser, US$250,000 gift</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        },
        {
            "title": "Mnangagwa’s online stormtroopers target women who speak out",
            "url": "https://www.newzimbabwe.com/mnangagwas-online-stormtroopers-target-women-who-speak-out/",
            "content": "The Varakashi are using anonymous and fake accounts to mock, delegitimise and threaten opposition to the ruling ZANU PF party.\n\nZimbabwes brutal regime, under President Emmerson Mnangagwa, is using social media, particularly X, to smear and silence mostly female anti-government political activists and human rights defenders in the country.\n\nPresident Mnangagwas army of paid pro-government social media trolls is known as theVarakashipropaganda stormtrooperswith some using names of prominent people to open fake X accounts without their knowledge. One ghostX account usesthe name of Zimbabwes former vice president, Joice Mujuru. Even President Mnangagwas spokesperson, George Charambawho is also a senior government employee runs two toxic ghost X accounts@Jamwanda2and@dhonzamusoro007which he uses to attack and post completely fabricated and malicious information about female human rights defenders and political activists in Zimbabwe. The first of these accounts wassuspended in 2022but was reinstated after Elon Musk acquired Twitter and renamed it X.\n\nIn the past year there has been a proliferation of toxic X accounts in the country and they are flourishing. At times, these X accounts incite physical and sexual violence against female political and human rights activists. In one post, a ghost X account threatened a prominent human rights activist that [Im] waiting to rape you. The post drew outrage from X users, and it was later deleted.\n\nAnd in astudy published in 2023, Constance Kasiyamhuru from the University of Johannesburg in South Africa said the Varakashi in Zimbabwe operate mostly on Twitter/X to shut down the political opponents of the governing Zanu PF party.\n\nThrough trolling, name-calling, threats, mocking, mobbing, labelling, ridicule, casting aspersions, delegitimation, disinforming, and other strategies, Varakashi seek to regulate, censure, and discipline anti-musangano[anti-ruling party] online discourse, Kasiyamhuru wrote.\n\nTendai Ruben Mbofana, a Zimbabwe based social justice advocate and writer, said the systematic deployment of online trollsparticularly targeting female human rights defenders and political activistshas become a chilling hallmark of repression in Zimbabwe.\n\nThese smear campaigns are not just personal attacks; they are part of a broader strategy to delegitimise our work, intimidate us into silence, and discredit our credibility in the eyes of the public, Mbofana said.\n\nHe added that the abuse often takes on a deeply misogynistic tone, laced with gendered insults, threats of sexual violence, and false accusations designed to shame and isolate women.\n\nIt creates a climate of fear and forces many women out of digital spaces that should otherwise be used to amplify their voices and advocacy, he said.\n\nSophia Gwasira, who was elected as the first female mayor for Mutare City in eastern Zimbabwe in August 2023, told Index on Censorship that the fear of being smeared and attacked on social media platforms by Zanu PF social media trolls was forcing many women to abandon opposition politics and activism. She said social media platforms were no longer safe places for women in opposition politics in Zimbabwe, with the attackes affecting both them and their families.\n\nIts affecting us not only physically but emotionally too. We are trying to find ways of countering these attacks. But currently we dont have any protection from our own political parties or from the government, Gwasira said.\n\nBut Gwasira said she will continue to fight for the people and, given the opportunity, she would contest the general elections slated for 2028. Gwasira and many other opposition mayors, MPs and councillors were recalled in late 2023 after her party, the Citizens Coalition for Change (CCC)was hijackedby President Mnangagwas ruling party Zanu PF through its proxy, Sengezo Tshabangu. This forced the CCC leader Nelson Chamisa toabandon the oppositionparty and he took a sabbatical from party politics in January 2024.\n\nPromise Mkwananzi, spokesperson for opposition party Citizens Coalition for Changewhich is still loyal to former leader Nelson Chamisa told Index on Censorship that as opposition, they have been identifying and exposing some of these social media ghost accounts and to direct their members to counter the toxic narratives on X.\n\nIt must be noted also that these trolls are paid using taxpayers money to denigrate women and bully voices of the alternative on social media, Mkwananzi said.\n\nBut Mkwananzi was quick to add that his party will continue to fight and mobilise people for a better Zimbabwe.\n\nWe are also educating our members to be strong and to remain focused on recruiting mobilising, educating and radicalising the base.\n\nAlthough women are the main target, men critical of the ruling party are also targeted.\n\nIn my own experience, I have faced repeated, coordinated attacks on X, particularly from anonymous accounts believed to be run or supported by high-ranking government officials, including the presidents spokesperson. These attacks are aimed at silencing dissent and discouraging public engagement. But we will not be silenced. If anything, these attacks only reinforce the urgency of our work, said Tendai Ruben Mbofana Mbofana.\n\nWhen President Mnangagwaseized powerthrough a military coup from Zimbabwes long-time dictator, Robert Mugabe in 2017, President Mnangagwa promised sweeping reforms; economic and political reforms, including upholding human rights and rule of law in the country.\n\nHowever, Zimbabwe has become worse under President Mnangagwa than Mugabe; political opponents to Zanu PF have been brutalised,torturedandkilledand corruption is widespread.\n\nA recent reportby Human Rights Watch said authorities in Zimbabwe have continued to restrict civic space and the rights to freedom of expression, association, and peaceful assembly and the human rights, political and economic situation in Zimbabwe continues to deteriorate.\n\nUnder the current constitution, President Mnangagwas term of officehis second and last termends in 2028 but his party is now planning to amend the constitution to keep him in office till 2030. Meanwhile, Mnangagwas Varakashi are flooding social media with messages in support of the extension of his term and touting his achievements so far.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Andrew Mambondiyani | Index on Censorship The Varakashi are using anonymous and fake accounts to mock, delegitimise and threaten opposition to the ruling ZANU PF party. Zimbabwe’s brutal regime, under President Emmerson Mnangagwa, is using social media, particularly X, to smear and silence mostly female anti-government political activists and human rights defenders in the country.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-online-stormtroopers-target-women-who-speak-out/\">Mnangagwa’s online stormtroopers target women who speak out</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        },
        {
            "title": "Defence Minister to pay US$25,000 compensation to 2018 August 1 shooting victim",
            "url": "https://www.newzimbabwe.com/defence-minister-to-pay-us25000-compensation-to-2018-august-1-shooting-victim/",
            "content": "By Thandiwe Garusa\n\nDEFENCE Minister Oppah Muchinguri has been ordered to pay US$25,000 in compensation to Zakeo Mutimutema, a victim of the 2018 August 1 army shootings.\n\nMutimutema sustained serious eye injuries from shattered glass caused by bullets fired by soldiers during the 2018 post-election protests following a delay in releasing the Presidential poll results by the Zimbabwe Electoral Commission.\n\nHe worked for the Zimbabwe Congress of Trade Unions (ZCTU) and live shots were fired at a building which housed their offices.\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR), which helped Mutimutema sue Muchinguri, Cultural Heritage Minister Hon. Kazembe Kazembe, and ZRP Commissioner-General Stephen Mutamba for damages, said the victim was initially awarded ZWL$295,000 in November 2020, which was unpaid and lost value due to inflation.\n\nThe labour law specialist had to undergo three unsuccessful eye surgeries to remove fine glass particles that pierced his eyes after a bullet fired by soldiers shattered glass windows at his ZCTU offices.\n\nMutimutema, who was represented by Obey Shava of ZLHR, had initially been awarded ZWL$295,000 as damages in November 2020 as damages for pain and suffering, medical expenses and general damages which Muchinguri, Kazembe and Mutamba had reneged on paying.\n\nThe labour law specialist had to file an application wherein he amended his summons, arguing that the compensation award had been significantly eroded by inflation.\n\nOn Tuesday 29 July 2025, Mutimutema was a relieved man after Muchinguri agreed to pay the labour law specialist US$25,000 as compensation for damages for current and future medical expenses, pain and suffering and general damages, ZLHR said.\n\nAt least six people were shot dead by soldiers during the protest.\n\nA Commission of Inquiry, chaired by former South African President Kgalema Motlanthe and appointed by President Emmerson Mnangagwa to probe the post-election violence, recommended that government should compensate all the victims of the shootings and prosecute perpetrators.However, there has been no prosecution of perpetrators.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/13122619/oppah-kazembe-e1712810265882.jpg",
            "description": "<p>By Thandiwe Garusa DEFENCE Minister Oppah Muchinguri has been ordered to pay US$25,000 in compensation to Zakeo Mutimutema, a victim of the 2018 August 1 army shootings. Mutimutema sustained serious eye injuries from shattered glass caused by bullets fired by soldiers during the 2018 post-election protests following a delay in releasing the Presidential poll results</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defence-minister-to-pay-us25000-compensation-to-2018-august-1-shooting-victim/\">Defence Minister to pay US$25,000 compensation to 2018 August 1 shooting victim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        },
        {
            "title": "‘Impossible not to be emotional’: How Ian Prior came out of retirement to help Zimbabwe end Rugby World Cup drought",
            "url": "https://www.newzimbabwe.com/impossible-not-to-be-emotional-how-ian-prior-came-out-of-retirement-to-help-zimbabwe-end-rugby-world-cup-drought/",
            "content": "By Francisco Isaac | Rugby Pass\n\nBy 2024,Ian Priorhad basically done it all. Hed been a professional player for 14 years. Hed won a Super Rugby title with the Reds, played in the Premiership with Harlequins, captained the WesternForceand played for the Perth franchise over 100 times.\n\nWith his Force contract expiring, Prior had decided to bring down the curtain on his rugby career. Fate, though, had other ideas. A year later, he stood on a Ugandan pitch with aZimbabweshirt on his torso, back-to-back Rugby Africa Cup titles won andRugby World Cupqualification secured.\n\nFor many players, taking a call from the Zimbabwe Rugby Union with an invitation to help the bid to reachAustralia2027 mightnt be reason enough to abandon retirement plans. But Prior, born in Perth to Zimbabwean parents, could not resist the opportunity. The utility back lived in Zimbabwe between 1993 and 2000 and has never forgotten what the country means to him.\n\nI had always dreamed of going back, Prior tells RugbyPass. Zimbabwe was and is a beautiful country, and I enjoyed a wonderful life growing up there. The wildlife, the freedom, and holidaying around Lake Kariba and the Zambezi River. I experienced so many great moments there. It left a deep imprint on my heart.\n\nFirst and foremost, the people from Zimbabwe are the most special part of the country. They are resilient, adaptable and even in the hardest of times they find a way to make it all work. Of course, the wildlife and the landscape are majestic as well, there arent many places in the world you get to enjoy things like Lake Kariba.\n\nPrior did not immediately leap at the Zimbabwean unions advances.\n\nAt the end of the day it comes down to what your values are, he reflects. My parents and sister were born in there, I grew up there as well, and I had the opportunity to make a difference. For me it was enough to motivate me to get involved.\n\nIt meant a lot to my family. They were born in what was Rhodesia at the time, grew up in it and then became part of Zimbabwe, devoting their lives to it. So, for me, it was a special occasion to represent my country as I got to represent my familys history and heritage. It was such a great honour, and in the end, I presented the Rugby Africa Cup final game jersey to my parents. It was the best way to honour them and to honour the love they have for Zimbabwe.\n\nI remember praying for another chance when Swanepoel was taking that last shot.\n\nWith memories from the past floating back, Prior recalls how he played barefoot rugby and cricket in Zimbabwe, and how these early carefree days were the start of his sports journey.\n\nMy dad actually tells a pretty funny story. After my first rugby training session, I got home, and I was looking a bit disappointed. My parents could tell and asked what happened, and I explained I was going to play lock for my schools D team.\n\nMy father thought it was a bit strange, as I was always playing rugby with my neighbours, and had some skills, but told me it was okay and to just keep working hard and have fun. I played that first game, and after a week, I came back home saying that I had been picked for the main team as a half-back and captain. My parents thought I was lying. It was a big 180.\n\nZimbabwe defeated Namibia in successive African finals. Last year was supposed to be a transitional campaign as the Sables built towards a shot at reaching the World Cup. Sinking one of their biggest and oldest rivals changed everyones perspectives.\n\nMost of our boys had never won against Namibia, and they were sweating throughout the whole week thinking about that game, Prior says. However, the game came, and we started to make little inroads here, a line break there, win a scrum, and the team thought we can do this. We started believing it was more than viable for us to win. It was the catalyst for what came next.\n\nWith silverware bagged, the Sables had jumped into centre stage and were viewed as one of the two favourites for the Africa World Cup qualification spot. After successfully beating Morocco and Kenya, they were in the final with Namibia again serving as the last obstacle. Zimbabwe surged into a 14-point lead, but Namibia roared back to within two, before Tiaan Swanepoels 79th-minute penalty fell. Zimbabwe clung on to win an epic final 30-28, ending a 34-year wait for a World Cup berth.\n\nIt had a bit of everything, didnt it? Prior says. We switched off for a period, and the game became completely unpredictable. I was trying to come up with solutions and a plan, a drop goal or setting up a penalty. I remember praying for another chance when Swanepoel was taking that last shot. Fortunately for us, it was short, and we were able to hang on until the end.\n\nPriors own story is all the more remarkable since he gave up the pro game at club level last year. He amassed 52 points and assisted five tries in the African tournament, and was named most valuable player.\n\nI remember back in January thinking to myself, how am I going to do this? How am I going to be on the same level as I was before? My life was 100% different, I had a full-time job, which meant training outside of working hours. I have a family now and so many otherresponsibilities. So, with all these questions, I set a high goal: to be the player of the tournament. I wanted to qualify Zimbabwe for the World Cup. I was willing to put in the work.\n\nBut couldnt Prior go abroad and tune up in Japan, the USA, France or somewhere else?\n\nI remember we came into 2024 with no warm-up games, just two weeks of camps and won it. So, imagine what we can do if we invest a bit more.\n\nI had some offers overseas, mainly from the MLR and Japan, but I didnt want to shake up things at home, as my kids were starting school and my wife had a good position as a dietitian in the Western Australian Institute of Sport. It felt really selfish for me to change everything. It turned out to be the right time to see what the next chapter would be. I am currently working as a leadership, resilience and crisis management consultant. It has been an exciting new chapter of my life.\n\nHis efforts to honour his family, friends, teammates and country were successful and that recognition as player of the Rugby Africa Cup was welcomed with joy.\n\nI got quite emotional when my name was read out. Everything just came together. I remember walking up to the stage, and I was crying. It was impossible not to beovercome with emotion, especially when I had doubts that I could perform at that level again six months before the Africa Cup.\n\nWe had heaps of videos of people supporting us coming through. We were emotional to see how Zimbabweans all over the world were supporting us. It was such a proud day for all of us, especially after what the country went through in the early 2000s.\n\nPrior firmly believes a new dawn awaits Zimbabwean rugby.\n\nIf we get some good funding and get the right pathway model set up, focus on developing more new players, and if we can nurture it in the right way, the sky is the limit. We won back-to-back Rugby Africa Cups without the same resources other teams had. I remember we came into 2024 with no warm-up games, just two weeks of camps and won it. So, imagine what we can do if we invest a bit more.\n\nTheres a considerable expectation for Prior to keep going and be available for selection when Australia 2027 arrives. Hell be 36 when the competition begins, but the allure of playing at a World Cup in his homeland is powerful.\n\nIt would be a lie if I said I wasnt happy with what I achieved until now. But the chance to play a home World Cup, with the possibility of Perth, my home town, hosting one of the games, is too big for me to pass up. On top of that, theres also the chance of Zimbabwe setting up camp in Perth. I will do everything in my power to keep my body going, my skills sharp and contribute in whichever way I can. I want to show my kids that no matter what your dreams are, if you put in the work, you can achieve them. Everything is possible.\n\nPriors skills as a leader and a voice of belief and confidence are deeply recognised by his teammates. He praises Pieter Benade, Zimbabwes head coach, and how he has propelled his squad to an historic achievement.\n\nPieter is a wonderful human being. He is authentic, cares deeply about the jersey and Zimbabwes rugby culture. The closer we got to the final, the more emotional he got when presenting the jerseys, telling a short story to each player. Thats the guy you want to play for. Thats the guy you are willing to put your head in a dark spot for. He cares about us, and that made a difference.\n\nPrior reflects with a degree of disbelief on all he has done in the game, knowing there may well be more still to do.\n\nIf you told this young boy running around the fields that he would be playing for the junior Wallabies, captaining the Western Force in Super Rugby, and helping his heritage nation to qualify for a World Cup, I wouldve laughed at you. For me, it is all pretty surreal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30161752/ian-prior.jpg",
            "description": "<p>By Francisco Isaac | Rugby Pass By 2024, Ian Prior had basically done it all. He’d been a professional player for 14 years. He’d won a Super Rugby title with the Reds, played in the Premiership with Harlequins, captained the Western Force and played for the Perth franchise over 100 times. With his Force contract expiring, Prior had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/impossible-not-to-be-emotional-how-ian-prior-came-out-of-retirement-to-help-zimbabwe-end-rugby-world-cup-drought/\">‘Impossible not to be emotional’: How Ian Prior came out of retirement to help Zimbabwe end Rugby World Cup drought</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "31 Jul 2025"
        }
    ]
}