{
    "news": [
        {
            "title": "Trump wields axe over ‘Democrat Agencies’ as shutdown blame game rages",
            "url": "https://www.newzimbabwe.com/trump-wields-axe-over-democrat-agencies-as-shutdown-blame-game-rages/",
            "content": "BBC\n\nPresident Donald Trump has said he and his budget director will work out which Democrat Agencies to cut as the US government shutdown approached its third day.\n\nHe suggested Republicans should seize the opportunity to clear out dead wood and gave no hint of concessions to Democratic demands that legislation funding the government should include healthcare insurance subsidies.\n\nRepublicans and Democrats on Capitol Hill, meanwhile, continued to blame each other for failing to keep federal agencies open.\n\nHundreds of thousands of federal workers are staying home, while others worked without pay. Some federal attractions closed to visitors while others, including the Statue of Liberty, stayed open.\n\nAnalysts dont expect either side to budge without pressure from everyday Americans, most of whom have yet to feel direct impacts on their lives.\n\nIt was unclear exactly what Trump could decide in Thursdays meeting with Russell Vought, director of the US Office of Management and Budget (OMB).\n\nWhen Congress fails to keep the US government open, the OMB director works with the president to pick which government activities should stop and which are essential.\n\nIt then gives directions to federal agencies about which employees to place on furlough, which means unpaid leave.\n\nOn the first day of the shutdown, Vought said the White House had moved to pause or cancel billions of dollars in funding meant for Democratic states, including $18bn (13.4bn) in infrastructure projects in New York  home of both Senator Chuck Schumer and the Democratic leader of the House of Representatives, Hakeem Jeffries.\n\nBoth sides must come together to pass legislation if the government is to reopen.\n\nRepublicans need eight Democratic senators to vote with them, while Democrats need 13 Republicans to side with them. Only three Democrats joined with Republicans on the last failed vote in the Senate on Wednesday.\n\nLawmakers are expected to try again on Friday afternoon to resolve the impasse with a vote in the Senate.\n\nRepublicans want to pass a funding measure without anything else attached, but Democrats want to include a renewal of health insurance subsidies for low-income individuals set to expire at the end of the year.\n\nIn duelling press conferences on Capitol Hill on Thursday, neither party appeared willing to give ground.\n\nHouse Speaker Mike Johnson called Democrats selfish, dubbed it the Democrat shutdown, and said he would not negotiate on adding insurance subsidies  or other measures  to government funding.\n\nJeffries accused Republicans of not wanting to provide working-class Americans with healthcare and said Trumps threats to fire more federal workers were pointless. He noted: They have been firing federal employees all along.\n\nLee Miringoff, director of the Marist University Institute for Public Opinion, said his polling suggested Americans were largely split down party lines when it came to assigning fault for the shutdown.\n\nMajorities of both Democratic and Republican respondents to his polls blamed the other party for the shutdown, he said, while 41% of independents said both parties shared the blame equally.\n\nBoth of the parties have mastered the finger-pointing, and all were left with is a growing number of people think the country is headed in the wrong direction, Miringoff said.\n\nHe expected Americans to put pressure on Congress to reopen the government  but not until they see the impact of a shutdown on their own lives.\n\nAs politicians traded barbs, US government services started to grind to a halt and thousands of federal workers stayed home.\n\nAbout 750,000 federal workers were expected to take unpaid leave, according to an estimate from the Congressional Budget Office (CBO).\n\nFederal employees deemed essential continued to work, though without pay. They include more than 200,000 law enforcement officers.\n\nAir traffic controllers and Transportation Security Administration (TSA) workers are considered essential, so air travel will not immediately be affected.\n\nDuring the last shutdown these employees increasingly began to call in sick, leading to some delays at major airports.\n\nTourists were turned away from museums in Washington and New York, including at Federal Hall in Manhattan.\n\nA manager told the BBC the building was closed like other federal monuments.\n\nGeorge Washington, the first US president, took the oath of office there in 1789. Now a museum, the historic building also was home to the first Congress and Supreme Court.\n\nBut not all monuments are closed.\n\nElsewhere in New York, the Statue of Liberty and Ellis Island remained open, thanks to the leadership of President Donald J Trump, a Department of the Interior spokesperson told the BBC.\n\nThe Smithsonian, which includes more than a dozen museums and attractions that drew nearly 17 million visitors last year, told the BBC it had enough money to stay open for a week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/03060922/donal-trump.webp",
            "description": "<p>BBC President Donald Trump has said he and his budget director will work out which “Democrat Agencies” to cut as the US government shutdown approached its third day. He suggested Republicans should seize the opportunity to “clear out dead wood” and gave no hint of concessions to Democratic demands that legislation funding the government should</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-wields-axe-over-democrat-agencies-as-shutdown-blame-game-rages/\">Trump wields axe over ‘Democrat Agencies’ as shutdown blame game rages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "03 Oct 2025"
        },
        {
            "title": "Parliament: Mutodi demands Finance Ministry PS Guvamatanga be summoned over alleged multimillion-dollar contractor bribes",
            "url": "https://www.newzimbabwe.com/parliament-mutodi-demands-finance-ministry-ps-guvamatanga-be-summoned-over-alleged-multimillion-dollar-contractor-bribes/",
            "content": "By Costa Nkomo\n\nThe Chairperson of the Parliamentary Portfolio Committee on Budget and Finance, Energy Mutodi, has demanded that the Permanent Secretary in the Ministry of Finance, George Guvamatanga, be summoned by Parliament to clear his name following allegations of corruption involving alarming sums in dealings with contractors.\n\nMutodi told Parliament on Thursday that Guvamatanga is allegedly demanding kickbacks of between five and ten percent from contractors, with the threat that their payments will not be processed if they fail to comply.\n\nHe added that Guvamatanga has allegedly made millions through corruption and has repeatedly refused to appear before Parliament when called upon to clear his name, all without any consequences.\n\nMutodi said it is high time Guvamatanga is invited to explain himself, as his actions are tarnishing Zimbabwes reputation.\n\nOur Government cannot be tarnished by the actions of corrupt and greedy people who occupy public office. I therefore urge this House to ensure that we call the Permanent Secretary of the Ministry of Finance, Mr. George Guvamatanga to come and appear before this August House and answer charges of corruption, answer charges of asking to be paid a five to ten percent premium by contractors and all payments made by the Treasury.\n\nWe have made several attempts to call George Guvamatanga to appear before this August House and he has deliberately refused with impunity. This cannot continue, Mutodi said.\n\nHe added that Guvamatangas conduct is now deterring contractors who are no longer interested in providing services to the government, because they fear being asked to pay kickbacks.\n\nMutodi further stated that every government employee, including Permanent Secretaries from all ministries, is accountable to the Parliament of Zimbabwe and therefore must be held to account and answer questions.\n\nIn terms of Section 119 (3) of the Constitution of Zimbabwe, all MDAs, including the Ministry of Finance, the Permanent Secretary and all directors in that office are accountable to Parliament. For that reason, these permanent secretaries, the directors and different officials in these ministries are not undertaking their own personal businesses in those offices but they are being delegated by us because it is us who are elected by the people.\n\nActing Speaker of the National Assembly, Naledi Maunganidze, said the Minister of Finance, Professor Mthuli Ncube, will be made to respond to Parliament.\n\nYesterday, Mutodi took to X, accusing Guvamatanga of sending mercenaries to intimidate him and anyone else who raises corruption issues involving his name.\n\nCorruption is rampant in Zimbabwe, with Vice President Constantino Chiwenga describing it as a national security threat.\n\nAccording to figures cited by National Prosecutor General Justice Matanda-Moyo, Zimbabwe is losing a staggering US$2 billion annually due to corruption and illicit financial dealings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Costa Nkomo The Chairperson of the Parliamentary Portfolio Committee on Budget and Finance, Energy Mutodi, has demanded that the Permanent Secretary in the Ministry of Finance, George Guvamatanga, be summoned by Parliament to clear his name following allegations of corruption involving alarming sums in dealings with contractors. Mutodi told Parliament on Thursday that Guvamatanga</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-mutodi-demands-finance-ministry-ps-guvamatanga-be-summoned-over-alleged-multimillion-dollar-contractor-bribes/\">Parliament: Mutodi demands Finance Ministry PS Guvamatanga be summoned over alleged multimillion-dollar contractor bribes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "03 Oct 2025"
        },
        {
            "title": "ZHRC urges government to strengthen social security for older persons",
            "url": "https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution.\n\nOlder persons human rights have long been overlooked due to perceptions of being non-productive, yet many remain active contributors.\n\nCommemorating the International Day of Older Persons (IDOP), which was celebrated under the theme Older Persons Driving Local and Global Action: Our Aspirations, Our Well-Being and Our Rights, the ZHRC urged the government to prioritise their well-being and rights.\n\nThe ZHRC calls on the government of Zimbabwe to domesticate and implement provisions of the AU Protocols protecting the rights of older persons it is partyto.\n\nIn particular, the commission urges the government to avail resources for the provision of social security for older persons, including meaningful pensions so that retired people do not become destitute, ZHRC said in a statement Thursday.\n\nThe African Union (AU) adopted protocols on the rights of older persons (2016) and on social protection and security (2022), both of which Zimbabwe ratified in 2024.\n\nFurthermore, the government of Zimbabwe enacted progressive laws that protect the rights and entitlements of older persons, which advance the rights of older persons to human dignity, appropriate care facilities, provision of social protection through harmonised cash transfers, food deficit mitigation programmes, assisted treatment orders, prevention of age-based discrimination, and protection from abuse, neglect and exploitation of all forms.\n\nDespite all these legislative steps, older persons in Zimbabwe still encounter obstacles in fully accessing their constitutional rights and benefits.\n\nDespite these positive legislative measures, older persons in Zimbabwe continue to face barriers to the enjoyment of their constitutional rights and entitlements.\n\nChallenges in this regard include discrimination of older persons within their family environments and in public spaces, age-based stereotyping including accusations of witchcraft directed at older women in particular, limited access to health care, inadequate social protection, prolonged isolation and loneliness, neglect and in some instances outright abuse by relatives or caregivers.\n\nThese challenges are compounded by limited or ineffective enforcement of laws that protect older persons from violations of their fundamental rights and entitlements, ZHRC added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/05055346/Old-woman.jpg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution. Older persons’ human rights have long been overlooked due to perceptions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/\">ZHRC urges government to strengthen social security for older persons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "03 Oct 2025"
        },
        {
            "title": "Zimbabwe left with only one qualified forensic pathologist – Health Minister",
            "url": "https://www.newzimbabwe.com/zimbabwe-left-with-only-one-qualified-forensic-pathologist-health-minister/",
            "content": "By Anna Chibamu\n\nZimbabwe is grappling with a critical shortage of forensic pathologists, a situation driven by brain drain and a lack of interest among doctors to specialise in the field, Health Minister Douglas Mombeshora told Parliament on Wednesday.\n\nResponding to questions during a Q&A session, Mombeshora revealed that the country currently has only one qualified forensic pathologist, creating major challenges in conducting post-mortems, particularly in murder cases.\n\nHis remarks came after Citizens Coalition for Change (CCC) MP Lynett Karenyi asked about government policy regarding medico-legal post-mortem examinations and the requirement for bodies to be transported from across Zimbabwe to Harare for assessment.\n\nOf late, there have been challenges with postmortems, especially forensic. These specialised procedures are indeed conducted by forensic pathologists who possess distinct training and expertise beyond that of general pathologists.\n\nApparently, we do not have enough forensic pathologists in the country. We have only one qualified forensic pathologist at the moment. We have relied on recruiting from outside the country, Mombeshora said.\n\nThe Health Minister added that the shortage of specialists has left the government struggling to meet demand, stressing that addressing the skills gap remains urgent hence government has recruited three forensic pathologists from Cuba.\n\nWe are all aware that we have had a challenge of brain drain. At some stage, we had more than three in the country who were trained.\n\nAlso, it is a department or a speciality where we have not really seen interest in our own doctors to specialise in. As a result, we have not had enough pathologists, Mombeshora added.\n\nThe minister said the just-recruited Cuban forensic pathologists started work on Wednesday, October 1.\n\nThese will actually help us in terms of carrying out forensic postmortems.\n\nAs a result, it was very difficult for one forensic pathologist to move around the country and in other hospitals, especially our district hospitals, Mombeshora added.\n\nHe told the august house that the mortuaries were not equipped with the requisite equipment needed to carry out forensic pathology.\n\nAs a result, dead bodies have to be moved either to Sally Mugabe, Parirenyatwa or Chitungwiza in Harare and the same in Bulawayo, Mpilo Hospital or United Bulawayo Hospitals (UBH).\n\nThe pathologists will then give days to go to Bulawayo or do pathology examinations here in Harare. We hope that the incoming of the three new forensic pathologists will make their job much easier and enable them to go to other provincial hospitals where the equipment is available and carry out those pathology examinations.\n\nAsked by another legislator what government would do to stop the exodus of healthcare professionals, Mombeshora responded, We now have the Health Service Commission in place and they are working on incentives for various sectors in the medical field to see if we can come up with incentives including improved salaries, incentives of those who are working outside metropolitan areas so that we can stop the brain drain and have our own people working here instead of relying on foreign experts.\n\nHe added, We hope that by next year, we will be training more and then in the coming four years, that is when we may see more forensic pathologists coming out.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Anna Chibamu Zimbabwe is grappling with a critical shortage of forensic pathologists, a situation driven by brain drain and a lack of interest among doctors to specialise in the field, Health Minister Douglas Mombeshora told Parliament on Wednesday. Responding to questions during a Q&A session, Mombeshora revealed that the country currently has only one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-left-with-only-one-qualified-forensic-pathologist-health-minister/\">Zimbabwe left with only one qualified forensic pathologist – Health Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "03 Oct 2025"
        },
        {
            "title": "Mansions, 5 000 cattle and a weekly US$200,000 kickback! Mutodi claims Guvamatanga making a killing as Finance Ministry permanent secretary",
            "url": "https://www.newzimbabwe.com/mansions-5-000-cattle-and-a-weekly-us200000-kickback-mutodi-claims-guvamatanga-making-a-killing-as-finance-ministry-permanent-secretary/",
            "content": " says Parliament has received reports and proposes lifestyle audit\n\nBy Leopold Munhende\n\nTHE Chairperson of Parliaments Portfolio Committee on Budget, Finance, and Economic Development, Energy Mutodi has made sensational claims that Finance Ministry Permanent Secretary George Guvamatanga is getting kickbacks of as much as US$200,000 from government contractorsso asto facilitate payments.\n\nAccording to Mutodi, Parliament received complaints about how Guvamatanga has been managing affairs, and further alleged that he was demanding kickbacks from other ministries and government departments of between 5% and 10% for every treasury disbursement.\n\nMutodi claims Guvamatangas loot now exceeds US$1 billion and adds onto an empire that includes several mansions and 5,000 dairy cattle.\n\nThe Parliament of Zimbabwehas received agonising reports that Guvamatanga is receiving 5%-10% for every payment done by the Treasury. GG as he is notoriously called has accumulated more thanUS$1 billion becoming the richest civil servant, said Mutodi.\n\nContractors, Ministries and Departments refusing to pay Guvamatanga a kick back of at least 5% after receiving Treasury payments have been denied payments for several months even if the funds are budgeted for.\n\nOver the past six months, Parliament itself has struggled to operate after being denied its budgeted funds by George Guvamatanga. A civil servant earning less than $1000 GG has more than 5000 dairy cattle, dairy equipment and several mansions hence the proposed lifestyle audit.\n\nOnecontractor Bitumen which was contracted to do roads has been asked to pay US$200,000 byGuvamatangafor every $2,000,000 weekly payment he authorises that theyreceive and they have made several complaints tomembers of the Budget Committee at Parliament.\n\nGuvamatanga was earlier this year accused of receiving bribes from shadowy businessman Wicknel Chivayo to approve payments to the controversialRen-Form CC, a South African company that supplied Zimbabwe Electoral Commission (ZEC) with voting material at highly inflated prices.\n\nPresident Emmerson Mnangagwa is said to have fired and forgiven him in June this year before he begged for the job he has kept since 2018.\n\nAZanu PF Member of Parliament (MP) for Bikita South, Mutodiclaimed Guvamatanga had made threats to deal with him if the committee was to ever seek a lifestyle audit or engage the Zimbabwe Anti-Corruption Commission (ZACC).\n\nHe added: Guvamatangahas also made threats to senda terror team to deal with the(me)upon hearing that the Committee was considering carrying out a life audit on him as well as asking for a ZACC probe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>– says Parliament has received reports and proposes lifestyle audit By Leopold Munhende THE Chairperson of Parliament’s Portfolio Committee on Budget, Finance, and Economic Development, Energy Mutodi has made sensational claims that Finance Ministry Permanent Secretary George Guvamatanga is getting kickbacks of as much as US$200,000 from government contractors so as to facilitate payments. According to Mutodi,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mansions-5-000-cattle-and-a-weekly-us200000-kickback-mutodi-claims-guvamatanga-making-a-killing-as-finance-ministry-permanent-secretary/\">Mansions, 5 000 cattle and a weekly US$200,000 kickback! Mutodi claims Guvamatanga making a killing as Finance Ministry permanent secretary</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "03 Oct 2025"
        }
    ]
}