{
    "news": [
        {
            "title": "Top Tshabangu Aide Jailed Over US$20K Bribe",
            "url": "https://www.zimeye.net/2025/09/15/tshabangu-councillor-jailed/",
            "content": "By A Correspondent  Citizens Coalition for Change (CCC) Ward 26 CouncillorMpumelelo Moyo, aligned with Sengezo Tshabangus faction, has been jailed after being convicted of soliciting a bribe from investors.\n\nBulawayo Provincial Magistrate Richard Ramaboea sentenced Moyo to 18 months in prison, with six months suspended, leaving him to serve 12 months behind bars.\n\nMoyo, who chaired the powerful Bulawayo Finance and Development Committee, was found guilty of demanding a US$20 000 bribe from Labenmon Investments to facilitate approval of land earmarked for a cement plant in Cowdray Park.\n\nThe State proved that Moyo persistently pressured company representative Tsitsi Nyathi, demanding the payment in exchange for clearing the deal. He was arrested in a Zimbabwe Anti-Corruption Commission (ZACC) sting operation, caught red-handed receiving the money at Nyathis home.\n\nWhile Deputy Mayor Edwin Ndlovuwho had initially been charged alongside Moyowas acquitted for lack of evidence, prosecutors maintained that Moyo was the central figure in the bribery scheme surrounding the 5.6-hectare land deal.\n\nMoyos conviction throws fresh scrutiny on the faction led by Sengezo Tshabangu, the self-proclaimed CCC interim secretary-general.\n\nVirtually unknown before 2023, Tshabangu thrust himself into the spotlight after spearheading controversial recalls of CCC MPs and councillors, claiming legal authority over the party. His actions, widely seen as a ZANU-PF-sponsored ploy to cripple the opposition, cost the CCC control of several municipalities and parliamentary seats.\n\nDespite limited grassroots support, Tshabangu secured legal recognition in Parliament, enabling him to pursue the recalls that fragmented the opposition.\n\nMoyos role as a trusted ally and committee chair made him a key player in Tshabangus strategy to entrench influence in Bulawayos opposition structures. Analysts argue that his corruption conviction not only dents the CCCs credibility but also exposes the murky networks underpinning Tshabangus rise.\n\nIn mitigation, Moyos lawyer Prince Butshe pleaded for leniency, citing his clients status as a first-time offender and family breadwinner. He suggested a wholly suspended six-month sentence with community service at Emganwini Clinic.\n\nHowever, Magistrate Ramaboea dismissed the plea, stressing that corruption undermines public trust in governance and demanded a deterrent punishment.\n\nWith Moyo behind bars, the ruling underscores both the seriousness of Zimbabwes corruption scourge and the precarious politics swirling around Tshabangus contested faction of the opposition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Citizens Coalition for Change (CCC) Ward 26 Councillor Mpumelelo Moyo, aligned with Sengezo Tshabangu’s faction, has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/tshabangu-councillor-jailed/\">Continue reading<span class=\"screen-reader-text\"> \"Top Tshabangu Aide Jailed Over US$20K Bribe\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Zanu PF Frogmarches Villagers To Munhumutapa Day",
            "url": "https://www.zimeye.net/2025/09/15/zanu-pf-frogmarches-villagers-to-munhumutapa-day/",
            "content": "By A Correspondent Zanu PF has been accused of frogmarching villagers from Zvishavane and surrounding rural areas to attend the so-called Munhumutapa Day commemorations, which are being held today in the asbestos ghost town.\n\nParty insiders revealed that local leaders were ordered to ensure busloads of villagers, schoolchildren, and civil servants were mobilised to fill up the event, which is being jointly celebrated with President Emmerson Mnangagwas controversial 83rd birthday.\n\nA faction aligned to theED2030 agendahas vowed to mobilise at least 30 000 people, with the hope of lobbying for the day to be declared a national holiday in honour of Mnangagwa.\n\nInformation Minister Jenfan Muswere defended the commemorations, describing Mnangagwa as a visionary and global statesman. We are celebrating the life of a statesman, a visionary, a man of the people who has dedicated his life to the freedom and prosperity of the people of Zimbabwe, Muswere said.\n\nYet critics see this as the latest attempt to entrench a personality cult around Mnangagwa, whose exact age remains disputed, with claims that his birth records were altered to suit political narratives.\n\nThe practice offorcing villagers to attend ruling party ralliesis not new. Since the 1980s, Zanu PF has relied on coercion and intimidation to project popularity and stage-manage mass support.\n\nDuring the liberation war commemorations of the 1980s, villagers in rural Matabeleland and Midlands were rounded up under the watchful eye of the military and intelligence operatives.\n\nThe Gukurahundi massacres deepened this climate of fear, making it impossible for rural citizens to refuse party orders.\n\nIn the 2000s, especially during thefast-track land reform era, Zanu PF used war veterans, youth militia, and traditional leaders to herd villagers to rallies where attendance lists were compiled and those absent were branded as opposition supporters.\n\nThe 2008 presidential runoff elections marked a high point of this coercion, with villagers ferried in trucks to rallies and forced to chant party slogans while enduring political re-education sessions.\n\nEven in more recent years, ahead of the2013, 2018, and 2023 elections, reports consistently emerged of chiefs and headmen threatening villagers with the withdrawal of food aid, farming inputs, or access to government programmes if they failed to attend Mnangagwas rallies.\n\nInternational observers, including the EU and SADC, have repeatedly flagged these tactics as undermining free political participation.\n\nTodays Munhumutapa Day in Zvishavane is not merely a cultural commemoration but apolitical battlefield.\n\nMnangagwas loyalists are pushing for constitutional changes to extend his rule beyond 2028 under the ED2030 agenda.\n\nVice President Constantino Chiwengas faction, however, insists 2028 should mark the transition of power, intensifying factional wars that now dominate Zanu PF.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF has been accused of frogmarching villagers from Zvishavane and surrounding rural areas to attend the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/zanu-pf-frogmarches-villagers-to-munhumutapa-day/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Frogmarches Villagers To Munhumutapa Day\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Ammara Brown Opens Up On Private Life",
            "url": "https://www.zimeye.net/2025/09/15/ammara-brown-gets-candid-on-love-motherhood/",
            "content": "By Showbiz Reporter One of the countrys finest female musicians, Ammara Brown, has opened up about the health scares she faced earlier this year during the delivery of her second child, Azina Adele Brown-Sulen.\n\nThe 37-year-old singer and businesswoman revealed how she went into survival mode shortly after giving birth to her daughter on June 17, describing the experience as both emotionally and physically overwhelming.\n\nMy biggest takeaway from this pregnancy and postpartum is learning to give myself grace. Eleven weeks later, and I am feeling human again, she said.\n\nDespite being under private care in South Africa, Ammara said she endured trauma during and after labour, largely due to a lack of mental health support from medical staff. She recounted undergoing an eight-hour induction that failed, leading to an emergency C-section.\n\nIt was an emotional and physical whirlwind. I quickly realised that even medical staff need mental health support. Eventually, I turned to my therapist to help me navigate my healing, she explained.\n\nTo aid her recovery, she joined a support group called WOW MOM and continues to work with her therapist. Ammara also draws strength from her partner, Daniel Sulen, her son Khameel, her mother-manager Chido Musasiwa, and long-time friend Marissa Vermaak, who helps with vocal training.\n\nMy first family, Daniel and Khameel, are my incredible tag team. We have a wonderful househelp who helps during the week (God bless all househelps). My momager Chido was here the day after I gave birth to help me; thank heavens. Friends are supportive at bay, while I have roped in one of my oldest friends, Marissa, to assist me with vocal training twice a week, she said.\n\nAmmara dedicates three hours daily to self-care, which includes vocal training, gym workouts, meditation, shopping, and grooming. She also follows a meal plan tailored for muscle gain, breastfeeding, and overall health.\n\nDespite the challenges, she finds immense joy in nurturing her newborn. Newborns are challenging, but nurturing Azina has been the greatest joy. I am always elated and exhausted. I love breastfeeding, too  motherhood has endless gifts.\n\nShe praised her partner for being a hands-on father: My partner is the dad I prayed for. He is changing diapers, making breakfast, and completely in love with his new role as a father.\n\nLooking ahead, Ammara said her much-anticipated album,Flaming Lilies, has been pushed to 2026. The theme is multifaceted Zimbabwean women  smart, sexy, cultured, spiritual, and highly valued. I am going to celebrate us all, loudly and proudly. The album is sounding fantastic! If I could release it tomorrow, I would.-Sunday Mail\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – One of the country’s finest female musicians, Ammara Brown, has opened up about the health scares she … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/ammara-brown-gets-candid-on-love-motherhood/\">Continue reading<span class=\"screen-reader-text\"> \"Ammara Brown Opens Up On Private Life\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Zanu PF in US$5 Million Conference Fundraising Drive",
            "url": "https://www.zimeye.net/2025/09/15/zanu-pf-in-us5-million-october-mutare-conference-fundraising/",
            "content": "By A Correspondent Zanu PF is demanding US$5 million to bankroll its 22nd National Peoples Conference scheduled for October 1318 at Mutare Polytechnic, a target that has once again revived public anger over the ruling partys long-standing practice of coercing teachers, civil servants, parastatals, and private companies to bankroll its activities under the guise of patriotic contributions.\n\nThe party says the high-profile gathering will draw 4,000 delegates, with money set aside for accommodation, catering, and venue upgrades. But critics warn that the burden of funding such lavish political events usually falls on the shoulders of ordinary workers and businesses that can ill afford it.\n\nZanu PFs reliance on forced fundraising dates back to the early 1980s, when teachers were compelled to contribute to state-driven war funds that often ended up financing party programs. During the 1990s, the practice expanded, with government ministries, parastatals, and schools routinely arm-twisted into selling fundraising raffle tickets or deducting solidarity levies from salaries to support Zanu PF projects.\n\nBy the 2000s, this pattern had become institutionalised. Companies seeking government tenders or licenses were often pressured into donating fuel, vehicles, and cash for party events. The 2013 general elections exposed the extent of this system when teachers unions revealed that educators were forced to donate part of their meagre salaries towards Zanu PF campaign activities. Reports also surfaced of provincial education officers ordering schools to buy conference regalia and transport delegates to rallies.\n\nCivil society watchdogs such as Transparency International Zimbabwe have repeatedly criticised this coercive fundraising, describing it as extortion disguised as patriotism, which blurs the line between state resources and party financing.\n\nAt the heart of this years preparations is Chief Secretary to the President and Cabinet Martin Rushwaya, who has emerged as a key figure in Zanu PFs Manicaland structures. He is spearheading the provinces controversial revival of the ED 2030 agenda  a push to extend President Emmerson Mnangagwas rule beyond constitutional limits.\n\nOver the last two weeks, Manicaland party structures have passed resolutions calling for Mnangagwas tenure to be extended and adopting a hardline stance on drug and substance abuse. Provincial chairman Tawanda Mukodza claimed the resolutions reflected grassroots sentiment, declaring: The people desire that President Mnangagwa remains in office beyond 2030, and are calling for the necessary constitutional amendments to facilitate this.\n\nRushwaya, together with Zanu PF Secretary for Legal Affairs Patrick Chinamasa, is tasked with consolidating these resolutions ahead of the Mutare conference. Analysts say Rushwayas prominent role underscores Mnangagwas attempt to tighten control over provinces and close the door on Vice President Constantino Chiwengas succession ambitions.\n\nThe October conference, which will cost US$5 million, is shaping up to be more than just a logistical showcase. It is a test of Mnangagwas grip on the party, as provinces line up behind or against the ED 2030 agenda. The heavy financial demands  met through coercion of teachers, civil servants, and private firms  highlight how Zanu PF has historically blurred the line between state and party, turning national institutions into fundraising vehicles for its political survival.\n\nObservers warn that as in 2017, unresolved succession disputes could destabilise the ruling party, while the coercive fundraising model risks alienating both workers and businesses already buckling under Zimbabwes economic crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF is demanding US$5 million to bankroll its 22nd National People’s Conference scheduled for October 13–18 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/zanu-pf-in-us5-million-october-mutare-conference-fundraising/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF in US$5 Million Conference Fundraising Drive\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Mnangagwa Turns 83",
            "url": "https://www.zimeye.net/2025/09/15/mnangagwa-turns-83/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa turns 83 today, but instead of being a day of sober reflection on the state of the nation, Zimbabweans are being forced to endure what many describe as a state-funded propaganda rally disguised as Munhumutapa Day.\n\nGovernment officials are already showering Mnangagwa with empty praise. Information Minister Jenfan Muswere claimed,We are celebrating the life of a statesman, a visionary, a man of the people,despite the fact that millions of Zimbabweans are battling hunger, joblessness, and a collapsing health system.\n\nMuswere went further to say Mnangagwa isa President who wants the best for everyone,a statement critics dismiss as laughable in a country where the majority cannot afford bread and hospitals lack basic drugs.\n\nThe ruling party insists the event will empower youths, with ZANU-PF Midlands chairperson Edison Chiherenge declaring,It is a very important day for the young people as they get a chance to celebrate President Mnangagwas birthday as well as interact with him.But young Zimbabweans say what they need is jobs, not staged rallies.\n\nMinister Owen Ncube boasted that,The flats have been completed and are ready for occupation and will be commissioned during the event,yet many observers point out that such projects are often allocated along partisan lines, leaving the majority excluded.\n\nEven ZANU-PFs Deputy Secretary for Youth Affairs John Paradza tried to dress up the day as meaningful, saying,Young people will use the day to highlight the Presidents accomplishments,a claim that rings hollow when most youths are fleeing the country in search of opportunities.\n\nWhile the regime presents Mnangagwa as a visionary and Pan-Africanist, ordinary citizens see 83 years marked by repression, corruption, and failure. Todays celebrations may be packaged as a cultural commemoration, but for many, it will feel more like a circus staged to glorify a leader who has robbed generations of their future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa turns 83 today, but instead of being a day of sober reflection on the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/mnangagwa-turns-83/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Turns 83\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Exposing Dubious Lawyer Talent Rusere…",
            "url": "https://www.zimeye.net/2025/09/15/exposing-dubious-lawyer-talent-rusere/",
            "content": "The SABC fake lawyer Talent Rusere who was claimed to have exposed election rigging in Mozambiques 2024 polls, has come out of prison to join Hopewell Chinono in accusing the civil society of tension, and on Sat, he dedicated much of the time accusing anti corruption activist, @BlessedGeza of sabotaging the economy. Like Chinono, Rusere also name-drops people without evidence accusing them saying they are in a plan to assassinate him. Can Rusere be trusted?\n\nThe SABC fake lawyer Talent Rusere who was claimed to have exposed election rigging in Mozambiques 2024 polls, has come out of prison to join Hopewell Chinono in accusing the civil society of tension, and on Sat, he dedicated much of the time accusing anti corruption activist,https://t.co/Hn8KhXSFAxpic.twitter.com/f663zTCKya\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The SABC fake lawyer Talent Rusere who was claimed to have exposed election rigging in Mozambique’s 2024 polls, has come … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/exposing-dubious-lawyer-talent-rusere/\">Continue reading<span class=\"screen-reader-text\"> \"Exposing Dubious Lawyer Talent Rusere…\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Why Does ZANU PF Hold Conferences Every Year?",
            "url": "https://www.zimeye.net/2025/09/15/why-does-zanu-pf-hold-conferences-every-year/",
            "content": "By Dr Masimba Mavaza | ZANU PF has successfully held its conference annually without fail.\n\nThe ZANU PF indaba is seen as a crucial platform for Zimbabwes national progress and party renewal. It is an opportunity for the ruling party to reflect on its commitment to the peoples aspirations and determine its path towards achieving a prosperous and empowered upper-middle-income society by 2030.\n\nThe key aspects of the ZANU PF indaba are unity and progress. The conference aims to rejuvenate and unite ZANU PF, positioning it as a party of progress, unity, and development, guiding Zimbabwe towards a brighter future.\n\nIt strengthens the economic and development focus. Discussions on the state of the economy and strategies for consolidating transformative development momentum dominate the agenda, aligning with the Second Republics goals.\n\nParty renewal is always an important aspect of each conference. President Emmerson Mnangagwa has emphasized internal party growth, focusing on skills, competence, and leaders being responsive to community needs.\n\nNational cohesion becomes the driving force in the conferences. The indaba underscores ZANU PFs role in national cohesion and progress, highlighting unity, peace, and development.\n\nPresident Mnangagwa has highlighted the partys electoral strengths and developmental achievements, such as the Presidential Youth Empowerment Fund and AI-enhanced GMB silos, showcasing efforts towards tangible community outcomes. The conferences theme and deliberations are anticipated to shape ZANU PFs direction and Zimbabwes national trajectory.\n\nZANU PFs ability to maintain internal cohesion and unity is crucial for its continued leadership in Zimbabwe. President Mnangagwa has emphasized the importance of unity within the party, warning members against divisive tactics and factional maneuvering that threaten the partys unity and ideological clarity.\n\nKey Challenges to Unity Succession debates: Ongoing discussions and speculation about potential successors, including Vice Presidents Constantino Chiwenga and Kembo Mohadi, create internal tensions. Personal ambitions: Party members personal ambitions sometimes take precedence over party loyalty, leading to internal conflicts. Factionalism: There is a risk of factional battles undermining the partys stability and effectiveness. External pressures: Global economic pressures, climate change, and infrastructure development challenges also impact ZANU PFs cohesion and governance.\n\nAnnual conferences foster peace and unity in the party. ZANU PF holds annual national conferences, demonstrating commitment to democratic principles and internal dialogue. President Mnangagwa urges members to speak with one voice, prioritize collective responsibility, and adhere to the partys constitution.\n\nThe partys youth league is focusing on innovation, entrepreneurship, and empowerment  a positive trend.\n\nEven though the conferences are for ZANU PF, they have implications for Zimbabwe as a whole.\n\nGovernance and stability are achieved through these conferences. ZANU PFs internal cohesion affects Zimbabwes governance, stability, and economic development. The partys unity and vision impact Zimbabwes economic recovery and development goals, such as achieving upper-middle-income status by 2030.\n\nZANU PFs role in fostering national unity and addressing challenges like economic pressures is critical. ZANU PFs policies affect the whole nation and therefore it is imperative that they be reviewed more often. Zimbabwes economic landscape, and President Mnangagwas leadership, are people-centred.\n\nZANU PFs policies take a more people-centred approach. The party has been focusing on people-centred policies, which seem to be driving its support base growth, with over 5,000 new members joining during the Zimbabwe International Trade Fair and thousands joining daily.\n\nEconomic empowerment has been the partys priority. It emphasizes economic empowerment initiatives, aiming for transformative development to achieve upper-middle-income status by 2030.\n\nLand redistribution has been a significant policy focus for ZANU PF, addressing historical imbalances.\n\nZANU PF outlines goals like achieving prosperity and empowerment for Zimbabweans, aligning with the Second Republics vision.\n\nThe country is rich in minerals like platinum, gold, and lithium, attracting international interest, particularly from China and all over the world. Agriculture is a key sector, with efforts to boost production amidst climate change challenges. There is a focus on improving the investment climate and re-engaging with international financial institutions.\n\nPresident Mnangagwas presidency is associated with the Second Republic, signaling new approaches post-Cde Robert Mugabe.\n\nPresident Mnangagwa has pursued relations with countries like China, Russia, and the UAE, focusing on economic partnerships and resource access. Efforts have been made to stabilize and grow the economy, though challenges persist.\n\nThe key considerations which might not be raised this year include constitutional constraints. Zimbabwes constitution limits presidents to two terms, making any extension require significant political and legal maneuvering. International implications of moves to extend President Mnangagwas rule could impact Zimbabwes international relations and reputation. To that end, the president has maintained that he is a constitutionalist.\n\nLooking at all these factors, it is essential to hold the national conferences each year. So this October, all roads lead to Mutare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | ZANU PF has successfully held its conference annually without fail. The ZANU PF indaba is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/why-does-zanu-pf-hold-conferences-every-year/\">Continue reading<span class=\"screen-reader-text\"> \"Why Does ZANU PF Hold Conferences Every Year?\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Chamisa Rises Above Haters, Inspires Supporters",
            "url": "https://www.zimeye.net/2025/09/15/chamisa-rises-above-haters-inspires-supporters/",
            "content": "By A Correspondent\n\nCitizens leader Advocate Nelson Chamisa on Friday delivered a powerful message aimed at silencing his critics, urging supporters to remain steadfast in the struggle for change.\n\nIn a post that quickly gained traction, Chamisa reminded both his followers and detractors that true strength lies in purpose and persistence, not in negativity.\n\nWithout your words, haters, opponents and detractors are so weak, clueless and powerless, he declared.\n\nThe opposition leader emphasized the importance of staying focused on the bigger picture despite challenges. Be and do your best. Stay the course. Run your race. Make a difference. Leave a legacy, Chamisa said, inspiring his supporters to remain committed to the cause.\n\nPolitical observers note that Chamisas remarks come at a time when he continues to face sustained attacks from both state machinery and rivals seeking to derail his political career. Despite the pressure, his words reflect resilience and a determination to rise above political mudslinging.\n\nFor many of his followers, the message was more than just rhetoricit was a call to action. One supporter commented online: This is why we continue to stand with you, Advocate. You inspire hope when others only bring hate.\n\nChamisas strategy of responding with positivity rather than trading insults has earned him admiration, particularly among young Zimbabweans who see him as a leader capable of charting a new path for the country.\n\nAs the political landscape intensifies ahead of future elections, the Citizens leaders ability to outwit his detractors may prove to be one of his strongest assets.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Citizens leader Advocate Nelson Chamisa on Friday delivered a powerful message aimed at silencing his critics, urging … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/15/chamisa-rises-above-haters-inspires-supporters/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Rises Above Haters, Inspires Supporters\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "Chaos As Kaycie’s Corpse Stolen: Own Kids Publicly Humiliated At Burial",
            "url": "https://www.zimeye.net/2025/09/14/chaos-as-kaycies-corpse-stolen-own-kids-publicly-humiliated-at-burial/",
            "content": "A whirlwind blocked the late DJ Kaycies hearse after family allegedly stole the body, source sayshttps://t.co/UNgTtQ0xtKpic.twitter.com/jGBkfCUnVZ\n\nBy Investigations Reporter | ZimEye | There was high drama surrounding the burial of UK-based Zimbabwean DJ Kudzaishe Kaycie Chipadza when his corpse was stolen from his wife, prompting intervention including that of the police at Chegutu.\n\n..\n\nFor nearly three months, the late entertainers funeral arrangements have been in limbo due to continuous changes and disagreementsmost recently over next-of-kin authority. Sources say Kaycies mother refused to pay repatriation fees, pushing the funeral parlour close to abandoning the case altogether.\n\nIn a controversial move, Kaycies mother orchestrated for Doves Morgan, a Zimbabwe government-aligned funeral company, to register themselves as next of kin, despite the fact that she remained in the UK. Her sister, Gay, turned up at Doves to impersonate her in Zimbabwe in order to push the process forward.\n\nMeanwhile, Beverly Hanyani, Kaycies widow, had already paid for her husbands burial in Buhera, the DJs royal homeland. Sources say Kaycie had made clear his desire to be buried in Buhera, where he maintained a close relationship with the local Sabhuku (village head).\n\n Mystical Interruption and Chegutu Arrest\n\nAs the hearse transporting Kaycies body was driving past Norton en route from Harare, an unusually strong wind swept the road, prompting stunned vendors to murmur superstitions.\n\nVendors selling nearby started asking, Is this nice car youre driving carrying hurombwa (a mythical curse) or what? said one witness.\n\nShortly afterward, the drivers of the hearse were arrested in Chegutu, forcing the vehicle to return to Harare. The CEO of Doves reportedly instructed the driver to go straight to the nearest police station, stating that they could not proceed to Zvishavane because Kaycies wife was still in Harare.\n\n Confrontation and Refund Demands\n\nBack in Harare, Doves Funeral Services convened a meeting with Beverly Hanyani, who demanded a full refund, accusing Doves of changing the next of kin and stealing the corpse. She informed the company that she would now fly back to the UK, stating, Doves has messed up everything.\n\nDoves offered a partial refund of USD6,000, but Beverly demanded the full USD11,000, including USD5,000 she had already paid to UK-based funeral home Walton & Taylor.\n\nIn an unexpected twist, Tawanda Chipadza, Kaycies brother, offered to personally refund the Walton & Taylor fees that Beverly had already paid.\n\nWe took the USD3,000 and gave them their corpse, a member of the Hanyani family told ZimEye.\n\n Locked Doors, No Vigil\n\nUpon arriving in Zvishavane, Kaycies body was locked inside a house, and Beverly was told to leave. Tawanda reportedly took Kaycies children, Tyler and Talya, on a tour of a local school that the deceased once attended.\n\nAt the same time, Gay Nyakuenda took Kudzi (another of Kaycies children) and a relative into a different house and switched off the lightsan act that effectively cancelled the traditional night vigil.\n\nKaycie did not receive a night of singing or mourning at all, a source told ZimEye.\n\nEven worse, Beverly and the children were blocked from participating in Kaycies final procession. LIVE video footage obtained by ZimEye shows the family being humiliated, as they were prevented from accompanying the hearse.\n\nWhat do you want his wife to travel with? Aaa this is not fair, aiwa miswai! Miswai! screamed a woman recording the incident in disbelief.\n\nAccording to sources, the directive came directly from Kaycies mother, who allegedly ordered that Beverly must not enter the vehicle.\n\n Burial Amidst Bitterness\n\nAfter a series of chaotic events, Kaycie was eventually buried in the afternoonbut not before his widow suffered deep humiliation and exclusion from key burial rites.\n\nEfforts to reach Gloria Chipadza, the late DJs mother, for comment were made but received no response at the time of writing.\n\nA source from Chegutu Police confirmed the arrest drama that unfolded on Saturday, saying the matter had escalated rapidly and involved several parties.\n\n#JusticeForKaycie | #CorpseDrama | #BurialDispute\n\nFor more updates, follow ZimEye Investigations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigations Reporter | ZimEye | There was high drama surrounding the burial of UK-based Zimbabwean DJ Kudzaishe “Kaycie” Chipadza … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/14/chaos-as-kaycies-corpse-stolen-own-kids-publicly-humiliated-at-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos As Kaycie’s Corpse Stolen: Own Kids Publicly Humiliated At Burial\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        },
        {
            "title": "ED Minister Throws Brother-in-Law Under the Bus",
            "url": "https://www.zimeye.net/2025/09/14/minister-barbara-rwodzi-brother-in-law-in-ugly-fight/",
            "content": "By A Correspondent Tourism and Hospitality Industry Minister Barbara Rwodzi has caused the ouster of her late husbands brother, Aaron Rwodzi, from Zanu PF.\n\nAaron, who received his dismissal letter from the Chirumhanzu District Coordinating Committee (DCC), is the brother of the late Christopher Mutonho Rwodzi  Barbaras husband, who died in a mysterious car accident in June 2024.\n\nInsiders say the animosity between Aaron and Barbaras political camps had been building for years following Mutonhos death, with the conflict eventually spilling into party structures in the Midlands province.\n\nChristopher Mutonho Rwodzi, a retired soldier, perished when his Toyota Prado veered off a bridge between Chivhu and Harare, plunging into a dry riverbed and overturning. His sudden death left a power vacuum in the family and local politics, fueling tension that has now erupted publicly.\n\nWithin Zanu PF, Barbara has cemented her position as one of President Emmerson Mnangagwas staunchest allies in the Midlands, a province long regarded as his political stronghold. Her growing influence, however, has reportedly unsettled rivals, including Aaron, who is now being painted as a casualty of the broader purge of dissenting voices.\n\nParty insiders say Aarons expulsion is not just a family feud gone political but part of a calculated attempt to silence figures perceived to be sympathetic to Vice President Constantino Chiwengas camp.\n\nFactional struggles within Zanu PF are escalating ahead of a crucial congress set for Mutare next month, where Mnangagwas controversial bid to extend his stay in office beyond 2028 is expected to dominate proceedings. The battle lines between Mnangagwas loyalists and Chiwengas faction are becoming sharper  with purges, betrayals, and personal vendettas increasingly defining the partys internal wars.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Tourism and Hospitality Industry Minister Barbara Rwodzi has caused the ouster of her late husband’s brother, Aaron … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/14/minister-barbara-rwodzi-brother-in-law-in-ugly-fight/\">Continue reading<span class=\"screen-reader-text\"> \"ED Minister Throws Brother-in-Law Under the Bus\"</span></a></p>",
            "time": "08:45",
            "date": "16 Sep 2025"
        }
    ]
}