{
    "news": [
        {
            "title": "VP Chiwenga Silences CIO Minister in Explosive Zanu PF Clash",
            "url": "https://www.zimeye.net/2025/09/25/vp-chiwenga-silences-cio-minister-in-explosive-zanu-pf-clash/",
            "content": "By Investigations Reporter-Vice-President Constantino Chiwenga last week silenced Central Intelligence Organisation (CIO) Minister Lovemore Matuke during a heated politburo meeting, in a dramatic escalation of Zanu PFs succession wars.\n\nThe confrontation followed a near-physical showdown between Chiwenga and President Emmerson Mnangagwa at State House and later at Zanu PF headquarters on Wednesday, 17 September 2025. Insiders say the explosive exchanges have laid bare the deepening rifts at the top of the ruling party, where corruption scandals, factional rivalries, and the unresolved succession question are converging into a political crisis.\n\nAccording to well-placed sources, Matuke had attempted to defend Mnangagwa, dismissing Chiwengas corruption dossier as a thinly veiled attack on the President. But Chiwenga hit back, lecturing him on Zanu PFs liberation war history and warning that factionalism had once destroyed the partys unity, citing the deadly 1974 Nhari Rebellion as a cautionary tale.\n\nEarlier that day, Chiwenga had arrived at State House unannounced to confront Mnangagwa directly. In front of the presidium, he tabled a dossier alleging industrial-scale looting by the Presidents close business allies  the so-called Zviganandas, a clique of politically connected tenderpreneurs. He accused Kudakwashe Tagwirei, Wicknell Chivayo, Pedzisayi Scott Sakupwanya, Delish Nguwaya, and others of bleeding the state dry and buying influence within Zanu PF.\n\nWhen Chivayo gives you ten million dollars, he will already have taken ninety million, Chiwenga reportedly warned, claiming the country was losing billions through fraudulent tenders and shadowy deals. He suggested Mnangagwa was complicit, alleging the businessmen were funding a campaign to extend his rule beyond 2028.\n\nMnangagwa rejected the accusations, insisting he was a constitutionalist with no intention of overstaying. But his defence of the accused businessmen  including the remark Nguwaya is my friend  only worsened the tension. Mnangagwa stormed out and drove to party HQ, leaving behind a visibly enraged Chiwenga.\n\nAt Zanu PF headquarters, the President convened the politburo and, in a dramatic twist, presented Chiwengas dossier himself. He dared members to declare whether he was failing as President. Silence filled the room. He then called on Chiwenga to explain, prompting the Vice-President to launch a blistering attack, accusing Tagwirei of pocketing billions from state contracts while starving the party of its rightful share.\n\nThe party made him, Chiwenga thundered, and now he is feeding us crumbs. He demanded the immediate arrest of Tagwirei, Chivayo, and their associates, describing corruption as an existential threat to Zanu PF.\n\nThe confrontation rattled Mnangagwa, who days later reshuffled the politburo in what many saw as a counter-strike against Chiwengas allies. Obert Mpofu was demoted, Patrick Chinamasa shifted to Treasurer-General, and Jacob Mudenda elevated to secretary-general. Justice Minister Ziyambi Ziyambi took over Legal Affairs, consolidating Mnangagwas grip.\n\nMeanwhile, Zanu PF spokesperson Christopher Mutsvangwa went on the offensive, defending Tagwirei and mocking Chiwenga as no superhero, exposing how the propaganda machine has been deployed against the Vice-President.\n\nStill, Chiwenga remains defiant, branding Mnangagwas allies gluttons and warning that the Presidents reliance on corrupt businessmen endangers the state. With the Zanu PF annual conference in October approaching, the confrontation has left the party on edge.\n\nFor many insiders, the spectacle of a President and his deputy nearly coming to blows is a chilling echo of 2017  when the generals turned on Robert Mugabe. This time, however, the generals are turning on each other.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigations Reporter-Vice-President Constantino Chiwenga last week silenced Central Intelligence Organisation (CIO) Minister Lovemore Matuke during a heated politburo meeting, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/25/vp-chiwenga-silences-cio-minister-in-explosive-zanu-pf-clash/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Silences CIO Minister in Explosive Zanu PF Clash\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "Stop the Abuse of VP Chiwenga, He Deserves Maximum Respect",
            "url": "https://www.zimeye.net/2025/09/25/stop-the-abuse-of-vp-chiwenga-he-deserves-maximum-respect/",
            "content": "In 2017, Zimbabwe witnessed Grace Mugabe and her allies relentlessly insulted and humiliated President Emmerson Mnangagwa. Day after day, at interface rallies and public platforms were turned into stages for abuse, ridicule and personal attacks against him. What is most troubling is that at the time, no one within ZANU PF rose to stop this shameful conduct. The silence only deepened the divisions that eventually tore through the party.\n\nToday, history appears to be repeating itself. Vice President Constantino Chiwenga is now subjected to the same wave of insults and character assassinations. From political platforms to whispered campaigns, the Vice President is being undermined in ways that should alarm anyone who values stability within the ruling party and the nation at large.\n\nThis behaviour is not just disrespectful, it is damaging to the unity of ZANU PF and to Zimbabwes leadership as a whole. VP Chiwenga, who has served his country faithfully, does not deserve to be the target of ridicule.\n\nThe leadership of ZANU PF must act decisively. Internal discipline and respect for high office must be restored. Zimbabwe cannot afford another era of factional insults. The Vice President, like every leader, deserves dignity.\n\nAchapinda mozodini\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In 2017, Zimbabwe witnessed Grace Mugabe and her allies relentlessly insulted and humiliated President Emmerson Mnangagwa. Day after day, at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/25/stop-the-abuse-of-vp-chiwenga-he-deserves-maximum-respect/\">Continue reading<span class=\"screen-reader-text\"> \"Stop the Abuse of VP Chiwenga, He Deserves Maximum Respect\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "VP Chiwenga, ED In Near Physical Fight",
            "url": "https://www.zimeye.net/2025/09/25/vp-chiwenga-ed-in-near-physical-fight/",
            "content": "By Investigations Reporter-President Emmerson Mnangagwa and his deputy, Vice-President Constantino Chiwenga, came close to a physical confrontation during an explosive encounter at State House and later at Zanu PF headquarters on Wednesday, 17 September 2025, insiders have revealed.\n\nThe clash, which has since spilled into the politburo, exposed the deepening rift at the top of the ruling party as succession battles, corruption scandals, and factional rivalries reach boiling point.\n\nAccording to well-placed sources, Chiwenga arrived at State House unannounced shortly before the politburo meeting to confront Mnangagwa directly.\n\nIn a tense briefing attended by members of the presidium, the Vice-President tabled a dossier detailing what he called industrial-scale looting by the Presidents close business allies  a clique of politically connected tenderpreneurs derisively dubbed the Zviganandas.\n\nChiwenga accused Kudakwashe Tagwirei, Wicknell Chivayo, Pedzisayi Scott Sakupwanya, Delish Nguwaya, and their associates of bleeding the state dry while buying influence within the party through lavish donations and conspicuous displays of wealth.\n\nHe insisted that their financial muscle, built on corruption, was distorting Zanu PFs internal politics and undermining the partys credibility ahead of the 2028 elections.\n\nWhen Chivayo gives you ten million dollars, he will already have taken ninety million, Chiwenga reportedly told Mnangagwa, warning that the country was losing billions of dollars annually through fraudulent contracts, siphoned tenders, and shadowy deals.\n\nHe accused Tagwirei and his cronies of funding a campaign to extend Mnangagwas rule beyond his constitutional two terms, suggesting the President was complicit.\n\nMnangagwa denied the allegations, maintaining he was a constitutionalist and had no intention of overstaying beyond 2028. But his defence of the accused businessmen, including the remark Nguwaya is my friend, appeared to inflame tensions further.\n\nThe President then stormed out of State House and drove to the Zanu PF headquarters, leaving behind a fuming Chiwenga.\n\nAt party HQ, Mnangagwa convened the politburo ahead of the days business and, in a dramatic twist, presented the very dossier compiled by Chiwenga.\n\nHe challenged politburo members to decide whether he was failing as President, declaring: If anyone thinks I am not running this country well, say so and I will call it a day. No one responded.\n\nHe then revealed that the corruption report originated from Chiwenga and invited him to explain further. Seizing the moment, Chiwenga launched into a blistering attack.\n\nHe said Zanu PF secretly held a 45% stake in Sakunda Holdings through CBZ Nominees, with Mnangagwa himself listed as one of the trustees.\n\nYet, instead of dividends, Tagwirei was pocketing the bulk of the profits, giving the party peanuts as and when he wants.\n\nChiwenga claimed Sakunda and its associates had made more than US$3.2 billion from state contracts but had not accounted for Zanu PFs share.\n\nHe accused Tagwirei of betraying the party that had created him, while Mnangagwa turned a blind eye. The party made him, Chiwenga thundered, and now he is feeding us crumbs.\n\nHis accusations, however, triggered fierce pushback. Security minister Lovemore Matuke dismissed the dossier as a thinly disguised attack on Mnangagwa, likening it to the fiery rhetoric of war veterans leader Blessed Geza.\n\nChiwenga shot back, lecturing Matuke on Zanu PFs liberation war history and warning that internal conflicts, such as the deadly 1974 Nhari Rebellion, showed how factionalism could destroy the party from within.\n\nOther politburo members weighed in. Eliphas Mashaba of Bulawayo called for arrests of corrupt figures but argued that corruption should not be conflated with the so-called 2030 campaign to extend Mnangagwas rule.\n\nSenior party stalwart Frederick Shava suggested the matter was too sensitive and should be handled at presidium level.\n\nPatrick Chinamasa, Tagwireis long-time defender, insisted the businessman was a legitimate entrepreneur unfairly vilified.\n\nHis comments were swiftly curtailed by Obert Mpofu, then secretary-general, who steered the debate back to the presidium.\n\nAs tempers flared, Chiwengas demand for the immediate arrest of Tagwirei, Chivayo, and their associates shocked many in the room. They must be in jail, he declared, insisting the corruption plague was now an existential threat to Zanu PF.\n\nHis words underscored the high stakes of the power struggle, pitting the former army general who helped topple Robert Mugabe in 2017 against the man he installed in office.\n\nThe confrontation rattled Mnangagwa, who reportedly saw the silence of Mpofu as a sign of wavering loyalty. Days later, Mnangagwa retaliated with a sweeping politburo reshuffle.\n\nIn a stunning move, Mpofu was demoted to Secretary for ICT  a political backwater  while Jacob Mudenda, Speaker of Parliament and Mnangagwa loyalist, replaced him as secretary-general.\n\nChinamasa was shifted to Treasurer-General, giving him control of party finances, while Justice Minister Ziyambi Ziyambi took over Legal Affairs.\n\nThe reshuffle, widely viewed as a direct strike against Chiwengas camp, mirrored the ruthless political manoeuvring of the Mugabe era.\n\nIt also forced Mnangagwa to cancel his scheduled trip to the United Nations General Assembly in New York, after security briefings warned his absence could embolden rivals.\n\nTo consolidate the counter-attack, Zanu PF spokesperson Christopher Mutsvangwa convened a fiery press conference defending Tagwirei and other tenderpreneurs.\n\nHe dismissed Chiwengas accusations as envy and bitterness, sneering: He is not the only one who fought in the liberation war. He is no superhero. Mutsvangwas tirade highlighted how the partys propaganda machine has now been deployed to neutralise the Vice-President.\n\nFor his part, Chiwenga appears undeterred. He continues to warn of gluttons eating away at the heart of the state, accusing Mnangagwa of entrusting the nations secrets to businessmen like Chivayo, whom he branded a thief. His allies point to Mnangagwas willingness to defend controversial figures as proof he is compromised.\n\nThe crisis has deepened ahead of Zanu PFs annual conference set for October in Mutare. With succession unresolved, the stakes could not be higher.\n\nMnangagwa is in his eighties and constitutionally barred from seeking another term after 2028.\n\nChiwenga, long considered his natural successor, is now openly challenging the Presidents closest allies and, by extension, his leadership.\n\nThe fallout is reminiscent of the power struggles that consumed Zanu PF in 2017, culminating in Mugabes ouster.\n\nBut this time, the protagonists are the very men who orchestrated that coup  now locked in a bitter duel for supremacy. Analysts warn that the escalating fight could destabilise both the party and the state.\n\nFor now, Mnangagwa has tightened his grip, sidelining Chiwengas allies and projecting authority.\n\nYet the spectacle of a President and his deputy nearly coming to blows, before the eyes of party loyalists, underscores how fragile that grip may be.\n\nAs one politburo insider remarked: It feels like history repeating itself. In 2017, the generals turned against Mugabe. Today, the generals are turning against each other.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigations Reporter-President Emmerson Mnangagwa and his deputy, Vice-President Constantino Chiwenga, came close to a physical confrontation during an explosive … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/25/vp-chiwenga-ed-in-near-physical-fight/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga, ED In Near Physical Fight\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "Brave Harare Lawyer Takes Mnangagwa Head On",
            "url": "https://www.zimeye.net/2025/09/25/brave-harare-lawyer-takes-mnangagwa-head-on/",
            "content": "By Courts and Crime Reporter-A Harare lawyer has boldly petitioned the Attorney-General, challenging President Emmerson Mnangagwas use of tribunals to remove judges from office, arguing that the constitutional provisions governing the process are tyrannical and undemocratic.\n\nChawaona Wildroad Kanoti contends that the tribunal system, established under section 187 of the Constitution, is inherently flawed because it denies judges facing removal the right to appeal or seek a second opinion on the tribunals findings. He described the process as a mere formality to remove an accused judge and likened it to sending judges like a lamb to the slaughter.\n\nHistory, Kanoti noted, shows that no judge has ever been exonerated by such inquiries, with most forced to resign regardless of guilt or innocence. Judges including Francis Bere, Benjamin Chikowero, and Erica Ndewere were dismissed after tribunals recommended their removal, with the President bound to act on those recommendations.\n\nThe victim judge has no room for a second trial, a second opinion or any form of review or appeal, Kanoti submitted, emphasizing that this violates democratic principles. He warned that subsection (8) of section 187 strips the President of discretion to correct tribunal errors, while giving retired judges appointed to such tribunals undue influence, often aligned with the appointing authority.\n\nKanoti has called on Parliament to amend subsections (7) and (8) of section 187 to align with the spirit of the Constitution and provide for an appeal mechanism to the Supreme Court or a special Constitutional Court sitting.\n\nThe current system is constitutionally flawed and amounts to a slaughter inquiry, he argued, insisting that removing discretionary powers from the President and denying appeal rights undermines both judicial independence and democratic accountability.\n\nThe petition was also copied to the Justice, Legal and Parliamentary Affairs Minister and the Judicial Service Commission.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Courts and Crime Reporter-A Harare lawyer has boldly petitioned the Attorney-General, challenging President Emmerson Mnangagwa’s use of tribunals to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/25/brave-harare-lawyer-takes-mnangagwa-head-on/\">Continue reading<span class=\"screen-reader-text\"> \"Brave Harare Lawyer Takes Mnangagwa Head On\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "Church Leader Publicly Defends General Chiwenga…",
            "url": "https://www.zimeye.net/2025/09/25/church-leader-publicly-defends-general-chiwenga/",
            "content": "15 Serious Facts Every Zimbabwean Need to Know About Vice President Chiwenga\n\nWhat is it that Zimbabweans feel or think each time they see their Vice President Rtd General Chiwenga\n\nBy Isaac Makomichi\n\nLeadership Principles of VP Chiwenga\n\nIntroduction:Vice President Chiwenga is a respected statesman and senior retired army general, he leads with integrity, compassion, and a strong commitment to serving the nation.\n\nKey Principles:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "15 Serious Facts Every Zimbabwean Need to Know About Vice President Chiwenga What is it that Zimbabweans feel or think … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/25/church-leader-publicly-defends-general-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Church Leader Publicly Defends General Chiwenga…\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "Villagers In Trouble For Killing “Thief”",
            "url": "https://www.zimeye.net/2025/09/25/villagers-in-trouble-for-killing-thief/",
            "content": "By A Correspondent\n\nPolice in Ngundu have arrested four people from Murevegwa Village, Chivi, in connection with the fatal assault of a man accused of theft. The incident occurred on September 20, 2025.\n\nThose taken into custody have been named as Nomore Murevegwa (33), Realise Murevegwa (18), Givemore Murevegwa (19), and Fortune Zimoto (43). According to police, the suspects allegedly teamed up to beat Shakemore Chihwe Pedzisai (33) using sticks, fists, and booted feet after accusing him of stealing.\n\nPedzisai was admitted to a hospital in Mwenezi following the attack but sadly succumbed to his injuries on September 22, 2025. Police also revealed that two other suspects, Ngonidzashe Zimoto (24) and Martin Zimoto (22), are still at large.\n\nIn a separate development, police in Triangle have launched investigations into another suspected murder. A man, whose identity is yet to be established, was discovered at Field 602, Section Six, with severe head injuries and a stab wound to the forehead. Authorities are appealing to anyone with information to report to the nearest police station.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Police in Ngundu have arrested four people from Murevegwa Village, Chivi, in connection with the fatal assault … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/25/villagers-in-trouble-for-killing-thief/\">Continue reading<span class=\"screen-reader-text\"> \"Villagers In Trouble For Killing “Thief”\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "The Fall of Obert Mpofu",
            "url": "https://www.zimeye.net/2025/09/24/the-falls-of-obert-mpofu/",
            "content": "By A Correspondent  President Emmerson Mnangagwa has dismissed Zanu PFs long-serving secretary-general, Obert Mpofu, and replaced him with his trusted ally, Jacob Mudenda, the Speaker of Parliament.\n\nMpofu has been moved to the less influential position of Secretary for ICTa demotion widely seen as an attempt to weaken Vice-President Constantino Chiwengas grip within the ruling partys volatile succession battles.\n\nThe move marks a dramatic fall from grace for Mpofu, a veteran politician whose career has spanned decades and who once styled himself as the most obedient son of former president Robert Mugabe.\n\nBorn in 1951 in Jambezi, Matabeleland North, Mpofu joined the liberation struggle in the 1970s and later rose through Zanu PF ranks, holding multiple cabinet posts, including Mines, Transport, and Home Affairs.\n\nYet Mpofus legacy is inseparable from controversy. As Minister of Mines between 2009 and 2013, he presided over Zimbabwes diamond sector during the peak of operations in Marange.\n\nBillions of dollars in diamond revenue vanished under his watch, with civil society and opposition figures accusing him of overseeing massive looting that deprived the treasury of much-needed resources.\n\nWhile Mpofu has consistently denied personal wrongdoing, leaked reportsincluding a 2013 parliamentary committee investigationalleged gross mismanagement and corruption.\n\nIronically, it was this shadowy diamond wealth that allegedly provided the financial muscle behind the 2017 coup that ousted Mugabe.\n\nSecurity insiders have long claimed that proceeds from illicit diamond dealings helped bankroll the logistics of the military intervention led by Chiwenga and supported by Mnangagwa.\n\nMpofu, once seen as loyal to Mugabe, abandoned the veteran leader at his weakest moment, siding instead with the Mnangagwa-Chiwenga alliance that ushered in the new dispensation.\n\nHis loyalty, however, has since shifted closer to Chiwenga, creating friction with Mnangagwa. That positioning has now cost him dearly.\n\nThe timing of Mpofus demotion is telling. It follows weeks of heightened tensions after Chiwenga presented an explosive anti-corruption dossier accusing Mnangagwas alliesincluding businessman Kudakwashe Tagwirei, widely believed to be Mnangagwas preferred successorof looting billions of dollars.\n\nThe dossier rattled the ruling party, deepening mistrust between the rival factions.\n\nAmid these tensions, Mnangagwa cancelled his planned trip to New York for the United Nations General Assembly after receiving intelligence that his camp could face crippling blows, including possible arrests, in his absence.\n\nThe Central Intelligence Organisation reportedly advised him that leaving the country would expose him to serious risks at home.\n\nAnalysts see Mpofus demotion as Mnangagwas boldest attempt yet to paralyse Chiwengas influence in Zanu PF.\n\nThe development evokes echoes of 2017, when Mugabes refusal to resolve succession disputes led to his ouster by the military. But unlike then, Mnangagwa and Chiwenga are no longer alliesthey are bitter adversaries.\n\nZanu PF spokesperson Christopher Mutsvangwa, announcing the reshuffle, insisted it was about strengthening the partys revolutionary mission.\n\nThis reorganisation underscores the partys enduring commitment to the policies, tenets and ethos of the party, Zanu PF and the permanent Zimbabwe revolution in service to the people and to the nation of Zimbabwe, Mutsvangwa said.\n\nThe Politburo reshuffle saw Mnangagwa loyalists gain key positions:\n\nThe changes tighten Mnangagwas grip on Zanu PF while simultaneously isolating Chiwengas camp. But they also underline the fragility of the ruling partys unity. Mpofu, long regarded as a political heavyweight in Matabeleland and a skilled party operator, commands a base that Mnangagwa can ill afford to alienate.\n\nUltimately, Mpofus fall from secretary-general to a marginal post reflects more than just personal defeat.\n\nIt symbolises how the alliances forged in 2017s coup have crumbled into bitter rivalry, with diamond-stained legacies now resurfacing to haunt the partys top leadership.\n\nThe purging of Chiwengas allies may buy Mnangagwa timebut at the risk of plunging Zanu PF, and the nation, into yet another storm of instability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has dismissed Zanu PF’s long-serving secretary-general, Obert Mpofu, and replaced him with his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/24/the-falls-of-obert-mpofu/\">Continue reading<span class=\"screen-reader-text\"> \"The Fall of Obert Mpofu\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "Grade 7 Exams in Full Swing",
            "url": "https://www.zimeye.net/2025/09/24/grade-7-exams-in-full-swing/",
            "content": "By A Correspondent  Grade Seven public examinations commenced in earnest last Monday, with learners across the country expressing confidence as they began the crucial tests.\n\nThe examinations opened with English Paper One, marking the start of an important academic season that will run until October 6.\n\nFor many pupils, this milestone represents the culmination of nine years of formal education, including two years in Early Childhood Development, and the beginning of their final stretch in primary school.\n\nAcross Zimbabwe, classrooms were filled with anticipation as candidates tackled the first paper. After writing, some learners in Harare shared their impressions with ZBC News.\n\nThe English paper was a bit tricky, but I think I managed well. I feel confident because we were well prepared by our teachers.\n\nIt was challenging, but I did my best. I am hoping for good results.\n\nI am happy the first paper is done. I was nervous at first, but once I started writing, I felt okay. I just want to make my parents proud.\n\nI am confident that I am going to make it because I was prepared for this examination. I also hope that the next papers will be easy.\n\nSchool authorities also expressed optimism that this years cohort will achieve strong results.\n\nWe have done our part as educators. The learners were well-prepared through revisions and mock exams, and we are confident they will do well, said Harvard Junior Schools Senior Master, Mr. Trevor Dunduru.\n\nThese learners have been consistent and dedicated. We are hopeful for excellent results, and we know they gave it their all, added Mother Touch Junior Schools Deputy Headmaster, Mr. Johanny Mupfumbu.\n\nThe Ministry of Primary and Secondary Education confirmed that the examinations began smoothly across the country, with no major incidents reported.\n\nWe have received positive reports from provinces that the examinations went smoothly. This is a testament to extensive preparatory work from our teams on the ground. Grade Seven examinations remain a critical part of our education system, said the Ministrys Director of Communication and Advocacy, Mr. Taungana Ndoro.\n\nLast year, over 380,000 candidates sat for the Grade Seven public examinations. The Zimbabwe Schools Examinations Council (ZIMSEC) recorded a 49 percent pass rate, up from just above 45 percent in 2023, reflecting a steady improvement in performance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Grade Seven public examinations commenced in earnest last Monday, with learners across the country expressing confidence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/24/grade-7-exams-in-full-swing/\">Continue reading<span class=\"screen-reader-text\"> \"Grade 7 Exams in Full Swing\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "Warriors to Host Bafana Bafana at Moses Mabhida Stadium",
            "url": "https://www.zimeye.net/2025/09/24/warriors-to-host-bafana-bafana-at-moses-mabhida-stadium/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has clarified why the Warriors 2026 FIFA World Cup Qualifiers Group C clash against South Africa will now be played in Durban instead of Botswana.\n\nThe fixture, scheduled for Friday, 10 October, was initially set for the Obed Itani Chilume Stadium in Francistown. However, the venue became unavailable after Botswana authorities reserved it for their own use.\n\nIn a statement, ZIFA said the choice of Moses Mabhida Stadium in Durban was made after carefully considering logistics, costs, facilities, and fan safety. The Association explained that after assessing alternatives across the region, only Orlando Stadium and Moses Mabhida Stadium in South Africa met the required standards, with the latter deemed the most suitable option.\n\nThe Zimbabwe Football Association (ZIFA) wishes to inform fans that the upcoming FIFA World Cup qualifier against South Africa on 10 October will be played at the Moses Mabhida Stadium in Durban, South Africa.\n\nOriginally, ZIFA had planned to host the match in Francistown, Botswana, but the venue became unavailable due to Botswanas need to use the same stadium. After assessing alternatives across the region, only two suitable venues in South Africa remained: Orlando Stadium and Moses Mabhida Stadium. Taking into account logistics, cost, facilities, and fan safety, ZIFA chose Moses Mabhida Stadium to give the Warriors the best possible environment to compete.\n\nWe understand the disappointment of not playing at home, but we urge all Zimbabweans to unite and rally behind the Warriors as they take on South Africa in this crucial World Cup qualifier.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has clarified why the Warriors’ 2026 FIFA World Cup Qualifiers Group C clash … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/24/warriors-to-host-bafana-bafana-at-moses-mabhida-stadium/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors to Host Bafana Bafana at Moses Mabhida Stadium\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        },
        {
            "title": "Munetsi Scores First Goal Of The Season As Wolves Knock Out Everton",
            "url": "https://www.zimeye.net/2025/09/24/munetsi-scores-first-goal-of-the-season-as-wolves-knock-out-everton/",
            "content": "Sports Correspondent\n\nZimbabwean midfielder Marshall Munetsi was all smiles after scoring his first goal of the season to help Wolves secure a 2-0 victory over Everton in the Carabao Cup third round on Tuesday night.\n\nMunetsi opened the scoring midway through the first half, pouncing on a rebound after Everton goalkeeper Mark Travers parried Jhon Arias volley into his path. His well-taken strike set Wolves on course for a convincing win that booked their spot in the fourth round.\n\nSpeaking to Wolves media after the match, Munetsi praised his teammates defensive efforts as much as his own goal.\n\nIts a great feeling, but hats off to the defence, because they were really solid today. To get a clean sheet was very important, because weve been conceding goals, especially in the first half. So, scoring was good, but also having the clean sheet in the first 45 minutes was very, very important for us today, he said.\n\nReflecting on his goal, the midfielder highlighted his composure in front of goal:\n\nIve always had the attributes, so as soon as Jhon had the shot and the keeper put it on the side, the main target was just to keep it down. I tried just to put my body on top of it and score. Its a great feeling to be able to get on the score sheet.\n\nLooking ahead, Munetsi expressed optimism about Wolves attacking options, noting the imminent return of Larsen.\n\nLarsen is coming back, he hasnt been playing for a couple of games now, but we do have a great combination when we are playing forward. I think we need to contribute as much as we can to the team, to try and score as much as we can. If we get clean sheets, well win games by scoring.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean midfielder Marshall Munetsi was all smiles after scoring his first goal of the season to help Wolves … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/24/munetsi-scores-first-goal-of-the-season-as-wolves-knock-out-everton/\">Continue reading<span class=\"screen-reader-text\"> \"Munetsi Scores First Goal Of The Season As Wolves Knock Out Everton\"</span></a></p>",
            "time": "09:46",
            "date": "26 Sep 2025"
        }
    ]
}