{
    "news": [
        {
            "title": "Zim Female Cardio Doctor Breaks Record",
            "url": "https://www.zimeye.net/2025/11/23/zim-female-cardio-doctor-breaks-record/",
            "content": "By A Correspondent Dr. Kudzai Kanyepi has made history as Zimbabwes first female cardiothoracic surgeon and the first woman to complete cardiothoracic surgery training at the University of KwaZulu-Natals College of Health Sciences in South Africa. She is one of only 13 female cardiothoracic surgeons in Africa, and one of just 14 of African ethnicity.\n\nAfter completing her undergraduate medical degree at the University of Zimbabwe, Dr. Kanyepi trained for six years in Durban under Zimbabwes Manpower Development Programme. When she qualified, she became the 12th woman on the continent to enter this highly specialised field. At that time, she was the fourth African woman to hold the qualification; the number has since risen to seven.\n\nDespite opportunities to remain abroad, Dr. Kanyepi chose to return home. You can work anywhere outside the country and be celebrated, but there is nothing more rewarding than serving your own people, she said, explaining her decision to come back to Zimbabwe.\n\nSince joining Parirenyatwa Group of Hospitals, she has transformed the lives of many patients. She says the people she has treated have also reaffirmed her commitment to returning home.\n\nWith many Zimbabweans fundraising to travel to India and other countries for heart and chest surgeries, Dr. Kanyepi emphasises that local specialists are fully capable of providing world-class care. She and her colleagues continue to demonstrate that complex procedures can be safely performed in Zimbabwe.\n\nDr. Kanyepi has become a trailblazer in science and technology, but she stresses that more women are needed in these fields. Her journey stands as a powerful example of what is possible when talent, opportunity, and commitment meet.\n\nShe also acknowledged the support she received from the Ministry of Health and Child Care during her training, noting that the goal was to build national capacity so Zimbabweans can receive specialised treatment locally.\n\nZimbabwe Historical Facts\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Dr. Kudzai Kanyepi has made history as Zimbabwe’s first female cardiothoracic surgeon and the first woman to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/23/zim-female-cardio-doctor-breaks-record/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Female Cardio Doctor Breaks Record\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Supreme Court Judge Chatukuta Dies",
            "url": "https://www.zimeye.net/2025/11/23/supreme-court-judge-chatukuta-dies/",
            "content": "By A Correspondent The Judicial Service Commission (JSC) has announced the death of Supreme Court Judge Feliciah Chatukuta. She was 63.\n\nIn a statement released this weekend, the JSC said:\n\nThe Chief Justice of Zimbabwe and Chairperson of the Judicial Service Commission, Hon. Justice Luke Malaba; the Judicial Service Commissioners; the Senior Judge of the Supreme Court; Judges and Magistrates; the Secretary of the Judicial Service Commission; and all members of the Judicial Service would like to express their deepest condolences to the Chatukuta family on the passing of Supreme Court Judge, Honourable Justice Feliciah Chatukuta, in Harare on Saturday, 22 November 2025.\n\nMourners are gathered at Number 18 Lower Hampden Road, Marlborough, Harare. Funeral arrangements will be announced in due course.\n\nJustice Chatukuta was appointed a Judge of the High Court on 29 August 2005, where she served for 16 years before being elevated to the Supreme Court on 3 June 2021. After obtaining her Bachelor of Laws (LLB) degree from the University of Zimbabwe in 1985, she worked as a public prosecutor and later as a part-time lecturer at the University of Zimbabwe, among other roles in the justice sector.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The Judicial Service Commission (JSC) has announced the death of Supreme Court Judge Feliciah Chatukuta. She was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/23/supreme-court-judge-chatukuta-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Supreme Court Judge Chatukuta Dies\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Mnangagwa Regime Unveils 500 Green Bombers",
            "url": "https://www.zimeye.net/2025/11/23/mnangagwa-regime-unveils-500-green-bombers/",
            "content": "Tinashe Sambiri The Emmerson Mnangagwa administration this week rolled out yet another batch of National Youth Service recruitsreviving a programme long associated with intimidation, political indoctrination and partisan enforcement.\n\nA total of 533 youths completed a six-month training course at the Guyu Youth Training Centre, a facility reactivated after nearly two decades.\n\nVice-President Kembo Mohadi, in a speech delivered on his behalf, portrayed the programme as a nation-building initiative. He claimed it was meant to equip young people with the skills, knowledge, and experience necessary to become active contributors to national development. He insisted the training supposedly reflects Governments unwavering commitment to empowering the youth.\n\nHowever, critics argue the intentions are far from noble, given the National Youth Services troubled history. The Green Bombers are widely accused of harassing opposition supporters.\n\nEven Mohadis assurance that graduates would be absorbed into state structures has sparked concern, as he said Government is steadfast in its commitment to ensuring that trained youths are afforded opportunities for job placement and empowerment.\n\nMohadi continued to defend the programme, declaring that the youth service training programme stands as a powerful testament to the boundless potential of Zimbabwes youth, despite fears that such training has historically served partisan agendas rather than national development.\n\nDuring the same event, Youth Minister Tino Machakaire announced an aggressive expansion of the programme. He said enrolment would grow to 10,000 in 2026, insisting that patriotism-driven instruction remained vital. The youths have been taught values of patriotism, discipline, voluntarism and resilience, he saidlanguage many observers say mirrors past efforts to mould young people into political tools.\n\nOther government officials delivered similarly glowing praise. Dr Omphile Marupi said youths must understand the nations journey, values and vision, remarks critics interpret as signalling political alignment over genuine civic education.\n\nWhile officials attempted to portray the graduates as model citizens, scepticism remains high. The National Youth Services past is stained by its use as a partisan weapon, with members mobilised to intimidate and silence critics of the ruling party.\n\nFor many Zimbabweans, the re-emergence of the programmerevived and expanded this weekraises serious concerns about its real purpose as the Mnangagwa regime tightens its grip on power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– The Emmerson Mnangagwa administration this week rolled out yet another batch of National Youth Service recruits—reviving a programme … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/23/mnangagwa-regime-unveils-500-green-bombers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Unveils 500 Green Bombers\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Health Ministry Cracks Down on Fraudsters Targeting Nursing Applicants…",
            "url": "https://www.zimeye.net/2025/11/23/health-ministry-cracks-down-on-fraudsters-targeting-nursing-applicants/",
            "content": "By A Correspondent  The Ministry of Health and Child Care has launched investigations into a fake nursing recruitment website and a surge of social media scams targeting aspiring nursing applicants.\n\nIn a statement, the ministrys spokesperson, Mr Donald Mujiri, said fraudsters were using WhatsApp groups, social media platforms and private cellphone numbers to mislead desperate applicants into believing they could secure nursing school places through unofficial channels.\n\nHe stressed that legitimate recruitment is only announced through mainstream print media and the ministrys verified social media pages. Mr Mujiri warned that anything outside these platforms is fake, illegal and aimed at stealing money from the public.\n\nWe are working with law enforcement to track, arrest and prosecute all individuals involved in these scams, he said. Corruption, bribery and backdoor recruitment will not be tolerated. The public is advised not to pay anyone, join unofficial groups, or respond to private phone numbers claiming to assist with nursing entry or job placement.\n\nNurse training in Zimbabwe remains one of the most competitive programmes in the health sector, attracting thousands of applicants for limited slots each year.\n\nTo improve transparency, the ministry recently decentralised the recruitment process to ensure local applicants benefit. However, the high demand has also created opportunities for manipulation and exploitation by scammers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Ministry of Health and Child Care has launched investigations into a fake nursing recruitment website … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/23/health-ministry-cracks-down-on-fraudsters-targeting-nursing-applicants/\">Continue reading<span class=\"screen-reader-text\"> \"Health Ministry Cracks Down on Fraudsters Targeting Nursing Applicants…\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Zengeza and St Mary’s SDA Church Members in Britain Meet for the Second Time",
            "url": "https://www.zimeye.net/2025/11/23/zengeza-and-st-marys-sda-church-members-in-britain-meet-for-the-second-time/",
            "content": "By Elder Dr. Masimba Mavaza\n\nNorthampton, UK  Zengeza and St Marys church members in the United Kingdom gathered for their second reunion in Northampton. The event, held at Crispin Drive, Northampton NN5 4GJ, brought together old friends and saints from across the region.\n\n.\n\nThe atmosphere was vibrant as attendees reunited and reconnected with loved ones. The reunion offered moments of nostalgia, laughter, and joyful tears as families and friends reflected on the past and shared their faith.\n\nZengeza and St Marys church members in the United Kingdom gathered for their second reunion in Northampton. The event, held at Crispin Drive, Northampton NN5 4GJ, brought together old friends and saints from across the regionpic.twitter.com/XRNTn3XUaH\n\nElders recounted stories of triumph and hardship while children played in the background. The sound of old-time music and the aroma of traditional foods filled the air, transporting many back to cherished memories.\n\nGuest speaker Pastor Simba Muhau encouraged attendees to remember their roots, while Elder Chigodho challenged the saints to continue developing their homes. The programme featured music, singing, and a moving sermon by Mufaro Manomano, Dr. Manomanos first-born, whose singing was described as angelic.\n\nThe reunion highlighted the strength of love, family, and togetherness. Among the attendees were Pastor Simba Muhau, Elder Tigere, Jimmy Manomano, Elder Joseph Manomano, and many others.\n\nThe event was a success thanks to the dedicated team behind the scenes, led by Joseph Manomano, Innocent Muza, Sister Joyce, and Brother Lloyd Rangarira.\n\nThe gathering gave attendees an opportunity to network, reminisce, and simply be themselves among people who knew them long before lifes changes and responsibilities shaped who they are today.\n\nAs one attendee remarked, Our generation is passing on. We are no longer who we once were. Chatting on Facebook or WhatsApp isnt the same as meeting in person. We all want to look as young as we once did, but life has happened, and the signs of time are showing.\n\nThe event concluded with a vote of thanks from Innocent Muza, who expressed gratitude for the chance to reconnect with old friends.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Elder Dr. Masimba Mavaza Northampton, UK — Zengeza and St Mary’s church members in the United Kingdom gathered for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/23/zengeza-and-st-marys-sda-church-members-in-britain-meet-for-the-second-time/\">Continue reading<span class=\"screen-reader-text\"> \"Zengeza and St Mary’s SDA Church Members in Britain Meet for the Second Time\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Paul Mwazha Declared 2nd Clergy National Hero, After Ezekiel Guti",
            "url": "https://www.zimeye.net/2025/11/23/paul-mwazha-declared-2nd-clergy-national-hero-after-ezekiel-guti/",
            "content": "By Dr Masimba Mavaza | Zimbabwes President Emmerson Mnangagwa has declared the revered leader of the African Apostolic Church, Mutumwa Paul Mwazha, a national hero. The 107-year-old clergyman is recognised for his significant contributions to Zimbabwean society.\n\nThe announcement was made by Permanent Secretary Nick Mangwana, who stated: Mutumwa Apostle Mwazha, a National Hero. His Excellency President E.D. Mnangagwa has conferred National Hero status upon Mutumwa Apostle Paul Mwazha. Burial arrangements will be announced and guided by the family.\n\nThis decision reflects President Mnangagwas inclusive approach to honouring national figures, broadening the criteria for national hero status to recognise influential Zimbabweans from diverse fields.\n\nMutumwa Paul Mwazha, founder and leader of the African Apostolic Church, has shaped Zimbabwes spiritual landscape for decades. His legacy extends beyond Zimbabwe, with a vast following in neighbouring countries.\n\nThe burial will take place at Chirasauta on November 30, 2025, following a multi-day programme of public commemorations.\n\nFuneral arrangements:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | Zimbabwe’s President Emmerson Mnangagwa has declared the revered leader of the African Apostolic Church, Mutumwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/23/paul-mwazha-declared-2nd-clergy-national-hero-after-ezekiel-guti/\">Continue reading<span class=\"screen-reader-text\"> \"Paul Mwazha Declared 2nd Clergy National Hero, After Ezekiel Guti\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Chiwenga’s G20 Breakthrough Propels Zimbabwe Onto the World Stage",
            "url": "https://www.zimeye.net/2025/11/22/chiwengas-g20-breakthrough-propels-zimbabwe-onto-the-world-stage/",
            "content": "By Shelton Muchena| The G20 Leaders Summit in Johannesburg unfolded with its usual blend of formality, ambition, and competing global interests, yet the presence of Zimbabwes Vice President, Dr Constantino Chiwenga, prompted far more curiosity than many expected. International officials and analysts quietly noted that his arrival coincided with a moment of widening speculation about the internal dynamics shaping Zimbabwes leadership. His meeting with the British Prime Minister added fuel to those conversations, suggesting that the global community may be recalibrating its view of a nation long considered isolated.\n\nInterviews with diplomats who attended private sessions at the summit indicate that the Vice Presidents engagement with foreign leaders was more substantive than the brief public footage suggested. Several sources described him as measured, composed, and entirely at ease in discussions involving trade, governance, and regional security. These characterisations stood in contrast to Zimbabwes recent diplomatic posture, which has often been cautious and at times defensive on the international stage.\n\nQuestions have emerged regarding the Presidents absence from the summit. Officials in Harare offered routine explanations, yet the timing has not gone unnoticed among international observers, who read Dr Chiwengas expanded role as indicative of a political landscape in subtle motion. Analysts from European and Asian policy institutes remarked that such a high-profile diplomatic appearance by a vice president typically reflects internal calculations that extend beyond the demands of a single conference.\n\nThe meeting between Dr Chiwenga and the British Prime Minister, while not officially framed as a breakthrough, carried deeper resonance among foreign ministries monitoring southern Africa. Britains cautious approach to Zimbabwe over recent decades has been shaped by political disagreements and contested elections. The willingness of both sides to engage in direct conversation at such a high level was interpreted by some experts as a tentative step towards re-establishing channels that have remained dormant for years.\n\nIn Zimbabwe, the reaction was immediate. Citizens, political commentators, and business groups all raised the same question: why is the Vice President taking centre stage at such a critical global forum? Interviews conducted across Harare revealed a population increasingly aware of its standing in the world and eager for signs that international partners may once again see value in Zimbabwes potential. Many respondents expressed the view that the Vice Presidents diplomatic engagements projected a sense of stability that has been missing from the countrys international profile.\n\nForeign policy experts argue that the timing of this diplomatic moment is significant. Global powers are actively deepening their engagement with African states, and Zimbabwe is strategically positioned within a region gaining fresh geopolitical importance. Dr Chiwengas ability to present himself as a reliable and confident representative has not gone unnoticed among governments seeking regional partners who can influence political and economic developments.\n\nThe Johannesburg summit has now placed Dr Chiwenga in a position where his next moves will be scrutinised not only in Harare but also in London, Beijing, Brussels, Delhi, and Washington. Whether he will continue to step into a broader diplomatic role remains uncertain, yet the summit demonstrated that international actors are prepared to observe Zimbabwes internal shifts with a renewed level of attention. As one European analyst put it, the Vice President has entered a space where every gesture carries meaning and every meeting is interpreted as a signal of the future Zimbabwe may be shaping.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena| The G20 Leaders Summit in Johannesburg unfolded with its usual blend of formality, ambition, and competing global … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/22/chiwengas-g20-breakthrough-propels-zimbabwe-onto-the-world-stage/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga’s G20 Breakthrough Propels Zimbabwe Onto the World Stage\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Ex ZANU PF Member Jealousy Mawarire Rebuke Themba Mliswa",
            "url": "https://www.zimeye.net/2025/11/22/ex-zanu-pf-member-jealousy-mawarire-rebuke-themba-mliswa/",
            "content": "By Shelton Muchena, England|Jealousy Mawarires sharp words cut across X like a blade, slicing into a debate that had been simmering for weeks. His message was directed at outspoken former legislator Temba Mliswa yet its impact rippled far beyond the two men, touching the broader political imagination of Zimbabweans watching from the sidelines.\n\nMawarire accused Mliswa of an obsession with attacking former army commander and Vice President Constantino Chiwenga, arguing that the fixation was having the opposite of its intended effect. Instead of damaging Chiwengas reputation, he said, Mliswa was inadvertently strengthening the generals support base.\n\nCde, your obsession with soiling Gen Chiwenga because ED is your brother is whats galvanising people around Gen Chiwenga, Mawarire wrote in a post that quickly went viral.\n\nHe made it clear that his words were not an endorsement of sainthood, but a recognition of intenthis view of Chiwenga as a man attempting to chart a different path.\n\nZimbabweans know who Gen Chiwenga is. They know he isnt infallible. They also acknowledge he is not an angel, Mawarire continued. But they know, in him, there is a desire to correct whats wrong with our country, starting with stopping the criminals who have been looting national resources and assets.\n\nMawarire asserted that Mliswas defence of President Emmerson Mnangagwa and prominent business figures accused by critics of corrupt dealings was revealing. He stressed that these were claims and perceptions held by many citizens not settled facts but maintained that they shaped public sentiment.\n\nWhen you come in defending these individuals and attacking Gen Chiwenga for advocating for the arrest of the same criminals, he said, it becomes clear that you are fronting particular interests.\n\nIn his closing, Mawarires message shifted from critique to conviction.\n\nThats where our convergence with Gen Chiwenga is. He is one of us and in him we see ourselves. We are actually inseparable.\n\nWhether one views the exchange as political theatre, genuine conviction, or a battle for public perception, one thing is clear: the conversation around Chiwenga has intensified, pulling more voices into a debate that shows no signs of quieting.\n\nAnd in this unfolding political storm, a single social-media thread has once again demonstrated the power of words to reshape momentum, challenge alliances, and ignite a nations attention.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena, England|Jealousy Mawarire’s sharp words cut across X like a blade, slicing into a debate that had been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/22/ex-zanu-pf-member-jealousy-mawarire-rebuke-themba-mliswa/\">Continue reading<span class=\"screen-reader-text\"> \"Ex ZANU PF Member Jealousy Mawarire Rebuke Themba Mliswa\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "VP Chiwenga With UK Prime Minister",
            "url": "https://www.zimeye.net/2025/11/22/vp-chiwenga-with-uk-prime-minister/",
            "content": "pictures losing below.\n\nVice President Dr Constantino Chiwenga meets British Prime Minister Keir Starmer at the ongoing G20  Leaders Summit in Johannesburg, South Africa. Mukudzei Chingwerepic.twitter.com/3LnQgoIWnS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "pictures losing below….",
            "time": "21:46",
            "date": "23 Nov 2025"
        },
        {
            "title": "Paul Mwazha Declared National Hero",
            "url": "https://www.zimeye.net/2025/11/22/paul-mwazha-declared-national-hero/",
            "content": "By A Correspondent | HARARE President Emmerson Mnangagwa has declared the late Archbishop Paul Mwazha of the African Apostolic Church a national hero.\n\nMwazha died on 20 November 2025 at the age of 107.\n\nGovernment spokesperson Nick Mangwana confirmed the conferment of national hero status, describing Mwazha as an iconic spiritual leader whose influence transcended generations.\n\nArchbishop Mwazha, affectionately known asMutumwa weAfrica, was one of Zimbabwes most revered religious figures. For decades, he led the African Apostolic Church, shaping its doctrine, growth, and identity through teachings anchored in holiness, unity, and African self-determination in worship.\n\nBorn in 1918, Mwazhas spiritual journey stretched across nearly a century. Under his leadership, the African Apostolic Church became one of the most recognisable indigenous Christian movements in Southern Africa. His followers regarded him as a unifying patriarch, a healer, and a moral compass who championed discipline, family stability, and devotion to God.\n\nHis passing has sparked an outpouring of grief across Zimbabwe and abroad, with thousands paying tribute to his long life of service. Many church members described his death as the end of an era in African Christianity.\n\nThis is a profound loss for the entire church. Mutumwa served God faithfully for more than a century, and his legacy will continue to guide us, Bishop Mhizha said.\n\nThe African Apostolic Church is expected to hold a series of gatherings to honour Mwazhas life, with senior clergy coordinating national and regional memorial services in the coming days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | HARARE – President Emmerson Mnangagwa has declared the late Archbishop Paul Mwazha of the African Apostolic Church … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/22/paul-mwazha-declared-national-hero/\">Continue reading<span class=\"screen-reader-text\"> \"Paul Mwazha Declared National Hero\"</span></a></p>",
            "time": "21:46",
            "date": "23 Nov 2025"
        }
    ]
}