{
    "news": [
        {
            "title": "Machakaire “Empathy” Over Hospital Crisis Seen as Political Theatre",
            "url": "https://www.zimeye.net/2025/05/05/machakaire-empathy-over-hospital-crisis-seen-as-political-theatre/",
            "content": "By Dorrothy Moyo | ZimEye | Zimbabweans have erupted in a wave of anger and ridicule following a social media post by Cabinet Minister Machakaire, who claimed to be deeply moved by the deplorable state of the countrys public hospitals. The post, which seemed to express personal concern and called on the president to witness the crisis firsthand, has instead triggered widespread public skepticism and accusations of political stagecraft.\n\nSocial media users were quick to condemn the ministers remarks, accusing him of playing to the gallery while failing to use his Cabinet position to push for real change.\n\nIwe handitika uno rapwa ku Singapore hospital, saka uri bho, tweeted @vsachi73, bluntly accusing the minister of hypocrisy for seeking treatment abroad while pretending to empathize with local struggles.\n\nStop madrama, we are not fools, added @DonaldMudowaya, summing up the widespread sentiment that the ministers public appeal was little more than an orchestrated drama to manage political optics.\n\nVivienne Marara (@vivienne_lt) added a sharp observation on the performative nature of such visits: Kana voyenda for the visit ngavangoyerekana vasvika. Vakapa advance notice vanosvika Hospital Admin yamhanya mhanya kuvhara magap. Her point reflects public suspicion that such visits are staged, with hospital authorities tipped off in advance to cover up the decay.\n\nBut perhaps the most piercing criticism came from Guguletu Dlodlo (@gugu_dl odlo): With all due respect Hon. @HonMachakaire why not raise these concerns directly in those forums and push for tangible action? Or is this just part of a staged political performance?\n\nThese comments, which have gone viral, reflect the growing frustration among citizens who see the governments response to Zimbabwes healthcare crisis as performative and disingenuous. For many, the ministers sudden show of sympathy rings hollow, especially given his proximity to the president and his long-standing access to decision-making spaces.\n\nAs public trust erodes further, one thing is clear: the people are no longer buying rehearsed empathythey demand accountability.\n\nStory developing\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | Zimbabweans have erupted in a wave of anger and ridicule following a social media … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/machakaire-empathy-over-hospital-crisis-seen-as-political-theatre/\">Continue reading<span class=\"screen-reader-text\"> \"Machakaire “Empathy” Over Hospital Crisis Seen as Political Theatre\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Arda Güler Shines in Real Madrid Win",
            "url": "https://www.zimeye.net/2025/05/05/arda-guler-shines-in-real-madrid-win/",
            "content": "By Sports Correspondent\n\nReal Madrids rising star Arda Gler lit up the Santiago Bernabu on Sunday, scoring a stunning goal and providing an assist in the clubs thrilling 3-2 La Liga victory over Celta de Vigo.\n\nThe Turkish international, still only 19, delivered a moment of brilliance that drew roars from the home crowd. His goalan expertly placed strike from the edge of the boxwas followed by a clever assist to Kylian Mbapp, further cementing his growing influence in Carlo Ancelottis side.\n\nSpeaking after the match, Gler expressed both pride and humility. We started very well with the 3-0 but we should have finished better, he said, referring to Madrids dominant start that nearly slipped away as Celta fought back late in the game.\n\nThe young midfielder also acknowledged the support he received from the Real Madrid faithful. Real Madrid fans gave me a lot of encouragement today, he said. Their support means everything to meit pushes me to do more on the pitch.\n\nWhen asked about his assist for Mbapps goal, Gler deflected the praise. My assist to Mbapp? It wasnt that greatit was all because of Kylians great run, he said modestly.\n\nGlers performance has sparked excitement among fans and pundits alike, with many now calling for him to feature more regularly in Madrids starting lineup as the season intensifies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Real Madrid’s rising star Arda Güler lit up the Santiago Bernabéu on Sunday, scoring a stunning goal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/arda-guler-shines-in-real-madrid-win/\">Continue reading<span class=\"screen-reader-text\"> \"Arda Güler Shines in Real Madrid Win\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Two Arrested For Gang Raping Popular Harare Socialite",
            "url": "https://www.zimeye.net/2025/05/05/two-arrested-for-gang-raping-popular-harare-socialite/",
            "content": "By Crime and Courts Reporter- Two Harare men Blessing Dube and Martin Charlie were on Monday arraigned before Harare magistrate Marewanazvo Gofa accused of gang raping a socialite Ashley Masendeke better known as Mai Jeremaya in entertainment circles.\n\nDube 27 from Chitungwiza and Charlie from Manresa were sent to Remand Prison awaiting their bail ruling on Tuesday.\n\nAccording to the State, on April 9 2025, Dube contacted Masendeke, inviting her for a business meeting, but they failed to meet on the day in question.\n\nOn April 30 2025, Masendeke allegedly received a WhatsApp message from Charlie, and they met at Megawatt along Samora Machel, and he drove to number 11 Frank Johnson Eastlea for business.\n\nThe second accused (Charlie) went into the building pretending to go and see his boss, and he came back in a few minutes. The first accused (Dube) came with a certain lady called Sbahle and they entered the car.\n\nThe second accused drove to town, where Sbahle was dropped off, and then drove to Eastlea, where he parked at number 15 Frank Johnson Avenue, Eastlea, Harare.\n\nThe first accused went into the building, and the second accused told the complainant to go inside the room where the meeting was supposed to be held.\n\nThe complainant was shocked to see a bed, and when she turned back, she saw the second accused locking the door, and the first accused entered the room using the other door, locked it and started to laugh.\n\nThe complainant cried for help but was silenced by the first accused who told her not to anger the second accused and ordered her to remove her clothes, reads court papers.\n\nThe court heard that Charlie pushed her onto the bed and undressed her and Dube forced her to suck his manhood.\n\nThe two allegedly took turns to rape her whilst forcing themselves on her mouth.\n\nAfter the act the complainant went to the bathroom where the second accused was and he again had sexual intercourse with her once without her consent.\n\nThe first accused also had sexual intercourse with her for the second time without her consent, the State alleges further.\n\nThe court heard that the accused persons booked an in-drive for the complainant and she went home that is when she filed a police report.\n\nRufaro Chonzi is prosecuting.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- Two Harare men Blessing Dube and Martin Charlie were on Monday arraigned before Harare magistrate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/two-arrested-for-gang-raping-popular-harare-socialite/\">Continue reading<span class=\"screen-reader-text\"> \"Two Arrested For Gang Raping Popular Harare Socialite\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Caps United To Appoint New Head Coach",
            "url": "https://www.zimeye.net/2025/05/05/caps-united-to-appoint-new-head-coach/",
            "content": "By Sports Correspondent\n\nCAPS United are set to appoint a new head coach this Thursday as part of a sweeping technical restructuring aimed at rescuing their faltering season.\n\nThe club has already unveiled former player Ian Bakala as the new assistant coach, while long-serving gaffer Lloyd Chitembwe has been reassigned to the role of Technical Director. The rest of the previous technical team has been dismissed, with a full overhaul expected to be in place ahead of this weekends match against Herentals.\n\nAnnouncing the changes at a press conference on Monday, CAPS United president Farai Jere said the reshuffle is part of efforts to stabilize the team after a disappointing start to the campaign.\n\nIan Bakala will serve as the assistant head coach in the new technical team. A new head coach will be announced on Thursday, said Jere. We will also introduce a new technical setup that will take effect this weekend. Lloyd Chitembwe will remain with the club and assume the position of Technical Director.\n\nThe technical shake-up comes as Makepekepe find themselves hovering just above the relegation zonecurrently 15th on the log with only eight points from ten matches.\n\nSupporters are hopeful the new coaching team can turn things around and restore the clubs competitive edge.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent CAPS United are set to appoint a new head coach this Thursday as part of a sweeping … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/caps-united-to-appoint-new-head-coach/\">Continue reading<span class=\"screen-reader-text\"> \"Caps United To Appoint New Head Coach\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Of Property Development Fraud: Distinguishing Between the Honest and the Deceptive – The Gray Homes Scandal",
            "url": "https://www.zimeye.net/2025/05/05/of-property-development-fraud-distinguishing-between-the-honest-and-the-deceptive-the-gray-homes-scandal/",
            "content": "Part 1 of a 5-part investigative series on real estate fraud in Zimbabwe\n\nA couple of months ago, Zimbabwes business community was left reeling when Gray Homes Constructions owners, Annavestah and Gray Mudiwa, were accused of defrauding Miniyothabo Baloyi-Chiwenga, the wife of Vice President Constantino Chiwenga, of nearly US\\$1 million in a series of construction deals gone awry .\n\nThe audacity of the alleged scamtargeting someone so closely connected to the nations highest officehas sent shockwaves through the country. If individuals with such influence can fall victim to fraudulent schemes, what hope is there for the average citizen seeking to build their dream home?\n\nThis article marks the beginning of a five-part investigative series titled Distinguishing Between the Honest and the Deceptive  Property Development Fraud in Zimbabwe. We aim to shed light on the murky world of real estate fraud, starting with the Gray Homes saga.\n\nThe Alleged Deception Unfolds\n\nIn March 2023, the Mudiwas reportedly convinced Baloyi-Chiwenga that they could construct a double-storey house, a cottage, and a boundary wall within 90 days. Trusting their assurances, she paid them US\\$560,000. However, the project was never completed, and she suffered a loss of US\\$389,100 .\n\nThe pattern continued in June 2023 when the couple allegedly misled her into believing they could build a warehouse at Chivaraidze Farm in Goromonzi. She paid them US\\$550,000, but again, the project was left incomplete, resulting in a loss of US\\$390,000 .\n\nIn September 2023, the Mudiwas purportedly convinced Baloyi-Chiwenga to fund the construction of a shopping mall at Silalatshani Business Centre in Filabusi. She handed over US\\$158,000, but the funds were allegedly diverted for personal use, leading to a loss of US\\$151,000 .\n\nLegal Proceedings and Withdrawal of Charges\n\nThe couple was arrested and brought before the courts to face multiple fraud charges. However, in a surprising turn of events, Baloyi-Chiwenga withdrew the charges against them in February 2025. No reasons were provided for this decision .\n\nDespite the withdrawal, the Mudiwas legal troubles were far from over. Other victims came forward with similar allegations, leading to additional charges.\n\nA Pattern of Alleged Fraud Emerges\n\nBeyond the high-profile case involving Baloyi-Chiwenga, the Mudiwas faced seven counts of fraud from various complainants:\n\nBail and Ongoing Legal Battles\n\nAfter spending four months in custody, the Mudiwas were granted bail in February 2025. They were released on US\\$500 bail each, ordered to surrender their passports, report weekly to the CID, and reside at their given addresses .\n\nTheir legal battles continue as they face multiple fraud charges from various complainants.\n\nThe Broader Implications\n\nThe Gray Homes case underscores a troubling trend in Zimbabwes property development sector, where individuals and companies exploit trust to defraud clients. If someone as connected as the Vice Presidents wife can fall victim, it raises concerns about the vulnerabilities faced by ordinary citizens.\n\nThis series aims to delve deeper into such cases, exploring the mechanisms of fraud, the legal frameworks in place, and the stories of those affected.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Part 1 of a 5-part investigative series on real estate fraud in Zimbabwe A couple of months ago, Zimbabwe’s business … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/of-property-development-fraud-distinguishing-between-the-honest-and-the-deceptive-the-gray-homes-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Of Property Development Fraud: Distinguishing Between the Honest and the Deceptive – The Gray Homes Scandal\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Pro-Democracy Activist Bvunzawabaya Donates Groceries To Madzibaba Veshanduko’s Family",
            "url": "https://www.zimeye.net/2025/05/05/pro-democracy-activist-bvunzawabaya-donates-groceries-to-madzibaba-veshandukos-family/",
            "content": "By A Correspondent| Pro-democracy activist, Clever Bvunzawabaya has donated groceries and blankets to the familiy of opposition activist, Godfrey Karembera popularly known as Madzibaba Veshanduko.\n\nThe donation by Bvunzawabaya follows an attack on Madzibaba Veshandukos homestead in Guruve South Constituency.\n\nSuspected state security agents petrol bombed Madzibaba Veshandukos homestead last week and his 17 year old son was left with injuries while trying to rescue his two siblings.\n\nSources confirmed to Zimeye thatKaremberasresidence was set ablaze by individuals believed tobe linkedto President Emmerson Mnangagwaloyalists,amid fears he would mobilize support for a nationwide shutdown protest announced by war veteran and political Cde Blessed Geza.\n\nTheidentity of the attackersremains unknown, but opposition insiders suspect it was a preemptive strike to deter Karembera from participating in or rallying support for the protest action.\n\nHuman rights organisations have widely condemned the attack on Madzibaba Veshandukos homestead which was literally reduced to ashes.\n\nMadzibaba veShanduko, a longtime ally of opposition leader Nelson Chamisa and a symbol of peaceful resistance, has faced repeated harassment by the police and state security agents in recent years.\n\nThis latest attack, however, marks a new and dangerous escalation in targeted violence against political dissenters.\n\nBvunzawabaya said he was touched by Madzibaba Veshandukos plight hence his decision to donate towards the welfare of his family.\n\nHe was accomoanied by his wife, Alleta Chirinda who expressed concern over the continued attack on Madzibaba Veshanduko.\n\nI was touched by the plight of Madzibaba Veshandukos family and felt obligated to assist. The attack on his family shows that as a nation, we are failing to observe the basic tenets of democracy and the opposition is clearly under attack from people that want to entrench dictatorship and authoritarianism.\n\nThe government of Zimbabwe must respect fundamental rights as enshrined under the constitution. Our Constitution guarantees freedom of expression and association and these rights should be respected . Victimising people because of their political affiliations is unacceptable and should be condemned in the strongest of terms, said Bvunzawabaya.\n\nA strong critic of the ZANU PF led government, Bvunzawabaya has been critical about human rights abuses and corruption in Zimbabwe.\n\nAs citizens, we have the right to call the government to order and this should never be criminalised. The government of Zimbabwe must learn to respect and appreciate political diversity and desist from persecuting dissenting voices, said Bvunzawabaya.\n\nHis wife, Alleta said she was deeply touched by the attack on Madzibaba Veshandukos homestead.\n\nAs a mother it pains me to see a family going through so much persecution. I can feel the pain and I will certainly mobilise more support for this family. No one deserves to live in this way in a modern world, said Alleta who also appealed to well wishers to come forward and assist Madzibaba Veshanduko.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Pro-democracy activist, Clever Bvunzawabaya has donated groceries and blankets to the familiy of opposition activist, Godfrey Karembera … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/pro-democracy-activist-bvunzawabaya-donates-groceries-to-madzibaba-veshandukos-family/\">Continue reading<span class=\"screen-reader-text\"> \"Pro-Democracy Activist Bvunzawabaya Donates Groceries To Madzibaba Veshanduko’s Family\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Minister Tatenda Mavetera Kneels In Front Of Chikomba West Residents: A Sign Of Humility Or Mere Pretence?",
            "url": "https://www.zimeye.net/2025/05/05/minister-tatenda-mavetera-kneels-in-front-of-chikomba-west-residents-a-sign-of-humility-or-mere-pretence/",
            "content": "Minister Tatenda Mavetera sparked debate after kneeling before residents of Chikomba West during a Ward Development meeting held on Sunday, May 4, 2025, in Ward 11.\n\nPosting on Facebook, Mavetera wrote: From the people you come, from the people you live. This was yesterday, Sunday 4 May 2025, in Ward 11, Chikomba West Constituency, having our Ward Development meeting.\n\nThe gesture has drawn mixed reactions, with some praising it as a display of humility, while others questioned its sincerity.\n\nMinister Tatenda Mavetera Kneels In Front Of Chikomba West Residents: A Sign Of Humility Or Mere Pretence?Minister Tatenda Mavetera sparked debate after kneeling before residents of Chikomba West during a Ward Development meeting held on Sunday, May 4, 2025, in Ward 11.pic.twitter.com/dv4N1i4KF1\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Minister Tatenda Mavetera sparked debate after kneeling before residents of Chikomba West during a Ward Development meeting held on Sunday, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/minister-tatenda-mavetera-kneels-in-front-of-chikomba-west-residents-a-sign-of-humility-or-mere-pretence/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Tatenda Mavetera Kneels In Front Of Chikomba West Residents: A Sign Of Humility Or Mere Pretence?\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Is Masvingo Losing Its Smart City Status?",
            "url": "https://www.zimeye.net/2025/05/05/is-masvingo-losing-its-smart-city-status/",
            "content": "By A Correspondent\n\nMasvingos claim to smart city status is under scrutiny after city councillors and management were met with widespread litter and poor sanitation during a routine clean-up campaign on Friday.\n\nDespite being part of the nationwide monthly National Clean-Up Campaign, the visible neglect in parts of the city has raised concerns about Masvingos ability to maintain the standards of a modern, smart urban centre.\n\nIn a statement, the City of Masvingo reaffirmed its commitment to environmental sustainability, saying, Cleanliness is not just a one-day event but a lifestyle. This campaign is a reminder that people share the responsibility to maintain a healthy environment for current and future generations.\n\nCity councillors, council officials, residents, business partners, and community organizations all took part in cleaning up streets, open spaces, and public facilities in the central business district. Key areas tackled included the Garikai Fruits and Vegetables Market, Chimusana Bridge, and the Chikato Police Station vicinity.\n\nYet, the campaign also exposed a deeper problem: the citys ongoing struggle with consistent waste management and public participation. Councillors reportedly expressed concern over the volume of litter found in areas that should be routinely maintained.\n\nOne city official, speaking on condition of anonymity, remarked, Its discouraging to see how much litter builds up just weeks after the last campaign. We need more than eventswe need a cultural shift.\n\nThe citys own statement echoed this sentiment, urging residents to go beyond monthly participation. The City encourages all residents to continue observing monthly clean-up days and to adopt sustainable waste management habits in their homes and workplaces.\n\nAs the city battles the visible signs of decay, the question lingers: is Masvingo doing enough to live up to its smart city ambitions?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo’s claim to “smart city” status is under scrutiny after city councillors and management were met with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/is-masvingo-losing-its-smart-city-status/\">Continue reading<span class=\"screen-reader-text\"> \"Is Masvingo Losing Its Smart City Status?\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "Fix Hospitals, Youth Minister Tells Mnangagwa",
            "url": "https://www.zimeye.net/2025/05/05/fix-hospitals-youth-minister-tells-mnangagwa/",
            "content": "By A Correspondent\n\nZimbabwes Youth Minister, Tino Machakaire, has made a bold appeal to President Emmerson Mnangagwa to urgently address the deteriorating state of the countrys public health institutions. His remarks, delivered in an open and heartfelt statement, highlight the deepening crisis in Zimbabwes healthcare system.\n\nMachakaire said he was compelled to speak out after a personal visit to a government hospital to see a relative.\n\nI visited one of our public health institutions this morning to see a relative and left deeply concerned by the conditions I witnessed, he said. What I saw was deeply movinga clear indication that many of our people are facing serious challenges.\n\nHe acknowledged the widespread criticism of the healthcare system, noting that the public outcry was not exaggerated but rooted in the everyday experiences of ordinary Zimbabweans.\n\nThe growing public outcry over our healthcare system is not an exaggeration; it reflects the difficult experiences of many citizens, Machakaire emphasized.\n\nIn a rare moment of candid reflection, the minister called on President Mnangagwa to witness the situation firsthand.\n\nYour Excellency, you have earned the admiration of this nation for your compassion, humility and tireless dedication to the welfare of ordinary citizens I respectfully plead with you: please find time from your busy schedule to visit these institutions yourself. There is no substitute for seeing, listening and understanding firsthand what our citizens are going through, he urged.\n\nMachakaire also commended fellow citizens who have spoken up about public issues, saying their voices reflect the kind of participatory leadership the nation needs.\n\nI also wish to commend those who have had the courage to raise their voices on matters of public interest. Their advocacy reflects a belief in the kind of leadership you representa leadership that listens, acts and puts people first, he said.\n\nHis statement has sparked conversations across social media, with many Zimbabweans applauding the minister for his honesty and courage to speak truth to power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s Youth Minister, Tino Machakaire, has made a bold appeal to President Emmerson Mnangagwa to urgently address … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/fix-hospitals-youth-minister-tells-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Fix Hospitals, Youth Minister Tells Mnangagwa\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        },
        {
            "title": "ZESA Increases Load Shedding …",
            "url": "https://www.zimeye.net/2025/05/05/zesa-increases-load-shedding-2/",
            "content": "Tinashe Sambiri\n\nZimbabweans should brace for longer hours without electricity after the Zimbabwe Electricity Supply Authority (ZESA) announced increased load shedding due to a technical fault at Hwange Power Station.\n\nIn a statement released over the weekend, ZESA Holdings confirmed the incident, which has led to a significant drop in power generation at one of the countrys key energy facilities.\n\nZESA Holdings would like to advise its valued stakeholders of a technical fault that occurred at Hwange Power Station, resulting in the reduction of available power supplies, the utility said in a statement dated May 4, 2025.\n\nThis unforeseen incident has necessitated increased load shedding across all customer groups. Our technical team is working to rectify the problem and restore normal operations within the shortest possible time, the statement added.\n\nWhile the nature of the fault was not specified, the impact is already being felt across the country, with many households and businesses reporting extended power outages.\n\nZESA apologized for the disruption, saying, The inconvenience caused is sincerely regretted.\n\nHwange Power Station is Zimbabwes largest coal-fired power plant and plays a central role in national electricity generation. Any disruptions at the station typically have widespread effects.\n\nThe announcement has sparked concern among citizens and industry players alike, especially given the growing energy demands as the winter season approaches.\n\nZESA urged the public to stay updated via their official platforms, including their website www.zesaholdings.co.zw and social media pages (@officialZESA on X and @ZESAHOLDINGS_).\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Zimbabweans should brace for longer hours without electricity after the Zimbabwe Electricity Supply Authority (ZESA) announced increased load … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/05/zesa-increases-load-shedding-2/\">Continue reading<span class=\"screen-reader-text\"> \"ZESA Increases Load Shedding …\"</span></a></p>",
            "time": "21:27",
            "date": "06 May 2025"
        }
    ]
}