{
    "news": [
        {
            "title": "Police Car Collides With Moving Train After ZRP Driver Failed To Stop",
            "url": "https://www.zimeye.net/2025/05/13/police-car-collides-with-moving-train-after-zrp-driver-failed-to-stop/",
            "content": "Gweru, Zimbabwe  Tuesday 13 May 2025\n\nBy Dorrothy Moyo | ZimEye | Two police officers were injured after a Zimbabwe Republic Police (ZRP) Mahindra vehicle was struck by a moving train at a rail-level crossing near the Vehicle Inspection Department (VID) depot in Gweru.\n\nAccording to a report by The Sunday Mail, the crash occurred after the police driver allegedly failed to give way to the oncoming train. Emergency responders rushed to the scene in the early evening, as eyewitnesses reported the vehicle had been dragged some distance by the locomotive upon impact.\n\nWhile the full extent of the officers injuries remains unclear, officials confirmed both were inside the vehicle at the time of the crash. They were taken to a local hospital for urgent medical attention.\n\nThe incident has sparked a flurry of outrage on social media, with users questioning the professionalism and training of the officers involved. One commenter, Khumbulani Moyo, posted: So who is to follow the rules while the enforcement agents are failing? Another, Gladmore Mpofu, demanded an investigation: They must be investigated how did they got the job because they dont look professional and [fit] for their positions.\n\nOthers mocked the situation, suggesting possible corruption or recklessness. Dickson Man Dee Manyawu quipped: Maybe they tried to block the train for a bribe since it was overspeeding.\n\nThe crash raises serious concerns about the conduct and preparedness of law enforcement officers on duty, especially in high-risk traffic zones. The Zimbabwe Republic Police has not yet issued an official statement on the accident.\n\nAuthorities are expected to launch a full investigation into the circumstances surrounding the crash, including whether safety protocols at the rail crossing were observed and whether the officers exercised due diligence.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Gweru, Zimbabwe – Tuesday 13 May 2025 By Dorrothy Moyo | ZimEye | Two police officers were injured after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/police-car-collides-with-moving-train-after-zrp-driver-failed-to-stop/\">Continue reading<span class=\"screen-reader-text\"> \"Police Car Collides With Moving Train After ZRP Driver Failed To Stop\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Mnangagwa Banker Evades Parliament Grilling Over Corrupt Tenders, Lavish Lifestyle",
            "url": "https://www.zimeye.net/2025/05/13/mnangagwa-banker-evades-parliament-grilling-over-corrupt-tenders-lavish-lifestyle/",
            "content": "By Parliament Reporter-Finance SecretaryGeorge Guvamatanga,often dubbedMnangagwas bankerfor his powerful grip on Zimbabwes Treasury, has again dodged parliamentary scrutiny over a string of controversial multi-million-dollar payments, including irregular tenders linked to the Zimbabwe Electoral Commission (ZEC) and politically connected businessmanWicknell Chivayo.\n\nGuvamatanga on Monday failed, for thesecond consecutive time, to appear before the Public Accounts Committee (PAC), a no-show that has angered lawmakers and prompted threats of legal summons.\n\nThe PAC, chaired byKuwadzana MP Charlton Hwende, is probingUS$400 million in direct paymentsmade by Treasury to various companies without routing through the appropriate line ministries  a blatant violation of thePublic Finance Management Act.\n\nAmong the biggest beneficiaries isRen-Form CC, a South African company controversially handpicked to print election materials for ZEC. Financial records in South Africa show Ren-Form received overR1.2 billion (approx. US$65 million)in public funds from Zimbabwes Treasury. Alarmingly,R800 millionof that amount is suspected to have been redirected to accounts linked toWicknell Chivayo, a flamboyant businessman with well-documented ties to the ruling elite.\n\nZEC, chaired byJustice Priscilla Chigumba, has come under fire for bypassing normal procurement regulations. Despite repeated denials, insiders allege the contracts wererubber-stamped by Guvamatanga, who approved payments outside official procurement channels.\n\nHwende told journalists that Guvamatanga has been given afinal ultimatumto appear before Parliamentthis Friday, failing which the committee will issuesummons through the Clerk of Parliament.\n\nThis is the last opportunity. If he doesnt appear on Friday, summons will be issued immediately. There must be accountability, Hwende said.\n\nThe PAC also wantsFinance Minister Mthuli Ncubeto testify, particularly on whether Treasurys payment methods have become a tool for patronage and corruption.\n\nIn addition to Ren-Form, the committee has demanded documents on direct Treasury disbursements to:\n\nThese irregularities suggest a deliberate centralization of financial power under Guvamatanga, allowing him toprioritize contracts without cabinet oversight, thus opening doors to political abuse.\n\nGuvamatangas refusal to appear before Parliament has renewed scrutiny over hisaccumulated wealth, much of which remains unexplained. Investigations show that heowns multiple luxury properties in South Africa, including anR18 million mansion in Sandton, Johannesburgs wealthiest suburb.\n\nHe has also been linked to the purchase oftop-of-the-range vehicles for alleged girlfriends, includinga Mercedes-Benz G63 AMG and a Porsche Cayenne, both registered in the names of proxies. Social media videos and court documents have occasionally surfaced linking him tolavish birthday parties, designer watches, and private jets, all while Zimbabwes economy struggles under inflation and widespread poverty.\n\nDespite public outrage, Guvamatanga appears to enjoypolitical protectionfrom PresidentEmmerson Mnangagwa, under whose administration he has consolidated power over Treasury disbursements. Sources in the rulingZanu PFparty suggest he is considered untouchable because he is part of acore group managing presidential election logisticsandstrategic campaign financing.\n\nIronically, while Guvamatanga dodges Parliament, civil servants are crying over delayed salaries, unpaid pensions, and poor working conditions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Parliament Reporter-Finance Secretary George Guvamatanga, often dubbed “Mnangagwa’s banker” for his powerful grip on Zimbabwe’s Treasury, has again dodged parliamentary scrutiny over … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/mnangagwa-banker-evades-parliament-grilling-over-corrupt-tenders-lavish-lifestyle/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Banker Evades Parliament Grilling Over Corrupt Tenders, Lavish Lifestyle\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Harare Quartet fined for Se* at a Beauty Parlour",
            "url": "https://www.zimeye.net/2025/05/13/harare-quartet-fined-for-se-at-a-beauty-parlour/",
            "content": "By A Correspondent | Four Harare women have been fined US$30 each and sentenced to two months wholly suspended conditionally following their conviction for soliciting for sex at a beauty parlour situated at No30 Helm Avenue in the capital.\n\nThe four Charity Makoni,.Josephine Tapi 22, Miriam Bimha and Shyline Sibanda.\n\nThey were arrested alongside the owner of the parlour Cassandra Mavhura who was facing several criminal charges.\n\nThe four appeared before Harare magistrate Ruth Moyo and pleaded guilty to soliciting for sexual services.\n\nThe court heard that the women were offering massage services to male clients and soliciting for sexual acts at No 30 Helm Avenue, Harare.\n\nThe police raided the place after getting tips that the parloir was also in the business of of selling sex at a cost of US$20 per session.\n\nMavhura was also fined for soliciting for the purpose of prostitution, living off or facilitating prostitution, procuring for the purpose of prostitution and contaravening the Shop Licences Act.\n\nNomsa Kangara prosecuted.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Four Harare women have been fined US$30 each and sentenced to two months wholly suspended conditionally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/harare-quartet-fined-for-se-at-a-beauty-parlour/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Quartet fined for Se* at a Beauty Parlour\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Former Warriors, Bafana Bafana Stars Clash In Legends Tournament",
            "url": "https://www.zimeye.net/2025/05/13/former-warriors-bafana-bafana-stars-clash-in-legends-tournament/",
            "content": "Sports Correspondent\n\nThe Zimbabwe national team legends are set to take part in the 2025 edition of the Clash of Legends, a four-nation football exhibition tournament to be hosted in Botswana.\n\nThe event, scheduled for June 21, will be held at the Obed Itani Chilume Stadium in Francistown. The participating teams include Zimbabwe Legends, Botswana Legends, South Africa Legends, and Namibia Legends.\n\nAccording to Botswanas The Daily News, the Zimbabwe Legends will face South Africa Legends in one of the semi-final clashes, while hosts Botswana will go up against Namibia. The winners of these encounters will advance to the final, while the losing sides will battle it out for third place.\n\nFormer Warriors midfielder Tinashe Nengomasha will take charge of the Zimbabwe Legends, with Dikgang Mabalane coaching South Africa, Boitumelo Mafhoko leading Botswana, and Dokkies Schmidt managing the Namibian side.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe national team legends are set to take part in the 2025 edition of the Clash of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/former-warriors-bafana-bafana-stars-clash-in-legends-tournament/\">Continue reading<span class=\"screen-reader-text\"> \"Former Warriors, Bafana Bafana Stars Clash In Legends Tournament\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Vemuganga FM Puts Ndau Culture in the Spotlight",
            "url": "https://www.zimeye.net/2025/05/13/vemuganga-fm-puts-ndau-culture-in-the-spotlight/",
            "content": "By Showbiz Reporter As Zimbabwe commemorates the Month of Culture this May,Vemuganga FM 106.8, broadcasting from Chipinge, stands out as a powerful force in the preservation and promotion of Ndau heritage.\n\nThe station is not just a voice on the airwavesit is a cultural movement, inspired by decades of civic activism, community development, and a deep-rooted pride in local identity.\n\nAt the helm of this cultural renaissance isClaris Madhuku, a renowned civic leader, human rights defender, and founder of the Platform for Youth Development Trust (PYD).\n\nFormore thantwo decades, Madhuku has been a fearless advocate for marginalised communities in Chipinge, with a track record of empowering rural youth, defending land rights, and championing indigenous culture.\n\nHis transition into community broadcasting marked a bold new chapter in hisactivismone that uses the power of media to tell local stories and amplify the Ndau voice.\n\nLaunched under his stewardship,Vemuganga FMhas become a cornerstone of cultural revitalisation in the southeastern district.\n\nThe station broadcasts primarily in Ndau, providing a crucial platform for music, poetry, traditional knowledge, and storytelling. Its motto,The Best for Chipinge  Ndizvo Zvetinoita Kanyi, reflects its unwavering commitment to community empowerment through culture and innovation.\n\nOne of the stations shining stars isEdwin Hlatywayo, a gifted artist born and raised in Chikore, the cultural heartland of the VaNdau.\n\nEdwin is a painter, poet, dramatist, signwriter, welder, and potteran embodiment of the creative spirit Vemuganga FM seeks to nurture.\n\nWith the stations support, Edwin was nominated to represent Chipinge Visual Artists at theHarmonies of Expressionexhibition held in Harare from 9 to 11 May 2025.\n\nThe event, organized by theNational Association of Community Broadcasters (NACB),brought together artists from across the country to explore the theme of climate change through creative expression.\n\nEdwins work stood out not just for its artistic flair but for the cultural depth itcarriedsteeped in the traditions, rhythms, and worldview of the Ndau people. He is also a key contributor to theNdau Festival of the Arts (NDAFA), where he serves as Secretary and regularly exhibits at thePaiyepo Arts Centrein Chikore.\n\nReflecting on his journey, Edwin says, My path in art and culture is driven by intrinsic motivationrecognising my talent, staying consistent in practice, and staying rooted in purpose. You dont need to be formally educated to create meaning. What matters is passion and perseverance.\n\nFor Claris Madhuku, this is precisely the kind of transformation community media can achieve. Vemuganga FM exists to give a voice to the people of Chipinge, he says. Its about celebrating our stories, reclaiming our identity, and investing in the creative future of our young people. Culture is not a luxuryits a right, and we are here to protect and promote it.\n\nAs Zimbabwe marks the Month of Culture,Vemuganga FM 106.8is more than a broadcasterit is a living archive, a training ground, and a symbol of what community-driven media can achieve when guided by visionaries like Claris Madhuku. In the voices of local artists and the sounds of Ndau heritage, a new cultural consciousness is risingone that remembers, cherishes, and boldly shares the soul of Chipinge with the nation and the world.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – As Zimbabwe commemorates the Month of Culture this May, Vemuganga FM 106.8, broadcasting from Chipinge, stands out as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/vemuganga-fm-puts-ndau-culture-in-the-spotlight/\">Continue reading<span class=\"screen-reader-text\"> \"Vemuganga FM Puts Ndau Culture in the Spotlight\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Truworth Tours Kombi Involved in Fatal Crash Near Iron Juk Turn, Harare-Bindura",
            "url": "https://www.zimeye.net/2025/05/13/truworth-tours-kombi-involved-in-fatal-crash-near-iron-juk-turn-harare-bindura/",
            "content": "Bindura  Tuesday, May 13, 2025\n\nA tragic road accident involving a commuter minibus belonging to True Worth Tours has claimed lives and left several injured near the Iron Juk turn along the Harare-Bindura road.\n\nThe white kombi, which was reportedly travelling from Harare, veered off the road and crashed into a ditch, sustaining extensive damage. Eyewitnesses and early social media reports from the scene suggest the accident was severe, with some passengers allegedly dying on the spot.\n\n.\n\nComments from local residents who witnessed the aftermath paint a grim picture. It was bad that one ndiyo inonzi tsaona, said one witness, while others expressed sorrow at seeing bodies being removed by police. A Facebook user commented, Ndapfuura vanhu vachitobviswa nepolice, zvakangooma.\n\nThe cause of the accident has not yet been officially confirmed, but community feedback hints at possible speeding or loss of control, with some lamenting the reckless driving habits of kombi drivers along that stretch.\n\nOne comment read: Vakomana vacho vanozomhanya, veduwe, while another said, Combie vakomana vanenge vachifamba mamwe atingazotaura hedu mazita. Its so sad.\n\nEmergency services were quickly dispatched to the scene, and investigations are ongoing. Authorities are expected to release an official statement once next of kin are informed.\n\nThis tragedy adds to Zimbabwes mounting road safety concerns, particularly on the Harare-Bindura route known for its high accident rate.\n\nMore updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bindura – Tuesday, May 13, 2025 A tragic road accident involving a commuter minibus belonging to True Worth Tours has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/truworth-tours-kombi-involved-in-fatal-crash-near-iron-juk-turn-harare-bindura/\">Continue reading<span class=\"screen-reader-text\"> \"Truworth Tours Kombi Involved in Fatal Crash Near Iron Juk Turn, Harare-Bindura\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Veteran Coach Saul Chaminuka To Take Charge Of Ailing Harare Giants Dynamos FC?",
            "url": "https://www.zimeye.net/2025/05/13/veteran-coach-saul-chaminuka-to-take-charge-of-ailing-harare-giants-dynamos-fc/",
            "content": "Sports Correspondent\n\nSaul Chaminuka is reportedly on the verge of becoming the new head coach of Dynamos FC, a club currently struggling to find form.\n\nThe big question now: Can he revive the fortunes of Dembare?\n\nWhile much of the current spotlight is on club owner Bernard Marriot-Lusengofor all the wrong reasonstheres another key figure worth mentioning: Dynamos also has a chairman, Moses Maunganidze.\n\nWhether his role is merely ceremonial is a debate for another time.\n\nWhat matters for now is that he holds the position of chairman at the club.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Saul Chaminuka is reportedly on the verge of becoming the new head coach of Dynamos FC, a club … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/veteran-coach-saul-chaminuka-to-take-charge-of-ailing-harare-giants-dynamos-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran Coach Saul Chaminuka To Take Charge Of Ailing Harare Giants Dynamos FC?\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Fadzayi Mahere-Judge Authorises US$138,000 Property Scam",
            "url": "https://www.zimeye.net/2025/05/13/fadzayi-mahere-judge-authorises-us138000-property-scam/",
            "content": "The judge who promoted Emmerson Mnangagwas new Thokozani Khupe-character, Fadzayi Mahere with a fake defamation award, has ruled in favour of a USD138,000 scam.\n\nBy A Correspondent | ZimEye | The High Court has dismissed an application by the Harare Municipal Medical Society (HMMAS) which was seeking a refund of US$138,000 from former RBZ governors adviser Munyaradzi Kereke.\n\nThe claim was centered around a foiled purchase of Fortress Hospital in Ruwa.\n\nHigh Court judge Justice Jacob Mafusire dismissed the case, calling the demand opportunistic and stating, The plaintiff has failed to prove any aspect of its case.\n\nHMMAS had sued Kereke and Briward Trading (PVT), seeking a refund plus interest, confirmation of the cancellation of their sales agreement, and a declaration that they had paid the full purchase price for the hospital.\n\nThe society claimed it purchased Fortress Hospital in November 2014 through two agreements: one for the immovable property, Stand 9653 Ruwa Township, and another giving it the right of first refusal for associated assets.\n\nThe defendants were represented by agent Newton Madzika, while the plaintiff was represented by its former Chief Executive Officer, Evaristo Rukasha.\n\nThe purchase price for the property was US$800,000, with the equipment and fittings costing US$650,000. HMMAS alleged it made these payments, with US$700,000 paid through a now-defunct bank and the remainder through the conveyancers, Muza & Nyapadi.\n\nThe court was told that on March 21, 2022, Kereke allegedly colluded with Rukasha, who signed an acknowledgment of debt for US$400,000 on behalf of HMMAS.\n\nThe society claimed this was an abuse of office, as it had already fully paid for the hospital. Rukasha was dismissed following disciplinary proceedings related to this act.\n\nIt said Kereke, relying on the acknowledgment of debt, coerced HMMAS into signing a new agreement on August 31, 2023, which stated a purchase price of US$1,138,900, claiming US$866,900 had already been paid, leaving a balance of US$272,000.\n\nHMMAS contended it had made US$138,000 in payments under what it termed an unlawful agreement. The reconstituted Board, led by Zacharia Murerwa, stated the agreement was induced by fraud or duress.\n\nHMMAS sought confirmation of its ownership and full payment for Fortress Hospital, demanding the refund of the US$138,000.\n\nKereke countered the claim arguing that the payment of US$650,000 towards the hospitals assets was never received among other things.\n\nFurthermore, Kereke criticized the plaintiffs pleadings as inelegant and called the legal narrative presented by both parties a complete bog.\n\nUltimately, the High Court found no merit in HMMASs claims, concluding that Kereke successfully defended himself against the allegations.\n\nThe plaintiff has failed to prove any aspect of its case.\n\nThe first defendant destroyed the plaintiffs case completely. The plaintiff has no case. This suit is manifestly opportunistic. The defendants are entitled to judgment, said Mafusire.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The judge who promoted Emmerson Mnangagwa’s new Thokozani Khupe-character, Fadzayi Mahere with a fake defamation award, has ruled in favour … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/fadzayi-mahere-judge-authorises-us138000-property-scam/\">Continue reading<span class=\"screen-reader-text\"> \"Fadzayi Mahere-Judge Authorises US$138,000 Property Scam\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Mnangagwa’s Own Teachers4ED Association Snubs Stay -away",
            "url": "https://www.zimeye.net/2025/05/13/mnangagwas-own-teachers4ed-association-snubs-stay-away/",
            "content": "By A Correspondent\n\nThe ZANU PF-aligned Teachers for ED Association has publicly rejected calls for a stay-away, urging educators across Zimbabwe to report for duty despite the worsening economic hardships that have left many teachers financially incapacitated.\n\nIn a statement released on Monday, the association emphasized the importance of maintaining continuity in the education system, especially as schools reopen for the second term on 13 May 2025.\n\nAs educators, we recognize our profound responsibility to students and communities, the statement read. In light of the new terms commencement, the Teachers for ED Association urges all teachers to report for work prioritizing the needs of our students and the education system.\n\nWhile many teachers have expressed frustration over stagnant salaries and poor working conditions, the Teachers4ED Association called for restraint and dialogue. Amidst challenging times, we urge professionalism and a commitment to the greater good in discussions around salaries and working conditions, said Aleta Makomeke, the associations national spokesperson.\n\nMakomeke acknowledged that teachers are financially strained but claimed the government is making genuine efforts to address their grievances. The government has shown a desire to engage and find solutions. By working together, we can navigate this challenge while upholding the education systems integrity and safeguarding student well-being, she stated.\n\nThe association, which aligns itself with President Emmerson Mnangagwas Vision 2030 and identifies with the Herbert Chitepo school of thought, argued that industrial action at this critical timeparticularly for exam classescould severely impact students futures.\n\nLets lead by example, demonstrating wisdom, empathy, and commitment to national betterment, Makomeke added.\n\nHowever, the statement has sparked mixed reactions, especially among educators who argue that urging teachers to return to work without addressing long-standing salary issues is out of touch with the reality on the ground. Many teachers continue to report being unable to meet basic living expenses despite repeated promises of reform.\n\nDespite these concerns, the Teachers for ED Association maintains that staying in the classroom is the most responsible course of action, emphasizing patience and negotiation over protest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ZANU PF-aligned Teachers for ED Association has publicly rejected calls for a stay-away, urging educators across … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/mnangagwas-own-teachers4ed-association-snubs-stay-away/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Own Teachers4ED Association Snubs Stay -away\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        },
        {
            "title": "Pro-Mnangagwa Teachers’ Group Urges Suffering Educators to Ignore Strike…",
            "url": "https://www.zimeye.net/2025/05/13/pro-mnangagwa-teachers-group-urges-suffering-educators-to-ignore-strike/",
            "content": "By A Correspondent\n\nThe ZANU PF-aligned Teachers for ED Association has urged educators across Zimbabwe to ignore calls for a stay-away and report for duty, despite widespread financial struggles that have left many teachers barely surviving.\n\nIn a statement released on Monday, as schools prepared to reopen for the second term on 13 May 2025, the association emphasized the need to prioritize students over protests, insisting that continuity in learning is criticalespecially for exam classes.\n\nAs educators, we recognize our profound responsibility to students and communities, read the statement. In light of the new terms commencement, the Teachers for ED Association urges all teachers to report for work prioritizing the needs of our students and the education system.\n\nWhile most educators are voicing frustration over low pay and poor working conditions, Aleta Makomeke, national spokesperson for the association, urged patience and constructive dialogue.\n\nAmidst challenging times, we urge professionalism and a commitment to the greater good in discussions around salaries and working conditions, Makomeke said. The government has shown a desire to engage and find solutions. By working together, we can safeguard student well-being and uphold the education systems integrity.\n\nClosely aligned with President Emmerson Mnangagwas Vision 2030, the Teachers for ED Association presented itself as a group committed to national betterment and referenced the Herbert Chitepo school of thought as its ideological grounding.\n\nLets lead by example, demonstrating wisdom, empathy, and commitment to national betterment, Makomeke added.\n\nHowever, the statement has been met with criticism from educators, many of whom argue that encouraging teachers to work without addressing their deteriorating financial situation is unrealistic and dismissive. Reports from several provinces suggest teachers are unable to afford basic needs, with some walking long distances to work or skipping meals.\n\nStill, the Teachers for ED Association remains firm that staying in the classroom is the most responsible course of action, favoring negotiation over industrial action as the solution to Zimbabwes ongoing education crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ZANU PF-aligned Teachers for ED Association has urged educators across Zimbabwe to ignore calls for a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/13/pro-mnangagwa-teachers-group-urges-suffering-educators-to-ignore-strike/\">Continue reading<span class=\"screen-reader-text\"> \"Pro-Mnangagwa Teachers’ Group Urges Suffering Educators to Ignore Strike…\"</span></a></p>",
            "time": "21:46",
            "date": "14 May 2025"
        }
    ]
}