{
    "news": [
        {
            "title": "“Do Not Lose Hope,” Says Chamisa Amid Growing Challenges",
            "url": "https://www.zimeye.net/2025/10/26/do-not-lose-hope-says-chamisa-amid-growing-challenges/",
            "content": "By A Correspondent\n\nCitizens leader Advocate Nelson Chamisa has urged his supporters to remain hopeful and patient amid the countrys deepening social and political challenges, reminding them that faith and endurance remain key in times of uncertainty.\n\nIn his Sunday message, Chamisa encouraged Zimbabweans not to despair, stressing that waiting is not a sign of weakness but a necessary process of preparation and growth.\n\nPrepare always be ready. You have to be ready! he said. In waiting, you are working. You are working the perfect way and will of God.\n\nDrawing inspiration from the biblical story of David, Chamisa highlighted that even those destined for greatness must first go through seasons of delay. David was no stranger to the wait. He was chosen king, and yet he had to wait even when Saul was already rejected, dethroned and gone. As jealousy and vitriol grew, David would have to wait even longer for the throne that was already assured, he explained.\n\nThe Citizens leader said that waiting is part of the journey of transformation and leadership. Waiting isnt wasted when God is in it. Waiting is a classroom where character is moulded, purpose refined and faith is forged, said Chamisa.\n\nHe reminded his followers that trials and delays are meant to test commitment and authenticity. The longer you wait, the more you see who is authentic and who isnt. Waiting isnt just about what youre hoping for; its about whats coming, what its impact would mean and the character it would require, he said.\n\nChamisa reassured the nation that patience will ultimately pay off. Make no mistake, waiting is not a waste. It is an investment into whats coming. The good thing is that the wait is not foreverit is the perfect will of God, he said.\n\nHe urged Zimbabweans not to be consumed by fear or anxiety, saying that divine timing always prevails. Yes, we may be anxious, worried and suffering. But we are all vessels in the act, plan and timing of the Maker. Our timing is not Gods timing. He who promised us is faithful. He will consummate His Word and fulfil His promise, Chamisa concluded.\n\nBlessed Sunday, he added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Citizens leader Advocate Nelson Chamisa has urged his supporters to remain hopeful and patient amid the country’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/do-not-lose-hope-says-chamisa-amid-growing-challenges/\">Continue reading<span class=\"screen-reader-text\"> \"“Do Not Lose Hope,” Says Chamisa Amid Growing Challenges\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Mnangagwa Admits Economic Chaos But Blames “Sanctions” For Citizens Suffering",
            "url": "https://www.zimeye.net/2025/10/26/mnangagwa-admits-economic-chaos-but-blames-sanctions-for-citizens-suffering/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has once again blamed Western sanctions for Zimbabwes worsening economic crisis, admitting that the country is facing serious challenges but insisting that illegal, heinous sanctions are to blame rather than government failures.\n\nSpeaking at the SADC Anti-Sanctions Day commemorations held at the Heritage Village in Harare on Saturday, Mnangagwa painted a grim picture of the countrys situation, acknowledging the economic turmoil but maintaining that Zimbabweans must remain masters of our own destiny.\n\nWe are facing head-on challenges and shocks, such as these illegal, heinous sanctions, climate change-induced droughts, and other public health emergencies, he said, attempting to link the sanctions to the deepening suffering many citizens face daily.\n\nDespite widespread poverty, inflation, and crumbling public services, Mnangagwa claimed that the countrys great walls remain strong and that the nations house of stone will never be breached. Critics, however, argue that these statements reflect a disconnect between the president and the realities on the ground, as millions of Zimbabweans struggle to afford basic necessities.\n\nThe flame of our independence, freedom, and sovereignty burns brighter, Mnangagwa declared. Through unity of purpose, peace, focus, hard, honest work, resilience, and innovative pursuits, any obstacle, in whatever form, can be overcome.\n\nHowever, his claims of progress and resilience come at a time when the Zimbabwean dollar continues to lose value, public hospitals lack essential drugs, and unemployment remains rampant. Many citizens and opposition leaders have accused Mnangagwas administration of hiding behind the sanctions narrative to avoid taking responsibility for decades of economic mismanagement and corruption.\n\nThe president boasted that the country was on a positive growth trajectory, citing increases in foreign currency earnings and resilience in key sectors such as mining and manufacturing. Despite the effects of illegal sanctions, our national economy has been on a positive growth trajectory, he said, insisting that Zimbabwe will achieve its Vision 2030 goal of becoming an Empowered and Prosperous Upper Middle-Income Society.\n\nObservers have, however, dismissed these claims as propaganda, pointing to widespread hunger, a collapsing healthcare system, and a cost-of-living crisis that has left millions in despair.\n\nMnangagwa admitted that sanctions have made it difficult for Zimbabwe to access global lines of credit, but critics argue that rampant corruption, policy inconsistency, and lack of investor confidence have done far more damage than any sanctions regime. Regrettably, the illegal economic sanctions have fundamentally disrupted the ability of our country to access global lines of credit, he said, adding that his administration has adopted home-grown innovative development financing models to keep the country afloat.\n\nAt the same event, the president launched a book titled Standing Against Illegal Sanctions, Resistance, Policy Innovations and Advocacy, a government-backed publication that seeks to defend his administrations policies over the past two decades.\n\nWhile Mnangagwa continues to rally against sanctions, public sentiment remains bleak. For many Zimbabweans, the presidents repeated blame on external forces no longer holds weight, as daily hardships worsen and the promises of prosperity under the so-called Second Republic remain unfulfilled.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has once again blamed Western sanctions for Zimbabwe’s worsening economic crisis, admitting that the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/mnangagwa-admits-economic-chaos-but-blames-sanctions-for-citizens-suffering/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Admits Economic Chaos But Blames “Sanctions” For Citizens Suffering\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Madzibaba Veshanduko Badly Beaten By State Security Agents, Left With Broken Rib As Authorities Block Medical Care…",
            "url": "https://www.zimeye.net/2025/10/26/madzibaba-veshanduko-badly-beaten-by-state-security-agents-left-with-broken-rib-as-authorities-block-medical-care/",
            "content": "By A Correspondent\n\nDetained activist and religious leader, Madzibaba Veshanduko, is reportedly nursing severe injuries, including a suspected broken rib, after being brutally assaulted during what has been described as an abduction and torture by suspected state agents earlier this week.\n\nDespite a court order issued on Thursday directing that he be granted immediate access to medical care, authorities have once again blocked doctors from attending to him. Sources revealed that on Friday morning, officials at Harare Remand Prison turned away a private doctor and nurse who had arrived to treat the injured activist.\n\nPrison authorities allegedly insisted that a separate internal application must first be approved before any medical examination could take place  a move that legal experts have condemned as a clear act of defiance.\n\nThis is not bureaucracy; its a cover-up, said a government insider who spoke on condition of anonymity. They dont want medical professionals to record the extent of his injuries. The delay is deliberate  theyre waiting for the wounds to fade so theres no physical proof linking the abuse to state agents.\n\nCourt documents show that during proceedings on Wednesday, the magistrate briefly cleared the courtroom to allow officials to privately inspect Madzibaba Veshandukos injuries. Following that inspection, the court ordered prison authorities to ensure he receives urgent medical treatment. However, as of Friday, that directive had still not been carried out.\n\nHis lawyers and relatives say the activist is in unbearable pain. He is in visible distress, said a family member. He has a swollen face, bruises all over his back and buttocks, and pain so bad he can hardly walk or sit. We cant understand why the authorities are defying a lawful court order. This is cruel and inhumane.\n\nHuman rights organisations have condemned the ongoing denial of medical care, calling it a gross violation of human rights and a blatant contempt of court.\n\nSince his alleged abduction on Monday night, Madzibaba Veshanduko has not received any medical attention. The governments continued refusal to comply with the courts directive has fuelled growing suspicion that officials are attempting to conceal evidence of torture.\n\nThe activist remains in custody and is expected to return to court on October 28, amid mounting outrage over the states handling of his case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Detained activist and religious leader, Madzibaba Veshanduko, is reportedly nursing severe injuries, including a suspected broken rib, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/madzibaba-veshanduko-badly-beaten-by-state-security-agents-left-with-broken-rib-as-authorities-block-medical-care/\">Continue reading<span class=\"screen-reader-text\"> \"Madzibaba Veshanduko Badly Beaten By State Security Agents, Left With Broken Rib As Authorities Block Medical Care…\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "More VP Chiwenga Loyalists Purged as Mnangagwa Tightens Grip on ZANU PF",
            "url": "https://www.zimeye.net/2025/10/26/more-vp-chiwenga-loyalists-purged-as-mnangagwa-tightens-grip-on-zanu-pf/",
            "content": "By James Gwati  President Emmerson Mnangagwa has dismissed another group of senior ZANU-PF officials linked to his deputy, Vice President Constantino Chiwenga, in what party insiders describe as part of a broader strategy to weaken the retired generals political base ahead of next years crucial elective congress.\n\nThe purge was confirmed during the just-ended22nd ZANU PF Annual National Peoples Conferenceheld in Mutare last week, where delegates endorsed the expulsion of five high-ranking officials  including former Central Committee member and liberation war veteranBlessed Geza. Geza, once a loyal party stalwart, had in recent years become an outspoken critic of Mnangagwas leadership.\n\nAccording to theCentral Committee Reporttabled by Mnangagwa, the conference ratified a series of disciplinary measures  ranging from expulsions and suspensions to demotions and acquittals. ZANU PF national chairperson and head of the National Disciplinary Committee,Oppah Muchinguri-Kashiri, told delegates that the committee had handled 30 disciplinary cases during the review period, including two appeals.\n\nThose expelled include Geza andGifford Gomwefrom Mashonaland West Province, both accused of undermining the authority of the President. Others shown the door wereKudakwashe Gopiof Masvingo Province, andVictor ManingiandSpencer Muterofrom Harare Province.\n\nBlessed Geza, a respected war veteran who served in the Zanla forces during the liberation struggle, was known as a vocal defender of ex-combatants welfare. After independence, he rose through the party ranks to become a Central Committee member. However, his relationship with the Mnangagwa-led leadership soured after he began publicly criticising corruption, patronage, and what he described as the commercialisation of loyalty within ZANU PF.\n\nParty insiders say Gezas closeness to Vice President Chiwenga made him a political target. Both men share strong liberation war credentials and have long-standing ties within the military establishment. Gezas dismissal is therefore seen as part of a wider campaign by Mnangagwa to neutralise Chiwengas remaining loyalists within the ruling party.\n\nTensions between Mnangagwa and Chiwenga date back to the aftermath of the2017 military-assisted transitionthat toppled Robert Mugabe. Although the two men worked together during the coup, their alliance quickly fractured amid competing ambitions over succession, control of the security sector, and access to state resources.\n\nChiwenga, who commanded the military during the 2017 intervention, was initially regarded as Mnangagwas kingmaker. However, as the new administration consolidated power, the former army chief was increasingly sidelined. Mnangagwa has since reshuffled the security apparatus, reassigned senior military figures, and placed loyalists in key party and state institutions to tighten his grip.\n\nAnalysts view the latest expulsions as a continuation of this power struggle. Mnangagwa is systematically eroding Chiwengas influence ahead of the partys elective congress, a Harare-based political analyst, Tirivangani Gunda, told ZimEye. By targeting his allies through party disciplinary processes, the President is ensuring that no alternative power centre emerges within ZANU PF.\n\nThe latest expulsions have revived fears of renewed factional tensions reminiscent of the divisions that paralysed ZANU PF before Mugabes downfall in 2017. War veterans, once Mnangagwas key constituency, are increasingly divided  with some accusing the party leadership of abandoning the liberation ethos and concentrating power in a narrow elite.\n\nObservers warn that if the rift between Mnangagwa and Chiwenga continues to widen, it could unsettle internal party cohesion and heighten instability within the ruling establishment. With the next ZANU PF elective congress looming, the ongoing purges signal a decisive phase in Mnangagwas consolidation of power  but they also risk alienating influential figures within the military and war veterans circles, potentially reigniting tensions that have shaped Zimbabwes volatile post-coup politics.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati — President Emmerson Mnangagwa has dismissed another group of senior ZANU-PF officials linked to his deputy, Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/more-vp-chiwenga-loyalists-purged-as-mnangagwa-tightens-grip-on-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"More VP Chiwenga Loyalists Purged as Mnangagwa Tightens Grip on ZANU PF\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Mnangagwa’s CIOs Cause Havoc in Mhondoro…",
            "url": "https://www.zimeye.net/2025/10/26/mnangagwas-cios-cause-havoc-in-mhondoro/",
            "content": "By A Correspondent\n\nA storm has erupted in Mhondoro after state security agents reportedly confiscated girls soccer jerseys donated by Mutsa Murombedzi, the Member of Parliament for Mashonaland West Proportional Representation.\n\nThe move has sparked outrage and fear among villagers, with many accusing government agents of politically motivated harassment.\n\nSpeaking on Saturday, Murombedzi said the agents stormed a local girls soccer team and seized the jerseys she had donated to support their sporting activities.\n\nSecurity agents have just confiscated the soccer jerseys I donated to a girls soccer team in rural Mhondoro, she said. While I stood in Beijing, marking 30 years of the Beijing Declaration  a global promise to protect girls, promote equality, and end child marriage  they stripped girls in Mhondoro.\n\nMurombedzi said the officials claimed she was not allowed to support the team, a justification she called absurd and cruel.\n\nTheir reason? That I must not support them. Support them how? By helping them stay in school? By fighting teen pregnancies? By giving them dignity through sport? By helping them stay out of drugs? she asked.\n\nThe opposition legislator said the incident shows how authorities fear empowered girls more than they fear social problems like poverty and child marriage.\n\nThey fear empowered girls more than they fear teen pregnancies, said Murombedzi. Through that platform, many girls who were destined to vanish from classrooms into poverty are coming up, opening up, and we are intervening to keep them in school.\n\nShe described the incident as radioactive irony, contrasting her advocacy for girls rights abroad with the repression taking place at home.\n\nIn Beijing, we reaffirmed our commitment to girls. In Zimbabwe, they punished a rural Mhondoro girls soccer team for being seen, for being supported, for daring to dream, she said.\n\nMurombedzi condemned the seizure as shameful and sabotage, saying it undermines national efforts to empower women and combat child abuse.\n\nYou dont fight teen pregnancies by stripping girls of opportunity. You dont fight poverty by punishing those who intervene. You dont preach gender equality while silencing women in action, she said.\n\nShe concluded with a poignant reflection on the meaning of her donation, saying, The jerseys were never just fabric  they were armor.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A storm has erupted in Mhondoro after state security agents reportedly confiscated girls’ soccer jerseys donated by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/mnangagwas-cios-cause-havoc-in-mhondoro/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s CIOs Cause Havoc in Mhondoro…\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "We Can’t Eat Speeches, Angry Harare Resident Tells Mnangagwa",
            "url": "https://www.zimeye.net/2025/10/26/we-cant-eat-speeches-angry-harare-resident-tells-mnangagwa/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has admitted that Zimbabwe is facing a deep economic crisis but once again placed the blame on Western sanctions, sidestepping accusations that his administrations mismanagement and corruption have driven the country into turmoil.\n\nSpeaking at the SADC Anti-Sanctions Day commemorations held at the Heritage Village in Harare on Saturday, Mnangagwa painted a bleak picture of the economy but insisted that so-called illegal, heinous sanctions were to blame for the nations suffering.\n\nWe are facing head-on challenges and shocks, such as these illegal, heinous sanctions, climate change-induced droughts, and other public health emergencies, he said. The president urged citizens to remain resilient, saying Zimbabweans must continue to be masters of our own destiny.\n\nWhile acknowledging the economic hardships faced by ordinary citizens, Mnangagwa claimed that the countrys great walls remain strong and that the house of stone will never be breached. Critics, however, dismissed his remarks as detached from reality, noting that millions of Zimbabweans can no longer afford basic goods amid soaring prices and a collapsing currency.\n\nThe flame of our independence, freedom, and sovereignty burns brighter, Mnangagwa said. Through unity of purpose, peace, focus, hard, honest work, resilience, and innovative pursuits, any obstacle, in whatever form, can be overcome.\n\nHis comments come at a time when inflation continues to spiral, unemployment remains widespread, and public services are deteriorating. Opposition figures and economic analysts argue that the governments fixation on sanctions is a convenient excuse to avoid accountability for years of policy failures.\n\nDespite the effects of illegal sanctions, our national economy has been on a positive growth trajectory, Mnangagwa claimed, pointing to what he described as increases in foreign currency earnings and resilience in key sectors such as mining and manufacturing. He insisted that Zimbabwe remains on track to achieve Vision 2030  the governments plan to transform the nation into an Empowered and Prosperous Upper Middle-Income Society.\n\nHowever, many observers dismissed these assertions as state propaganda. They point to widespread hunger, empty hospital shelves, and a cost-of-living crisis that continues to devastate families across the country.\n\nMnangagwa admitted that sanctions have made it difficult for Zimbabwe to access global lines of credit, but his critics say corruption, policy inconsistency, and lack of investor confidence have caused far more damage than any Western restrictions.\n\nRegrettably, the illegal economic sanctions have fundamentally disrupted the ability of our country to access global lines of credit, he said, adding that his administration has adopted home-grown innovative development financing models to sustain the economy.\n\nAt the same event, Mnangagwa launched a government-backed book titledStanding Against Illegal Sanctions, Resistance, Policy Innovations and Advocacy, which seeks to defend his administrations policies over the past two decades.\n\nDespite the presidents rhetoric, public frustration continues to grow. Many Zimbabweans say the governments repeated reliance on the sanctions narrative is an attempt to mask deeper governance failures.\n\nWere tired of hearing about sanctions. We cant eat speeches  we need real change, an angry Harare resident told journalists after the speech.\n\nThis sentiment reflects growing impatience across the country, as citizens face soaring costs of living, shortages of basic goods, and declining public services, leaving many skeptical of the governments assurances and long-term economic plans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has admitted that Zimbabwe is facing a deep economic crisis but once again placed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/we-cant-eat-speeches-angry-harare-resident-tells-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"We Can’t Eat Speeches, Angry Harare Resident Tells Mnangagwa\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Mnangagwa Pockets Another Celebrity",
            "url": "https://www.zimeye.net/2025/10/26/mnangagwa-pockets-another-celebrity/",
            "content": "By Showbiz ReporterPopular comedian Comic Elder, real name Leeroy Zaware, on Saturday received a brand new Ford Raptor from State House, a gift promised by President Emmerson Mnangagwa during the National Youth Symposium held earlier in the week.\n\nThe gesture, presented in a ceremony that mixed laughter and political symbolism, underscores ZANU PFs long-standing tradition of courting influential artists and celebrities to amplify its political messaging, particularly in the run-up to key political events.\n\nAt the event, Comic Elder entertained the First Lady, Dr Auxillia Mnangagwa, and Youth Minister Tino Machakaire with his trademark humour, explaining why he always carries a large bag. When the President appeared, the comedian pulled out his drivers licence from the bag and handed it to Mnangagwa before being directed to his new Raptor.\n\nI am grateful for this gift. I would also like to thank President Mnangagwa and the people of Zimbabwe for their support and recognition of the work we do. I will continue using my comedy to spread positive messages and encourage young people to stay away from drugs and substance abuse, Comic Elder said.\n\nYouth Minister Tino Machakaire commended the President for honouring his promise, describing Comic Elder as a valuable messenger in the governments youth outreach efforts.\n\nWe want to use his talent to build our nation and raise awareness on social issues. At the moment, we are tackling the scourge of drug and substance abuse, so we will continue to engage people like Comic Elder to reach the youth, Machakaire said. He also thanked Dr Tungwarara, who pledged to build a house for the comedian.\n\nZaware, who brought his parents to witness the handover, has built a strong social media following under various comic personas such asAbigirl Chivanda, Obvious Mututu, Nathan Mutsetse,andAnna Mugwaku.\n\nHowever, Mnangagwas latest act of patronage fits a broader ZANU PF pattern stretching back decades, where the ruling party has co-opted talented artists, musicians, and cultural figures for propaganda or image-building purposes  only to abandon them once their popularity wanes or their political usefulness fades.\n\nDuring the Robert Mugabe era, artists like Andy Brown, Cde Chinx, and Simon Chimbetu were publicly celebrated and rewarded for their allegiance, but many later died in poverty or faded from public support once their voices no longer served the ruling partys messaging needs. Similarly, during the New Dispensation era, musicians such as Holy Ten and Chief Hwenje have been prominently featured at ZANU PF rallies and state events, often facing backlash from fans who view their participation as politically motivated.\n\nPolitical analysts note that the states use of celebrity influence to legitimise authority is part of a broader strategy to shape public perception, particularly among the youth demographic that now consumes most of its media content online.\n\nFor Comic Elder, the Raptor gift marks a career milestone  but history suggests that such gestures are rarely without political strings attached.\n\nThe National Youth Symposium, where the promise was first made, was themed around youth empowerment and participation in national development, though critics argue that such events increasingly serve as political mobilisation platforms rather than genuine empowerment initiatives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter — Popular comedian Comic Elder, real name Leeroy Zaware, on Saturday received a brand new Ford Raptor from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/mnangagwa-pockets-another-celebrity/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Pockets Another Celebrity\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Baba Jukwa Predicts ZIFA’s Soon Defeating Scotland and ED FC",
            "url": "https://www.zimeye.net/2025/10/26/baba-jukwa-predicts-zifas-soon-defeating-scotland-and-ed-fc/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "Beloved Zimbabwean Biker William “Candyman” Jampies Passes Away",
            "url": "https://www.zimeye.net/2025/10/26/beloved-zimbabwean-biker-william-candyman-jampies-passes-away/",
            "content": "By A Correspondent | October 26, 2025\n\nA deep sense of sorrow has engulfed Zimbabwes biking community following the passing of one of its most beloved members, William Jampies, affectionately known as Candyman.\n\nJampies passed away on October 25, 2025, as confirmed by his wife, Jacqueline Jampies, who paid an emotional tribute on social media, describing him as an amazing husband, father, grandfather, and friend to many.\n\nIll miss him dearly. Lord, we need much strength, she wrote, accompanied by a heartbreak emoji  a reflection of the pain now shared across the biking fraternity.\n\nA Brother on Two Wheels\n\nZIM Bikers, the community he proudly called home, also announced the tragic news, calling his death a dark cloud upon the biking community.\n\nWilliam was more than just a biker  he was family, the group wrote. Known for his ever-smiling face, his prayers for journey mercies, and the sweets he lovingly shared with everyone, he brought joy wherever he went. Thats how he earned the name Candyman.\n\nThe biking group highlighted Jampies passion for capturing every event on his camera, keeping memories alive for riders across Zimbabwe.\n\nFond Memories and Lasting Impact\n\nPhotos shared by ZIM Bikers show Williams infectious smile, his trademark biking gear, and moments from community gatherings  including one where he proudly held a trophy and umbrella at a recent biker rally.\n\nHe was celebrated for his kindness, generosity, and unwavering faith, leaving behind not just memories, but a legacy of love and brotherhood.\n\nCommunity in Mourning\n\nMessages of condolence have poured in from across Zimbabwe and beyond, with bikers, friends, and family remembering him as a man who turned every ride into a joyful experience.\n\nTo the family, friends, and the entire biking community, may God comfort and heal our hearts during this difficult time, read part of the ZIM Bikers statement.\n\nRest in Peace, Candyman\n\nWilliam Candyman Jampies will be remembered as a man who embodied unity, laughter, and compassion  a true brother of the road whose kindness reached far beyond the roar of his motorcycle.\n\nMay his soul rest in eternal peace. \n\n#RestInPeaceCandyman #WilliamJampies #ZimBikers #BikerFamily #GoneButNeverForgotten\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | October 26, 2025 A deep sense of sorrow has engulfed Zimbabwe’s biking community following the passing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/beloved-zimbabwean-biker-william-candyman-jampies-passes-away/\">Continue reading<span class=\"screen-reader-text\"> \"Beloved Zimbabwean Biker William “Candyman” Jampies Passes Away\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        },
        {
            "title": "ED Fires Five VP Chiwenga-Aligned Allies",
            "url": "https://www.zimeye.net/2025/10/26/ed-fires-five-vp-chiwenga-aligned-allies/",
            "content": "By a Correspondent President Emmerson Mnangagwa has fired another group of Zanu PF officials linked to his deputy, Vice President Constantino Chiwenga, in what insiders describe as a calculated move to weaken the retired generals influence ahead of the ruling partys elective congress next year.\n\nThe just-ended 22nd Zanu PF Annual National Peoples Conference, held in Mutare last week, endorsed the expulsion of five senior party members  among them former Central Committee member and liberation war veteranBlessed Geza, once a staunch supporter of the ruling party who had become increasingly critical of its leadership.\n\nAccording to the Central Committee Report tabled by Mnangagwa, the conference ratified a series of disciplinary measures that included expulsions, suspensions, demotions, and acquittals. Zanu PF national chairperson and head of the National Disciplinary Committee,Oppah Muchinguri, said her committee handled 30 disciplinary cases during the review period, including two appeals.\n\nThose expelled includeBlessed GezaandGifford Gomwefrom Mashonaland West Province, both accused of undermining the authority of the President. Others shown the door wereKudakwashe Gopiof Masvingo Province, andVictor ManingiandSpencer Muteroof Harare Province.\n\nBlessed Geza, a respected war veteran, once served in the Zanla forces during Zimbabwes liberation struggle. After independence, he became a grassroots mobiliser and later a Central Committee member. Known for defending the welfare of war veterans, Gezas relationship with the Mnangagwa-led leadership deteriorated after he publicly criticised corruption, favouritism, and what he called the commercialisation of loyalty within the party.\n\nSources say Geza was perceived as sympathetic to Vice President Chiwenga, himself a liberation war veteran and key figure in the 2017 military-assisted transition that ousted the late Robert Mugabe and installed Mnangagwa. His expulsion, therefore, is seen by analysts as part of Mnangagwas broader purge of officials perceived to be aligned with the former army commander.\n\nThe friction between Mnangagwa and Chiwenga dates back to the aftermath of the 2017 coup. Although both men were central to Mugabes removal, their alliance quickly fractured over issues of succession, patronage, and control of key state institutions. Chiwenga, who controlled the military and commanded strong loyalty among war veterans, was initially viewed as Mnangagwas kingmaker  but soon emerged as his biggest internal rival.\n\nMnangagwa, wary of Chiwengas military backing, gradually consolidated power by reassigning army loyalists, reshuffling security chiefs, and strengthening his political base through the partys provincial structures. Several Chiwenga allies in both government and Zanu PF have since been sidelined through demotions, disciplinary action, or reassignment to obscure positions.\n\nAnalysts say the latest expulsions represent a continuation of that political chess game. Mnangagwa is systematically isolating Chiwengas supporters to ensure a clear path to his own succession plan, said a Harare-based political commentator. The Mutare conference shows that the President is now confident enough to act against anyone perceived as disloyal  even those with liberation credentials.\n\nGezas expulsion has reignited concerns of renewed factionalism within Zanu PF, reminiscent of the pre-2017 divisions that culminated in Mugabes ouster. War veterans, once Mnangagwas strongest constituency, are increasingly divided  with some openly accusing the leadership of betraying the liberation legacy.\n\nAs Zanu PF prepares for its next elective congress, observers warn that the deepening rift between Mnangagwa and Chiwenga could destabilise the ruling party and even invite renewed military interference in politics  a spectre that continues to haunt Zimbabwes post-coup political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent — President Emmerson Mnangagwa has fired another group of Zanu PF officials linked to his deputy, Vice President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/26/ed-fires-five-vp-chiwenga-aligned-allies/\">Continue reading<span class=\"screen-reader-text\"> \"ED Fires Five VP Chiwenga-Aligned Allies\"</span></a></p>",
            "time": "08:47",
            "date": "27 Oct 2025"
        }
    ]
}