{
    "news": [
        {
            "title": "VP Chiwenga Faces Possible Expulsion – Mliswa",
            "url": "https://www.zimeye.net/2025/10/14/vp-chiwenga-faces-possible-expulsion-mliswa/",
            "content": "By A Correspondent Vice President Constantino Chiwenga could be expelled from ZANU PF at this weeks annual conference, outspoken former Norton MP Temba Mliswa has warned, in what could mark the most dramatic escalation yet in the ruling partys simmering internal power struggle.\n\nIn an explosive interview withZimEye, Mliswa  a former Zanu PF Mashonaland West Provincial Chairperson and one of the most candid voices on ZANU PFs internal politics  predicted that PresidentEmmerson Mnangagwawill use the Mutare conference to consolidate his grip on power and politically neutralize his deputy.\n\nIf theres anyone to be chased this week, it could be Chiwenga at congress, because ED can fire anyone at conference, Mliswa declared. The only safe person at the conference is ED. No one can move a motion to remove him because it has to be on the agenda, and the conference is not an elective congress  just like in 2017.\n\nThe warning comes as the party reels from the recent leak of aconfidential dossierreportedly authored and read by Chiwenga before the Politburo in September, accusing Mnangagwa and his business allies  Kudakwashe Tagwirei, Wicknell Chivayo, Delish Nguwaya, and Scott Sakupwanya  of grand corruption and capturing the state. The document also accused the Presidents inner circle of funding a 2030 Agenda to illegally extend his rule beyond the constitutional two-term limit.\n\nAccording to Mliswa, such open defiance could be the final straw for Mnangagwa, who remains determined to silence internal dissent and project unity ahead of his controversial 2030 campaign.\n\nThe only person untouchable is ED, Mliswa emphasized. He holds all the cards. Chiwenga, just like anyone else, can be dismissed even before the conference ends. Those thinking otherwise are living in denial.\n\nZANU PF insiders say the leaked dossier has deepened mistrust within the Presidium, with Mnangagwas loyalists calling Chiwengas move a declaration of war. The timing of the conference, coupled with the dossiers revelations, has sparked speculation that Mnangagwa may use the gathering to isolate or even expel his deputy under the guise of defending party unity.\n\nMliswa likened the current climate to the tense build-up toNovember 2017, when Chiwenga led the military intervention that toppled the late Robert Mugabe  but this time, he suggested, the former general stands alone.\n\nWho controls the chairpersons? Mliswa asked rhetorically. The only person safe is Mnangagwa because he can only be removed at congress. The VP, including Chiwenga, can be fired by ED anytime  even as the conference ends.\n\nThe former MP, who has often positioned himself as an independent observer of ZANU PFs internal wars, also questioned whether Chiwenga still commands influence within the military, hinting that Mnangagwa has effectively neutralized any residual power bases that once backed the Vice President.\n\nAs the ZANU PF conference unfolds, the political stakes have never been higher. If Mliswas prediction proves accurate, the meeting could mark the end of Chiwengas political career  and the complete consolidation of Mnangagwas power heading into the 2030 succession battle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Vice President Constantino Chiwenga could be expelled from ZANU PF at this week’s annual conference, outspoken former … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/vp-chiwenga-faces-possible-expulsion-mliswa/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Faces Possible Expulsion – Mliswa\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "VP Chiwenga’s Leaked Dossier Sends Shockwaves",
            "url": "https://www.zimeye.net/2025/10/14/vp-chiwengas-leaked-dossier-sends-shockwaves/",
            "content": "By A Correspondent  The leaked anti-Mnangagwa dossier, read by Vice President Constantino Chiwenga before the ZANU PF Politburo recently has sent shockwaves through the ruling partys top ranks  exposing deep divisions over corruption, power, and President Emmerson Mnangagwas bid to extend his rule to 2030.\n\nThe 20-page document, now circulating among senior ZANU PF members, accuses Mnangagwas closest business allies of state capture, massive looting, and orchestrating a treasonous agenda to subvert the Constitution and secure the Presidents stay in power beyond his second term.\n\nIn the dossier, Chiwenga draws chilling parallels between the current political climate and the final days of the late Robert Mugabe, warning that history is repeating itself in the most shameful way.\n\nComrade President, we undertook Operation Restore Legacy with a sacred mandate  to reclaim our nation from the jaws of corruption and to restore the dignity, prosperity, and sovereignty of Zimbabwe, Chiwenga wrote. Today, history is repeating itself. Why we find ourselves in this situation is both shocking and shameful.\n\nThe Vice Presidents statement accuses tycoons Kudakwashe Tagwirei, Wicknell Chivayo, Delish Nguwaya, and gold dealer Scott Sakupwanya of looting overUS$3.2 billionthrough a web of fraudulent state deals. These include Tagwireis controversial stake inKuvimba Mining House, the manipulation ofGreat Dyke Investments, ChivayosZEC payments scandal, NguwayasPomona waste deal, and Sakupwanyas alleged abuse of thegold incentive scheme.\n\nChiwenga said the same clique was now using their stolen wealth to fund Mnangagwas 2030 campaign, bribe party structures, and create a parallel power system within both government and the party.\n\nThe so-called 2030 Agenda is being funded and driven by known criminals who have looted our coffers with impunity, Chiwenga declared. We cannot fold our hands while these criminals capture and destroy our Party.\n\nIn an unusually direct challenge to Mnangagwa, Chiwenga accused the President of allowing his private office to become the hub of corrupt decision-making and of tolerating a network of businessmen who have hijacked key state institutions.\n\nHe warned that the same corrupt tendencies that justified the militarys removal of Mugabe in 2017 were once again threatening the partys survival.\n\nComrade President, tirikuti vanhu ava, Kudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, and Delish Nguwaya, ngavasungwe immediately, Chiwenga demanded. The time for silence and inaction is over.\n\nThe Vice President also lashed out at the controversial Breaking Barriers Initiative, allegedly crafted by exiled former minister Jonathan Moyo to suspend elections until2035, branding it treasonous and warning that it was being covertly implemented with funding from Mnangagwas business backers.\n\nPolitical analysts say the leaking of Chiwengas dossier marks the clearest and most public rupture between Mnangagwa and his deputy since the 2017 coup that brought them to power. Insiders describe the atmosphere in the Politburo as tense and unprecedented, with senior officials split between loyalty to Mnangagwa and alarm over the corruption allegations.\n\nThe explosive leak has reignited speculation that Zimbabwes ruling elite is once again at war with itself  this time over who will control the post-Mnangagwa era. As one senior party source put it:\n\nThe relationship between Mnangagwa and Chiwenga has become exactly what Mugabe and Mnangagwas was in 2017  toxic and unsustainable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The leaked anti-Mnangagwa dossier, read by Vice President Constantino Chiwenga before the ZANU PF Politburo recently … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/vp-chiwengas-leaked-dossier-sends-shockwaves/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga’s Leaked Dossier Sends Shockwaves\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Mliswa Predicts The Fall Of VP Chiwenga",
            "url": "https://www.zimeye.net/2025/10/14/mliswa-predicts-the-fall-of-vp-chiwenga/",
            "content": "By A Correspondent Outspoken former Norton MP Temba Mliswa has sensationally predicted the downfall of Vice President Constantino Chiwenga, warning that he could be the real casualty at this weeks ZANU PF annual conference.\n\nIn a revealing interview withZimEye, Mliswa dismissed growing speculation that President Emmerson Mnangagwa might face an internal revolt, insisting instead that the embattled leader remains firmly in control  while his deputy, Chiwenga, faces mounting political danger.\n\nIf theres anyone to be chased this week, it could be Chiwenga, Mliswa declared. ED can fire anyone at conference. The only safe person there is Mnangagwa. No one can move a motion to remove him because it has to be on the agenda, and this is not an elective congress  just like in 2017.\n\nMliswas remarks come as tensions simmer within ZANU PF ahead of the high-stakes gathering in Harare. The non-elective conference, officially billed as a policy and strategy meeting, has been overshadowed by factional maneuvering, whispers of loyalty tests, and speculation about a looming purge targeting Mnangagwas perceived rivals.\n\nParty insiders say the event has become a litmus test for internal unity, as senior officials, provincial chairpersons, and security elites gather to chart the partys course toward the 2030 elections. But beneath the public show of solidarity, long-standing grudges dating back to the 2017 military-assisted transition continue to haunt the corridors of power.\n\nMliswa, a former Mashonaland West Provincial Chairperson and vocal critic of both Mnangagwa and Chiwenga at different times, drew sharp parallels with the events of November 2017, when the military intervention propelled Mnangagwa to power. He argued that, unlike then, Chiwenga now lacks the institutional leverage to mount a comeback.\n\nWho controls the chairpersons? The only person safe is Mnangagwa because he can only be removed at congress. Nothing will ever happen to him, Mliswa said. The Vice President, including Chiwenga, can be fired by ED even as the conference ends.\n\nThe former legislator further cast doubt on Chiwengas current influence within the Zimbabwe Defence Forces, suggesting that the command structure  once his political lifeline  has shifted its loyalty elsewhere.\n\nAs the ZANU PF conference unfolds, Mliswas prediction underscores the widening cracks within the ruling party and reignites debate over who truly holds power in post-Mugabe Zimbabwe  a question that could define the countrys political trajectory heading into 2030.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Outspoken former Norton MP Temba Mliswa has sensationally predicted the downfall of Vice President Constantino Chiwenga, warning … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/mliswa-predicts-the-fall-of-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Predicts The Fall Of VP Chiwenga\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Mliswa Drops Bombshell – Chiwenga Could Be the One Ousted at ZANU PF Congress",
            "url": "https://www.zimeye.net/2025/10/14/mliswa-drops-bombshell-chiwenga-could-be-the-one-ousted-at-zanu-pf-congress-as-mnangagwa-clings-to-power/",
            "content": "By A Correspondent | ZimEye |Harare, Zimbabwe  October 14, 2025 In a stunning exclusive revelation that could reshape the internal dynamics of Zimbabwes ruling ZANU PF party, controversial political firebrand and former Mashonaland West Provincial Chairperson Temba Mliswa has warned that Vice President Constantino Chiwenga might be the real target for removal at the ongoing ZANU PF annual conference. Speaking to ZimEye in an early morning interview, Mliswa dismissed widespread speculation of an imminent ouster for President Emmerson Mnangagwa, insisting that the embattled leader remains untouchable while his rivals face precarious futures.\n\nAs tensions simmer at the partys high-stakes gathering in Harare  a non-elective conference focused on policy and strategy rather than leadership elections  Mliswa painted a picture of absolute control wielded by Mnangagwa, often referred to as ED. If theres anyone to be chased this week, it could be Chiwenga at congress, because ED can fire anyone at conference, Mliswa declared bluntly. The only safe person at the conference is ED. No one can move a motion to remove him because it has to be on the agenda, and the conference is not an elective congress. Like in 2017.\n\nMliswas comments come amid swirling rumors of factional infighting within ZANU PF, exacerbated by economic woes, corruption allegations, and lingering resentments from the 2017 military-assisted transition that ousted long-time leader Robert Mugabe. The conference, attended by party heavyweights, provincial chairpersons, and security officials, has been billed as a platform for unity, but insiders suggest its become a battleground for loyalty tests.\n\nDrawing parallels to the dramatic events of November 2017, when the militarys intervention paved the way for Mnangagwas ascension, Mliswa questioned the power structures that could enable or thwart any challenge. Who controls the chairpersons? The only person safe is Mnangagwa because he can only be removed at congress. Nothing will ever happen to Mnangagwa, he asserted. The VP, including [Chiwenga], can be fired by ED, even as the conference comes to an end.\n\nThe former lawmaker, known for his outspoken criticism of party hierarchies, went further in dissecting potential military involvement  a perennial flashpoint in Zimbabwean politics. He cast doubt on Chiwengas grip over the Zimbabwe Defence Forces (ZDF), noting the vice presidents recent absence in China during key meetings. And who will command soldiers to come out of the barracks? And remember Chiwenga never promoted enough generals. He kept on with the old guard. And the upcoming are looking to the old guard, and ED has been doing that pushing the young people.\n\nIn a provocative twist, Mliswa argued that the real threat in any coup scenario doesnt emanate from top brass but from mid-level officers hungry for change. The most dangerous person in a coup isnt the general. It is the colonel, the major or the captain. Traore who took power [referring to Burkina Fasos Ibrahim Traor, who seized control in 2022 as a young captain], was he a general? Generals are mainly in power because of strategic thinking; strategies for the war not to go and march or to organise marches.\n\nSecurity crackdowns appear to be in full swing, with Mliswa alleging a heavy presence of plainclothes operatives at the conference venue. And anyone who lifts their head at the conference is being picked up for treason. Theyve put a lot of plainclothes people, he revealed, underscoring the atmosphere of intimidation.\n\nOn the role of law enforcement, Mliswa clarified procedural boundaries: The police are responsible for maintaining law and order. The army goes to the streets on invitation of the police; and when the army were summoned last time, it was for a peaceful protest  thats why people marched all the way to the Highfield. He positioned himself as a steadfast Mnangagwa ally from the 2017 upheaval, claiming unique access to military intelligence at the time. The only peeps whos stood for ED is me; and in 2017, I am the one who stood out. SB Moyo [late Foreign Affairs Minister Sibusiso Moyo] is the one who would give me information. Chiwenga was in China, so at what point did he chair a meeting? All the other security people were reporting to ED including Shiri [late Air Marshal Perence Shiri].\n\nMliswa lavished praise on Mnangagwas deep-rooted security credentials, crediting him with building a parallel network of loyalists during his tenure as Minister of Defence. One thing you must credit ED for; he has his own people in the army, since the time he was Minister of Defence. When youre Minister of Defence, you appoint your own people. So who says he does not have his people in the army? So you yourself, as editor-in-chief, do you not have people who are loyal to you?\n\nHighlighting Mnangagwas promotions of women within security ranks, Mliswa emphasized his strategic acumen: Look at the women under him whove been promoted. Remember this man is a security man. He was the first Minister of State Security at independence to bring stability in the country, with the Mujurus under him including Tungamirai [referring to key figures like Solomon Mujuru and Perence Shiris predecessor].\n\nThe interview delved into Zimbabwes turbulent post-independence era, with Mliswa crediting Mnangagwas collaboration with white security officials for a seamless power transition. It is critical to know that he was the first State Security Minister at independence, who worked with whites including Ken Flower, who led the CIO, and Dan Stannard. And there was a swift takeover despite there being a war that killed people, because of him.\n\nIn a dire warning to potential challengers, Mliswa concluded that the fallout from any purge would be total: This conference is EDs, even the vice presidents can be chased away. And after youve been chased, you will lose all connection to state security.\n\nMliswas explosive remarks are likely to intensify scrutiny on the ZANU PF conference, which concludes later this week. As delegates deliberate on economic recovery plans and party reforms, the shadow of internal purges looms large. ZimEye will continue to monitor developments, with expectations of shockwaves rippling through Zimbabwes political landscape. For those hoping for seismic change, Mliswas message is clear: brace for disappointment  Mnangagwas grip shows no signs of loosening.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Harare, Zimbabwe – October 14, 2025 – In a stunning exclusive revelation that could … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/mliswa-drops-bombshell-chiwenga-could-be-the-one-ousted-at-zanu-pf-congress-as-mnangagwa-clings-to-power/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Drops Bombshell – Chiwenga Could Be the One Ousted at ZANU PF Congress\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Senior Zimbabwean Cleric Calls Benny Hinn A Danger To Africa",
            "url": "https://www.zimeye.net/2025/10/14/senior-zimbabwean-cleric-calls-benny-hinn-a-danger-to-africa/",
            "content": "By A Correspondent\n\nFormer Zimbabwe Council of Churches (ZCC) General Secretary, Reverend Kenneth Mtata, has strongly criticised American televangelist Benny Hinn, describing him as a danger to Africa following his high-profile visit to Zimbabwe.\n\nHinn, who was in the country for a National Healing Crusade held in Harare in October 2025, met with President Emmerson Mnangagwa at State House before the event. During the meeting, members of Hinns delegation praised the Zimbabwean leader for what they called visionary leadership and development strides, saying the countrys progress should inspire other African nations.\n\nHowever, Reverend Mtata expressed grave concern over Hinns influence on the continent, arguing that his brand of Christianity undermines Africas social and political development. Writing on X (formerly Twitter), Mtata said, American televangelist Benny Hinn is currently in Zimbabwe, following a visit to Uganda. This is not his first trip to sub-Saharan Africa  and those familiar with Paul Giffords research will know that such visits are not just about religion.\n\nHe went on to explain that scholars like Gifford have shown how far-right American televangelists like Benny Hinn often bring to Africa a form of Christianity that harms its progress.\n\nMtata elaborated on seven ways this happens:\n\nFirst, corruption, poverty, and bad governance are reframed as spiritual rather than political problems, diverting people from their civic responsibilities. Second, instead of demanding accountability or building institutions, followers are encouraged to attend mass prayer rallies hoping for miraculous solutions. Third, faith becomes about personal success and deliverance, not collective justice or transformation. Fourth, political and religious power is presented as coming directly from God, discouraging accountability and promoting blind submission. Fifth, questioning or doubt is labelled as sin, destroying the intellectual freedom required for civic engagement. Sixth, wherever he goes, Benny Hinn seeks closeness to political power, trading legitimacy for patronage and blurring the line between faith and politics. Seventh, Benny Hinn represents American cultural and political imperialism  he exports an American religious product while opening intelligence doors that are otherwise hard to access.\n\nReverend Mtatas remarks have sparked debate among Zimbabweans and church leaders, with some agreeing that imported televangelism often distracts from Africas pressing social realities, while others defend Hinns mission as one of spiritual revival.\n\nNonetheless, Mtata maintains that figures like Hinn pose a serious danger to Africas moral and political maturity, warning that their influence reinforces dependence and weakens the continents pursuit of genuine transformation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Zimbabwe Council of Churches (ZCC) General Secretary, Reverend Kenneth Mtata, has strongly criticised American televangelist Benny … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/senior-zimbabwean-cleric-calls-benny-hinn-a-danger-to-africa/\">Continue reading<span class=\"screen-reader-text\"> \"Senior Zimbabwean Cleric Calls Benny Hinn A Danger To Africa\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Mnangagwa Speaks on SA–Zim Bound Horror Crash",
            "url": "https://www.zimeye.net/2025/10/14/mnangagwa-speaks-on-sa-zim-bound-horror-crash/",
            "content": "By A Correspondent President Emmerson Mnangagwa has expressed deep sorrow following the horrific bus crash in South Africas Limpopo Province that claimed about 40 lives, including Zimbabwean and Malawian nationals.\n\nAuthorities in Limpopo confirmed that the long-distance bus, which had been travelling from Gqeberha (formerly Port Elizabeth) to Harare, was destined for Malawi after reaching Zimbabwe. The tragedy occurred on Sunday afternoon when the bus overturned near Ingwe Lodge in Musina, killing passengers, among them a 10-month-old baby.\n\nThe Limpopo Department of Transport and Community Safety said 40 people died and 38 others were injured in the crash.\n\nLimpopo Transport and Community Safety MEC Violet Mathye toldNewzroom Afrikathat the deceased were mostly Zimbabwean and Malawian nationals returning home from South Africa.Let me pass my condolences to the two countries that have lost loved ones  Zimbabwe and Malawi. We have reported 38 injuries; these are the people currently in the hospital. They were originally 39, but a 10-month-old baby passed away after being referred to the hospital, Mathye said.\n\nShe added that law enforcement agencies were still at the scene, investigating the cause of the accident, which may have resulted from driver fatigue or a mechanical fault.\n\nIn a condolence message issued by the Department of Presidential Communications, President Mnangagwa said he received news of the accident with a deep sense of shock and grief.He described the loss of life as a painful reminder of the need for maximum diligence in the movement of our peoples regardless of borders and differences in legislation.\n\nThat so many lives were lost in this incident once more urges us to ensure maximum diligence in the movement of our peoples, Mnangagwa said. Life remains precious whenever it is lost and in whatever country.\n\nThe President also called for closer regional collaboration on road safety within the SADC bloc, urging governments to harmonise cross-border traffic regulations.In view of increased cross-border movements in our SADC region, it has become incumbent for traffic enforcement agencies across jurisdictions to collaborate more closely, he said.Mnangagwa commended the South African government for its swift response to the tragedy.\n\nThe accident, which occurred along the N1 North near Makhado, forced the temporary closure of the highway as rescue teams worked to recover bodies and assist survivors. The ill-fated journey  covering more than 2,100 kilometres from Gqeberha to Harare and then onward to Malawi  has once again spotlighted the risks faced by cross-border travellers in the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has expressed deep sorrow following the horrific bus crash in South Africa’s Limpopo Province … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/mnangagwa-speaks-on-sa-zim-bound-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Speaks on SA–Zim Bound Horror Crash\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Zandile Dabula Says Zimbabweans Were Supposed To Support Bafana Bafana",
            "url": "https://www.zimeye.net/2025/10/14/zandile-dabula-says-zimbabweans-were-supposed-to-support-bafa/",
            "content": "I thought I should just update you on this yesterday (izolo) was the 10th of October as you would know that human South African Human Rights Commission summoned us to court and we went to court and after court we then decided with some patriots that lets go and support Bafana Bafana, because there was a soccer match between Zimbabwe and South Africa in Moses Mabhida Stadium and we went and yooo!; I must say, I sat there and I observed the attitude of South Africans towards foreigners; as we are sitting on a time bomb now it even went to a point where South Africans were saying . now this was because of the attitude, the arrogance I must above when some Zimbabweans they look down on us guys, and the South Africans were like ah ah ah!, not here! that was the attitude that Ive observed; so South Africans are grateful; and you know if government is not going to do anything about this immigration crisis we are facing as a country We are on a time-ticking bomb.\n\nDudula leader@Im_Gudluzacomplains why Zimbabweans did not support South Africas team when it was playing their country (Zimbabwe). She says is part:I thought I should just update you on this yesterday (izolo) was the 10th of October as you would know that human South Africanpic.twitter.com/JcWJ4OzN7m\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I thought I should just update you on this yesterday (izolo) was the 10th of October as you would know … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/zandile-dabula-says-zimbabweans-were-supposed-to-support-bafa/\">Continue reading<span class=\"screen-reader-text\"> \"Zandile Dabula Says Zimbabweans Were Supposed To Support Bafana Bafana\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Government Failure Exposed As Newborn Babies Sleep On Floor At Sakubva Hospital…",
            "url": "https://www.zimeye.net/2025/10/14/government-failure-exposed-as-newborn-babies-sleep-on-floor-at-sakubva-hospital/",
            "content": "By A Correspondent\n\nMUTARE  Alarming scenes unfolded last week at Sakubva District Hospital, where mothers and their newborn babies were reportedly forced to sleep on thin mattresses laid on the floor due to an acute shortage of beds.\n\nHospital sources described the situation as chaotic, with staff struggling to cope with the surge in patients.\n\nPatients were literally placed on the floor because all available beds were full. It was heartbreaking to witness, said a nurse speaking on condition of anonymity. We tried to make them as comfortable as possible, but it is far from acceptable. Newborns and mothers should never have to sleep like this in a hospital.\n\nDoctors at Sakubva confirmed that the hospitals maternity ward had exceeded its capacity, leading to the emergency use of makeshift floor beds.\n\nLast week, our patient numbers exceeded the available beds. We could not turn away anyone, so temporary floor arrangements were the only option while we tried to create space, a senior doctor explained.\n\nThe hospital, which handles approximately 120 deliveries per week, including around 45 caesarean sections, is the main referral facility serving both urban and rural areas of Mutare. Staff say the pressure has been mounting, with the increased number of women opting to deliver at the hospital putting additional strain on the already limited resources.\n\nHospital insiders also highlighted that while maternal deaths have dropped significantlyfrom five in 2024 to just one so far this yearthe success has ironically intensified demand for services, worsening overcrowding.\n\nThe reduction in maternal deaths has encouraged more women to come here, which is wonderful, but the hospital infrastructure has not kept pace with the growing need, a senior maternity nurse said.\n\nThe crisis has sparked concerns about government preparedness and long-term planning for healthcare facilities in the region.\n\nAddressing the situation, Mutare District Medical Officer Dr David Muchirewesi acknowledged the problem and assured that steps were being taken to resolve it.\n\nWe are aware of the issue, and the necessary measures are being put in place to fix it, Muchirewesi said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MUTARE – Alarming scenes unfolded last week at Sakubva District Hospital, where mothers and their newborn babies … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/government-failure-exposed-as-newborn-babies-sleep-on-floor-at-sakubva-hospital/\">Continue reading<span class=\"screen-reader-text\"> \"Government Failure Exposed As Newborn Babies Sleep On Floor At Sakubva Hospital…\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Currency at Risk: ZiG Fails to Inspire Confidence Amid Liquidity Woes",
            "url": "https://www.zimeye.net/2025/10/14/currency-at-risk-zig-fails-to-inspire-confidence-amid-liquidity-woes/",
            "content": "By A Correspondent\n\nHARARE  Zimbabwes gold-backed currency, the ZiG, is increasingly under scrutiny as economists warn that its apparent stability conceals deepening liquidity problems and declining public confidence, despite assurances from the Reserve Bank of Zimbabwe (RBZ).\n\nThe RBZ recently announced that the loans-to-deposit ratio (LDR) for ZiG accounts has climbed from 30 percent at launch last year to 46 percent, a figure the central bank described as a sign of healthy financial intermediation.\n\nHowever, analysts argue that the rising LDR signals a more precarious situation.\n\nThis does not reflect genuine growth or confidence, said a Harare-based economist who requested anonymity. It shows banks are stretching themselves to sustain liquidity, which can quickly become dangerous in an already fragile economy.\n\nLaunched on April 5, 2024, the ZiG replaced the inflation-wrecked Zimbabwe dollar and was marketed as a structured currency backed by gold and foreign reserves, intended to stabilize the economy after years of hyperinflation.\n\nBut critics claim the currencys foundation is weaker than official figures suggest.\n\nPeople are not fully convinced the ZiG is genuinely backed by tangible assets, said another economist. If confidence were real, banks wouldnt be struggling with liquidity shortages, and depositors wouldnt be rushing to convert their ZiG into US dollars whenever possible.\n\nWhile the RBZ maintains that the 46 percent LDR is below the prudential limit of 70 percent, experts warn that the trend is unsustainable given persistent liquidity constraints.\n\nThe central bank is trying to spin a liquidity problem as a sign of confidence, said a financial analyst. But in reality, cash is scarce, banks are cautious, and depositors are wary. Lending activity is driven more by survival than growth.\n\nThe liquidity crunch prompted the RBZ to launch the Targeted Finance Facility, aimed at injecting credit into sectors like manufacturing and agriculture. Analysts say the initiative has had limited impact.\n\nThe facility is too small and bogged down in bureaucracy, one analyst noted. It does nothing to tackle the underlying problem: confidence in the ZiG remains dangerously low.\n\nSince its introduction, the ZiG has significantly depreciated. Initially pegged at 13.56 ZiG per US dollar, it now trades at 26.71, following a 43 percent devaluation in September 2024.\n\nDespite RBZ claims of rising foreign reserves to US$900 million, economists question both the transparency and sustainability of these figures.\n\nEven if the reserves exist, they are not sufficient to guarantee long-term stability, warned one economist. The public doesnt see or feel the backing. Prices remain quoted in US dollars, and the ZiG continues to be treated with suspicion.\n\nMany Zimbabweans view the currency as another temporary fix in a long history of failed monetary experiments.\n\nThe government is trying to project confidence, but people are still hoarding dollars, said another economist. Until trust is restored and the economy grows, the ZiG will remain a currency of convenience, not conviction.\n\nAs the RBZ pursues its 2030 mono-currency goal, experts caution that the path ahead remains uncertain.\n\nThe ZiG is walking a tightrope, one economist concluded. If liquidity doesnt improve and confidence doesnt return, another currency collapse is possible  and history shows how disastrous that can be for Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Zimbabwe’s gold-backed currency, the ZiG, is increasingly under scrutiny as economists warn that its apparent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/14/currency-at-risk-zig-fails-to-inspire-confidence-amid-liquidity-woes/\">Continue reading<span class=\"screen-reader-text\"> \"Currency at Risk: ZiG Fails to Inspire Confidence Amid Liquidity Woes\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        },
        {
            "title": "Fresh Details Emerge in SA–Zim Bound Horror Crash",
            "url": "https://www.zimeye.net/2025/10/13/fresh-details-emerge-in-sa-zim-bound-horror-crash/",
            "content": "Limpopo:Authorities in South Africa have revealed new details about the tragic bus crash that killed about 40 people  mostly Zimbabweans and Malawians  on Sunday along the N1 highway near Makhado in Limpopo Province.\n\nOfficials said the long-distance bus, which had been travelling from Gqeberha (formerly Port Elizabeth) to Harare, was en route to Malawi after reaching the Zimbabwean capital. The accident claimed the lives of passengers, including a 10-month-old baby, after the bus overturned near Ingwe Lodge in Musina.\n\nThe Limpopo Department of Transport and Community Safety confirmed on Monday that 40 people died in the horrific crash.\n\nLimpopo Transport and Community Safety MEC Violet Mathye told broadcasterNewzroom Afrikathat the deceased were Zimbabwean and Malawian nationals returning home from South Africa.\n\nLet me pass my condolences to the two countries that have lost loved ones  Zimbabwe and Malawi. We have reported 38 injuries; these are the people currently in hospital. They were originally 39, but a 10-month-old baby passed away after being referred to hospital, Mathye said.\n\nShe added that by Monday morning, law enforcement agencies were still at the crash site, but 40 deaths had been confirmed.\n\nThere was no other vehicle involved. I am sure the bus lost control. I do not know what caused it  it could be driver fatigue or a mechanical fault that made the bus lose control and go down the ditch. We will only know once the final report is completed, she said.\n\nThe N1 freeway was temporarily closed following the accident, with motorists advised to use alternative routes.\n\nThe tragic journey, covering more than 2,100 kilometers from Gqeberha to Harare and then onwards to Malawi, has once again highlighted the dangers faced by cross-border travellers using long-haul buses between South Africa and its northern neighbours.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Limpopo: Authorities in South Africa have revealed new details about the tragic bus crash that killed about 40 people — mostly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/fresh-details-emerge-in-sa-zim-bound-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh Details Emerge in SA–Zim Bound Horror Crash\"</span></a></p>",
            "time": "18:38",
            "date": "14 Oct 2025"
        }
    ]
}