{
    "news": [
        {
            "title": "Chiwenga Drops ED Zvigananda Dossier",
            "url": "https://www.zimeye.net/2025/09/19/chiwenga-drops-ed-zvigananda-dossier/",
            "content": "By A Correspondent  Vice President Constantino Chiwenga has produced a dossier exposing the alleged thievery by President Emmerson Mnangagwas bootlickers and flamboyant businessmen known in Zanu PF circles as theZvigananda.\n\nAddressing an urgent sitting of the Zanu PF central committee and politburo on Thursday, Mnangagwa appeared to take aim at his controversial benefactors, warning:\n\nThose splashing money without traceable sources should be arrested.\n\nThe remark came just a day after Chiwenga tabled a damning dossier at a tense politburo session. He accused Mnangagwas close allies  businessman Kudakwashe Tagwirei, energy dealer Wicknell Chivayo, presidential associate Delish Nguwaya, and gold magnate Scott Sakupwanya  of capturing both the state and the ruling party. Collectively branded theZvigananda, the four have been bankrolling Zanu PF events while flaunting extraordinary wealth in a collapsing economy.\n\nChiwengas dossier reportedly detailed how the group has been using illicit financial networks and their closeness to Mnangagwa to entrench their business empires, while undermining state institutions. He demanded their arrest for corruption and financial crimes, warning their unchecked influence could delegitimise Zanu PF itself.\n\nThe rift between Mnangagwa and Chiwenga comes against the backdrop of the so-called 2030 agenda  a push by Mnangagwa loyalists to extend his rule beyond the 2028 constitutional limit. On Thursday, Mnangagwa appeared to downplay that agenda, saying:\n\nIt is of importance that we introspect as a party, not only with regards to our short-term activities, but in view of the bigger objective that our party wins the 2028 harmonised general elections.\n\nChiwenga, however, has openly rejected the plan to extend Mnangagwas rule. In closed-door meetings, he has argued that the presidents reliance on oligarchs like theZviganandais destroying the partys liberation legacy and weakening its grassroots structures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Vice President Constantino Chiwenga has produced a dossier exposing the alleged thievery by President Emmerson Mnangagwa’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/chiwenga-drops-ed-zvigananda-dossier/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Drops ED Zvigananda Dossier\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "VP Chiwenga Pins Down Zvigananda",
            "url": "https://www.zimeye.net/2025/09/19/vp-chiwenga-pins-down-zvigananda/",
            "content": "By A Correspondent  Vice President Constantino Chiwenga has forced his boss, President Emmerson Mnangagwa, to denounce flamboyant businessmen known in Zanu PF circles as theZvigananda.\n\nAddressing an urgent sitting of the Zanu PF central committee and politburo on Thursday, Mnangagwa warned against unexplained displays of wealth, in what many insiders saw as a thinly veiled attack on his controversial benefactors.\n\nThose splashing money without traceable sources should be arrested, Mnangagwa declared.\n\nThe remark comes after his deputy, Vice President Constantino Chiwenga, tabled a damning dossier during Wednesdays tense politburo session. Chiwenga accused Mnangagwas close allies  businessman Kudakwashe Tagwirei, energy dealer Wicknell Chivayo, presidential associate Delish Nguwaya, and gold magnate Scott Sakupwanya  of capturing both the state and the ruling party. Collectively branded theZvigananda, the four have been bankrolling Zanu PF events and flaunting extraordinary wealth in a collapsing economy.\n\nChiwengas dossier reportedly detailed how the group was using illicit financial networks and their proximity to Mnangagwa to entrench their business empires while undermining state institutions. He demanded their immediate arrest for corruption and financial crimes, warning that their unchecked influence risked delegitimising the party.\n\nThe public rift between Mnangagwa and Chiwenga comes against the backdrop of the 2030 agenda  a push by Mnangagwa loyalists to extend his rule beyond the 2028 constitutional limit. While Mnangagwa appeared to rebuke that plan on Thursday, his words left room for speculation.\n\nIt is of importance that we introspect as a party, not only with regards to our short-term activities, but in view of the bigger objective that our party wins the 2028 harmonised general elections, Mnangagwa told the central committee.\n\nChiwenga, however, has openly rejected the idea of extending Mnangagwas rule, insisting that the 2028 polls should not be postponed or manipulated. In recent closed-door meetings, he has argued that Mnangagwas overreliance on oligarchs like theZviganandais eroding Zanu PFs liberation legacy and weakening its grassroots structures.\n\nThe unfolding fight exposes the widening cracks in Zanu PF, with Mnangagwa caught between defending his controversial financiers and containing growing internal dissent led by his deputy. For the first time since 2017, the balance of power between Mnangagwa and Chiwenga appears dangerously fragile.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Vice President Constantino Chiwenga has forced his boss, President Emmerson Mnangagwa, to denounce  flamboyant businessmen known … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/vp-chiwenga-pins-down-zvigananda/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Pins Down Zvigananda\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "Tagwirei Spends US$2 Million on Mnangagwa Birthday",
            "url": "https://www.zimeye.net/2025/09/19/tagwirei-spends-us2-million-on-mnangagwa-birthday/",
            "content": "By A Correspondent  President Emmerson Mnangagwas long-time financier and political handler, Kudakwashe Tagwirei, reportedly poured at least US$2 million into the Munhumutapa Day commemorations that doubled as Mnangagwas birthday celebrations in Zvishavane on Monday.\n\nInsiders said the Zanu PF central committee nominee for Harare province paid more than US$120,000 each to fast-food giants Chicken Slice and Chicken Inn to provide catering and logistics for the thousands of ruling party youths bussed into the Midlands province.\n\nZanu PF youth league secretary for commissariat Taurai Kandishaya unwittingly confirmed Tagwireis sponsorship on social media.\n\nOn behalf of Africa youth, I would like to extend heartfelt appreciation to President ED Mnangagwa for hosting us at his Zvishavane home ground to celebrate Munhumutapa Day and his birthday, he posted.\n\nSpecial thanks to Cde Kuda Tagwirei, the programmes major sponsor and partner for making it happen. Your trust and loyalty to President ED (Mnangagwa)s leadership are evident in your willingness to partner in any event that advances his national vision.\n\nZanu PFs deputy secretary for security, Tendai Chirau, also praised Tagwireis deep pockets, saying:The event was highly organised courtesy of the logistical support given by Cde Kudakwashe Tagwirei. It is key to appreciate selfless cadres who make things happen. Its not asking much.\n\nMnangagwa, who turned 83 on Monday, has since had his birthday officially designated Munhumutapa Day  a national holiday framed as honouring the legacy of Zimbabwes ancient kings.\n\nBut behind the fanfare lies a familiar pattern. Tagwirei has long been at the centre of Zanu PFs patronage politics, effectively capturing Mnangagwas presidency through his financial muscle. He bankrolled the controversial Command Agriculture programme, which the Public Accounts Committee led by Tendai Biti accused of leaking more than US$3 billion into private pockets.\n\nFor his role in enabling corruption and state capture, the businessman was slapped with sanctions by both the United States and the United Kingdom.\n\nBeyond state programmes, Tagwirei has been Zanu PFs biggest funder since Mnangagwas 2017 military-backed rise to power. He has financed campaigns, paid party salaries, and donated fleets of vehicles. His grip on the party stretches back to the Mugabe era, when he controversially landed the Dema diesel power plant contract ahead of US energy giant APR.\n\nAnalysts say Tagwireis latest US$2 million birthday gift is yet another demonstration of how his vast fortune underwrites Mnangagwas rule and keeps Zanu PFs patronage machine running.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa’s long-time financier and political handler, Kudakwashe Tagwirei, reportedly poured at least US$2 million … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/tagwirei-spends-us2-million-on-mnangagwa-birthday/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Spends US$2 Million on Mnangagwa Birthday \"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "Police Crackdown to Fund Anti-Chiwenga Conference",
            "url": "https://www.zimeye.net/2025/09/19/police-crackdown-to-fund-anti-chiwenga-conference/",
            "content": "By A Correspondent  The Zimbabwe Republic Police (ZRP) and municipal police have launched a crackdown on motorists to fundraise for Zanu PFs October conference in Mutare.\n\nThe ruling party is targeting at least US$5 million for the high-stakes gathering, where President Emmerson Mnangagwas succession battle is expected to dominate.\n\nHis loyalists are pushing for him to extend his stay in power beyond his constitutional term limit in 2028, while a rival faction aligned with the military is backing Vice President Constantino Chiwenga to take over.\n\nIn the latest scheme, police officers and Harare municipal authorities have intensified roadblocks and patrols, extracting hefty spot fines for petty traffic offences.\n\nMotorists report being charged between US$120 and US$200 for violations such as parking at undesignated points, using mobile phones while driving, failing to observe stop signs, or not producing valid licences.\n\nOfficers are said to be using both official and unmarked private vehicles, spreading their operations from the city centre to suburban areas.\n\nCars impounded by council require registration books and proof of ownership before they are released, creating further frustrations for drivers.\n\nResidents have taken to WhatsApp groups to warn each other about the new police crackdown. One widely shared message reads:\n\nHi all. Please lets be advised  Council & ZRP are on full force around Harare. Roadside parking on undesignated points, being on the phone while driving, licenses, failing to observe stop signs, etc, are some of the issues they are targeting. For 1 to be out of council, you will have to release about $120 to $200. Also, these guys are using private cars and sometimes council patrol cars. Their target is not limited to the CBD, even sub urban areas. If the council impound your car, they will need a car book and owner id for the process to start. So lets all be warned.\n\nThe tactic is a throwback to the Mugabe era, when then-police chief Augustine Chihuri turned the ZRP into a cash cow for Zanu PF. At the time, police stations were given daily revenue targets, with a significant share funnelled into party coffers.\n\nDuring the height of Zanu PFs factional wars, money squeezed from motorists and businesses was channelled to bankroll the G40 faction against the Lacoste camp that eventually propelled Mnangagwa to power.\n\nThe latest fundraising drive highlights how Zanu PF continues to weaponise state institutions for its survival, while leaving ordinary citizens to carry the burden.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Republic Police (ZRP) and municipal police have launched a crackdown on motorists to fundraise … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/police-crackdown-to-fund-anti-chiwenga-conference/\">Continue reading<span class=\"screen-reader-text\"> \"Police Crackdown to Fund Anti-Chiwenga Conference\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "Facing Pressure, Prosecutors Decide To Deport Chinese Fined Paltry 150 Dollars For Cocaine Crime",
            "url": "https://www.zimeye.net/2025/09/19/833235/",
            "content": "The National Prosecuting Authority of Zimbabwe (NPAZ) has confirmed that nine Chinese nationals arrested for cocaine possession in Harare  and fined just US$150 each  are now awaiting deportation.\n\nThe nine, identified as Yu Hefeng, Dong Yunmei, Yang Wanwan, Wu Yuejun, Yang Qin, Fang Yue, Sun Jie, Yao Wenming and Li Zhongju, were apprehended in the capital after allegedly being found with cocaine. Their sentencing  a small fine rather than imprisonment  has sparked public outrage and accusations of double standards in Zimbabwes handling of drug-related crimes.\n\nIn a strongly worded statement issued on Thursday, the NPAZ said it was aware of the publics concern about the case and vowed to strengthen its prosecution of future drug offences.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) is aware of the publics concern regarding the sentence handed down in the case involving nine Chinese nationals who pleaded guilty to using dangerous drugs (cocaine). We are taking this opportunity to reaffirm our commitment to the diligent and fair prosecution of all criminal cases, the statement read.\n\nThe NPAZ stressed that the nine individuals are currently awaiting deportation and reaffirmed its commitment to ensuring that all individuals are held accountable for their actions in accordance with the laws of Zimbabwe, regardless of their nationality or status.\n\nThe statement came as Zimbabweans vented frustration on social media, citing cases where locals have been denied bail for possessing cannabis or received harsh sentences for minor drug offences, while foreigners walked free after paying what many called token fines.\n\nGoing forward, the NPAZ said all public prosecutors had been instructed to prefer the correct charges in all drug-related cases and aggressively pursue stiffer sentences in court to secure penalties that truly reflect the seriousness of these offences.\n\nThis stance is a direct reflection of the direction that Zimbabwe has taken to combat drug abuse. We appreciate the publics vigilance, as it reinforces our shared commitment to combating drug abuse in our society. We are committed to a future where drug-related offences are met with sentences that truly reflect their gravity, the NPAZ said.\n\nThe move to deport the nine Chinese nationals now places pressure on Zimbabwes justice system to prove that future drug cases  regardless of nationality  will be treated with consistency, severity, and transparency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The National Prosecuting Authority of Zimbabwe (NPAZ) has confirmed that nine Chinese nationals arrested for cocaine possession in Harare — … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/833235/\">Continue reading<span class=\"screen-reader-text\"> \"Facing Pressure, Prosecutors Decide To Deport Chinese Fined Paltry 150 Dollars For Cocaine Crime\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "Mnangagwa’s Politburo Speech: Self-Congratulation in a Failing State",
            "url": "https://www.zimeye.net/2025/09/19/mnangagwas-politburo-speech-self-congratulation-in-a-failing-state/",
            "content": "By A Correspondent President Emmerson Mnangagwas latest address to the ZANU PF Politburo has been branded hollow and self-serving, as he showered praise on his party while sidestepping the dire challenges faced by millions of Zimbabweans.\n\nSpeaking at the partys 387th Ordinary Session of the Politburo in Harare, Mnangagwa focused on congratulating party structures for their preparations for the upcoming conference.\n\nI commend Provinces and Districts for the manner in which they are consolidating their discussions in preparation for the upcoming Conference. I am pleased that the Party machinery is demonstrating concerted refocusing and recalibration at all levels to achieve the set out decisions and objectives, Mnangagwa declared.\n\nCritics argue this kind of self-congratulation is detached from the daily reality of Zimbabweans, who continue to suffer under a collapsing economy, spiraling inflation, and crumbling public services.\n\nMnangagwa speaks as though all is well, yet ordinary citizens cannot even afford bread or transport, said one political commentator. These empty slogans of refocusing and recalibration mean nothing when hospitals lack medicine and families go hungry.\n\nAnalysts say Mnangagwas continued obsession with internal party politics reveals a leadership more concerned with preserving ZANU PFs grip on power than rescuing the country from its downward spiral.\n\nAs the ZANU PF conference looms, Mnangagwas speech underscores the widening disconnect between the ruling elites rhetoric and the harsh realities faced by the nation  a reminder, critics say, that Zimbabwe remains trapped in the clutches of a failing state.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– President Emmerson Mnangagwa’s latest address to the ZANU PF Politburo has been branded hollow and self-serving, as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/mnangagwas-politburo-speech-self-congratulation-in-a-failing-state/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Politburo Speech: Self-Congratulation in a Failing State\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "I Am As Fit As A Fiddle, Mnangagwa Declares",
            "url": "https://www.zimeye.net/2025/09/19/i-am-as-fit-as-a-fiddle-mnangagwa-declares/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa used his 83rd birthday celebrations at ZANU PF headquarters to boast about his strength and joke about his longevity, remarks critics say reveal a leader increasingly out of touch with the suffering of ordinary Zimbabweans.\n\nThe President, who is also ZANU PF First Secretary, was greeted with song, cheer and decorations when party staffers staged a surprise celebration before the Politburo meeting on Tuesday. Mnangagwa, who turned 83 on Monday, basked in the adoration and took the opportunity to poke fun at his own age.\n\nI want to thank you, my colleagues in the party who are celebrating with me on my 83rd birthday. I have another 83 years to go. I will clock another 83, he declared, leaving his loyal audience laughing.\n\nMnangagwa insisted he still feels youthful and credited divine providence for his longevity. Let me assure you that this is the Grace of God, it is not my design or anybodys design. It is the will of God that I reach that age. I dont feel it, I think sometime in future I might begin feeling the age but for now I am strong, he said.\n\nWhile the President was shown glittering pictures, carvings and a wooden lion representing his totem, millions of Zimbabweans outside the ZANU PF bubble continue to battle crippling inflation, food shortages and collapsed public services. To many, his claims of being fit as a fiddle only underscore how insulated the ruling elite has become.\n\nIt is disturbing that Mnangagwa can talk of another 83 years while people are starving and hospitals have no drugs, one analyst said.\n\nHis jokes may entertain ZANU PF staffers, but they mock the daily struggles of the nation.\n\nMnangagwas self-congratulatory birthday address, delivered amid cheers from loyalists, highlighted once again the widening gulf between a President obsessed with his own survival and a population desperate for real solutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa used his 83rd birthday celebrations at ZANU PF headquarters to boast about his strength … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/19/i-am-as-fit-as-a-fiddle-mnangagwa-declares/\">Continue reading<span class=\"screen-reader-text\"> \"I Am As Fit As A Fiddle, Mnangagwa Declares\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "Freedom Fighters for Change Declares Struggle Is Bigger Than Individuals",
            "url": "https://www.zimeye.net/2025/09/18/freedom-fighters-for-change-declares-struggle-is-bigger-than-individuals/",
            "content": "By A Correspondent\n\nThe newly formed Zimbabwean political party, Freedom Fighters for Change (FFC), has stressed that its mission goes beyond personalities and fame, calling for unity in the fight for total freedom.\n\nIn a statement released on Thursday, the movement said: True change is never about an individual person or organisation, but a collective effort and fight we all should be part of. Personalities and fame will pass away, but the revolution and the struggle for total freedom will remain.\n\nThe party emphasised the importance of selfless leadership, adding: The greatest legacy is having selfless minds and the country at heart. FFC will lead you to actualise this reality. #WeMove.\n\nFreedom Fighters for Change positions itself as a people-driven alternative in Zimbabwes political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The newly formed Zimbabwean political party, Freedom Fighters for Change (FFC), has stressed that its mission goes … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/freedom-fighters-for-change-declares-struggle-is-bigger-than-individuals/\">Continue reading<span class=\"screen-reader-text\"> \"Freedom Fighters for Change Declares Struggle Is Bigger Than Individuals\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "ED Throws Chivayo Under the Bus",
            "url": "https://www.zimeye.net/2025/09/18/ed-throws-chivayo-under-the-bus/",
            "content": "By A Correspondent  President Emmerson Mnangagwa has hinted that the flamboyant businessmen known in Zanu PF circles as theZviganandacould soon face arrest, as factional battles inside the ruling party intensify ahead of the 2028 elections.\n\nAddressing an urgent sitting of the Zanu PF central committee and politburo on Thursday, Mnangagwa warned against unexplained displays of wealth, in what many insiders saw as a thinly veiled attack on his controversial benefactors.\n\nThose splashing money without traceable sources should be arrested, Mnangagwa declared.\n\nThe remark comes after his deputy, Vice President Constantino Chiwenga, tabled a damning dossier during Wednesdays tense politburo session. Chiwenga accused Mnangagwas close allies  businessman Kudakwashe Tagwirei, energy dealer Wicknell Chivayo, presidential associate Delish Nguwaya, and gold magnate Scott Sakupwanya  of capturing both the state and the ruling party. Collectively branded theZvigananda, the four have been bankrolling Zanu PF events and flaunting extraordinary wealth in a collapsing economy.\n\nChiwengas dossier reportedly detailed how the group was using illicit financial networks and their proximity to Mnangagwa to entrench their business empires while undermining state institutions. He demanded their immediate arrest for corruption and financial crimes, warning that their unchecked influence risked delegitimising the party.\n\nThe public rift between Mnangagwa and Chiwenga comes against the backdrop of the 2030 agenda  a push by Mnangagwa loyalists to extend his rule beyond the 2028 constitutional limit. While Mnangagwa appeared to rebuke that plan on Thursday, his words left room for speculation.\n\nIt is of importance that we introspect as a party, not only with regards to our short-term activities, but in view of the bigger objective that our party wins the 2028 harmonised general elections, Mnangagwa told the central committee.\n\nChiwenga, however, has openly rejected the idea of extending Mnangagwas rule, insisting that the 2028 polls should not be postponed or manipulated. In recent closed-door meetings, he has argued that Mnangagwas overreliance on oligarchs like theZviganandais eroding Zanu PFs liberation legacy and weakening its grassroots structures.\n\nThe unfolding fight exposes the widening cracks in Zanu PF, with Mnangagwa caught between defending his controversial financiers and containing growing internal dissent led by his deputy. For the first time since 2017, the balance of power between Mnangagwa and Chiwenga appears dangerously fragile.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has hinted that the flamboyant businessmen known in Zanu PF circles as the Zvigananda could … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/ed-throws-chivayo-under-the-bus/\">Continue reading<span class=\"screen-reader-text\"> \"ED Throws Chivayo Under the Bus\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        },
        {
            "title": "Tagwirei Splashes US$2 Million on ED Birthday Bash",
            "url": "https://www.zimeye.net/2025/09/18/tagwirei-splashes-us2-million-on-ed-birthday-bash/",
            "content": "By A Correspondent  President Emmerson Mnangagwas long-time financier and political handler, Kudakwashe Tagwirei, reportedly poured at least US$2 million into the Munhumutapa Day commemorations that doubled as Mnangagwas birthday celebrations in Zvishavane on Monday,NewsDayhas learnt.\n\nInsiders said the Zanu PF central committee nominee for Harare province paid more than US$120,000 each to fast-food giants Chicken Slice and Chicken Inn to provide catering and logistics for the thousands of ruling party youths bussed into the Midlands province.\n\nZanu PF youth league secretary for commissariat Taurai Kandishaya unwittingly confirmed Tagwireis sponsorship on social media.\n\nOn behalf of Africa youth, I would like to extend heartfelt appreciation to President ED Mnangagwa for hosting us at his Zvishavane home ground to celebrate Munhumutapa Day and his birthday, he posted.\n\nSpecial thanks to Cde Kuda Tagwirei, the programmes major sponsor and partner for making it happen. Your trust and loyalty to President ED (Mnangagwa)s leadership are evident in your willingness to partner in any event that advances his national vision.\n\nZanu PFs deputy secretary for security, Tendai Chirau, also praised Tagwireis deep pockets, saying:The event was highly organised courtesy of the logistical support given by Cde Kudakwashe Tagwirei. It is key to appreciate selfless cadres who make things happen. Its not asking much.\n\nMnangagwa, who turned 83 on Monday, has since had his birthday officially designated Munhumutapa Day  a national holiday framed as honouring the legacy of Zimbabwes ancient kings.\n\nBut behind the fanfare lies a familiar pattern. Tagwirei has long been at the centre of Zanu PFs patronage politics, effectively capturing Mnangagwas presidency through his financial muscle. He bankrolled the controversial Command Agriculture programme, which the Public Accounts Committee led by Tendai Biti accused of leaking more than US$3 billion into private pockets.\n\nFor his role in enabling corruption and state capture, the businessman was slapped with sanctions by both the United States and the United Kingdom.\n\nBeyond state programmes, Tagwirei has been Zanu PFs biggest funder since Mnangagwas 2017 military-backed rise to power. He has financed campaigns, paid party salaries, and donated fleets of vehicles. His grip on the party stretches back to the Mugabe era, when he controversially landed the Dema diesel power plant contract ahead of US energy giant APR.\n\nAnalysts say Tagwireis latest US$2 million birthday gift is yet another demonstration of how his vast fortune underwrites Mnangagwas rule and keeps Zanu PFs patronage machine running.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa’s long-time financier and political handler, Kudakwashe Tagwirei, reportedly poured at least US$2 million … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/tagwirei-splashes-us2-million-on-ed-birthday-bash/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Splashes US$2 Million on ED Birthday Bash\"</span></a></p>",
            "time": "06:33",
            "date": "20 Sep 2025"
        }
    ]
}