{
    "news": [
        {
            "title": "🔴 Nyasha Gwazemba Implicated  in Another Certificate of Sponsorship Scam",
            "url": "https://www.zimeye.net/2025/06/16/%f0%9f%94%b4-nyasha-gwazemba-implicated-in-another-certificate-of-sponsorship-scam/",
            "content": "By A Correspondent | Bulawayo, Zimbabwe  Two years after his initial arrest for impersonating a medical doctor and running a fake visa facilitation scheme, Nyasha William Gwazemba is once again at the centre of a fresh Certificate of Sponsorship (CoS) scam involving thousands of dollars.\n\nA new victim has emerged, sharing a message (attached) that details how Gwazemba (pictured) allegedly received 700 in the UK and an additional US$1,700 in Zimbabwe from a family seeking a UK work visa. The money, the complainant claims, was sent to Gwazembas mother at his instruction. The payments were made under the promise that he would facilitate a CoS for the victims daughter  a legal requirement for employment in the UK.\n\nThis fresh allegation mirrors a pattern from 2022, when Gwazemba was arrested after duping dozens across Bulawayo, Harare, and other towns. At the time, he posed as a UK-based doctor, charging victims up to US$600 each while claiming he could process UK work visas. One woman was conned out of US$500, prompting her family to contact this publication. In a sting operation, private investigators apprehended Gwazemba at a fuel station in Gwabalanda, after he tried to collect a passport and deposit from an undercover agent.\n\nAt that time, Gwazemba boasted that he had police connections and would never see the inside of a jail cell. He was detained at Luveve Police Station, but there is no public record of a successful conviction.\n\nNow, evidence has emerged showing bank transfers linked to Gwazembas account, implicating him once more in what appears to be a repeated and deliberate pattern of fraud.\n\nWhen contacted for comment regarding the latest allegations, Gwazemba initially denied any knowledge, saying:\n\nI dont know that person.\n\nHowever, once presented with evidence of the bank transfer bearing his account details, he abruptly dropped the call and failed to respond to subsequent messages or calls aimed at completing the interview.\n\nThis silence has only intensified public outrage, with renewed calls for police to reopen the case and investigate whether he is part of a larger syndicate targeting Zimbabweans desperate to escape economic hardship.\n\nAuthorities have repeatedly urged citizens not to trust individuals claiming to offer UK visas or job placements, and to verify all recruitment offers through licensed and accredited agencies only.\n\nNo individual can help you get a UK visa or Certificate of Sponsorship. Always use official government channels, stressed a source close to the investigators.\n\nAnyone who may have fallen victim to Gwazemba is encouraged to report their case at Luveve Police Station or contact immigration fraud hotlines.\n\nThis incident highlights a disturbing trend in Zimbabwes job placement sector, where fraudulent agents continue to exploit the hopes and savings of struggling families seeking a better life abroad.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Bulawayo, Zimbabwe – Two years after his initial arrest for impersonating a medical doctor and running … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/%f0%9f%94%b4-nyasha-gwazemba-implicated-in-another-certificate-of-sponsorship-scam/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 Nyasha Gwazemba Implicated  in Another Certificate of Sponsorship Scam\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "USD500,000 Looted By Armed Robbers",
            "url": "https://www.zimeye.net/2025/06/16/usd500000-looted-by-armed-robbers/",
            "content": " BREAKING NEWS: ZRP Probes Shocking US$500K Armed Heist in Harare CBD as Public Questions Source and Storage of Cash\n\nHarare, Zimbabwe  16 June 2025\n\nA brazen broad daylight robbery has rocked Harares central business district after four armed suspects stormed a mall at the corner of Cameron and Albion Street and vanished with a staggering USD 500,000 in cash.\n\nIn a public alert posted by the Zimbabwe Republic Police (ZRP), the incident occurred around 10:00 AM on Sunday, the 16th of June. The suspects, described only as four unknown individuals armed with an unknown pistol, reportedly pounced on a business premise before fleeing with the massive sum of money.\n\nWhile authorities have not yet disclosed the name of the business involved or provided further investigative updates, the announcement has ignited a wave of confusion, skepticism, and outrage among the public online.\n\n Public Shock and Suspicion\n\nThe news has triggered a flood of questions across social media platforms, with citizens demanding to know why such a vast amount of cash was being held on-site instead of in a bank.\n\nWhy keep such a large amount of money and not bank it? asked @tonderayi_m, echoing the sentiments of many who speculated the stash may be linked to illicit dealings or internal collusion.\n\nOthers like @wkays2 suggested insider involvement, noting, Also believe there are some insiders. Anyway lets leave homicide to dream.\n\nFanwell Zvigumbu expressed disbelief in Shona, Whr was the money? This is nonsense. Keeping all that money in a cashbox regai matsotsi atore zvavo  mari inopinda mu circulation. (Let the robbers take it  at least the money enters circulation.)\n\n A Reflection of a Broken Banking System?\n\nThe incident has once again spotlighted Zimbabwes complex and cash-heavy economy, where many businesses avoid the formal banking system due to high transaction costs, fear of account seizures, or lack of trust in financial institutions.\n\nIn a country where individuals have millions in cash, banks seem to have nothing, said @gideonvic300.\n\nMultiple users questioned why such an amount was even present in the CBD, while others mocked the situation with humour and disbelief. Half a million USD??? exclaimed @farai_mccloud with shock emojis, while another simply said, Damn I wish I was part of them.\n\n Police Investigation Underway\n\nZRP says investigations are in full swing and promised that more details will be released in due course. However, the lack of surveillance footage, suspect identities, or traceable leads as of now has cast doubt on how quickly justice will be served.\n\nSpeculation about the real motive and backstory behind the incident is growing rapidly online, with some questioning whether this is a genuine robbery or a cover-up for a deeper financial crime.\n\nAs the nation reels from this incident, pressure mounts on law enforcement and financial regulators to explain how such risky cash handling practices remain unchecked  and whether Zimbabwes criminal underworld is now more organized than ever.\n\nThis story is developing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "🔴 BREAKING NEWS: ZRP Probes Shocking US$500K Armed Heist in Harare CBD as Public Questions Source and Storage of Cash … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/usd500000-looted-by-armed-robbers/\">Continue reading<span class=\"screen-reader-text\"> \"USD500,000 Looted By Armed Robbers\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Mnangagwa Faces Parirenyatwa Rot In Surprise Hospital Visit",
            "url": "https://www.zimeye.net/2025/06/16/mnangagwa-faces-parirenyatwa-rot-in-surprise-hospital-visit/",
            "content": "By Health Reporter President Emmerson Mnangagwa was Monday confronted with the grim reality of Zimbabwes collapsing public health system when he made a surprise visit to Parirenyatwa Group of Hospitals in Harare.\n\nThe visit, announced by government spokesperson Nick Mangwana on X (formerly Twitter), included a tour of two central hospitals in the capital and a stop at the National Pharmaceutical Company (NatPharm) warehouse.\n\nMangwana posted photos showing Mnangagwa moving through visibly decaying hospital corridors, peeling walls, broken ceilings, and outdated equipment  stark images that reflect years of neglect in the countrys largest referral health institution.\n\nToday, President @edmnangagwa made an unannounced visit to two central hospitals in Harare and the Natpharm warehouse. This hands-on approach underscores a profound commitment to understanding the realities on the ground and signals a renewed focus on improving health outcomes for all citizens, Mangwana wrote.\n\nBut while authorities tried to frame the visit as a sign of renewed commitment, the images tell a different story  one of systemic failure.\n\nThe crumbling infrastructure, lack of basic supplies, and demoralised staff at Parirenyatwa are symptomatic of a broader crisis engulfing Zimbabwes public health sector.\n\nYears of underfunding, corruption, and poor governance have left public hospitals in dire straits.\n\nMost facilities regularly run out of essential drugs, and patients are often told to bring their own bandages, painkillers, or even fuel for ambulances.\n\nDoctors and nurses have gone on repeated strikes over poor salaries and unsafe working conditions, while many senior professionals have left the country for better opportunities abroad.\n\nAt Parirenyatwa, once a flagship of Zimbabwes health system, many wards are dysfunctional, equipment is outdated or broken, and patients often share beds.\n\nIt is not uncommon for surgeries to be postponed due to lack of electricity or running water.\n\nMnangagwas visit comes amid growing public frustration over the deteriorating state of health services, particularly in the wake of Zimbabwes economic decline and ballooning public debt.\n\nObservers say the Presidents unannounced visit may have been designed to counter criticism, but it has also drawn attention to years of inaction.\n\nHealth activists were quick to point out that what Mnangagwa saw was not an anomaly but the everyday condition faced by ordinary Zimbabweans. This is the daily reality in our hospitals  the system is broken, one Harare-based doctor posted online in response to the pictures.\n\nCritics also argue that addressing the health crisis requires more than surprise visits and social media statements. Whats needed, they say, is genuine political will, sustained investment, and accountability in the allocation of public health resources.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Health Reporter – President Emmerson Mnangagwa was Monday confronted with the grim reality of Zimbabwe’s collapsing public health system when … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/mnangagwa-faces-parirenyatwa-rot-in-surprise-hospital-visit/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Faces Parirenyatwa Rot In Surprise Hospital Visit\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Police Sound Alarm as 11 Vehicles Stolen Across Zimbabwe in One Day",
            "url": "https://www.zimeye.net/2025/06/16/rbz-wants-to-flood-the-streets-with-useless-zig-notes-again/",
            "content": "Police have raised the alarm following a dramatic rise in vehicle thefts, with at least 11 cars stolen across the country on June 11, 2025. Authorities are urging motorists to exercise extreme caution, particularly when leaving vehicles unattended or offering lifts to strangers.\n\nZimbabwe Republic Police (ZRP) spokesperson, Commissioner Paul Nyathi, said the spike in car thefts is becoming a serious national concern. The incidents  many involving negligence such as unlocked doors or keys left in the ignition  were reported mostly in Harare and Mashonaland West.\n\nAmong the cases was a break-in at business premises in Avonlea, Harare, where thieves made off with two vehicles  a Toyota Hilux and a Mazda BT50  along with other property including generators, solar batteries, money-counting machines, and electronics. The Toyota Hilux was later found abandoned in Majuru Village, Kutama.\n\nIn Mutorashanga, a man left his Honda Fit parked behind a shop with the keys still inside. By midnight, it had vanished.\n\nIn Karoi, a 29-year-old man allowed an acquaintance, identified only as Moses Kachasu, to sleep in his Toyota Fun Cargo overnight. Despite the keys being kept inside the house, the suspect allegedly started the car using unknown means and drove off.\n\nAnother incident in Fairview Park, Ruwa, saw burglars break into a home, steal valuables and car keys, and escape with a locked Nissan Caravan NV350.\n\nIn central Harare, a second Honda Fit was stolen after being left unlocked at the corner of Leopold Takawira and Samora Machel Avenue.\n\nCommissioner Nyathi stressed the importance of basic precautions, advising motorists to lock vehicles, never leave keys inside, and remain alert, whether at home or in public.\n\nDrivers and vehicle owners must play a key role in safeguarding their property, he said. Vigilance is crucial  especially in residential areas, CBD parking zones, and other vulnerable locations.\n\nSource: Online\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Police have raised the alarm following a dramatic rise in vehicle thefts, with at least 11 cars stolen across the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/rbz-wants-to-flood-the-streets-with-useless-zig-notes-again/\">Continue reading<span class=\"screen-reader-text\"> \"Police Sound Alarm as 11 Vehicles Stolen Across Zimbabwe in One Day\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Auxillia Mnangagwa Gatwick Airport Update",
            "url": "https://www.zimeye.net/2025/06/16/auxillia-mnangagwa-gatwick-airport-update/",
            "content": "By A Correspondent | ZimEye | British Police police bunked the arrival function of First Lady Auxillia Mnangagwa.\n\nMrs Mnangagwa was scheduled to arrive aboard a chartered flight today 1030am, at Gatwick Airport.\n\nShe however did not arrive.\n\nA group of men believed to be London embassy officials were spotted pacing around the airport in the early hours of the morning.\n\nHer movements were still not clear at the time of writing, and no statement issued by government over her attendance at an Annual Flair Summit meant for African First Ladies.\n\nAn audit conducted by ZimEye reveals meeting is being graced by predominantly the wives of Nigerian governors.\n\nIt was at the time offering believed that the reason why Mrs Mnangagwas movements are unclear is shes avoiding being embarrassed by protesters who have threatened to demonstrate against her.\n\nThis is a developing story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | British Police police bunked the arrival function of First Lady Auxillia Mnangagwa. Mrs Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/auxillia-mnangagwa-gatwick-airport-update/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa Gatwick Airport Update\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Real Estate Mogul Nabbed For Corruption",
            "url": "https://www.zimeye.net/2025/06/16/real-estate-mogul-nabbed-for-corruption/",
            "content": "Patrick Kennan, a renowned real estate mogul and owner of Kennan Properties, has been arrested in connection with allegations of corruption and judicial fraud.\n\nKennan is accused of unlawfully benefiting from and corruptly obtaining a default judgment in an opposed matter concerning a high-value property located at 51 St Michaels Lane, Borrowdale, Harare.\n\nThe case allegedly involved collusion with his legal representatives, Warhurst Attorneys, who are now jointly charged with Kennan.\n\nSource: The Herald\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Patrick Kennan, a renowned real estate mogul and owner of Kennan Properties, has been arrested in connection with allegations of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/real-estate-mogul-nabbed-for-corruption/\">Continue reading<span class=\"screen-reader-text\"> \"Real Estate Mogul Nabbed For Corruption\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "FIFA Club World Cup 2025: Record $1 Billion Prize Pool Unveiled",
            "url": "https://www.zimeye.net/2025/06/16/fifa-club-world-cup-2025-record-1-billion-prize-pool-unveiled/",
            "content": "Sports Correspondent\n\nThe 2025 edition of the FIFA Club World Cup is making headlines not just for its expanded format and host nation, but also for the staggering $1 billion prize money up for grabs. Hosted in the United States, this revamped tournament features 32 clubs from six continents in what is set to be the most lucrative Club World Cup in history.\n\nParticipation Pool: $525 Million Guaranteed\n\nEvery participating club is guaranteed a share of the $525 million participation pool, with payouts tailored according to their continental confederation andparticularly for European clubsa ranking system based on sporting success and commercial value.\n\nUEFA (Europe): European clubs receive between $12.81 million and $38.19 million. Top-tier giants such as Real Madrid, Manchester City, Chelsea, and Bayern Munich are likely to secure the maximum amount, reflecting both their sporting pedigree and global marketability.\n\nCONMEBOL (South America): The six South American teams each receive a fixed $15.21 million, reflecting the regions storied footballing tradition.\n\nAFC (Asia), CAF (Africa), CONCACAF (North and Central America, Caribbean): Each of the four participating clubs from these confederations receives $9.55 million, with notable teams including Inter Miami and Seattle Sounders representing CONCACAF.\n\nOFC (Oceania): Auckland City FC, Oceanias lone representative, is allocated $3.58 million.\n\nThis participation pool ensures financial support across all continents, acknowledging the global scale of the competition.\n\nSporting Performance Pool: $475 Million in Rewards\n\nPerformance on the pitch plays an equally vital role, with $475 million allocated to reward success throughout the tournament. This incentivized structure provides significant financial gains at every stage:\n\nGroup Stage:\n\nEach team plays three matches, with earnings as follows:\n\nWin: $2 million\n\nDraw: $1 million\n\nLoss: $0\n\nMaximum earnings per team: $6 million (for three wins)\n\nKnockout Stage Bonuses:\n\nRound of 16: $7.5 million\n\nQuarterfinals: $13.125 million\n\nSemifinals: $21 million\n\nRunner-up: $30 million\n\nChampion: $40 million\n\nA club that goes undefeated and wins the title could potentially walk away with over $80 million in combined earnings from participation and performance bonuses.\n\nA New Era of Global Club Football\n\nWith its expanded format and blockbuster prize money, the 2025 FIFA Club World Cup marks a significant evolution in international club competition. As the worlds top teams battle across U.S. stadiums, the tournament not only promises thrilling football but also represents a financial windfall for clubs around the globeushering in a new era of opportunity and global exposure for the beautiful game.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The 2025 edition of the FIFA Club World Cup is making headlines not just for its expanded format … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/fifa-club-world-cup-2025-record-1-billion-prize-pool-unveiled/\">Continue reading<span class=\"screen-reader-text\"> \"FIFA Club World Cup 2025: Record $1 Billion Prize Pool Unveiled\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "PSG Punish Atletico De Madrid",
            "url": "https://www.zimeye.net/2025/06/16/psg-punish-atletico-de-madrid/",
            "content": "Sports Correspondent\n\nParis Saint-Germains relentless pursuit of a historic quadruple stayed firmly on course as they dismantled Atltico de Madrid 4-0 in their opening match of the FIFA Club World Cup 2025. On a scorching day at the Rose Bowl in Los Angeles, the Ligue 1 champions delivered a masterclass in dominance, punishing a 10-man Atleti side with a ruthless display of attacking football.\n\nDespite missing their top scorer Ousmane Dembl, sidelined through injury after scoring 33 goals in 49 appearances this season, PSG showed no signs of weakness. Luis Enriques side simply adjusted their gears and leaned on their deep bench, with the likes of Desire Doue and Khvicha Kvaratskhelia stepping up in a fluid and fearless attack.\n\nThe tone was set early when Fabian Ruiz opened the scoring in the 19th minute, finishing a sweeping PSG move that left the Spanish defence flat-footed. Atlticos problems were compounded just before the break as Vitinha doubled the lead with a composed strike in first-half stoppage time (45+1), following a precise team buildup.\n\nAtleticos hopes of mounting a comeback were dashed midway through the second half when a red card reduced them to ten men. PSG seized full control from there, with 17-year-old Senny Mayulu putting the result beyond doubt in the 87th minute, scoring his first senior goal in dazzling fashion.\n\nAs the match drifted into injury time, Lee Kangin added further gloss to the scoreline, converting a stoppage-time penalty (90+7) to cap a performance that left little doubt about PSGs intent in this tournament.\n\nHaving already lifted the Ligue 1 title, Coupe de France, and UEFA Champions League this season, PSG are now two matches away from making history with a fourth major trophy. If this display is anything to go by, few would bet against them going all the way.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Paris Saint-Germain’s relentless pursuit of a historic quadruple stayed firmly on course as they dismantled Atlético de Madrid … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/psg-punish-atletico-de-madrid/\">Continue reading<span class=\"screen-reader-text\"> \"PSG Punish Atletico De Madrid\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Understanding Farm Records: Types and Their Importance",
            "url": "https://www.zimeye.net/2025/06/16/understanding-farm-records-types-and-their-importance/",
            "content": "By Dr Trywell Muzerengi\n\nFarming goes beyond planting crops and raising animals  it is a business that needs to be managed effectively. One of the key tools for good farm management is record keeping. Accurate and up-to-date records help farmers track activities, evaluate performance, and make informed decisions.\n\nBelow are the main types of farm records and why they matter:\n\nThese track what the farm produces, whether from crops or livestock.\n\nExamples:\n\nPlanting dates\n\nCrop types or seed varieties used\n\nHarvest quantities\n\nNumber of animals born or sold\n\nQuantity of milk, eggs, or meat produced\n\nWhy They Matter:Production records help farmers identify which crops or animals perform best. This information supports better planning, improved yields, and increased profits in future seasons.\n\nInput records show what has been used to support production on the farm.\n\nExamples:\n\nFertilizers or compost applied\n\nPesticides or organic sprays used\n\nAnimal feed purchases\n\nLabor used for various tasks\n\nWhy They Matter:These records help manage costs and ensure resources are used efficiently. Farmers can compare inputs with outputs to assess whether farming methods are cost-effective.\n\nThese detail the farms income and expenses, offering a full picture of its financial health.\n\nExamples:\n\nSales of farm produce\n\nExpenses on seeds, chemicals, or tools\n\nLoan and repayment details\n\nProfit and loss statements\n\nWhy They Matter:Financial records allow farmers to monitor cash flow, assess profitability, and make smart decisions about budgeting and investment.\n\nInventory records list all the physical assets owned or used by the farm.\n\nExamples:\n\nTools and machinery\n\nLivestock and poultry numbers\n\nStored feed, seeds, and fertilizers\n\nBuildings and storage facilities\n\nWhy They Matter:These records help keep track of valuable assets, avoid unnecessary purchases, and support farm planning and insurance claims.\n\nConclusion\n\nRecord keeping is essential for every farmer who wants to grow a successful and sustainable farming business. Whether small or large-scale, a well-documented farm gives the farmer control, clarity, and the ability to plan for a better future.\n\n[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Farming goes beyond planting crops and raising animals — it is a business that needs to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/understanding-farm-records-types-and-their-importance/\">Continue reading<span class=\"screen-reader-text\"> \"Understanding Farm Records: Types and Their Importance\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "But Why Does Caston Matewu Now Look Like Wicknell Chivayo’s Twin Brother, After Diverting Chamisa’s Money To Own Bank Accounts?",
            "url": "https://www.zimeye.net/2025/06/16/horror-pictures-caston-matewu-now-looks-like-wicknell-chivayos-twin-brother-just-after-diverting-chamisas-money-to-own-bank-accounts/",
            "content": "This is former Chamisa right hand man Caston Matewu in 2021, and the same person today (16 June 2025), 4 yearsafter joining the ZANU imposter Sengezo Tshabangu- in a very short timemany are mistaking his countenance for that of the convicted fraudster Wicknell Chivayo. In 2021, Matewus father Jaison, publicly instructed journalists to help divert Nelson Chamisas party money to his private bank accounts in UK. He was confronted over this, while his son was secretly chopping the money and contracting Emmerson Mnangagwa. The son, Caston, today, 16 June 2025, has written promising to ensure your money is put to good use. Do you believe he will do this?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "This is former Chamisa right hand man Caston Matewu in 2021, and the same person today (16 June 2025), 4 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/16/horror-pictures-caston-matewu-now-looks-like-wicknell-chivayos-twin-brother-just-after-diverting-chamisas-money-to-own-bank-accounts/\">Continue reading<span class=\"screen-reader-text\"> \"But Why Does Caston Matewu Now Look Like Wicknell Chivayo’s Twin Brother, After Diverting Chamisa’s Money To Own Bank Accounts?\"</span></a></p>",
            "time": "20:46",
            "date": "17 Jun 2025"
        }
    ]
}