{
    "news": [
        {
            "title": "Blessed Mhlanga’s Family Disown Hopewell Chin’ono Following Gatwick-Airport Hacking By Journalist’s Friend To Delete Name Used During 2001 Frauds",
            "url": "https://www.zimeye.net/2025/03/09/blessed-mhlangas-family-disown-hopewell-chinono-following-gatwick-airport-hacking-by-journalists-friend-to-delete-name-used-during-2001-frauds/",
            "content": "By Editorial Team | ZimEye | Police @PoliceZimbabwe say the Blessed Mhlanga @bbmhlangafamily have disowned Hopewell Chinono @daddyhope saying he is the one who recently requested to represent him at a time @TrevorNcube @NewsDayZimbabwe AMH has its own representatives. Public complaints have been raised over Hopewell Chinonowho recently inspired a colleague of his to attempt to hack Gatwick Airports database on 26 Aug 2024 (documentary in link below), and who created a career out of lying that an NHS expert accusing him offrauds in UK, was sent by the Zim Govt in 2020 to an outfit called Gambakwe, something that never happened. Members of the public have spoken out voicing that a journalist who instructs people to violate airport security like Chinono has been doing since 29 May 2024, will compromise Blessed Mhlangas fight for justice. When Chinonos colleague tried to hack Gatwick Airport database, she was trying to delete one of her names she used to enter UK in 2001, the same year Hopewell Chinono changed his own name from Mukusha in the period he is accused by the NHS expert and other professionals of leading cheque and card raids across UK care homes and using Royal Mail syndicates.\n\nA 2021 article published by his own former employer on the AMH newspapers over Hopewell Chinonos wealth story, exposes him for failing to account for money he boasts of amassing from journalism.\n\nThe most explosive expose related to money he says he used to purchase his first home, which he contradicts his earlier claim that it was of no foreign source but was a @CabsZimbabwe mortgage, a story he has recently changed to say it was in fact UK money in the form of a UK sportscar loan of 50,000 which he says he realised from selling the car and purchased his Chisipite home around 2001-4.\n\nAside all this, members of the public have raised concerns saying Chinono who has seemed to profit the incarceration of several other people, including Job Sikhala, is likely seeking to obtain both cover up and other benefits from Mhlangas struggle, while potentially compromising the case. The discussion was held on \n\nhttps://t.co/UBSsdyGGNa\n\nPolice@PoliceZimbabwesay the Blessed Mhlanga@bbmhlangafamily have disowned Hopewell Chinono@daddyhopesaying he is the one who recently requested to represent him at a time@TrevorNcube@NewsDayZimbabweAMH has its own representatives. Public complaints have been raisedhttps://t.co/eMDKLfHhk7\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Editorial Team | ZimEye | Police @PoliceZimbabwe say the Blessed Mhlanga @bbmhlangafamily have disowned Hopewell Chin’ono @daddyhope saying he … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/blessed-mhlangas-family-disown-hopewell-chinono-following-gatwick-airport-hacking-by-journalists-friend-to-delete-name-used-during-2001-frauds/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Mhlanga’s Family Disown Hopewell Chin’ono Following Gatwick-Airport Hacking By Journalist’s Friend To Delete Name Used During 2001 Frauds\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "Zanu PF Narrowly Wins Norton By-election",
            "url": "https://www.zimeye.net/2025/03/09/zanu-pf-narrowly-wins-norton-by-election/",
            "content": "By A Correspondent\n\nIn a tightly contested race, Zanu PFs Tsomondo W. Charamba has emerged victorious in the Norton Ward 3 local authority by-election, defeating independent candidate Paradzayi P. Tanatswa by a narrow margin of just 10 votes.\n\nCharamba received 233 votes, while Tanatswa garnered 222 votes, highlighting the intense competition between the two candidates.\n\nThe by-election, which took place in Ward 3 of Norton, saw a highly engaged electorate, with both candidates vying for support in a race that could serve as a reflection of the broader political climate.\n\nThe close result is a clear indicator of the shifting political dynamics in the area, with independent candidates gaining significant traction against established political parties like Zanu PF.\n\nDespite the narrow victory, Charambas win will be viewed as a testament to Zanu PFs continued strong presence in the area, even as independent candidates begin to make a more noticeable impact.\n\nThe elections close nature suggests that the traditional dominance of political parties may be challenged in the upcoming years, particularly as voters increasingly seek alternatives to the status quo.\n\nFor Tanatswa, the close loss serves as a positive sign of independent candidates growing influence in Zimbabwes political landscape.\n\nWhile he fell short this time, the result reflects a strong showing and an indication that his campaign resonated with a significant portion of the electorate.\n\nHis performance could encourage more independents to contest future elections, particularly in areas where voters feel they are not adequately represented by traditional party structures.\n\nThe results of the Norton Ward 3 by-election raise important questions about the political future of Zimbabwe. With margins this thin, both major political parties and independent candidates will be aware that every vote counts, and the strategies they adopt moving forward will be critical in ensuring success in future electoral contests.\n\nAs the political scene in Zimbabwe continues to evolve, the Norton by-election serves as a reminder of the growing competitiveness in local elections and the potential for independent candidates to increasingly challenge the established political powers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a tightly contested race, Zanu PF’s Tsomondo W. Charamba has emerged victorious in the Norton Ward … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/zanu-pf-narrowly-wins-norton-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Narrowly Wins Norton By-election\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "Munetsi Scores First EPL Goal",
            "url": "https://www.zimeye.net/2025/03/09/munetsi-scores-first-epl-goal/",
            "content": "By A Correspondent\n\nMarshall Munetsi marked his debut goal in the English Premier League during Wolves match against Everton on Saturday.\n\nStarting the game and playing until halftime, Munetsi scored the equaliser in the 40th minute after Everton had taken an early lead.\n\nThe Warriors international expertly controlled a through pass before striking a first-time shot inside the box to level the score.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Marshall Munetsi marked his debut goal in the English Premier League during Wolves’ match against Everton on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/munetsi-scores-first-epl-goal/\">Continue reading<span class=\"screen-reader-text\"> \"Munetsi Scores First EPL Goal\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "First Woman To Expose Emmanuel Makandiwa",
            "url": "https://www.zimeye.net/2025/03/09/first-woman-to-expose-emmanuel-makandiwa/",
            "content": "Today, the first woman to expose Emmanuel Makandiwa might not be alive, but her expose of the prophet has finally surfaced on many peoples eyes. Many loyal UFIC church members on Sunday joined hands to condemn Maynard Manyowas mentor, Uebert Angels friend Makandiwa.\n\nOne of them is the prolific blogger Rose Mudiwa who in writing briefly wrote saying, Baba ava ndavanyarira nhasi ende ndanzwa kunyara when he tried to justify that prophetic competition. My goodness I felt embarrassed for him I could feel it kuti paita inonzi IKABOD. Kuita mahumbwe mu church.\n\nThe nation's first female whistle-blower on many Emmanuel Makandiwa scandals, Blessing Mashangwa has died. FULL STORY BELOWpic.twitter.com/ZLIHrd5DgQ\n\nAnyway, didnt Mirako say if you step there uchatsipikwa you will go blank and you wont see anything. Aiwa either matsipikwa or Noone registered and that was a silly skit yatovabvisa chiremerera zvamchose! Mese mawona live iyo murikuti the Creator of Heaven and earth anga atoripo?  Kwanai.\n\nWe are in the endtimes, the antiChrist is about to be revealed but murikuita ma skits mu church. This year you will know that God is not your mate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Today, the first woman to expose Emmanuel Makandiwa might not be alive, but her expose’ of the ‘prophet’ has finally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/first-woman-to-expose-emmanuel-makandiwa/\">Continue reading<span class=\"screen-reader-text\"> \"First Woman To Expose Emmanuel Makandiwa\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "Road Safety: Watch Out For Pedestrians …",
            "url": "https://www.zimeye.net/2025/03/09/road-safety-watch-out-for-pedestrians/",
            "content": "When we think about roads, its easy to focus on the vehicles that use them.\n\nBut roads arent just meant for cars, trucks, and bikes; they are shared spaces where pedestrians also have the right to walk.\n\nAs drivers, we have a responsibility to ensure the safety of everyone using the road, including those on foot.\n\nPedestrians are vulnerable road users. Whether they are crossing at a designated crosswalk or walking along the roadside, they deserve the same respect and attention that drivers give to other vehicles.\n\nSlowing down when approaching a pedestrian crossing isnt just a courtesyits a critical safety measure. Pedestrians have the right of way, and as drivers, its our job to make sure they can cross the road safely.\n\nIf you spot a pedestrian already in the crosswalk, dont hesitate to stop and allow them to finish crossing before proceeding. Its essential to give them the time they need to move safely without rushing or creating a dangerous situation.\n\nIt only takes a few seconds, but it can make all the difference in ensuring that no one gets hurt.\n\nPracticing road courtesy doesnt only apply to pedestrians. As a responsible driver, your actions behind the wheel should always prioritize safety, not just for yourself but for everyone around you. Being aware of pedestrians, staying alert to crossing signals, and yielding when necessary are all parts of safe defensive driving.\n\nUltimately, safety begins with us. Its not enough to drive safely in terms of speed limits and traffic signals; we must also be vigilant and empathetic toward those who might be at greater risk on the roads. So, lets share the road and respect pedestrian rightsby doing so, we can help create a safer, more considerate environment for everyone.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When we think about roads, it’s easy to focus on the vehicles that use them. But roads aren’t just meant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/road-safety-watch-out-for-pedestrians/\">Continue reading<span class=\"screen-reader-text\"> \"Road Safety: Watch Out For Pedestrians …\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "Mnangagwa Party Targets Glen View South Constituency",
            "url": "https://www.zimeye.net/2025/03/09/mnangagwa-party-targets-glen-view-south-constituency/",
            "content": "By A Correspondent\n\nThe ZANU PF Party is holding primaries for the Glenview South constituency ahead of the upcoming by-election.\n\nOn Saturday, the candidates vying for the ZANU PF ticket were introduced: Tsitsi Taomera, Jabulani Mbetu, Bani Muchakachi, and Tawanda Utete.\n\nThese aspirants have been vetted and approved by the party as they prepare for a competitive selection process to represent ZANU PF in the upcoming by-elections.\n\nAt the event to introduce the candidates, Politburo member Paul Mangwana emphasized the importance of running a peaceful campaign.\n\nThe by-election is scheduled for April 12, following the death of Citizens Coalition for Change (CCC) MP Grandmore Hakata for the constituency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ZANU PF Party is holding primaries for the Glenview South constituency ahead of the upcoming by-election. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/mnangagwa-party-targets-glen-view-south-constituency/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Party Targets Glen View South Constituency\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "Peter Dewa Moyo Caught On Camera Violently Assaulting A Woman",
            "url": "https://www.zimeye.net/2025/03/09/peter-dewa-moyo-caught-on-camera-violently-assaulting-a-woman/",
            "content": "The musician Peter Dewa Moyo is still to comment after a viral video surfaced of him assaulting an unnamed woman. In the clip Moyo whose distinct hairstyle pops prominently, overpowers the woman and punches her heavily as onlookers speak. A male voice is heard saying, if you leave them to it, someone will soon be killed!\n\nThe musician Peter Dewa Moyo is still to comment after a viral video surfaced of him assaulting an unnamed woman. In the clip Moyo whose distinct hairstyle pops prominently, overpowers the woman and punches her heavily as onlookers speak. A male voice is heard saying, if youpic.twitter.com/l6HW1lcsJJ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The musician Peter Dewa Moyo is still to comment after a viral video surfaced of him assaulting an unnamed woman. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/peter-dewa-moyo-caught-on-camera-violently-assaulting-a-woman/\">Continue reading<span class=\"screen-reader-text\"> \"Peter Dewa Moyo Caught On Camera Violently Assaulting A Woman\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "Mavhenyengwa Publicly Blasts War Veteran Blessed Geza…",
            "url": "https://www.zimeye.net/2025/03/09/mavhenyengwa-publicly-blasts-war-veteran-blessed-geza/",
            "content": "By A Correspondent\n\nZanu PF Masvingo Provincial chairperson, Robson Mavhenyengwa, has boldly declared that President Emmerson Mnangagwa will remain in office beyond 2028.\n\nSpeaking at the Masvingo Province Presidential War Veteran Fund, Housing, and Borehole Drilling launch, as well as the Masvingo West Constituency Victory celebrations at Gwengavi Primary School on Saturday, Mavhenyengwa, a former senior officer of the Zimbabwe Republic Police, made it clear that the ruling party would disregard the constitution to ensure Mnangagwa stays in power.\n\nWe are clear on the issue, Masvingo Province is solidly behind President Emmerson Mnangagwa. Our position is very clear, please we dont want noise, the President will be in office beyond 2028, Mavhenyengwa declared.\n\nThe chairperson also addressed party discipline, expressing approval of recent party decisions. We dont tolerate malcontents in the party. We are happy Blessed Geza has been fired. Here in Masvingo we have Ganyiwa, Gopo, and a few others. These cannot remain in Zanu PF. We are happy with Gezas dismissal, he added.\n\nMavhenyengwas statements further solidified the provinces unwavering support for President Mnangagwas leadership beyond his current term.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Masvingo Provincial chairperson, Robson Mavhenyengwa, has boldly declared that President Emmerson Mnangagwa will remain in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/mavhenyengwa-publicly-blasts-war-veteran-blessed-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Mavhenyengwa Publicly Blasts War Veteran Blessed Geza…\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "UK Govt Revokes COS Recruitment License Of Gaza Who Threatened To Torture Employees Using CIO",
            "url": "https://www.zimeye.net/2025/03/09/uk-govt-revokes-cos-recruitment-license-of-gaza-who-threatened-to-torture-employees-using-cio/",
            "content": "The British Govts Home Office Department has issued the following letter to employees of a Zimbabwean exposed by ZimEye while threatening to torture his complaining employees using the Central Intelligence Organisation.\n\nThe letter outlines next steps for employees left stranded and hints on what they need to do to transfer to another employer.\n\nREMOVAL FROM THE REGISTER OF LICENSED SPONSORS:\n\nCaring stars LimitedWe are writing to inform you that on 01/08/2024 the decision was made to revoke the sponsor licence of the above company.\n\nWhen a sponsor licence is revoked any Certificates of Sponsorship (CoS) automatically become invalid and this means that any workers associated with that licence are affected. You have been identified as one of those workers.\n\nWhat happens nextYour existing permission remains valid until another Home Office department writes to you to confirm it has been shortened or cancelled, or until it expires (whichever is the earliest).\n\nUnfortunately, for confidentiality reasons we are unable to provide further detail as to the reason for the revocation of the sponsor licence or answer any further queries relating to the matter.\n\nIf you do have any questions or concerns you will need to discuss these with your employer. There is also further information available on the gov.uk website:\n\nEmployees: if your visa sponsor loses their licence  GOV.UK\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The British Govt’s Home Office Department has issued the following letter to employees of a Zimbabwean exposed by ZimEye while … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/uk-govt-revokes-cos-recruitment-license-of-gaza-who-threatened-to-torture-employees-using-cio/\">Continue reading<span class=\"screen-reader-text\"> \"UK Govt Revokes COS Recruitment License Of Gaza Who Threatened To Torture Employees Using CIO\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        },
        {
            "title": "Masvingo Province Declares Mnangagwa Staying Beyond 2028",
            "url": "https://www.zimeye.net/2025/03/09/masvingo-province-declares-mnangagwa-staying-beyond-2028/",
            "content": "By A Correspondent\n\nZanu PF Masvingo Provincial chairperson, Robson Mavhenyengwa, has boldly declared that President Emmerson Mnangagwa will remain in office beyond 2028.\n\nSpeaking at the Masvingo Province Presidential War Veteran Fund, Housing, and Borehole Drilling launch, as well as the Masvingo West Constituency Victory celebrations at Gwengavi Primary School on Saturday, Mavhenyengwa, a former senior officer of the Zimbabwe Republic Police, made it clear that the ruling party would disregard the constitution to ensure Mnangagwa stays in power.\n\nWe are clear on the issue, Masvingo Province is solidly behind President Emmerson Mnangagwa. Our position is very clear, please we dont want noise, the President will be in office beyond 2028, Mavhenyengwa declared.\n\nThe chairperson also addressed party discipline, expressing approval of recent party decisions. We dont tolerate malcontents in the party. We are happy Blessed Geza has been fired. Here in Masvingo we have Ganyiwa, Gopo, and a few others. These cannot remain in Zanu PF. We are happy with Gezas dismissal, he added.\n\nMavhenyengwas statements further solidified the provinces unwavering support for President Mnangagwas leadership beyond his current term.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Masvingo Provincial chairperson, Robson Mavhenyengwa, has boldly declared that President Emmerson Mnangagwa will remain in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/09/masvingo-province-declares-mnangagwa-staying-beyond-2028/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Province Declares Mnangagwa Staying Beyond 2028\"</span></a></p>",
            "time": "21:46",
            "date": "09 Mar 2025"
        }
    ]
}