{
    "news": [
        {
            "title": "Super Eagles Stun Wasps Of Rwanda",
            "url": "https://www.zimeye.net/2025/03/22/super-eagles-stun-wasps-of-rwanda/",
            "content": "The Super Eagles of Nigeria secured a thrilling victory over Rwandas Wasps in their 2026 World Cup qualifying match at the Amavubi Stadium.\n\nVictor Osimhen, the Napoli-owned forward, stole the show with a first-half brace that catapulted him to the second-highest goal scorer spot for the Super Eagles.\n\nOsimhens opening goal came courtesy of a well-executed set piece, with Ademola Lookman providing the cross that Osimhen slotted past Rwandas goalkeeper, Ntwari Fiacre. This goal marked Osimhens 24th for the national team, surpassing Segun Odegbamis long-standing record of 23 goals.\n\nJust before the half-time whistle, Osimhen struck again, receiving a pass from midfield, driving into Rwandas defense, and flicking the ball past the goalkeeper. This goal brought Osimhens tally to 25, leaving him just 12 goals shy of Rashidi Yekinis all-time record of 37 goals for Nigeria.\n\nHere is the updated list of Nigerias top 10 all-time goal scorers:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Super Eagles of Nigeria secured a thrilling victory over Rwanda’s Wasps in their 2026 World Cup qualifying match at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/super-eagles-stun-wasps-of-rwanda/\">Continue reading<span class=\"screen-reader-text\"> \"Super Eagles Stun Wasps Of Rwanda\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "No One Inside State House Grounds For Automatic Impeachment",
            "url": "https://www.zimeye.net/2025/03/22/no-one-inside-state-house-grounds-for-automatic-impeachment/",
            "content": "The Constitutional Vacuum in Zimbabwe: Grounds for the Immediate Impeachment of Emmerson Mnangagwa\n\nIt is no longer a question of politics or public opinionit is a matter of undeniable constitutional fact: Zimbabwe currently has no legitimate president at the helm of State House. The evidence that Emmerson Mnangagwa has long vacated the duties and obligations of the office he clings to is overwhelming. What remains is a hollow shell, propped up by systemic impunity, and fueled by a machinery that has, in effect, replaced governance with racketeering.\n\nThe constitutional mandate of the President is defined in unequivocal terms: to uphold, protect, and defend the Constitution and to discharge duties solely in the interest of the people of Zimbabwe. Yet what we have witnessed, especially since 2022, is a complete abandonment of that mandate.\n\nThe Consummated Grounds for Impeachment\n\nSection 97 of the Zimbabwean Constitution sets out the grounds for impeachment: serious misconduct; failure to uphold the Constitution; willful violation of the law; and inability to perform presidential functions due to incapacity. It is beyond dispute that these conditions have not only been met but have been grossly exceeded.1. Abandonment of State Duties: The President vacated State House duties as early as 2022 when he physically departed the presidential residence to personally oversee the unconstitutional installation of a convicted armed robber as a traditional chief in Chiweshe. Commanding military and security operatives to harass civilians and manipulate chieftainship appointments constitutes serious misconduct under any legal definition.2. Complicity in Organised Fraud: The head of state has brazenly admitted, both publicly and indirectly through state-sponsored narratives, to sponsoring and aiding Maxwell Chikumbutsoan armed robbery suspect masquerading as an inventor. The con has defrauded investors in Switzerland, the Czech Republic, and other countries to the tune of US$3.1 million. This is clear evidence of willful violation of both domestic and international laws, including anti-money laundering statutes.3. Participation in a Pattern of State Capture and Criminal Enterprise: The Gold Mafia revelations, compounded by Mnangagwas intimate connections with controversial figures such as Uebert Angel and Kamlesh Pattniindividuals linked to violent and illicit financial operations since the early 1990sreveal a broader scheme of state-sanctioned plunder for purposes of overthrowing elected governments between Kenya and Zimbabwe (one of whom Chris Mutsvangwa blatantly announced on ZBC TV that the army would be used to overthrow the govt through changing the election results. This involvement amounts to an abdication of presidential duties in favor of personal and factional enrichment, violating the oath of office and betraying the people of Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "⸻ The Constitutional Vacuum in Zimbabwe: Grounds for the Immediate Impeachment of Emmerson Mnangagwa It is no longer a question … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/no-one-inside-state-house-grounds-for-automatic-impeachment/\">Continue reading<span class=\"screen-reader-text\"> \"No One Inside State House Grounds For Automatic Impeachment\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "The Helmet For Your Safety…",
            "url": "https://www.zimeye.net/2025/03/22/the-helmet-for-your-safety/",
            "content": "In todays fast-paced world, we often overlook one of the simplest yet most effective ways to safeguard our lives and the lives of those we care about: wearing helmets and seat belts. Whether youre cycling, riding a motorcycle, or simply driving a car, these preventive measures play a crucial role in reducing the risk of injuries and fatalities in the event of an accident.\n\nHelmets: A Life-Saving Accessory\n\nHelmets are an essential piece of safety equipment for anyone participating in activities such as biking, motorcycling, or even skateboarding. They are designed to protect the most vital part of your bodyyour brain. In fact, research has shown that wearing a helmet significantly reduces the risk of head injury and death. According to studies, wearing a helmet while riding a bicycle can reduce the risk of a head injury by up to 70%. For motorcyclists, this number is just as impressive, with helmets reducing the risk of a fatal head injury by 37%.\n\nDespite the overwhelming evidence, many people still neglect to wear helmets, often due to inconvenience, discomfort, or a sense of invincibility. The truth is, accidents can happen in the blink of an eye, and in those moments, a helmet can be the difference between life and death.\n\nSeat Belts: A Simple Yet Effective Safety Tool\n\nSeat belts are just as crucial for protecting yourself while driving or riding in a car. In the United States alone, the Centers for Disease Control and Prevention (CDC) report that seat belts save thousands of lives each year. Wearing a seat belt reduces the risk of fatal injury to front-seat passengers by 45%, and it lowers the risk of moderate to severe injuries by 50%.\n\nWhile many people might think theyre safe driving short distances or at low speeds, the reality is that most car accidents happen within a few miles of home or at low speeds. Even minor accidents can result in serious injuries or fatalities if youre not wearing a seat belt. Unfortunately, many people still neglect to buckle up, putting themselves and their passengers at risk.\n\nBe Your Own Advocate\n\nOne of the most empowering actions you can take for yourself and your loved ones is to become your own advocate when it comes to safety. This means consistently wearing a helmet when engaging in activities like biking or motorcycling, and always buckling up before you start driving or riding in a car. Taking these precautions not only ensures your own well-being, but it also sets a positive example for your family and friends.\n\nMoreover, educating othersespecially children and teenagersabout the importance of wearing helmets and seat belts can have a lasting impact. Encourage your loved ones to adopt safe practices, and dont hesitate to speak up if you see someone not wearing their helmet or seat belt. By advocating for safety, you contribute to creating a culture of care, responsibility, and mutual protection.\n\nThe Power of Prevention\n\nIn life, there are many things we cannot control. Accidents, however, are one thing we can work to prevent. By wearing helmets and seat belts, you are taking proactive steps to protect yourself and your loved ones from preventable injuries and deaths. These simple actions dont just save livesthey also provide peace of mind.\n\nUltimately, the decision to wear a helmet or seat belt isnt just about following the law or avoiding finesits about being a responsible individual who values their life and the lives of others. Become your own advocate for safety, and inspire others to do the same. Protect yourself, protect your family, and together, lets make safety a priority.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In today’s fast-paced world, we often overlook one of the simplest yet most effective ways to safeguard our lives and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/the-helmet-for-your-safety/\">Continue reading<span class=\"screen-reader-text\"> \"The Helmet For Your Safety…\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "Sad: Pastor Shoots Own Son After Mistaking Him For Intruder",
            "url": "https://www.zimeye.net/2025/03/22/sad-pastor-shoots-own-son-after-mistaking-him-for-intruder/",
            "content": "By A Correspondent\n\nA shocking incident has unfolded in Bulawayo, where the founder of River of Life International Church, Bothwell Phiri, allegedly shot his own son, Jordan, after mistaking him for an intruder. The 57-year-old pastor is now facing attempted murder charges.\n\nAccording to police reports, Jordan, 29, returned home late from the familys plot in Esigodini and found the door locked. Attempting to enter through a window, he was met with a gunshot wound to the groin, inflicted by his father.\n\nPhiri immediately rushed his son to the United Bulawayo Hospitals (UBH) for treatment after realizing his mistake. Fortunately, Jordan is currently in stable condition.\n\nAssistant Inspector Nomalanga Msebele, acting spokesperson for the Zimbabwe Republic Police (ZRP) in Bulawayo, confirmed that Phiri admitted to shooting his son, believing him to be an intruder. The police also verified that Phiri is a licensed firearm holder.\n\nMsebele described the incident as unfortunate and assured that investigations are ongoing, with the case set to be brought before the court in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking incident has unfolded in Bulawayo, where the founder of River of Life International Church, Bothwell … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/sad-pastor-shoots-own-son-after-mistaking-him-for-intruder/\">Continue reading<span class=\"screen-reader-text\"> \"Sad: Pastor Shoots Own Son After Mistaking Him For Intruder\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "Machakaire In Trouble For Choosing Geza Over Mnangagwa",
            "url": "https://www.zimeye.net/2025/03/22/machakaire-in-trouble-for-choosing-geza-over-mnangagwa/",
            "content": "By A Correspondent| A man from Inyati  Alfred Ngonidzashe Machakaire is languishing in prison for close to a month after he was arrested in February and detained for allegedly passing on some unpalatable comments against PresidentEmmerson Mnangagwaand at the same time praisingBlessed Runesu Geza, an erstwhile lieutenant of the countrys leader.\n\nMachakaire(34), who resides in Gowo village under Chief Makoni in Inyati in Makoni District in Manicaland province, has spent 24 days in both police cells and at Reshape Prison in Manicaland province after he was arrested on 24 February 2025 by Zimbabwe Republic Police officers, who charged him with undermining authority of or insulting President Mnangagwa as defined in section 33(2)(a)(b) of the Criminal Law (Codification and Reform) Act.\n\nAccording to prosecutors, Machakaire undermined authority of and insulted President Mnangagwa when he was involved in a verbal altercation withLeonard Chidemo, the ruling ZANU PF political party Councillor for Ward 5 in Makoni North constituency in Makoni District in Manicaland, who was drinking beer at Mugadza Bottle Store at Runyange Business Centre in Chendambuya, where he allegedly asked Chidemo to buy him some beer.\n\nChidemo reportedly told Machakaire that he did not have some money to buy him beer and this did not go down well with him and he started shouting at the ZANU PF political party Councillor.\n\nProsecutors said Machakaire, who is represented byLeonard ChigadzaofZimbabwe Lawyers for Human Rights, undermined authority of or insulted President Mnangagwa by uttering the following words; You Chidemo, down with Mnangagwa, I am Geza, on the 31st, the country will be fine, Mnangagwa is a vagina, you have caused the death of people in the country.\n\nAccording to prosecutors, Machakaire acted unlawfully when he allegedly uttered the insulting words and also praised Geza, a veteran of the liberation war and a ZANU PF political party central committee member, who was recently expelled from the ruling political party.\n\nMachakaire is one of several people, who have been arrested and prosecuted across Zimbabwe for allegedly undermining authority of or insulting President Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A man from Inyati Alfred Ngonidzashe Machakaire is languishing in prison for close to a month after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/machakaire-in-trouble-for-choosing-geza-over-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Machakaire In Trouble For Choosing Geza Over Mnangagwa\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "ZDF Responds To Geza Appearance In Military Gear",
            "url": "https://www.zimeye.net/2025/03/22/zdf-responds-to-geza-appearance-in-military-gear/",
            "content": "By A Correspondent\n\nThe Zimbabwe Defence Forces (ZDF) has issued a warning to the public about the illegal use of military uniforms, following a recent incident involving Blessed Runesu Geza, an expelled member of the ZANU PF Central Committee. Geza appeared in a video circulating on social media, calling for mass protests while dressed in military attire.\n\nIn a statement released on Friday, March 21, the ZDF reminded the public that wearing military uniforms is prohibited for civilians under the law. The statement emphasized that individuals found violating this rule will face legal action. The ZDFs statement reads:\n\nMISUSE OF MILITARY UNIFORM BY CIVILIANS\n\nThe Zimbabwe Defence Forces have expressed concern over the ongoing misuse of military uniforms by members of the public.\n\nThe public is reminded that, according to the Defence Act (Chapter 11:02), wearing military attire without authorization is a criminal offense. Specifically, Section 99 (2)(c) of the Defence Act states that:\n\nAny person who, without permission, wears or uses any decoration or military uniform supplied to or authorized for use by a member of the Defence Forces or any decoration closely resembling such attire, is guilty of an offense.\n\nTherefore, the public is urged to refrain from acquiring or wearing military clothing or items that resemble military uniforms. Those caught violating this law will be prosecuted.\n\nThe ZDF also encouraged the public to report anyone seen wearing military uniforms outside authorized zones, such as military camps, or anyone committing crimes while impersonating a member of the Defence Forces.\n\nThe ZDF appeals to citizens to notify the Zimbabwe Republic Police or Zimbabwe Military Police about any civilian found wearing military attire under suspicious circumstances.\n\nIndividuals who have information about misuse of ZDF uniforms can contact the ZDFs call centers at the following numbers: 0712842318, 0716801064, or landline numbers (0242) 252094 and (0242) 791129.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Defence Forces (ZDF) has issued a warning to the public about the illegal use of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/zdf-responds-to-geza-appearance-in-military-gear/\">Continue reading<span class=\"screen-reader-text\"> \"ZDF Responds To Geza Appearance In Military Gear\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "Advocate Chamisa Displays Political Maturity, Congratulates Kirsty Coventry On Winning IOC Presidency",
            "url": "https://www.zimeye.net/2025/03/22/advocate-chamisa-displays-political-maturity-congratulates-kirsty-coventry-on-winning-ioc-presidency/",
            "content": "By A Correspondent\n\nOn Friday, opposition leader Advocate Nelson Chamisa showcased political maturity by extending his congratulations to Zimbabwes Sports Minister, Kirsty Coventry, following her election as President of the International Olympic Committee.\n\nDespite the prevailing political tensions, Chamisa issued a statement expressing his support:\n\nCONGRATULATIONS ZIMBABWE Thank you, Kirsty Coventry, for bringing the light of Zimbabwe to the world. You are a true trailblazer and a source of inspiration. Your achievements reflect your remarkable talents and numerous groundbreaking successes. God is amazing! We bless you as you step into this new role. Keep soaring.\n\nThis serves as a reminder to the world that Zimbabwe is on the rise and cannot be overlooked.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent On Friday, opposition leader Advocate Nelson Chamisa showcased political maturity by extending his congratulations to Zimbabwe’s Sports … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/advocate-chamisa-displays-political-maturity-congratulates-kirsty-coventry-on-winning-ioc-presidency/\">Continue reading<span class=\"screen-reader-text\"> \"Advocate Chamisa Displays Political Maturity, Congratulates Kirsty Coventry On Winning IOC Presidency\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "Zanu PF Goons Vandalize Great Zimbabwe University Property",
            "url": "https://www.zimeye.net/2025/03/22/zanu-pf-goons-vandalize-great-zimbabwe-university-property/",
            "content": "By A Correspondent\n\nAuthorities at Great Zimbabwe University (GZU) have expressed serious concerns after reports emerged of Zanu PF activists vandalizing property on the university campus.\n\nThe incident occurred during a meeting of the Children of Zimbabwe Liberation War Veterans Association (CZLWVA) at the university, at the beginning of the week, where it was reported that Zanu PF-affiliated youths caused significant damage to university property.\n\nSources within the institution have accused the group of acting recklessly during their activities.\n\nThis was an unnecessary and destructive act. The actions of these individuals have caused significant damage to our facilities, a GZU official said.\n\nWe are deeply disturbed by such behavior, especially given that this is a place of learning and academic excellence.\n\nThe meeting, which took place as part of a youth empowerment initiative, brought together several high-profile political figures. However, the incident has overshadowed the otherwise positive intentions of the gathering.\n\nDespite the vandalism, the event aimed to address the youth of Masvingo Province with various empowerment programs.\n\nDespite the disruption, the meeting continued, with leaders like Hon. John Paradza, Deputy Secretary for Youth, reinforcing the governments commitment to youth development and economic empowerment.\n\nHowever, sources indicate that the incident has left a bitter taste among many attendees and officials at the university.\n\nIn the wake of the event, GZU officials are now considering additional security measures to protect university property and ensure such incidents do not occur in the future.\n\nThe incident has sparked heated debates about the need for greater accountability and discipline within political organizations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Authorities at Great Zimbabwe University (GZU) have expressed serious concerns after reports emerged of Zanu PF activists … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/zanu-pf-goons-vandalize-great-zimbabwe-university-property/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Goons Vandalize Great Zimbabwe University Property\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "Top Prophet Up For Attempted Murder",
            "url": "https://www.zimeye.net/2025/03/22/top-prophet-up-for-attempted-murder/",
            "content": "By ReligionReporter-The founderand leader of River of Life International Church, Prophet Bothwell Phiri, 57, has been arrested and charged with attempted murder after a shocking incident at his Kumalo suburb residence.\n\nIn the early hours of Monday, Phiri allegedly shot his son, Jordan Phiri, 29, mistaking him for an intruder.\n\nThe incident unfolded when Jordan, returning late from the familys plot in Esigodini, found the house locked and attempted to enter through a window.\n\nStartled by the noise, Prophet Phiri, armed with his legally registered firearm, investigated and, in a tragic turn of events, shot his son in the groin.\n\nBulawayo provincial acting police spokesperson, Assistant Inspector Nomalanga Msebele, confirmed the incident, stating that it occurred at approximately 1:20 a.m.\n\nHe opened a window, and as he attempted to gain entry, he was shot in the groin by the accused person. Upon realizing it was his son, the accused immediately rushed him to United Bulawayo Hospitals (UBH) for treatment, Msebele said.\n\nShe added that Jordan is in stable condition and that Phiri told police he genuinely believed he was confronting an intruder.\n\nThe firearmwas examined, and police confirmed that the accused is a licensed gun holder, Msebele said, noting that investigations are ongoing and the case will proceed to court.\n\nEfforts to obtain a comment from Prophet Phiri were unsuccessful, as he was reportedly in an extended meeting.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Religion Reporter-The founder and leader of River of Life International Church, Prophet Bothwell Phiri, 57, has been arrested and charged with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/top-prophet-up-for-attempted-murder/\">Continue reading<span class=\"screen-reader-text\"> \"Top Prophet Up For Attempted Murder\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        },
        {
            "title": "Prominent Pastor Shoots Son",
            "url": "https://www.zimeye.net/2025/03/22/prominent-pastor-shoots-son/",
            "content": "By Religion Reporter-Prophet Bothwell Phiri, 57, the founder and leader of River of Life International Church, has been arrested and charged with attempted murder after a shocking incident at his Kumalo suburb residence.\n\nIn the early hours of Monday, Phiri allegedly shot his son, Jordan Phiri, 29, mistaking him for an intruder.\n\nThe incident unfolded when Jordan, returning late from the familys plot in Esigodini, found the house locked and attempted to enter through a window.\n\nStartled by the noise, Prophet Phiri, armed with his legally registered firearm, investigated and, in a tragic turn of events, shot his son in the groin.\n\nBulawayo provincial acting police spokesperson, Assistant Inspector Nomalanga Msebele, confirmed the incident, stating that it occurred at approximately 1:20 a.m.\n\nHe opened a window, and as he attempted to gain entry, he was shot in the groin by the accused person. Upon realizing it was his son, the accused immediately rushed him to United Bulawayo Hospitals (UBH) for treatment, Msebele said.\n\nShe added that Jordan is in stable condition and that Phiri told police he genuinely believed he was confronting an intruder.\n\nThe firearmwas examined, and police confirmed that the accused is a licensed gun holder, Msebele said, noting that investigations are ongoing and the case will proceed to court.\n\nEfforts to obtain a comment from Prophet Phiri were unsuccessful, as he was reportedly in an extended meeting.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Religion Reporter-Prophet Bothwell Phiri, 57, the founder and leader of River of Life International Church, has been arrested and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/22/prominent-pastor-shoots-son/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Pastor Shoots Son\"</span></a></p>",
            "time": "18:28",
            "date": "23 Mar 2025"
        }
    ]
}