{
    "news": [
        {
            "title": "FIFA Sets the Stage for 2026 World Cup Draw in Washington",
            "url": "https://www.zimeye.net/2025/12/05/fifa-sets-the-stage-for-2026-world-cup-draw-in-washington/",
            "content": "Sports Correspondent  The draw for the 2026 FIFA World Cup is set to take place on Friday evening in Washington, USA, marking a major milestone ahead of the expanded global showpiece.\n\nFIFA\n\nFormer Manchester United and England defender Rio Ferdinand will lead the proceedings. The 47-year-old will be joined on stage by broadcaster Samantha Johnson and a star-studded lineup of sporting icons, including Tom Brady, Wayne Gretzky, Aaron Judge and Shaquille ONeal.\n\nDate and TimeThe final draw is scheduled for Friday, 5 December 2025 at 7 PM CAT.\n\nQualified TeamsA total of 42 nations have already secured their places:\n\nCo-hosts:Canada, Mexico, USAAFC:Australia, IR Iran, Japan, Jordan, Korea Republic, Qatar, Saudi Arabia, UzbekistanCAF:Algeria, Cabo Verde, Cte dIvoire, Egypt, Ghana, Morocco, Senegal, South Africa, TunisiaConcacaf:Curaao, Haiti, PanamaCONMEBOL:Argentina, Brazil, Colombia, Ecuador, Paraguay, UruguayOFC:New ZealandUEFA:Austria, Belgium, Croatia, England, France, Germany, Netherlands, Norway, Portugal, Scotland, Spain, Switzerland\n\nSix more teams will be confirmed in March 2026.\n\nFour of the remaining slots will come from the 16-team UEFA play-offs, featuring Albania, Bosnia and Herzegovina, Czechia, Denmark, Italy, Kosovo, Northern Ireland, North Macedonia, Poland, Republic of Ireland, Romania, Slovakia, Sweden, Trkiye, Ukraine and Wales.\n\nThe final two berths will be determined through the FIFA World Cup 2026 Play-Off Tournament contested by Bolivia, Congo DR, Iraq, Jamaica, New Caledonia and Suriname.\n\nSeedingThe 48 teams are divided into four pots of 12, based mainly on FIFA world rankings. The three hosts automatically occupy pot one, while play-off winners will be placed in pot four.\n\nPot 1:Canada, Mexico, USA, Spain, Argentina, France, England, Brazil, Portugal, Netherlands, Belgium, GermanyPot 2:Croatia, Morocco, Colombia, Uruguay, Switzerland, Japan, Senegal, IR Iran, Korea Republic, Ecuador, Austria, AustraliaPot 3:Norway, Panama, Egypt, Algeria, Scotland, Paraguay, Tunisia, Cte dIvoire, Uzbekistan, Qatar, Saudi Arabia, South AfricaPot 4:Jordan, Cabo Verde, Ghana, Curaao, Haiti, New Zealand, European Play-Off A, B, C and D, FIFA Play-Off Tournament 1 and 2\n\nDraw ProcedureThe draw begins with pot 1 teams assigned to groups A to L, followed in order by pots 2, 3 and 4.\n\nHost nations will be identified by coloured balls: Mexico in green (A1), Canada in red (B1) and the USA in blue (D1), following the official match schedule released on 4 February 2024. The remaining pot 1 teams will be drawn into position 1 of their respective groups.\n\nTV DetailsThe ceremony will be streamed live on FIFA.com and across FIFA World Cup social media platforms. SuperSport TV will also broadcast the event.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – The draw for the 2026 FIFA World Cup is set to take place on Friday evening in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/fifa-sets-the-stage-for-2026-world-cup-draw-in-washington/\">Continue reading<span class=\"screen-reader-text\"> \"FIFA Sets the Stage for 2026 World Cup Draw in Washington\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "ZBC Cuts Licence Fees, But Service Quality Still in Question",
            "url": "https://www.zimeye.net/2025/12/05/zbc-cuts-licence-fees-but-service-quality-still-in-question/",
            "content": "Tinashe Sambiri The Zimbabwe Broadcasting Corporation (ZBC) has announced sweeping reductions in radio and television licence fees, a move aimed at easing the financial burden on households, businesses, and vehicle owners.\n\nThe new fees will come into effect on 15 January 2026.\n\nUnder the revised structure, business vehicle radio licences have been cut from US$200 to US$90 per year, while private vehicle licences will now cost US$84 annually, down from US$92.\n\nHousehold fees have seen even sharper reductions: the combined radio and television licence has been slashed from US$100 to just US$24 per year. Urban home radio licences drop from US$40 to US$10 annually, and rural listeners will pay only US$5, down from US$20.\n\nZBC said the adjustment is part of its strategy to make public broadcasting more accessible and to encourage compliance with national licensing regulations. The corporation added that further details on implementation would be released ahead of the January rollout.\n\nDespite the fee cuts, some observers remain cautious. Its good that the fees are lower, but the quality of service hasnt improved, one critic noted. People may pay less, but reception issues and limited channels remain a real problem.\n\nOthers warned that the move may be more symbolic than substantive. This seems aimed at improving the public image of ZBC rather than addressing deeper problems, a media analyst said. The content is still largely state-controlled, and reducing fees does not guarantee fair or independent broadcasting.\n\nAnalysts also cautioned that while the reductions may offer short-term relief, long-term challenges persist, including uneven coverage, political influence over programming, and weak enforcement of licensing in remote areas.\n\nLower fees are welcome, especially for rural households and small businesses, a media expert observed. But for the public to truly benefit, ZBC must improve service quality, transparency, and access to independent content.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– The Zimbabwe Broadcasting Corporation (ZBC) has announced sweeping reductions in radio and television licence fees, a move aimed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/zbc-cuts-licence-fees-but-service-quality-still-in-question/\">Continue reading<span class=\"screen-reader-text\"> \"ZBC Cuts Licence Fees, But Service Quality Still in Question\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "Time To End Sloganeering And Rescue Citizens From Relentless Misery, Action Democratic Movement Declares",
            "url": "https://www.zimeye.net/2025/12/05/time-to-end-sloganeering-and-rescue-citizens-from-relentless-misery-action-democratic-movement-declares/",
            "content": "Tinashe Sambiri In a statement released on Friday, the Action Democratic Movement (ADM) issued a presidential message calling on Zimbabweans to confront the nations ongoing crisis and demand meaningful change.\n\nDear Zimbabweans, the statement began, at some point this nation stood as a working, organised and productive land.\n\nTransport systems connected cities and towns, hospitals functioned with trained professionals, education was ranked among the best on the continent, industries produced, the railway moved goods, and our people worked with dignity. Water flowed, electricity worked, and families could plan for tomorrow.\n\nThe statement contrasted this with the present reality: Today, our factories stand silent, our youth stand idle, and our graduates are forced into surviving as vendors. Unemployment has become normal. Corruption has become familiar. Opportunity has become a privilege reserved for a few. This is not the Zimbabwe our ancestors fought for.\n\nADM emphasised the need for honesty and accountability. We must speak the uncomfortable truth: a nation that does not invest in production, competency, accountability and unity cannot progress. No country grows on excuses, political loyalty or fear. A country grows on vision, planning, honesty, hard work, and leadership that puts people before power.\n\nThe movement was careful to absolve citizens of blame, stressing that the problem lies with systemic failures. But let me be very clear: Zimbabwe is not dead. Our people are not useless. Our youth are not lazy. Our land is not cursed. The problem is not the citizen. The problem is a broken system  and broken systems can be repaired.\n\nADM outlined its vision for a revived nation: We believe in rebuilding, not blaming. We believe in restoring industry, reviving skills, supporting small and medium businesses to become large enterprises, reopening railway systems, modernising transport, reforming public service, and returning dignity to work.\n\nThe movement highlighted its guiding principles:\n\nJobs over promises\n\nSkills over slogans\n\nProduction over politics\n\nAccountability over excuses\n\nUnity over division\n\nADM concluded with an appeal to citizens: Our vision is a Zimbabwe where every citizen can work, every child can dream, every farmer can produce, every graduate can be employed, and every elderly person can live in dignity. Do not give up. Do not lose hope. Do not believe that poverty is your destiny. You are worth more. Zimbabwe is worth more.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– In a statement released on Friday, the Action Democratic Movement (ADM) issued a presidential message calling on Zimbabweans … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/time-to-end-sloganeering-and-rescue-citizens-from-relentless-misery-action-democratic-movement-declares/\">Continue reading<span class=\"screen-reader-text\"> \"Time To End Sloganeering And Rescue Citizens From Relentless Misery, Action Democratic Movement Declares\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "JUST IN: Former Prominent ZBC Staffer Dies",
            "url": "https://www.zimeye.net/2025/12/05/former-prominent-zbc-staffer-dies/",
            "content": "By a Correspondent  Former Zimbabwe Broadcasting Corporation (ZBC) staffer Timothy Makoni has died.\n\nMakonis former colleagues shared the news on Friday, announcing that he passed away in Nyazura, near Mutare in Manicaland province. Details surrounding the cause of his death were not immediately disclosed.\n\nColleagues described Makoni, fondly known asTZ,asa gentleman full of humour and knowledge.\n\nMakoni was also a liberation war veteran, and during the struggle, he was known by his war name, Cde Torai Zvombo.\n\nHis wife, Mrs. Makoni, confirmed his passing but did not provide further details.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent — Former Zimbabwe Broadcasting Corporation (ZBC) staffer Timothy Makoni has died. Makoni’s former colleagues shared the news … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/former-prominent-zbc-staffer-dies/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Former Prominent ZBC Staffer Dies\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "Strange Woman Steals Baby After Offering Mother Cleaning Job",
            "url": "https://www.zimeye.net/2025/12/05/strange-woman-steals-baby-after-offering-mother-cleaning-job/",
            "content": "By A Correspondent  A Chiredzi mother is frantically searching for her four-month-old baby boy after he was reportedly taken by a woman who had offered her a part-time cleaning job.\n\nMasvingo provincial police spokesperson, Inspector Kudakwashe Dhewa, confirmed the distressing incident, which occurred two weeks ago along Sweetview Road.\n\nAccording to police, 19-year-old Letwin Ngandini was approached by an unknown woman who claimed she needed help cleaning a house that was still under construction, about 500 metres from Ngandinis lodgings. Ngandini agreed to assist, bringing her baby along.\n\nWhen they reached the unfinished house, the woman asked Ngandini to fetch a shovel from her home and suggested she leave the baby with her to make it easier to move quickly, Inspector Dhewa explained.\n\nNgandini returned approximately 30 minutes later, only to find that the woman had vanished with her child.\n\nInspector Dhewa appealed to the public for assistance, stating, Police are urging anyone with information that may help locate the suspect or the missing baby to report to the nearest police station or call 0775 996 945.\n\nThe Chiredzi community has expressed shock and concern over the incident, highlighting fears about child safety and trust in strangers.\n\nPolice investigations are ongoing as authorities work to trace both the child and the woman involved.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A Chiredzi mother is frantically searching for her four-month-old baby boy after he was reportedly taken … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/strange-woman-steals-baby-after-offering-mother-cleaning-job/\">Continue reading<span class=\"screen-reader-text\"> \"Strange Woman Steals Baby After Offering Mother Cleaning Job\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "Mnangagwa Glorifies Zanu PF, Remains Mum On Nation’s Crisis",
            "url": "https://www.zimeye.net/2025/12/05/mnangagwa-glorifies-zanu-pf-remains-mum-on-nations-crisis/",
            "content": "Tinashe Sambiri  President Emmerson Mnangagwas latest address to the ZANU-PF Central Committee, delivered at the partys headquarters on Thursday, offered yet another showcase of the ruling partys self-praise even as Zimbabwe battles worsening economic and social pressures that his speech conspicuously avoided.\n\nInstead of confronting the countrys mounting hardships, Mnangagwa focused almost entirely on internal party achievements and loyalty narratives.\n\nMnangagwa opened his remarks by celebrating internal party cohesion, telling the gathering, Comrades, it is my honour to address the 129th session of the CC of our revolutionary mass party, before welcoming new members with the words, Mawana mune vamwe vagara vari mundima Ndinokugamuchirai, youre welcome.\n\nObservers note that while the President emphasises unity, the party continues to face accusations of intolerance toward dissent and closing democratic space.\n\nHe applauded the recent national peoples conference, declaring, We all have a reason to be proud of our achievements, despite widespread public frustration over economic decline, unaffordable basics and persistent governance failures.\n\nAs he looked ahead to 2026, Mnangagwa urged members to stay united, saying, Unity and hard honest work must see us achieve much more in the years ahead. But critics argue the rhetoric of unity often masks the partys inability to address corruption, policy inconsistencies and worsening inequality.\n\nMnangagwa also praised the presentation of the National Development Strategy 2 (NDS2) and the 2026 National Budget, insisting these embody the aspirations of our people. Yet many economists warn that NDS2 remains off-track, with key targets unmet and government expenditure failing to translate into improved public services.\n\nHe told the Central Committee that it must hold robust, constructive and open discussions around the policies, adding that the party must guarantee a seamless coordination of this five-year plan for more people-centred milestones. However, genuine debate is seen as difficult in a structure where dissent is frequently equated with disloyalty.\n\nThe President went on to commend Matabeleland North for completing its provincial party offices and challenged other provinces to follow suit. For many Zimbabweans, this emphasis on party infrastructure stands in stark contrast to the desperate state of public hospitals, schools and roads.\n\nHe further directed the party to prioritise mobilising young people and women to win the Nkulumane seat, claiming, Our inclusive party mobilisation programs leave no one and no place behind. ZANU-PF ihomwe inokwana munhu wese. It is the true political home of any Zimbabwean. Opposition parties, however, argue that ZANU-PFs mobilisation strategies frequently rely on coercion, patronage and politicisation of aid.\n\nMnangagwa reminded members that they are custodians of the Constitution, saying the party must remain united and provide guidance to those who undermine our constitution. Yet civil society groups point out that some of the most serious constitutional violations in recent years have originated from the state itself  from unlawful detentions to politicised policing and disregard for judicial decisions.\n\nThe President also boasted about agricultural success, stating, I commend our farmers for yet another record-breaking yield in the winter wheat harvest. But agricultural unions warn that input distribution remains highly politicised, with Mnangagwa urging that support must reach all beneficiaries despite repeated reports of partisan allocation.\n\nHe highlighted infrastructure development  road and dam construction remains one of our strategic priorities  even though many flagship projects have stalled, suffered from inflated costs or been handed to politically connected contractors without transparency.\n\nMnangagwa closed the meeting by urging party members to engage their communities and be hospitable with our diaspora during the festive season, telling them to share the governments supposed achievements and the message that nyika inovakwa nevene vayo. This, despite the fact that millions in the diaspora left because of economic collapse and continue to sustain the country through remittances that the government often celebrates but does little to earn.\n\nHe declared the final Central Committee gathering of the year officially open, saying, I thank you all for the unity and successes we realised throughout the year. To ordinary citizens battling poverty, collapsing services, and rising costs of living, such claims may ring hollow.\n\nMnangagwas speech ultimately underscored a widening gulf between the ruling elites self-perception and the lived experience of Zimbabweans  a gap critics warn cannot be bridged by slogans, unity calls or political mobilisation alone.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – President Emmerson Mnangagwa’s latest address to the ZANU-PF Central Committee, delivered at the party’s headquarters on Thursday, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/mnangagwa-glorifies-zanu-pf-remains-mum-on-nations-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Glorifies Zanu PF, Remains Mum On Nation’s Crisis\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "Mnangagwa Targets Zimbabweans In Diaspora For Recruitment and Investment",
            "url": "https://www.zimeye.net/2025/12/05/mnangagwa-targets-zimbabweans-in-diaspora-for-recruitment-and-investment/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwa has called on Zimbabweans and ZANU-PF party structures to actively engage with citizens living abroad during the festive season, urging them to use the holidays to promote government policies, programmes, and investment opportunities. Speaking at the ZANU-PF Central Committee meeting in Harare on Thursday, Mnangagwa emphasized the importance of connecting with the diaspora as part of national development efforts.\n\nDuring the festive season many of our people from the Diaspora will be home, Mnangagwa said. I call upon the Party structures, as well as our nation at large, to be hospitable and use this holiday period to share with our Diaspora the various policies, programmes and activities that we continue to undertake under the Second Republic.\n\nHe added, This is an opportunity to showcase the progress we have made and to ensure that our people in the Diaspora are informed, engaged and part of our national development agenda.\n\nThe Presidents remarks highlight a strategic effort to strengthen ties with Zimbabweans abroad, encouraging them to support and promote government programs while visiting their home country. Party members were urged to welcome returnees warmly and use the festive season as a platform to consolidate support among the diaspora.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa has called on Zimbabweans and ZANU-PF party structures to actively engage with citizens living abroad … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/mnangagwa-targets-zimbabweans-in-diaspora-for-recruitment-and-investment/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Targets Zimbabweans In Diaspora For Recruitment and Investment\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "Madzibaba Ishmael Faces 15 Years In Prison",
            "url": "https://www.zimeye.net/2025/12/05/madzibaba-ishmael-faces-15-years-in-prison/",
            "content": "By Crime and Courts Reporter-Madzibaba Ishmael is facing at least 15 years in jail, after the Apostolic Sect leader was convicted of raping and impregnating a 13-year-old girl despite spirited attempts by the victim to help him escape the jaws of justice.\n\nHarare regional magistrate Estere Chivasa Thursday, found Madzibaba Ishmael gulty in the latest chapter to the drama which started with a police raid at his farm in Nyabira on March 13 last year.\n\nAll the three complainants said they had no links, whatsoever, with Madzibaba Ishmael but DNA helped the State to secure conviction.\n\nThe DNA tests were conducted by the National University of Science and Technology (NUST) and conclusively proved that Madzibaba Ishmael fathered the three children born to the complainants.\n\nDespite the scientific evidence, Madzibaba Ishmael argued that the DNA results were tainted and inadmissible.\n\nHe also denied all allegations of rape, claiming the complainants had not voluntarily reported the incidents to the police.\n\nThe prosecution argued that Madzibaba Ishmael abused his position as a trusted religious leader to exploit and rape young congregants under the guise of religious authority.\n\nMadzibaba Ishmael is expected back in court today for the pre-sentencing hearing.\n\nOscar Madhume prosecuted.\n\nMadzibaba Ishmael, who had been attending court coming from home, was detained in custody yesterday as he now awaits his sentencing.\n\nInitially, he was being charged with three counts of rape and was convicted on one charge after the court found that the other two complainants were not minors as had been previously claimed.\n\nHe was acquitted of the charges related to the ill-treatment of minors and breaching the Burial and Cremation Act.\n\nMagistrate Chivasa said Madzibaba Ishmaels followers were stripped of their right and ability to exercise freedom of choice through oppressive religious dogma which was as good as slavery.\n\nThe magistrate said: An accused can only be found guilty of a crime where the evidence is circumstantial if: -the circumstances from which an inference of guilt is sought to be drawn are all established, the inference of guilt is consistent with all the proved facts, and the proved facts are such that they exclude every reasonable inference from them except that accused is guilty.\n\nThe circumstances taken cumulatively form a chain so complete that the conclusion is inescapable that within all human probability the crime was committed by the accused.\n\nNo direct evidence is necessary for their probative value, save that things do happen that way without reason or explanation and the circumstantial evidence is incapable of explanation by any other hypothesis than that of guilt of the accused.\n\nSuch evidence should not only be consistent with the guilt of the accused but also inconsistent with his or her innocence, she said.\n\nMagistrate Chivasa said while the complainants denied any links with Madzibaba Ishmael, there was DNA evidence proving otherwise.\n\nThe three complainants all denied any link with the accused person, and even wondered why he was arrested and why they were called to come to court to testify.\n\nThey all said they are not aware of his position at church since there are a lot of congregants at church.\n\nThey all denied ever having sexual intercourse with the accused but on the other hand, however, there is scientific proof (DNA paternity test results providing proof beyond reasonable doubt that the accused engaged in sexual intercourse with them and bore children.\n\nThe complainants clearly were regular congregants at accuseds shrine in which he was the founder and leader so there is no way they could not have known him after all it has been proved beyond reasonable doubt that the accused had sexual intercourse with them.\n\nThe magistrate added: It has to be noted that the complainants were still very young particularly (name withheld) who was aged 13 to 14 years when the offence is alleged to have taken place.\n\nIn such an oppressive environment, in which the followers are stripped off their right and ability to exercise freedom of choice through the proven oppressive religious dogma which is as good as slavery, the only reasonable inference conclusion is that the sexual intercourse was not consensual.\n\nOne of the key witnesses painted a harrowing picture of the oppressive religious structure where congregants where held as hostages.\n\nThe magistrate noted that the complainants, who came from different backgrounds, gave consistent evidence which was proven untrue by DNA results.\n\nDuring the trial, the victims exhibited visible fear, freezing whenever questioned about the churchs doctrines.\n\nThis suggested they were still under the influence of indoctrination, with their main focus being to protect the accused. H Metro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Madzibaba Ishmael is facing at least 15 years in jail, after the Apostolic Sect leader was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/madzibaba-ishmael-faces-15-years-in-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Madzibaba Ishmael Faces 15 Years In Prison\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "Mnangagwa Regime Fails To Pay Basic Education Assistance Arrears",
            "url": "https://www.zimeye.net/2025/12/05/mnangagwa-regime-fails-to-pay-basic-education-assistance-arrears/",
            "content": "Tinashe Sambiri Schools across Zimbabwe are owed US$98 million in Basic Education Assistance Module (BEAM) funds, a government programme that covers school fees for vulnerable children, including orphans, child-headed households, and children from low-income families. The arrears, revealed during the presentation of the 2026 National Budget last Thursday by Finance Minister Mthuli Ncube, have left many schools struggling to provide quality education.\n\nA source within the Ministry of Primary and Secondary Education confirmed the severity of the issue, stating, The government owes schools nearly US$98 million in BEAM funds. This delay is severely affecting our ability to ensure that all eligible children can access basic education. Schools are struggling to pay fees, buy learning materials, and support vulnerable students.\n\nThe source added that the BEAM programme, while funded through Treasury allocations, requires coordination with the Ministry to ensure timely disbursements. We are aware of the impact on students and schools, and the Ministry is actively engaging with Treasury and other relevant departments to resolve the backlog, they said.\n\nBEAM is crucial for ensuring that children from disadvantaged backgrounds are able to attend school. However, the accumulation of unpaid arrears has left many institutions unable to meet basic operational costs, threatening access to education for some of the countrys most vulnerable learners.\n\nThe Ministry is working to expedite the release of funds, but bureaucracy and inter-ministerial coordination issues have caused significant delays, the official added. We are pushing for urgent solutions to prevent further disruption to the education of our children.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Schools across Zimbabwe are owed US$98 million in Basic Education Assistance Module (BEAM) funds, a government programme that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/mnangagwa-regime-fails-to-pay-basic-education-assistance-arrears/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Fails To Pay Basic Education Assistance Arrears\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        },
        {
            "title": "Mliswa Tells VP Chiwenga: Cycle of Events in Army Should Act As A Warning That What You Thought Lay Under Your Feet Doesn’t Exist",
            "url": "https://www.zimeye.net/2025/12/05/mliswa-tells-vp-chiwenga-cycle-of-events-in-army-should-act-as-a-warning-that-what-you-thought-lay-under-your-feet-doesnt-exist/",
            "content": "the cycle of events in the Army should act as a warning to the Producers of his political journey that whatever military might they thought lay under his feet doesnt exist\n\nFormer Norton MP Temba Mliswa writes saying Vice President Constantino Chiwengas military wings have been clipped. He says this in response to a speech by the retired general criticising corruption. Chiwenga criticises the so called zvigananda saying if you now have a lot of money, then go ahead and build factories [instead of bragging about it!].\n\nTo this, Mliswa accuses the VP of the same corruption saying in full:\n\nIf anything this is the kind of rhetorical posturing that I'm against in VP Chiwenga's politics. His propensity to advance his political progress by seeking to undermine everyone else, blinding the gullible by portraying himself as the betrayed holy victim and painting everyonepic.twitter.com/QBVbAiXLh3\n\nIf anything this is the kind of rhetorical posturing that Im against in VP Chiwengas politics. His propensity to advance his political progress by seeking to undermine everyone else, blinding the gullible by portraying himself as the betrayed holy victim and painting everyone else as a Judas.\n\nIf anything this whole ensemble is an accomplished clan of Iscariots with no Jesus to sell!\n\nThat is why I have pointed out cases like the funding of his wedding by Chivayo; support for his foreign treatment by Tagwirei and the vast DRC financial tranches meant for soldiers that never reached them!\n\nYet today he peddles a version of himself that is unrelated to all these Zvigananda yet they are as interlinked as his umbilical connection to the Chinese flourishing and recklessly operating all over the country.\n\nWhile the Nigerians have been creating space for locals like Dangote, Adenuga to flourish here we have a VP underwriting and protecting a community of the Chinese feasting on natural resources while acting as a hitman against competing locals.\n\nWhy isnt he equally raising the issue of the Chinese who are no longer a negligible economic factor but a corrosive acid that is quickly decimating ancient hills, ravaging rivers and abusing locals! We cant have a leader who focuses on undermining and attacking his own people while protecting foreigners!\n\nChina is dumping its excess of labour here while leaders like him ignore that because they are eating from there. Why does Manhize Steel Plant have hundreds of Chinese Engineers as if our of Universities are not producing such? Then you accuse locals of not opening factories to create employment when your favourites are blocking the same!\n\nMy grandfather was married kuna amaNcube thats why I call you Sekuru and I will state the truth to you any day Soko unlike those misleading you like Machakaire and Chinomona. Those are flip floppers without an iota of political gravitas. They are useful only to the extent of EDs indulgence.\n\nThat some individuals are giddy with excitement viewing him as the panacea speaks to rampant mob psychology and abundant lack of critical thinking. If ever fate turned sideways I wouldnt be surprised if under him the country would be assailed, not by a pack of local Zvigananda, but an avalanche of Chinese Zvigananda externalising billions!\n\nThat his faction ran to smear me with false accusations of being paid was the clearest sign of their fear for truth revealing who he really is.All the same, truth isnt castrated of potency whether spoken by one paid or not.\n\nIn fact, time acts as a curtain moving slowly to reveal what lies behind. Its high time Soko appreciated his position acted accordingly and discarded his penchant for gulping misguided advise where he is told that his military past bestows on him a right to power or political virility to intimidate everyone. Tese tine zuva rekufa so there is nothing to fear and even without bodyguards takatosimbawo.\n\nNone of us whose houses have been burnt or those he continues to besmirch without evidence has reciprocated by going after his own dark side. He already has a soiled enough record to arm any rival.\n\nNo one has gone after his shady and huge portfolio of properties at a time he had no financial capacity for such or interrogated his repeated intimidation of the judiciary in the saddening case against his physically ravaged former wife; never mind the acts against the children who cant see their mother!\n\nAlready the cycle of events in the Army should act as a warning to the Producers of his political journey that whatever military might they thought lay under his feet doesnt exist.\n\nProtocol is a dangerous illusion if it is mistaken for reality!.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "“…the cycle of events in the Army should act as a warning to the Producers of his political journey that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/05/mliswa-tells-vp-chiwenga-cycle-of-events-in-army-should-act-as-a-warning-that-what-you-thought-lay-under-your-feet-doesnt-exist/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Tells VP Chiwenga: Cycle of Events in Army Should Act As A Warning That What You Thought Lay Under Your Feet Doesn’t Exist\"</span></a></p>",
            "time": "06:40",
            "date": "06 Dec 2025"
        }
    ]
}