{
    "news": [
        {
            "title": "Tyson Blasts Dambudzo",
            "url": "https://www.zimeye.net/2025/01/14/tyson-blasts-dambudzo/",
            "content": "By A Correspondent\n\nFormer Zanu PF national political commissar and Generation 40 leader, Saviour Kasukuwere, has vowed to return to Zimbabwe and directly challenge President Emmerson Mnangagwa over his bid to extend his presidency beyond the constitutional limit, which ends in 2028.\n\nKasukuwere is urging Mnangagwa to call for a referendum on the matter. Let him call for a referendum on this rubbish. We will land in Harare and defeat this satanic arrangement. We have enough forces to defeat this nonsense, Kasukuwere said, expressing his readiness to confront the president head-on.\n\nKasukuwere further condemned Mnangagwas actions, describing them as desperate acts of criminals who think they can hoodwink the masses of our people. He emphasized that such moves would be met with resistance and vowed to fight against any unconstitutional attempt to extend Mnangagwas rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Zanu PF national political commissar and Generation 40 leader, Saviour Kasukuwere, has vowed to return to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/tyson-blasts-dambudzo/\">Continue reading<span class=\"screen-reader-text\"> \"Tyson Blasts Dambudzo\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Money Blown On Wicknell’s Shoes And Cars Could Buy 8 Of The US’s Best Firefighting Helicopters",
            "url": "https://www.zimeye.net/2025/01/14/money-blown-on-wicknells-shoes-and-cars-could-buy-8-of-the-uss-best-firefighting-helicopters/",
            "content": "As Zimbabwe grapples with mounting economic challenges, a staggering $195 million spent on luxury, mismanagement, and failed projects paints a stark picture of squandered opportunity. This figure, linked to controversial businessman Wicknell Chivayo and other ventures, has drawn sharp contrasts with how the same amount could have transformed the country.\n\nWhile $10 million in England funded the construction of the intricate six-lane Spaghetti Junction, Zimbabwes $195 million was spent on questionable projects, including $10 million on luxury cars and shoes, $5 million on a failed Gwanda solar project, and $100 million attributed to unproductive contracts. Such expenditures highlight the glaring difference in priorities, sparking public outrage over missed opportunities to invest in critical infrastructure, including firefighting helicopters, renewable energy, or urban developmentThe same $195 million could also be used to purchase firefighting choppers like those being used in the LA fires.\n\nTo determine how many of the worlds best firefighting helicopters Zimbabwe could have purchased with $195 million, lets consider two top-tier firefighting helicopters:\n\n1. Sikorsky S-70 Firehawk\n\nPrice per unit: Approximately $22 million\n\nNumber of Firehawks that could be purchased:\n\n\\text{Number of helicopters} = \\frac{\\text{Total budget}}{\\text{Price per unit}} = \\frac{195,000,000}{22,000,000} \\approx 8.86\n\nZimbabwe could afford 8 Firehawks (with some remaining budget for customization or training).\n\n2. Kaman K-Max Titan\n\nPrice per unit: Approximately $7 million\n\nNumber of K-Max Titans that could be purchased:\n\n\\text{Number of helicopters} = \\frac{\\text{Total budget}}{\\text{Price per unit}} = \\frac{195,000,000}{7,000,000} \\approx 27.86\n\nZimbabwe could afford 27 K-Max Titans (potentially building a large aerial firefighting fleet).\n\nConclusion:\n\nWith $195 million, Zimbabwe could purchase:\n\n8 Sikorsky S-70 Firehawks, some of the most advanced firefighting helicopters in the world, or\n\n27 Kaman K-Max Titans, excellent heavy-lift and firefighting helicopters.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "As Zimbabwe grapples with mounting economic challenges, a staggering $195 million spent on luxury, mismanagement, and failed projects paints a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/money-blown-on-wicknells-shoes-and-cars-could-buy-8-of-the-uss-best-firefighting-helicopters/\">Continue reading<span class=\"screen-reader-text\"> \"Money Blown On Wicknell’s Shoes And Cars Could Buy 8 Of The US’s Best Firefighting Helicopters\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Mnangagwa’s Unity Call, A Genuine Move  Or Political Gimmick ?",
            "url": "https://www.zimeye.net/2025/01/14/mnangagwas-unity-call-a-genuine-move-or-political-gimmick/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa, leader of Zanu PF, has called for national unity, emphasizing the importance of bridging political divides despite his contested victories in the 2018 and 2023 elections.\n\nMnangagwa made the remarks during a Sunday gathering at his Precabe Farm, where he hosted parliamentarians from both Zanu PF and opposition parties. Speaking from his family farm, he positioned himself as a unifier and emphasized the need for collaboration among Zimbabwes political factions.\n\nWe shared our passion for farming. With our humble agricultural backgrounds, we have embraced innovation, resulting in high production and mechanisation on our family farm, Mnangagwa said.\n\nHe then pivoted to a broader political message.\n\nI emphasised the importance of unity across the political divide and highlighted how a vibrant opposition strengthens democracy and national development, he added. Mnangagwa also stressed that Zimbabwe must focus on food self-sufficiency by adopting modern agricultural practices to combat climate challenges.\n\nI also noted that Zimbabwe must prioritise food self-sufficiency by adopting strategies such as water harvesting, mechanisation, and modern farming technologies to address the challenges of climate change, Mnangagwa stated. He concluded by urging all leaders to rise above political differences and work together for the nations progress.\n\nDespite claims of electoral manipulation and irregularities, with the Zimbabwe Electoral Commission (ZEC) declaring Mnangagwa the winner in both elections, the presidents message on unity comes at a time when the nation remains divided over the legitimacy of his rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa, leader of Zanu PF, has called for national unity, emphasizing the importance of bridging … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/mnangagwas-unity-call-a-genuine-move-or-political-gimmick/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Unity Call, A Genuine Move  Or Political Gimmick ?\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Baba Jukwa On: Justice Luke Malaba’s Khupe-Yellow-Bone-Women Program",
            "url": "https://www.zimeye.net/2025/01/14/baba-jukwa-on-justice-luke-malabas-khupe-yellow-bone-women-program/",
            "content": "By Frank Ndaba |In a scathing cartoon post shared by Baba Jukwa, the infamous whistleblower has commented over what he now dubs the Malaba Program. The program allegedly involves Zimbabwes Chief Justice Luke Malaba favoring political outcomes that undermine democratic opposition leaders while bolstering select women aligned with certain agendas.\n\nThe cartoon portrays Malaba orchestrating a convoluted political game in which Thokozani Khupe, a controversial figure in Zimbabwean politics, and Fadzi, a presumed reference to another politically significant woman, are key players. This scheme is aimed at politically isolating Nelson Chamisa, a prominent opposition leader, relegating him to the role of a preacher.\n\nThe Alleged Program\n\nThe imagery depicts Chief Justice Malaba handing Petina (interpreted as a court victory) to Fadzi, while Khupe receives Precabe (suggesting a lesser reward or token). President Emmerson Mnangagwa is shown congratulating Khupe, sarcastically thanking her for dismantling Chamisas political prospects.\n\nThis expos draws attention to how factional politics and alleged judicial interference are shaping Zimbabwes political landscape. The involvement of two Khupe figures hints at the manipulation of identity politics and the systematic sidelining of opposition forces.\n\nA Gendered Political Strategy?\n\nThe caricature implies a gendered element to the alleged scheme, referring to a Yellow-Bone-Women program that seeks to elevate women compliant with the ruling partys objectives while diminishing the influence of dissenting voices like Chamisas. This reflects long-standing accusations of co-opted female leaders being used to fracture opposition movements.\n\nPublic Reaction\n\nThe cartoon has sparked heated debates online. Supporters of Chamisa view it as a vindication of their suspicions about the judiciarys bias, while critics accuse the creators of sensationalism.One thing is clear: the battle for Zimbabwes democracy continues to be fought on multiple fronts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Frank Ndaba | In a scathing cartoon post shared by Baba Jukwa, the infamous whistleblower has commented over what … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/baba-jukwa-on-justice-luke-malabas-khupe-yellow-bone-women-program/\">Continue reading<span class=\"screen-reader-text\"> \"Baba Jukwa On: Justice Luke Malaba’s Khupe-Yellow-Bone-Women Program\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Chamisa Denounces Stomach Politicians",
            "url": "https://www.zimeye.net/2025/01/14/chamisa-denounces-stomach-politicians/",
            "content": "By A Correspondent\n\nPresident Nelson Chamisa issued a scathing rebuke to politicians who prioritize personal gain over principles, labeling them as turncoats. This statement came on the heels of opposition MPs visiting President Emmerson Mnangagwas Precabe Farm. Chamisas remarks, though not directly naming anyone, left little doubt about his disapproval of those who compromise their values for material or power-related benefits.\n\nIn a poignant post, Chamisa emphasized the importance of integrity, urging politicians to remain true to themselves and their principles. BE TRUE In life; Never sell your soul to evil! Never trade your heart for anything. Never be controlled or captured. Money or power is not everything. Integrity is! he wrote, concluding with Blessed Sunday .\n\nChamisas message served as a critique of political hypocrisy, stressing that genuine leadership is rooted in unwavering principles rather than opportunism. His statement underscored the significance of integrity in politics, encouraging politicians to uphold their values and resist the allure of wealth or power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Nelson Chamisa issued a scathing rebuke to politicians who prioritize personal gain over principles, labeling them … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/chamisa-denounces-stomach-politicians/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Denounces Stomach Politicians\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Man Beaten To Death Over Sadza Dispute",
            "url": "https://www.zimeye.net/2025/01/14/man-beaten-to-death-over-sadza-dispute/",
            "content": "By A Correspondent\n\nA shocking incident has unfolded in Village Midzi, Masvingo, where a man has been arrested for allegedly killing his neighbor over a pot of sadza and chicken. Makneme Chikutuva, 41, is accused of assaulting Maxwell Manjonjo, 42, with ox yoke leather straps all over his body after accusing him of theft.\n\nThe brutal attack occurred on January 11, 2025, and the suspects actions became even more disturbing when, upon seeing the victim struggling to breathe, he callously carried him to Musingarahwi Business Centre, Masvingo, and abandoned him.\n\nThe Zimbabwe Republic Police (ZRP) have confirmed Chikutuvas arrest in connection with the murder case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking incident has unfolded in Village Midzi, Masvingo, where a man has been arrested for allegedly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/man-beaten-to-death-over-sadza-dispute/\">Continue reading<span class=\"screen-reader-text\"> \"Man Beaten To Death Over Sadza Dispute\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Pastor Impregnates Own Daughter",
            "url": "https://www.zimeye.net/2025/01/14/pastor-impregnates-own-daughter/",
            "content": "By A Correspondent\n\nA shocking and disturbing case has emerged in Alexandra, where a 49-year-old pastor, reportedly a leader at the Zion Christian Church (ZCC), has allegedly impregnated his 13-year-old daughter.\n\nAccording to sources, the family was approached for questioning, but they claimed to have resolved the matter internally, without involving the police. The fathers response to the allegations was that he was unaware of the pregnancy.\n\nIn a bizarre and alarming twist, it is alleged that the father attempted to terminate the pregnancy by giving his daughter church tea. Fortunately, the attempt was unsuccessful.\n\nThis developing story raises serious concerns about child abuse, exploitation, and the failure of the family and potentially the church to report and address the issue. As more information becomes available, this story will continue to unfold.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking and disturbing case has emerged in Alexandra, where a 49-year-old pastor, reportedly a leader at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/pastor-impregnates-own-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Pastor Impregnates Own Daughter\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Kasukuwere Vows To Challenge Mnangagwa’s Bid To Extend Presidency",
            "url": "https://www.zimeye.net/2025/01/14/kasukuwere-vows-to-challenge-mnangagwas-bid-to-extend-presidency/",
            "content": "By A Correspondent\n\nFormer Zanu PF national political commissar and Generation 40 leader, Saviour Kasukuwere, has vowed to return to Zimbabwe and directly challenge President Emmerson Mnangagwa over his bid to extend his presidency beyond the constitutional limit, which ends in 2028.\n\nKasukuwere is urging Mnangagwa to call for a referendum on the matter. Let him call for a referendum on this rubbish. We will land in Harare and defeat this satanic arrangement. We have enough forces to defeat this nonsense, Kasukuwere said, expressing his readiness to confront the president head-on.\n\nKasukuwere further condemned Mnangagwas actions, describing them as desperate acts of criminals who think they can hoodwink the masses of our people. He emphasized that such moves would be met with resistance and vowed to fight against any unconstitutional attempt to extend Mnangagwas rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Zanu PF national political commissar and Generation 40 leader, Saviour Kasukuwere, has vowed to return to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/14/kasukuwere-vows-to-challenge-mnangagwas-bid-to-extend-presidency/\">Continue reading<span class=\"screen-reader-text\"> \"Kasukuwere Vows To Challenge Mnangagwa’s Bid To Extend Presidency\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Chamisa Loyalists Boycott Mnangagwa Farm Meeting",
            "url": "https://www.zimeye.net/2025/01/13/chamisa-loyalists-boycott-mnangagwa-farm-meeting/",
            "content": "By James Gwati-At least 50 Members of Parliament (MPs) and 11 senators from the Citizens Coalition for Change (CCC) linked to thepartysfounding President Nelson Chamisa, boycotted a Zanu PF meeting held at President EmmersonMnangagwasPrecabe Farm in Kwekwe, Sunday.\n\nThe CCC, which hasa total of88 MPs and 27 senators, saw only 15 legislators in attendance.\n\nNotably,those present were alignedwith Sengezo Tshabangu, thepartysself-imposed and divisive former secretary-general whowas recently fired.\n\nThe Chamisa loyalists snubbed themeeting followingadvice from caretaker leader Jameson Timba to steer clear of the event.\n\nTshabangu appointed manyof theMPs who attended after he controversially recalled several legislators following the August 2023 harmonized elections.\n\nDespite the low turnout, Tshabangu downplayed the boycott, describing the event asa success.\n\nThis is the most significant event in the current context of solution-finding, nation-building, and consensus,Tshabangu said.Zimbabwe is our country. We will find a way of solving our admittedly self-evident national challenges. There is an answer; we will find a way. All we need is to be brave.\n\nAmong the MPspresentwere Matabeleland representatives Charles Moyo, Kucaca Phulu, and Thokozani Khupe.\n\nEdwin Mushoriwa, the chief whip of the CCC faction aligned with Welshman Ncube, clarified the absence of many legislators, citing a lack of formal communication from Parliament regarding the meeting.\n\nObservers view the meeting at Precabe Farm as part of a broader strategy byMnangagwasallies to secure opposition support in extending his presidency beyond the constitutionally mandated two terms.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati- At least 50 Members of Parliament (MPs) and 11 senators from the Citizens Coalition for Change (CCC) linked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/13/chamisa-loyalists-boycott-mnangagwa-farm-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Loyalists Boycott Mnangagwa Farm Meeting\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        },
        {
            "title": "Veteran ZBC Cameraman Dies",
            "url": "https://www.zimeye.net/2025/01/13/veteran-zbc-cameraman-dies/",
            "content": "By Munacho Gwamanda- Veteran Zimbabwe Broadcasting Corporation (ZBC) cameraman Solomon Chinhara, has died.\n\nChinhara died in an ambulance en route to the hospital from his plot along Plumtree Road in Matabeleland South on Monday morning, former colleagues confirmed.\n\nChinharas passing marks the end of a chapter in the history of a man who contributed to ZBCs golden era when it stood as the pride of Zimbabwe.\n\nKnown for his commitment and excellence, Chinhara was part of a team that shaped the broadcasters legacy as a trusted voice for the nation.\n\nLast October, Chinhara celebrated 51 years of marriage with his wife, Alice Chinhara Khoza.\n\nThe milestone event, held at their West Acre Farm in Plumtree, was attended by family, friends, neighbours, and members of their church.\n\nDuring its peak in the late 20th century, ZBC symbolised excellence in national broadcasting.\n\nIt was not only a source of reliable news but also a hub of talent that cultivated careers like Chinharas, whose camera work captured the nations triumphs and challenges.\n\nHowever, in recent decades, ZBC has faced significant challenges.\n\nOnce renowned for its professionalism and robust programming, the state broadcaster has struggled under political and economic pressures.\n\nAccusations of political bias, declining resources, and an exodus of talent have tarnished its reputation, leaving it a shadow of its former self.\n\nThe deterioration of ZBC mirrors the broader challenges facing Zimbabwes media landscape, where professionals like Chinhara once thrived.\n\nHis death is a poignant reminder of a time when ZBC embodied the hopes and dreams of a young nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Veteran Zimbabwe Broadcasting Corporation (ZBC) cameraman Solomon Chinhara, has died. Chinhara died in an ambulance en route … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/13/veteran-zbc-cameraman-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran ZBC Cameraman Dies\"</span></a></p>",
            "time": "06:36",
            "date": "14 Jan 2025"
        }
    ]
}