{
    "news": [
        {
            "title": "Bulawayo Woman Dies In Mnangagwa-Majonga Flat Throwing Style",
            "url": "https://www.zimeye.net/2025/02/18/bulawayo-woman-dies-in-mnangagwa-majonga-flat-throwing-style/",
            "content": "By Munacho Gwamanda-A Bulawayo woman has died after being thrown out of a window from her flat by her husband, in a tragic incident reminiscent of President Emmerson Mnangagwas infamous brutality against the late broadcaster Godfrey Majonga.\n\nThe victim, 33-year-old Siphiwe Ndlovu, was allegedly thrown from the window of their Burombo flat by her husband, 44-year-old Meluleki Ndlovu, during a domestic dispute on Saturday night.\n\nSpeaking toa local online news portal on condition of anonymity, a source from the area said they heard a heated argument from the couples flat at around 10 PM.\n\nThe dispute reportedly started when the husband confronted his wife over a phone number he had found on her device.\n\nIt was around 10 PM when the argument started. The husband was demanding answers about a number he had seen on his wifes phone, the source said.\n\nAn hour later, she fell from the window of their flat, landing on the ground below. She broke her leg and sustained other injuries. She was taken to the hospital, but sadly, she died yesterday afternoon.\n\nActing Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele confirmed the incident and thearrest of the suspect.\n\nPolice confirm the arrest of Meluleki Ndlovu, a male adult aged 44 of Burombo Flats, Bulawayo, in connection with the murder of his wife, Siphiwe Ndlovu, a female adult aged 33, said Asst Insp Msebele.\n\nAccording to police, Meluleki assaulted Siphiwe inside their locked flat.\n\nIn an attempt toescape, she stepped onto a sofa and jumped out of the window.\n\nShe sustained a fractured right leg, a swollen stomach, and was bleeding from the nose and mouth. A neighbour who witnessed the fall rushed to help, grabbed the keys, and opened the door for Meluleki. Upon seeing his injured wife, Meluleki called an ambulance, which took her to the hospital, Asst Insp Msebele said.\n\nAsst Insp Msebele urged the public to resolve disputes peacefully and avoid resorting to violence.\n\nThe tragic death of Siphiwe Ndlovu brings chilling memories of an incident in the 1980s involving President Emmerson Mnangagwa, who allegedly threw former broadcaster Godfrey Majonga out of a second-floor window in Harare.\n\nMnangagwa, a feared enforcer of the late President Robert Mugabes regime, reportedly gave Majonga a brutal ultimatum: either sit on a scorching hot electric stove or jump from the second floor of a flat in the Avenues area after catching him with his girlfriend.\n\nMajonga, fearing for his life, opted to jump from the flat, suffering permanent spinal cord injuries that left himwheelchair-boundfor the rest of his life.\n\nHe died in August 2019.\n\nDuring the height of the G40-Lacoste power struggles, former First Lady Grace Mugabe revived Mnangagwas violent past, citing the Majonga incident as an example of his ruthlessness.\n\nThe revelation further deepened the factional wars within Zanu PF before Mnangagwa orchestrated the 2017 coup that ousted Mugabe.\n\nWhile Mnangagwa has never publicly responded to the allegations, the Majonga case remains one of the darkest stains on his legacyone that many Zimbabweans have not forgotten.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-A Bulawayo woman has died after being thrown out of a window from her flat by her husband, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/bulawayo-woman-dies-in-mnangagwa-majonga-flat-throwing-style/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Woman Dies In Mnangagwa-Majonga Flat Throwing Style\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Mighty Warriors Get Training Allowances Ahead Of Crucial Fixtures",
            "url": "https://www.zimeye.net/2025/02/18/mighty-warriors-get-training-allowances-ahead-of-crucial-fixtures/",
            "content": "Sports Correspondent\n\nThe Zimbabwe national womens football team, the Mighty Warriors, have been given a significant morale boost ahead of their upcoming Womens Africa Cup of Nations (AWCON) qualifiers double-leg clash against Angola, starting this Thursday.\n\nWith hopes of securing a spot on the continental stage, the Mighty Warriors will head to Angola with newfound confidence following assurances from the government, the Sports and Recreation Commission (SRC), and the Zimbabwe Football Association (ZIFA).\n\nDuring a send-off ceremony held at the ZESA National Training Centre in Harare this Sunday, the Minister of Sports, Art, and Recreation, Honorable Kirsty Coventry, expressed the governments commitment to the development and success of womens football.\n\nWe know that we have some work to do when it comes to our facilities, and were working hard to ensure they are up to scratch. Ive already had conversations with the President about what that will look like in the future to make sure we can play football on home turf, Minister Coventry said.\n\nShe added, Thats important, not just for all of you, but for the people of our country, the citizens who support all of you on these journeys. Its vitally important for us as a Ministry, and for His Excellency, the President, so be assured that we are working tirelessly to make this happen.\n\nMeanwhile, ZIFA president Nqobile Magwizi challenged the team to demonstrate their strength against their regional rivals, urging them to perform at their best.\n\nThe Mighty Warriors, who for the first time received training allowances during their camp, expressed heartfelt gratitude for the support they have received.\n\nI am running out of words, and I am really grateful for the support we are getting, said Mighty Warriors vice-captain Nobukhosi Ncube. Im sure all of you are behind us, and we feel so special when we see that we have such strong backing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe national women’s football team, the Mighty Warriors, have been given a significant morale boost ahead of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/mighty-warriors-get-training-allowances-ahead-of-crucial-fixtures/\">Continue reading<span class=\"screen-reader-text\"> \"Mighty Warriors Get Training Allowances Ahead Of Crucial Fixtures\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Tragic Drowning Incident in Chikomba",
            "url": "https://www.zimeye.net/2025/02/18/tragic-drowning-incident-in-chikomba/",
            "content": "Chikomba, Mashonaland East  In a heart-wrenching incident, the bodies of two five-year-old boys, Tanaka Mombeyarara and Tafadzwa Makamure, were discovered standing on the river bed of the Dora River, bleeding from the nose, after they drowned in a pool near Mombeyarara Village, Chief Chivese.\n\nThe Mashonaland East Provincial Police spokesperson, Simon Chazovachiyi, confirmed the tragic event, cautioning the public against playing near water bodies. We are running awareness campaigns to educate people about the dangers of playing near water bodies. Parents should closely monitor their children and explain the risks associated with playing near water. Water is safe only for drinking, Chazovachiyi stated.\n\nThe incident unfolded when the boys, who were playing at Tafadzwas parents homestead, managed to slip away unnoticed while Tafadzwas mother, Junior Mhukayesango, was busy with chores. Upon realizing the boys were missing, Mhukayesango searched the vicinity and found their clothes on the riverbank, leading to the grim discovery after the water was drained from the pool.\n\nThe community is grappling with the tragedy, with some villagers suggesting that dark spirits might inhabit the water, adding a layer of folklore to the sorrowful event.\n\nAs investigations continue, this incident serves as a stark reminder of the need for vigilance around natural water bodies, especially in rural settings where childrens play often extends to these areas.\n\nAuthorities are urging all guardians to heighten their supervision of children near any water source to prevent such accidents from recurring.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chikomba, Mashonaland East – In a heart-wrenching incident, the bodies of two five-year-old boys, Tanaka Mombeyarara and Tafadzwa Makamure, were … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/tragic-drowning-incident-in-chikomba/\">Continue reading<span class=\"screen-reader-text\"> \"Tragic Drowning Incident in Chikomba\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Harare Court Sentences One in Gruesome Rape Case, Accomplices Acquitted",
            "url": "https://www.zimeye.net/2025/02/18/harare-court-sentences-one-in-gruesome-rape-case-accomplices-acquitted/",
            "content": "Harare, Zimbabwe  In a harrowing case that recently unfolded before the Harare Magistrates Court, a 14-year-old Form 2 pupil from Harare was subjected to a brutal assault by four men. The incident occurred on the evening of October 20th, 2024, when the victim left her home after an argument with her mother.\n\nAccording to court documents, the young girl was lured into the home of the first accused, a 30-year-old man, under the pretense of being offered accommodation for the night. Upon arrival, she encountered three other men, aged 34, 36, and 30. The group then proceeded to threaten her with a knife, beat her with a hose pipe, and spike her drink with an unknown substance, rendering her unconscious.\n\nIn her incapacitated state, the four men took turns sexually assaulting her. The victim awoke the next morning in severe pain, with visible evidence of the assault on her body. She confided in her aunt, who promptly reported the incident to the police. A medical examination confirmed the assault.\n\nThe first accused was found guilty of rape and sentenced to 15 years imprisonment. However, in a surprising turn of events, his three accomplices were acquitted at the close of the state case. The National Prosecuting Authority of Zimbabwe (NPAZ) is currently contemplating an appeal regarding the acquittal of the three accomplices.\n\nThis case has sparked outrage and concern over the safety of young individuals in the community, highlighting the need for stronger protective measures and justice for victims of such heinous crimes. The community awaits further developments as the NPAZ decides on the next steps in this disturbing case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, Zimbabwe – In a harrowing case that recently unfolded before the Harare Magistrates’ Court, a 14-year-old Form 2 pupil … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/harare-court-sentences-one-in-gruesome-rape-case-accomplices-acquitted/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Court Sentences One in Gruesome Rape Case, Accomplices Acquitted\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Chevrons Fall",
            "url": "https://www.zimeye.net/2025/02/18/chevrons-fall-3/",
            "content": "Ireland defeated Zimbabwes Chevrons by six wickets in the second One Day International at Harare Sports Club on Sunday, leveling the series at 1-1.\n\nThe visitors chased down Zimbabwes total of 245 runs, thanks to strong performances from Paul Stirling and Curtis Campher.\n\nAfter winning the toss, Ireland chose to bowl first, and their decision proved fruitful as they restricted Zimbabwe to 245 all out in 49 overs. Wessly Madhevere was the top scorer for Zimbabwe with 61 runs, while Sikandar Raza contributed a solid 58.\n\nIn response, Irelands batting lineup showed their strength, with Stirling and Campher forming a dominant partnership. They put together 144 runs for the second wicket, with Campher scoring 63 and providing the necessary momentum for Irelands chase.\n\nTrevor Gwandu broke the partnership by dismissing Campher, but Ireland remained steady, and Stirlings unbeaten 62 guided them to a comfortable victory.\n\nThe series is now tied at 1-1, with the deciding match scheduled for Tuesday.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Ireland defeated Zimbabwe’s Chevrons by six wickets in the second One Day International at Harare Sports Club on Sunday, leveling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/chevrons-fall-3/\">Continue reading<span class=\"screen-reader-text\"> \"Chevrons Fall\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "ED Declares Self “So Democratic” While Pushing for Constitutional Violation to Stay",
            "url": "https://www.zimeye.net/2025/02/18/ed-declares-self-so-democratic-while-pushing-for-constitutional-violation-to-stay/",
            "content": "By Farai D Hove | ZimEye | At a time when Zimbabwes President Emmerson Mnangagwa has been caught on camera instructing his supporters to push for the suspension of the constitution so he can extend his rule indefinitely, he has ironically declared himself to be so democratic.\n\nDuring a recent meeting with a select group of editors, Mnangagwa attempted to reaffirm his commitment to constitutionalism and term limits, even as growing evidence suggests he is laying the groundwork to remain in power beyond his legally mandated two terms.\n\nIm So Democratic, Says Mnangagwa Amid Moves to Undermine Democracy\n\nIn response to a journalists question about whether he would respect the constitutional limit on his presidency, Mnangagwa stated:\n\nI thought you are putting me very clear that I have two terms, and these terms are very definite, and Im so democratic. When they come to an end, Ill step aside, and my party will let my successor that is as clear as day. Those who have other imaginations, its a democratic society for people to dream.\n\nThis statement came as a contradiction to his recent remarks captured on video, where he was heard instructing people to demand the suspension of parliamenta move that would effectively keep him in office beyond his current term.\n\nMnangagwas Contradictions: Public Promises vs. Private Plans\n\nWhile Mnangagwa told the editors that he was not entertaining calls to extend his rule to 2030, his actions tell a different story. At the Zanu-PF Annual Peoples Conference in Bulawayo last year, a resolution was passed advocating for his term extension, citing his governments infrastructure and economic projects. Despite publicly maintaining that he will step down when his time is up, Mnangagwa has simultaneously been allowing and even encouraging efforts to keep him in power.\n\nHe downplayed these efforts as part of democratic discourse, stating:\n\nIts not imaginable that there is anybody in the country who can push me. I feel very uncomfortable. I am very solid. I have always said I am a constitutionalist. I have my two terms, and when they come to an end, the country and the party will move on by electing my successor.\n\nHowever, the recently surfaced footage suggests otherwise. Instead of rejecting the unconstitutional push outright, he has been subtly guiding his supporters on how to engineer a legal loophole that would allow him to remain in office indefinitely.\n\nA Democratic Leader Who Wants to Suspend Parliament\n\nThe stark contradiction between Mnangagwas words and actions raises serious concerns about the future of democracy in Zimbabwe. While he publicly portrays himself as a champion of constitutionalism, his behind-the-scenes maneuvers suggest he is laying the groundwork to extend his presidency through unconstitutional means.\n\nHis claim that facts will carry the day appears increasingly hollow in the face of mounting evidence that he is actively engaging in efforts to override those very facts. By instructing his supporters to call for a constitutional suspension, Mnangagwa is effectively undermining the very democracy he claims to uphold.\n\nPersuading the Persuaders While Enabling Them\n\nWhen asked how he would ensure he remains committed to his stated position of stepping down, Mnangagwa said:\n\nI will persuade the persuaders not to persuade me so that I remain constitutional.\n\nYet, his actions indicate he is not only tolerating these so-called persuaders but is actively directing them on how to achieve their goal of keeping him in power.\n\nConclusion: A Democracy in Peril\n\nMnangagwas latest remarks stand in sharp contrast to the reality on the ground. While he insists he will respect the constitution, his behind-the-scenes efforts suggest he is determined to remain in power by any means necessary. His claim of being so democratic rings hollow in the face of overwhelming evidence that he is actively undermining Zimbabwes democracy.\n\nAs calls for constitutional violations grow louderwith his tacit approvalthe question remains: Will Zimbabwes institutions withstand this pressure, or is the country heading toward yet another era of entrenched authoritarian rule?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | At a time when Zimbabwe’s President Emmerson Mnangagwa has been caught on camera … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/ed-declares-self-so-democratic-while-pushing-for-constitutional-violation-to-stay/\">Continue reading<span class=\"screen-reader-text\"> \"ED Declares Self “So Democratic” While Pushing for Constitutional Violation to Stay\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Migrant Deported for Assaulting Mum In Law",
            "url": "https://www.zimeye.net/2025/02/18/migrant-deported-for-assaulting-mum-in-law/",
            "content": "Bulawayo, Zimbabwe  A 34-year-old illegal immigrant from Equatorial Guinea, Angue Benjamin Nchama, has been sentenced to pay a fine of US$100 and will be deported after violating Zimbabwes Immigration Act. The ruling was delivered by Bulawayo magistrate Mr. Ernest Muzembe, who also imposed a four-month suspended prison sentence.\n\nNchama, who has been residing in Zimbabwe since 2014, was found guilty of remaining in the country without a valid permit. According to court records, his student permit expired on January 17, 2025, after several extensions. However, he failed to renew it and continued to stay in the country illegally.\n\nLegal Ruling and Security Concerns\n\nDuring sentencing, Magistrate Muzembe emphasized that Nchamas case was a strict liability offence, meaning his intention did not need to be provenhis mere presence in the country without documentation was sufficient for conviction.\n\nFurther, the court acknowledged concerns raised by Chief Immigration Officer, Mr. Godfrey Kondo, who stated that Nchamas continued presence in Zimbabwe posed a national security threat.\n\nViolence Allegations and Protection Order\n\nThe case took a dramatic turn after it was revealed that Nchama was also involved in a domestic dispute. His girlfriends mother, Ms. Gertrude Makwamba, filed for a protection order against him, citing violent behavior.\n\nAccording to State Prosecutor Mr. Mehluli Ndlovu, Nchama allegedly assaulted Ms. Makwamba over accusations that she failed to properly groom her daughter. He reportedly went as far as accusing her of hiring men to sleep with her daughter. The matter came to light after Ms. Makwamba approached the Harare Civil Court, leading to the exposure of his illegal immigration status.\n\nDeportation Orders\n\nFollowing the court ruling, immigration authorities will now process Nchamas deportation back to Equatorial Guinea. His four-month suspended sentence will remain active should he re-enter Zimbabwe unlawfully in the future.\n\nAuthorities have reiterated the importance of maintaining strict immigration laws to safeguard national security and uphold the countrys legal framework.\n\nThis case highlights the consequences of immigration violations and underscores the need for strict enforcement of immigration policies across the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo, Zimbabwe – A 34-year-old illegal immigrant from Equatorial Guinea, Angue Benjamin Nchama, has been sentenced to pay a fine … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/migrant-deported-for-assaulting-mum-in-law/\">Continue reading<span class=\"screen-reader-text\"> \"Migrant Deported for Assaulting Mum In Law\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Zanu PF Hardliners Push For Removal Of New Bikita RDC CEO",
            "url": "https://www.zimeye.net/2025/02/18/zanu-pf-hardliners-push-for-removal-of-new-bikita-rdc-ceo/",
            "content": "By A Correspondent\n\nThe ruling Zanu PF party has vowed to remove the newly appointed Chief Executive Officer (CEO) of Bikita Rural District Council (RDC), Archibald Ncube, despite the fact that he just assumed his duties last week.\n\nAccording to sources within the party, hardliners within Zanu PF are determined to oust Ncube from his position.\n\nThe move has sparked tension within the party, with influential members working behind the scenes to ensure his removal.\n\nA Zanu PF source revealed over the weekend that Senator Anna Rungani, party hardliner Thomas Mataga and senior ruling party officials areleading the efforts to unseat Ncube.\n\nSenator Rungani and Boss Thomas Mataga are spearheading efforts to remove Ncube from office. They want to replace him with a declared party sympathiser.\n\nNcube is going, they are not looking back, wait and see. They are using their political muscles to remove the new CEO from office, the source said.\n\nThe push to remove Ncube has stirred unrest within the local political landscape, with concerns that political maneuvering and influence are overriding due process and merit-based appointments.\n\nThis development raises questions about the political dynamics at play in Bikita, as the ruling party continues to assert its power and influence within the district.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ruling Zanu PF party has vowed to remove the newly appointed Chief Executive Officer (CEO) of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/zanu-pf-hardliners-push-for-removal-of-new-bikita-rdc-ceo/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hardliners Push For Removal Of New Bikita RDC CEO\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Mnangagwa Speaks On 2030 Agenda",
            "url": "https://www.zimeye.net/2025/02/18/mnangagwa-speaks-on-2030-agenda/",
            "content": "By A Correspondent\n\nUnder mounting pressure from citizens and critics, Zanu PF leader, Emmerson Mnangagwa, has firmly stated that he will adhere to the Constitution and will not seek to extend his term in office.\n\nMnangagwa made these remarks during an interactive session with editors from various media outlets at State House in Harare this Monday.\n\nThe presidents stance comes amid criticism, including from outspoken war veteran Blessed Geza, who questioned Mnangagwas attempts to extend his presidency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Under mounting pressure from citizens and critics, Zanu PF leader, Emmerson Mnangagwa, has firmly stated that he … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/mnangagwa-speaks-on-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Speaks On 2030 Agenda\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        },
        {
            "title": "Bill Antonio Records First Assist of the Season in KV Mechelen’s Victory",
            "url": "https://www.zimeye.net/2025/02/18/bill-antonio-records-first-assist-of-the-season-in-kv-mechelens-victory-2/",
            "content": "Sports Correspondent\n\nBill Antonio has provided his first assist of the season for KV Mechelen during their 1-0 win against Royale Union Saint-Gilloise in the Belgian Pro League.\n\nThe 22-year-old Warriors international started the match as a winger, playing for 64 minutes. Antonio contributed significantly to the win, also creating two scoring chances, including a stunning volley in the tenth minute that was brilliantly saved by the goalkeeper.\n\nSince returning from a long-term knee injury last month, Antonio has now made five appearances for KV Mechelen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Bill Antonio has provided his first assist of the season for KV Mechelen during their 1-0 win against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/18/bill-antonio-records-first-assist-of-the-season-in-kv-mechelens-victory-2/\">Continue reading<span class=\"screen-reader-text\"> \"Bill Antonio Records First Assist of the Season in KV Mechelen’s Victory\"</span></a></p>",
            "time": "18:42",
            "date": "18 Feb 2025"
        }
    ]
}