{
    "news": [
        {
            "title": "VP Chiwenga, ED Power Struggles Escalate",
            "url": "https://www.zimeye.net/2025/10/07/vp-chiwenga-ed-power-struggles-escalate/",
            "content": "By A Correspondent Power struggles within ZANU PF appear to be intensifying amid renewed reports of a widening rift between President Emmerson Mnangagwa and his deputy, Vice President Constantino Chiwenga, over the partys succession plans.\n\nZANU PF Information and Publicity Director Farai Marapira on Monday sought to downplay the growing speculation, dismissing as false and mischievous claims that the two leaders are locked in a bitter fight over who should lead the ruling party beyond 2028.\n\nReports suggest a faction aligned with Chiwenga  the former Zimbabwe Defence Forces commander who spearheaded the 2017 military intervention that ushered Mnangagwa into power  is resisting the presidents alleged plans to extend his second term from 2028 to 2030. The proposed extension is widely seen as part of Mnangagwas strategy to delay or derail Chiwengas long-expected presidential ambitions.\n\nAdding to the tension, insiders allege that Mnangagwa is quietly grooming his trusted ally and business magnate Kudakwashe Tagwirei, a fellow Karanga clansman, as his preferred successor. The move is said to have unsettled both Chiwenga and the other vice president, Kembo Mohadi, who view it as an attempt to centralize power within Mnangagwas faction.\n\nHowever, Marapira dismissed the reports, insisting the top leadership remains united.\n\nThe relationship between the President and his two Vice Presidents is one of brotherhood, said Marapira. These are men who fought side by side for Zimbabwes liberation. They faced death together and continue to serve the country with mutual respect and loyalty.\n\nAll this talk of animosity and infighting is the work of detractors trying to sow alarm and despondency within our ranks. As a party, we remain solidly united behind President Mnangagwa.\n\nDespite official denials, the MnangagwaChiwenga rivalry has long been an open secret in Zimbabwes political circles. Their uneasy alliance, forged during the November 2017 coup that ousted the late Robert Mugabe, began fracturing soon after Mnangagwa assumed office.\n\nChiwenga, who led the military campaign that brought Mnangagwa to power, is said to have viewed the arrangement as a transitional pact that would eventually see him take the reins. But Mnangagwa has spent the past seven years consolidating control  appointing loyalists to key state and party positions, while systematically sidelining Chiwengas military allies.\n\nThe presidents reported bid for a third term has become the latest flashpoint in their cold war. Chiwengas camp, comprising influential war veterans and sections of the military, is believed to be quietly resisting the move, arguing that Mnangagwas leadership has failed to deliver on economic promises and risks plunging the country deeper into crisis.\n\nThe factional rivalry has also played out subtly in public  through competing rallies, divergent media narratives, and growing tension between the partys civilian and military wings.\n\nAs ZANU PF prepares for its next elective congress, analysts warn that the unresolved succession dispute could destabilize the party and reshape Zimbabwes political landscape. Mnangagwas determination to extend his rule and Chiwengas persistence in positioning himself as heir apparent are seen as the biggest tests of the post-Mugabe era.\n\nStill, Marapira maintains that all is well within the ruling party.\n\nZANU PF remains unshaken, disciplined, and united under the visionary leadership of President Mnangagwa, he said, dismissing the reports as wishful thinking by the opposition and Western media.\n\nPolitical observers, however, believe the calm projected by the party masks a fierce behind-the-scenes power contest  one that could erupt into open confrontation as the 2028 election draws closer.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Power struggles within ZANU PF appear to be intensifying amid renewed reports of a widening rift between … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/vp-chiwenga-ed-power-struggles-escalate/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga, ED Power Struggles Escalate\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Cabinet Endorses Chipinge South Legislator’s Call for Community Share Ownership Law",
            "url": "https://www.zimeye.net/2025/10/07/cabinet-endorses-chipinge-south-legislators-call-for-community-share-ownership-law/",
            "content": "By A Correspondent| In a landmark development aimed at deepening economic inclusion and empowering local communities, Cabinet has approved the implementation of the Community Share Ownership Trust (CSOT) Framework, giving effect to a parliamentary motion moved earlier this year by Chipinge South Member of Parliament, Clifford Hlatywayo.\n\nHlatywayos motion, tabled in the National Assembly on 27 March 2025, called for the establishment of an Act of Parliament to make it mandatory for companies operating in local communities to allocate a share of their profits towards community development.\n\nIn his motion titled Establishment of an Act of Parliament on Community Share Ownership Schemes, Hlatywayo urged Government to ensure that the exploitation of natural resources translates into tangible benefits for the communities in which companies operate.\n\nCompanies must contribute a mandatory percentage of their profits  a proposal of five percent  towards the development and well-being of the communities they work from, Hlatywayo said. This contribution will be channelled into projects determined by community share scheme committees which will be established in each constituency.\n\nHlatywayo argued that corporate social responsibility (CSR) initiatives had failed to deliver meaningful development because they were voluntary and lacked accountability. He proposed that all sectors  including mining, agriculture, tourism, manufacturing, and construction  should fall under a new law compelling companies to invest directly in the communities they benefit from.\n\nHe also emphasised that the policy would prioritise local employment, recommending that 80 percent of jobs in companies operating in a given district be reserved for qualified local residents.\n\nOur communities are the lifeblood of our economy, yet they continue to suffer under the weight of exploitation with little to no benefit, he said. It is time to ensure that companies contribute not only to their profits but also to the welfare and development of our people.\n\nFollowing months of deliberation, Cabinet this week adopted and approved the implementation of the CSOT Framework, effectively operationalising the intent of Hlatywayos motion.\n\nIn a post-Cabinet briefing on 30 September 2025, Government said the framework forms part of the rural industrialisation strategy, which aims to ensure inclusive economic growth in line with President Emmerson Mnangagwas vision of leaving no one and no place behind.\n\nUnder the new framework, Community Economic Empowerment Trusts (CEETs)  which evolve from the previous CSOT model  will act as engines of local development. They will attract investments into agro-processing, industrial parks, and local enterprise development, leveraging agricultural and mineral resources in each district.\n\nThe Community Economic Empowerment Trusts will be critical vehicles to drive rural industrialisation in all districts, Cabinet noted. They will form a vital cog that attracts investments through partnerships, leveraging local resources and the Village Business Units being established.\n\nGovernment also announced plans to amend the Economic Empowerment and Indigenisation Act to align it with the new empowerment thrust and harmonise it with the Mines and Minerals Amendment Bill.\n\nThe Implementation Framework will ensure that communities benefit from the extraction and exploitation of natural resources through revenue-sharing formulae. Companies already paying dividends to community trusts will continue under the current arrangement, while new entrants will be required to comply with the updated empowerment requirements.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| In a landmark development aimed at deepening economic inclusion and empowering local communities, Cabinet has approved the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/cabinet-endorses-chipinge-south-legislators-call-for-community-share-ownership-law/\">Continue reading<span class=\"screen-reader-text\"> \"Cabinet Endorses Chipinge South Legislator’s Call for Community Share Ownership Law\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Parliament Vows Action to Support Zimbabwe’s Women and Redistribute Unpaid Care Work",
            "url": "https://www.zimeye.net/2025/10/07/parliament-vows-action-to-support-zimbabwes-women-and-redistribute-unpaid-care-work/",
            "content": "HARARE  In a powerful declaration, Mashonaland East Senator Chief Ndicho has publicly pledged to drive parliamentary interventions that empower women and address the heavy burden of unpaid care work carried out by women and girls across Zimbabwe.\n\nAs legislators from now henceforth we have listened and we have heard, Chief Ndicho stated. When we go back to parliament, we will come up with interventions and policies that support the empowerment of women and in particular this agenda in totality. So to that end, we commit.\n\nThe Senator made this definitive commitment during a breakfast meeting on Unpaid Care and Domestic Work (UCDW), organized by a coalition of gender advocacy groups including the Womens Academy for Leadership and Political Excellence (WALPE), Womens Coalition of Zimbabwe, Padare/Enkundleni/Mens Forum of Gender and Oxfam in Zimbabwe.\n\nThe meeting, hosted at Crowne Plaza Monomotapa recently was held with the Zimbabwe Womens Parliamentary Caucus and gender champions from the Senate (the Chiefs) focused on how UCDW and Gender Based Violence (GBV) continue to limit womens participation in leadership and decision-making and how female MPs and Chiefs can advocate for laws that promote the recognition, reduction and redistribution of UCDW in the country.\n\nTo underscore the importance of the issue, Chief Ndicho invoked traditional proverbs, affirming womens foundational role in society. As traditional leaders, we value the role of women It is said Musha mukadzi, kusina mai hakuendwe and rurimi rwaamai because women are important and they have a key role within society, he stated.\n\nThis commitment from a senior traditional leader provides crucial momentum for a groundbreaking piece of legislation: the proposed Unpaid Care and Domestic Work (UCDW) Bill. The bill, developed through collaboration between WALPE and the Zimbabwe Womens Parliamentary Caucus, aims to formally recognize unpaid care and domestic work as legitimate labor and establish a national care policy.\n\nThe push for this reform is backed by years of advocacy and research showing that the disproportionate burden of UCDW limits womens participation in the economy and in leadership. The proposed legislation has already garnered significant cross-party support, signaling a growing recognition of unpaid care work as both a social justice and economic development issue.\n\nWith traditional leaders like Chief Ndicho now championing the cause, the movement to recognize, reduce, and redistribute unpaid care work is gaining critical momentum as the bill prepares for parliamentary debate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "HARARE – In a powerful declaration, Mashonaland East Senator Chief Ndicho has publicly pledged to drive parliamentary interventions that empower … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/parliament-vows-action-to-support-zimbabwes-women-and-redistribute-unpaid-care-work/\">Continue reading<span class=\"screen-reader-text\"> \"Parliament Vows Action to Support Zimbabwe’s Women and Redistribute Unpaid Care Work\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "ZIMRA Official in Hot Water for Allegedly Using Politician’s Name to Cover Corrupt Deals",
            "url": "https://www.zimeye.net/2025/10/07/zimra-official-in-hot-water-for-allegedly-using-politicians-name-to-cover-corrupt-deals/",
            "content": "By A Correspondent| A senior officer at the Zimbabwe Revenue Authority (ZIMRA), Raymore Tafadzwa Machingura is facing mounting allegations of corruption, abuse of office, and illicit accumulation of wealth, amid claims he has been invoking the name of a prominent ZANU PF politician to protect himself from accountability.\n\nAccording to a dossier seen by this publication and corroborated by a close source, Machingura has appeared before multiple internal hearings over the years, yet no decisive disciplinary action has been taken.\n\nThe source, who requested anonymity for fear of reprisals, alleged that Machingura openly boasts that his actions are shielded by political connections.\n\nDocuments reviewed indicate that Machingura allegedly failed to declare substantial assets as required under ZIMRA regulations.\n\nThe accumulation of such assets has raised questions within the authority, with critics arguing that the wealth appears disproportionate to his known earnings.\n\nThe source further alleged that Machingura leveraged his positions at key border posts to engage in illicit dealings.\n\nHe reportedly worked at Plumtree, Mutare, Beitbridge, and Bulawayo border stations locations often flagged for smuggling and corruption risks.\n\nEach time he was transferred, the same pattern followed , unexplained wealth, and no consequences, the source claimed.\n\nThe dossier also claims that Machingura frequently name-drops a ZANU PF official from Chipinge Central, telling colleagues that his protection ensures no action will ever be taken against him.\n\nThis has fueled speculation within ZIMRA about political interference in internal disciplinary processes.\n\nIn response to questions from this publication, Raymore Tafadzwa Machingura dismissed the allegations as malicious and unfounded, suggesting they were driven by personal disputes.\n\nI implore you to do your verifications first to ensure factual reporting. These are baseless accusations being driven by a bitter and jealous relative, he said.\n\nOn the alleged misconduct hearings, Machingura stated:\n\nI kindly refer you to our ZIMRA HQ and enquire about the alleged misconduct hearings. I do not know of any.\n\nRegarding the purported undeclared properties, he maintained that his records were in order:\n\nI kindly request you to request for a copy of my asset declaration from ZIMRA and advise of any that are not declared. Again, I do not know of any.\n\nOn claims of irregular dealings at border posts, he responded:\n\nThere is nothing specific to respond to on this one. Kindly tell me of any specific irregular dealing that I was involved in and I will respond.\n\nDismissing suggestions of political protection, Machingura said:\n\nI do not need any protection, but again you can verify with ZIMRA if anyone has interfered with their processes.\n\nHe further insisted that his wealth was legitimate, built over years of business:\n\nI am open to any verifications concerning my sources of income. I have long established businesses that started even before my appointment at ZIMRA. You may request for my asset declaration at my time of inception (2010).\n\nEfforts to obtain an official comment from ZIMRAs communications department were unsuccessful by the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A senior officer at the Zimbabwe Revenue Authority (ZIMRA), Raymore Tafadzwa Machingura is facing mounting allegations of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/zimra-official-in-hot-water-for-allegedly-using-politicians-name-to-cover-corrupt-deals/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA Official in Hot Water for Allegedly Using Politician’s Name to Cover Corrupt Deals\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "ZANU PF Speaks on ED, VP Chiwenga Ugly Fight",
            "url": "https://www.zimeye.net/2025/10/07/zanu-pf-speaks-on-ed-vp-chiwenga-ugly-fight/",
            "content": "By A Correspondent  ZANU PF has moved to quell growing speculation over a deepening rift between President Emmerson Mnangagwa and his deputy, Vice President Constantino Chiwenga, amid reports of fierce succession battles tearing through the ruling party ahead of the next elective congress.\n\nZANU PF Information and Publicity Director Farai Marapira on Monday dismissed as false claims that the two leaders are locked in a bitter power struggle over who should lead the party beyond 2028.\n\nReports have suggested that a faction aligned with Chiwenga  who led the 2017 military intervention that catapulted Mnangagwa to power  is resisting Mnangagwas alleged plans to extend his presidential term from 2028 to 2030. The alleged push for an extension has been widely interpreted as part of Mnangagwas strategy to block Chiwengas long-anticipated bid for the presidency.\n\nAdding fuel to the fire, insiders claim Mnangagwa is grooming business tycoon and close ally Kudakwashe Tagwirei, a fellow Karanga clansman, as his preferred successor, sidelining both Chiwenga and the other Vice President, Kembo Mohadi.\n\nHowever, Marapira played down the reports, describing them as baseless propaganda meant to sow division within ZANU PF.\n\nThe relationship between the President and his two Vice Presidents is one of brotherhood, said Marapira. These are men who fought side by side for Zimbabwes independence. They faced death together, and they continue to work together for the countrys progress.\n\nAll this talk of animosity and fighting is the work of detractors who wish to bring alarm and despondency within our ranks. Our party remains solidly united behind President Mnangagwa.\n\nDespite Marapiras reassurances, tensions between Mnangagwa and Chiwenga have been simmering since the November 2017 coup that toppled the late Robert Mugabe. Chiwenga, then Commander of the Zimbabwe Defence Forces, was instrumental in orchestrating the military takeover that installed Mnangagwa as president  a move many in the army believed was a temporary arrangement to allow a transition to Chiwengas eventual leadership.\n\nHowever, Mnangagwa has since consolidated power, surrounding himself with loyalists and sidelining many of Chiwengas military allies. His reported plan to seek a third term has intensified internal party friction, with whispers of a looming showdown between the civilian and military wings of ZANU PF.\n\nChiwengas faction, largely composed of war veterans and military elites, is said to be growing increasingly restless over Mnangagwas refusal to honour what they claim was a gentlemens agreement for a power handover after two terms.\n\nThe rivalry has also manifested in subtle public gestures  from competing loyalist rallies to media leaks and social media campaigns portraying each side as the legitimate custodian of ZANU PFs liberation legacy.\n\nAs the ruling party heads toward its next congress, political observers believe the MnangagwaChiwenga succession dispute could define the future of both ZANU PF and Zimbabwes post-Mugabe political order.\n\nMarapira, however, insisted that ZANU PF remains unshaken and united under the visionary leadership of President Mnangagwa, dismissing speculation of internal divisions as wishful thinking by the opposition and Western media.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – ZANU PF has moved to quell growing speculation over a deepening rift between President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/zanu-pf-speaks-on-ed-vp-chiwenga-ugly-fight/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Speaks on ED, VP Chiwenga Ugly Fight\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "NetOne’s Masunda Denies Hand in CEO’s Arrest",
            "url": "https://www.zimeye.net/2025/10/07/netones-masunda-denies-hand-in-ceos-arrest/",
            "content": "The Chief Commercial Officer at Netone, Learnmore Masunda has publicly denied any hand and orchestrating the arrest of CEO Raphael Mushanawani, calling the claims a choreographed smear campaign.\n\nThe denial underscores the deep fractures within the companys leadership, which is now engulfed in a scandal involving allegations of corruption, misconduct, and financial mismanagement against multiple top executives.\n\nCEOs Arrest and Disputed Charges\n\nThe crisis became public when the Zimbabwe Anti-Corruption Commission (ZACC) arrested Group CEO Raphael Mushanawani. He faces allegations of fraud and criminal abuse of office for unlawfully authorizing contracts worth $1.2 million for system upgrades.\n\nHowever, the case appears to have significant discrepancies. Internal company documentation shows that only $272,000 was actually disbursed for these upgrades, and sources maintain the expenditures followed established procurement policies and had proper approvals. This has led to speculation about the validity of the charges.\n\nMushanawanis legal team has dismissed the arrest as a fabricated power grab.\n\nDenial and Counter-Allegations in a Power Vacuum\n\nWith Mushanawanis contract up for renewal in November, attention turned to the internal power dynamics. Chief Commercial Officer Learnmore Masunda was identified by some as a potential successor, suggesting a motive for him to be involved in the CEOs legal troubles.\n\nMasunda vehemently denied this in an interview. I have never harboured such ambitions and have no need to cause the arrest of my CEO, he stated. My main responsibilities are to support the Group CEO This is the task ahead of me, and the rest is just nothing but sideshows from our detractors.\n\nHe revealed he first learned of the allegations against him through the press and lamented the continued mudslinging.\n\nA Web of Accusations Against Senior Leaders\n\nThe scandal extends far beyond the CEO, implicating several other high-ranking officials:\n\n Learnmore Masunda (CCO): Faces an internal probe into allegations of irregularities in vehicle disposal, authorizing questionable stock adjustments worth nearly $10 million annually, multiple sexual harassment complaints, and bringing a firearm to company premises to intimidate staff. Mr. Chidzodzo (Head of Procurement): Already before the courts over 17 missing Samsung Z Fold devices and implicated in the same vehicle disposal scheme as Masunda. Christopher Muchechemera (CTO): Accused of involvement in dubious procurement deals, including $15 million for microwave transmission equipment and $11.7 million for upgrades, where other vendors had offered similar equipment for as little as $8 million.\n\nSources indicate that NetOne Board Chair Engineer Mawurukira has taken action to block questionable financial practices originating from Masundas division, including discount waivers estimated to cost over $20 million annually.\n\nThe ZACC investigation itself has faced obstacles, including a reported incident where keys to an office containing crucial evidence went missing.\n\nAmid the turmoil, staff have reported a culture of fear within NetOne, with intimidation and retaliation against those who question procurement decisions.\n\nMushanawani has since returned to work after being granted bail and has called for unity. An urgent executive committee meeting is scheduled to address the escalating crisis.\n\nAs investigations continue, the future leadership and stability of NetOne remain uncertain, raising serious questions about governance within Zimbabwes state-owned enterprises.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Chief Commercial Officer at Netone, Learnmore Masunda has publicly denied any hand and orchestrating the arrest of CEO Raphael … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/netones-masunda-denies-hand-in-ceos-arrest/\">Continue reading<span class=\"screen-reader-text\"> \"NetOne’s Masunda Denies Hand in CEO’s Arrest\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Top Zanu PF Officials Arrested Over Land Fraud",
            "url": "https://www.zimeye.net/2025/10/07/top-zanu-pf-officials-arrested-over-land-fraud/",
            "content": "By A Correspondent Two top Zanu PF officials in Harare South have been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) over a massive land scam involving US$1.5 million.\n\nPhinias Muchichwa (41), the ZANU PF chairperson for the Godfrey Chidyausiku district, and Anderson Frendson (37), the partys branch chief of security for the Josiah Magama branch, were nabbed for allegedly defrauding desperate home seekers through the illegal sale of residential stands.\n\nZACC spokesperson Simiso Mlevu confirmed the arrests, saying the two allegedly subdivided Stand 34 in Tariro Township, Hopley  a 9.3473-hectare piece of land owned by Sunshine Developments (Pvt) Ltd  into more than 200 residential stands which they sold for US$300 each, without the owners consent.\n\nThe pair reportedly preyed on fellow party members and other residents desperate for housing in Harares high-density suburb, cashing in on the ongoing urban land crisis.\n\nThey sold privately-owned land without authority, prejudicing Sunshine Developments of approximately US$1.5 million, said Mlevu.\n\nMuchichwa and Frendson are expected to appear in court on October 6, 2025, facing charges of fraud.\n\nThe arrests come amid growing public frustration over rampant land scams across the country, many of which have been linked to politically connected land barons and ruling party officials. Despite repeated government pronouncements to curb such corruption, illegal land sales have continued to flourish, particularly in urban areas.\n\nZACC said investigations are still underway, with more arrests expected as additional victims come forward.\n\nSunshine Developments (Pvt) Ltd has not yet commented on the case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Two top Zanu PF officials in Harare South have been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/top-zanu-pf-officials-arrested-over-land-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zanu PF Officials Arrested Over Land Fraud\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "Mabvazuva Secondary School Sees the Light as MP Mhetu’s Initiative Brings Hope, Development in Epworth",
            "url": "https://www.zimeye.net/2025/10/07/mabvazuva-secondary-school-sees-the-light-as-mp-mhetus-initiative-brings-hope-development-in-epworth/",
            "content": "Harare  September 29, 2025  For the first time since its establishment, the halls and classrooms of Mabvazuva Secondary School are now illuminated with electric light, marking a historic milestone for the school community. The official electrification ceremony, held on Monday, was a scene of immense joy and relief, signalling a new chapter of development for the institution.\n\nThe project was spearheaded by the areas Member of Parliament, Hon. Zivai Mhetu, and was funded partly through Constituency Development Funds (CDF). The event was further brightened by a surprise announcement from Grapnote Steel CEO, Weston Ruzvidzo, who pledged to fund the full school fees for seven students for the upcoming academic year.\n\nIn his address, Hon. Mhetu detailed the collaborative and transparent process that led to the projects success. He explained that a surplus of $1,500, accrued from a completed road construction project and assisted by the local board, was strategically redirected.\n\nWe called for a meeting with the constituency development committee and discussed our priorities. There was consensus on the electrification of Mabvazuva Secondary school, Mhetu stated.\n\nThe MP used the occasion to issue a powerful call for community involvement and accountable leadership. He urged parents and School Development Committee (SDC) representatives to actively participate in feedback meetings to dictate how CDF funds are used.\n\nParents attend these meetings and table their needs We prioritize the projects basing on the priorities as per the votes, Mhetu said, listing potential future projects like administration halls and computer labs. He stressed, If you dont attend, we wont know your needs.\n\nExpanding his vision beyond the school, Mhetu framed the electrification as a critical step in a larger national mission. He drew comparisons to rapidly developed nations like China and Dubai, challenging attendees to envision a prosperous Zimbabwe.\n\nWe are fighting for the education of our children when we empower them, we have empowered the nation, he declared. We want to develop Zimbabwe and make it a prime destination My heart bleeds towards development and the empowerment of children because you are our future leaders.\n\nEchoing the MPs sentiments, Grapnote Steel CEO Weston Ruzvidzo emphasized citizen responsibility, resonating with the Shona mantra, Nyika inovakwa nevene vayo (A country is built by its own people).\n\nWe will continue to support childrens development, Ruzvidzo said. Do not vandalise your legacy because the electrification of this school will benefit the community. You can now pump water and this is a developmental milestone worth celebrating.\n\nThe acting District Schools Inspector commended the initiative, aligning it with the goals of the heritage-based curriculum. As a ministry, we are happy when we have leaders with the vision of ensuring that they support the utilisation of available resources in schools, the official said.\n\nThe electrification of Mabvazuva Secondary is more than just a connection to the grid; it is a symbol of collective action, a beacon of educational hope, and a foundational step toward the communitysand the nationsaspirations for a brighter, self-built future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – September 29, 2025 – For the first time since its establishment, the halls and classrooms of Mabvazuva Secondary … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/mabvazuva-secondary-school-sees-the-light-as-mp-mhetus-initiative-brings-hope-development-in-epworth/\">Continue reading<span class=\"screen-reader-text\"> \"Mabvazuva Secondary School Sees the Light as MP Mhetu’s Initiative Brings Hope, Development in Epworth\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "ED Aides Arrested Over Land Scam",
            "url": "https://www.zimeye.net/2025/10/07/ed-aides-arrested-over-land-scam/",
            "content": "By A Correspondent The Zimbabwe Anti-Corruption Commission (ZACC) has arrested two senior ZANU PF officials from Hopley, believed to be close allies of President Emmerson Mnangagwas political network, over a massive land scam involving US$1.5 million.\n\nPhinias Muchichwa (41), the ZANU PF chairperson for the Godfrey Chidyausiku district, and Anderson Frendson (37), the partys branch chief of security for the Josiah Magama branch, were nabbed for allegedly defrauding desperate home seekers through the illegal sale of residential stands.\n\nZACC spokesperson Simiso Mlevu confirmed the arrests, saying the two allegedly subdivided Stand 34 in Tariro Township, Hopley  a 9.3473-hectare piece of land owned by Sunshine Developments (Pvt) Ltd  into more than 200 residential stands which they sold for US$300 each, without the owners consent.\n\nThe pair reportedly preyed on fellow party members and other residents desperate for housing in Harares high-density suburb, cashing in on the ongoing urban land crisis.\n\nThey sold privately-owned land without authority, prejudicing Sunshine Developments of approximately US$1.5 million, said Mlevu.\n\nMuchichwa and Frendson are expected to appear in court on October 6, 2025, facing charges of fraud.\n\nThe arrests come amid growing public frustration over rampant land scams across the country, many of which have been linked to politically connected land barons and ruling party officials. Despite repeated government pronouncements to curb such corruption, illegal land sales have continued to flourish, particularly in urban areas.\n\nZACC said investigations are still underway, with more arrests expected as additional victims come forward.\n\nSunshine Developments (Pvt) Ltd has not yet commented on the case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Anti-Corruption Commission (ZACC) has arrested two senior ZANU PF officials from Hopley, believed to be … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/ed-aides-arrested-over-land-scam/\">Continue reading<span class=\"screen-reader-text\"> \"ED Aides Arrested Over Land Scam\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        },
        {
            "title": "“Kick for Life” Tournament Highlights Need for Discipline and Ethics in Youth Football, Says Kauzani",
            "url": "https://www.zimeye.net/2025/10/07/kick-for-life-tournament-highlights-need-for-discipline-and-ethics-in-youth-football-says-kauzani/",
            "content": "Sports Correspondent\n\nHarare  The inaugural Kick for Life Tournament, held last Saturday, brought together young football talent from across the community, but it also sparked reflection on the state of youth football, according to Hon. Ishmael Kauzani, founder of Crowborough Soccer Academy.\n\nI would like to sincerely thank all of you for your participation in last Saturdays Kick for Life Tournament. It was our very first time organizing and hosting such an event, and I must say  it was both a learning experience and a proud moment for our community, Kauzani said.\n\nWhile celebrating the success of the tournament, Kauzani raised concerns over worrying trends in grassroots football. Unfortunately, theres a growing tendency to prioritize winning at all costs, which has led to behaviors such as age cheating and recruiting so-called Jahbhora players  career dropouts who jump from one team to another for quick recognition, he said.\n\nThese actions not only destroy the spirit of development but also send the wrong message to the youth. Let us not forget: we are also fighting drug and substance abuse  a serious threat in our communities. If we, the mentors, compromise discipline and ethics, then we risk becoming part of the problem. We must lead by example, Kauzani added.\n\nHe urged coaches and teams to prioritize professionalism and long-term player development. I encourage all coaches and teams to register your players and issue proper licenses. Avoid recruiting players purely for short-term gains. Focus on long-term discipline, growth, and respect. Reject any form of cheating  it kills true talent. Promote professionalism in grassroots football, he said.\n\nLooking ahead, Kauzani proposed the creation of the Kuwadzana Junior District League (KJDL) to formalize youth football development. I strongly recommend we begin working toward launching a Kuwadzana Junior District League (KJDL). This will formalize development structures and make our communities a force to reckon with in football circles, he said.\n\nReaffirming his commitment, Kauzani concluded: I am fully available and committed to helping make this vision a reality. Let us take this seriously and act now. Together, lets build disciplined, focused, and professional players  and stronger, drug-free communities.\n\nThe tournament has sparked dialogue among coaches, parents, and community leaders, highlighting the need for structured, ethical, and sustainable approaches to nurturing young football talent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Harare – The inaugural Kick for Life Tournament, held last Saturday, brought together young football talent from across … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/kick-for-life-tournament-highlights-need-for-discipline-and-ethics-in-youth-football-says-kauzani/\">Continue reading<span class=\"screen-reader-text\"> \"“Kick for Life” Tournament Highlights Need for Discipline and Ethics in Youth Football, Says Kauzani\"</span></a></p>",
            "time": "09:30",
            "date": "08 Oct 2025"
        }
    ]
}