{
    "news": [
        {
            "title": "Human Rights Defenders Hail Abolition Of Death Penalty",
            "url": "https://www.zimeye.net/2025/01/01/human-rights-defenders-hail-abolition-of-death-penalty/",
            "content": "By A Correspondent\n\nZimbabwe has officially abolished the death penalty with the passing of the Death Penalty Abolition Act.\n\nAccording to a government gazette released on Tuesday, the new law stipulates that no court shall impose the death sentence for any crime. Instead, courts are required to impose alternative sentences that are suitable to the circumstances of each case.\n\nThe act also mandates that the Supreme Court will no longer confirm death sentences. In such instances, the court will substitute the death penalty with other appropriate sentences based on the case specifics.\n\nZimbabwe has not carried out any executions since 2005, and the move to abolish the death penalty has been supported by various organizations and individuals.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe has officially abolished the death penalty with the passing of the Death Penalty Abolition Act. According … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/01/human-rights-defenders-hail-abolition-of-death-penalty/\">Continue reading<span class=\"screen-reader-text\"> \"Human Rights Defenders Hail Abolition Of Death Penalty\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Zimbabwe Abolishes Death Penalty",
            "url": "https://www.zimeye.net/2025/01/01/zimbabwe-abolishes-death-penalty/",
            "content": "By A Correspondent\n\nZimbabwe has officially abolished the death penalty with the passing of the Death Penalty Abolition Act.\n\nAccording to a government gazette released on Tuesday, the new law stipulates that no court shall impose the death sentence for any crime. Instead, courts are required to impose alternative sentences that are suitable to the circumstances of each case.\n\nThe act also mandates that the Supreme Court will no longer confirm death sentences. In such instances, the court will substitute the death penalty with other appropriate sentences based on the case specifics.\n\nZimbabwe has not carried out any executions since 2005, and the move to abolish the death penalty has been supported by various organizations and individuals.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe has officially abolished the death penalty with the passing of the Death Penalty Abolition Act. According … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/01/zimbabwe-abolishes-death-penalty/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Abolishes Death Penalty\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "President Chamisa’s Message of Hope as 2025 Beckons",
            "url": "https://www.zimeye.net/2025/01/01/president-chamisas-message-of-hope-as-2025-beckons/",
            "content": "By A Correspondent\n\nAs Zimbabweans prepare to welcome 2025, opposition leader Advocate Nelson Chamisa has urged citizens to stay hopeful and united in the coming year.\n\nIn a heartfelt statement released on December 31, Advocate Chamisa reflected on the year gone by and offered a message of optimism for the future. He said, GOODBYE 2024!! This is the last day of the year 2024. Enjoying the indigenous wild fruit sour plum (nhengeni). Thank you all for standing together this exciting year 2024. Good morning 2025! #Godisinit.\n\nThe statement, paired with a photo of Chamisa in his rural home, showcased a leader embracing simplicity. His image, surrounded by nature, further highlighted his grounded and relatable approach, reflecting his connection to the people of Zimbabwe as they look ahead to the new year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As Zimbabweans prepare to welcome 2025, opposition leader Advocate Nelson Chamisa has urged citizens to stay hopeful … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/01/president-chamisas-message-of-hope-as-2025-beckons/\">Continue reading<span class=\"screen-reader-text\"> \"President Chamisa’s Message of Hope as 2025 Beckons\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Magpies Fly High, Stun Red Devils",
            "url": "https://www.zimeye.net/2025/01/01/magpies-fly-high-stun-red-devils/",
            "content": "By A Correspondent\n\nFirst-half headers from Alexander Isak and Joelinton propelled Newcastle United into fifth place, while handing Ruben Amorims Manchester United side their third consecutive league defeat.\n\nThe action began early, with Isak scoring his 12th goal of the season in the 4th minute, heading in from a brilliant cross by Lewis Hall. Joelinton doubled the lead shortly after, making it 2-0 before the 20-minute mark. Although Manchester United showed signs of improvement as the match progressed, they never truly threatened to overturn the deficit.\n\nEddie Howes team climbed to 5th, just three points behind 4th-place Chelsea, who suffered a shock defeat to struggling Ipswich Town at Portman Road. Meanwhile, Manchester United remained in 14th.\n\nNewcastle started the game with confidence, quickly going ahead 1-0 thanks to an expertly crafted build-up and a well-placed cross from Hall that Isak finished off with a header. The visitors extended their lead soon after, with Joelinton outjumping Lisandro Martinez to head the ball past Andre Onana. A potential third goal from Isak was ruled out for offside.\n\nAt the other end, Rasmus Hojlund came close with a shot just wide, and Casemiro missed an opportunity from close range after a misstep by Fabian Schar. Uniteds struggles were evident, with their lack of control in midfield allowing Newcastle to dominate.\n\nThe defeat marked a historic low for Manchester United, as it was the first time since 1979 that they had suffered three consecutive league losses at Old Trafford. Despite a few fleeting moments of pressure, Newcastles early goals proved enough to seal the victory.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent First-half headers from Alexander Isak and Joelinton propelled Newcastle United into fifth place, while handing Ruben Amorim’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/01/magpies-fly-high-stun-red-devils/\">Continue reading<span class=\"screen-reader-text\"> \"Magpies Fly High, Stun Red Devils\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Government Blames Transporters For Causing Road Crashes",
            "url": "https://www.zimeye.net/2025/01/01/government-blames-transporters-for-causing-road-crashes/",
            "content": "By A Correspondent\n\nThe issue of road traffic accidents has once again sparked debate, with the government placing a significant amount of blame on transport operators.\n\nRecent statements from the Traffic Safety Council of Zimbabwe (TSCZ) urge transport operators to stop imposing unreasonable targets on drivers, claiming these pressures contribute to an increase in accidents. But is it fair to single out transporters for road crashes, and what role does the government play in ensuring road safety?\n\nAccording to TSCZ statistics, 94 percent of road accidents are caused by human error. This figure underscores the importance of driver behavior in preventing accidents.\n\nHowever, TSCZ managing director Mr. Munesu Munodawafa emphasizes that unrealistic targets set by transport operators are pushing drivers to exceed their limits, resulting in dangerous driving practices, particularly speeding. When you do an analysis of the accidents, particularly during this festive season, they are a result of speeding, and we believe they are a result of targets given to drivers that forces the driver to go beyond their limits, he stated. Our appeal to operators is to avoid giving those targets, they are not helpful, they endanger passengers.\n\nWhile transport operators role in creating a high-pressure environment for drivers cannot be overlooked, its crucial to ask: is it fair to place the blame entirely on them? Transport companies may prioritize timely deliveries or operational efficiency, but the drivers themselves are the ones who ultimately make decisions on the road.\n\nHuman error, often under pressure, seems to be a primary contributor to accidents. However, are there broader systemic factors at play?\n\nThe governments role in this issue is significant. The TSCZs call for safer practices highlights the lack of comprehensive regulation or enforcement in ensuring that transport operators prioritize safety over speed and efficiency.\n\nThe government must enforce stricter regulations, hold transport companies accountable, and ensure that safety guidelines are effectively communicated and followed. Without robust policies, it is difficult to ensure that operators are not overburdening drivers with targets that compromise road safety.\n\nIn addition to holding transporters accountable, the government must continue its work on improving infrastructure, enhancing driver education, and enforcing road safety laws. It is not just about blaming one party, but about creating a culture of safety on the roads, Mr. Munodawafa said.\n\nUltimately, road safety is a shared responsibility. While transport operators must be mindful of the pressure they place on drivers, the government must ensure the implementation and enforcement of policies that support road safety. Both sectors need to work together to prevent the rising number of accidents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The issue of road traffic accidents has once again sparked debate, with the government placing a significant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/01/government-blames-transporters-for-causing-road-crashes/\">Continue reading<span class=\"screen-reader-text\"> \"Government Blames Transporters For Causing Road Crashes\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "How To Control Emotions for Safe Driving",
            "url": "https://www.zimeye.net/2024/12/31/how-to-control-emotions-for-safe-driving/",
            "content": "Driving requires more than just the physical ability to operate a vehicle; it demands total concentration and a sense of calm. How you feel behind the wheel can significantly impact your safety and that of others on the road. Whether youre feeling relaxed, anxious, or hot-tempered, your emotions affect your judgment, reaction times, and overall driving behavior.\n\nIts essential to recognize the profound influence emotions have on your driving and actively work to control them. Emotional reactions can alter your decision-making process, leading to dangerous maneuvers or poor judgment. For example, anxiety might cause you to overreact or hesitate, while anger could lead to aggressive driving and reckless behavior. Stress can cloud your focus, increasing the likelihood of mistakes.\n\nThe key to maintaining safety on the road lies in emotional regulation. Regardless of the emotional state youre in, never allow your feelings to dictate your actions behind the wheel. Losing control can lead to dangerous situations, not only putting yourself and your passengers at risk but also endangering other drivers and pedestrians.\n\nHere are a few strategies for managing emotions while driving:\n\nBy recognizing the link between emotions and driving behavior, and by taking steps to manage your stress, you can significantly reduce the risk of accidents. Remember, driving is a responsibility that requires a clear mind and a calm demeanor. Never let emotions take the wheel.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :tr*************@gm***.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Driving requires more than just the physical ability to operate a vehicle; it demands total concentration and a sense of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/how-to-control-emotions-for-safe-driving/\">Continue reading<span class=\"screen-reader-text\"> \"How To Control Emotions for Safe Driving\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Arteta Speaks On Saka Injury",
            "url": "https://www.zimeye.net/2024/12/31/arteta-speaks-on-saka-injury/",
            "content": "Sports Correspondent\n\nMikel Arteta has confirmed that Bukayo Saka will be sidelined for at least more than two months following surgery on his injured hamstring.\n\nThe 23-year-old winger was forced off in the first half of Arsenals 5-1 victory over Crystal Palace on 21 December and was seen leaving the stadium on crutches.\n\nAfter Arsenals 1-0 win over Ipswich Town on Friday, Arteta shed light on Sakas injury.\n\nHe had a procedure, Arteta explained. Everything went well, but unfortunately he will be out for many, many weeks. I said many weeks, so I think it will be more than two months. I dont know exactly how much longer.\n\nIt will depend on how the scar tissue starts to heal in the first week or so, and the mobility of that. Lets see, its very difficult to say.\n\nSakas injury comes at a critical point in the season, with Arsenal fighting on multiple fronts.\n\nThe team still has ongoing campaigns in the Premier League, UEFA Champions League, FA Cup, and League Cup. In January alone, Arsenal will play nine matches.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Mikel Arteta has confirmed that Bukayo Saka will be sidelined for at least “more than two months” following … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/arteta-speaks-on-saka-injury/\">Continue reading<span class=\"screen-reader-text\"> \"Arteta Speaks On Saka Injury\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Chivayo Continues to Squander Looted Cash as Zimbabweans Struggle with Poverty",
            "url": "https://www.zimeye.net/2024/12/31/chivayo-continues-to-squander-looted-cash-as-zimbabweans-struggle-with-poverty/",
            "content": "By A Correspondent\n\nControversial Zanu PF businessman Wicknell Chivayo is once again in the spotlight for his lavish spending, even as millions of Zimbabweans continue to struggle with poverty.\n\nChivayo, who has faced accusations of looting millions of dollars in State funds through his failed Gwanda project, seems undeterred by the mounting criticism. His actions have sparked outrage among many, including members of his own party.\n\nOn Monday, Zanu PF Varakashi took to Facebook to blast Chivayo for his extravagance. A post from the Zanu PF Operation Restore Legacy Facebook page read:\n\nWhile some are struggling to buy a bicycle worth 70 US dollars, theres a son of the soil somewhere enjoying his New Private Jet worth 12 million US dollars, flying with his girlfriend.\n\nThe post continued with a pointed proverb, criticizing the disparity between the rich and the poor:\n\nThese are what we call lanes, I will leave you with a Proverb that says, A rich man marries using his wealth, but a poor man marries using the strength of his manhood.'\n\nIt concluded with another proverb reflecting the divide: A rich man spanks with money but a poor man uses his bare rough hands.\n\nChivayos continued display of wealth has fueled anger among many Zimbabweans who are facing a tough economic situation, highlighting the stark contrast between the elite and the struggling masses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF businessman Wicknell Chivayo is once again in the spotlight for his lavish spending, even … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/chivayo-continues-to-squander-looted-cash-as-zimbabweans-struggle-with-poverty/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Continues to Squander Looted Cash as Zimbabweans Struggle with Poverty\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Cde Mabhunu Stopping Everything",
            "url": "https://www.zimeye.net/2024/12/31/cde-mabhunu-stopping-everything/",
            "content": "Cde Nyokai E. Mabhunu: The Torchbearer of Integrity and Discipline in Zimbabwes Mission, 2025 and Beyond.\n\nIn a world where leadership often falters, Cde Nyokai E. Mabhunu emerges as a heroic figure embodying discipline, selflessness, and a deep commitment to his community. Beginning in 2025, Mabhunu has taken on the mantle of transforming Zimbabwean society through a mission grounded in the principles of moral integrity, unity, and social justice. His rallying cry, Kune nzira dzemasoja, reverberates across the nation, reminding every citizen of the values that must underpin a truly liberated and thriving society.\n\nA Heroic Vision for Zimbabwe\n\nCde Mabhunus mission, inspired by the timeless teachings of struggle and discipline, revolves around six core principles that he passionately advocates. These principles not only reflect the ethos of Zimbabwes liberation struggle but also seek to foster a new era of accountability and respect for societal values.\n\nKune nzira dzemasoja dzekuzvibata nadzo (There are ways soldiers must conduct themselves). For Mabhunu, discipline is non-negotiable. He calls on Zimbabweans to follow all laws and engage in positive conduct, ensuring a foundation of order and respect within the community.\n\nCde Mabhunu reminds the masses to avoid the temptation of taking from their own people. His mantra, Dzoserai zvinhu zvose zvatorwa kumuvengi, emphasizes returning what has been wrongfully taken from external oppressors while safeguarding the communitys collective resources.\n\nA custodian of Zimbabwean heritage, Mabhunu passionately advocates for the dissemination of ethical values to the masses. Taurai zvinetsika kuruzhinji rwevanhu underscores his belief that cultural integrity and education are essential for societal cohesion.\n\nEchoing the principle, Bhadharai zvamunotenga nenzira dzakanaka, Mabhunu champions economic fairness. He insists on honest trade practices and the ethical handling of all resources, striving for a corruption-free Zimbabwe.\n\nCde Mabhunus moral compass is unwavering. He warns against immorality and misconduct, particularly in leadership roles. His call to avoid zvehupombwe (immorality) and to treat detainees with dignity reflects his commitment to justice and human rights.\n\nDrawing from the teachings of global revolutionaries like Mao Zedong, Mabhunu emphasizes the importance of discipline and education in building a resilient and self-aware community. Aya ndiwo mashoko akataurwa kare naivo Va Mao highlights his respect for historical wisdom in shaping the present.\n\nA Man of Action\n\nCde Nyokai E. Mabhunus leadership is not confined to words. He leads by example, engaging in grassroots initiatives that empower local communities. From organizing workshops on ethical leadership to launching campaigns for resource accountability, Mabhunus influence is tangible. His unwavering dedication has inspired many Zimbabweans to reflect on their role in building a united and prosperous nation.\n\nA New Dawn for Zimbabwe\n\nAs 2025 unfolds, Cde Nyokai E. Mabhunu stands as a beacon of hope and resilience. His mission is not just a call to action but a roadmap for a future where Zimbabwean values and aspirations take center stage. Under his leadership, the nation is poised to reclaim its identity, protect its resources, and chart a path of dignity and progress.\n\nCde Mabhunus message is clear: the struggle for a better Zimbabwe is not over. It demands discipline, unity, and an unwavering commitment to justice. Through his visionary leadership, the country is set to rediscover its strength and purpose, one principle at a time.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Cde Nyokai E. Mabhunu: The Torchbearer of Integrity and Discipline in Zimbabwe’s Mission, 2025 and Beyond. In a world where … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/cde-mabhunu-stopping-everything/\">Continue reading<span class=\"screen-reader-text\"> \"Cde Mabhunu Stopping Everything\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        },
        {
            "title": "Mnangagwa Goes on Leave, Appoints Mohadi as Acting President",
            "url": "https://www.zimeye.net/2024/12/31/mnangagwa-goes-on-leave-appoints-mohadi-as-acting-president/",
            "content": "By A Correspondent\n\nIn a move that highlights ongoing power dynamics within Zimbabwes ruling Zanu PF party, President Emmerson Mnangagwa has announced he will begin his annual leave on December 31, lasting until early February.\n\nIn a statement issued on Monday, Acting Chief Secretary to the President and Cabinet, George Charamba, confirmed the details of Mnangagwas leave.\n\nThe President plans to spend his vacation in the country and will be available for commitments requiring his personal attention as State President and SADC Chairperson, Charamba said.\n\nDuring Mnangagwas absence, Vice President Kembo Mohadi will take over as Acting President.\n\nVice President Kembo Mohadi will be the Acting President from this Tuesday until the 19th of January, Charamba explained. After that, Vice President General (Retired) Dr. Constantino Chiwenga will assume the role of Acting President until President Mnangagwa returns in early February.\n\nThe decision to rotate the acting presidency between Mohadi and Chiwenga has fueled speculation about internal power struggles within Zanu PF, with observers closely monitoring the movements of the countrys leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that highlights ongoing power dynamics within Zimbabwe’s ruling Zanu PF party, President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/mnangagwa-goes-on-leave-appoints-mohadi-as-acting-president/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Goes on Leave, Appoints Mohadi as Acting President\"</span></a></p>",
            "time": "06:28",
            "date": "01 Jan 2025"
        }
    ]
}