{
    "news": [
        {
            "title": "Pictures: Injured South African Soldiers In DRC",
            "url": "https://www.zimeye.net/2025/02/02/pictures-injured-south-african-soldiers-in-drc/",
            "content": "GOMA, DRC South African Defence Minister Angie Motshekga has visited members of the South African National Defence Force (SANDF) stationed in Goma, Democratic Republic of Congo (DRC), following last weeks deadly attack by M23 rebels.\n\nThe minister, accompanied by senior military officials, toured a field hospital where dozens of injured SANDF members are receiving medical treatment after a fierce two-day battle.\n\nThirteen soldiers were killed when the rebels launched a large-scale assault aimed at capturing Goma, the capital of North Kivu province.\n\nThe South African troops were part of theSouthern African Development Community Mission in the DRC (SAMIDRC), a regional peacekeeping force deployed to stabilise the conflict-ridden eastern DRC.\n\nThe mission was endorsed at theSADC Extraordinary Summit in Harare in May 2023, where regional leaders committed to deploying forces to curb the resurgence of armed groups, particularly M23.\n\nThe Harare summit came amid growing concerns over escalating violence in the DRC, with SADC leaders reaffirming their commitment to restoring stability in the mineral-rich but conflict-prone eastern provinces.\n\nThe bloc pledged a military intervention underSAMIDRC, following the failure of diplomatic efforts to broker peace between the DRC government and the M23 rebels.\n\nSouth Africa, alongside Tanzania, Malawi, and Angola, committed troops to the mission, replacing theEast African Community Regional Force (EACRF), which withdrew in late 2023 due to operational and political challenges.\n\nThe SANDF contingent, deployed in December 2023, has been engaged in combat operations alongside theCongolese Armed Forcesand other regional troops.\n\nLast weeks clashes erupted as M23 rebels launched an aggressive offensive, attempting to seize key positions in Goma.\n\nSANDF forces, supported by regional allies, mounted a determined defence, managing to repel the rebels but suffering heavy casualties.\n\nDespite the setbacks, South Africa remains committed toSAMIDRCs mandate, with Defence Minister Motshekga reaffirming Pretorias support for peace efforts in the region. Our troops are here to fulfil an important mission, and their sacrifices will not be in vain, she stated during her visit.\n\nTheMarch 23 Movement (M23), a Tutsi-led rebel group, has been a persistent destabilising force in eastern DRC since its resurgence in 2021.\n\nThe group claims that Kinshasa failed to honour a2009 peace agreement, which promised political integration and military amnesty for its fighters.\n\nBacked by intelligence reports alleging support fromRwanda, M23 has captured vast territories, forcing hundreds of thousands to flee their homes.\n\nThe conflict has strained relations betweenKinshasa and Kigali, with DRC PresidentFlix Tshisekedirepeatedly accusing Rwanda of sponsoring the rebelsallegations that Rwanda denies.\n\nThe African Union (AU), United Nations (UN), and SADC have called for a peaceful resolution, but military engagement has remained the primary approach.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "GOMA, DRC – South African Defence Minister Angie Motshekga has visited members of the South African National Defence Force (SANDF) stationed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/pictures-injured-south-african-soldiers-in-drc/\">Continue reading<span class=\"screen-reader-text\"> \"Pictures: Injured South African Soldiers In DRC\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "ZRP Wary Of Rising Cases Of Drug Abuse In Bulawayo",
            "url": "https://www.zimeye.net/2025/02/02/zrp-wary-of-rising-cases-of-drug-abuse-in-bulawayo/",
            "content": "By A Correspondent\n\nA growing concern over drug abuse among learners in Bulawayo has prompted a multi-stakeholder campaign to address the issue. The campaign, held at Egodini terminus, aimed to raise awareness and curb the behavior of students who gather at the terminus to smoke dagga and drink alcohol.\n\nAccording to Assistant Inspector Nomalanga Msebele, Bulawayos acting Police Spokesperson, the learners behavior becomes unruly and often leads to fights when they are under the influence. The campaign was a collaborative effort between the Bulawayo police, the Ministry of Primary and Secondary Education, and the Bulawayo Public Transporters Association (Bupta).\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A growing concern over drug abuse among learners in Bulawayo has prompted a multi-stakeholder campaign to address … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/zrp-wary-of-rising-cases-of-drug-abuse-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Wary Of Rising Cases Of Drug Abuse In Bulawayo\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "PSL Rewards Top Fan…",
            "url": "https://www.zimeye.net/2025/02/02/psl-rewards-top-fan/",
            "content": "The Castle Lager Premier Soccer League (PSL) has recognized and rewarded its most dedicated fan, Mayibongwe Mgijimi Mkhweli, for his unwavering support throughout the season.\n\nIn a gesture of appreciation, the PSL presented Mkhweli with an impressive array of prizes, including a cash reward of US$500, a cooler box, a braai stand, and a camp chair.\n\nThis acknowledgement is a testament to Mkhwelis passion and commitment to the beautiful game, and the PSLs efforts to engage with and reward its loyal fan base.\n\nThe PSLs Fan of the Season award is a prestigious recognition of the enthusiasm and dedication that fans like Mkhweli bring to the sport. By rewarding its top fan, the PSL aims to foster a stronger connection with its supporters and create a more inclusive and exciting football experience.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Castle Lager Premier Soccer League (PSL) has recognized and rewarded its most dedicated fan, Mayibongwe “Mgijimi” Mkhweli, for his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/psl-rewards-top-fan/\">Continue reading<span class=\"screen-reader-text\"> \"PSL Rewards Top Fan…\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "Mnangagwa Names Law School After Himself, Raising Concerns Over Power Consolidation",
            "url": "https://www.zimeye.net/2025/02/02/mnangagwa-names-law-school-after-himself-raising-concerns-over-power-consolidation/",
            "content": "By A Correspondent\n\nIn a move sparking mixed reactions, President Emmerson Mnangagwa has named a new law school after himself, reinforcing his influence in both Zimbabwes political and educational sectors. The E.D. Mnangagwa Law School, currently under construction at Midlands State University, is poised to become a premier institution for legal education in the region once completed.\n\nAt 65% completion, the school is expected to be operational by August.\n\nDuring a recent site visit, Hon. Ministers Owen Ncube and Jenfan Muswere commended the progress of the project, which will include several key expansions. This is a showcase of the progress we are making under the visionary leadership of President Mnangagwa, Ncube stated, emphasizing the schools state-of-the-art facilities, including a moot court and an extensive library resource center.\n\nThe law school is part of Mnangagwas larger strategy to strengthen Zimbabwes legal education and support the countrys long-term goals, as outlined in Resolution Number 1. This is a clear demonstration of our commitment to educational advancement and legal reform, Muswere added during the tour.\n\nWhile the law school is viewed as a positive step forward for Zimbabwes educational infrastructure, critics argue that naming the institution after himself may signal Mnangagwas unwillingness to relinquish power. His involvement in shaping Zimbabwes legal framework, coupled with the law school bearing his name, has raised concerns about the growing centralization of authority.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move sparking mixed reactions, President Emmerson Mnangagwa has named a new law school after himself, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/mnangagwa-names-law-school-after-himself-raising-concerns-over-power-consolidation/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Names Law School After Himself, Raising Concerns Over Power Consolidation\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "When Will Government Stop The Blame Game ?",
            "url": "https://www.zimeye.net/2025/02/02/when-will-government-stop-the-blame-game/",
            "content": "By A Correspondent\n\nZimbabwes economic crisis continues to worsen, and Finance and Investment Promotion Minister Mthuli Ncubes recent remarks about the role of the informal sector offer little hope for resolution.\n\nNcube placed blame on the informal sector for the difficulties supermarkets are facing, claiming it is the competition from the informal sector that is exacerbating the situation. However, this explanation fails to address the deeper systemic issues at play.\n\nIn a statement released on Friday, Ncube argued that the economic troubles stem from informal traders who are bypassing formal retail channels. Since the beginning of 2023, some manufacturers have been opting to supply their goods directly to customers and informal retailers, bypassing wholesalers and retailers, he said. According to Ncube, this practice has put formal businesses in direct competition with the informal sector, which operates outside of formal regulations, including taxes and labour laws. This, he asserts, has led to the closure of some supermarkets and stores.\n\nHowever, while Ncubes comments focus heavily on the informal sector, they overlook the internal failures of formal businesses. He acknowledged that poor management and poor corporate governance have contributed to the struggles of some large retail chains, leading to business closures. This raises the question: is it fair to solely blame informal traders for the crisis when formal businesses are also facing significant challenges due to mismanagement?\n\nNcubes statements come in the context of a worsening economic situation in Zimbabwe, where rising inflation, high unemployment, and unsustainable living costs continue to drive many businesses and individuals toward the informal economy. Despite efforts by the government to tackle the issue, such as the introduction of a 5% withholding tax on unregistered micro and small enterprises (MSMEs) and a reduction in the VAT registration threshold, the informal sector remains a substantial force in the economy.\n\nTo address the impact of informal trading, Ncube outlined measures in the 2024 Mid-Term Budget and the 2025 National Budget, including the mandatory use of Point-of-Sale (POS) machines by all informal traders and a crackdown on goods deemed smuggled. While these measures may contribute to improving compliance, they fail to address the underlying issues facing both formal and informal sectors. In his statement, Ncube also proposed additional actions, such as leveling the playing field between formal and informal businesses and enforcing collaboration between Local Authorities and Central Government in the licensing and enforcement processes.\n\nYet, the central issue remains unaddressed: the governments failure to create an environment where formal businesses can thrive, and where the informal economy is better integrated into the national economy rather than treated as a scapegoat.\n\nResearch and consultations indicate that some of the reasons formal businesses are experiencing distress include competition from the informal sector, poor management, and poor corporate governance, Ncube said. Yet, the constant focus on competition from the informal sector diverts attention from the real need for a comprehensive economic overhaul.\n\nThe governments proposals include enforcing international best practices for tax compliance, strengthening enforcement through a Domestic Interagency Enforcement Team, and introducing additional incentives to support local industry. However, these measures might not be enough to tackle the root causes of Zimbabwes ongoing economic crisis.\n\nIn conclusion, while Mthuli Ncube has proposed several steps aimed at formalizing the informal sector and promoting tax compliance, the economic crisis in Zimbabwe cannot be solved by simply blaming the informal economy. A more holistic approach is neededone that addresses poor governance, supports business growth in both the formal and informal sectors, and ultimately creates a sustainable economic environment for all Zimbabweans. As the country moves toward Vision 2030, it is clear that without deeper structural reforms, the crisis will persist.\n\nMinister Mthuli Ncubes focus on external factors, while important, misses the bigger picture, and its time for a shift in focus toward real economic solutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s economic crisis continues to worsen, and Finance and Investment Promotion Minister Mthuli Ncube’s recent remarks about … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/when-will-government-stop-the-blame-game/\">Continue reading<span class=\"screen-reader-text\"> \"When Will Government Stop The Blame Game ?\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "CBZ Retrenches Staff Amid Economic Crisis",
            "url": "https://www.zimeye.net/2025/02/02/cbz-retrenches-staff-amid-economic-crisis/",
            "content": "By A Correspondent\n\nThe financial struggles in Zimbabwe continue to worsen as the Commercial Bank of Zimbabwe (CBZ) reportedly retrenches a significant number of employees. A leaked internal memorandum reveals the depth of the banks ongoing restructuring efforts, although it stops short of directly stating the scale of the layoffs.\n\nAccording to reports, employees affected by the retrenchment received their termination letters via email. The leaked information circular, dated February 1, 2025, sheds light on the banks approach to handling the situation, though it remains vague about the exact number of job cuts.\n\nThe circular, which was addressed to all staff members, reads: As we approach the final stage of the Papillon Restructuring Project, we would like to take a moment to acknowledge all staff for your commitment to the process. We appreciate your patience during this time of transition. Change is not easy, and we recognise the impact this might have had on each of you.\n\nThe banks communication also emphasizes the uncertainty facing employees, stating that by end of day today, each staff member will receive a letter through email outlining the outcome of this exercise. This indicates that employees were informed of their individual situations through the email distribution, with little room for in-person communication or direct discussion.\n\nThe bank assured its employees that support will be available to help navigate the transition, but it remains unclear what specific assistance will be provided. The circular also notes that more information will be forthcoming: We will be providing additional information during the month of February 2025, though this raises questions about the long-term plans and the future of the workforce.\n\nIn the face of Zimbabwes deepening economic crisis, CBZs move to reduce its workforce aligns with a broader trend seen in various industries across the country, where companies are struggling to stay afloat amid hyperinflation, currency instability, and a lack of foreign investment.\n\nFor now, the bank has urged staff members to reach out to their HR Business Partner for any further inquiries, but many employees are left grappling with the uncertainty of their job security.\n\nAs the restructuring process unfolds, the full impact on the banks operations and the broader economy remains to be seen. In the meantime, Zimbabweans continue to face mounting challenges as the countrys economic crisis intensifies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The financial struggles in Zimbabwe continue to worsen as the Commercial Bank of Zimbabwe (CBZ) reportedly retrenches … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/cbz-retrenches-staff-amid-economic-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"CBZ Retrenches Staff Amid Economic Crisis\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "Mnangagwa Plays Another Gambit To Hoodwink War Veterans",
            "url": "https://www.zimeye.net/2025/02/02/mnangagwa-plays-another-gambit-to-hoodwink-war-veterans/",
            "content": "By A Correspondent\n\nIn a controversial move that has raised eyebrows, Zimbabwes President Emmerson Mnangagwa has unveiled a $166,000 War Veterans Fund in Masvingo Province, a gesture many see as an attempt to shore up support from war veterans as he angles to remain in power beyond the constitutional limits.\n\nThe fund, launched in Chivi District, includes a $150,000 allocation directed towards the War Veterans Fund, an $11,400 non-refundable grant for war veterans, and an additional $5,000 designated for UBV (United Brotherhood of Veterans) members. This initiative is part of a broader strategy that will be rolled out across all 10 provinces, with Harare and Mashonaland East already benefiting from the program.\n\nIn the words of a Zanu PF source, who spoke on the condition of anonymity, The fund allocation includes $150,000 directed towards the War Veterans Fund, $11,400 non-refundable grant for war veterans, and $5,000 for UBV members. This program will be rolled out in all 10 provinces, with Harare and Mashonaland East already benefiting from the initiative.\n\nThe initiative follows the recent criticism of Mnangagwas leadership by war veteran Blessing Geza, who directly rebuked the president for attempting to undermine the Zimbabwean constitution in his bid for an extended presidency. Gezas defiance has heightened tensions within the ruling party and the war veterans community, as Mnangagwa seeks to consolidate power amid mounting scrutiny of his administration.\n\nMnangagwa, however, continues to defend his efforts, asserting that his long-term vision is to improve the living conditions of Zimbabweans through projects like the drilling of 35,000 boreholes in villages and the establishment of UBV programs. My vision is to improve the lives of all\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a controversial move that has raised eyebrows, Zimbabwe’s President Emmerson Mnangagwa has unveiled a $166,000 War … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/mnangagwa-plays-another-gambit-to-hoodwink-war-veterans/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Plays Another Gambit To Hoodwink War Veterans\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "Bulawayo Learners Gain Notoriety For Drug Abuse",
            "url": "https://www.zimeye.net/2025/02/02/bulawayo-learners-gain-notoriety-for-drug-abuse/",
            "content": "By A Correspondent\n\nA growing concern over drug abuse among learners in Bulawayo has prompted a multi-stakeholder campaign to address the issue. The campaign, held at Egodini terminus, aimed to raise awareness and curb the behavior of students who gather at the terminus to smoke dagga and drink alcohol.\n\nAccording to Assistant Inspector Nomalanga Msebele, Bulawayos acting Police Spokesperson, the learners behavior becomes unruly and often leads to fights when they are under the influence. The campaign was a collaborative effort between the Bulawayo police, the Ministry of Primary and Secondary Education, and the Bulawayo Public Transporters Association (Bupta).\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A growing concern over drug abuse among learners in Bulawayo has prompted a multi-stakeholder campaign to address … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/02/bulawayo-learners-gain-notoriety-for-drug-abuse/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Learners Gain Notoriety For Drug Abuse\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "Marriot Will Never Be Dynamos Founder Despite Court Ruling",
            "url": "https://www.zimeye.net/2025/02/01/marriot-will-never-be-dynamos-founder-despite-court-ruling/",
            "content": "Dynamos F.C.: The True Founder vs. The Legal Victory of Bernard Marriot Lusengo\n\nBy A Correspondent | The identity of Dynamos F.C.s true founder has been a point of contention in Zimbabwean football for years. Sam Dauya is widely recognized as the founder of Dynamos in 1963, having played a pivotal role in the clubs establishment. However, Bernard Marriot Lusengo, a long-time club administrator, has long claimed authority over the club, culminating in a bitter legal battle over Dynamos shareholding and governance.\n\nRecently, after a three-year-long court battle, Marriot was acquitted on charges of fraud related to acquiring a 51% shareholding in Dynamos. While his legal victory secured his control over the club, it does not change the fundamental factSam Dauya remains the rightful founder of Dynamos F.C.\n\nThis article delves into the origins of Dynamos, the legal dispute, and why history must not be rewritten.\n\nSam Dauya: The True Founder of Dynamos F.C.\n\nIn 1963, Sam Dauya formed Dynamos F.C. as a response to racial discrimination in Zimbabwean football. Black players were marginalized, and the disbanding of two black clubsSalisbury City and Salisbury Unitedleft talented players without a team. Dauya stepped up and:Drafted the clubs constitutionDesigned the Dynamos emblemBrought together players from the disbanded teamsLed the club into organized competition\n\nHis efforts laid the foundation for what would become Zimbabwes most successful football club.\n\nWhere Was Bernard Marriot in 1963?\n\nWhile Marriot has claimed to be part of the clubs formation, theres one simple historical fact that contradicts thishe was only 15 years old at the time. Born in 1948, he was too young to have played a leading role in forming a professional football club.\n\nDynamos was built by established players and administrators, with Sam Dauya at the helm. Marriot may have been a young follower of the team, but claiming to be a founding member is a distortion of history.\n\nMarriots Legal Victory: What It Means\n\nOn January 31, 2025, Harare magistrate Yeukai Dzuda ruled in favor of Bernard Marriot Lusengo, clearing him of fraud charges related to his acquisition of 51% shareholding in Dynamos. The case had dragged on for over three years, with two key complainantsDavid George and Ernest Kambapassing away before the verdict.\n\nKey Findings from the Court Judgment1.The Complainants Did Not Qualify as Founding MembersMagistrate Dzuda ruled that the complainants (Leslie Gwindi, Eric Mvududu, and others) were not part of the original Dynamos players of 1963.None of the complainants played for Dynamos during its formation in 1963, Dzuda stated.Since they did not qualify under the clubs 1963 constitution as founding members, their claim to shares was legally weak.2.The Court Did Not Find Evidence of Fraud Against MarriotThe State did not tender evidence to prove a charge of fraud against the accused person, therefore he is found not guilty and acquitted, ruled Dzuda.The court rejected the claim that Marriot had illegally allocated shares to non-original members.3.The 1963 Constitution Had Been RepealedMarriot successfully argued that the 1963 Dynamos constitution was repealed at a general assembly, and the club has since been run under its Articles of Association.This meant that the 1963 constitutionwhich gave every founding member one sharewas no longer valid in the courts eyes.4.The 2005 Supreme Court Ruling Was Not EnforcedThe complainants tried to use a 2005 Supreme Court order by Justice Luke Malaba, which directed Dynamos to revert to the 1963 constitution.However, the court found that this ruling was never fully implemented, allowing Marriot to maintain control over the club.5.Marriot Was the Only Recognized Surviving FounderMarriot claimed in court that he was the last surviving original member of Dynamos from 1963.With no strong legal opposition, the court accepted his position as the de facto leader of the club.\n\nDoes Marriots Legal Win Make Him the Founder of Dynamos?\n\nAbsolutely not. Winning a legal case does not change historical facts.\n\nWhile Marriot emerged victorious in court, this does not mean he founded Dynamos. The ruling focused on shareholding and governance issues, not on the clubs historical origins.\n\nLegal Victory  Historical TruthThe court did not declare Marriot as the founder.The ruling was based on legal technicalities, not historical accuracy.Sam Dauyas contribution remains undisputed in football history.\n\nThe Controversy Behind Marriots Control\n\nDespite his legal win, Marriots leadership has been marred by allegations of power grabs and questionable governance.He was accused of allocating shares illegally in 2017 and removing former members from the clubs administration.His opponents accused him of running Dynamos as a personal empire rather than a community-based club.There were allegations of him defying a High Court order and blocking legitimate stakeholders from participating in club governance.\n\nWhile Marriot walked out of court a free man, his legacy remains controversial among Dynamos divided fanbase.\n\nPreserving the True History of Dynamos F.C.\n\nThe verdict does not change the truthSam Dauya is the real founder of Dynamos.Sam Dauya established Dynamos F.C. in 1963.He drafted the clubs constitution and assembled its first squad.He provided a platform for black Zimbabwean footballers during colonial rule.Bernard Marriot was just 15 years old in 1963 and did not play a leading role.\n\nWhy It Matters\n\nFootball history should be based on facts, not legal victories. While Marriot remains a key figure in the clubs modern-day administration, his control over Dynamos should not erase Sam Dauyas contributions.\n\nWhile Bernard Marriot Lusengo has successfully defended his legal position as the majority shareholder of Dynamos, he is not its founder. The court ruling does not rewrite historySam Dauya remains the man who built Dynamos from the ground up in 1963.\n\nDespite the legal triumph, the controversy surrounding Marriots leadership continues, and many within the Dynamos community question the legitimacy of his control.\n\nAs football fans, we must ensure that the true history of Dynamos F.C. is preserved and honored. No legal battle, court ruling, or administrative takeover can change the fact that Dynamos Football Club exists today because of Sam Dauyas vision, leadership, and determination.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dynamos F.C.: The True Founder vs. The Legal Victory of Bernard Marriot Lusengo By A Correspondent | The identity of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/marriot-will-never-be-dynamos-founder-despite-court-ruling/\">Continue reading<span class=\"screen-reader-text\"> \"Marriot Will Never Be Dynamos Founder Despite Court Ruling\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        },
        {
            "title": "Zim Economy Collapses",
            "url": "https://www.zimeye.net/2025/02/01/zim-economy-collapses/",
            "content": "By Business Reporter-Thecountryseconomy is on the verge of collapse, with major retail shops and banks closing operations.\n\nSeveral prominent retail chains, including TM Pick n Pay, OK Zimbabwe, Spar, and N Richards, have either scaled down operations or shut down branches due to declining revenues and rising operational expenses.\n\nThe retail sector, which once employed thousands of Zimbabweans, has beenone ofthe hardest hit by the economic downturn.\n\nThe closure of multiple retail outlets has resulted in hundreds of job losses, compounding thecountrysunemployment crisis.\n\nZimbabweseconomic woesarelargely attributedto chronic inflation, which has eroded salaries and disposable incomes.\n\nThe ZiG continues to lose value against major foreign currencies, making it difficult for businesses to plan for the future.\n\nOne ofZimbabwesleading financial institutions, CBZ Holdings, has announced the retrenchment of 347 employees as part of its ongoing restructuring exercise.\n\nThe layoffs,whichwerefinalizedon January 31, 2025, mark the second phase of thebanksstrategic realignment to adapt toZimbabwesturbulent economic landscape.\n\nIn a statement issued on February 1, 2025, CBZ Holdings said the restructuringwas aimedat enhancing operational efficiency, strengtheningits market position, andensuringlong-term sustainability.\n\nThe bank had a staff complement of 1,448 before the so-called restructuring.\n\nCBZsdecision to downsize comes againstthe backdrop ofa struggling economy characterized by hyperinflation, liquidity shortages, and declining consumer spending.\n\nOver the past year, the country has witnessed a wave of business closures, particularly in the retail sector, as companies struggle to remain viable amid soaring costs and dwindling demand.\n\nThe Reserve Bank of Zimbabwe (RBZ) has attempted on several occasions to implement policy measures, including introducing a gold-backed digital currency and increasing interest rates, to stabilize the ailing financial system.\n\nHowever, these interventions have failed to curb inflationary pressures.\n\nCBZ Holdings is not the only financial institution facing difficulties.\n\nIn recent months, other banks and financial service providers have also been forced to restructure their operations due to reduced lending activity and shrinking profit margins.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter- The country’s economy is on the verge of collapse, with major retail shops and banks closing operations. Several prominent retail … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/zim-economy-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Economy Collapses\"</span></a></p>",
            "time": "08:40",
            "date": "03 Feb 2025"
        }
    ]
}