{
    "news": [
        {
            "title": "Man Brutally Kills Baby Mama",
            "url": "https://www.zimeye.net/2025/02/22/man-brutally-kills-baby-mama/",
            "content": "By A Correspondent\n\nSphamandla Khumalo is on trial for the murder of Nomfundo Msibi, the mother of his two children. According to prosecutor Krishen Shah, Khumalo planned and executed the fatal stabbing of Msibi in the parking lot of the Gateway shopping centre on August 4.\n\nThe Durban high court heard that Khumalo stabbed Msibi at least 22 times, with an okapi knife found lodged in her body. Khumalo pleaded not guilty to premeditated murder, claiming the stabbing was not intentional.\n\nVideo footage shown in court captured the final moments of Msibis life, depicting the couples quarrel and the fatal stabbing. Judge Jacqueline Henriques noted that while Khumalo admitted to stabbing Msibi, he maintained it was not his intention.\n\nJudgment in the case is expected on March 24.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Sphamandla Khumalo is on trial for the murder of Nomfundo Msibi, the mother of his two children. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/22/man-brutally-kills-baby-mama/\">Continue reading<span class=\"screen-reader-text\"> \"Man Brutally Kills Baby Mama\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "Corruption Destroying Economy, Not Sanctions, Opposition Activist Declares",
            "url": "https://www.zimeye.net/2025/02/22/corruption-destroying-economy-not-sanctions-opposition-activist-declares/",
            "content": "By A Correspondent\n\nFormer Citizens Coalition for Change (CCC) Councillor and Youth leader Arnold Batirai Dube has asserted that Zimbabwe is not under sanctions, but rather, the country is facing targeted restrictions imposed specifically on Zanu PF officials. Dube made the remarks in response to a recent news bulletin aired on the national broadcaster, emphasizing that the governments narrative about sanctions is misleading.\n\nZimbabwe is not on sanctions. We only have restricted measures. The regime is hiding behind the finger, Batirai Dube stated, pointing out that the countrys challenges are not a result of broad sanctions but rather targeted actions aimed at specific individuals.\n\nThis statement comes amid the European Unions (EU) decision to remove Zimbabwe Defence Industries (ZDI) from its list of sanctioned entities while maintaining its arms embargo on the country. The EU, in a statement released this Tuesday, confirmed the adjustment of its restrictive measures on Zimbabwe, extending them until February 2026. The delisting of ZDI marks a notable change, though the EU has made it clear that restrictions on arms and military equipment will continue, a measure that has been in place since 2002.\n\nIn light of the EUs decision, Zimbabwe continues to call for the unconditional and complete removal of the arms embargo, which it argues has hindered the countrys development for more than two decades. Despite this, Batirai Dubes comments suggest a shift in understanding, focusing on the narrower scope of the restrictions rather than a blanket sanction on the entire nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Citizens Coalition for Change (CCC) Councillor and Youth leader Arnold Batirai Dube has asserted that Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/22/corruption-destroying-economy-not-sanctions-opposition-activist-declares/\">Continue reading<span class=\"screen-reader-text\"> \"Corruption Destroying Economy, Not Sanctions, Opposition Activist Declares\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "Martin Mapisa Finds New Home",
            "url": "https://www.zimeye.net/2025/02/22/martin-mapisa-finds-new-home/",
            "content": "Sports Correspondent\n\nWarriors international Martin Mapisa has made a move to MWOS FC, following his departure from Dynamos. The goalkeeper has joined the Premier Soccer League (PSL) newcomers after spending a year with the Glamour Boys, having returned from Spain.\n\nMWOS FC confirmed Mapisas signing through a post on X, stating: MWOS FC welcomes Martin Mapisa, our new goalie, from Dynamos FC who is ready to make his mark.\n\nWe are excited to welcome Martin to the squad and look forward to seeing him between the posts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors international Martin Mapisa has made a move to MWOS FC, following his departure from Dynamos. The goalkeeper … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/22/martin-mapisa-finds-new-home/\">Continue reading<span class=\"screen-reader-text\"> \"Martin Mapisa Finds New Home\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "Shockwaves at Sojini Secondary: The Moment the Missing Money Was Discovered",
            "url": "https://www.zimeye.net/2025/02/22/shockwaves-at-sojini-secondary-the-moment-the-missing-money-was-discovered/",
            "content": "The humdrum of an ordinary school day at Sojini Secondary School in Mbembesi was abruptly shattered when a routine audit uncovered a financial discrepancy that would soon send shockwaves through the entire community. It all began when school chairman Arnold Nombembe, sifting through documents in the dimly lit bursars office, stumbled upon a withdrawal slip that bore his own signatureexcept, he hadnt signed it.\n\nHis pulse quickened. The slip authorized the withdrawal of US$1,220 from the schools bank account at Stanbic Bank. With mounting suspicion, Nombembe clutched the slip tighter, his mind racing through the possible explanations. Could this be a clerical error, or was something far more sinister at play?\n\nThe answer would soon emerge, leading straight to the schools headmaster, Themba Nyoni, who now stands accused of forging Nombembes signature. What followed was a whirlwind of investigations, culminating in Nyonis appearance in court on Thursday. But as the trial unfolds, the burning question remains: Did the headmaster truly steal, or is there another story waiting to be told?\n\nAs the pieces of this puzzling scandal come together, the community of Mbembesi watches closely, eager for the truth.\n\nDid This Headmaster Steal? Sojini Secondary Schools Themba Nyoni in Court Over Forgery Allegations.\n\nMbembesi, Matabeleland North  February 22, 2025\n\nThe headmaster of Sojini Secondary School, Themba Nyoni, appeared in court on Thursday facing allegations of forgery and theft involving school funds. Nyoni, aged 53, is accused of forging the signature of the schools chairman, Arnold Nombembe, to withdraw US$1,220 from the schools bank account.\n\nThe court proceedings, held before Bulawayo magistrate Beverly Madzikatire, revealed shocking details as forensic expert Kurauone Madzivanyika testified that Nombembes signature on the withdrawal slip was indeed forged. Nyoni has been remanded out of custody until March 6, when the trial will continue.\n\nAccording to the prosecution, led by Sehliselo Khumalo, the alleged crime took place on November 21, 2023. Nyoni purportedly used the forged signature to withdraw the funds at Stanbic Bank. The discrepancy came to light when Nombembe discovered the questionable withdrawal slip in the school bursars office.\n\nThe withdrawal slip was for US$1,220, Khumalo told the court, highlighting the gravity of the allegations.\n\nThis is not the first time Nyoni has been embroiled in controversy. Back in 2018, he faced legal action amid accusations of bullying and publicly berating teachers, even labeling them as useless. His leadership style was reportedly a source of friction, with subordinates accusing him of enforcing draconian measures at the school.\n\nThe critical question now looms: Did Nyoni steal from the school, or is this a case of misunderstanding or sabotage? As the trial progresses, parents, teachers, and the Mbembesi community are eagerly awaiting answers.\n\nStay tuned as we follow this developing story to uncover the truth behind the alleged forgery.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The humdrum of an ordinary school day at Sojini Secondary School in Mbembesi was abruptly shattered when a routine audit … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/22/shockwaves-at-sojini-secondary-the-moment-the-missing-money-was-discovered/\">Continue reading<span class=\"screen-reader-text\"> \"Shockwaves at Sojini Secondary: The Moment the Missing Money Was Discovered\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "Mnangagwa Is Staying:  Zanu PF Youth Leader",
            "url": "https://www.zimeye.net/2025/02/22/mnangagwa-is-staying-zanu-pf-youth-leader/",
            "content": "By A Correspondent\n\nZanu PF Youth League official Taurai Kandishaya has firmly dismissed claims that President Emmerson Mnangagwa is stepping down, stating that those spreading such rumors are merely fooling themselves.\n\nIn a heated statement made on Thursday, Kandishaya declared: Street kid rekuna 4th rakafunga kusara rega nemabin ese ndokunyepera vamwe varo kuti kunaCoppacabana kwaitika accident yetruck redelta nerelobels.\n\nMastreet kid ese akaburitsa misoro mumabin ekuna4th akatanga kumhanya akananga kwarehwa. Riya rekunyepa richiona speed neseriousness yaimhanyiwa nemamwe rakabva rangofunga kuti ahhh ko kana chiri chokwadi Nhaimi ndingatosaririre ndokutanga kumhanyawo richitevera kumashure.\n\nHe compared the spread of false rumors about Mnangagwas exit to a street child telling a lie and other gullible people beginning to believe it.\n\nKandishaya emphasized that the narrative was simply fabricated, stating: Kugadzira manyepo woatengesa vakapusa voatambira zvekuti iwewe wacho Unosvika pakutanga kubvuma manyepo ako.\n\nHe concluded by making it clear that President Mnangagwa was not going anywhere, adding: Well, President ED is not going anywhere. Mi maChinja nemi maG40 continue believing in your own lies.\n\nKandishayas comments come amidst ongoing rumors and speculation about the future of the Zimbabwean presidency. The youth leaders defiant stance underscores the Zanu PF partys commitment to Mnangagwas leadership, despite the growing opposition and speculation regarding his tenure.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Youth League official Taurai Kandishaya has firmly dismissed claims that President Emmerson Mnangagwa is stepping … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/22/mnangagwa-is-staying-zanu-pf-youth-leader/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Is Staying:  Zanu PF Youth Leader\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "Mnangagwa Appoints New Varakashi Leader",
            "url": "https://www.zimeye.net/2025/02/22/mnangagwa-appoints-new-varakashi-leader/",
            "content": "By A Correspondent\n\nPresident Mnangagwa has taken drastic measures against rogue elements within the Varakashi4ED Social Media Unit, a group of internet trolls employed by Zanu PF to attack its opponents .\n\nSix members of the unit have been fired for allegedly attacking senior party members, as announced by Patrick Chinamasa, the partys legal secretary and executive director of the unit.\n\nThe decision was made after Chinamasa met with President Mnangagwa to discuss disciplinary issues within the unit.\n\nChinamasa stated that the units leadership and senior party officials had been attacked by rogue elements, leading to the removal of Jonasi Mandiwisa Musara, Tafadzwa Mawire, Tinotenda Gachange, Felix Muzondo, Pardon Mangwende, and Herbert Mathe from the unit .\n\nThe Varakashi4ED Social Media Unit will now be the partys sole recognized social media affiliate, and a new administrator and director of operations have been appointed. Norman Mbimbi will take over as administrator, while Dereck Goto will serve as director of operations.\n\nThe existence of the Varakashi4ED Social Media Unit has long been rumored, but this is the first time proof has been obtained. The unit was established ahead of the 2023 harmonized elections, following President Mnangagwas directive.\n\nOne of the fired members, Jonasi Mandiwisa Musara, took to social media to announce his departure, stating that he would be focusing on his law studies and reducing his time on social media.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Mnangagwa has taken drastic measures against rogue elements within the Varakashi4ED Social Media Unit, a group … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/22/mnangagwa-appoints-new-varakashi-leader/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Appoints New Varakashi Leader\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "Mabel Chinomona Calls for Road Runner Economy By 2030",
            "url": "https://www.zimeye.net/2025/02/22/mabel-chinomona-calls-for-road-runner-economy-by-2030/",
            "content": "President Emmerson Mnangagwas girlfriend, Mabel Chinomona suggests he is no more president, in this@ZANUPF_Officialvideo clip. She says:Tine, 10 provinces as I remember it, yakataura kuti inoda kuti vaMnangagwa vawedzere hutongi hwavo, kusvika 2030, meaning from 2028,pic.twitter.com/5gY5inELrd\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "“Zimbabwe Not On Sanctions “",
            "url": "https://www.zimeye.net/2025/02/22/zimbabwe-not-on-sanctions/",
            "content": "By A Correspondent\n\nFormer Citizens Coalition for Change (CCC) Councillor and Youth leader Arnold Batirai Dube has asserted that Zimbabwe is not under sanctions, but rather, the country is facing targeted restrictions imposed specifically on Zanu PF officials. Dube made the remarks in response to a recent news bulletin aired on the national broadcaster, emphasizing that the governments narrative about sanctions is misleading.\n\nZimbabwe is not on sanctions. We only have restricted measures. The regime is hiding behind the finger, Batirai Dube stated, pointing out that the countrys challenges are not a result of broad sanctions but rather targeted actions aimed at specific individuals.\n\nThis statement comes amid the European Unions (EU) decision to remove Zimbabwe Defence Industries (ZDI) from its list of sanctioned entities while maintaining its arms embargo on the country. The EU, in a statement released this Tuesday, confirmed the adjustment of its restrictive measures on Zimbabwe, extending them until February 2026. The delisting of ZDI marks a notable change, though the EU has made it clear that restrictions on arms and military equipment will continue, a measure that has been in place since 2002.\n\nIn light of the EUs decision, Zimbabwe continues to call for the unconditional and complete removal of the arms embargo, which it argues has hindered the countrys development for more than two decades. Despite this, Batirai Dubes comments suggest a shift in understanding, focusing on the narrower scope of the restrictions rather than a blanket sanction on the entire nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Citizens Coalition for Change (CCC) Councillor and Youth leader Arnold Batirai Dube has asserted that Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/22/zimbabwe-not-on-sanctions/\">Continue reading<span class=\"screen-reader-text\"> \"“Zimbabwe Not On Sanctions “\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "ED Sees Large Billboard In Solidarity With Army Action Against Mnangagwa 2030",
            "url": "https://www.zimeye.net/2025/02/21/ed-sees-large-billboard-in-solidarity-with-army-action-against-mnangagwa-2030/",
            "content": "By A Correspondent | ZimEye | A moment at the 21st Movement function in Bulawayo: a large sign held aloft by a defiant attendee sent shockwaves through the hall where President Emmerson Mnangagwas youth supporters were campaigning for his extended presidency. The sign, boldly declaring Mash West in Solidarity with the Army, highlighted the growing rift within Zimbabwes ruling ZANU PF party and underscored the deepening discontent surrounding Mnangagwas controversial push to extend his rule to 2030.\n\nThe event, which was intended to showcase unwavering support for Mnangagwas leadership, instead became a focal point for opposition voices. The same Mashonaland West region that recently expelled war veterans Blessed Runesu Geza and Gifford Gomwe as punishment for opposing Mnangagwas 2030 agenda is now sending mixed signals. This open display of solidarity with the army, widely seen as a veiled challenge to Mnangagwas authority, has sparked intense speculation about the true allegiances of the regions political and military elites.\n\nAs Mnangagwa took to the stage, attempting to rally the crowd with the pro-regime anthem 2030 is Emmersons!, the signs presence loomed large. The image of the president dancing alone, accompanied only by Defence Minister Oppah Muchinguris half-hearted mimicry, contrasted sharply with the message of dissent that hung over the gathering. The atmosphere was palpably tense, as if the event had become a microcosm of the broader power struggle within Zimbabwes corridors of power.\n\nThis latest embarrassment comes as calls for Mnangagwa to step down in favor of his deputy, Constantino Chiwenga, grow louder. The partys own spokesperson, Christopher Mutsvangwa, recently acknowledged that Blessed Geza, the expelled war veteran, is a trained military tactician with a knack for reading the partys pulse. Geza has not shied away from demanding Mnangagwas immediate resignation, further emboldening those within the military and political establishments who are dissatisfied with the presidents maneuvers to cement his grip on power.\n\nFor many observers, the sign in solidarity with the army was more than just a statementit was a signpost on the road to a potential political showdown. As Mnangagwa dances alone on stage, the question now is whether he is dancing on the edge of his political tenure or if his steps are merely the prelude to an even tighter hold on power. One thing is certain: Zimbabwes political dance floor is becoming increasingly crowded, and not everyone is moving to Mnangagwas beat.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | A moment at the 21st Movement function in Bulawayo: a large sign held aloft … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/ed-sees-large-billboard-in-solidarity-with-army-action-against-mnangagwa-2030/\">Continue reading<span class=\"screen-reader-text\"> \"ED Sees Large Billboard In Solidarity With Army Action Against Mnangagwa 2030\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        },
        {
            "title": "Chinamasa Fires Six Pro-Chiwenga Varakashi Members",
            "url": "https://www.zimeye.net/2025/02/21/chinamasa-fires-six-pro-chiwenga-varakashi-members/",
            "content": "By Munachho Gwamanda-Zanu PF, legal affairs boss Patrick Chinamasa has fired six members of the Varakashi4ED.\n\nThe social media unit, is a group of internet trolls hired by the ruling party to attack its opponents and shape online discourse in favour of President Emmerson Mnangagwa.\n\nChinamasa, who serves as the executive director of the Varakashi4ED Social Media Unit, announced the dismissals in a letter dated February 11, 2025, addressed to the partys national political commissar, Munyaradzi Machacha.\n\nChinamasa revealed that the decision followed a high-level meeting with Mnangagwa on February 3 to discuss disciplinary concerns within the unit.\n\nOn February 3, 2025, I met with His Excellency, the President and First Secretary of Zanu PF, Cde Dr. E.D. Mnangagwa, to discuss disciplinary issues within the Varakashi4ED Social Media Unit, which I lead as the executive director, Chinamasa wrote. After reviewing serious infractions by rogue elements who attacked the units leadership and senior party officials, the following recommendations were made\n\nAs a result, Jonasi Mandiwisa Musara, Tafadzwa Mawire, Tinotenda Gachange, Felix Muzondo, Pardon Mangwende, and Herbert Mathe were permanently removed from the Varakashi4ED Social Media Unit.\n\nChinamasa also informed Machacha that Norman Mbimbi would now serve as the administrator of Varakashi4ED, while Dereck Goto would take on the role of director of operations.\n\nHe emphasized that the unit was established under Mnangagwas directive ahead of the 2023 harmonized elections.\n\nThe latest purge within the ruling partys online propaganda arm highlights deepening divisions in Zanu PF, particularly the ongoing power struggle between Mnangagwa and his deputy, Vice President Constantino Chiwenga.\n\nSince orchestrating the 2017 coup that ousted Robert Mugabe, the two men have maintained an uneasy alliance, with Chiwenga widely seen as a potential challenger to Mnangagwas hold on power.\n\nTensions between the two factions have been escalating, with Chiwengas military-aligned supporters increasingly frustrated by Mnangagwas consolidation of power.\n\nThe recent sackings within Varakashi4ED suggest a renewed effort by Mnangagwa to tighten his grip on the partys internal structures and control dissenting voices within the information machinery.\n\nIn previous years, Varakashi4ED has been used to target opposition figures, independent journalists, and even internal party members suspected of disloyalty.\n\nHowever, recent reports indicate that factional battles within the group have led to some members aligning with Chiwengas camp, using the platform to undermine Mnangagwas authority under the guise of promoting party interests.\n\nThe removal of the six members comes at a time when the battle for the 2028 elections is intensifying, with Chiwengas allies publicly positioning themselves to challenge Mnangagwas bid to extend his rule beyond 2028.\n\nThe move signals that Mnangagwa is unwilling to tolerate any dissent, even within his most loyal propaganda units.\n\nAs Zanu PF gears up for internal restructuring and potential succession battles, the fate of the Varakashi4ED unit remains uncertain. Whether the latest purge will strengthen Mnangagwas position or embolden Chiwengas allies to push back remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munachho Gwamanda-Zanu PF, legal affairs boss Patrick Chinamasa has fired six members of the Varakashi4ED. The social media unit, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/chinamasa-fires-six-pro-chiwenga-varakashi-members/\">Continue reading<span class=\"screen-reader-text\"> \"Chinamasa Fires Six Pro-Chiwenga Varakashi Members\"</span></a></p>",
            "time": "20:31",
            "date": "22 Feb 2025"
        }
    ]
}