{
    "news": [
        {
            "title": "More Women Reveal Falling Prey To ZAOGA Pastor Caught Pants Down",
            "url": "https://www.zimeye.net/2024/12/20/more-women-reveal-falling-prey-to-zaoga-pastor-caught-pants-down/",
            "content": "By Religion Reporter- Several women have come forward to share their experiences involving a senior ZAOGA pastor who was dismissed amid allegations of engaging in multiple extramarital affairs with married female congregants.\n\nThe said overseer was recently fired after a woman from Rusape reported him to the churchs headquarters in Harare for neglecting the two children they share.\n\nThe scandal deepened when another woman accused him of sexual harassment, claiming he had sent her explicit nude photos.\n\nDuring questioning, the pastor confessed to his misdeeds, leading to his dismissal.\n\nHowever, the case has sparked outrage across the church as more allegations of misconduct surfaced.\n\nThe pastor, who previously pastored at a city-centre church in Bulawayo, allegedly left a trail of misconduct.\n\nSources said several women, including widows, divorcees, and unmarried congregants, have come forward claiming he made inappropriate advances, including late-night visits and sending lewd photos.\n\nDespite these allegations, some cases were suppressed, reportedly due to his support from another named Pastor, who was based in Bulawayo.\n\nThis scandal has reignited longstanding concerns about corruption and immorality within ZAOGAs leadership.\n\nThe church could not be reached for comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Religion Reporter- Several women have come forward to share their experiences involving a senior ZAOGA pastor who was dismissed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/more-women-reveal-falling-prey-to-zaoga-pastor-caught-pants-down/\">Continue reading<span class=\"screen-reader-text\"> \"More Women Reveal Falling Prey To ZAOGA Pastor Caught Pants Down\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Liverpool to Face Tottenham in Carabao Cup Semi-Final",
            "url": "https://www.zimeye.net/2024/12/20/liverpool-to-face-tottenham-in-carabao-cup-semi-final/",
            "content": "Sports Correspondent\n\nThe draw for the Carabao Cup semi-finals has been made following the completion of the quarter-final matches.\n\nDefending champions Liverpool have been paired with Tottenham in the semi-finals.\n\nLiverpool, who hold a record 10 Carabao Cup titles, will first travel to Tottenham Hotspur Stadium for the opening leg, before hosting Spurs at Anfield for the return fixture.\n\nIn the other semi-final, Arsenal will take on Newcastle, with the first leg scheduled for the Emirates Stadium and the second leg at St James Park.\n\nThe first legs will take place during the week starting 6 January 2025, while the second legs will be held 28 days later in the week beginning 3 February 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The draw for the Carabao Cup semi-finals has been made following the completion of the quarter-final matches. Defending … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/liverpool-to-face-tottenham-in-carabao-cup-semi-final/\">Continue reading<span class=\"screen-reader-text\"> \"Liverpool to Face Tottenham in Carabao Cup Semi-Final\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "ZAOGA Bosses In Shocking Scandals",
            "url": "https://www.zimeye.net/2024/12/20/zaoga-bosses-in-shocking-scandals/",
            "content": "By Religion Reporter- Top executives within ZAOGA FIF (Zimbabwe Assemblies of God Africa), the Pentecostal church founded by Ezekiel Guti, arebeingaccused of selling leadership positions and fostering a culture of corruption and exploitation.\n\nAn ongoing investigation byZimEyehas revealed that since 2017, aspiring Overseers reportedly pay $1,000 for their positions, while promotions to District Pastor allegedly cost $500.\n\nSources familiar with the situation describe a troubling shift from merit-based appointments to a system driven by bribes and favouritism, prompting disillusioned pastors to leave the church in frustration.\n\nThe scandal hascast a spotlight onZAOGAs Transferring Board, which plays a pivotal role in leadership assignments.\n\nAllegations suggest that some senior pastors exploit their authority, engaging in predatory behaviour toward pastors wives in exchange for lucrative transfers or promotions.\n\nOne such case involves a pastor recently assigned to the UK after his wife was allegedly coerced into compliance by a senior leader.\n\nInsiders claim these issues are not new but reflect a deep-seated culture of corruption within ZAOGAs hierarchy.\n\nPast attempts to address immorality and abuse have reportedlybeen stifled, leading to mounting dissatisfaction among congregants and church officials alike.\n\nThe revelations have reignited longstanding concerns about the churchs moral integrity, with many calling foran overhaul ofits leadership.\n\nZimEyes year-long investigationis setto reveal further hidden cases of exploitation, casting an even harsher light on the top leaderships misconduct.\n\nOur efforts to get an official comment from church executives were fruitless as they were not reachable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Religion Reporter- Top executives within ZAOGA FIF (Zimbabwe Assemblies of God Africa), the Pentecostal church founded by Ezekiel Guti, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/zaoga-bosses-in-shocking-scandals/\">Continue reading<span class=\"screen-reader-text\"> \"ZAOGA Bosses In Shocking Scandals\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Aspiring ZIFA Presidential Candidate Denies Fraud Allegations",
            "url": "https://www.zimeye.net/2024/12/20/aspiring-zifa-presidential-candidate-denies-fraud-allegations/",
            "content": "Sports Correspondent\n\nPhilemon Machana, a former ZIFA board member and aspiring candidate for the associations presidency, has strongly denied allegations of financial misconduct and fraud. Machana describes the accusations as a malicious attempt to undermine his candidacy and damage his reputation.\n\nAs the highly anticipated ZIFA election approaches on January 25, tensions have risen, with the race described as one of the most closely watched since independence due to the high-profile candidates involved. Efforts to disqualify certain candidates have intensified, creating a contentious atmosphere.\n\nThis week, the ZIFA Ethics Committee, which will review candidates before announcing the final list on December 23, was presented with objections against Machana, popular cleric Walter Magaya, and Northern Region Soccer League chairman Martin Kweza. A letter from K. Mugadzaweta, also sent to the Zimbabwe Anti-Corruption Commission (ZACC), accused Machana of financial misconduct and fraud related to a forensic audit of ZIFAs finances from December 2018 to November 2021.\n\nIn response, Machana, through his legal team at Rubaya and Chatambudza Legal Practitioners, dismissed the allegations as unfounded and politically timed, noting that the complaints were lodged with ZACC only after the ZIFA election nominations had closed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Philemon Machana, a former ZIFA board member and aspiring candidate for the association’s presidency, has strongly denied allegations … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/aspiring-zifa-presidential-candidate-denies-fraud-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Aspiring ZIFA Presidential Candidate Denies Fraud Allegations\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "The Dangers of Following Too Closely on the Road",
            "url": "https://www.zimeye.net/2024/12/20/the-dangers-of-following-too-closely-on-the-road/",
            "content": "Drivers should always maintain a safe following distance, ensuring they do not tailgate or follow another vehicle more closely than is reasonable and prudent. This distance should be determined by factors such as the speed of the vehicles, traffic conditions, and the state of the road.\n\nMany rear-end collisions occur because drivers follow too closely, not allowing enough time to react in case of sudden stops or changes in traffic. Maintaining a safe distance can prevent such accidents and ensure safer driving for everyone on the road.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Drivers should always maintain a safe following distance, ensuring they do not tailgate or follow another vehicle more closely than … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/the-dangers-of-following-too-closely-on-the-road/\">Continue reading<span class=\"screen-reader-text\"> \"The Dangers of Following Too Closely on the Road\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mnangagwa Issues Chilling Warning To Zanu PF Members Over Social Media Abuse",
            "url": "https://www.zimeye.net/2024/12/20/mnangagwa-issues-chilling-warning-to-zanu-pf-members-over-social-media-abuse/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has strongly condemned the misuse of social media platforms by Zanu PF members to air the partys internal issues, calling for an immediate halt to the practice.\n\nHis remarks came during the 380th Ordinary Session of the Politburo, held at the Revolutionary Party HQ in Harare on Thursday.\n\nMnangagwa acknowledged that some members of his party had been using social media to expose internal divisions and conflicts, which he described as damaging to the partys unity and reputation.\n\nThis habit of using social media to attack the party must stop with immediate effect, Mnangagwa said firmly. Such behaviour is unacceptable.\n\nThe Zanu PF leader emphasized the importance of maintaining discipline within the party and adhering to its constitution, making it clear that internal disputes should be resolved within the party structures rather than on public platforms.\n\nThose who are doing it, spit on the ground and never do it again, Mnangagwa added, sending a stern message to party members who have been engaging in such behavior. Every party member must adhere to the party constitution.\n\nThe comments come amidst rising tensions within Zanu PF, where internal divisions have been increasingly evident. Social media, often a space for public debate, has become a battleground for party members to express their discontent, contributing to the deepening rift at the top levels of the ruling party.\n\nMnangagwas call to restore discipline within Zanu PF is seen as an effort to regain control over the partys narrative and prevent further damage to its image.\n\nHowever, his statement also raises questions about how the party intends to address the underlying issues fueling such public outbursts.\n\nWith political infighting growing, Mnangagwas warning signals a tough stance on party loyalty and unity in the face of mounting internal challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has strongly condemned the misuse of social media platforms by Zanu PF members to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/mnangagwa-issues-chilling-warning-to-zanu-pf-members-over-social-media-abuse/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Issues Chilling Warning To Zanu PF Members Over Social Media Abuse\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Sad: Toddler Drowns in Rubbish Pit in Epworth",
            "url": "https://www.zimeye.net/2024/12/20/sad-toddler-drowns-in-rubbish-pit-in-epworth/",
            "content": "By A Correspondent\n\nA heartbreaking incident occurred in Epworth, east of Harare, where a 1-year-old baby boy tragically drowned in a waterlogged rubbish pit. The Zimbabwe Republic Police (ZRP) confirmed the devastating event, which took place on December 18, 2024, near Corner Store, Overspill, Epworth.\n\nThe ZRP reports a sad incident in which a baby boy (1 year 4 months) drowned in a waterlogged rubbish pit on 18/12/24 at a house near Corner Store, Overspill, Epworth, Harare, said the ZRP in a post on their official X handle.\n\nAccording to the police, the toddler was playing outside while his mother was engaged in household chores when the tragedy struck. The incident occurred when the victim was playing outside the house while the mother was doing household chores, the police reported.\n\nThis tragic event has added to growing concerns about child safety, especially during the rainy season, when waterlogged areas pose increased risks. Drowning incidents involving children have become a cause for alarm, highlighting the need for greater awareness and preventive measures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A heartbreaking incident occurred in Epworth, east of Harare, where a 1-year-old baby boy tragically drowned in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/sad-toddler-drowns-in-rubbish-pit-in-epworth/\">Continue reading<span class=\"screen-reader-text\"> \"Sad: Toddler Drowns in Rubbish Pit in Epworth\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "ZESA Claims 13 New Power Stations Will End Load Shedding",
            "url": "https://www.zimeye.net/2024/12/20/zesa-claims-13-new-power-stations-will-end-load-shedding/",
            "content": "By A Correspondent\n\nThe Zimbabwe Electricity Supply Authority (ZESA) has promised that load shedding will soon be a thing of the past, citing the ongoing construction of 13 new power stations.\n\nThese 13 new power stations are either under construction or will be commissioned by 2025, ZESA said in a statement. These are not just plans; they are actual investments. Together, they will add 4,600 Megawatts to the grid, which is three times our current maximum demand.\n\nZESA further noted that with this significant increase in power generation, there may even be challenges in utilizing such a vast amount of electricity. We may face a situation where other countries are more eager to take advantage of this surplus power, the statement added.\n\nThe power authority also emphasized that by encouraging the informal sector to collaborate and share resources, they believe the load shedding issue will be resolved.\n\nWe have 13 new power stations either under construction or within 2025 they would have been commissioned.These are not plans,These are actual investments.They will aggregate to 4600Megawatts which is three times our maximum demand at the moment.We actually might have a challengepic.twitter.com/0cxcVKPx5k\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Electricity Supply Authority (ZESA) has promised that load shedding will soon be a thing of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/zesa-claims-13-new-power-stations-will-end-load-shedding/\">Continue reading<span class=\"screen-reader-text\"> \"ZESA Claims 13 New Power Stations Will End Load Shedding\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Biti Challenges Citizens to Resist Extension Of Mnangagwa’s Term Of Office",
            "url": "https://www.zimeye.net/2024/12/20/biti-challenges-citizens-to-resist-extension-of-mnangagwas-term-of-office/",
            "content": "By A Correspondent\n\nFormer Movement for Democratic Change (MDC) Secretary General, Tendai Biti, has called on Zimbabweans to resist any efforts by the Zanu PF government to extend President Emmerson Mnangagwas term in office.\n\nIn a bold statement this week, Biti warned of the unlawful and unconstitutional attempts to extend Mnangagwas presidency, describing it as the biggest fight for 2025. He declared:\n\nThe biggest fight we face in 2025 is the unlawful and unconstitutional attempts to force-march an extension of the Presidential Term Limit. They will pull no stops to achieve this nefarious agenda. We have to be ready to say no to fascism & authoritarian consolidation. #NoToA3Term.\n\nBiti also criticized the Zanu PF regimes tactics, accusing it of following a playbook aimed at consolidating power through deception and manipulation. He added:\n\nThe regime is a master of the 6 Ds modus operandi derived from an authoritarian playbook: DECEIVE, DELAY, DEFLECT, DENY, DENOUNCE, DESTROY.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Movement for Democratic Change (MDC) Secretary General, Tendai Biti, has called on Zimbabweans to resist any … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/biti-challenges-citizens-to-resist-extension-of-mnangagwas-term-of-office/\">Continue reading<span class=\"screen-reader-text\"> \"Biti Challenges Citizens to Resist Extension Of Mnangagwa’s Term Of Office\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Uniformed Top Cop Robbed In Mushikashika",
            "url": "https://www.zimeye.net/2024/12/20/uniformed-top-cop-robbed-in-mushikashika/",
            "content": "By Crime and Courts Reporter- A Morris Depot-based 42-year-old police officer has lost his service identity cards and cash after boarding a mushikashika.\n\nAssistant Inspector Dickson Mashada boarded a mushikashika in the CBD on his way home in Newlands.\n\nThe pirate taxi had two female passengers and a male passenger.\n\nHe lost US$420 on his way to Mukushi Depot.\n\nUpon reaching Harare Central Remand Prison, one of the female passengers grabbed him by the neck while the other produced a knife and ordered him to surrender his wallet.\n\nThe female passenger searched him and took away his wallet containing his police ID card, National ID card, bank cards and cash.\n\nThe robbers dumped Ass-Insp Mashada opposite Kebab Centre and drove away towards Newlands Shopping Centre at around 7 pm early this week.\n\nHarare provincial police spokesperson Inspector Luckmore Chakanza confirmed the case, urging people to avoid boarding private vehicles.\n\n-State media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- A Morris Depot-based 42-year-old police officer has lost his service identity cards and cash after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/20/uniformed-top-cop-robbed-in-mushikashika/\">Continue reading<span class=\"screen-reader-text\"> \"Uniformed Top Cop Robbed In Mushikashika\"</span></a></p>",
            "time": "18:29",
            "date": "20 Dec 2024"
        }
    ]
}