{
    "news": [
        {
            "title": "Government Laxity Enables Environmental Violations by Chinese Firm …",
            "url": "https://www.zimeye.net/2025/08/22/government-laxity-enables-environmental-violations-by-chinese-firm/",
            "content": "By A Correspondent\n\nThe Environmental Management Agency (EMA) has slapped a US$5,000 fine on Chinese-owned Labenmon Investments for breaching environmental regulations at its Wih-Zim Construction Material Investments cement plant in Magunje, Hurungwe District, Mashonaland West.\n\nThe penalty comes after EMA found that Labenmon Investments failed to comply with key conditions set in its Environmental Impact Assessment (EIA) Certificates (numbers L10000034346 and L10000099080) before starting construction at the site.\n\nThe violations were uncovered following an inspection in July, mandated by Chinhoyi High Court Judge Justice Philda Muzofa on 4 February 2025. Justice Muzofa had ordered EMA to investigate alleged breaches after residents of Chasara and Kapere villages complained that the company had encroached on their farming and grazing lands.\n\nDespite a court order halting further construction activities pending investigation, villagers reported that the company continued ground clearing and leveling 10 hectares, building staff quarters, and moulding bricks at the site. Residents filed a contempt of court application on 26 February 2025 with the assistance of Zimbabwe Lawyers for Human Rights lawyers Tinashe Chinopfukutwa and Kelvin Kabaya. The High Court has yet to rule.\n\nEMA confirmed that Labenmon Investments ignored critical EIA conditions, including relocating and compensating affected families and addressing the environmental impact of a diversion road on villagers fields. Additionally, the company had failed to obtain a Communal Lands Occupation certificate from Hurungwe Rural District Council, as required by law.\n\nCritics say the incident exposes systemic corruption and government negligence in enforcing environmental laws. It is shocking that a company can blatantly flout court orders and environmental regulations with no immediate consequences, said one affected villager, speaking on condition of anonymity. It feels like the authorities are protecting investors at the expense of ordinary people and the environment.\n\nAnother resident added, The governments laxity has encouraged these violations. We keep complaining, yet construction continues as if the law does not exist.\n\nEMA has ordered Labenmon Investments to halt all project activities until full compliance with EIA requirements is achieved and recommended continuous monitoring due to the projects high environmental impact.\n\nObservers warn that without stricter enforcement and accountability, foreign investors and local companies may continue exploiting loopholes, leaving communities vulnerable and Zimbabwes environment at risk.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Environmental Management Agency (EMA) has slapped a US$5,000 fine on Chinese-owned Labenmon Investments for breaching environmental … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/government-laxity-enables-environmental-violations-by-chinese-firm/\">Continue reading<span class=\"screen-reader-text\"> \"Government Laxity Enables Environmental Violations by Chinese Firm …\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "Chinese Miners Demolish Entire Farm Including Borehole",
            "url": "https://www.zimeye.net/2025/08/22/chinese-miners-demolish-entire-farm-including-borehole/",
            "content": "This field has been totally destroyed by Chinese miners accused by this farmer, Mr Israel Kapondoro.\n\nKapondoro narrates his ordeal to the Director of the Centre for Natural Resource Governance (CNRG), Farai Maguwu saying, his entire tomato farm has been demolished. They even crushed the borehole that was providing drinking food.\n\nHe alleges the Chinese miners boastedsaying no one will arrest them because they will just bribe EMA (environmental management authority) officials.\n\nZimEye has since written to @EMAeep asking if it can urgently provide an update over the case.\n\nThis field has been totally destroyed by Chinese miners accused by this farmer, Mr Israel Kapondoro.Kapondoro narrates his ordeal to the Director of the Centre for Natural Resource Governance (CNRG), Farai Maguwu saying, his entire tomato farm has been demolished. They evenhttps://t.co/IdbWdklUh6pic.twitter.com/B67QxbaFGA\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "This field has been totally destroyed by Chinese miners accused by this farmer, Mr Israel Kapondoro. Kapondoro narrates his ordeal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/chinese-miners-demolish-entire-farm-including-borehole/\">Continue reading<span class=\"screen-reader-text\"> \"Chinese Miners Demolish Entire Farm Including Borehole\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "CIO Probes Presidium Name Dropping in Harare Land Grabs",
            "url": "https://www.zimeye.net/2025/08/22/cio-probes-presidium-name-dropping-in-harare-land-grabs/",
            "content": "By A Correspondent-The Central Intelligence Organisation (CIO) has launched investigations into senior Zanu PF officials accused of fraudulently using the names of President Emmerson Mnangagwa and his deputies, Constantino Chiwenga and Kembo Mohadi, to seize and sell land in Harare.\n\nThe trio has been mentioned in a widening corruption scandal involving the illegal sale of land earmarked for the expansion of Robert Gabriel Mugabe International Airport.\n\nPresidential Affairs and Devolution secretary, Tafadzwa Mugutihimself a senior official linked to the CIOtold journalists this week that politically connected land barons were duping unsuspecting buyers by invoking the names of Mnangagwa, Chiwenga, and Mohadi to legitimise fraudulent deals.\n\nAs government, we will not stand by while people enrich themselves by abusing the names of our principals, Muguti said. Some of these individuals have even invaded the yellow and red zones of the airport. We dont care what position you hold in the party or governmentif you are committing crimes, abusing your office, and using the names of the President and Vice Presidents, vacate immediately. This is a criminal matter, and we will deal with it decisively.\n\nMuguti revealed that more than 140 sites across Harare had been illegally occupied as of last month, including land designated for the airport expansion.\n\nThe scandal follows revelations byThe Standardin July that Tourism and Hospitality deputy minister Tongai Mnangagwawho is also MP for Hunyaniattempted to regularise the stay of his supporters illegally settled on airport land. In a July 2, 2025 letter to the Civil Aviation Authority of Zimbabwe (CAAZ), Tongai Mnangagwa requested that settlers be allowed to remain within the airports restricted yellow zone.\n\nThis controversy is not new. In 2015, the late former President Robert Mugabe ordered the demolition of houses built by the Nyikavanhu Housing Cooperative near the airport, dismissing them as both a security threat and an eyesore. Yet despite such warnings, politically protected land barons have continued to fuel mushrooming illegal settlements along Airport Road.\n\nMuguti further accused Zanu PF bigwigs of abusing the partys letterhead to facilitate land grabs and extort money from businesses and individuals. Some people are writing letters on behalf of government. I want to caution them that we are onto them, he warned.\n\nHe also stressed that the governments ongoing Presidential Title Deeds Programme would not be used to sanitise criminal activities. Please stop the habit of selling land and then approaching government for regularisation. It will not happen under the Second Republic, Muguti declared.\n\nFor years, government has ordered audits to assess the extent of land theft in urban areas following the chaotic land reform programme two decades ago, but the findings have never been made public. In the meantime, Harare remains plagued by illegal settlements controlled by politically connected land barons, with repeated demolitions failing to stem the crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Central Intelligence Organisation (CIO) has launched investigations into senior Zanu PF officials accused of fraudulently using the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/cio-probes-presidium-name-dropping-in-harare-land-grabs/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Probes Presidium Name Dropping in Harare Land Grabs\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "VP Chiwenga, Mohadi Mentioned in Harare Land Corruption",
            "url": "https://www.zimeye.net/2025/08/22/vp-chiwenga-mohadi-mentioned-in-harare-land-corruption/",
            "content": "By A Correspondent-Senior Zanu PF and government officials, including Vice Presidents Constantino Chiwenga and Kembo Mohadi, have been implicated in a sprawling land scandal involving the illegal sale of land earmarked for the expansion of Robert Gabriel Mugabe International Airport.\n\nPresidential Affairs and Devolution secretary Tafadzwa Muguti told journalists this week that land barons and politically connected individuals were selling state land to unsuspecting buyers while invoking the names of President Emmerson Mnangagwa, Chiwenga, and Mohadi to legitimise their activities.\n\nAs government, we will not stand by while people enrich themselves by abusing the names of our principals, Muguti said. Some of these individuals have even invaded the yellow and red zones of the airport. We dont care what position you hold in the party or governmentif you are committing crimes, abusing your office, and using the names of the President and Vice Presidents, vacate immediately. This is a criminal matter, and we will deal with it decisively.\n\nMuguti revealed that more than 140 sites across Harare have been illegally occupied by land barons as of last month, including land reserved for the airport expansion.\n\nThe revelations come just weeks afterThe Standardexposed how Tourism and Hospitality deputy minister Tongai Mnangagwawho is also MP for Hunyanisought to regularise the stay of his supporters settled illegally on airport land. In a July 2, 2025 letter to the Civil Aviation Authority of Zimbabwe (CAAZ), Tongai Mnangagwa requested that the illegal settlers be allowed to remain within the airports yellow zone.\n\nThe airport land issue has a long history. In 2015, the late former President Robert Mugabe ordered the demolition of houses built by Nyikavanhu Housing Cooperative near the airport, branding them both an eyesore and a threat to development. Despite such interventions, illegal settlements along Airport Road continue to mushroom, driven by politically linked land barons.\n\nMuguti accused Zanu PF bigwigs of issuing fake letters bearing the ruling partys insignia to grab land and extort money from businesses and individuals. Some people are writing letters on behalf of government. I want to caution them that we are onto them, he warned.\n\nHe further stressed that the Presidential Title Deeds Programme would not be abused to legitimise illegal occupations. Please stop the habit of selling land and then approaching government for regularisation. It will not happen under the Second Republic, Muguti declared.\n\nFor years, government has commissioned audits to establish the extent of land theft in urban areas following the chaotic land reform programme two decades ago, but the findings have never been made public. Meanwhile, Harare continues to grapple with illegal settlements linked to Zanu PF-aligned land barons, with repeated demolitions failing to stem the tide.\n\n-NewsDay\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Senior Zanu PF and government officials, including Vice Presidents Constantino Chiwenga and Kembo Mohadi, have been implicated in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/vp-chiwenga-mohadi-mentioned-in-harare-land-corruption/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga, Mohadi Mentioned in Harare Land Corruption\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "Inroads in Mutangadura Murder Case?",
            "url": "https://www.zimeye.net/2025/08/22/inroads-in-mutangadura-murder-case/",
            "content": "By Crime and Courts Reporter  Police investigations into the brutal killing of prominent businessman Joseph Mutangaz Mutangadura have taken a dramatic twist amid leaked social media messages suggesting possible inside involvement.\n\nMutangadura, 67, was gunned down late Sunday night inside his 13-room farmhouse at Lisheen Estate in Ruwa. Initial police reports described the incident as a violent robbery, but fresh details now point to the possibility of an assassination.\n\nMessages circulating on social media, purportedly from a close family relative, claim that police seized the wifes cellphone and that hired gunmen unknowingly began demanding payment directly from detectives posing as her. One message alleged that of the seven attackers, one was captured in Gazebo while the other six were traced to Epworth.\n\nPolice have not confirmed the authenticity of the leaked messages, andZimEyeis still verifying the information.\n\nAccording to official police accounts, seven masked men armed with pistols, crowbars, and hammers overpowered a security guard before storming the house. They tied him up, demanded a description of Mutangadura, and went straight to his bedroom, where he was with his wife, Patience.\n\nDespite his reported offer to show them cash at an abattoir, the intruders shot him multiple times in the stomach and chest, killing him on the spot. Curiously, the gang left behind valuables and took only a cellphone worth about US$10  fueling suspicions that their mission was not robbery, but elimination.\n\nWhat is disturbing is that the gang was not after the money but the life of Joseph, a family member told reporters.\n\nPatience, who had only recently reunited with Mutangadura after a divorce, was rendered unconscious during the attack and later hospitalized. She is now under police protection. However, reports that her cellphone was confiscated by investigators have intensified speculation about possible insider links to the attackers.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the murder but maintained that it remains under investigation as a robbery-homicide. The value of stolen property is yet to be verified, he said.\n\nThe chilling precision of the attack mirrors a worrying trend of suspected contract killings that have plagued Zimbabwe since the 2017 coup, where victims are executed and little or nothing is stolen.\n\nMutangadura, who owned butcheries, Lisheen Estate, and the popular Mutangadura Hideout, was a towering figure in business circles in Ruwa and Harare. His violent death has shocked the community and left unanswered questions about who wanted him dead  and why.\n\nDetectives from the CID Homicide Unit are leading the manhunt for the killers. But with Patiences phone now in police custody and speculation mounting, relatives and residents are convinced this was no ordinary robbery, but a carefully planned assassination.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Police investigations into the brutal killing of prominent businessman Joseph “Mutangaz” Mutangadura have taken … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/inroads-in-mutangadura-murder-case/\">Continue reading<span class=\"screen-reader-text\"> \"Inroads in Mutangadura Murder Case?\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "US Issues Visa Application Update",
            "url": "https://www.zimeye.net/2025/08/22/us-issues-visa-application-update/",
            "content": "By A Correspondent-The United States embassy in Harare has suspended routine visa services until further notice, citing unresolved concerns with the Government of Zimbabwe. The embassy clarified in a notice issued this week that the pause does not amount to a travel ban and that holders of valid visas will not be affected.\n\nThe suspension, which took effect on August 7, 2025, applies to all visa categories except most diplomatic and official visas. It has disrupted travel, business, and education plans for many Zimbabweans who rely on US visas for academic programs, medical visits, and family connections.\n\nAlthough the embassys official statement did not detail the concerns, the US has previously raised issues around Zimbabwes high rate of visa overstaying. According to the US Department of Homeland Security, Zimbabwe had an overstay rate of 10.57% in 2023, one of the highest globally, and the numbers have been rising. Washington has repeatedly warned about visa misuse, stressing the need to protect the integrity of its immigration system.\n\nThe development adds another layer to the complex and often strained relations between Harare and Washington. Since the early 2000s, the US has maintained targeted sanctions against selected Zimbabwean officials and entities over alleged human rights violations, governance failures, and electoral irregularities. While Washington insists that the measures are not directed at ordinary Zimbabweans, Harare has long argued that US policies amount to broader economic sanctions that have crippled the countrys economy.\n\nDespite these tensions, people-to-people ties between the two countries have remained significant. Thousands of Zimbabweans live, study, and work in the US, contributing to remittances that have become a lifeline for the economy back home. American universities also attract a steady stream of Zimbabwean students, while US-based NGOs and foundations fund health, education, and governance programs in the country.\n\nThe suspension of visa services is therefore likely to cause widespread anxiety. Prospective students preparing for the new academic year, families planning reunions, and business professionals requiring travel are among those affected. The embassy has pledged to provide updates once discussions with the Zimbabwean authorities yield progress.\n\nFor now, Zimbabweans must wait and see when visa processing will resumea reminder of how diplomatic tensions between Harare and Washington continue to shape the daily lives of ordinary citizens.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The United States embassy in Harare has suspended routine visa services until further notice, citing unresolved concerns with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/us-issues-visa-application-update/\">Continue reading<span class=\"screen-reader-text\"> \"US Issues Visa Application Update\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "Fairfield Horror: Unidentified Man Found Mutilated in Bush",
            "url": "https://www.zimeye.net/2025/08/22/fairfield-horror-unidentified-man-found-mutilated-in-bush/",
            "content": "By A Correspondent\n\nPolice in Rusape are investigating a shocking case of murder after the body of an unidentified man was discovered in the bush near Village 13, Fairfield, Mufusire area of Headlands on 19 August 2025.\n\nAuthorities confirmed that the victims body was found with a detached hand and bruises on the buttocks, indicating he had been brutally assaulted before his death. A homemade knife was also recovered at the scene, believed to have been used in the attack.\n\nThe case has left the Fairfield community in shock, with police appealing to members of the public to assist in identifying the deceased and providing any information that could lead to the arrest of those responsible.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Police in Rusape are investigating a shocking case of murder after the body of an unidentified man … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/fairfield-horror-unidentified-man-found-mutilated-in-bush/\">Continue reading<span class=\"screen-reader-text\"> \"Fairfield Horror: Unidentified Man Found Mutilated in Bush\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "Family of Late Warriors Star Tendai Ndoro Requests Privacy During Mourning Period",
            "url": "https://www.zimeye.net/2025/08/22/family-of-late-warriors-star-tendai-ndoro-requests-privacy-during-mourning-period/",
            "content": "By A Correspondent\n\nThe family of former Zimbabwe Warriors forward Tendai Fire Ndoro has appealed to the public for respect and privacy as they mourn the passing of the beloved footballer.\n\nNdoro was found dead in his apartment in South Africa on Monday, leaving fans and the football community in shock.\n\nIn a heartfelt statement, the Ndoro family said:\n\nWe appreciate all the love, support, and condolences that have been extended to his family and loved ones. He was a man of the people and loved soccer with all his heart. We honour his achievements and his legacy, and with your support, he catapulted to great heights. We kindly ask that you allow us time to prepare for his send-off and to heal. Please respect the family as they grieve. All details for the memorial service will be communicated in due course.\n\nFans and fellow players have been urged to continue celebrating Ndoros life and contributions to Zimbabwean football, while allowing the family the space to grieve privately.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The family of former Zimbabwe Warriors forward Tendai “Fire” Ndoro has appealed to the public for respect … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/22/family-of-late-warriors-star-tendai-ndoro-requests-privacy-during-mourning-period/\">Continue reading<span class=\"screen-reader-text\"> \"Family of Late Warriors Star Tendai Ndoro Requests Privacy During Mourning Period\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "VP Mohadi Named In Land Grab",
            "url": "https://www.zimeye.net/2025/08/21/vp-mohadi-named-in-land-grab/",
            "content": "By A Correspondent Ruling Zanu PF party and government officials have been accused of illegally selling land earmarked for the expansion of the Robert Gabriel Mugabe International Airport to unsuspecting buyers, with Vice-President Kembo Mohadis name emerging among those allegedly cited by land barons to legitimise their schemes.\n\nPresidential Affairs and Devolution secretary Tafadzwa Muguti told journalists yesterday that individuals involved in the land deals were claiming to have the backing of top leaders, including President Emmerson Mnangagwa, Mohadi, and Vice-President Constantino Chiwenga.\n\nAs of last month, land barons had illegally occupied more than 140 sites across Harare, including areas within the RGM International Airport expansion zone, Muguti said. The President and government will not stand by while people enrich themselves using the names of our principals. This is no longer a civil matter  it is a criminal and security issue.\n\nHe warned that no official would be spared, regardless of rank: We do not care what position you hold in the party or government. If you are abusing office and the names of the President and Vice-Presidents to grab land, pack your things and vacate immediately. We will deal with it decisively.\n\nThis comes barely weeks afterThe Standardrevealed that Tourism and Hospitality deputy minister Tongai Mnangagwa  son of the President and MP for Hunyani constituency  sought to regularise the occupation of his supporters on land reserved for airport expansion. In a letter dated July 2, 2025, addressed to the Civil Aviation Authority of Zimbabwe (CAAZ), Tongai asked that settlements in the airports yellow zone be sanctioned.\n\nThe controversy has revived memories of 2015, when the late former President Robert Mugabe ordered the demolition of houses built by Nyikavanhu Housing Cooperative near the airport, calling them an eyesore and a security risk to airport development.\n\nMuguti further accused senior party members and government officials of abusing Zanu PF logos to write letters authorising land grabs and demanding payments from desperate home seekers and businesses.\n\nThis habit of pegging land and lying that the government has stopped demolitions must end, Muguti said. The Presidential Title Deeds Programme is not a certificate of authenticity for criminals. Land is not bought like sweets on the road.\n\nDespite repeated audits over the years to expose illegal land allocations in urban areas, the government has not made the findings public. Illegal settlements linked to powerful land barons remain widespread across Harare, with demolitions by the council failing to bring lasting solutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Ruling Zanu PF party and government officials have been accused of illegally selling land earmarked for the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/vp-mohadi-named-in-land-grab/\">Continue reading<span class=\"screen-reader-text\"> \"VP Mohadi Named In Land Grab\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        },
        {
            "title": "Shock as Mental Patient Runs Amok, Kills Five and Injures Two",
            "url": "https://www.zimeye.net/2025/08/21/shock-as-mental-patient-runs-amok-kills-five-and-injures-two/",
            "content": "Madlambuzi, Matabeleland South, was left in shock after a 43-year-old man ran amok, killing five people  including a 101-year-old man and a 97-year-old woman  and injuring two others.\n\nPolice investigations revealed that the suspect, identified as Phamani Sibanda, was armed with a Mopani log, a blunt object, and an unknown sharp weapon. He allegedly moved aggressively around the village, targeting anyone he came across.\n\nNational police spokesperson Commissioner Paul Nyathi told State media \n\nThe Zimbabwe Republic Police confirms the arrest of a suspected mental patient, Phamani Sibanda (43), in connection with the murder of five people and the attempted murder of two complainants, which occurred on 20 August 2025 in Madlambuzi, Matabeleland South Province, he said.\n\nThe suspect ran amok, became violent, and attacked seven people with a Mopani log, a blunt object, and an unknown sharp object while moving aggressively around the village. He was targeting anyone he came across. Subsequently, five people died on the spot while two others were injured.\n\nThe victims were identified as Elliot Khupe (101), Butho Tshuma (97), Constance Sibanda (66), Tiffan Surprise Ndlovu (6), and Catra Matsika (72). Their families have since confirmed their identities.\n\nTwo other victims  a 90-year-old woman and a 41-year-old woman  were rushed to Madlambuzi Clinic and Plumtree District Hospital where they are receiving treatment.\n\nComm Nyathi urged communities to be proactive in monitoring and supporting people with mental health challenges.\n\nThe Zimbabwe Republic Police implores the public to quickly refer mental patients to medical institutions for treatment and to monitor their medical process and general behaviour in order to curb violent tendencies, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Madlambuzi, Matabeleland South, was left in shock after a 43-year-old man ran amok, killing five people — including a 101-year-old … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/21/shock-as-mental-patient-runs-amok-kills-five-and-injures-two/\">Continue reading<span class=\"screen-reader-text\"> \"Shock as Mental Patient Runs Amok, Kills Five and Injures Two\"</span></a></p>",
            "time": "09:29",
            "date": "23 Aug 2025"
        }
    ]
}