{
    "news": [
        {
            "title": "High Court Nullifies Appointment Of Ms Zanele Khumalo As Chief Mabhikwa",
            "url": "https://www.zimeye.net/2025/11/29/high-court-nullifies-appointment-of-ms-zanele-khumalo-as-chief-mabhikwa/",
            "content": "By A Correspondent  The Bulawayo High Court has overturned the appointment of Ms Zanele Khumalo as Regent Chief Mabhikwa, ruling in favour of Mr John Khumalo, who contested the appointment on cultural and procedural grounds.\n\nJustice Mposeni Dube this week remitted the matter back to the Chiefs Council, emphasising that courts do not have jurisdiction over the appointment of traditional chiefs or regents. However, the ruling highlighted irregularities in how Ms Khumalos appointment was carried out.\n\nThe dispute over the rightful heir to the Mabhikwa chieftainship escalated when family members rejected Ms Khumalos elevation, citing cultural traditions that allegedly prevent women from assuming such roles. The court found that her appointment had been improperly handled, as some chiefs in her clan had overridden input from the Mabhikwa-Khumalo family.\n\nMr John Khumalo argued that the chieftainship in the family has historically never passed to a woman and claimed that Ms Khumalos appointment had caused widespread dissatisfaction among family members and the broader Lupane community.\n\nThe Mabhikwa chieftainship became vacant following the death of Chief Vusumuzi Khumalo in a tragic road accident on May 22, 2022. Initially, his uncle, John Khumalo, was appointed acting chief. Earlier this year, Ms Zanele Khumalo was named regent chief to serve for nine years, until Vusumuzis son, Wayne Makhosemvelo Khumalo, reached adulthood and assumed the position of substantive chief.\n\nThe ruling now returns the matter to the Chiefs Council, leaving the succession of the Mabhikwa chieftainship unresolved and underscoring the tensions between traditional customs and procedural governance in Zimbabwes leadership structures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Bulawayo High Court has overturned the appointment of Ms Zanele Khumalo as Regent Chief Mabhikwa, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/high-court-nullifies-appointment-of-ms-zanele-khumalo-as-chief-mabhikwa/\">Continue reading<span class=\"screen-reader-text\"> \"High Court Nullifies Appointment Of Ms Zanele Khumalo As Chief Mabhikwa\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "Celebrate Your Child Regardless Of Units They Got",
            "url": "https://www.zimeye.net/2025/11/29/celebrate-your-child-regardless-of-units-they-got/",
            "content": "BY DR MASIMBA MAVAZA | Grade Seven results are out, and parents must adopt a healthy perspective. Unconditional love and support are essential for a childs development and well-being. Celebrating their effort, progress, and resilienceeven in the face of failurehelps build their confidence and self-esteem. Children must never be compared; accept what they bring home and encourage them.\n\nBy acknowledging and embracing your childrens imperfections and mistakes, parents foster a growth mindset, encouraging them to take risks, learn from errors, and develop problem-solving skills. Striking the right balance between celebrating achievements and teaching children to learn from failures is crucial for their development.\n\nParents must focus on effort, not just results. Praise your childs hard work, persistence, and progress rather than only their grades. Grades are just numbers; your children have potentialsupport them and help them cultivate their success.\n\nEmphasise learning over grades. View failures and setbacks as opportunities for growth and learning.\n\nAs parents, we must use positive language. Focus on what your child did well, instead of dwelling on what they did wrong. Grade Seven is not everything. Encourage self-reflection in yourself and in your children. Help them reflect on their experiences, identifying what went well and what they can improve.\n\nModel a growth mindset and reassure them that they have potential. Share your own struggles and how you learned from them, demonstrating that mistakes are a natural part of learning. Celebrate progress, not just milestones. Acknowledge and appreciate small victories and steady improvement, not only major achievements.\n\nHave open conversations with your children. Talk to them about their feelings, fears, and disappointments, and offer guidance and support.\n\nBy adopting these strategies, parents help their children develop a healthy perspective on success and failure, raising resilient, motivated, and confident individuals.\n\nYour children have received their Grade Seven resultslet us prepare our hearts and minds to accept them.\n\nIt is harmful for parents to put pressure on their children or on themselves.\n\nEvery learner in Zimbabwe will be placed in a high school come January. That is where they will relaunch their academic journey.\n\nNot every child can get 6 unitsand that is perfectly normal. Do not compare children.\n\nWe must always remember how units work in Grade Seven:\n\n85%100% = 1 Unit77%84% = 2 Units70%76% = 3 Units60%69% = 4 Units50%59% = 5 Units\n\nThese children wrote six subjects. So a child getting 2 units per subject earns 12 units totalthis is not failure.A child getting 3 units per subject earns 18 units total. If your child has 18 units, that is a 3; celebrate your child.A child getting 4 units per subject earns 24 unitsstill not failing.This represents 60%69% in every subject. How is that failure?Even 5 units per subject30 units totalis still a pass at 50%59%.\n\nRemember: Grade Seven results simply show that your child is ready for high school, where grading becomes:\n\n75%100% = A60%74% = B\n\nSo let us thank God for our childrens results, whatever they receive between 6 and 30 units.\n\nEvery mark is a step forward. Every child has a future.\n\nRemember: your children have only you as their parents in the whole world.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BY DR MASIMBA MAVAZA | Grade Seven results are out, and parents must adopt a healthy perspective. Unconditional love and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/celebrate-your-child-regardless-of-units-they-got/\">Continue reading<span class=\"screen-reader-text\"> \"Celebrate Your Child Regardless Of Units They Got\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "Chamisa Tells Nation: “Hold On, Our Mountaintop Season Is Coming!”",
            "url": "https://www.zimeye.net/2025/11/29/chamisa-tells-nation-hold-on-our-mountaintop-season-is-coming/",
            "content": "Tinashe Sambiri Citizens leader Advocate Nelson Chamisa has urged Zimbabweans to remain hopeful and anchored in faith despite the countrys ongoing challenges, delivering a powerful Sabbath message centred on perseverance and divine promise.\n\nIn a statement released on Saturday, Chamisa encouraged the nation to look beyond present hardships and hold firmly to spiritual reassurance. He opened his message by quoting Habakkuk 3:1719, saying:Though the fig tree may not blossom, nor fruit be on the vines; though the labor of the olive may fail, and the fields yield no food; though the flock may be cut off from the fold, and there be no herd in the stalls  yet I will rejoice in the Lord, I will joy in the God of my salvation. The Lord God is my strength; He will make my feet like deers feet, and He will make me walk on my high hills.\n\nChamisa said this scripture captures the mindset Zimbabweans must adopt in difficult times. We hold on to the promise and confidently sing a song of triumph! he said. We have the faith and hope that when God is in it, all shall fall into place in His own time.\n\nHe stressed that faith becomes most meaningful when tested. Faith is to trust God even in the darkest hours and sharpest trials, Chamisa explained. Faith capacitates us to await the vindication of His actions and looks forward with conviction to the sure dawning and faithful fulfillment of the promised day of glory.\n\nChamisa assured citizens that adversity is not permanent. Our God will surely enable us to walk above the trials and sorrows of the times, just as a deer walks securely upon the edge of the giddiest precipice, he said. Although we go through the valley moment, our mountaintop season and experience surely comes!\n\nHe closed his message with a blessing for the nation: Blessed Sabbath! #JesusIsLord #Godisinit.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Citizens leader Advocate Nelson Chamisa has urged Zimbabweans to remain hopeful and anchored in faith despite the country’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/chamisa-tells-nation-hold-on-our-mountaintop-season-is-coming/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Tells Nation: “Hold On, Our Mountaintop Season Is Coming!”\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "Scott Sakupwanya Splashes Cash At State House Amid Zimbabwe’s Economic Woes",
            "url": "https://www.zimeye.net/2025/11/29/scott-sakupwanya-splashes-cash-at-state-house-amid-zimbabwes-economic-woes/",
            "content": "Tinashe Sambiri Zanu PF-linked businessman Pedzai Scott Sakupwanya has come under fire after spending US$65,000 on a basket at a fundraising dinner hosted by First Lady Dr Auxillia Mnangagwa at State House on Friday night. The basket, purchased through Sakupwanyas company Betterbrands, has ignited debate over the role of politically connected businessmen in Zimbabwe.\n\nPolitical commentators criticized the lavish spending, highlighting the stark contrast with the daily struggles of ordinary citizens. It is alarming that individuals accused of exploiting State resources can make such extravagant purchases while many Zimbabweans cannot meet basic needs, one analyst said.\n\nSakupwanya, along with other prominent businessmen such as Wicknell Chivayo and Kuda Tagwirei, has been accused of benefiting from close ties to President Emmerson Mnangagwa. These kinds of actions reinforce perceptions that wealth and opportunity are reserved for a politically connected few, another commentator noted.\n\nThe display of wealth has sparked discussions on transparency and accountability in State dealings. When citizens see millions being spent at elite gatherings while the majority struggle, it undermines trust in leadership and governance, one political observer added.\n\nAs the country faces ongoing economic hardship, Sakupwanyas extravagant purchase has intensified scrutiny over the ethical boundaries of wealth accumulation among those with political influence, raising questions about fairness and responsibility in Zimbabwes elite circles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF-linked businessman Pedzai Scott Sakupwanya has come under fire after spending US$65,000 on a basket at a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/scott-sakupwanya-splashes-cash-at-state-house-amid-zimbabwes-economic-woes/\">Continue reading<span class=\"screen-reader-text\"> \"Scott Sakupwanya Splashes Cash At State House Amid Zimbabwe’s Economic Woes\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "Mnangagwa Regime Defends Chinese Investors Despite Outcry Over Abuse Of Workers’ Rights",
            "url": "https://www.zimeye.net/2025/11/29/mnangagwa-regime-defends-chinese-investors-despite-outcry-over-abuse-of-workers-rights/",
            "content": "Tinashe Sambiri The Mnangagwa government has come under sharp criticism for publicly defending Chinese investors in Zimbabwe, even as reports of widespread abuse of workers rights continue to surface across various Chinese-run enterprises.\n\nSpeaking at the ChinaZimbabwe Friendship Scholarship Awards Ceremony and the 45th Anniversary Essay Contest celebrations in Harare on Friday, Higher and Tertiary Education, Innovation, Science and Technology Development Minister Dr Frederick Shava lauded Chinas support for Zimbabwes education and innovation sectors. He said the partnership is pivotal in advancing human capital development, strengthening industrialisation, and accelerating the countrys progress towards Vision 2030.\n\nDr Shava described the ChinaZimbabwe Friendship Scholarship programme as a tangible testament to this enduring relationship and insisted it demonstrates Chinas commitment not only to human capital development in Zimbabwe but also to our shared vision of advancing national development through skills, knowledge, and innovation.\n\nHowever, critics argue that the governments celebration of Chinese partnerships conveniently ignores ongoing labour abuses in Chinese-run companies operating in Zimbabwe. Reports have documented unsafe working conditions, underpayment, and exploitation of local employees, sparking protests and public outrage in multiple sectors.\n\nWhile the regime praises Chinese support in education and infrastructure, ordinary workers continue to bear the brunt of exploitation, said a labour rights activist who asked not to be named. It is deeply troubling that the government prioritises foreign investment over the rights and dignity of Zimbabwean workers.\n\nDr Shava also noted that scholarships for local students would enhance Zimbabwes capacity to build an innovation-driven and industrialised economy and that the Second Republic has placed human capital development at the heart of our national transformation agenda. Yet, critics contend that these long-term development goals offer little comfort to the workers facing immediate mistreatment in factories, mines, and construction sites run by foreign investors.\n\nThe government has repeatedly framed Chinese investment as essential to modernising Zimbabwe and accelerating progress towards Vision 2030, with Dr Shava praising support in infrastructure, agriculture, health, and technology. But the celebratory rhetoric has done little to address growing accusations of labour abuse and the perception that Zimbabweans are being sidelined in favour of foreign interests.\n\nThis is a government that applauds investors while turning a blind eye to the suffering of its citizens, the labour activist added. It is difficult to reconcile these scholarships and awards with the reality on the ground for ordinary workers.\n\nAs Zimbabwe continues to court Chinese investors, the tension between showcasing international partnerships and protecting local workers rights remains unresolved, raising questions about whose interests the Mnangagwa regime truly serves.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– The Mnangagwa government has come under sharp criticism for publicly defending Chinese investors in Zimbabwe, even as reports … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/mnangagwa-regime-defends-chinese-investors-despite-outcry-over-abuse-of-workers-rights/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Defends Chinese Investors Despite Outcry Over Abuse Of Workers’ Rights\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "Picture: Chivayo Reflects Firm Control Over the First Family?",
            "url": "https://www.zimeye.net/2025/11/29/picture-chivayo-reflects-firm-control-over-the-first-family/",
            "content": "Tinashe Sambiri Zanu PF tenderpreneur Wicknell Chivayo has triggered renewed debate after purchasing President Emmerson Mnangagwas trademark scarf for US$600 000 at a fundraising event. The extraordinary bid immediately raised questions about the motivations behind such high-value political donations and the growing trend of public displays of loyalty by business figures aligned with the ruling party.\n\nThe scarf  popularly referred to as the #EDscarf  was created by designer Celia Rukato of Chjaa Enterprises, which she operates with her mother. Although it has become a signature symbol of Mnangagwas image, its auction price has sharpened scrutiny around how politically connected entrepreneurs use grand financial gestures to solidify influence.\n\nZanu PF online activist Cleopas Mukungunugwa celebrated the purchase on Facebook, writing that a historic smile was shared today as Sir Wicknell Chivayo stood alongside the President and First Lady after his record-breaking purchase of the Presidential ED scarf USD 600 000. He added that the moment spoke to loyalty, patriotism, and the remarkable impact empowered Zimbabwean businessmen can make.\n\nMukungunugwa further highlighted Chivayos recent philanthropy, including a US$1 million donation to his former school, Dudley. He stated that one [dormitory] is to be named ED Mnangagwa and the other Auxillia Mnangagwa, describing this as evidence of Chivayos ongoing commitment to community upliftment.\n\nAnalytically, the episode underscores concerns about the relationship between wealth, political proximity, and public perception. Supporters view Chivayos actions as acts of generosity and national pride, but critics argue they reinforce a pattern of patronage and unequal access to power. In a country facing deep economic challenges, the optics of a US$600 000 scarf purchase continue to fuel debate about priorities, privilege, and the roles played by politically aligned business figures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Zanu PF tenderpreneur Wicknell Chivayo has triggered renewed debate after purchasing President Emmerson Mnangagwa’s trademark scarf for US$600 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/picture-chivayo-reflects-firm-control-over-the-first-family/\">Continue reading<span class=\"screen-reader-text\"> \"Picture: Chivayo Reflects Firm Control Over the First Family?\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "The Case Against a Ghost: Resolution Number 1 not yet a national document",
            "url": "https://www.zimeye.net/2025/11/29/the-case-against-a-ghost-resolution-number-1-not-yet-a-national-document/",
            "content": "By Shelton Muchena| There are moments in a nations life when the law is asked not to judge what is, but what some fear might be.\n\nThis week, Zimbabwes Constitutional Court found itself staring into that void, summoned to rule not on a law, not on a bill, not even on a formal proposal but on a political apparition.\n\nThe application landed with urgency and accusation, seeking to block a possible extension of President Emmerson Mnangagwas term beyond 2028.\n\nYet as Speaker of Parliament Jacob Mudenda made clear in his opposing affidavit, there was nothing tangible before the court.\n\nNo constitutional amendment had been gazetted. No bill had been placed before the Cabinet.\n\nNo motion had crossed the floor of Parliament.The legal machinery required by Section 328 of the Constitution had not even been switched on.\n\nWhat existed  and this is where critics say the applicants lost the plot  was merely a ZANU-PF party resolution, adopted at the ruling partys 2024 conference. An internal political position. A conversation among members. A declaration without legal force beyond the walls of the party itself.\n\nTo treat that resolution as law, critics argue, is to misunderstand both politics and the Constitution.Zimbabwes Constitution is unambiguous on two crucial points. First, under Section 58, every political party enjoys the right to freedom of association  the freedom to organise, to debate, to adopt positions, and yes, to pass resolutions without external interference. Second, under Section 328, constitutional amendments follow a strict, public, step-by-step process. Until that process begins, the courts have nothing to review.\n\nYet the applicants ran to court as though ZANU-PFs internal deliberations were already binding on the nation.\n\nLegal analysts describe the move as reckless  an attempt to provoke a judicial ruling in advance of any constitutional act, thereby collapsing the boundary between party politics and constitutional law. In doing so, they say, the applicants revealed a deeper flaw: they did not understand what they were challenging, nor the stage at which a challenge becomes lawful.\n\nZANU-PF, like any political party, is entitled to think out loud, to test ideas, to argue with itself. Its resolutions are made by ZANU-PF, for ZANU-PF. They are not legislative instruments. They are not public law. They are not automatically the nations business.\n\nTo interfere at that level, critics argue, is not constitutional vigilance  it is intrusion.\n\nThis was law chasing speculation, said one constitutional expert. The court was asked to rule on a future that has not arrived and a process that has not begun. That is not how constitutionalism works.\n\nMore unsettling, observers say, is the precedent such litigation seeks to create: a country where courts are invited to police political thoughts before they harden into action; where parties are denied the space to reason internally; where fear replaces process.\n\nThe Constitution does not authorise that. It restrains it.\n\nIn dismissing the challenge as premature, Speaker Mudendas affidavit quietly reasserts a principle too often forgotten in moments of political anxiety: the rule of law is not a tool for guessing intentions. It is a framework for judging actions.\n\nUntil ZANU-PF places a constitutional amendment before the nation, critics insist, its internal resolutions remain exactly what the Constitution permits them to be private party business. To rush to conclusions, to impose external interpretations, or to demand judicial intervention at this stage is to confess not vigilance, but confusion.\n\nIn constitutional democracies, timing is not a technicality. It is everything.\n\nAnd this case, many now say, was brought against a shadow a case against a ghost.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena| There are moments in a nation’s life when the law is asked not to judge what is, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/the-case-against-a-ghost-resolution-number-1-not-yet-a-national-document/\">Continue reading<span class=\"screen-reader-text\"> \"The Case Against a Ghost: Resolution Number 1 not yet a national document\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "When Compassion Meets System Failure: Zimbabwe’s Disability Dilemma",
            "url": "https://www.zimeye.net/2025/11/29/when-compassion-meets-system-failure-zimbabwes-disability-dilemma/",
            "content": "By Shelton Muchena| In Zimbabwe, the recent handover of wheelchairs and vehicles to persons living with disabilities at State House was meant to be a celebration of compassion.\n\nPhotographs of recipients smiling as they received new wheelchairs circulated widely, eliciting applause and gratitude. Yet behind the images lies a deeper, more challenging question: when assistance depends on proximity to power, who is left behind?\n\nBut they were only three in a country with more than 10% living with disabilities.\n\nFor many citizens living with disabilities, particularly in remote rural areas, travelling to Harare is neither easy nor feasible. Limited mobility, scarce transport, and financial constraints mean that centralised donations  however well-intentioned  often serve those who can physically reach the capital, rather than those most in need.\n\nInternational Lessons in Disability Support\n\nThe debate gained momentum on social media under the hashtag #weneedlegs, sparked by activist Torek Shire. His post highlighted that in countries such as the United Kingdom, the United States, Australia, Canada, Germany, and South Africa, organisations provide wheelchairs and other assistive devices without forcing citizens to beg for help. He cited the Wheelchair Alliance in the UK, the American Wheelchair Foundation, Wheelchairs for Kids in Australia, Knights of Columbus in Canada, Hardcore Help Foundation in Germany, and Gift of Givers in South Africa.\n\nWhile these organisations exist, Shires observation overlooks a crucial detail: in most of these countries, charity supplements strong government systems. In the UK, wheelchairs are provided through the National Health Service; in the US, Medicaid and state disability programmes form the backbone of support; Germany, Australia, and Canada operate robust national or provincial disability insurance schemes. Even South Africa pairs social grants with civil society organisations. Across these nations, assistance is structured, predictable, and rights-based  not left to chance or proximity.\n\nThe Ministerial Question\n\nInto this debate steps a subtle but important question: what is the role of Zimbabwes Minister of Youth? Public perception often equates visibility with productivity, but the ministrys mandate is primarily advocacy, empowerment, and outreach. It is not the statutory distributor of social welfare devices. That responsibility lies with the Department of Disability Affairs, under the Ministry of Public Service, Labour and Social Welfare.\n\nShould the Minister escort beneficiaries to the President to request donations? Or should the correct procedure be followed: a formal letter documenting the need, registered with the ministry, with donations subsequently channelled through the official structures?\n\nProper procedure is not mere bureaucracy. It ensures accountability, guarantees that resources reach the intended recipients, and safeguards against politicisation. Public visibility can inspire confidence, but governance is measured by outcomes once the cameras have left.\n\nThe MahereGreatman Exchange\n\nA telling example of procedure in practice emerged when Tongai Greatman Gwaze, founder of the Great Men Foundation, publicly requested 20 wheelchairs. Advocate Fadzayi Mahere responded, not with direct provision, but by emphasising institutional accountability. On social media, she wrote:\n\nIf government was implementing a sound Disability Policy, we would not see persons with disabilities on social media begging daily for wheelchairs.\n\nHer point was clear: urgent need does not replace proper procedure. Donations should be formally documented, registered with the Department of Disability Affairs, and distributed through official channels to ensure equity and traceability.\n\nAt the same time, the Vice-Presidents wife quietly donated 20 wheelchairs and US$2,000, moving tangible support into the hands of communities. While effective, such private acts underscore that humanitarian gestures, however impactful, cannot substitute systemic responsibility.\n\nIn this episode, all three actors were right in different ways. Greatman highlighted urgent need. Mahere advocated for procedure, legality, and equity. The Vice-Presidents wife acted compassionately and effectively, though ideally within the formal framework.\n\nBuilding Systems, Not Spectacles\n\nThe lesson is profound: true dignity lies not in receiving aid at the seat of power, but in never needing to approach it at all. Zimbabwes National Disability Policy provides a roadmap for institutional delivery:\n\nDonations of assistive devices must be registered with the Department of Disability Affairs.\n\nMinistries must ensure decentralised distribution so that rural communities are served.\n\nPublic transparency in handovers and monitoring protects beneficiaries and officials alike.\n\nOperational budgets should accompany donations to enable distribution, follow-up, and maintenance.\n\nBy following these principles, goodwill can translate into systematic, equitable, and lasting support, rather than isolated moments of charity.\n\nA Global Lesson\n\nZimbabwe is not alone in facing the challenge of translating compassion into systemic change. Across the world, governments and civil society must ensure that help is predictable, rights-based, and universally accessible. Acts of generosity are vital, but they must complement  not replace  institutional accountability.\n\nFor Zimbabweans living with disabilities, the goal is clear: help must travel to the people, not the other way around. In the end, the measure of a society is not in its handouts, but in the strength of its institutions, the dignity of its citizens, and the predictability of its care.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena| In Zimbabwe, the recent handover of wheelchairs and vehicles to persons living with disabilities at State House … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/when-compassion-meets-system-failure-zimbabwes-disability-dilemma/\">Continue reading<span class=\"screen-reader-text\"> \"When Compassion Meets System Failure: Zimbabwe’s Disability Dilemma\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "Tradition betrays justice as Bulawayo High Court nullifies Chief Khumalo’s appointment",
            "url": "https://www.zimeye.net/2025/11/29/tradition-betrays-justice-as-bulawayo-high-court-nullifies-chief-khumalos-appointment/",
            "content": "By Shelton Mahlangu Muchena| When the House of Mabhikwa was plunged into mourning after the tragic loss of their chief in 2022, those who loved him hoped for stability, a guiding hand until his son came of age.The clan entrusted leadership to MsZanele Khumalo born within the lineage, recognised by her family, and deemed worthy to serve as regent during this interim.Her appointment was not a radical departure from tradition, but a decision grounded in continuity, respect and shared grief.\n\nYet the arrival of the courts verdict dealt a harsh blow. The Bulawayo High Court annulled her appointment. The reasons cited culture, tradition, and procedural irregularities sound hollow when viewed against a broader Zimbabwean backdrop.Across the country, women have already stepped into the role of chief with dignity and success. Their very existence proves that tradition can evolve without disintegration.\n\nConsider the trailblazing female chiefs elsewhere: women who inherited chieftainship, were accepted by their communities, and fulfilled their duties with competence.These are not outliers but part of a growing trend proof that leadership in Zimbabwe need not be dictated solely by gender.If other clans have allowed women to lead with honour, why should the Mabhikwa family be denied that right? Why should the clans own decision made by those who know the history, the bloodlines and the communitys needs be overridden under the guise of rigid cultural norms?\n\nBy overturning MsKhumalos appointment, the court abandoned the clans autonomy and replaced it with a narrow, patriarchal interpretation of tradition. It has sent a signal that even when circumstances change when women are capable, accepted and supported old biases will remain entrenched. The judgment wasnt merely a legal ruling; it was an act of suppression disguised as justice.\n\nIf, instead, the elders had honoured their own choice and recognised MsKhumalo this would not have destroyed tradition. On the contrary, it would have affirmed that Zimbabwean customs are living, adapting and capable of upholding fairness. It would have recognised leadership as a matter of character, wisdom and service not anatomy.\n\nDenying her the chieftainship does not protect heritage; it erodes it. It proclaims that no matter how many times they change, some doors will remain shut to women. That is not tradition. That is prejudice.\n\nThe dispute over the Mabhikwa chieftainship is more than a family conflict it is a reflection of Zimbabwes broader struggle between rigid patriarchy and evolving equality; between outdated custom and human dignity. By rejecting MsKhumalo, the court did not preserve heritage. It dishonoured it.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Mahlangu Muchena| When the House of Mabhikwa was plunged into mourning after the tragic loss of their chief … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/tradition-betrays-justice-as-bulawayo-high-court-nullifies-chief-khumalos-appointment/\">Continue reading<span class=\"screen-reader-text\"> \"Tradition betrays justice as Bulawayo High Court nullifies Chief Khumalo’s appointment\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        },
        {
            "title": "Mthuli Triggers Prices of Basic Commodities",
            "url": "https://www.zimeye.net/2025/11/29/mthuli-triggers-prices-of-basic-commodities-2/",
            "content": "By A Correspondent  Prices of basic commodities are expected to rise sharply after Finance Minister Mthuli Ncube on Thursday increased the Value-Added Tax (VAT), piling more pressure on already struggling consumers.\n\nUnveiling the 2026 National Budget, Ncube hiked VAT to 15.5%, a move government says is necessary to raise an additional US$1.47 billion next year. Treasury projects total revenue collection of US$9.4 billion in 2026, up from this years US$7.93 billion.\n\nBut for ordinary citizens, the VAT hike spells deeper hardship. VAT is a consumption tax, meaning it is applied to almost every transaction involving goods and services  from groceries and toiletries to transport and household basics. Unlike income tax, which targets earnings, VAT hits everyone equally, regardless of their income level.\n\nThis means a low-income family buying mealie-meal or cooking oil will now pay more for the same basket of essentials, worsening the cost-of-living crisis. Businesses  especially in the formal sector  pass the tax directly to consumers, leading to immediate price increases across the retail chain.\n\nThe timing of the hike has also raised concern. It comes just as the Zimbabwe Tax Perception Survey 2025 revealed that nearly nine in ten citizens believe the tax burden far exceeds their ability to pay. Conducted by the Zimbabwe Taxpayers Platform, the survey showed widespread frustration with what many see as excessive taxation and a proliferation of statutory levies that erode disposable incomes and stifle business activity.\n\nAlthough government argues that the VAT increase will allow for a partial reduction of the intermediated money transfer tax (IMTT), analysts say any relief will be minimal compared to the impact on everyday purchases. The formal sector  which accounts for just23.9% of the compliant economy will continue to shoulder the administrative burden of collecting VAT, while the costs are ultimately borne by consumers across both the formal and informal sectors.\n\nWith salaries stagnant and inflation eroding spending power, the VAT hike is expected to triggeranother wave of price increases, deepening economic hardship for millions of Zimbabweans already living on the margins.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Prices of basic commodities are expected to rise sharply after Finance Minister Mthuli Ncube on Thursday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/29/mthuli-triggers-prices-of-basic-commodities-2/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Triggers Prices of Basic Commodities\"</span></a></p>",
            "time": "18:37",
            "date": "29 Nov 2025"
        }
    ]
}