{
    "news": [
        {
            "title": "WATCH LIVE: Tagwirei Going Nowhere, He Can Even Take Over State House If He Wants",
            "url": "https://www.zimeye.net/2025/07/20/watch-live-tagwirei-going-nowhere-he-can-even-take-over-state-house-if-he-wants/",
            "content": "video loading below\n\nCHIWENGA vs TAGWIREI   WITH MLISWAhttps://t.co/DqDh02qfrq\n\nKuda kana achida kutora chinhu, anochitora because mari anayo@TembaMliswahttps://t.co/pdqHFiI0Cb\n\nKuda kana achida kutora chinhu, anochitora because mari anayo@TembaMliswahttps://t.co/pdqHFiI0Cb\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "LIVE NEWS REVIEW- Chiwenga versus Tagwirei With Hon Mliswa",
            "url": "https://www.zimeye.net/2025/07/20/live-news-review-chiwenga-versus-tagwirei-with-hon-mliswa/",
            "content": "video loading below\n\nCHIWENGA vs TAGWIREI   WITH MLISWAhttps://t.co/DqDh02qfrq\n\nKuda kana achida kutora chinhu, anochitora because mari anayo@TembaMliswahttps://t.co/pdqHFiI0Cb\n\nKuda kana achida kutora chinhu, anochitora because mari anayo@TembaMliswahttps://t.co/pdqHFiI0Cb\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Rare Pictures Of Didymus Mutasa",
            "url": "https://www.zimeye.net/2025/07/20/rare-pictures-of-didmus-mutasa/",
            "content": "Power is temporaryThere was a time when Didmus Mutasa was the Manicaland God-Father. He used to bossfully say, \"kana Mugabe achigeza ndinenge ndakabata sipo\"Pple wld travel as far as Chipinge to his hse in Rusape, Nyanga Drive Road to hv their grievances addressed every weekendpic.twitter.com/xL0A4KDHRo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Chiwenga vs Tagwirei | LIVE WITH SABHUKU MLISWA",
            "url": "https://www.zimeye.net/2025/07/20/chiwenga-vs-tagwirei-live-with-sabhuku-mliswa/",
            "content": "Chiwenga versus Tagwirei, who's winning? | with Sabhuku@TembaMliswahttps://t.co/pdqHFiIyrJ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Zimbabwe Sables Secure Historic Rugby World Cup Spot After Stunning Namibia",
            "url": "https://www.zimeye.net/2025/07/20/zimbabwe-sables-secure-historic-rugby-world-cup-spot-after-stunning-namibia/",
            "content": "By Sports Correspondent\n\nKAMPALA  The Zimbabwe Sables have made history, qualifying for the 2027 Rugby World Cup after a dramatic 30-28 victory over Namibia in the Rugby Africa Cup final held in Kampala on Saturday.\n\nIn a tense and fiercely contested match, the Sables displayed remarkable resilience, tactical discipline, and unity to edge out their long-time rivals and reclaim the African crown. The win guarantees Zimbabwe the continents direct qualification spot for the upcoming World Cup in Australia.\n\nThis marks Zimbabwes first appearance at the Rugby World Cup since 1991, ending a 36-year drought and reigniting national pride in the sport.\n\nThis is a proud moment for Zimbabwean rugby, said one team official. The boys gave it their all, and their hard work and belief paid off.\n\nThe Sables journey to the final was marked by consistent performances and a growing belief that they could overcome Namibia, who had dominated African rugby for years. Saturdays final proved just how far Zimbabwe has come, with the team holding their nerve in the dying minutes to clinch a two-point win.\n\nThe result has sparked celebrations back home, with fans, former players, and officials hailing the victory as a turning point for rugby in the country.\n\nZimbabwe will now begin preparations for the 2027 Rugby World Cup, where they will aim to compete with the best teams on the global stage and inspire a new generation of rugby talent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent KAMPALA – The Zimbabwe Sables have made history, qualifying for the 2027 Rugby World Cup after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/20/zimbabwe-sables-secure-historic-rugby-world-cup-spot-after-stunning-namibia/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Sables Secure Historic Rugby World Cup Spot After Stunning Namibia\"</span></a></p>",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Pashor Sibanda on Advocate Chamisa: ‘He Represents Real Power and People’s Hope’",
            "url": "https://www.zimeye.net/2025/07/20/pashor-sibanda-on-advocate-chamisa-he-represents-real-power-and-peoples-hope/",
            "content": "By A Correspondent\n\nBULAWAYO  Former Cowdray Park Member of Parliament Pashor Sibanda has reaffirmed his strong support for opposition leader Nelson Chamisa, explaining his reasons in a candid interview with Change Radio.\n\nResponding to a question on why he continues to support Chamisa, Sibanda said the citizens leader commands authentic national backing, even in a hostile electoral environment.\n\nOver two million Zimbabweans have consistently backed President Chamisa in 2018 and 2023, not because the system allowed it, but in spite of a rigged electoral environment, Sibanda told Change Radio. That kind of organic national support cant be cooked  its a signal that the majority of citizens see him as the legitimate alternative to authoritarian rule.\n\nHe credited Chamisa for successfully challenging ZANU PFs grip on power following the death of MDC founder Morgan Tsvangirai.\n\nSince Tsvangirais passing, President Chamisa is the only opposition leader who has disrupted ZANU PFs hegemony and blocked them from securing a two-thirds majority. That alone has prevented further constitutional capture, he said.\n\nSibanda further praised Chamisa for ushering in a generational and ideological shift in Zimbabwean politics  one grounded in inclusivity.\n\nHes building a movement that embraces women, youth, the disabled, and every tribe and race in Zimbabwe. That vision isnt just political correctness  its the bedrock of true nation building, Sibanda emphasized.\n\nHe described Chamisa as more than just a politician, calling him a symbol of democratic resistance.\n\nHe represents a vision of Zimbabwe where power is accountable and leadership is a service, not an entitlement. Hes remained consistent in pushing for a new social contract and an economy that works for the many, not the connected few.\n\nConcluding the interview, Sibanda said Chamisa embodies the spirit of an unfinished liberation struggle.\n\nNot the one fought with guns, but the one were now fighting with ideas, courage and people power. He may not hold state power, but he holds the political imagination of millions  and thats where real power begins.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent BULAWAYO – Former Cowdray Park Member of Parliament Pashor Sibanda has reaffirmed his strong support for opposition … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/20/pashor-sibanda-on-advocate-chamisa-he-represents-real-power-and-peoples-hope/\">Continue reading<span class=\"screen-reader-text\"> \"Pashor Sibanda on Advocate Chamisa: ‘He Represents Real Power and People’s Hope’\"</span></a></p>",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Resist Forced Payment of ZBC Radio Licences, Says Former MP …",
            "url": "https://www.zimeye.net/2025/07/20/resist-forced-payment-of-zbc-radio-licences-says-former-mp/",
            "content": "By A Correspondent\n\nFormer Masvingo Central legislator Jeffryson Chitando has urged Zimbabweans to resist what he described as state-sponsored exploitation, following the enforcement of a new law compelling motorists to pay a Zimbabwe Broadcasting Corporation (ZBC) radio licence fee before renewing vehicle insurance or obtaining a ZINARA licence disc.\n\nChitando, who served under the banner of the Movement for Democratic Change (MDC), said the newly amended law was unjust and should be actively challenged by citizens.\n\nZimbabweans must resist this forced payment. It is immoral and unconstitutional to compel people to bankroll a broadcaster that serves the ruling elite while ignoring the voices of the people, he said in a statement last week.\n\nThe Broadcasting Services Amendment Act [Chapter 12:06] (No. 2 of 2025), which took effect this week, has already caused widespread outrage and confusion. Under the new law, a valid ZBC radio licence is now a mandatory requirement for accessing critical vehicle-related services.\n\nThe Zimbabwe National Road Administration (ZINARA) confirmed its compliance with the directive, stating:\n\nZINARA has now fully implemented the requirement in line with the Broadcasting Services Act.\n\nBut across the country, public anger is mounting. Citizens accuse the Mnangagwa-led administration of using coercion to sustain a state broadcaster that many see as partisan, out of touch, and lacking public trust.\n\nThis is nothing but a hidden tax, said a Harare motorist. We are being punished for refusing to consume propaganda. They want to make ZBC survive by force, even when no one wants to watch it.\n\nAnother resident added: Why should we be forced to pay for a service we dont use? This is extortion disguised as law.\n\nLegal experts and civil society organisations have slammed the policy as a violation of freedom of choice and an abuse of state power.\n\nThe law sets a dangerous precedent, warned a local media watchdog. You cant compel people to fund a state media institution that fails to serve the public interest.\n\nWhile government officials claim the move aligns with international broadcasting models, critics argue that the comparison is disingenuous.\n\nIn democracies, public broadcasters are funded transparently and voluntarily  not through coercive linkages to unrelated services like vehicle licensing, said one analyst.\n\nWith no exemption mechanisms in place, motorists now face a stark choice: pay the ZBC fee or forfeit their right to legally drive.\n\nChitando warned that the law could fuel greater unrest if not immediately repealed.\n\nThe people are already burdened by poverty and unemployment. Forcing them to fund propaganda will only inflame tensions. This must be resisted.\n\nAs the backlash intensifies, analysts say the law could become a key flashpoint in the widening rift between the Mnangagwa regime and an increasingly disillusioned citizenry.\n\nThis isnt just about cars or fees, said one commentator. Its about power, control, and a nation pushed to the edge.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Masvingo Central legislator Jeffryson Chitando has urged Zimbabweans to resist what he described as “state-sponsored exploitation,” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/20/resist-forced-payment-of-zbc-radio-licences-says-former-mp/\">Continue reading<span class=\"screen-reader-text\"> \"Resist Forced Payment of ZBC Radio Licences, Says Former MP …\"</span></a></p>",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "Wicknell Chivayo Attends 7000 USD Boxing Bout – Blowing State Funds as Zimbabweans Suffer",
            "url": "https://www.zimeye.net/2025/07/20/wicknell-chivayo-attends-7000-usd-boxing-bout-blowing-state-funds-as-zimbabweans-suffer/",
            "content": "By A Correspondent\n\nHARARE  Controversial ZANU PF-linked businessman Wicknell Chivayo is once again under fire after flaunting lavish spending abroad while Zimbabwe reels under deepening economic and social crises.\n\nChivayo, a known ally of President Emmerson Mnangagwa, was spotted alongside his wife Lulu enjoying premium ringside seats at the heavyweight boxing match between Oleksandr Usyk and Daniel Dubois at Wembley Stadium in London on Saturday night. Each seat reportedly cost around 5,500 (over US$7,000)  a staggering amount in a country where hospitals lack basic supplies and millions live in extreme poverty.\n\nUsyk ultimately knocked out Dubois in the fifth round, but for many Zimbabweans, the real knockout is the image of politically connected elites living large while the nation burns.\n\nThe extravagant display has sparked fresh outrage, with critics calling it yet another example of the unchecked looting and misallocation of public funds by politically protected tenderpreneurs who profit from questionable state contracts.\n\nChivayo is not spending his own money. This is taxpayers money disguised through dubious tenders, said a Harare-based analyst. While ordinary people cant even afford fuel or basic medication, hes sipping champagne ringside in London.\n\nChivayo has long been a lightning rod for controversy. His name has been associated with massive state contracts in energy and infrastructuremost of which have failed to deliver tangible results. Despite this, he continues to live a life of obscene wealth and visibility, often posting photos online of luxury cars, designer clothes, and international trips.\n\nVice President Constantino Chiwenga recently coined the term Chiganandaa veiled attack on self-enriching moles within ZANU PFwidely interpreted by political watchers as a thinly disguised jab at figures like Chivayo.\n\nThe Vice President knows whats happening, said a senior government insider. The looting is blatant. But no one touches Chivayo because he has Mnangagwas protection.\n\nAs the cost of living continues to soar and basic services collapse, citizens are growing increasingly impatient with the conspicuous consumption of those close to power.\n\nThese people are looting in plain sight, said an angry vendor in Mbare. We are suffering, but theyre living like kings. Its disgusting.\n\nWith no sign of accountability or restraint from those at the top, Chivayos ringside escapade may be the latest reminder of a broader crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Controversial ZANU PF-linked businessman Wicknell Chivayo is once again under fire after flaunting lavish spending … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/20/wicknell-chivayo-attends-7000-usd-boxing-bout-blowing-state-funds-as-zimbabweans-suffer/\">Continue reading<span class=\"screen-reader-text\"> \"Wicknell Chivayo Attends 7000 USD Boxing Bout – Blowing State Funds as Zimbabweans Suffer\"</span></a></p>",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "One Dead, Another Critically Injured in Harare Fuel Tanker Explosion",
            "url": "https://www.zimeye.net/2025/07/20/one-dead-another-critically-injured-in-harare-fuel-tanker-explosion/",
            "content": "By A Correspondent A tragic accident has claimed the life of one man and left another critically injured after a fuel tanker exploded during welding work in a Harare suburb. The two individuals were reportedly unaware that the tanker had previously carried fuel, which resulted in a deadly ignition as they carried out repairs.\n\nAccording to witnesses, the tanker burst into flames without warning, engulfing the workers and leaving one dead on the spot. The second victim is currently battling for his life in hospital.\n\nFormer Harare Deputy Mayor Kudzai Kadzombe expressed sorrow over the incident and called on residents to exercise greater caution and responsibility, especially in residential areas.\n\nThis is a heartbreaking and preventable tragedy, Kadzombe said. There is already a council resolution that allows for the enforcement, towing, and clamping of trucks parked in residential spaces.\n\nShe added that such trucks pose serious risks to communities.\n\nThey can cause accidents like this one, damage road infrastructure, and are often used as hiding places by criminals, particularly at night, she said.\n\nThe incident has reignited debate around the enforcement of city by-laws concerning heavy vehicles in residential zones, with many calling for stricter regulation and public awareness to prevent further loss of life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– A tragic accident has claimed the life of one man and left another critically injured after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/20/one-dead-another-critically-injured-in-harare-fuel-tanker-explosion/\">Continue reading<span class=\"screen-reader-text\"> \"One Dead, Another Critically Injured in Harare Fuel Tanker Explosion\"</span></a></p>",
            "time": "08:51",
            "date": "21 Jul 2025"
        },
        {
            "title": "VP Chiwenga Shares Stage With Tagwirei In Latest Visuals Suggesting He’s Betrayed Geza",
            "url": "https://www.zimeye.net/2025/07/20/vp-chiwenga-shares-stage-with-tagwirei-in-latest-visuals-suggesting-hes-betrayed-geza/",
            "content": "In perhaps the most vivid suggestion that the Blessed Geza movement has been whitewashed by Emmerson Mnangagwa, his man of support, Vice President Constantino Chiwenga is next week travelling to share the stage with the man mocking him (the VP) speeches labelled ZviGananda.\n\nThe function is slated for Bulawayo and the VP had not responded for comment at the time of writing. Details are as follows-\n\nWe are honoured to announce that The Acting President, HON. DR. GEN. (RTD) C.G.D.N. CHIWENGA will be the Guest of Honour at the upcoming Matabeleland Business Dinner!\n\n Theme: Building Bridges to Vision 2030: Empowering Zimbabwes Future!\n\nThis prestigious event is dedicated to empowering young people and fostering their active involvement in the business world as we journey toward a prosperous and inclusive Zimbabwe.\n\nDont miss this opportunity to connect, learn, and grow!  poster below-\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In perhaps the most vivid suggestion that the Blessed Geza movement has been whitewashed by Emmerson Mnangagwa, his man of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/20/vp-chiwenga-shares-stage-with-tagwirei-in-latest-visuals-suggesting-hes-betrayed-geza/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Shares Stage With Tagwirei In Latest Visuals Suggesting He’s Betrayed Geza\"</span></a></p>",
            "time": "08:51",
            "date": "21 Jul 2025"
        }
    ]
}