{
    "news": [
        {
            "title": "Tripple Heroes Burial As Chiwenga Reduced To A Funeral President",
            "url": "https://www.zimeye.net/2025/01/22/tripple-heroes-burial-as-chiwenga-reduced-to-a-funeral-president/",
            "content": "By Munacho Gwamanda- Vice President Constantino Chiwenga has been reduced to the role of funeral president as he assumes the role of acting President.\n\nSince his return from annual leave as acting President, he has been issuing condolence messages for the deaths of several Zanu PF bosses.\n\nToday, which marks his third day as the acting President, Chiwenga will preside over the burials of Major General (Retired) Solomon Siziba, Chen Chimutengwende, and John Shumba Mvundura at the National Heroes Acre, all of which died while he was on leave.\n\nThe trio has been declared national heroes, yet their deaths underscore a troubling pattern for Chiwenga.\n\nOver 20 high-ranking military officials and political allies linked to Chiwengas camp have died under mysterious circumstances since the 2017 coup that ousted President Robert Mugabe.\n\nNotable among them are Foreign Minister Sibusiso Moyo, Agriculture Minister Perence Shiri, and other top military figures, all of whom were instrumental in the coup.\n\nThese deaths have raised questions about a potential systematic purge within Zanu PF, allegedly orchestrated to weaken Chiwengas power base and consolidate President Emmerson Mnangagwas control.\n\nPolitical insiders claim that Mnangagwa and Chiwenga struck an agreement in 2017, promising Mnangagwa two terms before handing over power to Chiwenga.\n\nHowever, Mnangagwas recent constitutional amendments extending his presidency have alienated Chiwengas faction, intensifying tensions within Zanu PF.\n\nMnangagwa has breached the gentlemens agreement, a senior Zanu PF official said. The elimination of Chiwengas loyalists is not coincidentalits a calculated strategy to secure his grip on power.\n\nMnangagwas consolidation efforts have reportedly sidelined Chiwenga and his allies, who now face diminishing influence in the military and the party.\n\nAnalysts warn that the growing rift between Mnangagwa and Chiwenga could spark another violent power struggle.\n\nWith Zanu PFs history of factionalism and internal purges, the fallout between the two leaders poses a serious threat to Zimbabwes political stability.\n\nMnangagwas survival depends on parliamentary loyalty and a neutralized military, political analyst Mutodi said. But if Chiwengas camp feels cornered, they might act decisively, even risking another coup.\n\nChiwengas diminishing support within the militarya power base he once commandedleaves him vulnerable as Mnangagwa tightens his grip on authority.\n\nWith each passing funeral, the Vice Presidents circle of allies shrinks, adding fuel to speculation that his political ambitions are being systematically dismantled.\n\nThe rivalry between Mnangagwa and Chiwenga risks plunging Zimbabwe into deeper uncertainty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Vice President Constantino Chiwenga has been reduced to the role of funeral president as he assumes the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/tripple-heroes-burial-as-chiwenga-reduced-to-a-funeral-president/\">Continue reading<span class=\"screen-reader-text\"> \"Tripple Heroes Burial As Chiwenga Reduced To A Funeral President\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "Funerals Spoil Chiwenga’s Acting Presidency",
            "url": "https://www.zimeye.net/2025/01/22/funerals-spoil-chiwengas-acting-presidency/",
            "content": "By Munacho Gwamanda- A string of funerals for key Zanu PF figures and a senior army general have marred Vice President Constantino Chiwengas return from annual leave as acting President, seeing him oversee burials other than other developmental issues.\n\nToday Chiwenga will preside over the burials of Major General (Retired) Solomon Siziba, Chen Chimutengwende, and John Shumba Mvundura at the National Heroes Acre, all of which died while he was on leave.\n\nThe trio has been declared national heroes, yet their deaths underscore a troubling pattern for Chiwenga.\n\nOver 20 high-ranking military officials and political allies linked to Chiwengas camp have died under mysterious circumstances since the 2017 coup that ousted President Robert Mugabe.\n\nNotable among them are Foreign Minister Sibusiso Moyo, Agriculture Minister Perence Shiri, and other top military figures, all of whom were instrumental in the coup.\n\nThese deaths have raised questions about a potential systematic purge within Zanu PF, allegedly orchestrated to weaken Chiwengas power base and consolidate President Emmerson Mnangagwas control.\n\nPolitical insiders claim that Mnangagwa and Chiwenga struck an agreement in 2017, promising Mnangagwa two terms before handing over power to Chiwenga.\n\nHowever, Mnangagwas recent constitutional amendments extending his presidency have alienated Chiwengas faction, intensifying tensions within Zanu PF.\n\nMnangagwa has breached the gentlemens agreement, a senior Zanu PF official said. The elimination of Chiwengas loyalists is not coincidentalits a calculated strategy to secure his grip on power.\n\nMnangagwas consolidation efforts have reportedly sidelined Chiwenga and his allies, who now face diminishing influence in the military and the party.\n\nAnalysts warn that the growing rift between Mnangagwa and Chiwenga could spark another violent power struggle.\n\nWith Zanu PFs history of factionalism and internal purges, the fallout between the two leaders poses a serious threat to Zimbabwes political stability.\n\nMnangagwas survival depends on parliamentary loyalty and a neutralized military, political analyst Mutodi said. But if Chiwengas camp feels cornered, they might act decisively, even risking another coup.\n\nChiwengas diminishing support within the militarya power base he once commandedleaves him vulnerable as Mnangagwa tightens his grip on authority.\n\nWith each passing funeral, the Vice Presidents circle of allies shrinks, adding fuel to speculation that his political ambitions are being systematically dismantled.\n\nThe rivalry between Mnangagwa and Chiwenga risks plunging Zimbabwe into deeper uncertainty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- A string of funerals for key Zanu PF figures and a senior army general have marred Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/funerals-spoil-chiwengas-acting-presidency/\">Continue reading<span class=\"screen-reader-text\"> \"Funerals Spoil Chiwenga’s Acting Presidency\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "Will Pizza Tax Revive Economy?",
            "url": "https://www.zimeye.net/2025/01/22/will-pizza-tax-revive-economy/",
            "content": "By A Correspondent\n\nThe Harare regime, under President Emmerson Mnangagwas leadership, has introduced a fast food tax aimed at boosting revenue. The tax, which began this month, targets various fast food items sold in the city on a per-unit basis, with the dual objective of raising funds for development and addressing public health concerns related to unhealthy eating habits.\n\nWhile the move has sparked debate, it underscores the administrations urgent need to secure additional revenue. The government is hopeful the tax will provide much-needed funds for urban development and critical public services.\n\nFinance Minister Professor Mthuli Ncube explained, This year we introduced the sugar tax, we have collected over US$30 million earmarked to deal with cancer issues and cancer response programmes. We have managed well in terms of tax collection. This has been directed towards the health sector. We have really been focused to improve the access to drugs, quality of equipment, and in the 2025 budget we have made sure the amount is close to the Abuja target.\n\nThe administration is hopeful that the fast food tax will similarly contribute to public health initiatives and generate a steady income stream to support the countrys ailing economy. The government has emphasized that funds from this tax will be allocated to improving healthcare and addressing non-communicable diseases linked to poor diets.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Harare regime, under President Emmerson Mnangagwa’s leadership, has introduced a fast food tax aimed at boosting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/will-pizza-tax-revive-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Will Pizza Tax Revive Economy?\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "ZBC TV Leaks Video Of Justice Minister Ordering ZANU Structures To Pretend Like Mnangagwa’s Clueless Of Motion To Illegally Extend His Term",
            "url": "https://www.zimeye.net/2025/01/22/zbc-tv-leaks-video-of-justice-minister-ordering-zanu-structures-to-pretend-like-mnangagwas-clueless-of-motion-to-illegally-extend-his-term/",
            "content": "ZANU PF Supporters Reject Mnangagwa Term Extension, Back Chiwenga for 2028 Presidency\n\nBy A Correspondent | ZimEye | A faction of ZANU PF supporters has publicly rejected efforts to extend President Emmerson Mnangagwas term to 2030, declaring their unwavering support for Vice President General Constantino Chiwenga as the partys future leader.\n\nThe controversy erupted following a leaked clip from the state broadcaster ZBC, in which Justice Minister Ziyambi Ziyambi was seen instructing party members to align themselves with a narrative exonerating President Mnangagwa from being behind the contentious term-extension proposal. In the clip, Ziyambi can be heard saying:\n\nWhen you are asked, you must say we are the ones who came up with the call to lengthen President Mnangagwas term even myself when I shall meet him, I shall sound like he has no clue about it.\n\nThe video sparked outrage among ZANU PF supporters and members who accused Ziyambi of misleading the nation. In a strongly-worded statement, a group of party members dismissed the ministers claims as legendary lies and asserted that there had been no consultation within ZANU PF structures on the proposed term extension.\n\nEmmerson Mnangagwas @CNN promise to step down in 2028, even if the people would love me to the heel, I will still go away | 2025 STATUS @ZANUPF_Official  @nickmangwana   @amanpourpic.twitter.com/BCXaeeXlQc\n\nNo Agreement on Term Extension\n\nThe group emphasized that the partys main wingsMain Wing, Womens League, War Veterans, and Youth Winghad never deliberated or agreed to a term extension for Mnangagwa. They demanded evidence of such discussions, saying:\n\nWhere did we agree as ZANU PF people from the grassroots structures on coming up with this term extension resolution? Dont lie to us. It never happened.\n\nCiting the partys commitment to upholding the Zimbabwean constitution, the statement further rejected the notion of compromising democratic principles for political convenience.\n\nChiwenga Is the Future\n\nIn a decisive declaration, the group announced its support for Vice President General Constantino Chiwenga as the partys preferred candidate for the 2028 presidential race. The statement read:\n\nNext President is Rt Gen Vice President Chiwenga come 2028, and the rest is cheap propaganda.\n\nChiwenga, a key figure in the military intervention that brought Mnangagwa to power in 2017, is seen by some as a natural successor within ZANU PF ranks. The supporters rallied around him with slogans likeFamba Chiwenga Fambaand#GoreReGudoGuru(Year of the Mighty Baboon).\n\nParty in Turmoil\n\nThe development reveals deep divisions within ZANU PF as it grapples with questions over leadership succession and internal cohesion. Analysts say the public dissent highlights growing dissatisfaction with Mnangagwas leadership amid economic challenges and waning grassroots support.\n\nEfforts to reach Minister Ziyambi Ziyambi and ZANU PF spokespersons for comment were unsuccessful at the time of publication.\n\nThe next few weeks are expected to test ZANU PFs ability to navigate internal disagreements while maintaining a united front. For now, the battle lines appear drawn between those backing Mnangagwas extended rule and those who see Chiwenga as the partys future leader. ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ZANU PF Supporters Reject Mnangagwa Term Extension, Back Chiwenga for 2028 Presidency By A Correspondent | ZimEye | A faction … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/zbc-tv-leaks-video-of-justice-minister-ordering-zanu-structures-to-pretend-like-mnangagwas-clueless-of-motion-to-illegally-extend-his-term/\">Continue reading<span class=\"screen-reader-text\"> \"ZBC TV Leaks Video Of Justice Minister Ordering ZANU Structures To Pretend Like Mnangagwa’s Clueless Of Motion To Illegally Extend His Term\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "Presidential Inputs Stolen In Tsholotsho",
            "url": "https://www.zimeye.net/2025/01/22/presidential-inputs-stolen-in-tsholotsho/",
            "content": "By A Correspondent\n\nA truck carrying Presidential Input Scheme seeds, intended for Ward Seven in Tsholotsho, Matabeleland North, has been missing since January 4, 2025.\n\nThe vehicle was transporting 400 bags of 50kg Urea fertilizer, 30 bags of 10kg sunflower seeds, and 100 bottles of 200ml Imidacloprid chemicals when it vanished.\n\nAccording to an update on the Operation Restore Legacy Facebook page, which is run by Zanu PF social media group Varakashi, The truck was accompanied by a police officer, yet the inputs were not signed for in the provisional dispatcher book, which was allegedly full at the time.\n\nThe page identified the primary suspects in the case as Kwanele Elena Alanna Dube, the Agritex extension officer for Ward Seven, and Langton Ncube, a contract employee with the Grain Marketing Board (GMB), both of whom are currently on the run.\n\nThe post also named Abisinjo Mpofu, a police officer stationed at ZRP Tsholotsho as another individual implicated in the theft.\n\nThe Operation Restore Legacy page concluded by stating, The authorities are actively pursuing the suspects, and the situation remains under investigation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A truck carrying Presidential Input Scheme seeds, intended for Ward Seven in Tsholotsho, Matabeleland North, has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/presidential-inputs-stolen-in-tsholotsho/\">Continue reading<span class=\"screen-reader-text\"> \"Presidential Inputs Stolen In Tsholotsho\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "Police Intensify “Operation No Mushikashika”",
            "url": "https://www.zimeye.net/2025/01/22/police-intensify-operation-no-mushikashika/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has arrested a total of 6,540 individuals under their ongoing operation, No to Mushikashika, aimed at curbing illegal public transport activities.\n\nOn January 19, 2025 alone, 383 arrests were made, bringing the cumulative total since the start of the operation on January 9, 2025, to 6,540 arrests.\n\nThe ZRP So far, 190 touts have been arrested, and 61 unregistered and plateless vehicles have been impounded as part of efforts to ensure the safety and orderliness of the public transport sector.\n\nThe crackdown has been a significant part of the polices efforts to eliminate illegal and unsafe transport practices, commonly known as mushikashika, which are often linked to unregulated passenger transport services.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has arrested a total of 6,540 individuals under their ongoing operation, “No … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/police-intensify-operation-no-mushikashika/\">Continue reading<span class=\"screen-reader-text\"> \"Police Intensify “Operation No Mushikashika”\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "DeMbare Unveil New-Look Technical Team",
            "url": "https://www.zimeye.net/2025/01/22/dembare-unveil-new-look-technical-team/",
            "content": "Sports Correspondent\n\nDynamos Football Club have announced the appointment of Ronald Gidiza Sibanda as the teams new manager, marking his return to the club where he played from 1998 to 1999.\n\nSibanda, a retired midfielder, replaces Harry Lusengo as team manager.\n\nIn addition to Sibandas appointment, Dynamos have also named Mark Mathe as the new assistant coach.\n\nMathe will work alongside head coach Lloyd Chigowe, who was recently appointed to the position.\n\nMathe brings valuable experience to the role, having previously coached several teams, including Chicken Inn, Bulawayo Chiefs, Highlanders, and CAPS United.\n\nHe most recently served as an assistant coach for Mozambican side UD Songo FC.\n\nDynamos expressed their congratulations to both Sibanda and Mathe on their appointments and wished them the best of luck in their new roles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos Football Club have announced the appointment of Ronald “Gidiza” Sibanda as the team’s new manager, marking his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/dembare-unveil-new-look-technical-team/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Unveil New-Look Technical Team\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "Nyasa Big Bullets Part Ways With Zim Trio",
            "url": "https://www.zimeye.net/2025/01/22/nyasa-big-bullets-part-ways-with-zim-trio/",
            "content": "By A Correspondent\n\nNyasa Big Bullets have announced the departure of three Zimbabwean players, Ronald Chitiyo, Collin Mujuru, and Kenneth Pasuwa, following the conclusion of the 2024 season.\n\nChitiyo and Mujuru joined the team at the start of the 2024 season, while Pasuwas contract has expired.\n\nNotably, Pasuwas departure follows in the footsteps of his father, Kalisto Pasuwa, who also left the club after his contract expired.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Nyasa Big Bullets have announced the departure of three Zimbabwean players, Ronald Chitiyo, Collin Mujuru, and Kenneth … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/nyasa-big-bullets-part-ways-with-zim-trio/\">Continue reading<span class=\"screen-reader-text\"> \"Nyasa Big Bullets Part Ways With Zim Trio\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "Zimbabwe Begins Resentencing Of Death Row Inmates",
            "url": "https://www.zimeye.net/2025/01/22/zimbabwe-begins-resentencing-of-death-row-inmates/",
            "content": "By A Correspondent\n\nFollowing the legislative repeal of the death penalty, the Zimbabwean government has initiated the resentencing process for inmates previously on death row. Permanent Secretary for Justice, Legal and Parliamentary Affairs, Mrs. Vimbai Nyemba, revealed that stakeholders, including the Law Society, Commissioner General of Prisons and Correctional Service, and the Prosecutor General, will convene before the end of January to facilitate a smooth transition .\n\nThe resentencing process involves several key steps:\n\nMore than 40 inmates are affected, with the longest-serving prisoner having spent 22 years on death row at Chikurubi Maximum Security Prison. Zimbabwes decision to repeal the death penalty follows a regional trend, with the country becoming the 30th in Africa to abolish capital punishment .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Following the legislative repeal of the death penalty, the Zimbabwean government has initiated the resentencing process for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/zimbabwe-begins-resentencing-of-death-row-inmates/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Begins Resentencing Of Death Row Inmates\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        },
        {
            "title": "Mthuli Banks On Pizza Tax For Economic Growth",
            "url": "https://www.zimeye.net/2025/01/22/mthuli-banks-on-pizza-tax-for-economic-growth/",
            "content": "By A Correspondent\n\nThe Harare regime, under President Emmerson Mnangagwas leadership, has introduced a fast food tax aimed at boosting revenue. The tax, which began this month, targets various fast food items sold in the city on a per-unit basis, with the dual objective of raising funds for development and addressing public health concerns related to unhealthy eating habits.\n\nWhile the move has sparked debate, it underscores the administrations urgent need to secure additional revenue. The government is hopeful the tax will provide much-needed funds for urban development and critical public services.\n\nFinance Minister Professor Mthuli Ncube explained, This year we introduced the sugar tax, we have collected over US$30 million earmarked to deal with cancer issues and cancer response programmes. We have managed well in terms of tax collection. This has been directed towards the health sector. We have really been focused to improve the access to drugs, quality of equipment, and in the 2025 budget we have made sure the amount is close to the Abuja target.\n\nThe administration is hopeful that the fast food tax will similarly contribute to public health initiatives and generate a steady income stream to support the countrys ailing economy. The government has emphasized that funds from this tax will be allocated to improving healthcare and addressing non-communicable diseases linked to poor diets.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Harare regime, under President Emmerson Mnangagwa’s leadership, has introduced a fast food tax aimed at boosting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/22/mthuli-banks-on-pizza-tax-for-economic-growth/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Banks On Pizza Tax For Economic Growth\"</span></a></p>",
            "time": "09:08",
            "date": "22 Jan 2025"
        }
    ]
}