{
    "news": [
        {
            "title": "Top CIO Agent & Mugabe Era Chief Abductor Dies",
            "url": "https://www.zimeye.net/2025/04/22/top-cio-agent-mugabe-era-chief-abductor-dies/",
            "content": "By Political Reporter- A senior Central Intelligence Organisation (CIO) operative long linked to the abductions of political activists during the late President Robert Mugabes regime, Walter Basopo, has died.\n\nBasopo, believed to be a close relative of President Emmerson Mnangagwa, reportedly passed away at a hospital in Chinhoyi on Tuesday, according to family sources.\n\nMourners were seen heading to his home in Chinhoyi on Tuesday evening following the announcement of his death.\n\nBasopos name has surfaced multiple times in connection with the 2015 disappearance of pro-democracy activist and journalistItai Dzamara, who was abducted in broad daylight by suspected state agents in Harares Glen View suburb.\n\nDzamara had become a prominent critic of Mugabes government through his Occupy Africa Unity Square campaign, where he regularly held solo protests demanding Mugabes resignation.\n\nIn the weeks leading up to his disappearance, Dzamara had received numerous threats from state security agents and was frequently arrested or assaulted by police.\n\nOn March 9, 2015, he was forcibly taken by five men who accused him of stealing cattle, bundled into an unmarked white truck, and never seen again.\n\nHis family, civil society, and international human rights groups have continuously called for justice, but the state has denied any involvement, offering no meaningful updates on the case for years.\n\nBasopo was among the CIO agents whose names were repeatedly mentioned by insiders and human rights organisations as being part of the special operations team responsible for silencing dissenters during the Mugabe era.\n\nHis death adds a chilling layer of finality to the unresolved mystery of Dzamaras fate.\n\nIn a twist of fate, Basopo died on the same day asRetired Brigadier General Victor Rungani, another of Mugabes key enforcers, whose death was also confirmed on Tuesday.\n\nRungani, originally from Bikita in Masvingo Province, was a senior member of theJoint Operations Command (JOC)a shadowy structure composed of army, police, intelligence, and prison chiefs that coordinated ZANU PFs security and political strategies.\n\nDuring the violent and highly contested June 2008 presidential run-off, Rungani was reportedly tasked with overseeing operations in Mashonaland East, where widespread torture, beatings, and killings were unleashed on opposition supporters in what human rights groups called a campaign of terror.\n\nThe violence was so severe that opposition leader Morgan Tsvangirai withdrew from the race, paving the way for Mugabe to claim a hollow victory.\n\nRunganis death was announced by the Children of War Veterans Association (COZWVA), where his son,Hardlife Rungani, remains an active member.\n\nBoth Basopo and Rungani were emblematic of a generation of state security operatives and military commanders who operated with impunity, often targeting opposition voices and human rights activists under the guise of maintaining national security.\n\nTheir deaths mark the slow fading of Mugabes old guard, but the wounds they leftlike the unresolved disappearance of Itai Dzamaracontinue to haunt Zimbabwes journey toward justice and accountability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- A senior Central Intelligence Organisation (CIO) operative long linked to the abductions of political activists during the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/top-cio-agent-mugabe-era-chief-abductor-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top CIO Agent & Mugabe Era Chief Abductor Dies\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "BREAKING: ONE CHIGANANDA DIES- Dzamara Kidnapper And Mnangagwa 2030ist, Walter Basopo Is No More",
            "url": "https://www.zimeye.net/2025/04/22/breaking-one-chigananda-dies-dzamara-kidnapper-and-mnangagwa-2030ist-walter-basopo-is-no-more/",
            "content": "By A Correspondent | A top CIO head, Walter Basopo has died.\n\nMourners were travelling to the Mnangagwa family members home in Chinhoyi on Tuesday evening.\n\nBasopo was announced dead in hospital on Tuesday, according to family sources.\n\nHe is one of the intelligence operatives accused of kidnapping the missing journalist Itai Dzamara in 2015.\n\nMORE TO FOLLOW\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A top CIO head, Walter Basopo has died. Mourners were travelling to the Mnangagwa family member’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/breaking-one-chigananda-dies-dzamara-kidnapper-and-mnangagwa-2030ist-walter-basopo-is-no-more/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: ONE CHIGANANDA DIES- Dzamara Kidnapper And Mnangagwa 2030ist, Walter Basopo Is No More\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "ED Escalates Surveillance As Geza’s Shutdown Grips Zimbabwe",
            "url": "https://www.zimeye.net/2025/04/22/ed-escalates-surveillance-as-gezas-shutdown-grips-zimbabwe/",
            "content": "By James Gwati President EmmersonMnangagwasregime has intensified surveillance and security operations following an effective national shutdown called by war veteran Cde Blessed Geza.\n\nBusiness was low on Tuesday, with streets in major cities, including Harare, Bulawayo, and Gweru, eerily empty as the shutdown took hold.\n\nMost shops, informal markets, and even some government departments were closed, with many citizens heeding the call to stay home in protest against corruption, economic collapse, and worsening repression.\n\nObservers described the shutdown as one of the successful acts of civil disobedience in recent years, despite the states heavy-handed attempts to crush it.\n\nSecurity forces, including plainclothes intelligence operatives and riot police, were deployed across Central Business Districts (CBDs), and they interrogated pedestrians and monitored movements.\n\nIn Harare, riot police were visibly stationed at key intersections, bus termini, and shopping areas in anticipation of unrest that never materializedthanks to the silent but effective protest.\n\nThegovernmentsresponse did not stop at surveillance.\n\nOver 100 political activists remain in detention following a wave of arrests last month linked to growing dissent and preemptive action against protest organizers.\n\nThe detainees havebeen deniedbail and access to legal counsel, raising alarm among international rights watchdogs.\n\nAmong the latest victims of thestatessecurity clampdown is opposition activist Godfrey Karembera, popularly known asMadzibaba veShanduko, a prominent ally of opposition leader Nelson Chamisa and a vocal critic of the Mnangagwa administration.\n\nEarly Tuesday morninghours after the shutdown beganKaremberasHarare home was petrol-bombed by unknown assailants. His teenage son was critically injured in the attack andis currently hospitalizedwith life-threatening burns.\n\nThe homewas largely destroyedin the blaze.\n\nMultiple sources toldZimEyethat the attack appeared to be a politically motivated act of intimidation.\n\nItis believedthe perpetratorssuspected to be ruling party loyaliststargeted Karembera over his perceived capacity to mobilize citizens in support of CdeGezasshutdown call.\n\nFor years, Madzibaba veShanduko has been a symbol of peaceful resistance, donning white religious garb as he leads protests and public prayers denouncing state brutality.\n\nHe has previouslybeen arrested, tortured, and harassed for his activism. But this petrol bombing, insiders say, marks a sinister escalation in efforts to silence dissenting voices.\n\nCde Geza, who called for the two-day shutdown, is a former liberation war fighter who has emerged as a new face of protest politics in Zimbabwe.\n\nHis messagea mix of populist rhetoric and liberation-era patriotismhas struck a chord with frustrated citizens, particularly the unemployed youth and some disillusioned veterans within the security sector.\n\nHis demand? For President Mnangagwa to step down amid economic ruin and political decay.\n\nDespite thegovernmentsthreats, arrests, and increased deployment of security agents,Gezascall has shaken the ruling elitedemonstrating the depth of public frustration and thestatesgrowing loss of legitimacy.\n\nHuman rights organizations are now urging an independent investigation into the attack onKaremberashome and a full audit of the ongoing political detentions.\n\nThey warn that the current trajectorymarked by state violence, fear, and repressionrisks plunging Zimbabwe into a deeper crisis.\n\nThe Mnangagwa government must choose between reform and repression,said one Harare-based rights lawyer.Crushing peaceful dissentonlyadds fuel to the fire.\n\nAs Wednesdaythe final day of the shutdownunfolds, all eyes remain onZimbabwesstreets, now guarded by riot police but filled with the quiet defiance of an angry and fearful nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati – President Emmerson Mnangagwa’s regime has intensified surveillance and security operations following an effective national shutdown called by war veteran … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/ed-escalates-surveillance-as-gezas-shutdown-grips-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"ED Escalates Surveillance As Geza’s Shutdown Grips Zimbabwe\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "Mutasa’s Masterclass: MWOS Edges Dynamos in Historic Win",
            "url": "https://www.zimeye.net/2025/04/22/mutasas-masterclass-mwos-edges-dynamos-in-historic-win/",
            "content": "By Sports Correspondent\n\nMWOS head coach Lloyd Mutasa expressed delight after his teams 1-0 victory over Dynamos FC in Norton. The win marked a historic moment for MWOS, as they opened their top-flight campaign with a triumph at their new stadium.\n\nWe are very happy that history will say we opened our stadium with a win  a win against one of the biggest teams in the country, Mutasa said, beaming with pride. The solitary goal, scored by Claude Makopa in the 52nd minute, proved enough for MWOS to secure all three points and take the top spot in the league table.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent MWOS head coach Lloyd Mutasa expressed delight after his team’s 1-0 victory over Dynamos FC in Norton. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/mutasas-masterclass-mwos-edges-dynamos-in-historic-win/\">Continue reading<span class=\"screen-reader-text\"> \"Mutasa’s Masterclass: MWOS Edges Dynamos in Historic Win\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "Samaita Plots DeMbare Downfall",
            "url": "https://www.zimeye.net/2025/04/22/samaita-plots-dembare-downfall/",
            "content": "Sports Correspondent\n\nIn a stunning turn of events, Dynamos suffered a 1-0 defeat at the hands of MWOS FC, led by their former coach Lloyd Mutasa, in a Castle Lager Premier Soccer League match. The match, played at Ngoni Stadium in Norton, marked the stadiums debut hosting a top-flight game after its recent approval.\n\nClaude Makopas 52nd-minute goal proved to be the difference-maker as MWOS FC secured a crucial victory, propelling them to the top of the league table with 17 points, three points clear of their nearest rivals.\n\nMeanwhile, other matches saw Ngezi Platinum and Highlanders play out a goalless draw, while Scottland FC and FC Platinum shared the spoils in a 1-1 draw. Simba Bhora moved into second place with a 1-0 win over Chicken Inn, courtesy of a goal from Namibian striker Isaskar Gurirab.\n\nIn other news, Kwekwe Uniteds match against Herentals College FC was called off due to salary disputes between the team and management.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a stunning turn of events, Dynamos suffered a 1-0 defeat at the hands of MWOS FC, led … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/samaita-plots-dembare-downfall/\">Continue reading<span class=\"screen-reader-text\"> \"Samaita Plots DeMbare Downfall\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "Madzibaba VeShanduko’s Son Critically Injured In Petrol Bomb Attack",
            "url": "https://www.zimeye.net/2025/04/22/madzibaba-veshandukos-son-critically-injured-in-petrol-bomb-attack/",
            "content": "By James GwatiThe son of opposition activist Godfrey Karembera, popularly known as Madzibaba veShanduko, was critically injured early Tuesday morning after unknown assailants petrol-bombed their home in a suspected politically motivated attack.\n\nMultiple sources confirmed toZimEyethatKaremberasresidence was set ablaze by individuals believed tobe linkedto President Emmerson Mnangagwaloyalists,amid fears he would mobilize support for a nationwide shutdown protest announced by war veteran and political Cde Blessed Geza.\n\nThe attack, which leftKaremberasson fighting for his life, has sparked outrage among opposition supporters and human rights groups.\n\nEyewitnesses said the fire broke out in the earlyhours of the morning, reducing much of the house to ashes.\n\nTheidentity of the attackersremains unknown, but opposition insiders suspect it was a preemptive strike to deter Karembera from participating in or rallying support for the protest action.\n\nCde Geza, a former liberation war fighter turned vocal government critic, hadat the weekendcalled for a two-day national shutdown starting Tuesday, urging citizens to stay at home as a form of civil disobedience meant to pressure President Emmerson Mnangagwa to resign.\n\nThe callappears to havegained significant traction.\n\nIn Harare, Bulawayo, Gweru, and othermajortowns, streetswere noticeably desertedon Tuesday morning.\n\nMany shops remained closed, with some businesses citing fear of violence or arrests as the reason for suspending operations.\n\nInformal traders, public transport operators, and even some government workers stayed away from their usual routines,signallingwhat appears to be growing public discontent.\n\nObservers noted that the shutdown was one of the most effective civil protest actions in recent years, despite state intimidation.\n\nAccording to reports, plainclothes intelligence officers and riot police were deployed across urban centers to monitor and intimidate suspected protest organizers.\n\nThisweeksaction builds on a string of recent online and offline mobilization efforts that have highlighted the deepening crisis in Zimbabwe, including worsening economic conditions, rampant corruption, and human rights abuses underMnangagwasadministration.\n\nCdeGezasemergence as a protest figure has reinvigorated opposition ranks, especially among disillusioned citizens and members of the security sector.\n\nHis appeal to both civilians and former military colleagues has rattled the state, which has responded with threats, arrests, and surveillance.\n\nMadzibaba veShanduko, a longtime ally of opposition leader Nelson Chamisa and a symbol of peaceful resistance, has faced repeated harassment by the police and state security agents in recent years.\n\nThis latest attack, however, marks a new and dangerous escalation in targeted violence against political dissenters.\n\nHuman rights groups are now calling for an independent investigation into the petrol bombing and the broader clampdown on peaceful protest.\n\nThey warn that such repression could push the country intodeeperinstability if the government continues to ignore calls for reform and accountability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati –The son of opposition activist Godfrey Karembera, popularly known as Madzibaba veShanduko, was critically injured early Tuesday morning … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/madzibaba-veshandukos-son-critically-injured-in-petrol-bomb-attack/\">Continue reading<span class=\"screen-reader-text\"> \"Madzibaba VeShanduko’s Son Critically Injured In Petrol Bomb Attack\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "Air Force of Zimbabwe Paratrooper In Mid Air Mishap",
            "url": "https://www.zimeye.net/2025/04/22/air-force-of-zimbabwe-paratrooper-in-mid-air-mishap/",
            "content": "By A Correspondent\n\nA member of the Air Force of Zimbabwe (AFZ) was rescued on Monday after his parachute got entangled in pine trees during a training exercise near the Zimbabwe International Exhibition Centre in Bulawayo.\n\nThe paratrooper was left hanging roughly 25 meters above the ground, prompting a swift response from the Bulawayo Fire and Ambulance Department.\n\nEmergency crews managed to safely retrieve the suspended officer, who was then transported to United Bulawayo Hospital for medical attention.\n\nThe AFZ was preparing to take part in public displays during the upcoming Zimbabwe International Trade Fair (ZITF), which will be officially opened by Mozambican President Daniel Chapo.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A member of the Air Force of Zimbabwe (AFZ) was rescued on Monday after his parachute got … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/air-force-of-zimbabwe-paratrooper-in-mid-air-mishap/\">Continue reading<span class=\"screen-reader-text\"> \"Air Force of Zimbabwe Paratrooper In Mid Air Mishap\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "Tragedy in Chivhu: Young Man Dies of Asthma After Failing to Get Help at Local Hospital",
            "url": "https://www.zimeye.net/2025/04/22/tragedy-in-chivhu-young-man-dies-of-asthma-after-failing-to-get-help-at-local-hospital/",
            "content": "By A Correspondent\n\nA heartbreaking incident has once again spotlighted the dire state of Zimbabwes public healthcare system.\n\nA young man identified only as Sele tragically lost his life to a severe asthma attack after he failed to receive critical care at Chivhu Hospital due to the absence of a nebuliser.\n\nThe incident occurred earlier this week and was reported by Crime Watch Zimbabwe, which shared the distressing news on Tuesday. According to the platform, Sele experienced a sudden and severe asthma attack while in Chivhu and rushed to the local hospital in hopes of receiving emergency treatment. However, his condition rapidly deteriorated after it was discovered that Chivhu Hospital did not have a functioning nebuliser  a basic yet life-saving piece of equipment for asthma patients.\n\nSAD | His name was Sele, and he had an asthma attack while in Chivhu. Sadly, Chivhu Hospital couldnt save his life because there was no nebuliser available, Crime Watch Zimbabwe posted.\n\nRealizing the gravity of the situation, Seles colleagues from Muvonde Hospital urgently dispatched an ambulance to Chivhu in an effort to transfer him back to his workplace, where he could access proper medical equipment. Tragically, their rescue mission came too late.\n\nHis colleagues from Muvonde Hospital went to fetch him with an ambulance so he could receive treatment at his workplace, but when they arrived, he was already gone, the report continued.\n\nSeles death has sparked outrage and sorrow across social media, with many Zimbabweans decrying the chronic shortages, poor infrastructure, and lack of basic medical supplies in government-run hospitals. Others have called on the Ministry of Health and Child Care to urgently address equipment shortages that continue to cost lives.\n\nThis tragic event serves as a painful reminder of the life-and-death consequences faced by ordinary citizens in a broken healthcare system.\n\nNo comment could be obtained from Chivhu Hospital authorities at the time of publishing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A heartbreaking incident has once again spotlighted the dire state of Zimbabwe’s public healthcare system. A young … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/tragedy-in-chivhu-young-man-dies-of-asthma-after-failing-to-get-help-at-local-hospital/\">Continue reading<span class=\"screen-reader-text\"> \"Tragedy in Chivhu: Young Man Dies of Asthma After Failing to Get Help at Local Hospital\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "Mnangagwa Spooks Hack Nyokayemabhunu WhatsApp Channel",
            "url": "https://www.zimeye.net/2025/04/22/mnangagwa-spooks-hack-nyokayemabhunu-whatsapp-channel/",
            "content": "By A Correspondent\n\nSuspected state security agents have reportedly breached a popular WhatsApp channel run by vocal government critic Jeremiah Masawi, alias Nyokayemabhunu.\n\nThe hack occurred on Monday, sending shockwaves among activists and opposition supporters.\n\nMasawi claimed the attack was orchestrated by government operatives trying to silence dissent.\n\nThis was an act of cowardice, he said. They fear the truth and the power of the peoples voice, so they resort to underhanded tactics.\n\nThe WhatsApp channel, known for its political commentary and mobilization efforts, went offline briefly before users received suspicious messages aimed at discrediting Masawi and disrupting organizing efforts.\n\nMasawi is collaborating with war veteran and activist Blessed Geza to push for President Emmerson Mnangagwas removal from office. Their campaign has gained momentum amid growing frustrations over economic hardships, corruption, and political repression.\n\nGeza has called for a nationwide shutdown starting April 22, demanding Mnangagwas resignation. This shutdown is the voice of the people, Geza said. We are saying enough is enough. Mnangagwa has failed, and he must go.\n\nThe government hasnt officially responded to the hacking allegations or the planned shutdown. However, security forces have historically cracked down on public protests and online dissent.\n\nDespite the breach, Masawi remains undeterred. They can hack a channel, but they cant hack a movement. We will continue to fight for justice, freedom, and a better Zimbabwe.\n\nAs the anxiety rises date approaches, attention focuses on how authorities will respond and public frustration will translate into mass action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Suspected state security agents have reportedly breached a popular WhatsApp channel run by vocal government critic Jeremiah … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/22/mnangagwa-spooks-hack-nyokayemabhunu-whatsapp-channel/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Spooks Hack Nyokayemabhunu WhatsApp Channel\"</span></a></p>",
            "time": "21:07",
            "date": "23 Apr 2025"
        },
        {
            "title": "A Sign Of Geza Effect : Masvingo CBD On Tuesday April 22…",
            "url": "https://www.zimeye.net/2025/04/22/a-sign-of-geza-effect-masvingo-cbd-on-tuesday-april-22/",
            "content": "Masvingo CBD On Tuesday April 22..Slow movement and limited activity, a sign of Geza effectpic.twitter.com/rvMmIsaKbP\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "21:07",
            "date": "23 Apr 2025"
        }
    ]
}