{
    "news": [
        {
            "title": "Zimbabwe’s Cyber Security Crisis, When Authorities Ignore Experts",
            "url": "https://www.zimeye.net/2025/08/28/zimbabwes-cyber-security-crisis-when-authorities-ignore-experts/",
            "content": "By Engineer Jacob Kudzayi Mutisi |  In August 2021, my cyber security team at Hansole identified a critical vulnerability on the Reserve Bank of Zimbabwe (RBZ) website, rbz.co.zw. As responsible professionals, we immediately raised the alarm. An official email was sent to the RBZ Governor, senior officials at the central bank and even copied to the Ministry of Finance. In that email, we detailed how the flaw could be exploited by hackers to conduct social engineering attacks, phishing campaigns and even remote exploitation of mobile devices.\n\nTo demonstrate the seriousness of the issue, we included a live example showing how an attacker could manipulate an RBZ sub-domain. We further offered to meet the bank and government representatives to demonstrate additional vulnerabilities and provide technical solutions. We provided our contact numbers and expressed a willingness to engage immediately. To this day, not a single person from the RBZ or the government ever responded.\n\nThis silence is not just disappointing, it is dangerous. It highlights a deep-rooted problem in Zimbabwes handling of cyber security, authorities do not engage experts or stakeholders even when credible, evidence-based warnings are brought directly to their attention. Instead, life goes on as if no threat exists until citizens and businesses fall victim to cyber criminals.\n\nOur experience with the RBZ was not unique. In 2018, when I addressed a cyber security conference hosted by the Zimpapers, Ministry of ICT and the ICT division of Zimbabwe Institution of Engineers (ZIE), I demonstrated how future crimes would target mobile money systems and bank transfers via SMS fraud. I warned that without proactive measures, Zimbabwe would see a surge in such crimes. At the time, the concerns were largely dismissed. Today, these very crimes have become the leading scams in the country, costing people millions.\n\nThe failure is not due to lack of expertise in Zimbabwe. We have ethical hackers, ICT professionals, academics and engineers who are both capable and willing to help strengthen our digital resilience. Hansole itself is proof of this capacity. But government institutions, instead of collaborating, prefer to operate in isolation. The result is legislation, like the Cyber Security and Data Protection Act, that focuses more on political surveillance than on genuine technical safeguards.\n\nGlobally, the lesson is clear, cyber security cannot be handled by governments alone. South Africa, Nigeria, and Kenya all have frameworks where government, telecoms, banks and independent experts work together. This multi-stakeholder model ensures vulnerabilities are addressed quickly, fraud is mitigated and public trust in digital systems is protected.\n\nBy ignoring our 2021 RBZ warning, Zimbabwe missed an opportunity to fix weaknesses before they were exploited. Worse, authorities sent a discouraging message to local experts, that their contributions are not valued. To an extend of calling me an activist/voluntary contributor. This attitude will only weaken national cyber defences further.\n\nAs Hansole, we remain committed to building a safer digital Zimbabwe. But unless government institutions start to listen, collaborate and act on expert advice, the country will remain an easy target for cyber criminals. Citizens deserve better.\n\nJust my story!!!\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi | In August 2021, my cyber security team at Hansole identified a critical vulnerability on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/zimbabwes-cyber-security-crisis-when-authorities-ignore-experts/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe’s Cyber Security Crisis, When Authorities Ignore Experts\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "Televised DNA testing must be banned in Zim",
            "url": "https://www.zimeye.net/2025/08/28/televised-dna-testing-must-be-banned-in-zim/",
            "content": "By Glanis Changachirere| DNA testing and its use in private family matters of biological relationships must be regulated by law.\n\nDNA testing and its use in private family matters of biological relationships must be regulated by law.\n\nIt should be restricted to resolve family issues privately in line with other regulations on data privacy and protection and safeguarding the best interests of children. The law should ban and criminalise televised or any other public announcements or shows of real-life DNA test results.\n\nDNA testing and public announcement of results infringe childrens rights to protection from public harm, exploits and commercialises families vulnerability, misfortunes, misery and poverty to profiteering businesses as online content. It leaves affected children and families publicly humiliated and contributes to mental health challenges.\n\nIt also reproduces stereotypical notions that stigmatise women and men, perpetuating technologically facilitated gender-based violence (TFGBV). Above all, it maligns the integrity of scientific solutions such as DNA testing to real-life family and societal challenges.\n\nDNA testing in Zimbabwe: When science meets harmful cultural practices\n\nDNA testing is a scientific method that is used to establish the percentage of a childs match to their biological bloodline. It is also used in medical and health diagnosis and for legal and forensics purposes, including in the prosecution of cases of sexual and gender-based violence.\n\nIn present-day Zimbabwe, DNA testing has become a popular phenomenon used particularly for paternal assessment reasons, accounting for 82,07% of DNA testing in a study conducted by Nature Health. The same study states that paternity tests are mostly requested in private laboratories and often in the absence of the mother.\n\nContextualising the high uptake of DNA paternal testing in Zimbabwe needs to be understood within the countrys socio-cultural contexts. Locating paternal contestation within the socio-cultural context shows that it is intricately linked with historical, harmful cultural practices and stereotypes that disproportionately affect women.\n\nKeep ReadingMavhunga puts DeMbare into Chibuku quarterfinalsBulls to charge into Zimbabwe gold stocksNdiraya concerned as goals dry upLetters: How solar power is transforming African farmsThis situates the problem in societal practices that not only harm women but also children, men, and families. It draws attention to the urgent need for policy reform to minimise the impact of TFGBV that televised DNA shows have on affected families and society.\n\nBiological parental contestation is not a new phenomenon in Zimbabwean society. Various harmful patriarchal social norms and practices have historically been established, widely accepted and continue to be practised by many families across classes in present-day Zimbabwe.\n\nThis is despite decades of work by womens movements to combat harmful cultural practices that undermine gender equality and perpetuate gender-based violence. One of the patriarchal practices directly related to paternal contestation is kupindirwa mumba. This is a practice that promoted step-fathering or step-mothering, knowingly and unknowingly.\n\nKupindirwa mumba was used when couples struggled/delayed having children and was done for kuchengetedza imba. Kuchengetedza imba is a Shona phrase that loosely translates to marriage (union) preservation. To preserve marriages, kupindirwa mumba was promoted by having a few elderly and respected family members to secretly arrange that a brother or nephew of the husband gets sexual with their sister-in-law to help the couple to have a child(ren). If the challenge persisted, the husband was encouraged to marry another wife to give him an heir.\n\nAlthough having children remains a decision for couples, Zimbabwean patriarchal society holds various stereotypical misconceptions about not having children. Couples are often stigmatised, which can lead to the breakdown of unions.\n\nKupindirwa mumba, therefore, normalised step-fathering as women were encouraged to try for children with men they were not necessarily in unions with. It also encouraged polygamy as men were encouraged to marry in instances where their wives could not have children after kupindirwa mumba. Other practices that also promoted step-parenting were boy-child preferences, where men were encouraged to have children outside their matrimonial unions in search of sons.\n\nAlthough conception challenges are normal biological or scientific issues that affect both men and women, in the Zimbabwean context, women are disproportionately affected. Kupindirwa mumba, for example, worked on the assumption that women must not have fertility problems. If they had, that increased their vulnerability to divorce, polygamous unions or to contend with their husbands having children outside marriage and ill-treatment by family and society. The practice also forced women to have multiple sexual relations in the name of their brothers/uncles and uncles relatives. This increases the risk of transmissible diseases.\n\nAlthough Zimbabwean society has evolved, it still upholds patriarchal notions and harmful practices that impose the burden and responsibility to mitigate against divorce, polygamy and forced multiple sexual relationships on women. A recent visit to Zimbabwe by the United Nations Working Group on discrimination against women and girls noted the negative impacts of polygamy on women and the overall societal health and socio-economic wellbeing.\n\nWomens movements in Zimbabwe have carried out decades of work challenging harmful practices and promoting equal rights and dignified treatment of children, women and men in all aspects of life. They continue to fight gender-based violence and call for the respect of the Constitution of Zimbabwe.\n\nTelevised DNA testing is doing more harm than good\n\nIn Zimbabwe, particularly through social media broadcasts, DNA testing has not only become an instrument of entertainment, but commercialisation of families real-life private problems and exposure of children and women to TFGBV.\n\nIn such instances, DNA testing has become a burgeoning business that thrives on the exploitation and commercialisation of families vulnerability, misfortunes, misery and poverty as social media content.\n\nTelevised tests are offered to couples at discounted rates compared to the private issuance of test results. A snapshot survey with four women and three men who took DNA tests shows that they were offered two options for the cost of DNA testing by a private laboratory. The cost of televised results announcement was US$150 as of August 2025. Private tests were charged at US$220. Average salaries for civil service personnel, which accounts for the majority of the formally employed population in Zimbabwe, range between US$100 to US$500.\n\nThe 2021 World Bank report on Zimbabwe characterised more than half of Zimbabwes population as living in extreme poverty, below the poverty datum line of US$29,80 per person per month. In this plight, televised DNA testing and results announcement are used to entice desperate families; however, at huge emotional and psychological costs in the form of public humiliation, broken relationships, and societal violence perpetrated through technology. Some of the women and men who participate in the televised tests end up switching off their phones and getting off social media as a result of personal pressure and attacks from family members, friends and society in general.\n\nThe impact on children is also huge and long-lasting, as they forever encounter public humiliation as part of their involuntary digital media footprint. They are forced to carry their parents burdens of trust and mistrust, life-changing questions they have no right or say in.\n\nIn a patriarchal society like Zimbabwe, public DNA testing has become a tool for reinforcing toxic masculinity while undermining mens mental health. Men who take public DNA tests are, on the surface, glorified particularly through social media, yet their mental health is not prioritised. Some of them coerce their wives to do public testing to shame them, but battling mental health challenges in private.\n\nTheir vulnerability, in a complex context of patriarchy and harmful cultural practices, is offered as DNA entertainment shows. Yet for them, their performance does not end with the producer clicking the stop button and begins to enjoy profits from their pain. It marks the reality of life-changing situations that could respectfully be resolved in a supportive environment. The issues that may be at stake in their lives are instead compounded by real and imagined public comments facilitated by digital platforms, exacerbating mental health.\n\nA study published by the Research and Scientific Innovation Society shows that mental health-related illnesses and risks, such as depression, drug and substance abuse and suicides, are leading causes of death among men. The reports add that although deeply affected by mental health, men rarely seek support.\n\nPublic DNA testing on television and social media should be banned. It infringes on childrens rights, the privacy of peoples data, and fuels mental health and other dangerous consequences. It also perpetuates TFGBV.\n\nAccording to the Sexual Violence Research Initiative, TFGBV is an act that is committed using information communication technologies or other digital tools, which results in physical, sexual, psychological, social, political or economic harm, or other infringements of rights and freedoms. DNA testing and use through social media platforms is contributing to individually and collectively targeted gender-based violence and reproducing patriarchy. If not urgently regulated, this will counter the countrys goal to mitigate against gender-based violence and promote safe digital spaces, homes and communities.\n\nPolicy considerations\n\nWhile DNA testing can be used for solving paternal disputes, the law must ensure that this is done in ways that uphold human dignity, safeguard children and give deep consideration to affected couples and their families mental health. Childrens rights that are provided for in the Constitution of Zimbabwe must be upheld. Section 81(2) of the Constitution states that a childs best interests are paramount in every matter concerning the child.\n\nAlthough parental consent may be sought for televised results, children are directly and perpetually affected by the publicity, as the content remains available online. DNA-related dispute resolution mechanisms also need to protect the rights to privacy (section 57) of the involved parties. Involved parties need to be encouraged to seek relevant and professional support for their mental health and the legal implications of their varying situations. Additionally, both women and men need to be protected from TFGBV.\n\nThere is a need to educate the Zimbabwean society on fertility, complications associated with such, while promoting human rights and the dignity of women and men to mitigate against discrimination. There is also a need to encourage the State to invest in research, innovation and promotion of safe, healthy and scientifically proven methods of supporting families that experience fertility challenges.\n\nGlanis Changachirere is the team leader of the Institute for Young Women Development, an organisation that promotes young womens rights. She is also the regional coordinator of the African Women Leaders Forum, a network that fosters young womens leadership across Africa. She can be contacted at[emailprotected]. The author conducted interviews with purposively sampled women and men who have done DNA testing privately and publicly. Insights from the interviews added to the views expressed in this write-up.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Glanis Changachirere| DNA testing and its use in private family matters of biological relationships must be regulated by law. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/televised-dna-testing-must-be-banned-in-zim/\">Continue reading<span class=\"screen-reader-text\"> \"Televised DNA testing must be banned in Zim\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "Mnangagwa Ambushes VP Chiwenga, Reads Riot Act",
            "url": "https://www.zimeye.net/2025/08/28/mnangagwa-ambushes-vp-chiwenga-reads-riot-act/",
            "content": "By A Correspondent President Emmerson Mnangagwa on Wednesday used the Zanu PF Politburo meeting to issue a stern warning against factionalism and indiscipline, delivering what sources described as a riot act in the absence of his deputy, Constantino Chiwenga.\n\nMnangagwa, without naming individuals, cautioned senior party leaders against using the Zanu PF name to advance personal interests, stressing that divisive conduct would not be tolerated.\n\nThe warning comes amid renewed factional tensions within the ruling party, fuelled by the unresolved question of succession. For years, Zanu PF has been split between camps aligned with Mnangagwa and those rallying around Chiwenga, the former army general who played a decisive role in the 2017 coup that toppled Robert Mugabe and installed Mnangagwa.\n\nChiwenga, who has long been seen as a potential successor, was conspicuously absent from the meeting, said to be on official business in India  a trip that state media curiously did not report, fuelling speculation of internal manoeuvres.\n\nMnangagwas remarks follow weeks of contradictory statements from senior party figures, which exposed deep divisions. Party spokesperson Christopher Mutsvangwa recently told journalists that businessman Kudakwashe Tagwirei  a close ally of Mnangagwa and a newly co-opted Central Committee member  could not buy his way to the top of the party. He claimed safeguards were in place to block Tagwireis rise.\n\nBut Secretary for Legal Affairs Patrick Chinamasa contradicted him, suggesting in a post on X (formerly Twitter) that attempts to stop Tagwireis influence were futile, reflecting an apparent split in the partys messaging.\n\nChairing the 386th Ordinary Session of the Politburo at the partys Harare headquarters, Mnangagwa rebuked the discord, saying Zanu PF leaders must be guided by unity and discipline.\n\nWe must all speak with one voice and march in one direction. Leaders of the party are bound by collective responsibility and must unite around party decisions and resolutions, which serve as our ideological and moral compass.\n\nHauroti zvinhu kumba kwako woenda uchitaura sehurongwa hwemusangano. Our communication must be disciplined. MuZanu PF tinomira pachokwadi. Zvemazvake-mazvake, pasi nazvo.\n\nMnangagwas carefully worded message is widely interpreted as a shot across the bow directed at Chiwengas camp, which has grown increasingly restless ahead of the partys elective congress. While Mnangagwa is seeking to tighten his grip on the succession matrix by elevating allies such as Tagwirei, Chiwenga retains significant support within the military establishment and sections of the partys grassroots.\n\nThis is not the first time Mnangagwa has sought to rein in factional behaviour in Chiwengas absence. Political observers note that Mnangagwa has consistently used Politburo and Central Committee meetings to consolidate authority, often sidelining rivals through public reprimands and veiled warnings.\n\nWith succession uncertainty intensifying, Mnangagwas latest intervention underscores his determination to stamp out dissent, even as Chiwengas loyalists continue to push back against the growing influence of business-linked allies around the President.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa on Wednesday used the Zanu PF Politburo meeting to issue a stern warning against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/mnangagwa-ambushes-vp-chiwenga-reads-riot-act/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ambushes VP Chiwenga, Reads Riot Act\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "Deputy Higher Education Minister ‘Fired’",
            "url": "https://www.zimeye.net/2025/08/28/deputy-higher-education-minister-fired/",
            "content": "By A Correspondent Deputy Higher Education Minister and Zanu PF Bubi legislator, Simelisizwe Sibanda, has been barred from accessing provincial offices and attending party meetings amid accusations of gross misconduct and bringing the party into disrepute.\n\nThe Zanu PF Matabeleland North provincial leadership accuses Sibanda of defying party structures, creating parallel structures, and making statements deemed damaging to the partys image.\n\nIn a letter dated Monday, provincial disciplinary committee chairperson Silas Maligo outlined charges against Sibanda, saying his conduct violated the partys constitution and undermined unity.\n\nYour behaviour has the potential to provoke division, disunity or impact negatively on the unity of the party by creating and promoting your own parallel structures, Maligo wrote.\n\nAmong the allegations, Sibanda is accused of:\n\nFollowing complaints by the Bubi DCC, the provincial executive council met on Sunday and resolved to issue a prohibition order against Sibanda, effective August 24, pending a full disciplinary hearing.\n\nThe order bars him from performing any duties as a DCC member, entering provincial or party offices, and attending Zanu PF gatherings. He has 21 days to respond to the allegations before a hearing scheduled for November 19.\n\nContacted yesterday, Sibanda said he was unaware of the prohibition order.\n\nThis is not the first time the outspoken legislator has courted controversy. In July last year, President Emmerson Mnangagwa fired Sibanda from his deputy ministerial post after he sparked outrage for transferring an early childhood development teacher from Bubi district on the grounds of insufficient proficiency in isiNdebele. He was, however, reinstated weeks later after issuing what insiders described as profuse apologies.\n\nThe latest developments raise fresh questions about Sibandas political future as Zanu PF battles to contain internal dissent in its provincial structures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Deputy Higher Education Minister and Zanu PF Bubi legislator, Simelisizwe Sibanda, has been barred from accessing provincial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/deputy-higher-education-minister-fired/\">Continue reading<span class=\"screen-reader-text\"> \"Deputy Higher Education Minister ‘Fired’\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "Govt Admits Economy is Crumbling",
            "url": "https://www.zimeye.net/2025/08/28/govt-admits-economy-is-crumbling/",
            "content": "HARARE  Zimbabwes business community has raised alarm over the countrys deteriorating operating environment, warning that unless urgent reforms are implemented, more companies will be forced to shut down under the weight of economic pressures.\n\nMeeting Industry and Commerce Minister Mangaliso Ndlovu in Harare on Monday, captains of industry pressed government to prioritise easing regulatory burdens, tackling currency instability and addressing ballooning compliance costs that are eroding private sector viability.\n\nZimbabwe currently ranks 124th globally and 20th in Africa on competitiveness, dragged down by policy inconsistencies, exchange rate volatility and macroeconomic instability.\n\nCompanies Struggling to Survive\n\nReports show that several companies are already downsizing, while others are closing altogether, citing unsustainable overheads. At last weeks National Competitiveness Commission Summit, Ndlovu conceded that despite growth in some sectors, Zimbabwes economy is bleeding from deep-seated structural problems.\n\nStatistics show growth in the manufacturing sector, but growing levels of informalisation remain a challenge, Ndlovu admitted, adding that government was working on eliminating repetitive licences within six months to ease costs.\n\nBusiness Voices: Urgency is Critical\n\nBusiness leaders at the meeting stressed that reforms must be accelerated under the National Development Strategy 2 (NDS 2) framework if Zimbabwe is to reverse its economic decline. Zimbabwe National Chamber of Commerce (ZNCC) president Tapiwa Karoro:These engagements are vital in shaping the nations growth trajectory, but we must acknowledge the alarming constraints businesses face daily  from excessive compliance costs to currency volatility. What we have done today should be a launchpad for easing the cost of doing business. CBZ Holdings chairperson Luxon Zembe:While we accept that government is making efforts to position Zimbabwe as a favourable destination, the private sector wants to complement those efforts towards a win-win situation. CEO Africa Roundtable chairperson Oswell Binha:Challenges remain, but they can be overcome if confidence is restored in both the short and long term. With a shared national purpose, the economy can move forward.\n\nDebt and Financing Cloud Over Business\n\nZimbabwes economic headwinds are compounded by a crippling debt crisis, with public debt at US$21.2 billion in 2023, largely due to external arrears and legacy obligations. Access to concessional finance remains blocked.\n\nGovernment insists it is committed to an IMF-backed reform programme, focusing on restoring fiscal discipline, improving state enterprise transparency and anchoring monetary policy on rules-based frameworks.\n\nWay Forward\n\nThe latest meeting ended with a resolution to strengthen governmentprivate sector relations to create a more conducive business environment. However, with companies collapsing, debt unsustainable, and competitiveness sliding, the pressure is mounting for government to match promises with tangible reforms.\n\nThe business community has now made it clear: without urgent action, Zimbabwes economy risks further haemorrhage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "HARARE – Zimbabwe’s business community has raised alarm over the country’s deteriorating operating environment, warning that unless urgent reforms are … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/govt-admits-economy-is-crumbling/\">Continue reading<span class=\"screen-reader-text\"> \"Govt Admits Economy is Crumbling\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "VP Chiwenga’s Full Speech In India",
            "url": "https://www.zimeye.net/2025/08/28/vp-chiwengas-full-speech-in-india/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "British Tycoon Nicholas van Hoogstraten Loses Bid for Harare Mansion",
            "url": "https://www.zimeye.net/2025/08/28/british-tycoon-nicholas-van-hoogstraten-loses-bid-for-harare-mansion/",
            "content": "HARARE  Controversial British property mogul Nicholas van Hoogstraten has lost his latest High Court attempt to claim ownership of a luxury Harare mansion after a judge ruled that his long-dormant case had lapsed under new judicial rules.\n\nVan Hoogstraten, who once styled himself as Zimbabwes biggest foreign landowner, sought to compel the Sheriff of the High Court to transfer Stand No. 4 Wroxham Road, The Grange, into his name and evict the former owner, Felistas Runyararo James. He also cited the Registrar of Deeds as a respondent.\n\nBut in a strongly worded ruling, Justice Joel Mambara dismissed the businessmans application with costs, describing it as egregiously delayed, procedurally defective, and overtaken by events.\n\nA Property Battle Stretching Back Two Decades\n\nThe saga began in 2005, when Jamess property was sold in execution to satisfy a debt. Van Hoogstraten was the highest bidder at auction and the sale was confirmed. He insists this gave him indefeasible rights to the property.\n\nHowever, James contested the sale through multiple court appeals, all dismissed, before allegedly making a private arrangement with the judgment creditor and the Sheriffs office. After tendering full payment of the debt, she allegedly managed to have Van Hoogstratens cheque returned, even though the sale had already been confirmed.\n\nBy 2013, the property had been transferred to the Richard Samaita Family Trust, which still holds the title. James moved out, but Van Hoogstraten never challenged the transfer at the time.\n\nDormant Case Fatally Lapsed\n\nInstead, Van Hoogstraten relied on an earlier lawsuit filed in 2009 (HC 2047/09) to enforce transfer. That case lay dormant for more than a decade until the adoption of Practice Direction 1 of 2022, which automatically lapses any civil action inactive for more than two years.\n\nBy March 2024, the tycoons summons was deemed abandoned. Though he claimed administrative delays in retrieving the court file explained the inaction, the judge was not persuaded.\n\nThe applicant did not avail himself of the remedy provided in the practice direction seeking an extension within the prescribed time, ruled Justice Mambara.While he asserts a morally and legally sympathetic claim, the delay is egregious there comes a point when even a meritorious claim must yield to the greater good of certainty and finality.\n\nA Futile Fight\n\nThe court found that Van Hoogstratens case had become largely moot since the property was transferred to a third party more than a decade ago. Granting relief now, the judge said, would amount to a brutum fulmen  a legally empty act.\n\nAs a result, the application was dismissed with costs on the punitive legal practitionerclient scale.\n\nWhat It Means\n\nThe ruling marks a decisive defeat for Van Hoogstraten in his protracted fight over the upmarket Harare home. Once famed for his vast estates in Zimbabwe and often described as a feared landlord, the tycoon has now lost a claim he has pursued intermittently for nearly 20 years.\n\nThe property, meanwhile, remains firmly under the control of the Richard Samaita Family Trust, closing yet another chapter in Van Hoogstratens long history of courtroom battles in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "HARARE – Controversial British property mogul Nicholas van Hoogstraten has lost his latest High Court attempt to claim ownership of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/british-tycoon-nicholas-van-hoogstraten-loses-bid-for-harare-mansion/\">Continue reading<span class=\"screen-reader-text\"> \"British Tycoon Nicholas van Hoogstraten Loses Bid for Harare Mansion\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "Devastating Fire Kills Woman",
            "url": "https://www.zimeye.net/2025/08/28/devastating-fire-kills-woman/",
            "content": "By A Correspondent\n\nA devastating fire incident claimed the life of a 47-year-old woman in Eastview, Harare, on August 25, 2024, at around 2200 hours.\n\nAccording to the Zimbabwe Republic Police (ZRP), the victim, Sanisai Kandowe, tragically lost her life when the wooden cabin she was sleeping in caught fire.\n\nThe ZRP said: The victim, Sanisai Kandowe (47) lost her life when a wooden cabin she was sleeping in caught fire. The body was burnt to ashes.\n\nThe authorities are working to determine the cause of the fire, with investigations currently underway. The ZRP stated, Investigations are in progress to determine the cause of the fire.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating fire incident claimed the life of a 47-year-old woman in Eastview, Harare, on August 25, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/devastating-fire-kills-woman/\">Continue reading<span class=\"screen-reader-text\"> \"Devastating Fire Kills Woman\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "Double Tragedy Rocks Norton, MP Demands Answers",
            "url": "https://www.zimeye.net/2025/08/28/double-tragedy-rocks-norton-mp-demands-answers/",
            "content": "By A Correspondent\n\nNorton has been shaken by the discovery of two bodies in the Katanga area over the past two days. Norton Member of Parliament,Honourable Richard Tsvangirai, has called for justice and increased security following the shocking incidents.\n\nIn a statement on Wednesday, Tsvangirai said: Our community has endured two very dark days. On Monday, Katanga was shaken by the shocking discovery of the late Patrice Chipaumire, whose body was found under disturbing circumstances. Before the community could recover from this grief, yet another tragedy struck on Tuesday morning with the discovery of Jack Gedion, whose body was also found in similarly disturbing circumstances in the same area.\n\nThe MP extended his condolences to the families affected: I share in the deep sorrow and shock these events have caused. My heartfelt condolences go to the families who have lost their loved ones under such painful circumstances. Please know that your grief is our grief, and you are not alone during this time.\n\nTsvangirai confirmed that he has visited the bereaved families to offer support and solidarity, and assured residents that investigations are ongoing. I have also spoken with law enforcement authorities and investigations are currently ongoing. Justice must not only be done, it must be seen to be done. We will not rest until answers are found and those responsible are held accountable, he said.\n\nHe further called for heightened police presence in the area: I further call for intensified police patrols in the area to reassure residents and enhance community safety.\n\nThe MP also urged residents to remain vigilant: I urge you to remain vigilant and avoid unnecessary movements during late hours. I know fear and uncertainty weigh heavily on us, but let us not lose our sense of community. Let us watch over one another, support the grieving, and remain calm as investigations unfold.\n\nHe concluded with a message of resilience: Together, we will overcome this dark moment and stand stronger as one community.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Norton has been shaken by the discovery of two bodies in the Katanga area over the past … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/28/double-tragedy-rocks-norton-mp-demands-answers/\">Continue reading<span class=\"screen-reader-text\"> \"Double Tragedy Rocks Norton, MP Demands Answers\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        },
        {
            "title": "Why VP Chiwenga Missed Mnangagwa Meeting",
            "url": "https://www.zimeye.net/2025/08/27/why-vp-chiwenga-missed-mnangagwa-meeting/",
            "content": "By Correspondent Vice President Constantino Chiwengas absence from Wednesdays urgent Zanu PF Politburo meeting has reignited speculation about his health and deepening rifts within the ruling party.\n\nState media images from the high-profile gathering at Zanu PF headquarters in Harare showed two glaringly empty chairs reserved for the Vice Presidents, Chiwenga and Kembo Mohadi, even as other senior heavyweights including Patrick Chinamasa and Obert Mpofu were in attendance.\n\nGovernment sources toldZimEyethat Chiwenga is currently in India on official duty. Yet, unusually, state media made no mention of his departure  a silence that has fueled speculation about whether the trip is official or private.\n\nFor years, Chiwenga has relied on medical treatment in Asia following the near-fatal injuries he sustained during the 2018 Bulawayo White City Stadium bombing, where he narrowly survived an assassination attempt at a Mnangagwa campaign rally. Since then, the retired general has battled recurring health crises, including extended hospital stays in China in 2019, which saw him largely absent from the political scene. His health remains a closely guarded secret, often sparking rumors whenever he disappears from the public eye.\n\nThe timing of his absence is politically sensitive. The Politburo convened amid widening cracks in Zanu PF, triggered by President Emmerson Mnangagwas recent title deeds distribution programme in Mazowe West. The promotional poster for the event prominently featured businessman Kudakwashe Tagwirei, overshadowing even the President himself. This not only enraged party insiders but also fanned speculation that Mnangagwa is elevating his business ally as part of a long-term succession plan  a move that threatens to sideline Chiwengas military-backed faction.\n\nChiwenga, who led the 2017 coup that propelled Mnangagwa into power, has long been viewed as his most formidable rival. While Mnangagwa has leaned increasingly on business elites such as Tagwirei, Chiwenga retains strong backing from sections of the military and war veterans who see him as the custodian of the coups legacy. The tension between the two camps has simmered for years, with occasional public flare-ups over appointments, patronage networks, and Mnangagwas alleged bid to extend his rule beyond 2028.\n\nAgainst this backdrop, Chiwengas conspicuous absence from a meeting described by insiders as potentially explosive has been interpreted as more than just a scheduling clash. For observers, it signals both the fragility of his health and the fragility of Zanu PFs unity  with factional battles once again threatening to spill into the open.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Correspondent – Vice President Constantino Chiwenga’s absence from Wednesday’s urgent Zanu PF Politburo meeting has reignited speculation about his health … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/27/why-vp-chiwenga-missed-mnangagwa-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Why VP Chiwenga Missed Mnangagwa Meeting\"</span></a></p>",
            "time": "09:31",
            "date": "29 Aug 2025"
        }
    ]
}