{
    "news": [
        {
            "title": "Mafume Faces Prison as Harare Commission of Inquiry Concludes",
            "url": "https://www.zimeye.net/2025/06/18/mafume-faces-prison-as-harare-commission-of-inquiry-concludes/",
            "content": "By Municipal Reporter-Sengezo Tshabangu close ally and Harare Mayor Jacob Mafume could face jail time after Local Government Minister Daniel Garwe recommended prosecution of city officials implicated in corruption and poor governance, following the conclusion of a year-long Commission of Inquiry into the affairs of the Harare City Council.\n\nThe commission, chaired by retired High Court judge Justice Maphios Cheda, submitted its final report to President Emmerson Mnangagwa at State House on Tuesday.\n\nThe inquiry was initiated by the President in 2023 to investigate suspected financial mismanagement, corruption, and service delivery failures within Zimbabwes capital city.\n\nThe commissions findings painted a grim picture of systemic rot at Town House.\n\nIt exposed widespread corruption, abuse of office, and lavish spending by officials under Mafumes leadershipdespite the council routinely citing a lack of funds to justify failure to deliver basic services to residents.\n\nHarare City Council is decayed to the core, Garwe said following the handover of the report. That is why the President established the Commission of Inquiryto investigate the severe governance failures in our urban local authorities. Harare is the worst, followed by Bulawayo.\n\nHe said the commission uncovered shocking levels of extravagance, with top city officials awarding themselves hefty perks and allowances while ordinary residents grappled with unsafe drinking water, garbage piles, and deteriorating roads.\n\nGarwe indicated that if the commissions report provides evidence of criminal conduct, including financial impropriety, the implicated officialsMayor Mafume includedcould face arrest and prosecution.\n\nThe President will study the report and act on its recommendations. Where criminal activities are confirmed, those responsible should face the full wrath of the law, including imprisonment, Garwe said.\n\nJustice Cheda confirmed that the commission conducted nine months of public hearings, during which various stakeholdersincluding residents, city employees, and expertstestified about the dysfunction at Town House.\n\nThe report is expected to trigger a major clean-up of the citys governance structures once reviewed by the President.\n\nMafume, as the sitting mayor, remains politically and administratively accountable for the state of affairs at the Harare City Council. His future now hinges on the decisions President Mnangagwa will take after reviewing the findings and recommendations of the Commission of Inquiry.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Municipal Reporter-Sengezo Tshabangu close ally and Harare Mayor Jacob Mafume could face jail time after Local Government Minister Daniel … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/mafume-faces-prison-as-harare-commission-of-inquiry-concludes/\">Continue reading<span class=\"screen-reader-text\"> \"Mafume Faces Prison as Harare Commission of Inquiry Concludes\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Magaya In Embarrassing US$500K GetBucks Debt",
            "url": "https://www.zimeye.net/2025/06/18/magaya-in-embarrassing-us500k-getbucks-debt/",
            "content": "By A Correspondent Controversial preacher and Prophetic Healing and Deliverance Ministries leader Walter Magaya, alongside his wife Tendai, is facing liquidation proceedings at the High Court over an unpaid US$420,140.72 debt owed to GetBucks Microfinance Bank.\n\nThe application, filed in the Commercial Division of the High Court, follows a judgment issued on October 9, 2024, ordering the Magayas and their company, Planet Africa (Pvt) Ltd, to repay the bank with 10% interest per month from September 11, 2024, until the debt is fully paid.\n\nDespite numerous recovery attempts, the bank says the couple remains insolvent.\n\nMovable assets at their home were shielded through a successful interpleader filed by the Walter Magaya Family Trust, while assets at Planet Africas offices were claimed by PHD Ministries, also led by Magaya.\n\nA property under Deed of Transfer 4076/2018 was set for auction on March 28, 2025, but the sale was stopped after Planet Africa entered voluntary corporate rescue.\n\nGetBucks argues that all recovery avenues have been exhausted, prompting the call for liquidation under Section 6 of the Insolvency Act (Chapter 6:07).\n\nThe bank nominated Noreen Chikaka of Reign Management Consultancy (Pvt) Ltd as liquidator, citing her professional expertise.\n\nThe application claims liquidation is in the best interest of all creditors, as it would prevent further debt accumulation and force the Magayas to reveal financial information allegedly being concealed.\n\nAlarmingly, the bank also petitioned the court to order the surrender of the couples passports, warning they could flee to evade accountability.\n\nThe respondents have no known assets and have neglected statutory demands, the application reads. They may want to leave the country to evade the law liquidation will force them to account for their financial affairs.\n\nThe case is scheduled to be heard in the High Court on Wednesday.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Controversial preacher and Prophetic Healing and Deliverance Ministries leader Walter Magaya, alongside his wife Tendai, is facing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/magaya-in-embarrassing-us500k-getbucks-debt/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya In Embarrassing US$500K GetBucks Debt\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "WATCH: Israel Tel Aviv Skies Right Now",
            "url": "https://www.zimeye.net/2025/06/18/watch-israel-tel-aviv-skies-right-now/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "UK Zimbos Block Auxillia from London Summit",
            "url": "https://www.zimeye.net/2025/06/18/uk-zimbos-block-auxillia-from-london-summit/",
            "content": "LONDON  Zimbabweans based in the United Kingdom have successfully blocked First Lady Auxillia Mnangagwa from attending a high-profile summit in London, forcing organisers to quietly remove her from the programme.\n\nMnangagwa was expected to speak at the First Ladies of Africa Impact and Resilience (FLAIR) Summit, held from 17 to 18 June at the Royal Leonardo Hotel near Tower Bridge.\n\nHowever, she was noticeably absent from the event after activists mobilised demonstrations against her visit, citing allegations of corruption, abuse of state resources, and complicity in human rights violations in Zimbabwe.\n\nThe protests had been brewing for weeks, with UK-based Zimbabwean civil society organisations, human rights activists, and members of the diaspora issuing public calls for the UK government to bar her entry.\n\nThey also petitioned event organisers to deplatform the First Lady, accusing her of using philanthropic fronts to sanitise a repressive regime.\n\nIn anticipation of protests, Labour MP Dawn Butler withdrew from the summit in protest against Auxillias scheduled appearance. According toThe Standardnewspaper, Butlers exit triggered an emergency meeting among the organisers, which resulted in Auxillia being quietly dropped from the speaker lineup.\n\nInstead of travelling to London, Auxillia flew to Dubai, where she attended the Merck Foundations First Ladies Initiative Summit from 18 to 19 June. Posting on her official X account while the London event was underway, she wrote:\n\nToday, I met with Mr. Prateek Suri, an Indian billionaire and CEO of Maser Group on the sidelines of the 7th Merck Foundation First Ladies Initiative Summit 2025 underway in Dubai and we discussed several investment opportunities in Zimbabwe in education, sports, mining and infrastructure development sectors. Mr. Suri expressed interest in the construction of a university in Harare with student accommodation facilities at the campus. I invited him to Zimbabwe to have further deliberations with the relevant Cabinet Ministers because Zimbabwe is open for business.\n\nToday, I met with Mr. Prateek Suri, an Indian billionaire and CEO of Maser Group on the sidelines of the 7th Merck Foundation First Ladies Initiative Summit 2025 underway in Dubai and we discussed several investment opportunities in Zimbabwe in education, sports, mining andpic.twitter.com/sUejlxymtD\n\nPresidential spokesperson George Charamba downplayed the First Ladys no-show in London, claiming that she had chosen to skip the event due to scheduling conflicts.\n\nYou can be invited, but you can also turn down an invite, said Charamba, insisting that Auxillia had a full plate with other engagements.\n\nDespite the official explanation, Zimbabweans in the UK have hailed her absence as a diplomatic victory and a show of accountability by citizens in the diaspora. Activists say they will continue to oppose public appearances by senior Zimbabwean officials abroad until there are meaningful reforms back home.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "LONDON – Zimbabweans based in the United Kingdom have successfully blocked First Lady Auxillia Mnangagwa from attending a high-profile summit … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/uk-zimbos-block-auxillia-from-london-summit/\">Continue reading<span class=\"screen-reader-text\"> \"UK Zimbos Block Auxillia from London Summit\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "UK Denies Julius Malema Visa Over “Extremist” Song and Support for Hamas",
            "url": "https://www.zimeye.net/2025/06/18/uk-denies-julius-malema-visa-over-extremist-song-and-support-for-hamas/",
            "content": "By Farai D Hove | London, 18 June 2025  South African opposition leader Julius Malema has once again been denied a UK visa, this time in a damning refusal letter from the United Kingdom Home Office citing his extremist positions, repeated justification for terrorist violence, and incendiary comments about race.\n\nThe decision, made by the UK Visas and Immigration Decision Making Centre, explicitly states that Malemas presence in the country is not conducive to the public good. It is the second time the leader of the Economic Freedom Fighters (EFF) has been blocked from entering the UK.\n\nAccording to the letter dated 17 June 2025, the UK Home Secretary referenced Malemas repeated public support for Hamas, a proscribed terrorist organisation under British law, and his controversial remarks regarding the slaughter of white people.\n\nI note that you have made statements calling for the slaughter of white people or hinted that it could be an acceptable option in the future, reads the Home Office letter, citing Malemas 2016 statement: We are not calling for the slaughter of white people at least for now.\n\nMalemas refusal comes in the wake of fresh scrutiny over his public speeches and online posts, including an October 2023 rally outside the Israeli Embassy in Pretoria where he vowed to arm Hamas if his party came to power.\n\nHe later posted on X (formerly Twitter), defending the Hamas-led 7 October attack on Israel, writing, There is nothing wrong Hamas did.\n\nThe Home Office said that such remarks  along with the EFFs official support for armed struggle by both Hamas and Hezbollah  amount to justification of terrorist violence.\n\nNo Right to Appeal\n\nThe decision is final. According to the UK Home Office, There is no right of appeal or right to administrative review.\n\nThe Home Secretary added that any future applications will be considered on their individual merits, but warned that Malema is likely to be refused unless the circumstances of [his] application change.\n\nI consider that the above statements, notably that your political party would arm a proscribed organisation and other statements you made justifying the actions of proscribed terrorist organisations, mean your presence in the UK is not conducive to the public good.\n\nThe refusal comes as Malema continues to polarise opinion in South Africa and beyond. Critics say his rhetoric incites racial hatred and glorifies violence, while supporters argue he is a misunderstood revolutionary speaking uncomfortable truths.\n\nPopular South African musician and satirist The Kiffness reacted sharply to the UKs move, tweeting:\n\nCouldnt have happened to a nicer guy.\n\nAnother user, RobbC (@IndunaRobb), added:\n\nIts hate speech and our courts should really reevaluate the judgement that allows him to sing it Hopefully a lot of our corrupt cadres are sanctioned and deprived of all the Western/colonial benefits they so desire\n\nLong History of Controversy\n\nIn addition to his support for Hamas, the Home Office cited Malemas 2024 interview in which he said:\n\nHamas legitimately resisted Israels occupation of Palestine It was not an act of war.\n\nHe has also repeatedly refused to distance himself from calls for racial violence, telling a court in 2022:\n\nI cant guarantee I wont call for the slaughter of white people.\n\nWhile Malema has attempted to clarify his cutting the throat of whiteness remarks as metaphoric, the UK authorities remain unconvinced.\n\nWhat It Means Going Forward\n\nThe visa ban significantly curtails Malemas international mobility and could damage his partys credibility abroad. Analysts say this development could set a precedent for other Western countries reviewing similar cases involving inflammatory political rhetoric and associations with outlawed groups.\n\nUnder UK immigration rules, any individual whose conduct, character, or associations are deemed a threat to the public good can be excluded without recourse to appeal.\n\nThe Home Office concluded:\n\nA persons presence in the UK may be considered not conducive to the public good if the individual has been involved in unacceptable behaviour, including past or current extremist behaviour. This covers any medium used to justify or glorify terrorist violence.\n\nMalemas office has not yet issued a formal response.\n\nStory developing\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | London, 18 June 2025 — South African opposition leader Julius Malema has once again been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/uk-denies-julius-malema-visa-over-extremist-song-and-support-for-hamas/\">Continue reading<span class=\"screen-reader-text\"> \"UK Denies Julius Malema Visa Over “Extremist” Song and Support for Hamas\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Chimombe, Mpofu Trial Drags On As Assessor Falls Sick",
            "url": "https://www.zimeye.net/2025/06/18/chimombe-mpofu-trial-drags-on-as-assessor-falls-sick/",
            "content": "THE High Court trial involving Mike Chimombe and Moses Mpofu, accused of a US$7 million fraud linked to the Presidential Goats Pass-On Scheme, faced another delay yesterday.\n\nThe trial could not proceed because one of the assessors fell ill.Justice Pisirayi Kwenda, presiding over the matter, postponed the trial to June 30 after both the prosecution and defence agreed to the adjustment.\n\nOnly one witness, Ms Precious Issa, had been called in preparation for the trials resumption before the delay.\n\nAt the centre of the case is a decision on whether the original goats supply tender document, which is critical to the fraud allegations, can be included as evidence at this stage.\n\nThe defence has strongly opposed the introduction of the document, arguing that it violates the principles of fairness.\n\nThe prosecution, however, maintains that the document is vital to proving their claims and supports their allegations of fraud.\n\nThis disagreement has sparked intense legal arguments, creating a decisive moment for the trial.The judges ruling on the matter will influence the direction of the trial.\n\nThe cross-examination of the fifth State witness depends on whether the document is admitted.\n\nBoth legal teams are closely watching the courts decision, each hoping for an outcome that reinforces their arguments.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "THE High Court trial involving Mike Chimombe and Moses Mpofu, accused of a US$7 million fraud linked to the Presidential … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/chimombe-mpofu-trial-drags-on-as-assessor-falls-sick/\">Continue reading<span class=\"screen-reader-text\"> \"Chimombe, Mpofu Trial Drags On As Assessor Falls Sick\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Trent’s Arrival Boosts Los Blancos",
            "url": "https://www.zimeye.net/2025/06/18/trents-arrival-boosts-los-blancos/",
            "content": "Sports Correspondent\n\nWith Trent Alexander-Arnold joining Real Madrid and Xabi Alonso bringing fresh tactical ideas to the fold, something exciting appears to be brewing in the Spanish capital. Their upcoming match against Al Hilal is projected to feature 3.03 goals  a sign of the attacking firepower Madrid is expected to unleash.\n\nOne of the biggest beneficiaries of Trents arrival is none other than Kylian Mbapp. The French forward, already a shot machine, now has a world-class provider feeding him from deep and wide areas. Known for his precision crosses and creative vision, Trent offers a new dimension to Madrids attacking structure.\n\nEven without Trent, Mbapp was already among the most threatening forwards in Europe last season. In the 2024/25 campaign, he averaged 4.71 shots per 90 minutes  the second-highest across Europes top five leagues, trailing only Ousmane Dembl of PSG (4.99). He also averaged 2.32 shots on target per 90, again second-best behind the French winger.\n\nIn terms of end product, Mbapp dominated La Liga, netting 31 goals  more than any other player in the top five European leagues. His 25.9 expected goals (xG) tally was only surpassed by Robert Lewandowskis 27.1 xG, highlighting how prolific and efficient he was in front of goal.\n\nAs the team prepares for a high-profile summer in the U.S., Mbapp looks poised to shine on the international stage. With Alexander-Arnolds elite delivery and Alonsos progressive tactics, the French star could very well claim the tournaments Golden Boot. Few would be surprised if he does.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent With Trent Alexander-Arnold joining Real Madrid and Xabi Alonso bringing fresh tactical ideas to the fold, something exciting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/trents-arrival-boosts-los-blancos/\">Continue reading<span class=\"screen-reader-text\"> \"Trent’s Arrival Boosts Los Blancos\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Bernardo Silva Named Manchester City Captain After De Bruyne Departure",
            "url": "https://www.zimeye.net/2025/06/18/bernardo-silva-named-manchester-city-captain-after-de-bruyne-departure/",
            "content": "By A Correspondent\n\nManchester City have appointed Portuguese midfielder Bernardo Silva as the new club captain following the departure of long-serving skipper Kevin De Bruyne.\n\nSilva, who joined City in 2017 and has been instrumental in the clubs domestic and European success, will now lead the team as they prepare for a new era under manager Pep Guardiola. Known for his intelligence, versatility, and relentless work ethic, Silva is widely respected both on and off the pitch.\n\nSpeaking on the appointment, a club spokesperson said Silva embodies the values and ambition of Manchester City. Bernardo has shown consistent leadership qualities over the years and has the full respect of the dressing room, the spokesperson said.\n\nSilva will be supported by a trio of deputies: Spanish midfielder Rodri, Portuguese defender Ruben Dias, and Norwegian striker Erling Haaland  all of whom have become key figures in Citys recent dominance.\n\nThe leadership reshuffle comes as City look to defend their Premier League title and mount another challenge in Europe after their historic treble-winning campaign in 2023.\n\nFans have largely welcomed the announcement, with many praising Silvas loyalty and passion for the club. With a new captain at the helm, Manchester City will be hoping to continue their winning momentum into the upcoming season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Manchester City have appointed Portuguese midfielder Bernardo Silva as the new club captain following the departure of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/bernardo-silva-named-manchester-city-captain-after-de-bruyne-departure/\">Continue reading<span class=\"screen-reader-text\"> \"Bernardo Silva Named Manchester City Captain After De Bruyne Departure\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Farming and Record Keeping",
            "url": "https://www.zimeye.net/2025/06/18/farming-and-record-keeping/",
            "content": "By Dr Trywell Muzerengi\n\nFarming goes beyond planting crops and raising animals  it is a business that needs to be managed effectively. One of the key tools for good farm management is record keeping. Accurate and up-to-date records help farmers track activities, evaluate performance, and make informed decisions.\n\nBelow are the main types of farm records and why they matter:\n\nThese track what the farm produces, whether from crops or livestock.\n\nExamples:\n\nPlanting dates\n\nCrop types or seed varieties used\n\nHarvest quantities\n\nNumber of animals born or sold\n\nQuantity of milk, eggs, or meat produced\n\nWhy They Matter:Production records help farmers identify which crops or animals perform best. This information supports better planning, improved yields, and increased profits in future seasons.\n\nInput records show what has been used to support production on the farm.\n\nExamples:\n\nFertilizers or compost applied\n\nPesticides or organic sprays used\n\nAnimal feed purchases\n\nLabor used for various tasks\n\nWhy They Matter:These records help manage costs and ensure resources are used efficiently. Farmers can compare inputs with outputs to assess whether farming methods are cost-effective.\n\nThese detail the farms income and expenses, offering a full picture of its financial health.\n\nExamples:\n\nSales of farm produce\n\nExpenses on seeds, chemicals, or tools\n\nLoan and repayment details\n\nProfit and loss statements\n\nWhy They Matter:Financial records allow farmers to monitor cash flow, assess profitability, and make smart decisions about budgeting and investment.\n\nInventory records list all the physical assets owned or used by the farm.\n\nExamples:\n\nTools and machinery\n\nLivestock and poultry numbers\n\nStored feed, seeds, and fertilizers\n\nBuildings and storage facilities\n\nWhy They Matter:These records help keep track of valuable assets, avoid unnecessary purchases, and support farm planning and insurance claims.\n\nConclusion\n\nRecord keeping is essential for every farmer who wants to grow a successful and sustainable farming business. Whether small or large-scale, a well-documented farm gives the farmer control, clarity, and the ability to plan for a better future.\n\n[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Farming goes beyond planting crops and raising animals — it is a business that needs to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/farming-and-record-keeping/\">Continue reading<span class=\"screen-reader-text\"> \"Farming and Record Keeping\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Varakashi Celebrate Mzembi Bail Denial, Detention",
            "url": "https://www.zimeye.net/2025/06/18/varakashi-celebrate-mzembi-bail-denial-detention/",
            "content": "By A Correspondent\n\nZanu PF youths supporters, part of the Varakashi team, are celebrating the continued detention of former Tourism and Foreign Affairs Minister Walter Mzembi, who was denied bail by a Harare magistrate on Tuesday.\n\nMzembi was arrested over the weekend on the strength of three outstanding warrants after failing to appear in court. He has since been remanded in custody until July 1.\n\nTaking to social media shortly after the ruling, the ruling party-aligned group expressed satisfaction with the courts decision. Mutemo mutemo, no one is above the law, they posted on Facebook. #BreakingNews | Walter Mzembi has been remanded in custody until July 1 after magistrate Donald Ndirowei denied him bail this afternoon.\n\nThe post, widely shared within Zanu PF circles, reflects growing hostility within ruling party structures toward former senior officials who are now viewed as political outcasts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF youths supporters, part of the Varakashi team, are celebrating the continued detention of former Tourism … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/18/varakashi-celebrate-mzembi-bail-denial-detention/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi Celebrate Mzembi Bail Denial, Detention\"</span></a></p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        }
    ]
}