{
    "news": [
        {
            "title": "Prominent Mutare Businessman Dies In Horror Crash",
            "url": "https://www.zimeye.net/2025/08/30/prominent-mutare-businessman-dies-in-horror-crash/",
            "content": "By A Correspondent-prominent Mutare transport operator Mr Godfrey Chikosi, and five other have died in a tragic road accident that occurred last night at the Himalaya-Turn Off along the Mutare-Chimanimani Road.\n\nThe accident happened around 11pm, and one survivor is currently receiving treatment at Victoria Chitepo Provincial Hospital with severe injuries.\n\nMr Chikosi was among the four victims who died on the spot.\n\nTwo others died at hospital.\n\nActing Manicaland police spokesman, Assistant Inspector Wiseman Chinyoka was not immediately available for a comment.\n\nHowever, fellow transporter, Mr Isau Mupfumi confirmed Mr Chikosis death, and deployed a team to visit the accident scene early this morning.\n\n-Manica Post\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-prominent Mutare transport operator Mr Godfrey Chikosi, and five other have died in a tragic road accident that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/30/prominent-mutare-businessman-dies-in-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Mutare Businessman Dies In Horror Crash\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "11 People Perish In Two Separate Road Accidents",
            "url": "https://www.zimeye.net/2025/08/30/11-people-perish-in-two-separate-road-accidents/",
            "content": "By A Correspondent\n\nEleven people have died in two separate road accidents in Mutare and along the HarareNyamapanda Highway between Thursday night and Friday morning.\n\nIn Mutare, six people lost their lives when a Toyota GD6, driven by prominent transport operator Godfrey Chikosi, veered off the road and rolled several times near the Himalaya Turn-Off, close to 9 Miles along the MutareMasvingo Road.\n\nThe crash occurred around 11 PM on Wednesday. Four people, including Chikosi, died on the spot, while two others succumbed to their injuries later. The vehicle had seven occupants. The sole survivor was rushed to Victoria Chitepo Provincial Hospital with serious injuries.\n\nAccording to a state media report, Chikosi lost control of the vehicle before it veered off the road and overturned.\n\nChikosi sustained serious head injuries, together with Vincent Musepa and two ladies only identified by their first names as Patience and Melissa. Three other passengers were seriously injured and rushed to Victoria Chitepo Provincial Hospital, where sadly two died on admission. As we speak, one victim is battling for his life, a source told state media.\n\nAnother source added that Chikosi was driving towards Masvingo when, near the 42km peg close to Himalaya Turn-Off, he lost control. The Toyota GD6 swerved to the left, struck a concrete road sign, and overturned several times before landing on its roof.\n\nThe Zimbabwe Republic Police (ZRP) confirmed the accident in a statement shared on X (formerly Twitter). Police said four people were killed in the crash, stating:\n\nThe ZRP confirms a fatal road traffic accident which occurred at the 46 kilometre peg along Mutare  Masvingo Road on 28/08/25. A Toyota Fortuner GD6 vehicle with seven occupants on board veered off the road, hit a concrete road signpost, and overturned several times before landing on its roof. Resultantly, four people died on the spot while three others were injured. The bodies of the victims were taken to Victoria Chitepo Provincial hospital mortuary while the injured are admitted at the same institution.\n\nSeparately, on Friday, a private kombi carrying passengers, bricks, and tombstones overturned along the HarareNyamapanda Highway, killing five people on the spot.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Eleven people have died in two separate road accidents in Mutare and along the Harare–Nyamapanda Highway between … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/30/11-people-perish-in-two-separate-road-accidents/\">Continue reading<span class=\"screen-reader-text\"> \"11 People Perish In Two Separate Road Accidents\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Econet Pushes For Network Upgrade",
            "url": "https://www.zimeye.net/2025/08/30/econet-pushes-for-network-upgrade/",
            "content": "By Business Correspondent  The struggling Econet Wireless has announced plans to roll out a 5G network, in what it claims is a major step towards improving its services. The announcement, however, comes at a time when the company faces widespread criticism over deteriorating network quality, exorbitant tariffs, and poor customer care.\n\nEconet deputy chief executive officer, Mr Roy Chimanikire, revealed the plans at the companys exhibition stand during the ongoing Zimbabwe Agricultural Show (ZAS). He said Econet has already deployed 300 5G base stations as of July 2025, extending high-speed connectivity to over 500,000 customers. Millions of others remain on 4G (LTE), with some still dependent on outdated 3G services.\n\nChimanikire described the rollout as a step towards positioning Zimbabwe for a full digital economy, saying 5Gs potential goes beyond faster internet speeds to transformative uses in business and industry through the Internet of Things (IoT). He highlighted applications such as smart water management, drone-assisted agriculture, and AI-driven smart parking, as well as the companys new chatbot,Yamurai, which communicates in Shona and Ndebele to resolve customer queries.\n\nIts about the next level of technology in terms of efficiency, scalability, and speed of delivering products and services, he said.\n\nDespite the upbeat messaging, Econets announcement comes against a backdrop of mounting customer dissatisfaction. Over the years, subscribers have repeatedly complained about dropped calls, slow internet speeds, failed mobile money transactions, and prolonged downtime without compensation.\n\nThe company has also come under fire for its steep data and airtime prices, which are among the highest in the region despite Zimbabwes low average incomes. Customers often complain that data bundles mysteriously vanish, while call tariffs rise regularly under the justification of inflation and foreign currency shortages.\n\nCivil society groups, consumer watchdogs, and even government regulators have at different times raised concern about the affordability of Econets services. For instance, while Econet enjoys a dominant market share, its pricing structure has often been accused of putting access to communication beyond the reach of ordinary Zimbabweans.\n\nEconets customer care has also become a lightning rod for anger, with reports of subscribers spending hours without getting through to call centres, and unresolved complaints piling up. This has forced many to vent frustrations on social media platforms, turning #Econet and #DataMustFall into recurring trends.\n\nAnalysts say that while the companys 5G and artificial intelligence ambitions may sound impressive, Econet risks alienating its customer base if it does not first address long-standing grievances over affordability and service reliability.\n\nRolling out 5G is commendable, but it feels like a luxury when the basics  such as consistent 4G coverage, affordable data, and reliable customer care  remain unsolved, said one Harare-based telecoms analyst.\n\nEconet, which has faced financial pressures due to Zimbabwes unstable economy and rising operational costs, insists that its investments in next-generation technologies will eventually filter down to better customer experiences. However, until subscribers see tangible improvements in service quality and fairer pricing, skepticism is likely to overshadow the companys latest digital transformation drive.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Correspondent – The struggling Econet Wireless has announced plans to roll out a 5G network, in what it … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/30/econet-pushes-for-network-upgrade/\">Continue reading<span class=\"screen-reader-text\"> \"Econet Pushes For Network Upgrade\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Sikhala’s Home Bombed",
            "url": "https://www.zimeye.net/2025/08/30/sikhalas-home-bombed/",
            "content": "video loading below\n\nFormer Zengeza West MP Job Sikhala reports his home has been bombed while he is away launching his book in South Africa.https://t.co/DuqFg0Qqevpic.twitter.com/c5HZkZ6jmp\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below…",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Zanu PF, Opposition Councillors Nearly Exchange Blows During Explosive Meeting",
            "url": "https://www.zimeye.net/2025/08/30/zanu-pf-opposition-councillors-nearly-exchange-blows-during-explosive-meeting/",
            "content": "By A CorrespondentMasvingo  Tempers flared at a Masvingo City Council meeting on August 25 when a seemingly routine discussion descended into a near-brawl between Zanu PF and opposition councillors.\n\nThe chaos began after Councillor Sengerayi Manyanga suggested that the chamber should formally commend government road works in Ward 7. His motion quickly drew backing from fellow Zanu PF councillor Sheron Marombedze.\n\nBut the proposal sparked an angry backlash from opposition councillors Wilstaff Sitemere, Alaica Time, and Ester Zishiri, who accused Manyanga of hijacking the council platform for political mileage. This is not a campaign rally. We are here to focus on service delivery, not to heap praise on political parties, one councillor charged, as the heated exchange briefly brought proceedings to a standstill.\n\nThe tense standoff underscored the sharp political divisions that continue to undermine council business.\n\nA senior council official later played down the fracas, insisting the matter had been resolved. Yes, there was some shouting and strong words exchanged, but these things happen in council meetings, the official said. What is important is that we managed to continue with business after the incident. Everything is now under control.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A CorrespondentMasvingo – Tempers flared at a Masvingo City Council meeting on August 25 when a seemingly routine discussion … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/30/zanu-pf-opposition-councillors-nearly-exchange-blows-during-explosive-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF, Opposition Councillors Nearly Exchange Blows During Explosive Meeting\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Young Socialite Turns to Bootlicking for Favors From Chivayo …",
            "url": "https://www.zimeye.net/2025/08/30/young-socialite-turns-to-bootlicking-for-favors-from-chivayo/",
            "content": "By A Correspondent\n\nControversial socialite Ritzmcleish Strawbae, born Michelle Moyo, has once again set tongues wagging after releasing a video clip in which she showers excessive praise on First Lady Auxillia Mnangagwa and Lulu Chivayo, wife of flamboyant businessman Wicknell Chivayo.\n\nIn the video, which has since gone viral, Ritzmcleish declared her unwavering support for President Emmerson Mnangagwas Vision 2030, saying:\n\nBehind the scenes, ED Huchi. Let us all support Vision 2030. Content Creators for ED.\n\nHer comments immediately sparked public outrage, with critics accusing her of grovelling in hopes of securing financial benefits.\n\nShes not supporting anyone for free  she just wants a car and cash from Chivayo. This is begging disguised as loyalty, one angry observer remarked.\n\nAnalysts say the incident highlights the growing trend of influencers aligning themselves with political elites to gain favors, a practice that has become increasingly visible on Zimbabwes social media landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial socialite Ritzmcleish Strawbae, born Michelle Moyo, has once again set tongues wagging after releasing a video … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/30/young-socialite-turns-to-bootlicking-for-favors-from-chivayo/\">Continue reading<span class=\"screen-reader-text\"> \"Young Socialite Turns to Bootlicking for Favors From Chivayo …\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Horror As Woman Kills Granddaughter For Rituals",
            "url": "https://www.zimeye.net/2025/08/30/horror-as-woman-kills-granddaughter-for-rituals/",
            "content": "Tinotenda Hove  A chilling murder has sent shockwaves across Shurugwi after a 52-year-old woman allegedly killed her four-year-old granddaughter in a suspected ritual act.\n\nPolice confirmed that on26 August 2025, officers in Chegutu arrestedVeronica Mudzipuri, an artisanal miner, for the gruesome killing of her granddaughter,Tawanayasha Kadhene.\n\nAccording to preliminary investigations, Mudzipuri allegedly laced the childs maheu drink with a maize pesticide pill, causing her death. What followed has horrified the community  the suspect is accused of cutting flesh from the victims cheek and mixing it with herbs prescribed by a sangoma before cooking and consuming the concoction.\n\nNational police spokesperson Assistant Commissioner Paul Nyathi condemned the act, saying investigations were ongoing. This is a deeply disturbing case. The Zimbabwe Republic Police is treating it with utmost seriousness, and the suspect remains in custody pending court appearance, he said.\n\nCommunity members in Shurugwi expressed shock and outrage, describing the killing as barbaric and evil. One resident said, We cannot believe that a grandmother, of all people, could commit such an inhumane act against her own blood.\n\nThe murder has reignited debate over ritual killings in Zimbabwe, with traditional leaders and human rights groups calling for tougher measures to curb the practice.\n\nPolice have urged members of the public to report suspicious activities linked to ritual practices and to resist harmful cultural beliefs that endanger lives\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinotenda Hove – A chilling murder has sent shockwaves across Shurugwi after a 52-year-old woman allegedly killed her four-year-old granddaughter … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/30/horror-as-woman-kills-granddaughter-for-rituals/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Woman Kills Granddaughter For Rituals\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Four Die In Terrible Crash Along Mutare-Masvingo Road",
            "url": "https://www.zimeye.net/2025/08/29/four-die-in-terrible-crash-along-mutare-masvingo-road/",
            "content": "By A Correspondent\n\nTragedy struck on Thursday along the MutareMasvingo Road when a Toyota Fortuner GD6 overturned, killing four people instantly and leaving three others nursing injuries.\n\nThe Zimbabwe Republic Police confirmed the accident, saying it occurred at the 46km peg. According to the police, the vehicle, which was carrying seven passengers, veered off the road before crashing into a concrete signpost. It then rolled several times before finally coming to rest on its roof.\n\nAuthorities reported that the bodies of the deceased were taken to Victoria Chitepo Provincial Hospital mortuary, while the three injured survivors were admitted at the same hospital for treatment.\n\nPolice have since urged motorists to exercise extreme caution on the countrys highways, warning that reckless driving and speeding continue to claim lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tragedy struck on Thursday along the Mutare–Masvingo Road when a Toyota Fortuner GD6 overturned, killing four people … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/four-die-in-terrible-crash-along-mutare-masvingo-road/\">Continue reading<span class=\"screen-reader-text\"> \"Four Die In Terrible Crash Along Mutare-Masvingo Road\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Four Killed, Three Injured in Mutare–Masvingo Road Horror Crash",
            "url": "https://www.zimeye.net/2025/08/29/four-killed-three-injured-in-mutare-masvingo-road-horror-crash/",
            "content": "BREAKING NEWS: Four Killed, Three Injured in MutareMasvingo Road Horror Crash.\n\nThe once sleek Toyota Fortuner GD6 now lay crumpled into a heap of twisted metal, its roof peeled back like paper, doors ripped apart, and the front end crushed beyond recognition. Shattered glass glittered across the tarmac, mingling with scattered debris, while the vehicles mangled frame sat half-buried in the dirt off the MutareMasvingo Road. Inside, the beige seats hung awkwardly from the wreck, exposed to the open air  a chilling reminder of the violent force that tore through the SUV.\n\nBy A Correspondent | MUTARE  Four people died on the spot while three others were seriously injured on Thursday after a Toyota Fortuner GD6 overturned along the MutareMasvingo Road.\n\nThe SUV, which was reportedly carrying seven passengers, veered off the highway before overturning, leaving behind a trail of twisted wreckage. The impact crushed the vehicles body beyond recognition, with debris scattered across the crash site.\n\nWitnesses at the scene described the accident as one of the most gruesome in recent months, with survivors pulled from the mangled shell of the Fortuner and rushed to hospital for treatment.\n\nThe identities of the deceased have not yet been released, as families are still being informed.\n\nThe accident adds to a spate of recent road tragedies on the MutareMasvingo route, one of Zimbabwes busiest and most dangerous highways.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BREAKING NEWS: Four Killed, Three Injured in Mutare–Masvingo Road Horror Crash. The once sleek Toyota Fortuner GD6 now lay crumpled … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/four-killed-three-injured-in-mutare-masvingo-road-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Four Killed, Three Injured in Mutare–Masvingo Road Horror Crash\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        },
        {
            "title": "Cash-Strapped Government Funds Mnangagwa’s Extravagant Vatican Visit",
            "url": "https://www.zimeye.net/2025/08/29/cash-strapped-government-funds-mnangagwas-extravagant-vatican-visit/",
            "content": "By A Correspondent\n\nAt a time when millions of Zimbabweans are grappling with hunger, collapsing hospitals, and unpaid wages, President Emmerson Mnangagwa has chosen to fly to Vatican City on a State visit to meet Pope Leo XIV.\n\nHis foreign adventure, complete with a bloated entourage of senior government officials, has been condemned as a reckless misuse of public funds by a leadership increasingly out of touch with the suffering of its people.\n\nThe President left with Foreign Affairs Minister Professor Amon Murwira, Finance Minister Mthuli Ncube, Presidential Communications chief George Charamba, and other top officials.\n\nObservers say the costly trip highlights government extravagance while ordinary citizens endure crippling poverty.\n\nMnangagwa was seen off at Robert Gabriel Mugabe International Airport by Vice President Kembo Mohadi, Defence Minister Oppah Muchinguri-Kashiri, State Security Minister Lovemore Matuke, Information Minister Jenfan Muswere, Harare Provincial Affairs Minister Charles Tavengwa, service chiefs, and other senior officials. The lavish farewell once again underscored how the ruling elite prioritizes pomp over addressing the hardships at home.\n\nDefending the visit, Prof Murwira said: It is important to deepen our relations with the Vatican as it represents peace and understanding.\n\nBut critics argue Mnangagwas government has failed to uphold peace, justice, or dignity within Zimbabwe itself, making such justifications sound hollow.\n\nMeanwhile, Vice President Mohadi has been left as Acting President, a development that many see as a continuation of failed leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent At a time when millions of Zimbabweans are grappling with hunger, collapsing hospitals, and unpaid wages, President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/29/cash-strapped-government-funds-mnangagwas-extravagant-vatican-visit/\">Continue reading<span class=\"screen-reader-text\"> \"Cash-Strapped Government Funds Mnangagwa’s Extravagant Vatican Visit\"</span></a></p>",
            "time": "21:06",
            "date": "30 Aug 2025"
        }
    ]
}