{
    "news": [
        {
            "title": "Mutsvangwa Claims Mnangagwa Owns Feared Central Intelligence Organizations",
            "url": "https://www.zimeye.net/2025/10/17/mutsvangwa-claims-mnangagwa-owns-feared-central-intelligence-organizations/",
            "content": "By A Correspondent\n\nThe level of infighting within Zanu PF has reached shocking levels, with party spokesperson Ambassador Christopher Mutsvangwa publicly dressing down Vice President Constantino Chiwenga during a fiery media briefing in Harare on Thursday.\n\nIn an unusually blunt attack, Mutsvangwa accused Chiwenga of trying to manipulate the Zanu PF Politburo into turning against President Emmerson Mnangagwa.\n\nHe (General Chiwenga) is an isolated man in the Politburo, charged Mutsvangwa. The Vice President attempted to force the Politburo to condemn President Mnangagwa for endorsing corruption. He accused his senior  the very man who appointed him to office.\n\nMutsvangwa dismissed Chiwengas recent allegations as a mere sideshow, insisting that if the Vice President had genuine evidence, he should have followed proper channels.\n\nChiwenga should have gone to ZACC or even the Reserve Banks FIU to report the matter, he said. That was a political gimmick meant to gain public sympathy.\n\nThe outspoken spokesperson went further, suggesting that Chiwenga was being used by remnants of the G40 faction. Geza  I know him personally  he is the late President Robert Mugabes relative. We know what they are planning, said Mutsvangwa.\n\nHe also sensationally claimed that exiled former Zanu PF political commissar Saviour Kasukuwere was behind the controversial document that Chiwenga allegedly presented to the Politburo.\n\nKasukuwere is the one who penned the document that was presented by Chiwenga, Mutsvangwa alleged.\n\nThe latest confrontation highlights the deep divisions within the ruling party as Mnangagwa is expected to officially open the Zanu PF Annual National Peoples Conference in Mutare today.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The level of infighting within Zanu PF has reached shocking levels, with party spokesperson Ambassador Christopher Mutsvangwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/mutsvangwa-claims-mnangagwa-owns-feared-central-intelligence-organizations/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Claims Mnangagwa Owns Feared Central Intelligence Organizations\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Matiza reinstated as Chairman of Argus Investments",
            "url": "https://www.zimeye.net/2025/10/17/matiza-reinstated-as-chairman-of-argus-investments/",
            "content": "By A Correspondent| Argus Investments (Mauritius) has announced the reinstatement of Batsirai Joel Matiza as Chairman of the Board with immediate effect.\n\nThis decision follows a unanimous vote by external stakeholders during a specially convened meeting held earlier today in Port Louis.\n\nThe motion, which passed without opposition, underscores the stakeholders confidence in Matizas leadership and strategic vision, marking a significant moment in the companys trajectory.\n\nMatiza, who is also a Central Committee member of Zimbabwes ruling ZANU-PF party, is well-regarded for his extensive contributions to driving investment across key sectors such as mining, infrastructure, and energy in the region. His return to the position is anticipated to bring about a new era of strategic clarity, operational growth, and enhanced institutional trust.\n\nSpeaking after the meeting, Matiza expressed his gratitude, stating, I am deeply honoured by the confidence shown in me by the stakeholders of Argus Investments. This reinstatement is not just a personal milestoneit is a renewed commitment to responsible stewardship, regional impact, and delivering sustainable value to our investors.\n\nDuring his earlier tenure at Argus Investments, the company played a vital role in facilitating high-value cross-border transactions and project financing initiatives across Africa, particularly in the Democratic Republic of the Congo. His reinstatement signals Arguss readiness to re-engage with emerging markets and explore strategic opportunities in high-growth sectors.\n\nThe Board of Directors and executive management will commence immediate implementation of transitional measures to bolster the Chairmanship, ensure compliance with Mauritian regulatory frameworks, and relay updated corporate directives to all stakeholders.\n\nKey piorities announced:\n\nAbout Argus Investments (Mauritius):\n\nArgus Investments is an investment holding company based in Mauritius, dedicated to unlocking long-term value in Africas critical sectors, including mining, infrastructure, and energy.\n\nThrough strategic partnerships and disciplined governance, Argus seeks to deliver sustainable growth across emerging markets.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Argus Investments (Mauritius) has announced the reinstatement of Batsirai Joel Matiza as Chairman of the Board with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/matiza-reinstated-as-chairman-of-argus-investments/\">Continue reading<span class=\"screen-reader-text\"> \"Matiza reinstated as Chairman of Argus Investments\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Watch: Mutsvangwa Publicly Undresses General Chiwenga",
            "url": "https://www.zimeye.net/2025/10/17/watch-mutsvangwa-publicly-undresses-general-chiwenga/",
            "content": "By A Correspondent\n\nThe level of infighting within Zanu PF has reached shocking levels, with party spokesperson Ambassador Christopher Mutsvangwa publicly dressing down Vice President Constantino Chiwenga during a fiery media briefing in Harare on Thursday.\n\nIn an unusually blunt attack, Mutsvangwa accused Chiwenga of trying to manipulate the Zanu PF Politburo into turning against President Emmerson Mnangagwa.\n\nHe (General Chiwenga) is an isolated man in the Politburo, charged Mutsvangwa. The Vice President attempted to force the Politburo to condemn President Mnangagwa for endorsing corruption. He accused his senior  the very man who appointed him to office.\n\nMutsvangwa dismissed Chiwengas recent allegations as a mere sideshow, insisting that if the Vice President had genuine evidence, he should have followed proper channels.\n\nChiwenga should have gone to ZACC or even the Reserve Banks FIU to report the matter, he said. That was a political gimmick meant to gain public sympathy.\n\nThe outspoken spokesperson went further, suggesting that Chiwenga was being used by remnants of the G40 faction. Geza  I know him personally  he is the late President Robert Mugabes relative. We know what they are planning, said Mutsvangwa.\n\nHe also sensationally claimed that exiled former Zanu PF political commissar Saviour Kasukuwere was behind the controversial document that Chiwenga allegedly presented to the Politburo.\n\nKasukuwere is the one who penned the document that was presented by Chiwenga, Mutsvangwa alleged.\n\nThe latest confrontation highlights the deep divisions within the ruling party as Mnangagwa is expected to officially open the Zanu PF Annual National Peoples Conference in Mutare today.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The level of infighting within Zanu PF has reached shocking levels, with party spokesperson Ambassador Christopher Mutsvangwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/watch-mutsvangwa-publicly-undresses-general-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Mutsvangwa Publicly Undresses General Chiwenga\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "If Geza’s People Don’t Turn Up, What Happens To VP Chiwenga?",
            "url": "https://www.zimeye.net/2025/10/17/if-gezas-people-dont-turn-up-what-happens-to-vp-chiwenga/",
            "content": " ANALYSIS | TREASONOUS OR TRAPPED? THE LEGAL FATE OF CHIWENGAS CAMP IF TODAYS PROTEST FAILS\n\nBy ZimEye Political Investigations Desk | 17 October 2025\n\nIf the highly anticipated 17 October demonstration spearheaded by Blessed Geza fails to materialise or collapses under state force, the ramifications could spiral far beyond civic space. At stake is the political survival  and possibly the personal liberty  of Zimbabwes Vice President, General (Rtd.) Constantino Chiwenga, whose public, politburo, as well as private rebellion against President Emmerson Mnangagwa has reached a legal and political breaking point.\n\nAt the heart of the clash is Resolution Number 1, the ruling ZANU PFs controversial policy proposal to extend Mnangagwas presidential term to 2030. Chiwenga has resisted this directive at multiple Politburo meetings since July, fuelling speculation that the military man is plotting a political comeback of his own.\n\nBut what happens if the people he is allegedly counting on  protesters like Blessed Geza and others  dont show up? The answer: purge, prosecution, or political extinction.\n\n 1. Treason Now Has a Name\n\nChiwengas 17 September dossier, which accused Mnangagwas loyalists  including Tagwirei, Chivhayo, Sakupwanya, and Nguwaya  of hijacking the party and state, has since been branded reckless and treasonous by none other than Justice Minister Ziyambi Ziyambi.\n\nA leaked intelligence memo dated 10 October now ties senior politburo members directly to Chiwengas camp, accusing them of operating in direct contravention of Resolution Number 1 and calling for immediate verification of their loyalty.\n\nIf Gezas protest fails, the state could move swiftly to classify any association with Chiwengas defiance as an act of subversion, triggering detentions and political expulsions under Zimbabwes Criminal Law (Codification and Reform) Act [Chapter 9:23], which outlaws actions intended to overthrow constitutional authority.\n\n 2. Mliswas Warning: Chiwengas Career is Finished\n\nNone have more consistently predicted Chiwengas demise than Temba Mliswa, the outspoken former ZANU PF Mashonaland West Chairperson. Since July, Mliswa has launched multiple attacks on Chiwenga, saying:\n\nIf theres anyone to be chased out of ZANU PF, its Chiwenga. His career has reached its dead end. This is the final lap.\n\nMliswa has accused Chiwenga of weaponising the military, undermining Mnangagwa, and playing a double game by pretending loyalty while destabilising the party from within.\n\nTodays protest  or lack thereof  could vindicate Mliswas warning. A flop would not only mark a strategic defeat for Chiwenga, but provide Mnangagwas camp a pretext to crush him completely, politically and legally.\n\n 3. Intelligence Activation and Arrest Watchlist\n\nZimEye has seen a classified CIO communication authorising Lovemore Matuke, the ZANU PF Security Secretary, to initiate disciplinary action against politburo officials suspected of aligning with Chiwenga.\n\nThose reportedly under surveillance include:\n\nThe memo states that continued association with Chiwengas camp indicates a deliberate and coordinated effort to undermine the resolution and disrupt internal cohesion.\n\nSources suggest that electronic surveillance, financial tracing, and meeting logs are being compiled to justify arrests or Politburo expulsions.\n\n 4. Zvigandanga Strategy: Digging His Own Grave?\n\nThe metaphor popularised by ZimDailys cartoon  where Chiwenga is seen digging a trench hes trapped in  is proving prophetically accurate.\n\nSince July:\n\nWithout a public uprising to back him, Chiwenga is being painted as a desperate Zigandanga, caught between mutiny and marginalisation.\n\n 5. What Happens to Blessed Geza?\n\nIf the protest fails, Blessed Geza could be the first to fall. Legal experts point to multiple statutes that could be used against him:\n\nBut more importantly, any direct or indirect tie between Geza and Chiwenga  even if speculative  may be weaponised to construct a treason-by-proxy case.\n\n VERDICT: Chiwengas Hour of Reckoning?\n\nIf Gezas protest collapses or is violently dispersed, Chiwenga could be forced to retreat, face disciplinary action, or even resign under pressure.\n\nMliswas warnings will echo across party corridors, and Mnangagwas camp may seize the moment to close ranks and declare victory over the dissenters.\n\nBut if the streets explode  and Chiwenga remains silent  his silence may become consent, and the plot may thicken.\n\n This is a live ZimEye analysis. Developments are unfolding minute by minute at Africa Unity Square and ZANU PF HQ.\n\nFor rolling updates, follow @ZimEye | #ResolutionNumber1 | #ChiwengaVsED | #BlessedGezaDemo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "🔴 ANALYSIS | TREASONOUS OR TRAPPED? THE LEGAL FATE OF CHIWENGA’S CAMP IF TODAY’S PROTEST FAILS By ZimEye Political Investigations … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/if-gezas-people-dont-turn-up-what-happens-to-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"If Geza’s People Don’t Turn Up, What Happens To VP Chiwenga?\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "NSSA Probes Chinese Firm HappySky for Firing Worker After Gruesome Factory Accident",
            "url": "https://www.zimeye.net/2025/10/17/nssa-probes-chinese-firm-happysky-for-firing-worker-after-gruesome-factory-accident/",
            "content": "By A Business Correspondent The National Social Security Authority (NSSA) has launched an investigation into top Chinese-owned manufacturer HappySky Zimbabwe following allegations of unfair labour practices, including the dismissal of an injured worker without compensation.\n\nThe company, which operates a large factory in Msasa, Harare, is accused of firing Mr. Justice Mulika (27), a machine operator who lost all the fingers on his left hand in a gruesome industrial accident in December 2017. He was reportedly dismissed two months later without pay or compensation.\n\nHappySky, which also trades as Grosspork (Pvt) Ltd, produces items such as footwear, diapers, sanitary pads, and toilet paper, supplying major retail chains and operating several shops across the capital.\n\nMr. Mulika said that after the accident, the company only paid part of his medical bills at Parirenyatwa Hospital, but later terminated his employment, citing disability as the reason. I used to operate a plastic footwear machine when my left hand got trapped and crushed, he said. One of the Chinese bosses rushed me to the hospital, but I had already lost all my fingers. Two months later, I was dismissed without compensation.\n\nHe said efforts to seek redress were blocked by the companys human resources department, forcing him to approach NSSA, which has now opened a case under claim number 1251305.\n\nWe confirm receiving a report from Mr. Justice Mulika regarding an injury sustained in the line of duty, NSSA said in a statement. Our inspectors are being deployed to the factory to investigate the incident and determine the companys liability.\n\nA company official, Mr. Collin Sakala, confirmed that Mr. Mulika was injured at work but claimed management changes had delayed compensation. This happened a long time ago when another manager was in charge, he said. If the company is found liable, he will receive his dues. There were several management changes that caused delays.\n\nMr. Sakala declined to disclose the identities or contact details of the Chinese owners, saying, You cannot talk to those guys. They are well connected.\n\nSources allege that HappySky has repeatedly changed trading names and management to evade statutory obligations such as NSSA remittances and tax payments to ZIMRA. Its retail outlets reportedly accept only cash U.S. dollar payments, raising further suspicion of tax evasion.\n\nWorkers also accuse the company of forcing 12-hour shifts and other exploitative labour practices. Officials from the Ministry of Public Service, Labour and Social Welfare recently visited the factory to review its labour conditions and remuneration structures. The ministrys findings are yet to be released.\n\nMr. Mulika said the company only began responding to his case after NSSA and the media started making enquiries, eight years after his injury. For years they kept making promises, but nothing happened. Its only now that they are pretending to act, he said.\n\nThe probe into HappySky has raised fresh concerns about Chinese investment practices in Zimbabwe, particularly regarding workers rights, compensation, and compliance with national labour laws.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Business Correspondent —The National Social Security Authority (NSSA) has launched an investigation into top Chinese-owned manufacturer HappySky Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/nssa-probes-chinese-firm-happysky-for-firing-worker-after-gruesome-factory-accident/\">Continue reading<span class=\"screen-reader-text\"> \"NSSA Probes Chinese Firm HappySky for Firing Worker After Gruesome Factory Accident\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Police Trucks Arrive for Geza’s Protest At Africa Unity Square",
            "url": "https://www.zimeye.net/2025/10/17/police-trucks-arrive-for-gezas-protest-at-africa-unity-square/",
            "content": "By A Correspondent | ZimEye | Heavy Riot Police Presence Reported at Africa Unity Square Ahead of Planned Protest\n\nAs tensions rise over the controversial Resolution Number 1 and the planned mass demonstration spearheaded by activist Blessed Geza, a significant Zimbabwe Republic Police (ZRP) deployment has been spotted at Africa Unity Square in Harare this morning.\n\nHeavy Riot Police Presence Reported at Africa Unity Square Ahead of Planned ProtestAs tensions rise over the controversial Resolution Number 1 and the planned mass demonstration spearheaded by activist Blessed Geza, a significant Zimbabwe Republic Police (ZRP) deployment hashttps://t.co/Hn8KhXTdq5pic.twitter.com/KKvbbFKlUm\n\nAccording to real-time footage posted by Crime Watch Zim, a fleet of at least 12 police vehicles was recorded lining the vicinity around the square as of 06:22 AM. The composition of the vehicles includes:2 Water Cannons (anti-riot crowd control trucks)3 Police Lorries (likely carrying riot gear personnel)7 Light Police Trucks and Pick-ups (for rapid deployment)\n\nThis marks one of the heaviest early-morning riot police deployments in recent years for a non-opposition-organised demonstration, further underlining the states heightened concern over todays protest.\n\nThe protest, planned in response to the ZANU PF resolution seeking to extend President Mnangagwas term beyond 2028, has sparked national and international interest. Activist Blessed Geza has called for a nationwide peaceful demonstration today  17 October 2025  a date that has now become a political flashpoint.\n\nMeanwhile, controversy erupted late last night after a press statement purporting to be from Vice President Constantino Chiwenga denouncing the protest went viral. Presidential spokesperson George Charamba, using his X (Twitter) account @Jamwanda2, dismissed the statement as fake and accused its authors of abusing government stationery. (Full screenshots attached.)\n\nThe ZRPs heavy presence at Africa Unity Square suggests the state is taking no chances amid confusion over whether the VPs office supports or denounces the protest. No official statement has been issued by the ZRP as of this hour.\n\nDeveloping story  updates to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Heavy Riot Police Presence Reported at Africa Unity Square Ahead of Planned Protest As … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/police-trucks-arrive-for-gezas-protest-at-africa-unity-square/\">Continue reading<span class=\"screen-reader-text\"> \"Police Trucks Arrive for Geza’s Protest At Africa Unity Square\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "We’ve Entered the CBD | Tatopinda MuHarare CBD | WATCH",
            "url": "https://www.zimeye.net/2025/10/17/weve-entered-the-cbd-tatopinda-muharare-cbd-watch/",
            "content": "video loading below\n\nWAR VETS SPEAK AHEAD OF 17 OCT DEMOhttps://t.co/yJEj0Flwg7\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Police Flood Harare to Stop Geza Demo",
            "url": "https://www.zimeye.net/2025/10/17/police-flood-harare-to-stop-geza-demo/",
            "content": "By A Correspondent  Panic has gripped President Emmerson Mnangagwas government as heavily armed riot police, water cannon trucks, and plainclothes intelligence officers were deployed across Harare and other major cities ahead of a planned national shutdown today, called by former Zanu PF Central Committee member and liberation war veteran Blessed Geza.\n\nGeza, who was expelled from the ruling party earlier this year for denouncing Mnangagwas leadership, has in recent months emerged as a fierce critic of the government, accusing the president of corruption, authoritarianism, and betrayal of the liberation struggle. His latest call for mass protests  dubbedThe Final Push has sent shockwaves through state corridors, with authorities fearing a repeat of the violent January 2019 demonstrations that paralyzed the country.\n\nIn a statement released last night, police spokespersonCommissioner Paul Nyathiurged citizens to disregard Gezas call for demonstrations and assured the public that law enforcement had been placed on high alert.\n\nThe public must go about their duties as usual, as law enforcement agents have been deployed countrywide to ensure peace, said Comm. Nyathi. All essential services such as schools, public transport, businesses, and government institutions will be running smoothly. The public must not be intimidated by social media threats or misinformation.\n\nWitnesses in Harare reported heavy police presence at key intersections, including Africa Unity Square, Robert Mugabe Road, and the State House vicinity. Similar deployments were observed in Bulawayo, Mutare, and Masvingo, where anti-riot units were seen patrolling high-density suburbs.\n\nDespite the clampdown, Geza remains defiant. In his public statement earlier this week, he urged citizens to take to the streets to reclaim their dignity from what he described as a corrupt and indifferent regime.\n\nThe moment we have been yearning for is upon us, Geza declared. On 17 October 2025, we will flood the streets of Harare and other cities to demand the removal of Emmerson from power. Zimbabwe cannot afford another day under his rule.\n\nBlessed Geza, a decorated war veteran and former Zanu PF insider, gained prominence in 2023 when he publicly criticized Mnangagwas administration for betraying the ideals of the liberation struggle. He accused senior government officials of looting state resources and using the military to entrench their power.\n\nOnce a staunch supporter of Mnangagwa, Geza broke ranks after being sidelined from party structures. His fiery speeches and online mobilization have since made him a rallying figure among disillusioned citizens and ex-combatants.\n\nHis statement this week invoked constitutional provisions  including Sections 212 and 219  to justify peaceful protest, urging the police and army not to suppress demonstrations.\n\nGezas manifesto outlines a list of demands, including:\n\nHe called for citizens to gather atAfrica Unity Squarebefore marching to the homes of allegedly corrupt elites  including businessmen and government ministers  and later toState Houseto demand Mnangagwas ouster.\n\nWe will remain on the streets until Emmerson is removed from power, Geza declared.\n\nAnalysts say the governments heavy-handed response underscores deep-seated fears of a popular uprising amid worsening economic hardship, collapsing public services, and growing discontent within Zanu PF itself.\n\nPolitical observers note that while previous calls for nationwide protests have been swiftly crushed, Gezas liberation war credentials and insider status could lend the shutdown rare credibility among rank-and-file soldiers and war veterans.\n\nAs of this morning, Harare remained tense but largely calm, with security checkpoints, armed patrols, and drone surveillance in the city centre.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Panic has gripped President Emmerson Mnangagwa’s government as heavily armed riot police, water cannon trucks, and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/police-flood-harare-to-stop-geza-demo/\">Continue reading<span class=\"screen-reader-text\"> \"Police Flood Harare to Stop Geza Demo\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Prominent Harare Trainer Nabbed in $5,000 Car Theft Scandal",
            "url": "https://www.zimeye.net/2025/10/17/prominent-harare-trainer-nabbed-in-5000-car-theft-scandal/",
            "content": "By Sports Reporter A well-known Harare fitness trainer has been arrested for allegedly stealing US$5,000 from a clients car  in a week that saw nearly US$70,000 vanish from parked vehicles across the capital.\n\nTinashe Gandari, a trainer at Pro Fitness Health Club located at The Village in Borrowdale, was arrested on Wednesday after allegedly stealing from one of his clients, Allen Tatenda Badzarugere (39), during a workout session.\n\nAccording to police sources, Badzarugere had left his car keys in the changing room while exercising. Gandari allegedly took the keys, went to the parking lot, and stole US$5,000 from the glove compartment of the clients Mercedes-Benz. The theft was discovered when Badzarugere returned to his vehicle and found the cash missing, although there were no signs of forced entry. Gandari is said to be a former employee at the same gym.\n\nIn a separate incident, David James Gentleman (35) of Mandara lost US$34,700 when thieves broke into his Ford Ranger along Douglas Road in Southerton. Gentleman had parked briefly to attend to a construction matter when he heard commotion nearby. On returning, he found the passenger window shattered and a satchel containing cash stolen.\n\nMeanwhile, in another case, 41-year-old Believe Chinotsa from Tynwald lost US$30,210 after her Honda Fit was broken into while she was at Divaris Shopping Centre for a hair appointment. She returned about 40 minutes later to find the drivers door ajar and a laptop bag containing a computer and nearly US$30,000 gone.\n\nHarare provincial police spokesperson Inspector Luckmore Chakanza confirmed the three incidents, warning motorists against leaving large sums of money or valuables in unattended vehicles.\n\nPolice are investigating two theft-from-motor-vehicle cases in Borrowdale and Southerton, where a total of US$39,700 was stolen, said Insp Chakanza. We are also investigating another case involving more than US$29,000 stolen from a vehicle in Belvedere. Nothing has been recovered so far.\n\nHe urged residents to remain vigilant and avoid keeping cash or valuables in parked vehicles.\n\n H-Metro\n\nDo you like this personality?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter — A well-known Harare fitness trainer has been arrested for allegedly stealing US$5,000 from a client’s car — … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/prominent-harare-trainer-nabbed-in-5000-car-theft-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Harare Trainer Nabbed in $5,000 Car Theft Scandal\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        },
        {
            "title": "Police Arrest Two in ZIMSEC Exam Impersonation Cases",
            "url": "https://www.zimeye.net/2025/10/17/police-arrest-two-in-zimsec-exam-impersonation-cases/",
            "content": "By A Correspondent\n\nPolice have apprehended two individuals in separate cases of exam fraud after they were discovered sitting for Zimbabwe School Examinations Council (ZIMSEC) Ordinary Level papers on behalf of other candidates.\n\nIn the first incident, 26-year-old Brighton Chinhenga was arrested at Mukondomi Secondary School in Buhera on 13 October 2025. Chinhenga had attempted to sit for the Mathematics Paper 1 exam using another candidates identity.\n\nThe following day, 32-year-old Mavis Phiri was detained by police in Magwegwe, Bulawayo, after she was caught at Masotsha High School attempting to write the Science Paper 1 exam on behalf of her sister.\n\nExam impersonation and other forms of malpractice continue to challenge the integrity of Zimbabwes national examinations.\n\nEarlier in the year, 20-year-old Fidelis Chipungu of Zvishavane was found guilty of posing as Hilton Malunga to write the ZIMSEC Mathematics Paper 1 at George Chipadza Secondary School on 26 May 2025. Chipungu had used Malungas national identity card to gain unauthorised access to the examination room.\n\nThe fraud was uncovered soon after the exam when school officials called Chipungu to the Deputy Headmasters office for questioning. He admitted to the offence, and the invigilator immediately reported the matter to police, leading to his arrest.\n\nZvishavane Magistrates Court sentenced Chipungu to two months in prison, wholly suspended, on the condition that he completes 70 hours of community service. The court emphasised the seriousness of exam fraud and its potential to compromise national examination credibility but took into account Chipungus age and early admission of guilt.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Police have apprehended two individuals in separate cases of exam fraud after they were discovered sitting for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/17/police-arrest-two-in-zimsec-exam-impersonation-cases/\">Continue reading<span class=\"screen-reader-text\"> \"Police Arrest Two in ZIMSEC Exam Impersonation Cases\"</span></a></p>",
            "time": "06:29",
            "date": "18 Oct 2025"
        }
    ]
}