{
    "news": [
        {
            "title": "Magaya, Makandiwa Could Join Mzembi In Prison",
            "url": "https://www.zimeye.net/2025/06/14/magaya-makandiwa-could-join-mzembi-in-prison/",
            "content": "By Crime and Courts Reporter-Controversial church leaders Walter Magaya of the Prophetic Healing and Deliverance (PHD) Ministries and Emmanuel Makandiwa of the United Family International Church (UFIC) could soon face arrest following the dramatic return and subsequent detention of former Foreign Affairs Minister Walter Mzembi.\n\nMzembi appeared before Harare Magistrate Don Ndirowei on Saturday, facing charges related to defaulting on three outstanding arrest warrants.\n\nThe magistrate remanded him in custody until Monday.\n\nThe former minister was arrested Friday night by officers from the Zimbabwe Anti-Corruption Commission (ZACC), just days after his surprise return from self-imposed exile.\n\nMzembi, who originally faced corruption charges in January 2018 and was released on bail, became a fugitive in 2019 when a warrant was issued for his arrest after he skipped trial.\n\nHe had been accused of converting to personal use television sets worth nearly US$1 million, which were meant for fan parks during the 2010 FIFA World Cup.\n\nNotably, Mzembi allegedly donated 16 of the TVs, valued at around US$800,000, to prominent churchesincluding Magayas PHD Ministries and Makandiwas UFICraising questions about the churches possible involvement in the alleged misuse of public resources.\n\nLegal analysts suggest that the two high-profile preachers could be called in for questioning, and potentially face arrest, as investigations widen.\n\nBeyond the fan park scandal, Mzembi is also accused of misappropriating US$1.6 million allocated for the 2013 United Nations World Tourism Organisation (UNWTO) General Assembly, which Zimbabwe co-hosted with Zambia in Victoria Falls.\n\nHis return to Zimbabwe this week shocked many.\n\nMzembi, a prominent figure in the G40 faction of ZANU PF, had fled the country in the aftermath of the 2017 military coup that ousted longtime ruler Robert Mugabe.\n\nHe claimed persecution and threats to his life at the time.\n\nJust days ago,ZimEye Exclusivelyreported that Mzembi was seen being whisked away from the Bronte Hotel under tight security for meetings with high-level government officials. His presence had triggered backlash from opposition figures and war veterans who accused him of selling out and cutting deals in the shadows.\n\nHis reappearance triggered widespread speculation of a political comeback, with critics accusing him of cutting secret deals.\n\nWar veterans and opposition figures were particularly vocal, accusing Mzembi of betrayal.\n\nWhether his return was part of a failed political arrangement or a misjudgment that reopened legal trouble, Mzembis case could now have wider implicationsparticularly for the religious institutions that benefited from his alleged misuse of state assets.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Controversial church leaders Walter Magaya of the Prophetic Healing and Deliverance (PHD) Ministries and Emmanuel Makandiwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/magaya-makandiwa-could-join-mzembi-in-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya, Makandiwa Could Join Mzembi In Prison\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "South Africa, Angola Clash in 2025 COSAFA Cup Final",
            "url": "https://www.zimeye.net/2025/06/14/south-africa-angola-clash-in-2025-cosafa-cup-final/",
            "content": "Sports Correspondent\n\nThe stage is set for a thrilling final in the 2025 COSAFA Cup as South Africa prepares to take on defending champions Angola at the Free State Stadium this Sunday at 15:00 CAT.\n\nAngola booked their place in the final after a dominant 4-1 victory over Madagascar in the first semifinal played on Friday. The Palancas Negras showed their class and attacking firepower to secure a convincing win and continue their title defense.\n\nSouth Africa joined them in the final after overcoming a spirited Comoros side with a 3-1 win in the second semifinal. Bafana Bafana capitalised on home support and clinical finishing to seal their spot in what promises to be an exciting regional showdown.\n\nAll eyes will now turn to Sundays clash, as Angola looks to retain the crown, while South Africa aims to lift the COSAFA trophy on home soil.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The stage is set for a thrilling final in the 2025 COSAFA Cup as South Africa prepares to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/south-africa-angola-clash-in-2025-cosafa-cup-final/\">Continue reading<span class=\"screen-reader-text\"> \"South Africa, Angola Clash in 2025 COSAFA Cup Final\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "About Mushroom Farming…",
            "url": "https://www.zimeye.net/2025/06/14/about-mushroom-farming/",
            "content": "By Dr Trywell Muzerengi\n\nOyster mushroom farming is fast emerging as one of the most accessible and profitable agribusiness opportunities in Zimbabwe, offering a low-cost, high-value avenue for income generation, food security, and environmental restoration.\n\nUnlike many traditional crops that require expensive inputs, oyster mushrooms are incredibly cheap to grow. You can use locally available crop residues as a growing medium, such as maize stalks, wheat straw, or cotton waste, explains Dr Trywell Muzerengi. This makes the enterprise ideal for rural and urban farmers alike, especially those with limited resources.\n\nZimbabwe currently imports over 80% of its mushroom fruit from South Africa, highlighting a massive gap in the local supply chain and a ripe opportunity for domestic producers.\n\nAnother key advantage is that mushroom farming does not require costly infrastructure. You dont need expensive mushroom houses, Dr Muzerengi adds. You can construct low-cost structures using poles and thatch grass, or even convert existing tobacco barns into mushroom housesespecially in winter.\n\nOyster mushrooms can be grown year-round, giving farmers a continuous production cycle and consistent income potential. Beyond food, mushrooms are in high demand for pharmaceutical applications, including the production of pills and natural health products. Additionally, oyster mushrooms play an important role in land reclamation, particularly on land degraded by mining and cyanidation.\n\nThe Chinese are already taking advantage of Zimbabwes favourable climate to grow mushroom fruits for export, notes Dr Muzerengi. We need to harness this potential ourselves, especially with ready export and local markets.\n\nThe benefits of oyster mushroom farming go beyond economics. It offers a path to self-employment, food nutrition, and value addition opportunities. Entrepreneurs can venture into producing mushroom-based products such as biltong, soaps, and even cosmetics for both local and international markets.\n\nIn a time when traditional farming faces numerous challengesfrom climate change to market instabilityoyster mushroom farming stands out as a resilient, affordable, and scalable solution for individuals and communities looking to grow wealth and sustainability from the soil up.\n\nDr Trywell Muzerengi is an agricultural expert and advocate for sustainable agribusiness innovations in Zimbabwe.\n\nemail:[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Oyster mushroom farming is fast emerging as one of the most accessible and profitable agribusiness opportunities … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/about-mushroom-farming/\">Continue reading<span class=\"screen-reader-text\"> \"About Mushroom Farming…\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "Mnangagwa Renames ZRP Tomlinson to Chimoio Depot — But Will This Improve Officers’ Welfare?",
            "url": "https://www.zimeye.net/2025/06/14/mnangagwa-renames-zrp-tomlinson-to-chimoio-depot-but-will-this-improve-officers-welfare/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa on Friday officially renamed the Zimbabwe Republic Polices Tomlinson Depot in Harare to Chimoio Depot, as part of his governments ongoing efforts to decolonise state institutions and honour the countrys liberation history. But questions remain about whether symbolic gestures like these will translate into tangible improvements for the welfare of police officers.\n\nSpeaking during the commissioning ceremony  which also included the unveiling of new police flats  Mnangagwa framed the renaming as part of a broader national agenda.\n\nThe renaming of this significant facility follows the earlier renaming of Morris Depot to Mkushi Depot, he said. The selfless sacrifices made by our sons and daughters must never be forgotten  they should inspire a renewed commitment to defend our sovereignty.\n\nMnangagwa emphasised that the renaming exercise is not merely ceremonial, but a meaningful act of reclaiming Zimbabwes identity.\n\nThis renaming marks another important step in dismantling the legacy of colonialism. We are reclaiming our history by restoring names and events that connect us to the painful yet heroic journey of our liberation struggle.\n\nThe President also addressed the broader role and challenges faced by the Zimbabwe Republic Police (ZRP), reiterating his administrations commitment to supporting the force.\n\nMy government remains fully aware that the Zimbabwe Republic Police need adequate resources to effectively fulfill their constitutional mandate, Mnangagwa said. To this end, we will continue to provide the necessary support to address road traffic accidents and other critical areas of their work.\n\nWe are committed to ensuring that our Police Service is well-equipped. I commend the Zimbabwe Republic Police for their unwavering dedication to maintaining peace and stability in our beloved Zimbabwe.\n\nMnangagwa noted that the Second Republic had prioritised the renaming of national institutions as a means to honour our liberation struggle and the heroes who played pivotal roles in it.\n\nThese name changes are not only symbolic but serve as a vital means of preserving our national heritage and fostering unity among our people, he added.\n\nHowever, despite the grandeur of the ceremony and the patriotic rhetoric, many observers are skeptical. They argue that while the government continues to rename buildings and unveil plaques, the day-to-day working and living conditions for rank-and-file officers remain dire  with inadequate salaries, poor accommodation, and lack of essential resources still unresolved.\n\nAs the name Chimoio Depot enters the official record, the real test for the Mnangagwa administration may not lie in symbolic renaming, but in whether these gestures are matched by genuine reforms and improvements in officers welfare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa on Friday officially renamed the Zimbabwe Republic Police’s Tomlinson Depot in Harare to Chimoio … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/mnangagwa-renames-zrp-tomlinson-to-chimoio-depot-but-will-this-improve-officers-welfare/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Renames ZRP Tomlinson to Chimoio Depot — But Will This Improve Officers’ Welfare?\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "As Millions Suffer, Tagwirei Claims Mnangagwa Is Feeding Nation",
            "url": "https://www.zimeye.net/2025/06/14/as-millions-suffer-tagwirei-claims-mnangagwa-is-feeding-nation/",
            "content": "By A Correspondent\n\nControversial businessman and ZANU PF ally Kudakwashe Tagwirei has leapt to the defence of President Emmerson Mnangagwa, painting him as a humble and hardworking leader who lives modestly and contributes significantly to the countrys food security.\n\nSpeaking recently in Harare, Tagwirei dismissed critics of the President, insisting that public perception fails to capture the true character of Mnangagwa. He described him as a down-to-earth, accessible leader with strong agricultural credentials and a simple lifestyle.\n\nYou dont know him, thats why you are negative, Tagwirei said. President Mnangagwa owns a moderate house, a sign of simplicity.\n\nIn an unusual attempt to showcase Mnangagwas personal integrity and productivity, Tagwirei claimed the President is an accomplished farmer who annually delivers5,000 tonnes of maizeto the Grain Marketing Board (GMB).\n\nSince 2008, he has yielded over 10 tonnes of farm produce, including soybeans, maize, potatoes, and other crops, Tagwirei added, touting the Presidents farming record as proof of his work ethic and leadership by example.\n\nHe further praised Mnangagwas openness and connection with ordinary citizens.\n\nHe has an open-door policy and talks to people when hes outside. Thats rare among leaders, Tagwirei said.\n\nThe remarks appear to be part of a broader effort to bolster Mnangagwas image amid increasing public dissatisfaction over economic woes, inflation, and concerns over corruption and elite enrichment.\n\nWhile critics often accuse Zimbabwes top leadership of extravagance and detachment from the public, Tagwireis statements aim to paint a contrasting picture: a president who not only leads the country but also tills the land and lives simply.\n\nHowever, the comments are likely to draw mixed reactions, especially given Tagwireis own controversial reputation and links to state contracts and sanctions. Still, his vocal support signals a continued push by the ruling elite to shape Mnangagwas legacy ahead of any future leadership transitions.\n\nWhether the public buys into this narrative of presidential humility remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial businessman and ZANU PF ally Kudakwashe Tagwirei has leapt to the defence of President Emmerson Mnangagwa, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/as-millions-suffer-tagwirei-claims-mnangagwa-is-feeding-nation/\">Continue reading<span class=\"screen-reader-text\"> \"As Millions Suffer, Tagwirei Claims Mnangagwa Is Feeding Nation\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "Mnangagwa Hits Hungry Cops With Empty Promises",
            "url": "https://www.zimeye.net/2025/06/14/mnangagwa-hits-hungry-cops-with-empty-promises/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa on Friday officially renamed the Zimbabwe Republic Polices Tomlinson Depot in Harare to Chimoio Depot, as part of his governments ongoing efforts to decolonise state institutions and honour the countrys liberation history. But questions remain about whether symbolic gestures like these will translate into tangible improvements for the welfare of police officers.\n\nSpeaking during the commissioning ceremony  which also included the unveiling of new police flats  Mnangagwa framed the renaming as part of a broader national agenda.\n\nThe renaming of this significant facility follows the earlier renaming of Morris Depot to Mkushi Depot, he said. The selfless sacrifices made by our sons and daughters must never be forgotten  they should inspire a renewed commitment to defend our sovereignty.\n\nMnangagwa emphasised that the renaming exercise is not merely ceremonial, but a meaningful act of reclaiming Zimbabwes identity.\n\nThis renaming marks another important step in dismantling the legacy of colonialism. We are reclaiming our history by restoring names and events that connect us to the painful yet heroic journey of our liberation struggle.\n\nThe President also addressed the broader role and challenges faced by the Zimbabwe Republic Police (ZRP), reiterating his administrations commitment to supporting the force.\n\nMy government remains fully aware that the Zimbabwe Republic Police need adequate resources to effectively fulfill their constitutional mandate, Mnangagwa said. To this end, we will continue to provide the necessary support to address road traffic accidents and other critical areas of their work.\n\nWe are committed to ensuring that our Police Service is well-equipped. I commend the Zimbabwe Republic Police for their unwavering dedication to maintaining peace and stability in our beloved Zimbabwe.\n\nMnangagwa noted that the Second Republic had prioritised the renaming of national institutions as a means to honour our liberation struggle and the heroes who played pivotal roles in it.\n\nThese name changes are not only symbolic but serve as a vital means of preserving our national heritage and fostering unity among our people, he added.\n\nHowever, despite the grandeur of the ceremony and the patriotic rhetoric, many observers are skeptical. They argue that while the government continues to rename buildings and unveil plaques, the day-to-day working and living conditions for rank-and-file officers remain dire  with inadequate salaries, poor accommodation, and lack of essential resources still unresolved.\n\nAs the name Chimoio Depot enters the official record, the real test for the Mnangagwa administration may not lie in symbolic renaming, but in whether these gestures are matched by genuine reforms and improvements in officers welfare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa on Friday officially renamed the Zimbabwe Republic Police’s Tomlinson Depot in Harare to Chimoio … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/mnangagwa-hits-hungry-cops-with-empty-promises/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Hits Hungry Cops With Empty Promises\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "Zim Legendary Actress Seeks Car Donation From Chivayo",
            "url": "https://www.zimeye.net/2025/06/14/zim-legendary-actress-seeks-car-donation-from-chivayo/",
            "content": "By A Correspondent\n\nVeteran Zimbabwean actress Mai Jilimba has publicly appealed to controversial businessman Wicknell Chivayo for a car donation, highlighting the ongoing financial struggles faced by many artists in the country.\n\nPosting on Facebook on Thursday, the legendary performerwhose contributions to Zimbabwean arts and entertainment have spanned decadesmade a heartfelt plea to Chivayo, who is known for handing out luxury cars and gifts to musicians and public figures aligned with the ruling elite.\n\nNdoziva kuti nerimwe zuva rimwe chete zvaro Baba vedu vaSir Wicknell vachandiona ini neMhuri yangu. Inini handisi kuzomira kusvikira mandiropafadza neMhuri yangu. Mutumwa asingarevi nhema Baba Wicknell  NDATENDA HANGU, she wrote.\n\nThe emotional appeal comes as a sobering reminder of the dire situation facing many Zimbabwean artists, who have often been left to fend for themselves in an unforgiving economic climate. Despite her iconic status, Mai Jilimbas request underscores the lack of structured support for artists and the increasing normalization of public begging by once-revered cultural figures.\n\nCritics say the situation reflects the broader failure of government and cultural institutions to protect and provide for national artists who, in many cases, helped shape Zimbabwes identity through film, theatre, and television.\n\nMeanwhile, Chivayo has not publicly responded to the appeal. Whether or not he grants the request, the actresss plea adds to the growing list of public figures turning to the businessman for financial lifelines in a country where fame often fails to guarantee livelihood.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran Zimbabwean actress Mai Jilimba has publicly appealed to controversial businessman Wicknell Chivayo for a car donation, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/zim-legendary-actress-seeks-car-donation-from-chivayo/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Legendary Actress Seeks Car Donation From Chivayo\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "BREAKING NEWS: Mzembi Thrown Into Remand Prison",
            "url": "https://www.zimeye.net/2025/06/14/mzembi-sent-to-remand-prison/",
            "content": "By Crime And Courts Reporter-Former Foreign Affairs Minister Walter Mzembi  will spend the weekend in remand prison after his case was postponed to Monday.\n\nMzembi appeared before Harare magistrate Don Ndirowei facing charges of defaulting three warrants of arrests.\n\nHe was arrested this weekend by the Zimbabwe Anti-Corruption Commission (ZACC), just days after his dramatic return from self-imposed exile.\n\nMzembi, who jetted into Harare earlier this week and reportedly held private meetings with President Emmerson Mnangagwa, is now in custody and undergoing vetting by ZACC officials. Sources close to the investigation confirmed that Mzembi was taken in early this morning and is expected to appear before the Harare Magistrate Court imminently.\n\nMzembis arrest marks a stunning turn of events. His low-key return had sparked widespread speculation about a possible political deal or re-entry into public life. The former G40 kingpin had fled Zimbabwe in the wake of the 2017 military coup that toppled Robert Mugabe, citing persecution and threats to his life.\n\nJust days ago, ZimEye reported that Mzembi was seen being whisked away from the Bronte Hotel under tight security for meetings with high-level government officials. His presence had triggered backlash from opposition figures and war veterans who accused him of selling out and cutting deals in the shadows.\n\nNow, with his sudden arrest, questions swirl around whether Mzembis return was sanctionedor a miscalculated move that has landed him in the crosshairs of Zimbabwes anti-graft body.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime And Courts Reporter-Former Foreign Affairs Minister Walter Mzembi will spend the weekend in remand prison after his case … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/mzembi-sent-to-remand-prison/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING NEWS: Mzembi Thrown Into Remand Prison\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "JUST IN: Mzembi Arrested Days After Meeting ED",
            "url": "https://www.zimeye.net/2025/06/14/just-in-mzembi-arrested-days-after-meeting-ed/",
            "content": "By Crime and Courts Reporter- Former Foreign Affairs MinisterWalter Mzembihas been arrested.\n\nMzembi was arrested in Harare on Friday night by members of theZimbabwe Anti-Corruption Commission (ZACC),  just days after he reportedly met with PresidentEmmerson Mnangagwa.\n\nThe former Tourism Minister who has been a fugitive from justice since fleeing the country in the aftermath of theNovember 2017 military coup, was taken into custody under unclear circumstances.\n\nHis arrest follows mounting speculation that his return to Zimbabwe and recent engagements with top government officials, including a confidential meeting with Mnangagwa earlier this week, were part of a negotiated political comeback.\n\nA former ZANU PF heavyweight and cabinet minister under the late PresidentRobert Mugabe, Mzembi fled Zimbabwe after the coup that ended Mugabes 37-year rule and ushered Mnangagwa into power.\n\nHe was one of several ministers aligned to the G40 factionloyal to former First Lady Grace Mugabewho were purged from government and faced corruption charges shortly after the change of leadership.\n\nMzembi has since lived in self-imposed exile in South Africa, where he consistently denied the corruption allegations against him.\n\nDespite an active warrant for his arrest, his movements had gone largely uncheckeduntil now.\n\nHis surprise reappearance in Harare earlier this week, and the reports of a closed-door meeting with President Mnangagwa, raised eyebrows both within the ruling party and among political observers.\n\nSpeculation was rife that Mzembi was exploring a political rehabilitation deal in exchange for his return, a possibility that now seems to have backfired.\n\nDetails around his arrest remain sketchy, but sources close to the matter say ZACC officials picked him up late Friday evening and detained him for questioning over unresolved corruption charges stemming from his tenure as Foreign Affairs Minister.\n\nHe was previously accused of misappropriating funds meant for a tourism conference during his time as Tourism Minister.\n\nMzembis arrest could signal internal rifts or shifting allegiances within the ruling elite. Some analysts view the move as part of a broader power play by Mnangagwa to assert dominance over former rivals and ensure that any return to the fold is strictly on his terms.\n\nthers suggest it may be an attempt to neutralise potential threats within ZANU PF ahead of future succession battles.\n\nZACC spokes person Simiso Mlevu confirmed Mzembis arrest reporters, without giving details.\n\nEfforts to contact Mzembis legal representatives were unsuccessful at the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- Former Foreign Affairs Minister Walter Mzembi has been arrested. Mzembi was arrested in Harare on Friday night … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/just-in-mzembi-arrested-days-after-meeting-ed/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Mzembi Arrested Days After Meeting ED\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        },
        {
            "title": "RBZ Panics As ZiG Shortage Worsens",
            "url": "https://www.zimeye.net/2025/06/14/rbz-panics-as-zig-shortage-worsens/",
            "content": "By Business Reporter The Reserve Bank of Zimbabwe (RBZ) has said they were putting measures to curb the shortage of Zimbabwe Gold (ZiG).\n\nThe current scarcity, particularly pronounced in areas outside Harare, has reignited concerns over Zimbabwes long-standing monetary instability, which dates back to the early 2000s.\n\nThe ongoing crisis is rooted in decades of poor economic governance, failed monetary reforms, and public distrust in the financial system.\n\nThese systemic issues have left the country trapped in a cycle of currency collapse, cash shortages, and inflationary pressures.\n\nSince 2000, Zimbabwe has undergone numerous currency changes, each accompanied by promises of stability that failed to materialize.\n\nFrom the infamous Zimbabwean dollaronce rendered worthless by hyperinflationto the US dollar era and the later RTGS dollar experiment, each phase has been plagued by inconsistent policy decisions, political interference in monetary affairs, and lack of confidence in the central bank.\n\nThe introduction of ZiG in April 2024 was the latest attempt to restore stability through a gold-backed currency.\n\nIn a statement issued yesterday, RBZ Governor John Mushayavanhusought to calm public anxiety, insisting that there is no shortage of ZiG in the market.\n\nHe said the usage of the local currency has improved significantly in the economy, citing figures that show the value of local currency settlements through the National Payment System jumped fromZiG7.86 billion(26%) in April toZiG56.8 billion(43%) by May 30, 2025.\n\nMushayavanhu explained that as of June 12, total ZiG deposits in the banking sector amounted toZiG16 billion, with overZiG207 millionheld as physical cash by commercial banks. This is sufficient to support daily deposits and withdrawals by the public, he claimed.\n\nHowever, on the ground, the story is different.\n\nLong queues at banks, limited cash at ATMs, and rising complaints from businesses and consumers alike paint a picture of a currency system once again failing to meet everyday needs.\n\nWhile the RBZ says some banks have begun disbursing ZiG through ATMs and others are in the process of reconfiguring their machines, distribution remains patchy and slow.\n\nTo address the crisis, the central bank says it is working closely with financial institutions to scale up the availability of ZiG in both physical and electronic forms.\n\nThe government also believes that current macroeconomic stability and a firm exchange rate will eventually improve public confidence in the currency.\n\nBut critics argue that until deeper structural issues are addressedsuch as rampant corruption, poor fiscal discipline, and opaque policy-makingnew currencies will continue to suffer the same fate.\n\nMany Zimbabweans remain sceptical of the ZiGs long-term viability, viewing it as just another rebranding exercise masking deeper economic rot.\n\nDespite official reassurances, the current cash shortages serve as a sobering reminder that without genuine economic reforms, Zimbabwes monetary challenges are far from over.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – The Reserve Bank of Zimbabwe (RBZ) has said they were putting measures to curb the shortage of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/14/rbz-panics-as-zig-shortage-worsens/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Panics As ZiG Shortage Worsens\"</span></a></p>",
            "time": "09:31",
            "date": "15 Jun 2025"
        }
    ]
}