{
    "news": [
        {
            "title": "FAZ Boss Now Army General Sparks Controversy",
            "url": "https://www.zimeye.net/2025/10/08/faz-boss-now-army-general-sparks-controversy/",
            "content": "By Political Reporter Former Central Intelligence Organisation (CIO) deputy director-general and Forever Associates Zimbabwe (FAZ) boss,Major General Walter Tapfumaneyi, has courted fresh controversy after openly admitting that the military systematically excludes opposition supporters from recruitment, reserving enlistment for those from ZANU PF-aligned families.\n\nSpeaking during theZNA Masvingo Province Traditional Leaders Daycelebrations atChief Nhemas homesteadlast weekend, Maj. Gen. Tapfumaneyi outlined a politically charged recruitment policy that prioritises ruling party supporters.\n\nWe conduct background checks to determine if your family supportsMusangano(ZANU PF) or is among the lost (opposition). The ruling party, led by President Mnangagwa, is ZANU PF. If you flock with the lost, you will be recruited when they come into power, he said.\n\nHe defended the partisan vetting process using a hunting metaphor:\n\nIf you go hunting, you cannot use your neighbours dogs; they may end up dining with the hare you are pursuing. So, if your family is among the lost, you will get into the army when the lost gets into power.\n\nTapfumaneyis remarks, which effectively confirm the militarys long-suspected political bias, have drawn sharp criticism from analysts and opposition figures who say they expose the extent to which Zimbabwes security forces are aligned with the ruling party.\n\nMajor General Tapfumaneyi is one of PresidentEmmerson Mnangagwas most trusted security operatives, with a career spanning intelligence, civil service, and political mobilization. He previously served asDeputy Director-General of the CIO, before being appointedPermanent Secretary in the Ministry of State for National Security.\n\nHis prominence grew sharply in the run-up to the2023 general elections, when he became the face ofForever Associates Zimbabwe (FAZ) a shadowy organization linked to theCIOand widely accused of orchestrating voter intimidation and electoral manipulation in favour of ZANU PF.\n\nFAZ, registered as a private trust but operating with state-level coordination, deployed thousands of agents across the country during the elections. Its operatives set up bases near polling stations, allegedly compiling voter data, coercing citizens, and monitoring voting patterns  actions condemned by election observers, including theSouthern African Development Community (SADC)Election Observation Mission.\n\nTheSADC preliminary reporton Zimbabwes 2023 elections specifically cited FAZs presence as a major concern, describing it as a threat to the secrecy and freedom of the vote. TheCitizens Coalition for Change (CCC)also accused FAZ of operating as a parallel electoral command structure under the direct supervision of Mnangagwas intelligence network.\n\nDespite widespread criticism, Mnangagwa rewarded Tapfumaneyi with promotion to the rank ofMajor General, further entrenching his influence within the countrys powerful military-security complex. His elevation is seen by many as part of Mnangagwas strategy to consolidate control over the armed forces amid internal factional tensions.\n\nAt the Masvingo event,Minister of State for Provincial Affairs and Devolution, Ezra Chadzamira, publicly praised Tapfumaneyi for ensuring ZANU PFs victory in the 2023 elections.\n\nWe thank Major General Tapfumaneyi for his steadfastness and commitment to the ruling partys success in the polls, said Chadzamira, in remarks that further blurred the line between party and state institutions.\n\nThe general, in turn, lauded the local ZANU PF leadership for its strong support to the army, underscoring the enduring perception that the countrys military serves partisan rather than national interests.\n\nTapfumaneyis statements come at a time when theZimbabwe Defence Forces (ZDF)faces growing scrutiny for its overt political involvement. Since the 2017 coup that ushered Mnangagwa to power, senior military figures have been rewarded with top government and parastatal positions, blurring the distinction between the barracks and politics.\n\nAnalysts warn that such rhetoric entrenches a culture of militarised politics, where loyalty to the ruling party outweighs professionalism and constitutional obligations.\n\nThis is a dangerous admission  it shows that the military is now fully captured by political interests, said one Harare-based political analyst. It confirms what opposition parties and civil society have long argued: Zimbabwe is run by a militarised elite loyal to Mnangagwa, not to the Constitution.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter – Former Central Intelligence Organisation (CIO) deputy director-general and Forever Associates Zimbabwe (FAZ) boss, Major General Walter Tapfumaneyi, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/faz-boss-now-army-general-sparks-controversy/\">Continue reading<span class=\"screen-reader-text\"> \"FAZ Boss Now Army General Sparks Controversy\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Another Top Junta Dies",
            "url": "https://www.zimeye.net/2025/10/08/another-top-junta-dies-4/",
            "content": "By A Correspondent-The Zimbabwe National Army (ZNA) has announced the death of Brigadier General (Retired) Victor Mzheri Mpandasekwa, who passed away on Tuesday at a local hospital in Harare. He was 75.\n\nIn a statement, the Commander of the Zimbabwe National Army, Lieutenant General Emmanuel Matatu, confirmed the passing of the decorated liberation war veteran, describing it as a huge loss to the nation and the defence forces.\n\nThe Zimbabwe National Army has lost a gallant son of the soil whose contribution to the liberation and defence of the motherland remains indelible, Matatu said.\n\nThe late Brigadier General (Rtd) Mpandasekwa, who was known during the liberation struggle by his Chimurenga name,Cde Khetani Khanye, dedicated his life to serving Zimbabwe both during the liberation war and after independence.\n\nHe is survived by four children  Anesu, Ropafadzai, Tinashe, and Khanye. Mourners are gathered at House Number 189, Helensvale, Borrowdale, Harare. Burial arrangements will be announced in due course.\n\nMpandasekwas death adds to a long list of high-ranking military and intelligence officials who have died under unclear circumstances since PresidentEmmerson Mnangagwaseized power through a military-assisted coup inNovember 2017, which ousted the late former PresidentRobert Mugabe.\n\nIn the years following Mnangagwas rise, Zimbabwes military elite  the same architects of the 2017 coup  have been dying one after another, sparking speculation of a silent purge within the armed forces as factional battles intensify between Mnangagwa and his deputy,Vice President Constantino Chiwenga.\n\nAmong the prominent figures who have died are:\n\nThis long list of deaths has fuelled widespread speculation about internal purges and deep-seated mistrust within Zimbabwes security establishment, especially as the rulingZANU PFparty heads towards another potentially divisive congress.\n\nAnalysts argue that many of the deceased were members of the so-calledcoup coalition, a loose alliance of generals who helped Mnangagwa ascend to power. In recent years, fissures have emerged within this group, particularly between Mnangagwas civilian loyalists and the military commanders believed to still align with Vice President Chiwenga.\n\nWhile authorities have consistently attributed the deaths to short illnesses, the frequency and pattern of these fatalities have kept political observers and the public guessing about the real causes  and what they mean for Zimbabwes fragile civil-military relations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Zimbabwe National Army (ZNA) has announced the death of Brigadier General (Retired) Victor Mzheri Mpandasekwa, who passed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/another-top-junta-dies-4/\">Continue reading<span class=\"screen-reader-text\"> \"Another Top Junta Dies\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Electricity Blackout As Hwange Thermal Power Station Collapses",
            "url": "https://www.zimeye.net/2025/10/08/electricity-blackout-as-hwange-thermal-power-station-collapses/",
            "content": "By Business Reporter  Zimbabwe faces a fresh wave of crippling power shortages after the Zimbabwe Power Company (ZPC) announced thatHwange Power Stations Unit 6has been taken off the national grid following a system failure  a setback that threatens to plunge large parts of the country into darkness.\n\nThe unit, one of the original thermal generating units commissioned at Hwange in the 1980s, has an installed capacity of220 megawatts (MW). Its sudden shutdown compounds Zimbabwes already fragile electricity situation, as the country battles persistent load-shedding and ageing power infrastructure.\n\nIn a statement issued onTuesday, October 7, 2025, ZPC said the affected unit will be out of service for at least three days, with restoration expected onOctober 10, 2025.\n\nZESA Holdings wishes to inform its valued stakeholders that Hwange Unit 6 has been taken off the grid due to a system failure, the company said.\n\nThe unit will be out of operation for a period of three days and is expected to return to service on 10 October 2025.\n\nDuring this period, Hwange Power Station will continue operating with three units in service. We sincerely apologise for any inconvenience this outage may cause and appreciate your understanding as we work to restore full generation capacity.\n\nThe temporary loss of Unit 6 comes at a time when Zimbabwes electricity generation has already dropped to critical levels, with total output frequently falling below1,000 MWagainst a national demand of around1,800 MW. The development raises fears ofnationwide blackoutsand intensified load-shedding in urban and industrial areas.\n\nWhile Hwange remains the countrys main source of thermal power, it has long suffered fromchronic equipment breakdowns, low coal supplies, and poor maintenance. The recently commissionedHwange Units 7 and 8, each producing 300 MW under a Chinese-funded expansion project, had been expected to stabilise supply. However, frequent technical challenges and delayed maintenance have continued to undermine production.\n\nZimbabwes power crisis stretches back more than two decades, rooted in a mix ofaged infrastructure,underinvestment, andcurrency instabilitythat has hampered the ability to import electricity or maintain plants.\n\nTheKariba South Hydro Power Station, which generates much of the countrys renewable energy, has been operating below capacity due tolow water levelsin the Kariba Dam. Meanwhile, most of Hwanges original six thermal units, commissioned between1983 and 1987, have outlived their design lifespan and now operate erratically.\n\nThe country has relied onimports from South Africa, Zambia, and Mozambique, but regional suppliers often curtail exports during peak periods, leaving Zimbabwe vulnerable to domestic generation shortfalls.\n\nAccording to energy analysts, the current crisis highlights the urgent need fordiversification into renewable energy, particularly solar and wind, to reduce dependence on ageing thermal and hydro stations.\n\nFrequent power cuts have dealt a severe blow toindustry, mining, agriculture, and small businesses, forcing many companies to rely on costly diesel generators. Analysts warn that the latest Hwange breakdown could disrupt production across critical sectors, further straining an already struggling economy.\n\nEnergy insecurity remains one of the biggest obstacles to Zimbabwes industrial recovery, said one Harare-based energy economist. Until there is sustained investment in generation, transmission, and alternative power, outages like these will continue to drag down productivity and investor confidence.\n\nWhile ZPC has assured the public that engineers are working to restore Unit 6 within three days, the incident underscores thefragile state of Zimbabwes energy infrastructure. The temporary shutdown, coupled with reduced output at Kariba, could push the nation to the brink of atotal blackoutif further breakdowns occur.\n\nFor millions of Zimbabweans, who already endure long hours without electricity, the latest collapse at Hwange signals yet another grim reminder of the countrysdeepening energy crisis one that demands urgent, long-term solutions beyond temporary fixes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – Zimbabwe faces a fresh wave of crippling power shortages after the Zimbabwe Power Company (ZPC) announced … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/electricity-blackout-as-hwange-thermal-power-station-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"Electricity Blackout As Hwange Thermal Power Station Collapses\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Zanu PF’s Marapira Defends Resolution To Extend Mnangagwa Term Of Office",
            "url": "https://www.zimeye.net/2025/10/08/zanu-pfs-marapira-defends-resolution-to-extend-mnangagwa-term-of-office/",
            "content": "By A Correspondent\n\nZANU-PF has recently dismissed growing speculation about a leadership succession debate, insisting that the matter will not be discussed at the partys upcoming annual conference in Mutare.\n\nSpeaking to the media on Monday, the partys Information and Publicity Director, Farai Marapira, said succession issues are not on the agenda for the event scheduled for 10 to 23 October 2025. He noted that such discussions are reserved for the ZANU-PF Congress, which is only set for 2027.\n\nTo clarify, succession is handled at Congress, Marapira said. We are not going to Congress; we are going to a conference. Succession is simply not part of ZANU-PFs agenda.\n\nHe added that calls for succession are being driven by outsiders with no connection to the party. Most of those pushing this succession narrative are not members of ZANU-PF, Marapira said. They do not belong to our structures, and as a party, we will not entertain imported conversations. Our focus is on reviewing progress since the 2023 elections and delivering on the peoples mandate.\n\nMarapira emphasized that the economy remains the partys priority. Zimbabweans voted for President Mnangagwa to continue steering the country toward economic recovery and growth. That is what our conference will be about  keeping the Presidents economic vision on course, he said.\n\nHe also defended a resolution passed at last years 21st National Peoples Conference in Bulawayo, which endorsed extending President Mnangagwas term from 2028 to 2030. Resolution Number One makes it clear that succession is not a topic within ZANU-PF, Marapira said. You cannot talk about continuity and succession at the same time. The resolution reinforces the partys support for the current leadership.\n\nMarapira concluded by affirming that the Mutare conference will focus on development, policy evaluation, and party unity, rather than leadership changes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU-PF has recently dismissed growing speculation about a leadership succession debate, insisting that the matter will not … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/zanu-pfs-marapira-defends-resolution-to-extend-mnangagwa-term-of-office/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF’s Marapira Defends Resolution To Extend Mnangagwa Term Of Office\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Citizens Slam “Empty Budget Consultations” as Parliament Fails to Deliver Real Change",
            "url": "https://www.zimeye.net/2025/10/08/citizens-slam-empty-budget-consultations-as-parliament-fails-to-deliver-real-change/",
            "content": "By A Correspondent\n\nDespite Parliaments attempt to present the ongoing 2026 National Budget consultations as a symbol of inclusivity, many Zimbabweans have dismissed the process as hollow, repetitive, and disconnected from the harsh realities on the ground.\n\nIn a short statement on Monday, the Parliament of Zimbabwe claimed that citizens across the country actively participated in shaping the upcoming 2026 National Budget, expressing their hopes and priorities for a more inclusive and equitable future.\n\nHowever, critics say the same promises have been made for years with little to no tangible results.\n\nThe government keeps calling these consultations nationwide but what difference do they ever make? asked a frustrated Harare resident. We speak, they listen, and then they go back to doing whatever they want. Its just for show.\n\nDuring the meetings, persons with disabilities reportedly appealed for more support in the education sector to ensure accessibility and equal opportunities, while women and youth called for job creation and funding for small businesses. Yet, many believe such appeals will once again be ignored once the cameras are off.\n\nEvery year, we are told the same story  empowerment this, inclusion that  but when the budget comes, theres nothing for the ordinary person, said an activist from Bulawayo. Its all talk and no delivery.\n\nStakeholders also highlighted the need to strengthen health services, boost infrastructure, and prioritize agriculture. But citizens are skeptical, arguing that these issues have been on the governments agenda for decades without progress.\n\nThe consultations sound good on paper, said a teacher from Mutare, but our hospitals have no medicine, roads are falling apart, and farmers cant afford inputs. Whats the point of talking if nothing changes?\n\nWhile Parliament described the consultations as proof of a responsive budget that leaves no one behind, public sentiment paints a very different picture  one of fatigue, mistrust, and growing doubt that any budget under the current administration will bring the relief people desperately need.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Despite Parliament’s attempt to present the ongoing 2026 National Budget consultations as a symbol of inclusivity, many … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/citizens-slam-empty-budget-consultations-as-parliament-fails-to-deliver-real-change/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens Slam “Empty Budget Consultations” as Parliament Fails to Deliver Real Change\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "As Chinese Fined $150, Black People Denied Bail Over Drug Crime",
            "url": "https://www.zimeye.net/2025/10/08/as-chinese-fined-150-black-people-denied-bail-over-drug-crime/",
            "content": "By Dorrothy Moyo | Its a scene straight out of a drug bust thriller  a dimly lit corridor echoing with tension, as two handcuffed men are led past piles of tightly wrapped black plastic bales stacked floor to ceiling. The unmistakable smell of raw dagga hangs thick in the air. One suspect, sweat glistening on his brow, stands frozen in a Lakers jersey, while the other glances nervously around in a grey sweater  both surrounded by what police say is a stash worth over three-quarters of a million US dollars. Behind them, an officer unlocks the iron-barred cell door, the clink of keys marking the final descent of two former football stars now caught in the grip of Zimbabwes biggest drug trafficking scandal this year.\n\nKwekwe, Zimbabwe  Tuesday, 8 October 2025\n\nFormer Premier Soccer League (PSL) footballers Reuben Mhlanga and Abbas Amidu have been denied bail after appearing before a magistrate in Kwekwe on serious drug trafficking charges.\n\nThe pair was arrested last week after law enforcement officers, acting on a tip-off, raided a location in the city and discovered a massive cache of compressed dagga (marijuana). The estimated street value of the drugs is pegged at over US$750,000, making it one of the largest drug seizures in Zimbabwe this year.\n\nShocking Scene Captured\n\nA photograph circulating on social media shows the two men handcuffed, standing inside a room stacked high with dozens of large black plastic-wrapped parcels, each sealed with multiple layers of brown masking tape. These packagesbelieved to be industrial quantities of daggaare seen piled against walls and on the floor.\n\nReuben Mhlanga is pictured wearing a Los Angeles Lakers #23 basketball vest, while Abbas Amidu dons a Monte Carlo grey sweatshirt. Both appear to be in police custody, with an officer visible in the background securing the premises.\n\nThe room, appearing to be either a converted storehouse or residential property, had allegedly been used to process and store the bulk contraband ahead of distribution.\n\nCourt Proceedings\n\nThe suspects were formally charged in court on Tuesday. Prosecutors submitted that the accused are central figures in a larger drug syndicate, and bail was opposed on the grounds of the severity of the charges and the risk of flight or interference with evidence.\n\nThey were remanded in custody to reappear in court on 22 October 2025.\n\nFallout in the Football Community\n\nThe arrest of Mhlanga and Amidu has shocked the football fraternity, as both were once household names in the Zimbabwe Premier Soccer League. Mhlanga was known for his defensive prowess, while Amidu, who also had international caps for Zimbabwe, had been celebrated for his attacking flair before exiting the professional game.\n\nTheir arrest adds to a growing number of ex-athletes in Zimbabwe who have faced legal or financial trouble after exiting\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | It’s a scene straight out of a drug bust thriller — a dimly lit corridor echoing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/as-chinese-fined-150-black-people-denied-bail-over-drug-crime/\">Continue reading<span class=\"screen-reader-text\"> \"As Chinese Fined $150, Black People Denied Bail Over Drug Crime\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "ZEP BREAKTHROUGH: South Africa Extends Permits to 2027",
            "url": "https://www.zimeye.net/2025/10/07/zep-breakthrough-south-africa-extends-permits-to-2027/",
            "content": "South Africa Extends Zimbabwean Exemption Permits to 2027  ZimCommunitySA Welcomes Move but Calls for Clearer, Permanent Solution\n\nBy Farai D Hove | 7 October 2025  JohannesburgZimbabwean nationals in South Africa have been granted a crucial two-year reprieve after the government officially extended the validity of the Zimbabwean Exemption Permit (ZEP) to 28 May 2027, under Ministers Immigration Directive No. 21 of 2025, published in Government Gazette No. 53484.\n\nIn a statement issued on Monday, ZimCommunitySA hailed the move as a positive and humane decision that brings temporary relief to thousands of Zimbabweans living, studying, and working in South Africa. The extension safeguards their legal right to remain in the country and protects them from deportation or arrest while ongoing policy consultations continue.\n\nHowever, the group expressed disappointment that the announcement was piecemeal rather than conclusive. They warned that temporary extensions continue to leave families and workers in prolonged uncertainty, affecting livelihoods and creating confusion among those attempting to transition into mainstream visa categories.\n\nZimCommunitySA reported widespread administrative chaos during the regularisation process, with applicants facing high rejection rates, technical errors, and system failures at VFS Global. Others have reportedly been turned away by traffic departments refusing to renew drivers licences or by service providers demanding a physical permit sticker despite the gazette confirming permit validity.\n\nParents have also struggled to obtain study permits for their children, as current systems require an existing valid permit to process new applications.\n\nTo address these challenges, ZimCommunitySA proposed that VFS Global and the Department of Home Affairs (DHA) issue a temporary ZEP validity sticker or certification to help holders verify their legal status and reduce administrative rejections.\n\nThe organisation appealed for clarity, fairness, and compassion in the ongoing review process, urging the Immigration Advisory Board (IAB) and DHA to engage directly with affected communities to find a humane and economically sound resolution.\n\nZimCommunitySA also called on employers and stakeholders to recognise the wider economic and social disruptions caused by uncertainty over the permits, which affect businesses and families alike.\n\nDespite its concerns, the organisation expressed deep gratitude to the South African government for its hospitality and regional solidarity, reaffirming its commitment to lawful conduct, cooperation, and constructive dialogue in pursuit of a lasting solution for all affected Zimbabweans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa Extends Zimbabwean Exemption Permits to 2027 — ZimCommunitySA Welcomes Move but Calls for Clearer, Permanent Solution By Farai … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/zep-breakthrough-south-africa-extends-permits-to-2027/\">Continue reading<span class=\"screen-reader-text\"> \"ZEP BREAKTHROUGH: South Africa Extends Permits to 2027\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Christians Mentioned at the UN",
            "url": "https://www.zimeye.net/2025/10/07/christians-mentioned-at-the-un/",
            "content": "On September 23, 2025, at the United Nations General Assembly, President Donald Trump called on global leaders to defend religious liberty, describing Christianity as the most persecuted religion on the planet.\n\nIndeed, the human beingcomposed of both the unseen (spiritual) and the seen (physical)manifests through diverse belief systems.\n\nThe attacks on Christianity, therefore, arise not merely from prejudice, but perhaps from the departure of the faith from its original embodiment of the way, the truth, and the lifea creed that once exuded coexistence, harmony, love, and joyous living in the world.\n\nReligion serves as a moral compass guiding humanity toward peace.Yet, when taken to extremes, it defies nature and becomes a source of danger.\n\nEven so, every society has the right to uphold doctrinal or cultural principles that regulate behavior within its bordersalong with corresponding consequences for their violation.\n\nIf Country A, guided by religious conviction, forbids cocaine, that law must be respected; violation invites due punishment.\n\nIf Country B, founded on Buddhist values, expects public servants to act uprightly and condemns corruption, disobedience must attract a measured penalty.\n\nIf Country C, dominated by another faith, allows public officials to misuse resources while professing righteousness, should its Public Accounts Committee not enforce moral and administrative accountability?\n\nIn India, many hold firm belief in the Law of Karmathat ones return to earth depends on the deeds of a previous life.Whether one is reborn as a human or animal, the determining factor is moral conduct, especially honesty.This doctrine instills discipline and guides moral behavior in daily life.\n\nReligion, when rightly practiced, straightens and regulates society; it does not disorder or disorganize it.\n\nYet today, the conduct of many Christian leaders has fueled the growing criticism and persecution of Christianity.\n\nHow can congregations suffering under poverty and despair continue to trust leaders who align with bad governance through their words and actions?\n\nThe personality of Jesus Christ on earth stood for humility, justice, and compassionqualities rarely reflected in much of todays gospel preaching.\n\nThe affluence of some Christian leaders and their insensitivity to social realities send conflicting messages.\n\nMany now leverage the teachings of Christ not for genuine evangelism, but as tools for exploitationechoing the manipulation that preceded colonial adventurism.\n\nIn post-independence Afrika, where governments often fail to provide adequate social security, the people look to the church for survival, yet are met with self-centered leadership.\n\nThe spirit lives in the body, and the body must be fed. Scripture says, He who does not work, neither shall he eat. Human existence depends on productive work, not mere spiritual ritual.\n\nSpending twenty-four hours in church will not make manna fall again;that miracle occurred once in sacred history.\n\nChurches must therefore engage in productive ventures to help alleviate hardship in society.\n\nWhen faith translates into practical economic empowerment, criticism diminishes, and evangelism becomes more effective.\n\nSadly, many who engage in corruption justify their acts as God-sent opportunities, parading themselves in church while undermining national development.\n\nShouldnt the leaders of the church play a role in exposing such misguided citizens?\n\nUnfortunately, religious leadership itself has become deeply polarized, often dividing nations instead of uniting them.\n\nThe prophets of old stood firm, offering wise counsel to kings and governments without fear or favor.\n\nToday, many modern prophets seek favors, diplomatic passports, and money before proclaiming the Word of God.\n\nIt is time to call for an Afrikan Version of the Bibleone that unveils the hidden truths behind the Doctrine of Discovery that shaped the religious and political destiny of the continent.\n\nBenjamin Anyagre Aziginaateeg,Chief Executive Officer,AfriKan Continental Union Consult -ACUC-Ghana\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "On September 23, 2025, at the United Nations General Assembly, President Donald Trump called on global leaders to defend religious … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/christians-mentioned-at-the-un/\">Continue reading<span class=\"screen-reader-text\"> \"Christians Mentioned at the UN\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Total Blackout Looms As Hwange Thermal Power Station Collapses",
            "url": "https://www.zimeye.net/2025/10/07/total-blackout-looms-as-hwange-thermal-power-station-collapses/",
            "content": "By Business Reporter  Zimbabwe faces a fresh wave of crippling power shortages after the Zimbabwe Power Company (ZPC) announced thatHwange Power Stations Unit 6has been taken off the national grid following a system failure  a setback that threatens to plunge large parts of the country into darkness.\n\nThe unit, one of the original thermal generating units commissioned at Hwange in the 1980s, has an installed capacity of220 megawatts (MW). Its sudden shutdown compounds Zimbabwes already fragile electricity situation, as the country battles persistent load-shedding and ageing power infrastructure.\n\nIn a statement issued onTuesday, October 7, 2025, ZPC said the affected unit will be out of service for at least three days, with restoration expected onOctober 10, 2025.\n\nZESA Holdings wishes to inform its valued stakeholders that Hwange Unit 6 has been taken off the grid due to a system failure, the company said.\n\nThe unit will be out of operation for a period of three days and is expected to return to service on 10 October 2025.\n\nDuring this period, Hwange Power Station will continue operating with three units in service. We sincerely apologise for any inconvenience this outage may cause and appreciate your understanding as we work to restore full generation capacity.\n\nThe temporary loss of Unit 6 comes at a time when Zimbabwes electricity generation has already dropped to critical levels, with total output frequently falling below1,000 MWagainst a national demand of around1,800 MW. The development raises fears ofnationwide blackoutsand intensified load-shedding in urban and industrial areas.\n\nWhile Hwange remains the countrys main source of thermal power, it has long suffered fromchronic equipment breakdowns, low coal supplies, and poor maintenance. The recently commissionedHwange Units 7 and 8, each producing 300 MW under a Chinese-funded expansion project, had been expected to stabilise supply. However, frequent technical challenges and delayed maintenance have continued to undermine production.\n\nZimbabwes power crisis stretches back more than two decades, rooted in a mix ofaged infrastructure,underinvestment, andcurrency instabilitythat has hampered the ability to import electricity or maintain plants.\n\nTheKariba South Hydro Power Station, which generates much of the countrys renewable energy, has been operating below capacity due tolow water levelsin the Kariba Dam. Meanwhile, most of Hwanges original six thermal units, commissioned between1983 and 1987, have outlived their design lifespan and now operate erratically.\n\nThe country has relied onimports from South Africa, Zambia, and Mozambique, but regional suppliers often curtail exports during peak periods, leaving Zimbabwe vulnerable to domestic generation shortfalls.\n\nAccording to energy analysts, the current crisis highlights the urgent need fordiversification into renewable energy, particularly solar and wind, to reduce dependence on ageing thermal and hydro stations.\n\nFrequent power cuts have dealt a severe blow toindustry, mining, agriculture, and small businesses, forcing many companies to rely on costly diesel generators. Analysts warn that the latest Hwange breakdown could disrupt production across critical sectors, further straining an already struggling economy.\n\nEnergy insecurity remains one of the biggest obstacles to Zimbabwes industrial recovery, said one Harare-based energy economist. Until there is sustained investment in generation, transmission, and alternative power, outages like these will continue to drag down productivity and investor confidence.\n\nWhile ZPC has assured the public that engineers are working to restore Unit 6 within three days, the incident underscores thefragile state of Zimbabwes energy infrastructure. The temporary shutdown, coupled with reduced output at Kariba, could push the nation to the brink of atotal blackoutif further breakdowns occur.\n\nFor millions of Zimbabweans, who already endure long hours without electricity, the latest collapse at Hwange signals yet another grim reminder of the countrysdeepening energy crisis one that demands urgent, long-term solutions beyond temporary fixes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – Zimbabwe faces a fresh wave of crippling power shortages after the Zimbabwe Power Company (ZPC) announced … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/total-blackout-looms-as-hwange-thermal-power-station-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"Total Blackout Looms As Hwange Thermal Power Station Collapses\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        },
        {
            "title": "Top Army General Dies",
            "url": "https://www.zimeye.net/2025/10/07/top-army-general-dies/",
            "content": "By A Correspondent\n\nThe Zimbabwe National Army (ZNA) has announced the death of Brigadier General (Retired) Victor Mzheri Mpandasekwa, who passed away on Tuesday at a local health facility in Harare. He was 75.\n\nIn a statement, the Commander of the Zimbabwe National Army, Lieutenant General Emmanuel Matatu, confirmed the passing of the decorated liberation war veteran, describing it as a huge loss to the nation and the defence forces.\n\nThe late Brigadier General (Rtd) Mpandasekwa, who was known during the liberation struggle by his Chimurenga name,Cde Khetani Khanye, dedicated his life to serving Zimbabwe both during the liberation war and after independence.\n\nHe is survived by four children  Anesu, Ropafadzai, Tinashe, and Khanye.\n\nMourners are gathered at House Number 189, Helensvale, Borrowdale, Harare. Burial arrangements will be announced in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe National Army (ZNA) has announced the death of Brigadier General (Retired) Victor Mzheri Mpandasekwa, who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/07/top-army-general-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Army General Dies\"</span></a></p>",
            "time": "06:00",
            "date": "09 Oct 2025"
        }
    ]
}