{
    "news": [
        {
            "title": "Econet Meltdown Sparks Exodus To Starlink",
            "url": "https://www.zimeye.net/2025/06/15/econet-meltdown-sparks-exodus-to-starlink/",
            "content": "By Business Reporter-Econet Wireless has issued yet another apology as its mobile networkcontinues to crumble, leaving millions of Zimbabweans frustrated and disconnected.\n\nThe countrys largest mobile operator is struggling to maintain reliable services, with outages, dropped calls, and painfully slow internet speeds now a daily nightmare for users.\n\nThis latest collapse comes amid growing pressure from Elon Musks Starlink, whose underground rollout is fast gaining traction in Zimbabwes urban and rural areas.\n\nDear Customer, this notice confirms the restoration of our data connectivity services Weapologisefor any inconvenience or service disruption caused by recent challenges, Econet said in a statement Sunday.\n\nThe company advised usersstillexperiencing problems to restart their devices and contact customer support.\n\nBut for many, the apology is too little, too late.\n\nLast week, Econet issued a similar message. For months, the telecoms giant has failed to keep up with soaring demand and rising competition, especially in high-density urban zones where poor service has sparked a storm of complaints on social media.\n\nTech experts say Econets persistent failures could mark the start of a major market shift. Starlinks model bypasses traditional telecom infrastructure entirely. Its fast, reliable, and attractiveespecially in areas where Econet is weakest, said a Harare-based telecom analyst.\n\nStarlink, owned by SpaceX, offers high-speed broadband via low-earth orbit satellites and has already secured licenses in multiple Southern African countries.\n\nThough unofficial, its Zimbabwe rollout has caught fireparticularly among urban elites, rural businesses, and tech-savvy users seeking a stable internet lifeline.\n\nEconets customers, meanwhile, are furious about rising data prices despite poor service. You buy expensive bundles, but you cant even send a WhatsApp message, complained a user in Bulawayo.\n\nWhile the company blames Zimbabwes broader economic crisis for its challengesciting foreign currency shortages and high import costscritics argue poor management and lack of investment are just as much to blame.\n\nEconet insists its engineers are working to restore normal service. But with trust rapidly eroding and digital competition heating up, the once-dominant operator now faces its most dangerous threat yet: irrelevance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-Econet Wireless has issued yet another apology as its mobile network continues to crumble, leaving millions of Zimbabweans frustrated … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/econet-meltdown-sparks-exodus-to-starlink/\">Continue reading<span class=\"screen-reader-text\"> \"Econet Meltdown Sparks Exodus To Starlink\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "Alarm Bells Ring As DeMbare Remain In Relegation Zone",
            "url": "https://www.zimeye.net/2025/06/15/alarm-bells-ring-as-dembare-remain-in-relegation-zone/",
            "content": "By Sports Correspondent | 15 June 2025\n\nDynamos Football Clubs struggles continued over the weekend as the Harare giants failed to secure a much-needed victory, drawing 1-1 with Bikita Minerals in a Castle Lager Premier Soccer League matchday 15 fixture on Saturday.\n\nThe result leaves DeMbare entrenched in the relegation zone, sitting 16th on the log with 11 points, and still searching for a win after 11 consecutive matches without a victory.\n\nDynamos took the lead early in the match through Shadreck Nyahwa, who struck in the 20th minute, offering a glimmer of hope for the troubled side. However, Bikita Minerals responded swiftly, with Tinashe Ruzive levelling the score just 10 minutes later.\n\nThe draw has done little to ease the mounting pressure on the Dynamos technical bench, as fans grow increasingly concerned about the teams alarming dip in form.\n\nMeanwhile, at Rufaro Stadium, CAPS United continued their mini-revival with a hard-fought 1-0 win over Chicken Inn. Kundai Benyu netted the winner in the 65th minute, sealing the Green Machines second consecutive victory.\n\nThe win lifts CAPS United to 13th place on the table with 16 points, giving them a five-point cushion above the relegation zone as they aim to stabilize their campaign.\n\nAs the league nears the halfway mark, Dynamos poor form has become one of the seasons most worrying stories, with calls growing louder for urgent intervention to rescue the club from an unthinkable drop.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent | 15 June 2025 Dynamos Football Club’s struggles continued over the weekend as the Harare giants failed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/alarm-bells-ring-as-dembare-remain-in-relegation-zone/\">Continue reading<span class=\"screen-reader-text\"> \"Alarm Bells Ring As DeMbare Remain In Relegation Zone\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "BREAKING NEWS: Temba Mliswa Arrested",
            "url": "https://www.zimeye.net/2025/06/15/breaking-news-temba-mliswa-arrested/",
            "content": "By Crime and Courts Reporter-Former Norton legislator Temba Mliswa has been arrested  by a team of armed Chinhoyi police officers from the Zimbabwe Republic Polices Law and Order section.\n\nThe outspoken politician announced his arrest on Sunday afternoon via his X (formerly Twitter) account, claiming the operation was linked to his recent allegations of corruption involving high-ranking officials in Mashonaland West.\n\nBreaking News!Today, I was arrested by a formidable contingent of 12 armed Law and Order Officers from the ZRP in Chinhoyi, all orchestrated by the Officer Commanding Mash West, Commissioner Tawonei Nyazema, who is clearly scurrying around to clean his criminal trail, Mliswa posted.\n\nMliswa alleges his arrest stems from a series of tweets in which he accused both Commissioner Nyazema and the Mashonaland West Minister of State for Provincial Affairs, Marian Chombo, of being part of a clandestine criminal cartel involving illegal Chinese mining operations in the Sanyati area.\n\nPolice Spokesperson Paul Nyathi could not be reached for comment.\n\nMore details to follow as the story develops.\n\nBreaking News! Today, I was arrested by a formidable contingent of 12 armed Law and Order Officers from the ZRP in Chinhoyi, all orchestrated by  the Officer Commanding Mash West, Commissioner Tawonei Nyazema who is clearly scurrying around to clean his criminal trail.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Former Norton legislator Temba Mliswa has been arrested by a team of armed Chinhoyi police officers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/breaking-news-temba-mliswa-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING NEWS: Temba Mliswa Arrested\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "Key Facts About Mushroom Farming…",
            "url": "https://www.zimeye.net/2025/06/15/key-facts-about-mushroom-farming/",
            "content": "By Dr Trywell Muzerengi\n\nOyster mushroom farming is fast emerging as one of the most accessible and profitable agribusiness opportunities in Zimbabwe, offering a low-cost, high-value avenue for income generation, food security, and environmental restoration.\n\nUnlike many traditional crops that require expensive inputs, oyster mushrooms are incredibly cheap to grow. You can use locally available crop residues as a growing medium, such as maize stalks, wheat straw, or cotton waste, explains Dr Trywell Muzerengi. This makes the enterprise ideal for rural and urban farmers alike, especially those with limited resources.\n\nZimbabwe currently imports over 80% of its mushroom fruit from South Africa, highlighting a massive gap in the local supply chain and a ripe opportunity for domestic producers.\n\nAnother key advantage is that mushroom farming does not require costly infrastructure. You dont need expensive mushroom houses, Dr Muzerengi adds. You can construct low-cost structures using poles and thatch grass, or even convert existing tobacco barns into mushroom housesespecially in winter.\n\nOyster mushrooms can be grown year-round, giving farmers a continuous production cycle and consistent income potential. Beyond food, mushrooms are in high demand for pharmaceutical applications, including the production of pills and natural health products. Additionally, oyster mushrooms play an important role in land reclamation, particularly on land degraded by mining and cyanidation.\n\nThe Chinese are already taking advantage of Zimbabwes favourable climate to grow mushroom fruits for export, notes Dr Muzerengi. We need to harness this potential ourselves, especially with ready export and local markets.\n\nThe benefits of oyster mushroom farming go beyond economics. It offers a path to self-employment, food nutrition, and value addition opportunities. Entrepreneurs can venture into producing mushroom-based products such as biltong, soaps, and even cosmetics for both local and international markets.\n\nIn a time when traditional farming faces numerous challengesfrom climate change to market instabilityoyster mushroom farming stands out as a resilient, affordable, and scalable solution for individuals and communities looking to grow wealth and sustainability from the soil up.\n\nDr Trywell Muzerengi is an agricultural expert and advocate for sustainable agribusiness innovations in Zimbabwe.\n\nemail:[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Oyster mushroom farming is fast emerging as one of the most accessible and profitable agribusiness opportunities … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/key-facts-about-mushroom-farming/\">Continue reading<span class=\"screen-reader-text\"> \"Key Facts About Mushroom Farming…\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "High School Learners Caught Smoking Mbanje",
            "url": "https://www.zimeye.net/2025/06/15/high-school-learners-caught-smoking-mbanje/",
            "content": "By A Correspondent | 15 June 2025\n\nPolice detectives in Murewa have arrested two individuals accused of supplying dangerous drugs to high school learners, following an incident where students were caught smoking dagga (mbanje) on school grounds.\n\nThe suspects, Hazvinei Time (51) and Blessing Tembo (26), were apprehended after five learners  three in Form 6 and two in Form 4  were discovered using the illicit substance at a Murewa school on 11 June 2025.\n\nDuring a follow-up search at Tembos residence, officers recovered 23 sachets of dagga hidden in a bedroom, pointing to an organised distribution operation targeting school children.\n\nAuthorities believe the increasing exposure of students to drug use on social media may be contributing to the trend. This concern follows the circulation of a viral video under police investigation, which shows a schoolgirl smoking what is believed to be dagga while her peers sing Happy Birthday in the background.\n\nCommenting on the incident, Zimbabwe Republic Police (ZRP) spokesperson Commissioner Paul Nyathi confirmed the investigation:\n\nThe ZRP has taken note of a viral video in which a schoolgirl, dressed in school uniform, is seen smoking what appears to be dagga during a purported birthday celebration, with other students in the background singing a happy birthday song. Investigations are in progress.\n\nThe case has raised alarm over the growing availability of narcotics among school-aged children and the role of adults in facilitating access.\n\nPolice say investigations are ongoing, and further arrests may follow as they work to dismantle drug distribution networks targeting schools.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | 15 June 2025 Police detectives in Murewa have arrested two individuals accused of supplying dangerous drugs … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/high-school-learners-caught-smoking-mbanje/\">Continue reading<span class=\"screen-reader-text\"> \"High School Learners Caught Smoking Mbanje\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "From Bedroom to Briefing Room: Mnangagwa’s Secret Lover Hijacks National Security?",
            "url": "https://www.zimeye.net/2025/06/15/from-bedroom-to-briefing-room-mnangagwas-secret-lover-hijacks-national-security/",
            "content": "Leaked Audio of Mnangagwas Married Lover Exposes Sex-urity Takeover of State Intelligence Operations\n\nBy ZimEye Investigations Desk | 15 June 2025\n\nA sensational audio recording has surfaced online, revealing a disturbing blend of sexual intimacy and high-level intelligence directives involving President Emmerson Mnangagwa and his long-time lover, Rumbidzai Rusere  a married Deputy Director in Zimbabwes Central Intelligence Organisation (CIO). The leak has triggered widespread outrage and renewed calls for a formal investigation into the breakdown of executive authority and the politicisation of national security.\n\nIn the audio, Rusere can be heard giving explicit operational instructions while urging the President to act against CIO Director General Fulton Mangwanya. She accuses Mangwanya of obstructing a covert operation targeting whistleblower and former CIO officer Blessed Geza, along with citizen activist Gifford Gomwe  both linked to a military-endorsed petition to retire Mnangagwa, submitted on 21 May 2025.\n\nHi, um, so I know youre probably busy right now, but, uh, just wanted to let you know that Fulton is really being a problem. And, uh, can you please deal with him? Because no, the thing is hes trying to block issue yaGeza, uh, uh, that assignment that you gave me and its frustrating me. But otherwise, about our stuff, please let me know when youre free. And let it be soon, because I kind of miss you, and I miss it. Bye.\n\nThe voice note, reportedly authenticated by multiple CIO insiders, exposes a compromising overlap between the Presidents private relationships and the conduct of state intelligence operations. It reinforces long-standing concerns that critical institutions have been captured not by official command, but by proximity to Mnangagwas personal life.\n\nState Sex-urity: Is the Presidency Functioning?\n\nThis leak may represent the clearest proof yet of the erosion of presidential legitimacy  echoing warnings from senior war veterans in March that Zimbabwe has descended into a mafia-style regime where decision-making power lies outside official channels, often in the hands of romantic partners.\n\nSources within the CIO say Rusere has been running a parallel intelligence structure, reportedly funded by politically connected businessmen Kudakwashe Tagwirei and Wicknell Chivayo. Her influence allegedly extends beyond intelligence briefings into command-level decisions traditionally reserved for the CIO Director General.\n\nAccording to a viral expos by whistleblower @bambaninga:\n\nRusere leads unsanctioned operations funded by state-linked oligarchs.\n\nShe allegedly ordered the abduction of Gifford Gomwes elderly mother without DG Mangwanyas knowledge.\n\nShe owns multiple luxury properties abroad  in Dubai, Sandton, Randburg, and Singapore  financed through state looting and gifts from Mnangagwa.\n\nSenior CIO officers reportedly answer to her directly, bypassing the formal chain of command.\n\nState resources are being deployed to protect controversial businessmen like Delish Nguwaya and Chivayo.\n\nRusere has @edmnangagwa by the balls, one whistleblower wrote. She can recommend that Mangwanya be fired.\n\nPetition to Retire Mnangagwa in Jeopardy\n\nThe leaked audio appears to confirm that Rusere is spearheading efforts to derail the military-backed petition to retire Mnangagwa. Her top target is Blessed Geza, the former CIO operative who publicly accused military elites of betrayal. The voice note strongly implies that Rusere was directly tasked by the President to find and destroy Geza, with full access to the CIOs resources.\n\nMilitary insiders involved in the petition say they are horrified by the degree to which presidential affairs are now dictating national security strategy.\n\nThis is no longer a presidency, a senior military source told ZimEye. Its a brothel with guns.\n\nThe Rise of Bedroom Command: A Pattern Emerges\n\nThis is not the first time President Mnangagwas private liaisons have come under public scrutiny. However, the Rusere saga marks a sharp escalation  involving allegations of abductions, offshore asset laundering, and the subversion of official intelligence channels.\n\nRusere, who is married to Engineer Kanhukamwe, Vice Chancellor of the Harare Institute of Technology, has emerged as a de facto power broker not only within the CIO but also within the presidency itself.\n\nOur country has become Sodom and Gomorrah, wrote @bambaninga. It is now run on sex and debauchery.\n\nPublic Calls for Action\n\nIn response to the revelations, numerous civil society groups have demanded an urgent judicial inquiry into Ruseres influence, with several activists insisting the scandal meets the constitutional criteria for impeaching the President on grounds of gross misconduct and incapacity.\n\nZimEye has contacted the Office of the President, the CIO, and Director General Mangwanya for comment. None had responded at the time of publication.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Leaked Audio of Mnangagwa’s Married Lover Exposes ‘Sex-urity’ Takeover of State Intelligence Operations By ZimEye Investigations Desk | 15 June … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/from-bedroom-to-briefing-room-mnangagwas-secret-lover-hijacks-national-security/\">Continue reading<span class=\"screen-reader-text\"> \"From Bedroom to Briefing Room: Mnangagwa’s Secret Lover Hijacks National Security?\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "Zanu PF Wins Gutu East By-election Amid Intimidation Of Voters, Vote Buying",
            "url": "https://www.zimeye.net/2025/06/15/zanu-pf-wins-gutu-east-by-election-amid-intimidation-of-voters-vote-buying/",
            "content": "By A Correspondent\n\nZANU PF has secured a contested victory in the Gutu East Constituency by-election held on June 14, with its candidate Zvarevashe Masvingise declared the new Member of Parliament  despite widespread reports of voter intimidation and alleged vote buying.\n\nMasvingise emerged with a commanding lead, polling 9,321 votes, while independent candidate Gift Gonese trailed behind with 2,269 votes. Zivanai Nzvenga of the National Constitutional Assembly (NCA) managed only 173 votes, placing a distant third.\n\nThe official announcement was made on Saturday evening by Zimbabwe Electoral Commission (ZEC) constituency officer Ernest Mukwidzwa, who read the formal declaration at the district collation centre.\n\nDeclaration of Result of Poll  Constituency, Mukwidzwa stated.Being the constituency elections officer for Gutu East, I do hereby declare that I have, in accordance with the Electoral Act [Chapter 2:13], and the regulations made thereunder, ascertained the result of the poll for the said constituency and that there have been given to: Masvingise Zvarevashe of ZANU PF  9,321 votes; Gift Gonese, Independent  2,269 votes; and Nzvenga Zivanai of the NCA  173 votes.\n\nHe added that 194 ballot papers were rejected, with a voter turnout of 48.3%.\n\nI therefore declare the said Masvingise duly elected this day as Member of the National Assembly for Gutu East Constituency, Mukwidzwa concluded.\n\nHowever, the result has been overshadowed by mounting allegations from civil society organisations and local observers who claim the electoral process was marred by irregularities. Voters in several wards reportedly faced intimidation, while reports also surfaced of groceries and cash handouts being distributed by ZANU PF activists in the days leading up to the poll.\n\nAn observer affiliated with a local watchdog group, speaking on condition of anonymity, said:\n\nWhat we witnessed was not a free and fair election. People were threatened with food aid withdrawal if they didnt vote for ZANU PF, and some villagers said they received maize and cooking oil in exchange for their vote.\n\nGift Gonese, the independent candidate, has not yet issued a formal statement, but his campaign team described the atmosphere as hostile and heavily compromised.\n\nThe by-election was triggered by the recall of the previous ZANU PF MP, Benjamin Ganyiwa, and was seen as a crucial test of the ruling partys grip on rural constituencies following growing public discontent.\n\nThe Zimbabwe Electoral Commission has not responded to allegations of misconduct.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF has secured a contested victory in the Gutu East Constituency by-election held on June 14, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/zanu-pf-wins-gutu-east-by-election-amid-intimidation-of-voters-vote-buying/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Wins Gutu East By-election Amid Intimidation Of Voters, Vote Buying\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "ZiG Will Be Available Soon, RBZ Tells Nation Amid Deepening Economic Turmoil",
            "url": "https://www.zimeye.net/2025/06/15/zig-will-be-available-soon-rbz-tells-nation-amid-deepening-economic-turmoil/",
            "content": "By A Correspondent | 15 June 2025\n\nAs public frustration grows over the scarcity of Zimbabwe Gold (ZiG) cash, the Reserve Bank of Zimbabwe (RBZ) has assured the nation that measures are being implemented to ensure the widespread availability of the local currency across the country.\n\nIn a press statement issued on 13 June 2025, RBZ Governor Dr. John Mushayavanhu acknowledged the concerns raised by citizensespecially those outside Harareregarding limited access to ZiG in physical form.\n\nThe Reserve Bank has noted concerns coming from the transacting public relating to the availability of ZiG cash and its usage, particularly from areas outside Harare, said Dr. Mushayavanhu.\n\nAccording to the RBZ, the usage of ZiG in the economy has improved significantly over the past year. Local currency settlements on the National Payment System jumped from ZiG7.86 billion (26%) in April 2024 to ZiG56.8 billion (43%) by 30 May 2025.\n\nDr. Mushayavanhu emphasized that there is sufficient ZiG liquidity in the system to meet public demand.\n\nAs at 12 June 2025, the total ZiG deposits in the economy amounted to about ZiG16 billion, of which over ZiG207 million was cash held by banks, he noted. This meets optimal requirements and is sufficient to support daily deposits and withdrawals by the public.\n\nIn response to continued pressure over the absence of physical cash in many provinces, the RBZ revealed that it is working with financial institutions to increase the distribution of ZiG through banking halls and ATMs. Some banks have already started dispensing ZiG through ATMs, while others are said to be in the process of configuring their machines.\n\nThe Reserve Bank, in collaboration with banking institutions, has put in place measures to ensure the wider availability and distribution of ZiG cash, the Governor stated.\n\nDespite public skepticism, the RBZ insists that the currency and exchange rate stability currently being experienced will support the broader use of ZiG both electronically and physically.\n\nThe Reserve Bank also remains strongly committed to maintaining the prevailing price and currency stability to safeguard the current and future ZiG purchasing power at all costs, Dr. Mushayavanhu declared.\n\nHowever, the statement comes amid growing economic anxiety, with citizens and businesses alike expressing concern over the usability and reliability of the new currency. Long queues, limited ATM functionality, and continued dollarisation in informal markets have left many questioning the practicality of ZiG in everyday transactions.\n\nAs the government pushes for wider adoption of the currency, all eyes remain on the RBZs ability to translate these assurances into tangible improvements on the ground.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | 15 June 2025 As public frustration grows over the scarcity of Zimbabwe Gold (ZiG) cash, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/zig-will-be-available-soon-rbz-tells-nation-amid-deepening-economic-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"ZiG Will Be Available Soon, RBZ Tells Nation Amid Deepening Economic Turmoil\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "Dozen Secret Police Swarm Mzembi In Court Drama",
            "url": "https://www.zimeye.net/2025/06/15/dozen-secret-police-swarm-mzembi-in-court-drama/",
            "content": "By Crime and Courts Reporter Former Foreign Affairs MinisterWalter Mzembiwas swarmed by more thanten plain-clothed state security agentsas he appeared at the Harare Magistrates Court on Saturday, creating a dramatic scene that looked more like the escort of a dangerous fugitive than a former cabinet minister.\n\nDressed in civilian clothes but moving in coordinated formation, thesecret police surrounded Mzembifrom all sides, shielding him from the public and media as if he were a high-risk criminal.\n\nThe heavy security presence shocked onlookers and highlighted the high stakes surrounding Mzembis sensational return from self-imposed exile.\n\nMzembi appeared before magistrateDon Ndirowei, facing charges related tothree outstanding warrants of arrest.\n\nNdirowei remanded him in custody and postponed the case toMonday, while the tight-lipped security detail hustled Mzembi back into holding cells under watchful eyes.\n\nMzembi, a former G40 stalwart who fled Zimbabwe in the aftermath of the 2017 military coup that toppled Robert Mugabe, had returned to the country earlier this week under mysterious circumstances.\n\nHis quiet arrival and reports of private meetings withPresident Emmerson Mnangagwaat theBronte Hoteltriggered speculation of a potential political comebackor a negotiated immunity deal.\n\nBut his dramatic arrest by theZimbabwe Anti-Corruption Commission (ZACC)over the weekend has poured cold water on that narrative.\n\nSources say Mzembi was picked up early Saturday morning and handed over to ZACC investigators, who are now vetting his role in unresolved corruption cases dating back to his tenure in government.\n\nMzembis surprise return had already drawn sharp criticism from war veterans and opposition figures, who accused him of cutting secret deals in the shadows and betraying the victims of past political purges. His arrest has now raised fresh questions: Was he lured back under false pretenses? Or did a backroom deal go sour?\n\nObservers say theoverwhelming security detailescorting Mzembi to court was not just for protectionbut amessage.\n\nIt signals a high-level power play, possibly orchestrated from within the ruling elite itself, and underscores the volatility of Zimbabwes post-coup political landscape.\n\nMore developments are expected as Mzembis court case unfolds on Monday.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter– Former Foreign Affairs Minister Walter Mzembi was swarmed by more than ten plain-clothed state security agents as he appeared … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/dozen-secret-police-swarm-mzembi-in-court-drama/\">Continue reading<span class=\"screen-reader-text\"> \"Dozen Secret Police Swarm Mzembi In Court Drama\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        },
        {
            "title": "RBZ Panics As ZiG Shortage Worsens",
            "url": "https://www.zimeye.net/2025/06/15/rbz-panics-as-zig-shortage-worsens/",
            "content": "By Business Reporter The Reserve Bank of Zimbabwe (RBZ) has said they were putting measures to curb the shortage of Zimbabwe Gold (ZiG).\n\nThe current scarcity, particularly pronounced in areas outside Harare, has reignited concerns over Zimbabwes long-standing monetary instability, which dates back to the early 2000s.\n\nThe ongoing crisis is rooted in decades of poor economic governance, failed monetary reforms, and public distrust in the financial system.\n\nThese systemic issues have left the country trapped in a cycle of currency collapse, cash shortages, and inflationary pressures.\n\nSince 2000, Zimbabwe has undergone numerous currency changes, each accompanied by promises of stability that failed to materialize.\n\nFrom the infamous Zimbabwean dollaronce rendered worthless by hyperinflationto the US dollar era and the later RTGS dollar experiment, each phase has been plagued by inconsistent policy decisions, political interference in monetary affairs, and lack of confidence in the central bank.\n\nThe introduction of ZiG in April 2024 was the latest attempt to restore stability through a gold-backed currency.\n\nIn a statement issued yesterday, RBZ Governor John Mushayavanhusought to calm public anxiety, insisting that there is no shortage of ZiG in the market.\n\nHe said the usage of the local currency has improved significantly in the economy, citing figures that show the value of local currency settlements through the National Payment System jumped fromZiG7.86 billion(26%) in April toZiG56.8 billion(43%) by May 30, 2025.\n\nMushayavanhu explained that as of June 12, total ZiG deposits in the banking sector amounted toZiG16 billion, with overZiG207 millionheld as physical cash by commercial banks. This is sufficient to support daily deposits and withdrawals by the public, he claimed.\n\nHowever, on the ground, the story is different.\n\nLong queues at banks, limited cash at ATMs, and rising complaints from businesses and consumers alike paint a picture of a currency system once again failing to meet everyday needs.\n\nWhile the RBZ says some banks have begun disbursing ZiG through ATMs and others are in the process of reconfiguring their machines, distribution remains patchy and slow.\n\nTo address the crisis, the central bank says it is working closely with financial institutions to scale up the availability of ZiG in both physical and electronic forms.\n\nThe government also believes that current macroeconomic stability and a firm exchange rate will eventually improve public confidence in the currency.\n\nBut critics argue that until deeper structural issues are addressedsuch as rampant corruption, poor fiscal discipline, and opaque policy-makingnew currencies will continue to suffer the same fate.\n\nMany Zimbabweans remain sceptical of the ZiGs long-term viability, viewing it as just another rebranding exercise masking deeper economic rot.\n\nDespite official reassurances, the current cash shortages serve as a sobering reminder that without genuine economic reforms, Zimbabwes monetary challenges are far from over.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – The Reserve Bank of Zimbabwe (RBZ) has said they were putting measures to curb the shortage of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/15/rbz-panics-as-zig-shortage-worsens/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Panics As ZiG Shortage Worsens\"</span></a></p>",
            "time": "06:39",
            "date": "16 Jun 2025"
        }
    ]
}