{
    "news": [
        {
            "title": "Ramaphosa Hosts Working  Dinner",
            "url": "https://www.zimeye.net/2025/07/26/ramaphosa-hosts-working-dinner/",
            "content": "South African President Cyril Ramaphosa is hosting a working dinner in honour of the Heads of State and Government from the Southern African Development Community (SADC) and the Saharawi Republic at Mahlamba Ndlopfu, the Presidents official residence in Pretoria.\n\nRamaphosa is meeting with President Nutembo Nandi-Ndaitwah of the Republic of Namibia; President Emmerson Mnangagwa of the Republic of Zimbabwe; Former President Joaquim Chissano of the Republic of Mozambique; Former Prime Minister Mizengo Pinda of the United Republic of Tanzania; and Minister of the Saharawi Republic, Mohamed Yeslem Beisat.\n\nThe working dinner will cover issues of regional trade cooperation and the strengthening of bilateral relations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South African President Cyril Ramaphosa is hosting a working dinner in honour of the Heads of State and Government from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/ramaphosa-hosts-working-dinner/\">Continue reading<span class=\"screen-reader-text\"> \"Ramaphosa Hosts Working  Dinner\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Gwanda Farmer Buys Bull for US$40,000",
            "url": "https://www.zimeye.net/2025/07/26/gwanda-farmer-buys-bull-for-us40000/",
            "content": "By a Correspondent A Gwanda-based cattle breeder, Lingani Masuku, has made headlines after purchasing a prized Brahman bull for US$40,000 at a high-profile cattle auction held in Mt Hampden on Friday.\n\nMasuku,  emerged victorious in a competitive bidding war that drew hundreds of cattle farmers from across the country.\n\nThe bull, described by breeders as possessing exceptional genetics and structural correctness, is expected to boost Masukus breeding programme significantly.\n\nThis purchase comes after another Zimbabwean farmer, Collen Tafireyi of Sinyo Boran Stud, recently bought a Boran bull namedCyclonefor a staggering R6.4 million (approximately US$355,000), setting a new African record for the most expensive bull.Cyclonewas bred by South African brothers Jarren and Simeon Hurwitz of Hurwitz Farming and sold during their 10th Production Auction in Davel, Mpumalanga.\n\nCycloneis a son of the legendary Picasso GF 10-23who was killed by lightning in 2022and Cremora, a cow known for producing top-tier herd sires. Last year, Tafireyi paid R98,000 per straw for Picassos semen, underlining his commitment to acquiring elite genetics.\n\nAccording toFarmers Weekly, Boran cattle are prized for their hardiness, fertility, and premium beef quality, making them highly sought after for both commercial and stud operations.\n\nJarren Hurwitz explained thatCyclonesrecord-breaking price is rare and speaks to the bulls superior pedigree and physical attributes. From a structural and genetic standpoint,Cycloneis exceptional. When those traits align, you get unprecedented demand, he said.\n\nSinyo Boran Stud celebrated the purchase, calling it a game-changer for Zimbabwes livestock industry. We are humbled and incredibly excited. This is a testament to our mission to become Africas leading Boran stud, read their social media post.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent – A Gwanda-based cattle breeder, Lingani Masuku, has made headlines after purchasing a prized Brahman bull for US$40,000 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/gwanda-farmer-buys-bull-for-us40000/\">Continue reading<span class=\"screen-reader-text\"> \"Gwanda Farmer Buys Bull for US$40,000\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Mnangagwa Arrives in SA",
            "url": "https://www.zimeye.net/2025/07/26/mnangagwa-arrives-in-sa/",
            "content": "President Emmerson Dambudzo Mnangagwa has arrived in SA, and he was received at the airport by a junior politician, South African deputy minister of International Relations and Cooperation Reginah Mhaule and Zimbabwe Ambassador to South Africa Amb. David Hamadziripi.\n\nMnangagwa as the current SADC Chair, is attending the SADC Solidarity Conference with the Saharawi Arab Democratic Republic (SADR)/Western Sahara. At this juncture the former late Zambian President Edgar Chagwa Lungu burial is in limbo following his burial impasse that has led to the delayed burial . The issue of Lungu documentation and property in South Africa has raised eyebrows and so many unanswered questions about African leaders secrets.On his Facebook page. Mnangagwa wrote:I have arrived at Waterkloof Air Base in Pretoria, South Africa. I was warmly received by ANC National Executive Member Cde Bejani Chauke and Zimbabwes Ambassador to South Africa, Amb. David Hamadziripi. I look forward to continued engagement in strengthening our bilateral ties.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "President Emmerson Dambudzo Mnangagwa has arrived in SA, and he was received at the airport by a junior politician, South … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/mnangagwa-arrives-in-sa/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Arrives in SA\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Harare Elite Junior Football League Board Member Finance O. Mutambudzi Donates Soccer Kit To NC Sports Academy",
            "url": "https://www.zimeye.net/2025/07/26/harare-elite-junior-football-league-board-member-mutambudzi-donates-soccer-kit-to-nc-sports-academy/",
            "content": "Sports Correspondent\n\nIn a bid to promote grassroots football development, Harare Elite Junior Football Development League board member ( finance) and 2 M Academy director, Mr. Office Mutambudzi, donated a brand-new soccer kit to the Under-12 team of NC Sports Academy on Saturday.\n\nThe donation, which took place as part of the leagues ongoing youth empowerment initiatives, underscores Mutambudzis commitment to nurturing young talent and supporting emerging football academies across Harare.\n\nSpeaking at the handover ceremony, Mr. Mutambudzi said, This is not just a kit  its a symbol of encouragement. We want these young players to dream big and believe in their potential. Football has the power to change lives.\n\nNC Sports Academy officials welcomed the gesture, hailing it as timely and inspiring. This kind of support gives our boys the motivation to keep training hard and believing in themselves, said one of the coaches.\n\nThe Harare Elite Junior Football Development League has become a vital platform for young footballers, providing regular competition, exposure, and mentorship under the leadership of passionate figures like Mutambudzi.\n\nSaturdays donation adds to a growing list of initiatives by the league and 2 M Academy to support junior football structures and uplift communities through sport.\n\nMilestone donation\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a bid to promote grassroots football development, Harare Elite Junior Football Development League board member ( finance) … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/harare-elite-junior-football-league-board-member-mutambudzi-donates-soccer-kit-to-nc-sports-academy/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Elite Junior Football League Board Member Finance O. Mutambudzi Donates Soccer Kit To NC Sports Academy\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Real Sociedad, Leicester City Triumph in Club Friendlies…",
            "url": "https://www.zimeye.net/2025/07/26/real-sociedad-leicester-city-triumph-in-club-friendlies/",
            "content": "Sports Correspondent\n\nEuropean clubs were in action over the weekend as pre-season preparations continued, with Real Sociedad and Leicester City among the teams that registered wins in a series of club friendlies.\n\nLeicester City picked up a 2-1 victory over Ukrainian side Karpaty, showcasing promising form ahead of the new season. However, the Foxes also faced a tough test against Bundesliga club FC Cologne, where they suffered a 3-1 defeat.\n\nIn Japan, La Liga side Real Sociedad secured a 2-1 win over Yokohama FC, continuing their build-up with a confident performance on Asian soil.\n\nGreek giants Olympiacos impressed with a commanding 3-0 win over Norwich City, while Paris FC stunned Ligue 2 rivals St. Etienne with a 3-0 triumph. Mainz 05 delivered the biggest win of the day, thrashing Seekirchen 5-0.\n\nGerman teams saw mixed fortunesFreiburg played out a 3-3 thriller with Dynamo Dresden, Hannover 96 cruised past Hansa Rostock 3-0, and RW Essen claimed a 2-1 win over Augsburg.\n\nElsewhere, Blackburn Rovers edged Elche 1-0, while Danish side Randers FC defeated AGF 2-1 in Superliga action.\n\nWith the new season fast approaching, these friendlies offered coaches a final chance to assess their squads and test tactical setups before competitive fixtures begin in August.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent… European clubs were in action over the weekend as pre-season preparations continued, with Real Sociedad and Leicester City … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/real-sociedad-leicester-city-triumph-in-club-friendlies/\">Continue reading<span class=\"screen-reader-text\"> \"Real Sociedad, Leicester City Triumph in Club Friendlies…\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Sinking ANC Hosts Discredited Former Liberation Movements, Including Notorious Zanu PF",
            "url": "https://www.zimeye.net/2025/07/26/sinking-anc-hosts-discredited-former-liberation-movements-including-notorious-zanu-pf/",
            "content": "JOHANNESBURG  South Africas embattled ruling party, the African National Congress (ANC), is this weekend hosting a high-level gathering of former liberation movements from the region,  most of  which are grappling with legitimacy crises, declining popular support, and accusations of authoritarianism, corruption, and repression.\n\nThe event, which begins Sartuday, brings together leaders from Angolas MPLA, Mozambiques FRELIMO, Namibias SWAPO, Tanzanias Chama Cha Mapinduzi (CCM), and Zimbabwes notorious Zanu PF. The meeting is convened under the theme:Defending the Liberation Gains, Advancing Integrated Socio-Economic Development, Strengthening Solidarity for a Better Africa.\n\nWhile cloaked in the language of unity and pan-African development, the gathering comes at a time when these liberation-era parties face mounting public disillusionment. The ANC itself suffered a historic setback in the 2024 general elections, losing its parliamentary majority for the first time since the end of apartheid, a dramatic fall from grace driven by corruption scandals, economic mismanagement, and deteriorating public services.\n\nZanu PF,  one of the ANCs closest allies,  continues to be one of the most discredited parties in the region. Despite presiding over a country plagued by economic collapse, rampant inflation, and mass emigration, the party has retained power through repeated allegations of electoral fraud, systematic intimidation of the opposition, and gross human rights abuses. The August 2023 general elections were widely condemned as flawed by international observers, with the opposition Citizens Coalition for Change (CCC) calling the process a democratic sham.\n\nNamibias SWAPO and Angolas MPLA have similarly faced waning public trust, especially among the youth, who increasingly view these parties as relics of the past more interested in preserving elite privileges than advancing genuine development.\n\nANC NEC member Nomvula Mokonyane framed the event as a moment of renewal and relevance:\n\nThis is a good reawakening. People have been wishing us well Theres an appetite to engage and contribute. Those who are angry are saying: why did it take us so long?\n\nHowever, critics argue that rather than reflecting a vision for a better Africa, the gathering exposes a deepening crisis within these former liberation parties  a political class unwilling to let go of power or acknowledge their failures.\n\nAs Southern Africa confronts rising inequality, democratic backsliding, and youth unrest, the nostalgic rhetoric of liberation gains may no longer be enough to secure legitimacy for parties long out of touch with the people they once claimed to liberate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "JOHANNESBURG – South Africa’s embattled ruling party, the African National Congress (ANC), is this weekend hosting a high-level gathering of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/sinking-anc-hosts-discredited-former-liberation-movements-including-notorious-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Sinking ANC Hosts Discredited Former Liberation Movements, Including Notorious Zanu PF\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Driver Sentenced for Causing Death of Pedestrian",
            "url": "https://www.zimeye.net/2025/07/26/driver-sentenced-for-causing-death-of-pedestrian/",
            "content": "By A Correspondent..\n\nA 36-year-old Harare man, Munyaradzi Luke Chirombe, has been convicted of culpable homicide by the Hwange Magistrates Court following a fatal road accident that claimed the life of a pedestrian along the BulawayoVictoria Falls Road.\n\nThe tragic incident occurred on January 13, 2025, at the 281-kilometre peg. Chirombe, who was driving a Toyota Townace, lost control of the vehicle, veered off the road, and fatally struck Tobias Dube, who had been walking on the far-right side of the road. Dube died upon admission to Mpilo Hospital in Bulawayo.\n\nThe court outlined the following particulars of negligence:\n\nAs a result, Chirombe was sentenced to pay a fine of USD500 or face six months imprisonment if he fails to pay.\n\nIn response to the conviction, the National Prosecuting Authority of Zimbabwe (NPAZ) issued a stern reminder to all motorists about the importance of road safety.\n\nNegligent driving endangers lives, the NPAZ said in a statement. We urge all road users to exercise caution and care at all times. Drive to arrive. One careless moment can cost a life.\n\nThe case underscores the ongoing need for vigilance and responsibility on Zimbabwes roads, where the cost of negligence can be deadly.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent.. A 36-year-old Harare man, Munyaradzi Luke Chirombe, has been convicted of culpable homicide by the Hwange Magistrates’ … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/driver-sentenced-for-causing-death-of-pedestrian/\">Continue reading<span class=\"screen-reader-text\"> \"Driver Sentenced for Causing Death of Pedestrian\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "SA Police Boss Drops Bombshell: Zanu PF Is An International Criminal Organization…",
            "url": "https://www.zimeye.net/2025/07/26/sa-police-boss-drops-bombshell-zanu-pf-is-an-international-criminal-organization/",
            "content": "By A Correspondent\n\nSouth African police boss General Nhlanhla Lucky Mkhwanazi has made explosive claims in an official report submitted to the President of South Africa, accusing Zimbabwes ruling party, Zanu PF, of operating as an international criminal organization.\n\nGeneral Mkhwanazi, who serves as the Provincial Police Commissioner for KwaZulu-Natal, stated in the report that high-ranking members of Zanu PFincluding individuals said to be from the office of President Emmerson Mnangagwaare working with senior officials in South Africas ruling party, the ANC, to engage in a web of illicit cross-border activities.\n\nZanu PF has lost its status as a liberation movement. It is now an international criminal organization, Mkhwanazi wrote.\n\nAccording to the report, these activities include illegal transportation of money, minerals, and goods into South Africa, which are then exported to countries where Zanu PF officials are under international sanctions. In exchange, the report claims, Zimbabwe is supplying South Africa with untraceable, military-trained gunmen, allegedly involved in political violence, including the ongoing ANC factional killings in KwaZulu-Natal.\n\nWe have concrete evidence that some of the individuals involved in violent political crimes in this province are not just South Africans, Mkhwanazi noted. They are trained members of the Zimbabwe National Army.\n\nThe police boss also detailed a large-scale money laundering operation, stating that dirty money from South Africa is being cleaned through Zimbabwe using channels connected to President Mnangagwas close allies.\n\nZimbabwe is now a laundering zone, Mkhwanazi said.\n\nThis operation involves known associates of the Zimbabwean Presidentnames like Wicknell Chivayo and Kudakwashe Tagwirei appear in the intelligence documents we have.\n\nMkhwanazi recommended that the South African President raise the matter during the upcoming liberation movements summit, urging direct dialogue with President Mnangagwa.\n\nIt is now extremely difficult for us to contain crime here in South Africa because we are dealing with military-trained professionals who are being deployed into our already fragile criminal environment, he said. This must be addressed at the highest level.\n\nHe concluded by stating that Zanu PF has mutated into a profit-driven syndicate, no longer driven by any liberation mandate but rather by the personal enrichment of top officials in both Zanu PF and the ANC.\n\nThe revelations are expected to ignite intense debate within the region, particularly as both South Africa and Zimbabwe face increasing scrutiny over governance, corruption, and political violence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent South African police boss General Nhlanhla Lucky Mkhwanazi has made explosive claims in an official report submitted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/sa-police-boss-drops-bombshell-zanu-pf-is-an-international-criminal-organization/\">Continue reading<span class=\"screen-reader-text\"> \"SA Police Boss Drops Bombshell: Zanu PF Is An International Criminal Organization…\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Corruption on Display: Mnangagwa Celebrates Dirty Money at State House",
            "url": "https://www.zimeye.net/2025/07/26/corruption-on-display-mnangagwa-celebrates-dirty-money-at-state-house/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa continues to court controversy after openly embracing key figures associated with alleged corruption, even as political tensions mount across Zimbabwe.\n\nOn Friday evening at State House, Mnangagwa officiated a fundraising auction where a signed footballused earlier in the day during the Putt-Out Golf Challenge at Royal Harare Golf Clubwas bought for a staggering US$40,000 by Scottland FC. The football had been signed by the President himself during the event.\n\nScottland FC is owned by businessman and Zanu PF affiliate Scott Sakupwanya, a figure often linked to controversial gold dealings and corruption allegations. Sakupwanya was joined at the golf event by Kuda Tagwirei, another powerful and polarizing business figure who is under international sanctions for alleged looting of public resources.\n\nMnangagwas close association with both men was on full display.\n\nKuda is a son of the soil. Scott is a young man with energy and loyalty, a Mnangagwa loyalist said. We must support our own who are doing great things for the country.\n\nCritics, however, view the event as symbolic of how the President continues to reward those accused of siphoning national wealth, despite growing public anger over economic hardship and elite corruption.\n\nBoth Tagwirei and Sakupwanya have been repeatedly accused of exploiting Zimbabwes natural resources and state institutions for personal gain. Their involvement in state-sanctioned dealsespecially in the gold and fuel sectorshas attracted sharp scrutiny.\n\nObservers say Mnangagwas decision to highlight and publicly praise such individuals under the guise of charity and sport signals his disregard for mounting pressure on government to tackle elite corruption.\n\nThis wasnt about football or golf, said one political analyst who requested anonymity. It was a power showan endorsement of the very people many Zimbabweans believe are bleeding the nation dry.\n\nDespite the optics, Mnangagwa appeared unfazed, beaming as he posed for photographs with the ball and its new owners.\n\nAs tensions continue to rise over political repression, economic decay, and rising inequality, the Presidents embrace of figures like Sakupwanya and Tagwirei adds fuel to an already simmering public discontent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa continues to court controversy after openly embracing key figures associated with alleged corruption, even … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/corruption-on-display-mnangagwa-celebrates-dirty-money-at-state-house/\">Continue reading<span class=\"screen-reader-text\"> \"Corruption on Display: Mnangagwa Celebrates Dirty Money at State House\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        },
        {
            "title": "Mliswa Set For Vice Presidency Of African Parliament Investigatory Arm",
            "url": "https://www.zimeye.net/2025/07/26/mliswa-set-for-vice-presidency-of-african-parliament-investigatory-arm/",
            "content": "By A Correspondent | ZimEye | In a huge leap for Zimbabwe, the former Norton MP Temba Mliswa is set to be elected the Vice President of the African Parliament Network Against Corruption (APNAC).\n\nZimEye reveals members gathered in Benin on Saturday have resolved to vote for Mliswa.\n\nMliswa has been an advocate of many anti corruption causes and he chaired the most vibrant portfolio for mines during his years as MP.\n\nFull updates coming on ZimEye.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | In huge leap for Zimbabwe, the former Norton MP Temba Mliswa is set to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/26/mliswa-set-for-vice-presidency-of-african-parliament-investigatory-arm/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Set For Vice Presidency Of African Parliament Investigatory Arm\"</span></a></p>",
            "time": "09:10",
            "date": "27 Jul 2025"
        }
    ]
}