{
    "news": [
        {
            "title": "Bombshell Hits ED Hard In Mashonaland West",
            "url": "https://www.zimeye.net/2025/06/25/bombshell-hits-ed-hard-in-mashonaland-west/",
            "content": "By A Correspondent The recent expulsion of war veteran and outspoken former Zanu PF official Blessed Geza has dealt a heavy blow to the ruling partys support base in Mashonaland West, with internal restructuring exercises revealing growing discontent and dwindling grassroots participation.\n\nZanu PF iscurrentlyconducting a cell verification exercise in Makonde, Hurungwe, and Sanyati districts to prepare for the co-option of new central committee members.\n\nHowever, the process has been marred by poor attendance, internal divisions, and unresolved tensions dating back to the 2023 general elections.\n\nIn Sanyati, the expulsion of Gezawho openly called for the removal of President Emmerson Mnangagwahas left a vacuum and stirred divisions.\n\nGeza, a respected war veteran, gained notoriety for criticizing Mnangagwas leadership, accusing him of betraying the values of the liberation struggle and presiding over a corrupt, authoritarian regime.\n\nHis bold stance, which resonated with sections of disgruntled war veterans and party loyalists, ultimately cost him his position in the party.\n\nThe leadership contest to replace Geza has drawn figures such as Mines Deputy Minister Polite Kambamura, businessman Jimaya Muduvuri, and Kudakwashe Nduya.\n\nHowever, insiders say the infighting and lack of cohesion have severely disrupted the partys organizational momentum in the area.\n\nIn Hurungwe, another power struggle is unfolding between Reuben Marumahoko and Ability Gandawa, both vying to replace the imprisoned former Deputy Finance Minister Terrence Mukupe.\n\nIn Makonde, Phineas Makumbe, Tommy Mwanza, Simba Ziyambi, and Locadia Gwatiare competingto succeed Kindness Paradza, now a commissioner at the Zimbabwe Anti-Corruption Commission.\n\nMeanwhile, there will be no co-option in Chinhoyi to replace controversial businessman Mike Chimombe, who remains in remand prison facing fraud-related charges.\n\nSources within the party said the cell verification process is progressing at a snails pace.\n\nSome areas, such as Bumi Hills, reportedly recorded zero attendance, while others, including Cheuchi in Mhangura, attracted as few as eight people.\n\nWard 4 in Chinhoyi had the highest turnout with 550 people.\n\nIn a letter seen byNewsDay, provincial chairperson Mary Mliswa-Chikoka acknowledged the challenges facing the process. We noted low attendance, which indicateseitherpoor communication or poor planning.\n\nIn both cases, the work will be redone to ensure no one is left out, she wrote. Some absences were due to unresolved issues with sitting MPs. This is unfortunate, but this process is about the party and its structures; therefore, it must proceed.\n\nMliswa-Chikoka also reprimanded officials inChegutudistrict, accusing them of undermining the verification exercise. Worse still, some attempted to incite disunity and rebellion against this vital exercise. Let this be a clear warning to the Chegutu administrative leadership that thisbehaviouris unacceptable and will not be tolerated at all, she said.\n\nMashonaland West was once a stronghold of Zanu PF during the late former President Robert Mugabes reign.\n\nHowever, since the 2017 coup that ousted Mugabe and installed Mnangagwa, internal fractures have widened, and support in the province has weakened, now made more apparent by the fallout from Gezas ouster and the turmoil gripping the partys grassroots.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The recent expulsion of war veteran and outspoken former Zanu PF official Blessed Geza has dealt a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/bombshell-hits-ed-hard-in-mashonaland-west/\">Continue reading<span class=\"screen-reader-text\"> \"Bombshell Hits ED Hard In Mashonaland West\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Lawyers Expose Pardon Gambakwe in Legal Double-Play Plot Over Nyokayemabhunu Arrest",
            "url": "https://www.zimeye.net/2025/06/25/lawyers-expose-pardon-gambakwe-in-legal-double-play-plot-over-nyokayemabhunu-arrest/",
            "content": "By Investigations Correspondent | Johannesburg, 25 June 2025  A legal bombshell has erupted in the Masiwa Wellington (alias Nyokayemabhunu) case, as Malalhela & Co. Attorneys, the firm representing him, has released a series of damning statements exposing YouTuber and Uebert Angel associate Pardon Gambakwe for playing a deeply conflicted and potentially unlawful role in the ongoing saga.\n\nIn a series of formal legal letters dated between May and June 2025, the firm reveals that:\n\nThe attorneys confirm that Mr. Pardon Gambakwe personally approached and instructed them to take on the case of Wellington Masiwajust days after he had, on 20 March 2025, publicly made statements falsely alleging Masiwas ties to military activities and misrepresented his finances. These public statements, made on Gambakwes platforms, contributed to a cascade of events culminating in Masiwas detention on 13 April.\n\nThe implication is severe: the same individual who triggered public suspicion and media framing of Masiwa was secretly directing his legal defense, thereby breaching ethical boundaries and contaminating the legal process.\n\nMalalhela & Co.s letter further admits that Gambakwe has ensured that the lawyers are safe, attending court, and present. Legal observers are questioning how a civilian, who claims to be a journalist and YouTuber, is providing security for lawyers in a high-profile case unless he is involved in some form of state-linked or intelligence function.\n\nThis revelation has sparked fears that Gambakwe may be operating as a double agentpublicly claiming to support justice and human rights while operating behind the scenes in state security or political interests aligned with Uebert Angel and the Zimbabwean regime.\n\nAlready Gambakwe has played multiple roles including a dodgy housing scheme that left many homelesshttps://www.facebook.com/share/1AY4Xtwaxy/?mibextid=wwXIfr\n\nThe attorneys confirm they received R20,175 from Mr. Gambakwe, but note that they have no reconciliation or control over how much in total he collected from the public. All other funds Gambakwe may have solicited are not registered through the trust account and remain undocumented.\n\nThis lack of transparency has led to suspicions of possible fund misappropriation and fraud, as the law firm strictly reiterated: Do not pay funds to any individual or unauthorized collector.\n\nThe firm raised alarm over other individuals not mandated by them soliciting public funds under the pretense of helping Masiwa. Only two verified payments were receivedone from Gambakwe and the other from an associate, Godwin Zivavose, who introduced Advocate Cheryl Sjberg.\n\nThe rest of the funds, if collected, have not been declared, tracked, or deposited into the law firms official account.\n\nThe final shocking development is that Zimbabwean lawyer Chrispen Machingura, who initially stepped forward to assist Masiwa, was later pushed out of the case. The law firm confirms Machingura is no longer part of the legal team and is not authorized to act further.\n\nLegal sources suspect Gambakwes influence was instrumental in sidelining Machingura, a known independent actor, in favor of a more pliable legal framework tied to South African networks and intelligence-linked figures. This aligns with a broader effort to control the Masiwa case narrative and legal trajectory.\n\nCase Now Under Cloud of Compromised Integrity\n\nThe public is now being warned to stop sending funds to any individual other than the law firms trust account. The revelations raise critical questions about infiltration, manipulation, and fund misappropriation in the name of activism and justice.\n\nMasiwa Wellington, the man at the center of this controversy, remains under legal pressurewhile the YouTuber who once framed him appears entangled in both his prosecution and defense.\n\nGambakwe was contacted for comment.\n\nEarlier in May 2025, Gambakwe admitted that he potentially misrepresented the incarcerated activist, and during a phonecall with ZimEye that was broadcast, he admitted and saying he would look into rectifying over statements he uttered on 20 March that directly implicate Wellington Masiwa on many things including an urgent plea for political financing due to coffers that were dwindling.\n\nBut later on 29 May, Gambakwe issued a contrary statement this time saying, he refuses to address his statements. He said he did not at all plant words into Masiwas mouth. He added saying this is because according to him, Masiwa already R1million in his bank account. (Click to read and listen to him speaking \n\nPardon Gambakwe says: I didnt plant words into Nyokas mouth or do money laundering, because Nyoka already had R1 Million in his account on 20 March. https://www.zimeye.net/2025/05/29/pardon-gambakwe-says-i-didnt-plant-words-into-nyokas-mouth-or-do-money-laundering-because-nyoka-already-had-r1-million-in-his-account-on-20-march/. )\n\nThe development comes at a time many in the civil society accused him as a ChiGananda, a corrupt person, bent on chopping other peoples money and lives.\n\nActivism against the government inenge iribusiness inokuwanisayi mari isu tichifunga kuti murikurwira ruzhinji with utmost good faith, said X user @ChazingwaThree.\n\nMudzingwa announces totoputitsa mari! to chop Nyokayemabhunus money while he languishes in prison.In these leaked audios, the jailed South Africa based ZANU PF activist Wellington Masiwa (popularly known as Nyokayemabhunu), is discussed by a group comprising his colleagues.pic.twitter.com/sbM98cc8jY\n\nA previous housing scheme Gambakwe ran in 2023, left many people homeless and demanding their refunds alleging they were scammed by him (watch videohttps://www.facebook.com/share/1AY4Xtwaxy/?mibextid=wwXIfr. )\n\nHuman rights monitors have called for a full inquiry into Gambakwes role, the alleged intelligence connections, and the integrity of the legal proceedings.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigations Correspondent | Johannesburg, 25 June 2025 — A legal bombshell has erupted in the Masiwa Wellington (alias Nyokayemabhunu) … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/lawyers-expose-pardon-gambakwe-in-legal-double-play-plot-over-nyokayemabhunu-arrest/\">Continue reading<span class=\"screen-reader-text\"> \"Lawyers Expose Pardon Gambakwe in Legal Double-Play Plot Over Nyokayemabhunu Arrest\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Ministers Caught Secretly Padding Cellphones In Parliament",
            "url": "https://www.zimeye.net/2025/06/25/ministers-caught-secretly-padding-cellphones-in-parliament/",
            "content": "Ministers caught on camera secretly tabbing cellphones during@ParliamentofZim|  is this normal@Jamwanda2@nickmangwana?https://t.co/fPKn6jTzaopic.twitter.com/T7vJpQl3bs\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "FC Platinum Maintain Unbeaten Run as PSL Season Reaches Midway Point",
            "url": "https://www.zimeye.net/2025/06/25/fc-platinum-maintain-unbeaten-run-as-psl-season-reaches-midway-point/",
            "content": "By Sports Correspondent\n\nFC Platinum have emerged as the only team to preserve their unbeaten record in the first half of the 2025 Castle Lager Premier Soccer League (PSL) season, as the campaign now heads into its crucial second phase.\n\nThe Zvishavane-based giants have demonstrated consistency and resilience, navigating a competitive opening half where traditional powerhouses have faltered. In a season marked by surprise results and fluctuating form, FC Platinum have quietly established themselves as title contenders with an impressive run that includes a string of hard-fought draws and key victories.\n\nIn contrast, league debutants MWOSwho had gone toe-to-toe with the leagues bestsaw their unbeaten streak come to a halt on the final matchday of the first round. That defeat also cost them top spot, which was swiftly reclaimed by defending champions Simba Bhora.\n\nSimba Bhora ended the first half at the summit, edging MWOS by a single point and underlining their credentials to defend their title. Yet its FC Platinums unbeaten status that has caught the attention of fans and pundits alike, especially given the disappointing performances by some of the leagues traditional giants, who now find themselves in the bottom half of the table.\n\nFC Platinums consistency is a testament to their squad depth and discipline, said one PSL analyst. In a season where big clubs have failed to live up to expectations, theyve quietly done the basics right.\n\nFootball stakeholders believe the first half of the season has captured the true essence of the gameunpredictable, competitive, and full of drama.\n\nAs the second half of the campaign begins, all eyes will be on whether FC Platinum can maintain their momentum, and whether the faltering giants can rediscover form in time to mount a serious challenge.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent FC Platinum have emerged as the only team to preserve their unbeaten record in the first half … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/fc-platinum-maintain-unbeaten-run-as-psl-season-reaches-midway-point/\">Continue reading<span class=\"screen-reader-text\"> \"FC Platinum Maintain Unbeaten Run as PSL Season Reaches Midway Point\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "ECL might be buried in August",
            "url": "https://www.zimeye.net/2025/06/25/ecl-might-be-buried-in-august/",
            "content": "LUNGUS BODY WONT BE BURIED UNTIL AUGUST\n\nThe Pretoria High Court has ruled that it will hear a motion in August 2025 regarding the repatriation of former President Edgar Lungus body to Zambia.\n\nZambias Attorney General, Mulilo Kabesha had filed an application to halt the burial of Mr. Lungu, citing public interest and legal precedence.\n\nThe burial was stopped as mourners had begun gathering at the Cathedral of Christ the King in South Africa today Wednesday June 25,2025.\n\nIn an order reached by mutual agreement between the Lungu family and the State, Judge Ledwaba of the Pretoria High Court directed that the family should not proceed with the funeral and burial of the former President until the matter is resolved.\n\nThe court further ordered the State to file an amended notice of motion and supplementary founding affidavit seeking the repatriation of Mr. Lungus body on or before July 4, 2025.\n\nThe Lungu family has also been directed to file their heads of argument and list of authorities by July 24, 2025. The court will then hear the matter on August 4, 2025.\n\nAdditionally, the court has allowed the Lungu family, and other designated individuals, to visit and inspect the body of the late President.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "LUNGU’S BODY WON’T BE BURIED UNTIL AUGUST The Pretoria High Court has ruled that it will hear a motion in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/ecl-might-be-buried-in-august/\">Continue reading<span class=\"screen-reader-text\"> \"ECL might be buried in August\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Real Madrid’s Raul Asencio Apologizes After Difficult Club World Cup Start",
            "url": "https://www.zimeye.net/2025/06/25/real-madrids-raul-asencio-apologizes-after-difficult-club-world-cup-start/",
            "content": "Sports Correspondent\n\nReal Madrid defender Raul Asencio has issued a heartfelt apology following a turbulent start to his FIFA Club World Cup campaign, which saw him concede a penalty in the opening match against Al-Hilal and pick up a red card in the 3-1 victory over Pachuca.\n\nThe 22-year-old, a product of Madrids academy, took to social media to address the criticism and own up to his early struggles.\n\nIts not being the start of the competition I wanted but I have no doubt Ill turn it around, Asencio wrote. Ill work harder and learn from this.\n\nHis red card means he will sit out Real Madrids upcoming clash against RB Salzburg, further complicating head coach Xabi Alonsos defensive setup. With Dean Huijsen expected to start, questions remain over who will partner Antonio Rudiger, who is still regaining full fitness.\n\nDespite the setback, Asencio has received support from within the squad. Midfielder Federico Valverde came to his defense, praising the young defenders previous performances and resilience.\n\nWhile Eder Militaos return and Huijsens recent form may limit Asencios minutes moving forward, the young centre-back is determined to fight for a place in the knockout stages.\n\nHis path to redemption may be steep, but Asencio appears committed to proving his worth under Alonso in what remains of the competition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Real Madrid defender Raul Asencio has issued a heartfelt apology following a turbulent start to his FIFA Club … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/real-madrids-raul-asencio-apologizes-after-difficult-club-world-cup-start/\">Continue reading<span class=\"screen-reader-text\"> \"Real Madrid’s Raul Asencio Apologizes After Difficult Club World Cup Start\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "What Is Heartwater ?",
            "url": "https://www.zimeye.net/2025/06/25/what-is-heartwater/",
            "content": "By Dr Trywell Muzerengi\n\nHeartwater, also known as Cowdriosis, is a deadly tick-borne disease caused by the bacteria-like organism Ehrlichia ruminatum. It poses a serious threat to livestock farming, especially in tropical and subtropical regions. The disease is primarily spread by Amblyomma ticks, making tick control essential in managing outbreaks.\n\nHeartwater is caused by Ehrlichia ruminatum, a microbe transmitted through the bites of infected Amblyomma ticks.\n\nHeartwater leads to:\n\nSudden death of valuable livestock\n\nReduced productivity (milk and meat)\n\nHigh treatment and prevention costs\n\nLoss of young, future breeding stock\n\nInfection occurs when ticks bite and transfer the organism from infected to healthy animals.\n\nNot contagious between animalsonly tick-borne.\n\nCattle\n\nGoats\n\nSheep\n\nOccasionally wild ruminants\n\nPer-Acute Form (Very Rapid Onset):\n\nSudden death\n\nConvulsions\n\nDiarrhea\n\nSub-Acute Form (Gradual Onset):\n\nHigh, persistent fever\n\nCoughing and respiratory distress\n\nMay recover or die within 12 weeks\n\nSubclinical Form (Mild or No Symptoms):\n\nUsually occurs in resistant breeds\n\nMild fever or completely asymptomatic\n\nFluid accumulation around heart (hydropericardium), lungs (hydrothorax), and abdomen (ascites)\n\nSmall internal bleeding in the intestines (petechiae)\n\nSwollen, congested brain tissue\n\nRabies\n\nTetanus\n\nPoisoning\n\nMeningitis\n\nBabesiosis\n\nEast Coast Fever (ECF)\n\nRegular tick control: Spraying and dipping are essential.\n\nQuarantine and monitor new or sick animals.\n\nUse tick-free grazing areas where possible.\n\nEarly treatment with oxytetracycline can save animalsonce nervous symptoms appear, chances of recovery are slim.\n\n Final Note:\n\nHeartwater can devastate herds if not detected and treated early. Veterinary involvement is critical to reduce losses. Farmers should maintain strict tick control programs and seek expert help at the first signs of illness.\n\n[emailprotected]\n\nCreditStay informed with AB Veterinary Services . Like our page for daily updates on animal health and farming solutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Heartwater, also known as Cowdriosis, is a deadly tick-borne disease caused by the bacteria-like organism Ehrlichia … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/what-is-heartwater/\">Continue reading<span class=\"screen-reader-text\"> \"What Is Heartwater ?\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Don’t Be Offended By My Name, Pastor Mb*ro Tells Zimbabweans",
            "url": "https://www.zimeye.net/2025/06/25/dont-be-offended-by-my-name-pastor-mbro-tells-zimbabweans/",
            "content": "By A Correspondent\n\nControversial South African preacher, Pastor Mb*ro, has addressed Zimbabweans directly, urging them not to be offended or amused by his name, which has stirred laughter and discomfort due to its meaning in Shona.\n\nPastor Mb*ro, whose full name is Paseka Franz Motsoeneng, is the founder and leader of Incredible Happenings Ministries. Known for his flamboyant sermons and dramatic healing services, he took time over the weekend to clarify the origin and meaning of his name in his home country.\n\nI know that in Zimbabwe Mbro means something else, but I am not that male organ, he said candidly. Actually, here in South Africa, Mbro means someone chosen to lead the church, a prophet or leader. So please, I am not that male organ.\n\nThe preacher, who has drawn media attention across Southern Africa for his unconventional style, said he respects cultural and linguistic differences but hopes Zimbabweans can look past the name and focus on the message he brings.\n\nHis statement comes ahead of anticipated regional outreach plans, where he hopes to extend his ministry into neighbouring countries, including Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial South African preacher, Pastor Mb*ro, has addressed Zimbabweans directly, urging them not to be offended or … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/dont-be-offended-by-my-name-pastor-mbro-tells-zimbabweans/\">Continue reading<span class=\"screen-reader-text\"> \"Don’t Be Offended By My Name, Pastor Mb*ro Tells Zimbabweans\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Lungu Family Ordered To Halt Burial",
            "url": "https://www.zimeye.net/2025/06/25/lungu-family-ordered-to-halt-burial/",
            "content": "BREAKING NEWS | GAUTENG HIGH COURT HALTS LUNGU BURIALPretoria Court Blocks Funeral as Legal Battle Over Zambias Former President Erupts\n\nPretoria, South Africa  25 June 2025\n\nBy Court Correspondent | ZimEye | The Gauteng High Court in Pretoria has issued an urgent order stopping the burial of Zambias late former President Edgar Chagwa Lungu, pending the outcome of a full legal hearing scheduled for 4 August 2025.\n\nThe ruling follows a heated court application brought by parties close to the Lungu family, who accuse authorities of attempting to carry out a politically driven burial process without the familys full consent. The applicants argued that the former president deserves a dignified and unified funeral, in line with both African tradition and his status as a former head of state.\n\nIn a surprising development during the hearing, legal representatives for the first to seventh respondents formally undertook not to proceed with the funeral or burial, saying they had received instructions to allow the legal process to unfold.\n\n Court Acknowledges Public Interest\n\nThe court acknowledged the deep grief and national emotion surrounding the matter and noted that the public has a legitimate interest in how the proceedings unfold. The legal teams on both sides were praised for engaging constructively and agreeing on a structured way forward.\n\nA statement submitted in support of the application emphasized the importance of cultural dignity:\n\nAs Africans, we believe the deceased should be laid to rest respectfully and in a manner that unites the family and nation  not divides it.\n\n Terms of the Court Order\n\nThe court issued the following directions:1. The respondents may not proceed with the funeral or burial of the late President until the finalisation of the main application.2. Any party wishing to intervene in the matter must file papers by 18 July 2025.3. The applicant must file an amended notice of motion and supporting affidavit by 4 July 2025.4. The respondents are to file opposing affidavits by 11 July 2025.5. Both sides are to file their heads of argument, chronologies, and lists of authorities by 18 and 24 July, respectively.6. A joint practice note and chronology must be submitted by 25 July 2025.7. The matter will be heard in full as a special motion on 4 August 2025.8. Electronic service of all documents is permitted.9. The costs of the urgent application are reserved and will be determined during the main hearing.10. Only the first to seventh respondents are allowed to visit or inspect the body, or permit others to do so.\n\n What This Means\n\nPresident Lungu died on 5 June 2025, but his remains are now effectively under legal protection, as the court steps in to resolve growing tensions over who has the right to determine his final resting place.\n\nThe case has sparked widespread discussion across Zambia and the diaspora, with supporters of the former president insisting on full respect for his legacy and the familys wishes.\n\nThe legal outcome in South Africa could also influence how similar cross-border burial disputes involving political figures are handled in the future.\n\nThis is a developing story. More updates to follow as the matter progresses toward the 4 August hearing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "📍BREAKING NEWS | GAUTENG HIGH COURT HALTS LUNGU BURIALPretoria Court Blocks Funeral as Legal Battle Over Zambia’s Former President Erupts … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/lungu-family-ordered-to-halt-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Lungu Family Ordered To Halt Burial\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        },
        {
            "title": "Zanu PF Is Bigger Than Government, Tagwirei Showcases Political Power, Days After Central Committee Appointment",
            "url": "https://www.zimeye.net/2025/06/25/zanu-pf-is-bigger-than-government-tagwirei-showcases-political-power-days-after-central-committee-appointment/",
            "content": "By A Correspondent\n\nControversial businessman and political powerbroker Dr. Kudakwashe Tagwirei has made waves in ZANU PF circles after quietly entering the partys influential Central Committee this month  a move many see as a calculated step toward even greater political ambition.\n\nWidely regarded as President Emmerson Mnangagwas blue-eyed boy, Tagwireis sudden and low-profile inclusion in the Central Committee has raised eyebrows, with party insiders suggesting it signals his growing influence in both party and state affairs.\n\nSpeaking to reporters in Harare after attending a closed-door provincial meeting with government departments on Tuesday, Tagwirei made remarks that hint at a shifting power dynamic.\n\nThe party (ZANU PF) is bigger than the government,he said pointedly, underscoring a sentiment often used by top party elites to remind civil servants and ministers where true authority lies.\n\nHis statement has reignited speculation about Tagwireis political ambitions, especially following his gradual transition from the business world and pulpit into full-fledged politics. Long known for his deep pockets and behind-the-scenes influence in both state contracts and party funding, Tagwirei is increasingly stepping into the limelight.\n\nThough he has not formally declared any presidential ambitions, insiders suggest his rapid rise through party structurescoupled with his alignment with Mnangagwacould be part of a broader succession strategy within the ruling party.\n\nWhether he is positioning himself as a future presidential contender or simply consolidating his influence within ZANU PF, one thing is clear: Tagwirei is no longer just the man behind the sceneshes now part of the machinery steering Zimbabwes political direction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial businessman and political powerbroker Dr. Kudakwashe Tagwirei has made waves in ZANU PF circles after quietly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/zanu-pf-is-bigger-than-government-tagwirei-showcases-political-power-days-after-central-committee-appointment/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Is Bigger Than Government, Tagwirei Showcases Political Power, Days After Central Committee Appointment\"</span></a></p>",
            "time": "18:42",
            "date": "26 Jun 2025"
        }
    ]
}