{
    "news": [
        {
            "title": "Two Collapse, Die At Beitbridge Border Post",
            "url": "https://www.zimeye.net/2025/06/12/two-collapse-die-at-beitbridge-border-post/",
            "content": "By A Correspondent-Two people have died after collapsing while undergoing border formalities at the Beitbridge Border Post in Matabeleland South over the weekend, authorities have confirmed.\n\nThe first victim was a 48-year-old South African truck driver transporting peas from the Democratic Republic of Congo. Beitbridge District Police Commander, Chief Superintendent Mesuli Ncube, said the driver collapsed and died on Saturday at around 4pm shortly after completing immigration procedures.\n\nHe had just returned to his vehicle after stamping his passport at the southbound truck export yard when he suddenly collapsed, said Chief Supt Ncube. Preliminary investigations revealed he had complained of feeling unwell in his work WhatsApp group the previous day.\n\nThe second incident occurred a day earlier, on Friday, when a diabetic passenger from Murehwa died during a customs inspection. The man was travelling with his 21-year-old son aboard a Best Express Logistics bus from Pretoria.\n\nHis legs were visibly swollen when he boarded the bus in South Africa, Chief Supt Ncube said. The bus was recalled to the border for customs reassessment after being stopped at a checkpoint in the Chicago area near Masvingo.\n\nDuring the inspection at around 10am, the mans son noticed his father was unresponsive. Port health officials and police were called to the scene. The body was later transferred to the Beitbridge District Mortuary.\n\nBoth cases are being treated as sudden deaths. Police are in the process of notifying the deceaseds next of kin, and post-mortem examinations are pending.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Two people have died after collapsing while undergoing border formalities at the Beitbridge Border Post in Matabeleland South … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/two-collapse-die-at-beitbridge-border-post/\">Continue reading<span class=\"screen-reader-text\"> \"Two Collapse, Die At Beitbridge Border Post\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "EDGAR LUNGU CORPSE: SHOOTING VICTIM ADDRESSES FAMILY",
            "url": "https://www.zimeye.net/2025/06/12/823729/",
            "content": "My name is Loveday Munesi.\n\nI am a 1 August 2018 shooting victim failing to access medical assistance because of the late President Edgar Lungus violations which started when he violated Zambian law and deported legislator, Tendai Biti before launching a political disinformation campaign that is still ongoing.\n\nI was shot on false allegations that I am a political operator when I was just a civilian passing through the streets of Harare CBD.\n\nIt is because of President Lungus violations that I am still to get medical attention either in my country or outside. The pain from the bullet which is still lodged in my backside is getting worse as it is a foreign object, that can only be removed by specialist medical expertise.\n\nI am appealing to the family and the estate managers of President Edgar Lungu to consider my plight as the late Haad Of State was for over 7 years approached by journalists who include Simba Chikanza but he publicly played down my plight.\n\nI might not be the corpse of a late President getting international media sympathy, I am a wounded father whose family is struggling as a result of these violations.\n\nI appeal to the Lungu family to also consider my plight at this difficult time I continue to endure torment and pain 7 years running.\n\nI ask the Lungu family to fight for me the same way they are doing the mans corpse.\n\nI reserve the right to sue\n\nLoveday Munesi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "My name is Loveday Munesi. I am a 1 August 2018 shooting victim failing to access medical assistance because of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/823729/\">Continue reading<span class=\"screen-reader-text\"> \"EDGAR LUNGU CORPSE: SHOOTING VICTIM ADDRESSES FAMILY\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "Michael Nees Eyes New Blood for AFCON …",
            "url": "https://www.zimeye.net/2025/06/12/michael-nees-eyes-new-blood-for-afcon/",
            "content": "Sports Correspondent\n\nWarriors head coach Michael Nees has hinted at a shake-up in future squad selections following impressive performances by emerging talent during Zimbabwes recent international fixtures.\n\nThe national team fielded two separate squads over the past weekone competing in the 2025 COSAFA Cup and another playing friendlies in Morocco against Burkina Faso and Niger. The COSAFA team, largely made up of U20 players, was overseen by junior national team coach Simon Marange, while Nees led a squad in Morocco composed of fringe players, returnees from injury, and new faces.\n\nFollowing a 1-1 draw with Niger on Tuesday, Nees expressed satisfaction with the depth and potential he witnessed, particularly highlighting Germany-based midfielder Jonah Fabisch.\n\nWe were looking at new options, even in the COSAFA Cup team. I think we lacked depth in central midfield, and Fabisch showed he can compete at that level, Nees said.\n\nThe coach emphasized that several players from both squads had made a strong case for themselves and would be in contention moving forward.\n\nWe also noticed a few standout players from the COSAFA squad. This has given us the depth we need, and now everyone must step up over the next six months, he added.To make the squad for AFCON, its going to be tough. I cant experiment anymore.\n\nZimbabwe has already secured qualification for the 2025 Africa Cup of Nations, which will take place in Morocco this December. With competition heating up, Nees appears ready to prioritize form and depth over reputation as the Warriors prepare for the continental showdown.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors head coach Michael Nees has hinted at a shake-up in future squad selections following impressive performances by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/michael-nees-eyes-new-blood-for-afcon/\">Continue reading<span class=\"screen-reader-text\"> \"Michael Nees Eyes New Blood for AFCON …\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "POLAD Members Go Hangry After Mnangagwa Snub",
            "url": "https://www.zimeye.net/2025/06/12/polad-members-go-hangry-after-mnangagwa-snub/",
            "content": "By A Correspondent-Members of the Political Actors Dialogue (POLAD) are growing increasingly angry and desperate, after nearly a year of being ignored by President Emmerson Mnangagwa, who once championed the platform as a symbol of inclusive governance.\n\nPOLAD was controversially established in the aftermath of the disputed 2018 presidential election as Mnangagwas attempt to sideline the countrys main opposition, then led by Nelson Chamisa. It brought together losing presidential candidates from fringe political parties under the guise of national dialogue and policy consultation.\n\nWhile initially paraded as a multi-party platform for building consensus, critics quickly saw through the faade. POLAD, they argued, was a state-sponsored charadea smokescreen for democracy designed to create the illusion of engagement while deflecting genuine calls for electoral reform.\n\nExcluded from the platform were real opposition leaders like Chamisa, who rejected the election results and refused to recognise Mnangagwas presidency. In contrast, POLAD membersmostly drawn from little-known parties with minimal electoral supportwere rewarded with perks: vehicles, fuel allowances, diplomatic passports, and invitations to official functions.\n\nBut five years later, the gravy train appears to have stalled.\n\nFollowing the similarly disputed 2023 elections, POLAD has all but disappeared from the political radar. Mnangagwa has gone silentand so has the platform. No meetings have been held in months, and members are growing restless, disillusioned, and visiblyhungry for both relevance and recognition.\n\nAt a rare meeting recently convened in Harare, disgruntled members vented their frustration.It has been quite a long time since we formally met and we are very concerned with the silence and absence of POLAD in the political arena,said Divine Hove, leader of the obscure Nationalist Alliance Party.There is so much happening in our country. We need to reignite dialogue and engagement with the Emmerson Mnangagwa government, which started POLAD in 2018, so we can share ideas.\n\nHove insisted that POLAD once played a role in shaping policy, citing committees like the economic committee that were supposedly created to advise government. But those efforts have since vanished without a trace.\n\nAlso in attendance was Welcome Shumba, POLADs chief of protocol and leader of the 1980 Freedom Movement, who called for a renewed focus on nation building.Another principal, speaking anonymously, claimed the platform contributed to national stability after 2018 and urged its revival.\n\nBut political analysts have long dismissed such claims, describing POLAD as a patronage network dressed up as dialogue. Without the participation of robust opposition voices, they argue, the platform was politically compromised from the start.\n\nPresidential spokesperson George Charamba offered little more than vague acknowledgment when contacted for comment.Tell them that as the Press Secretary of President Emmerson Mnangagwa, I have heard their concern and I will relay their message,he said.\n\nFor many observers, this lukewarm response signals that Mnangagwa no longer finds POLAD useful after securing a second term through yet another contested election. The political honeymoon is over, and so are the perks.\n\nWhats clear is that POLAD served its purpose as a tactical distraction,said one analyst.Now that its no longer needed, the members are left hangrystarved of attention, influence, and the trappings of political proximity.\n\nWith Mnangagwas silence growing louder and the political winds shifting, POLAD may soon be remembered not as a dialogue platform, but as a footnote in Zimbabwes long saga of democratic deception.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Members of the Political Actors Dialogue (POLAD) are growing increasingly angry and desperate, after nearly a year of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/polad-members-go-hangry-after-mnangagwa-snub/\">Continue reading<span class=\"screen-reader-text\"> \"POLAD Members Go Hangry After Mnangagwa Snub\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "British Man Miraculously Survives Air India Plane Crash in Ahmedabad",
            "url": "https://www.zimeye.net/2025/06/12/british-man-miraculously-survives-air-india-plane-crash-in-ahmedabad/",
            "content": "Ahmedabad, India  12 June 2025\n\nIn a dramatic and unexpected twist, a British man has been found alive following the catastrophic crash of Air India Flight AI171 in Ahmedabad earlier today, which was previously believed to have claimed the lives of all 242 people on board.\n\nAuthorities initially declared that it appears there are no survivors after the Boeing 787-8 Dreamliner, bound for London Gatwick, crashed in a residential area shortly after takeoff. However, hours into the rescue operation, a sole survivor was discovered.\n\nAhmedabad Police Commissioner GS Malik confirmed the extraordinary development:\n\nThe police found one survivor in seat 11A. One survivor has been found in the hospital and is under treatment. We cannot say anything about the number of deaths yet. The death toll may increase as the flight crashed in a residential area.\n\nThe survivor has been identified as Ramesh Vishwaskumar Bucharvada, a British national who had been seated in 11A, located near the front of the aircraft. According to Indian media outlet India Today, Bucharvada was seen walking away from the wreckage moments after the crash and was swiftly taken to a nearby hospital.\n\nSpeaking from his hospital bed to the Hindustan Times, Bucharvada recounted the terrifying experience:\n\nThirty seconds after takeoff, there was a loud noise and then the plane crashed. It all happened so quickly. When I got up, there were bodies all around me. I was scared. I stood up and ran. There were pieces of the plane all around me. Someone grabbed hold of me and put me in an ambulance.\n\nHe reportedly sustained chest and eye injuries, but doctors say his condition is stable.\n\nThe crash site, a densely populated area near the Ahmedabad airport, is still being combed by emergency responders and forensic investigators. Air India has since confirmed that 53 British nationals were among the passengers.\n\nThe cause of the crash remains unknown, though aviation experts are pointing to a potential mechanical failure or bird strike during takeoff. Indias Directorate General of Civil Aviation (DGCA) and international teams, including Boeing representatives, are expected to conduct a joint investigation.\n\nThis is a developing story. Updates will follow as more details emerge.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Ahmedabad, India – 12 June 2025 In a dramatic and unexpected twist, a British man has been found alive following … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/british-man-miraculously-survives-air-india-plane-crash-in-ahmedabad/\">Continue reading<span class=\"screen-reader-text\"> \"British Man Miraculously Survives Air India Plane Crash in Ahmedabad\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "Billiat Fallout Forces Kaizer Chiefs To Rethink Big-Money Signings",
            "url": "https://www.zimeye.net/2025/06/12/billiat-fallout-forces-kaizer-chiefs-to-rethink-big-money-signings/",
            "content": "Sports Correspondent\n\nKaizer Chiefs have reportedly overhauled their transfer strategy in the wake of Khama Billiats underwhelming stint at the club, shifting away from high-profile signings like Percy Tau.\n\nBilliat joined the Soweto giants in 2018 on a free transfer from Mamelodi Sundowns and spent five seasons at Naturena. Despite the fanfare surrounding his arrival, the clubs management felt his performance didnt justify his hefty paycheck over the years.\n\nAccording to a report bySoccer Laduma, Chiefs are now steering clear of marquee signings, having learned from the Billiat experiencealong with a similar situation involving Keagan Dolly.\n\nThe team feels they have learned a lesson from the signings of Khama Billiat and Keagan Dolly, where they paid significant salaries but believe the returns were not worth it, an unnamed source told the publication. Thats why they are exploring other forward players instead of Percy Tau. For now, he is not a target. However, in football, you never know what might happen in the future. But definitely not now.\n\nInterestingly, despite their internal disappointment, Chiefs had initially wanted to renew Billiats contract at the end of his tenure. The Zimbabwean international, however, declined and opted to return home, signing with Castle Lager Premier Soccer League outfit Yadah FC.\n\nThe shift signals a clear change in approach from the Soweto side, as they look to prioritize value and performance over star power in their recruitment strategy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kaizer Chiefs have reportedly overhauled their transfer strategy in the wake of Khama Billiat’s underwhelming stint at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/billiat-fallout-forces-kaizer-chiefs-to-rethink-big-money-signings/\">Continue reading<span class=\"screen-reader-text\"> \"Billiat Fallout Forces Kaizer Chiefs To Rethink Big-Money Signings\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "Embracing New Technology In Farming…",
            "url": "https://www.zimeye.net/2025/06/12/embracing-new-technology-in-farming/",
            "content": "By Dr. Trywell Muzerengi\n\nArtificial insemination (AI) is revolutionising livestock production in Zimbabwe and around the world, allowing farmers to improve the quality of their herds without the need for a live bull.\n\nAt its core, AI involves introducing semencollected from genetically superior bullsinto a female animals reproductive tract to achieve conception. This technique offers a wide range of benefits that traditional breeding methods cannot match.\n\nOne of the biggest advantages of AI is the ability to access semen from top-tier bulls sourced globally. This allows farmers to enhance the genetic pool of their herds, boosting productivity, resilience, and overall animal quality.\n\nAnother benefit is controlled breeding. Through a process called synchronisation, female animals can be induced to go into heat at the same time. As a result, they will conceive and calve around the same period, allowing for better planning, streamlined management, and more predictable production cycles.\n\nAI also opens the door to sexed semena scientific breakthrough that enables farmers to choose the gender of the offspring. This is particularly useful for dairy farmers who often prefer female calves for milk production.\n\nAdditionally, AI significantly reduces the risk of spreading sexually transmitted diseases that can be passed through natural mating. By eliminating the need to transport bulls between farms, AI also cuts down on logistics costs and reduces the risk of animal stress and injuries.\n\nIn short, artificial insemination is safer, more efficient, and far more strategic than traditional methods of breeding. It is a modern solution that puts the farmer in controlboosting productivity, protecting animal health, and helping build a stronger and more sustainable livestock industry in Zimbabwe.\n\nemail:[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Artificial insemination (AI) is revolutionising livestock production in Zimbabwe and around the world, allowing farmers to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/embracing-new-technology-in-farming/\">Continue reading<span class=\"screen-reader-text\"> \"Embracing New Technology In Farming…\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "Zivhu Sparks Storm by Claiming Tagwirei Is Zimbabwe’s ‘Next President’ After Mnangagwa",
            "url": "https://www.zimeye.net/2025/06/12/zivhu-sparks-storm-by-claiming-tagwirei-is-zimbabwes-next-president-after-mnangagwa/",
            "content": "By A Correspondent\n\nOutspoken and controversial ZANU PF official Killer Zivhu has ignited political speculation after publicly suggesting that businessman and presidential advisor Kudakwashe Tagwirei could be the successor to President Emmerson Mnangagwa.\n\nZivhu made the explosive remarks on Wednesday in a post on social media platform X (formerly Twitter), describing Tagwirei as a wealthy, God-fearing individual and hinting at his future political ambitions.\n\nPotential Presidential Candidate Alert! This wealthy, God-fearing individual has sparked interest. If given the chance, would you support him as our future president? Like if YES, Retweet if NO. Lets gauge public opinion, wrote Zivhu, in a post that quickly went viral and divided opinion.\n\nHis remarks come amid growing tension and factionalism within ZANU PF, with insiders alleging that Mnangagwa is grooming Tagwirei as a counterbalance to Vice President Constantino Chiwengas ambitions to take over the party leadership in 2028.\n\nThere is increasing speculation that if Mnangagwas controversial 2030 agenda fails, Tagwirei could be positioned as the compromise successor.\n\nTagwirei, a shadowy business magnate widely believed to wield enormous influence in Zimbabwes political and economic spheres, has long been a close ally of Mnangagwa. His name has been linked to multiple state contracts, and he remains under U.S. sanctions for alleged corruption and state captureallegations he denies.\n\nDespite this, Zivhu appeared to frame Tagwirei as a man of the people and a legitimate contender for national leadership. He is God-fearing, successful and has the country at heart, Zivhu told followers in follow-up posts, sparking criticism from both opposition figures and within the ruling party.\n\nPolitical analysts say the post could be part of a broader campaign to test public reception ahead of a potential future move. Its clear Zivhus post wasnt random. Its likely part of a soft-launch strategy to gauge reactions and prepare the ground, one analyst said.\n\nCritics, however, were quick to slam the idea of a Tagwirei presidency as an attempt to formalize state capture. Tagwirei already runs the country from the shadows. Making him president would just make the looting official, wrote one user in response.\n\nAs factional battles intensify ahead of 2028, Zivhus post has added fuel to the fire, reviving longstanding fears that Zimbabwes future leadership could be determined not through democratic processes, but through internal party machinations and elite alliances.\n\nNeither Tagwirei nor official ZANU PF spokespersons had responded to the claims at the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Outspoken and controversial ZANU PF official Killer Zivhu has ignited political speculation after publicly suggesting that businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/zivhu-sparks-storm-by-claiming-tagwirei-is-zimbabwes-next-president-after-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Zivhu Sparks Storm by Claiming Tagwirei Is Zimbabwe’s ‘Next President’ After Mnangagwa\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "Air India Plane Crashes After Takeoff from Ahmedabad with 242 On Board",
            "url": "https://www.zimeye.net/2025/06/12/air-india-plane-crashes-after-takeoff-from-ahmedabad-with-242-on-board/",
            "content": "An Air India flight en route to Londons Gatwick Airport has crashed just minutes after taking off from Ahmedabad, India, with242 people on board, the airline and local police confirmed on Thursday.\n\nThe tragic incident occurred near a civilian area close to the airport, though details on casualties or survivors are still unknown at this time.\n\nAn Air India aircraft operating a scheduled flight from Ahmedabad to London Gatwick has been involved in an accident shortly after takeoff, the airline said in a brief statement. We are working closely with authorities and emergency services.\n\nLocal police have confirmed the crash site is in aresidential area, raising concerns about possible ground casualties in addition to those on board.\n\nThe aircraft involved was identified by aviation tracking service Flightradar24 as aBoeing 787-8 Dreamliner, a state-of-the-art wide-body aircraft known for its fuel efficiency and advanced safety systems.\n\nEmergency responders, including fire crews, ambulances, and disaster response units, have been deployed to the scene.\n\nAuthorities are expected to hold a press briefing soon, as investigations into the cause of the crash begin. The identities of passengers and crew members have not yet been released.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "An Air India flight en route to London’s Gatwick Airport has crashed just minutes after taking off from Ahmedabad, India, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/air-india-plane-crashes-after-takeoff-from-ahmedabad-with-242-on-board/\">Continue reading<span class=\"screen-reader-text\"> \"Air India Plane Crashes After Takeoff from Ahmedabad with 242 On Board\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        },
        {
            "title": "ZANU PF Invades Gutu East, John Paradza Belittles Opposition Ahead of By-Election",
            "url": "https://www.zimeye.net/2025/06/12/zanu-pf-invades-gutu-east-john-paradza-belittles-opposition-ahead-of-by-election/",
            "content": "By A Correspondent\n\nZANU PF has intensified its campaign in Gutu East ahead of Saturdays crucial by-election, deploying senior party figures to rally support for its candidate, Zvarevashe Masvingise, and to fend off a growing challenge from independent candidate Gift Gonese.\n\nLeading the charge is ZANU PF deputy secretary for youth affairs and Gutu West Member of Parliament, John Paradza, popularly known as Boss Para.\n\nParadza addressed thousands of supporters over the weekend in what observers described as a high-octane rally infused with nationalist rhetoric and sharp attacks on opposition voices.\n\nWe are confident of retaining the seat, Paradza declared. Hon. Zvarevashe Masvingise is the ZANU PF candidate for the by-election. He is not only experienced but deeply rooted in the community. The revolutionary party is ready to deliver a resounding victory.\n\nMasvingise has positioned himself as a loyal foot soldier of the party and a champion of the ruling partys developmental agenda.\n\nAccording to a ZANU PF provincial official who spoke at the rally, the stakes are not just local but national. Thousands of supporters have pledged to vote resoundingly for the revolutionary party in the by-election to ensure full realization of Vision 2030 under the able leadership of President Dr. ED Mnangagwa up to 2030, the official said.\n\nWhile ZANU PF remains bullish about its prospects, the campaign has turned increasingly confrontational, with Paradza directly attacking Gift Gonese, the independent candidate who has reportedly gained traction in parts of the constituency.\n\nPolitical observers say the Gutu East by-election has become a testing ground for ZANU PFs rural dominance and an early measure of public sentiment ahead of 2028.\n\nThe party is leaving nothing to chance in the traditionally loyal constituency, pulling in party heavyweights and leveraging its grassroots structures.\n\nOne Zivanai Nzvenga of the NCA party is also eyeing the Gutu East Parliamentary seat.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF has intensified its campaign in Gutu East ahead of Saturday’s crucial by-election, deploying senior party … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/12/zanu-pf-invades-gutu-east-john-paradza-belittles-opposition-ahead-of-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Invades Gutu East, John Paradza Belittles Opposition Ahead of By-Election\"</span></a></p>",
            "time": "08:44",
            "date": "13 Jun 2025"
        }
    ]
}