{
    "news": [
        {
            "title": "South Africa’s ConCourt Rules Saying Husbands May take their Wives’ Surnames",
            "url": "https://www.zimeye.net/2025/09/11/south-africas-concourt-rules-saying-husbands-may-take-their-wives-surnames/",
            "content": "discriminatory law struck down\n\nJohannesburg  11 September 2025. By Dorrothy Moyo | South Africas Constitutional Court has handed down a landmark gender-equality ruling, declaring parts of the Births and Deaths Registration Act, 1992 unconstitutional and confirming that men may lawfully assume their wives surnames after marriage.\n\nIn a judgment delivered this morning, the apex court found that provisions governing surname changes after marriage unfairly discriminated on the basis of gender, because they enabled women to adopt a husbands surname automatically while denying husbands the mirror right. The Court declared the impugned portions of the Act and related regulations invalid, removing the barrier that had prevented husbands from adopting, hyphenating, or otherwise aligning their surnames with their spouses.\n\nHow we got here\n\nThe case reached the Constitutional Court after two couples challenged section 26(1)(a)(c) of the Act, arguing that it entrenched a patriarchal norm with no legitimate purpose. The Free State High Court had already ruled in their favour in 2024, striking down the same provisions and sending the matter to the ConCourt for confirmation. The couples included Henry van der Merwe and Jana Jordaan, and Andreas Bornman and Jess Donnelly-Bornman, who were blocked by Home Affairs when the husbands sought to assume or hyphenate with their wives surnames.\n\nWhat todays ruling means\n\nWhat to watch next\n\nThe Department of Home Affairs will now need to update its systems and forms so that couples can process surname choices without extra hurdles. In the earlier High Court order, the declaration of invalidity was to be operationalised while Parliament worked on amendments; todays confirmation by the ConCourt cements that trajectory and removes any legal ambiguity over men taking their wives surnames.\n\nBottom line: South Africas highest court has ended a long-standing legal asymmetry in marital surname rules. Couples can now decide  on equal terms  what their family name will be.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "…discriminatory law struck down… Johannesburg — 11 September 2025. By Dorrothy Moyo | South Africa’s Constitutional Court has handed down … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/south-africas-concourt-rules-saying-husbands-may-take-their-wives-surnames/\">Continue reading<span class=\"screen-reader-text\"> \"South Africa’s ConCourt Rules Saying Husbands May take their Wives’ Surnames\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Copacabana in Flames",
            "url": "https://www.zimeye.net/2025/09/11/copacabana-in-flames/",
            "content": "By A Correspondent  A massive fire ripped through a building at the corner of Chinhoyi Street and Speke Avenue in Harares CBD on Wednesday, reducing it to ashes and destroying goods worth thousands of dollars.\n\nThe blaze, which reportedly broke out in the early hours of the morning, left the buildings occupants counting heavy losses.\n\nWitnesses say the Harare Fire Brigade arrived after much of the property had already been consumed, raising renewed questions about the citys capacity to respond to such disasters.\n\nWhile the cause of the fire is still under investigation, this incident adds to a growing trend of destructive blazes that have rocked Harare in recent years.\n\nThe capital has witnessed a worrying surge in infernos, particularly in high-density areas and informal trading hubs.\n\nOne of the most notorious hotspots has beenGlen View 8 Home Industry Complex, where fires have become a recurring nightmare.\n\nThe area, known for its bustling carpentry, furniture-making, and small-scale industries, has been gutted several times in the past decade.\n\nTraders have lost millions of dollars worth of furniture and machinery in these repeated infernos, often linked to poor electrical connections, lack of fire safety infrastructure, and the close proximity of wooden structures.\n\nIn most cases, victims have been left to start afresh without compensation, as many of the traders operate informally without insurance cover.\n\nThe Glen View 8 fires have become symbolic of both the resilience of Zimbabwes informal sector and the glaring gaps in urban planning and disaster preparedness.\n\nOther parts of Harare, including Mbare Musika and Siyaso, have also suffered similar tragedies, with fire outbreaks often traced to overloaded electrical wiring, careless handling of flammable materials, and the absence of fire hydrants.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A massive fire ripped through a building at the corner of Chinhoyi Street and Speke Avenue … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/copacabana-in-flames/\">Continue reading<span class=\"screen-reader-text\"> \"Copacabana in Flames\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Mnangagwa Applies To UN Security Council Membership | Full Text",
            "url": "https://www.zimeye.net/2025/09/11/mnangagwa-applies-to-un-security-council-membership-full-text/",
            "content": "By Emmerson Mnangagwa |\n\nI officially launched Zimbabwes candidature for a non-permanent seat on the United Nations Security Council for the period 20272028. Since joining the UN in 1980, Zimbabwe has remained a staunch supporter of global peace, sovereignty, and justice.\n\nOur previous tenures (198384 and 199193) demonstrated our commitment to defending sovereignty and championing fairness in the international order. If elected, Zimbabwe will focus on promoting global peace and security, silencing guns and combating terrorism, strengthening cooperation between the UN and Regional Economic Communities, and advancing the women, youth, peace, and security agenda.\n\nWe are humbled by the unanimous endorsement of our candidature by SADC and the African Union, and we look forward to carrying the voice of Zimbabwe and Africa onto the world stage once more.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Emmerson Mnangagwa | I officially launched Zimbabwe’s candidature for a non-permanent seat on the United Nations Security Council for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/mnangagwa-applies-to-un-security-council-membership-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Applies To UN Security Council Membership | Full Text\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Petition To Stop Collins Mnangagwa Take Over A Road in Capital City Harare",
            "url": "https://www.zimeye.net/2025/09/11/petition-to-stop-collins-mnangagwa-take-over-a-road-in-capital-city-harare/",
            "content": "The following petition to stop President EmmersonMnangagwas son Collins from taking over a road in the capital city has topped 5,000 signatures.\n\nIt reads:\n\nSeptember, 2025\n\nTown Clerk, City of Harare\n\nDepartment of Urban Planning, Traffic and Transportation\n\nCleveland House, Room 304A\n\nHarare\n\nObjection to Application for Permanent Road Closure of a Portion of Otto Road (Otto Drive), Highlands, Harare (asadvertised as a Public Notice in The Herald on Tuesday 2 September 2025 p.11) located at 174611.9S 310649.8E\n\nWe, the undersigned residents and community members of Highlands and surrounding areas, hereby submit our formal objection to the proposed permanent road closure of a portion of Otto Road (i.e. Otto Drive, being the road connecting Willowmead Lane to Collins Avenue hereinafter referred to as Otto Road as per the public notice), Highlands, Harare, as advertised in the Public Notice placed in The Herald on Tuesday 2 September 2025.\n\nGrounds of Objection:\n\nWe therefore respectfully request that the City of Harare reject the proposed application to close and sell the portion of Otto Road (i.e. Otto Drive, being the road connecting Willowmead Lane to Collins Avenue), Highlands, Harare. Please find attached a petition of objections signed by affected residents, commuters, and community members.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The following petition to stop President Emmerson Mnangagwa’s son Collins from taking over a road in the capital city has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/petition-to-stop-collins-mnangagwa-take-over-a-road-in-capital-city-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Petition To Stop Collins Mnangagwa Take Over A Road in Capital City Harare\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Joy As Parking Fees Slashed",
            "url": "https://www.zimeye.net/2025/09/11/joy-as-parking-fees-slashed/",
            "content": "By A Correspondent  Motorists and transport operators across Zimbabwe have welcomed governments decision to slash parking fees and related transport charges, a move expected to ease financial pressure and stimulate economic activity.\n\nParking fees, including clamping and towing penalties, have been reduced by 50 percent in all towns and cities nationwide. The development comes as part of a broader government review of licences, permits, levies and fees in the transport sector, which authorities say is aimed at lowering the cost of doing business and improving competitiveness.\n\nIn a major relief for vehicle owners, the cost of car number plates has also been drastically cut fromUS$500 to US$50following a shift to local production. Officials said the new fee remains profitable for manufacturers while reducing the burden on ordinary Zimbabweans.\n\nThe wide-ranging reforms follow an earlier Cabinet decision to implement business-friendly measures across 12 sectors of the economy. Information, Publicity and Broadcasting Services Minister,Dr Jenfan Muswere, told journalists after Tuesdays Cabinet meeting that government was determined to streamline regulations, eliminate unnecessary levies and ensure the transport sector operates more efficiently.\n\nThe review process is aimed at reducing the cost of doing business, increasing competitiveness and enhancing the growth of the Zimbabwean economy, said Dr Muswere. Cabinet has directed that unjustifiably high fees be lowered across various transport sub-sectors, including passenger transport, haulage and cargo, taxi services, tobacco transportation and boating services.\n\nAmong other key decisions, Cabinet scrapped theUS$23 000 duty on transit fuelpreviously payable to ZIMRA, with the levy set to be repealed through a Statutory Instrument. Authorities believe the move will cut operational costs for transporters and make it easier to route fuel tankers through Zimbabwe.\n\nFinance, Economic Development and Investment Promotion Minister,Professor Mthuli Ncube, said several other excessive charges were also addressed. Theelectronic cargo system feeof US$30 has been eliminated to align Zimbabwe with regional standards, while parking fees outside the Forbes Border Post in Mutare have been removed entirely.\n\nProf Ncube added that government was also reviewing the recently introduced presumptive tax on the transport sector.The impact of reducing and cutting these fees and levies will be instant, he said. We are in a cutting mode. By reducing costs, we expect enterprises to become more profitable, which will in turn spur economic growth. The slashing of parking fees and number plate charges is just the beginning.\n\nThe sweeping reforms have been met with widespreadjoy among motorists and transport operators, who say the reductions will ease financial strain at a time when the economy is under pressure. For many ordinary Zimbabweans, the halving of parking fees is more than just a technical adjustment  it is a welcome reprieve that makes daily life in towns and cities more affordable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Motorists and transport operators across Zimbabwe have welcomed government’s decision to slash parking fees and related … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/joy-as-parking-fees-slashed/\">Continue reading<span class=\"screen-reader-text\"> \"Joy As Parking Fees Slashed\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Suspicious Loud Noises As Holy Ten Says I’m Enrolling for Rehab",
            "url": "https://www.zimeye.net/2025/09/11/suspicious-loud-noises-as-holy-ten-says-im-enrolling-for-rehab/",
            "content": "There were over 38 suspicious movements as the musician Mukudzei Chitsama announced that he is going for rehab. Holy Ten, according to his stage name, announced a long statement apologising to the First Family (below), but his body language was too loud to ignore. Video-\n\nHOLY TENS NOISY BODY LANGUAGE WHILE APOLOGISING TO SEAN MNANGAGWAhttps://t.co/s73ydrb6sr\n\nFull statement: Rehab is a very difficult decision especially when you know youre not using what they say youre using.\n\nIve always just avoided it because thats a place where I know the junkies go.As a man that drank a lot of alcohol, but still had the ability to make proper decisions the next morningI thought I could just conquer it easily.\n\nBut the same alcohol has destroyed others before  their health, their families, their talents and their lives.\n\nSo Ive made this BOLD decisions to get professional help.\n\nI know a lot of people wish to see me finished in so many ways but the same people youd wish to put me in the problems youd celebrate have always shown me love and expressed the genuine need for professional help. And this is a step towards that.\n\nI still call myself the leader of the youth because I STILL AM, I just need to remember the direction they need to be led in. The right one.\n\nIm not going to inspire a nation of alcoholics.\n\nThe ones that are praying for me, I will be a better man.\n\nI remain apologetic for EVERYTHING I SAID.\n\nPlease forgive me Zimbabwe, please forgive me my Commander In Chief, my President, my brothersmy mother who is in a state of pain and disbelief, my wife who has been watching all this happening and trying to help me, our political party.\n\nMukudzei Modecay Chitsama\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "There were over 38 suspicious movements as the musician Mukudzei Chitsama announced that he is going for rehab. Holy Ten, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/suspicious-loud-noises-as-holy-ten-says-im-enrolling-for-rehab/\">Continue reading<span class=\"screen-reader-text\"> \"Suspicious Loud Noises As Holy Ten Says I’m Enrolling for Rehab\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Bulawayo Firm in Scandal Over ‘Animal Feed’ Rice Sold for Human Consumption",
            "url": "https://www.zimeye.net/2025/09/11/bulawayo-firm-in-scandal-over-animal-feed-rice-sold-for-human-consumption/",
            "content": "Imagine tucking into a steaming plate of rice  the aroma comforting, the grains soft and familiar  only to discover later that what youve eaten was never meant for human beings at all. In Bulawayo, that nightmare has become a chilling reality after city health officials uncovered a shocking scandal: tonnes of rice, originally designated as animal feed, had allegedly been repackaged and sold for human consumption.\n\nBulawayo  A Bulawayo-based company is under investigation after allegedly repackaging water-damaged rice originally intended for animal feed and distributing it for human consumption.\n\nAccording to the latest Bulawayo City Council (BCC) health report, Flynote Investments (Pvt) Ltd, trading under the Evergold brand and operating from Thorngrove, had 322 tonnes of rice confiscated and sent to the Government Analyst Laboratory for urgent testing.\n\nCity health officials say the rice  initially designated as stock feed  was repackaged for human markets inside a facility designed for animal feed production.\n\nWater-damaged bulk rice for stock feed was being packaged and sold for human consumption. The rice was being packaged in a stock feed factory with extremely poor hygienic conditions, reads the BCC report.\n\nOfficials raised alarm over the potential presence of mould, bacteria and chemical residues, which can cause serious illnesses if consumed.\n\nNo immediate comment was obtained from Flynote Investments yesterday.\n\nMultiple Complaints in One Month\n\nThe rice scandal emerged as part of a wider set of community health complaints during the same reporting period. These included: Human waste at Burombo Beer Garden in Mzilikazi, allegedly caused by illegal occupants. A pig-rearing operation at 25 Marimba Road, Matsheumhlope, generating noise and foul smells. Overcrowding at 6 Msigwana Road, Harrisvale, where 15 people are reportedly sharing one four-bedroom house without proper ablution facilities.\n\nPush for Stray Cat and Vicious Dog Policies\n\nBulawayo councillors also debated a new policy to manage the citys growing stray cat population following a recent 10-day tie-up order on stray dogs.\n\nOver a period of five years, the population of these cats would have multiplied significantly, said Councillor Felix Madzana.\n\nHealth director Dr Edwin Mzingwane confirmed a policy on vicious dog breeds is being drafted in consultation with the SPCA, ZRP and Veterinary Services. He warned, however, that reducing cat numbers too drastically could spark rat infestations, citing a case in Johannesburgs Alexandra township.\n\nPublic Health Alarm\n\nThe rice scandal has triggered widespread concern in Bulawayo, where food security and safety are already under strain. Analysts warn that repackaging feed-grade products for human use can expose consumers to carcinogens, harmful microbes, and dangerous toxins.\n\nConsumer watchdogs are calling for stronger inspections of food-processing plants and harsher penalties for firms caught mislabelling or repurposing non-food products.\n\nAuthorities have yet to confirm the laboratory results from the seized rice consignment, but say legal action will follow if the findings support the allegations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Imagine tucking into a steaming plate of rice — the aroma comforting, the grains soft and familiar — only to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/bulawayo-firm-in-scandal-over-animal-feed-rice-sold-for-human-consumption/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Firm in Scandal Over ‘Animal Feed’ Rice Sold for Human Consumption\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Grandma Rapes Grandson",
            "url": "https://www.zimeye.net/2025/09/11/grandma-rapes-grandson/",
            "content": "By A Correspondent | Guruve  A 44-year-old grandmother has been jailed for 20 years by the Guruve Magistrates Court after being convicted of sexually abusing her 14-year-old grandson on two occasions between January and February 2025.\n\nProsecutors told the court the woman lured the boy into her bedroom under the pretext of household tasks, then overpowered him and committed sexual acts against his will. The case came to light when the victims younger sibling confided in their mother, leading to a police report and the grandmothers arrest.\n\nDespite her guilty plea, magistrates cited overwhelming evidence and imposed 20 years imprisonment for each count, to run concurrently.\n\nOfficials condemned the crime as a gross abuse of trust and power and vowed continued protection for minors from exploitation.\n\nChild-rights groups have praised the ruling and urged families to remain vigilant, sharing hashtags such as #ChildProtection, #JusticeServed, and #SayNoToAbuse.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Guruve – A 44-year-old grandmother has been jailed for 20 years by the Guruve Magistrates’ Court … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/grandma-rapes-grandson/\">Continue reading<span class=\"screen-reader-text\"> \"Grandma Rapes Grandson\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "The Biggest Scam in Zimbabwe, Fake Sir Wicknell Strikes Across Social Media",
            "url": "https://www.zimeye.net/2025/09/11/the-biggest-scam-in-zimbabwe-fake-sir-wicknell-strikes-across-social-media/",
            "content": "By Jacob Kudzayi Mutisi | Zimbabweans are being urged to exercise extreme caution as one of the most sophisticated scams in recent history spreads rapidly across social media platforms. Fraudsters are impersonating controversial businessman Sir Wicknell Chivhayo on Facebook, Instagram, WhatsApp, X (formerly Twitter) and even TikTok, luring unsuspecting victims into a trap powered by artificial intelligence.The scheme usually begins when a person receives a friend request or follow notification from what appears to be Sir Wicknells verified account. The fake profiles are carefully designed, showcasing luxury cars, money and flashy lifestyles copied directly from the real businessmans pages. Once the victim accepts the request, they are approached with promises of an exclusive investment opportunity that will supposedly deliver massive returns.\n\nTo seal the deception, scammers then send a call request on Messenger, WhatsApp or even Telegram. Using AI voice-cloning technology, they reproduce Sir Wicknells distinctive voice, confidently explaining the investment deal. In some cases, deepfake video calls are deployed, making the illusion even harder to detect. Convinced that they are speaking to the flamboyant businessman, victims are persuaded to transfer large sums of money into fraudulent accounts. By the time the truth emerges, it is already too late.\n\nThis scam represents a new, dangerous chapter in online fraud. Unlike older schemes that relied on poorly written messages or stolen photos, todays criminals are harnessing artificial intelligence to create near-perfect imitations of public figures. What we are seeing is a high-tech trap, one cybersecurity analyst explained. It exploits peoples admiration of celebrities and their desperation for quick money.\n\nZRP have constantly recieved reports, but tracing the culprits has proven difficult, hiding behind encrypted networks. Sir Wicknell himself has publicly denied running any investment initiatives on social media, stressing that he never solicits money online.\n\nThe public is being advised to remain vigilant. No genuine investment opportunity will arrive via a random direct message and promises of extraordinary returns are almost always fraudulent.As scams like these continue to evolve, Zimbabweans are reminded of one timeless truth, in matters of money, if it sounds too good to be true, it almost certainly is.\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Jacob Kudzayi Mutisi | Zimbabweans are being urged to exercise extreme caution as one of the most sophisticated scams … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/the-biggest-scam-in-zimbabwe-fake-sir-wicknell-strikes-across-social-media/\">Continue reading<span class=\"screen-reader-text\"> \"The Biggest Scam in Zimbabwe, Fake Sir Wicknell Strikes Across Social Media\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        },
        {
            "title": "Junta Humbles Masimirembwa",
            "url": "https://www.zimeye.net/2025/09/11/junta-humbles-masimirembwa/",
            "content": "By A Correspondent  Senior army officers (names not disclosed) have been revealed as the victims of a high-profile fraud scandal that has shaken Zanu PF and left Harare Provincial chairman Goodwills Masimirembwa embarrassed after his alleged attempts to shield the perpetrators collapsed. The case, which has already led to arrests, once again exposes the deep rot of corruption within Zimbabwes ruling party.\n\nAccording to reports, Spencer Mabheka, a provincial member, and Lilian Chitanga, the Zone 3 District Coordinating Committee Womens League secretary, allegedly conned the army officers by fraudulently selling them three residential stands valued at US$70,000 each. The two were arrested by the CID Police Anti-Corruption Unit (PACU) and spent the night in police cells at Mabelreign Police Station.\n\nThe scandal escalated when Masimirembwa allegedly tried to intimidate the officer-in-charge handling the case to protect his colleagues. His efforts collapsed once it was confirmed that the victims were senior army officers, whose influence ensured the matter could not be quietly buried. Police have not yet issued an official statement.\n\nThe episode highlights the entrenched culture of corruption and impunity within Zanu PF. From the Willowgate scandal of the late 1980s, where ministers profiteered from vehicle imports, to the Marange diamond looting that saw billions vanish, the ruling party has been repeatedly associated with abuse of office and the protection of corrupt elites.\n\nMasimirembwa himself is no stranger to controversy; as former chair of the Zimbabwe Mining Development Corporation, he was accused of demanding bribes from diamond investors, yet was later rewarded with a senior party post.\n\nAnalysts suggest the arrests of Mabheka and Chitanga may be linked to deepening factional battles within Zanu PF, where corruption cases are often weaponised in internal power struggles rather than pursued to uphold the rule of law.\n\nFor ordinary Zimbabweans, however, the scandal sends a familiar message: corruption in Zanu PF is systemic, and justice only surfaces when powerful interestsin this case, senior army officersare directly affected.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Senior army officers (names not disclosed) have been revealed as the victims of a high-profile fraud … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/11/junta-humbles-masimirembwa/\">Continue reading<span class=\"screen-reader-text\"> \"Junta Humbles Masimirembwa\"</span></a></p>",
            "time": "06:32",
            "date": "12 Sep 2025"
        }
    ]
}