{
    "news": [
        {
            "title": "ARDA Steps Up With Major Grain Delivery to Shore Up National Reserves",
            "url": "https://www.zimeye.net/2025/12/10/arda-steps-up-with-major-grain-delivery-to-shore-up-national-reserves/",
            "content": "By A Correspondent| The Agricultural and Rural Development Authority (ARDA) has strengthened its position as a key player in Zimbabwes food security efforts after contributing 50 percent of this years winter wheat harvest.\n\nThe contribution stems from a record national wheat harvest of about 640,195 tonnes, one of the strongest in recent years, reflecting renewed momentum in the agricultural sector.\n\nFavourable rainfall patterns and intensified government programmes helped drive the exceptional output, which has also supported an upward revision of Zimbabwes projected economic growth to 6.6 percent.\n\nARDA attributes the achievement to improved management across its estates and joint ventures, including precision agriculture techniques and expanded irrigation schemes. The authority emphasises that its mandate centres on ensuring national food sovereignty through consistent and reliable production.\n\nThe organisation notes that providing over 50 percent tonnes of grain does more than boost cereal output; it reinforces market stability and strengthens Zimbabwes resilience against supply disruptions. This years high output is expected to significantly enhance the capacity of the Strategic Grain Reserve, improving the countrys ability to stabilise both supply and pricing.\n\nThe strong performance further demonstrates the effectiveness of ongoing efforts to climate-proof agriculture through large-scale irrigation development and broader support to farmers.\n\nAnalysts highlight the record wheat harvest as evidence of a sector in recovery.\n\nThe figures speak to a sector in recovery and an institution delivering on its promise, stated agricultural economist Dr Reneth Mano highlighting that ARDAs contribution goes beyond tonnes it is about building a predictable and secure agricultural base for the economy.\n\nAccording to agricultural experts, ARDAs contribution represents more than a numerical addition to national stocks; it reflects progress toward building a predictable and secure agricultural foundation for the economy.\n\nWith the summer cropping season underway, ARDA says it is focused on maintaining the current momentum by improving access to quality inputs and accelerating irrigation rehabilitation. The authority maintains that these priorities are essential to advancing Zimbabwes agricultural transformation and strengthening long-term food security.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Agricultural and Rural Development Authority (ARDA) has strengthened its position as a key player in Zimbabwe’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/arda-steps-up-with-major-grain-delivery-to-shore-up-national-reserves/\">Continue reading<span class=\"screen-reader-text\"> \"ARDA Steps Up With Major Grain Delivery to Shore Up National Reserves\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Warriors Star Zemura Suffers Injury Setback",
            "url": "https://www.zimeye.net/2025/12/10/warriors-star-zemura-suffers-injury-setback/",
            "content": "Sports Correspondent  Zimbabwes national football team, the Warriors, is facing a double injury blow ahead of the Africa Cup of Nations (AFCON).\n\nJordan Zemura, who plays for Udinese, suffered a muscle problem during Mondays 2-1 loss to Genoa, forcing him off the field after just 15 minutes with a thigh issue .\n\nThe full extent of Zemuras injury is still unclear, causing concern within the Warriors camp with less than two weeks to go before AFCON kicks off.\n\nMeanwhile, head coach Marian Marinica is also worried about vice-captain Marshall Munetsi, who is expected to miss at least six weeks due to a calf injury.\n\nMunetsis absence is a significant blow to the team, and Marinica will need to adjust his tactics accordingly. The Warriors are in Group B alongside Egypt, Angola, and South Africa, making their preparation crucial for a successful campaign.\n\nJordan Zemura\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Zimbabwe’s national football team, the Warriors, is facing a double injury blow ahead of the Africa Cup … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/warriors-star-zemura-suffers-injury-setback/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Star Zemura Suffers Injury Setback\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Chadzamira Torments Journalists For Exposing Land Seizure",
            "url": "https://www.zimeye.net/2025/12/10/chadzamira-torments-journalists-for-exposing-land-seizure/",
            "content": "By A Correspondent Three Masvingo Mirror staff memberseditor Garikai Mafirakureva, news editor Simbarashe Mtembo, and driver Tinashe Kogahave been taken into custody by state security operatives in what is being seen as an intimidation tactic against the press.\n\nThe three were arrested on Tuesday by a heavily armed team of nine CID officers and seven CIO agents, reportedly led by an officer named Nkala.\n\nThe journalists were detained while covering a disputed property allegedly seized by Masvingo Minister of State, Ezra Chadzamira, from a local widow.\n\nChadzamira is said to have started building a school on the land, prompting protests from the affected family.\n\nReports also indicate that water pipes belonging to Masvingo City Council at the property have been deliberately damaged, further escalating tensions in the area.\n\nLocals have expressed outrage over the arrest, claiming it is an attempt to silence journalists exposing alleged misuse of power by public officials.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– Three Masvingo Mirror staff members—editor Garikai Mafirakureva, news editor Simbarashe Mtembo, and driver Tinashe Koga—have been taken … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/chadzamira-torments-journalists-for-exposing-land-seizure/\">Continue reading<span class=\"screen-reader-text\"> \"Chadzamira Torments Journalists For Exposing Land Seizure\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Zanu PF Politburo Blocks Zvigananda From Donating Motor Vehicles",
            "url": "https://www.zimeye.net/2025/12/10/zanu-pf-politburo-blocks-zvigananda-from-donating-motor-vehicles/",
            "content": "Tinashe Sambiri The ZANUPF leadership has moved to shut down the growing trend of party figures distributing vehicles, declaring that only President Emmerson Mnangagwa will be allowed to hand over cars on behalf of the party from now on.\n\nThe decision, insiders say, is aimed at stopping internal power manoeuvres by individuals seen as trying to elevate their political profiles.\n\nIn recent months, car handovers had become almost routine within the ruling party, with senior members and institutions receiving free vehicles regularly. But according to officials familiar with last weeks discussions, Mnangagwa intervened to halt what had become a divisive and highly politicised practice.\n\nWell-known business personalities, including Kudakwashe Tagwirei and Wicknell Chivayo, had previously poured hundreds of vehicles into various ZANUPF structures  from the politburo and central committee to the womens league  before the new directive stopped all such private donations.\n\nThe restriction was formally endorsed during a series of high-level meetings held in Harare last week, involving the politburo, central committee and the national consultative assembly.\n\nAccording to party sources, ZANUPF national chairperson Oppah Muchinguri-Kashiri was the first to raise the issue in the politburo, insisting the party needed to reaffirm a single, uncontested centre of authority. She reportedly warned that some individuals were trying to use their financial muscle to buy influence.\n\nA senior politburo member aligned to her explained:\n\nAfter Cde Muchinguri-Kashiris proposal, the politburo agreed that ZANU PF welcomes high wealth individuals into its membership and structures, more so as the economy shows clear signs of growth and prosperity.\n\nBut from now on, should there be any interest to support the party, it is also most welcome, but such largesse should be channelled through only through the president of the party as one centre of power.\n\nThe politburo affirmed that there is one centre of power in ZANU PF and it is President ED Mnangagwa, after the chairperson vehemently advocated for the one centre of power.\n\nThe party adopted the proposal after noting that vehicle and money donations were now dividing the party.\n\nThe president has an audit of the overall needs of the party at any given time and is the one who can deploy any resources in a fair and worthwhile manner.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– The ZANU–PF leadership has moved to shut down the growing trend of party figures distributing vehicles, declaring that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/zanu-pf-politburo-blocks-zvigananda-from-donating-motor-vehicles/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Politburo Blocks Zvigananda From Donating Motor Vehicles\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Masvingo in Turmoil: Journalists Arrested For Exposing Minister Chadzamira’s Land Scandal",
            "url": "https://www.zimeye.net/2025/12/10/masvingo-in-turmoil-journalists-arrested-for-exposing-minister-chadzamiras-land-scandal/",
            "content": "By A Correspondent  Masvingo Mirror staff memberseditor Garikai Mafirakureva, news editor Simbarashe Mtembo, and driver Tinashe Kogawere arrested by government security agents on Tuesday while reporting on a controversial land seizure by Masvingo Minister of State, Ezra Chadzamira.\n\nThe arrests were carried out by a combined team of nine armed CID officers and seven CIO operatives led by an officer identified as Nkala.\n\nThe journalists were detained outside a disputed property allegedly taken from a widow, on which Chadzamira is reported to be constructing a school. Water pipes belonging to Masvingo City Council at the site have also been damaged, raising further concerns about the misuse of public resources.\n\nA human rights defender in Masvingo condemned the arrests, saying, This is a clear attempt to intimidate the press and silence those exposing wrongdoing by public officials. Journalists have a duty to report the truth, and arrests like this undermine democracy.\n\nThe activist added, We cannot stand by while the powerful trample on the rights of ordinary citizens and those reporting injustices. The government must respect freedom of expression and allow journalists to do their work without fear of detention.\n\nThe incident has sparked outrage among residents and civil society groups, who fear that such actions set a dangerous precedent for press freedom in the province.\n\nEzra Chadzamira\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Masvingo Mirror staff members—editor Garikai Mafirakureva, news editor Simbarashe Mtembo, and driver Tinashe Koga—were arrested by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/masvingo-in-turmoil-journalists-arrested-for-exposing-minister-chadzamiras-land-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo in Turmoil: Journalists Arrested For Exposing Minister Chadzamira’s Land Scandal\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Jaison Muvevi Trial Set For March 2026",
            "url": "https://www.zimeye.net/2025/12/10/jaison-muvevi-trial-set-for-march-2026/",
            "content": "By A Correspondent  The long-running legal proceedings involving former police detective Jaison Muvevi are finally moving forward, with the courts setting aside dates in March 2026 for his long-awaited trial. This follows confirmation from two State psychiatrists that he is now mentally capable of participating in court processes, ending years of uncertainty about his condition.\n\nMagistrate Ruth Moyo announced the development on Tuesday, stating that the specialists had concluded their assessment and determined that Muvevi could stand trial. The doctors have concluded that the accused is capable of standing trial, she said.\n\nMuvevi had been under psychiatric observation since 2023, but authorities say he is now stable enough for the High Court to hear his case. Prosecutors allege that he was involved in a series of violent incidents across Harare, Hwedza and Mutare, which left four people dead and several others injured.\n\nInvestigators say the events began at a Johanne Masowe eChishanu shrine where congregants, including Muvevis mother, were gathered. During the confrontation that unfolded, witnesses reported hearing his mother ask, What have you done, my son? as congregants fled in fear.\n\nAfter leaving the shrine, Muvevi was tracked to various locations as police attempted to apprehend him. At Hwedza, officers approached his vehicle, leading to a deadly exchange in which Inspector Maxwell Hove lost his life. A detective was also injured during the encounter.\n\nHe later went to Mukamba Business Centre, where prosecutors say he confronted barman Munashe Majani before fatally shooting him. The motive remains unknown.\n\nA nationwide manhunt followed. Police reported that Muvevi abandoned his vehicle in Rusape after another confrontation and continued escaping on foot. They later recovered a firearm taken during his earlier encounter with officers.\n\nDuring his movements, Muvevi was spotted in Mutare, where he purchased a new work suit and later appeared at Mutare Boys High School. Witnesses say he falsely claimed he was in the area to deal with baboons causing trouble. Several people at the school reported frightening interactions with him before he left the premises.\n\nProsecutors also link him to an earlier 2021 incident in Eastlea, Harare, where Nyarai Round was killed. A companion who was with Round at the time was initially arrested but later cleared and turned into a State witness.\n\nMuvevi was eventually arrested in Mozambique after reportedly crossing the border at night and hiring a motorcyclist to take him to Chimoio. The rider later told authorities he had been offered money to make the trip.\n\nWith psychiatric clearance now in hand, the State says the matter is ready to proceed between 16 and 20 March 2026, when the High Court is expected to hear the full case.\n\nJaison Muvevi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The long-running legal proceedings involving former police detective Jaison Muvevi are finally moving forward, with the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/jaison-muvevi-trial-set-for-march-2026/\">Continue reading<span class=\"screen-reader-text\"> \"Jaison Muvevi Trial Set For March 2026\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Human Rights Lawyers Challenge Mnangagwa To Respect Citizens’ Rights",
            "url": "https://www.zimeye.net/2025/12/10/human-rights-lawyers-challenge-mnangagwa-to-respect-citizens-rights/",
            "content": "Tinashe Sambiri As Zimbabwe observes International Human Rights Day on 10 December, the Zimbabwe Lawyers for Human Rights (ZLHR) is urging President Emmerson Mnangagwa and his government to take concrete steps to protect the rights of all citizens.\n\nIn a statement, ZLHR said the vision of universal human rights in Zimbabwe remains largely unfulfilled. The group stressed that the government must ensure its policies and practices reflect the standards outlined in the Universal Declaration of Human Rights (UDHR) and other international treaties.\n\nEven with a progressive 2013 Constitution that enshrines universal human rights, many Zimbabweans continue to face daily violations, the statement reads. People are denied access to education, health care, and property. Freedom of expression, association, and assembly are frequently restricted. Arbitrary evictions, internal displacements, and violations of environmental rights continue unabated, with children, women, and persons with disabilities disproportionately affected.\n\nZLHR highlighted the theme for this years International Human Rights Day, Our Everyday Essentials, saying it underscores the need for fundamental rights to be part of daily life. Human rights must no longer be treated as optional or secondary, the organisation said. They are essential for every Zimbabwean.\n\nThe lawyers called on the government to implement the guarantees enshrined in the UDHR, international human rights treaties, and the national Constitution. Authorities must stop actions that undermine citizens fundamental freedoms and actively protect, promote, and uphold these rights, the ZLHR urged.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– As Zimbabwe observes International Human Rights Day on 10 December, the Zimbabwe Lawyers for Human Rights (ZLHR) is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/human-rights-lawyers-challenge-mnangagwa-to-respect-citizens-rights/\">Continue reading<span class=\"screen-reader-text\"> \"Human Rights Lawyers Challenge Mnangagwa To Respect Citizens’ Rights\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Mthuli Ncube Defends VAT Increase: Watch",
            "url": "https://www.zimeye.net/2025/12/10/mthuli-ncube-defends-vat-increase-watch/",
            "content": "By A Correspondent  Speaking in Harare this week, Finance Minister Hon. Prof. Mthuli Ncube defended the recent 0.5% increase in Value Added Tax (VAT), describing it as a necessary measure to stabilise government finances and enhance revenue collection.\n\nNcube explained that the adjustment is part of broader fiscal efforts aimed at supporting national development programmes and ensuring the government can meet its obligations.\n\nHe maintained that the increase, though modest, is vital for strengthening the countrys revenue base in a challenging economic environment.\n\nFinance Minister Hon. Prof. Mthuli Ncube underscored the 0.5% increase in VAT as an essential step to strengthen revenue collection.pic.twitter.com/xp7GPk6GTI\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Speaking in Harare this week, Finance Minister Hon. Prof. Mthuli Ncube defended the recent 0.5% increase … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/mthuli-ncube-defends-vat-increase-watch/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Ncube Defends VAT Increase: Watch\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Disgruntled worker defecates on CEO’s doorstep as AMH salaries’s woes mount",
            "url": "https://www.zimeye.net/2025/12/10/disgruntled-worker-defecates-on-ceos-doorstep-as-amh-salariess-woes-mount/",
            "content": "By A Correspondent| Disgraced Alpha Media Holdings chief executive Kenias Mafukidze woke up to poo on his office door as tension between management and employees mounts over ten months unpaid salaries.\n\nAMH is the countrys biggest independent media house and it publishes the NewsDay, Zimbabwe Independent, The Standard and online television Heart and Soul.\n\nThe tension was heightened when the company poured in over US$50 000 for a music show which flopped spectacularly at Belgravia Sports Club.\n\nAccording to employees, the companys debt has continued to grow, prompting staff to seek intervention from ZIGAWU.\n\nZIGAWU, which is representing the affected workers, has held multiple meetings with Alpha Media management in an effort to secure a concrete payment plan.\n\nHowever, union officials and employees say the company has failed to honour agreements previously reached, leaving workers increasingly frustrated.\n\nOne employee, speaking on condition of anonymity, said: We have families, responsibilities, and debts, yet we are expected to come to work every day without any assurance of when we will be paid. We know the money is there but they prefer to serve their own priorities over us the workers who are coming to work everyday.\n\nEmployees allege that the deterioration of the organisations financial position is linked to misappropriation of funds and poor prioritisation, despite internal claims that resources have been flowing into the business.\n\nStaff members say funds have repeatedly been diverted to non-business activities that do not generate revenue or get reimbursed.\n\nAnother worker added:It feels like money is being moved around for everything else except salaries. We just want transparency and respect.Concerns have also been raised over management conduct.\n\nThe companys human resources executive, Jacob Sukali, recently travelled to China on what employees claim was a fully funded trip using company resources at a time when workers remain unpaid.\n\nStaff members say Sukali has taken a stance aligned with the employer and has reportedly issued threats to employees who question financial irregularities.\n\nAt a recent board meeting held at Heart & Soul studios, some board members reportedly demanded explanations over large sums of money allegedly being withdrawn from company accounts by the CEO Kenias Mafukidze.\n\nAccording to individuals close to the matter, Mafukidze could not provide clarity on how the funds were used.\n\nBoard members also raised concerns over allegations that Amh Chairman Trevor Ncube is taking significant amounts from the company accounts for events that do not yield returns, worsening the organisations financial strain.\n\nAnother employee commented: We have raised our concerns for months, but nothing changes. At this point, we are just asking for the salaries we have worked for. They are just frustrating us so that we leave, but we can not go anywhere without our money.\n\nZIGAWU again approached the company seeking either immediate salary payments or a binding, transparent plan.\n\nThe union said it is prepared to escalate the matter should the employer fail to present a credible solution.Here is a neutral, hard-news style paragraph explaining that pre-arbitral proceedings have already been served and what that implies for AMH, without presenting any unverified allegations as fact:\n\nPre-arbitral proceedings have now been formally served on Alpha Media Holdings (AMH) by ZIGAWU, marking a significant escalation in the salary dispute.\n\nThis step legally compels AMH to respond within a defined timeframe and participate in a structured dispute-resolution process.\n\nIf the company fails to engage or provide a satisfactory payment plan, the matter will automatically proceed to full arbitration, where a binding ruling can be issued against the employer.\n\nFor AMH, this means increased legal pressure, potential financial penalties, and heightened scrutiny over its labour practices.Alpha Media officials were not immediately available for comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Disgraced Alpha Media Holdings chief executive Kenias Mafukidze woke up to poo on his office door as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/disgruntled-worker-defecates-on-ceos-doorstep-as-amh-salariess-woes-mount/\">Continue reading<span class=\"screen-reader-text\"> \"Disgruntled worker defecates on CEO’s doorstep as AMH salaries’s woes mount\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        },
        {
            "title": "Nash TV Shuts Down",
            "url": "https://www.zimeye.net/2025/12/10/nash-tv-shuts-down/",
            "content": "By A Correspondent  Nash TV, the entertainment powerhouse built by businessman Tinashe Mutarisi, has shut down, leaving many young musicians who depended on it for exposure and career development stranded.\n\nMutarisi recently announced the immediate closure of the channel, a move that stunned the creative sector and triggered an emotional outpouring from artists who credit Nash TV for launching their careers. The platform, which rose to prominence during the Covid-19 lockdowns, had reshaped Zimbabwes digital music landscape and produced several breakout stars.\n\nOne of its most prominent voices,Nisha Ts, struggled to contain her grief as she reflected on the shutdown.\n\nIts difficult to put into words what this moment feels like. The news of NashTVZimbabwes shutdown hit me with a mix of sadness, gratitude, and deep reflection, she wrote.\n\nThis wasnt just kubasa kwandiri  it introduced me to the world, believed in my voice, and shaped the artist I am today. Misodzi haisi kumira kwangova kumba.\n\nEvery milestone Ive reached carries your fingerprints. Hapataurwe zvaNisha pasinga taurwe zve Nash TV, pasinga taurwe zva Mr Tinashe Mutarisi.\n\nShe thanked the team for investing in her dreams, adding that the platforms impact would remain with her forever.\n\nMutarisi broke the news while travelling to a funeral in Masvingo, saying he had reached the end of his journey in entertainment.\n\nI believe Ive done my part in the entertainment space. We pushed as hard as we could, and Im proud of the impact we made, he said.\n\nBut now its time for a new chapter. My focus is shifting fully to entrepreneurship  building businesses and mentoring the next generation of Zimbabwean entrepreneurs.\n\nAnd just like that, Nash TV  the platform that brightened lockdown nights and became a factory of new stars  was gone. The farewell was short, sharp, and painful.\n\nSources say the closure had been brewing for months, with some pointing to Mutarisis appearance on theOllah 7 Podcastas an early signal. One insider described the interview as damage control dressed as content, crafted to provide Mutarisi with a soft landing.\n\nThe tone of that interview  emotional, apologetic, introspective  fuelled speculation. Instead of celebrating numbers and growth, he spoke of relationships, misunderstandings, and wounds.\n\nBarely an hour after the announcement, social media erupted.\n\nSome sympathised with Mutarisi:\n\nThey ate from his pocket then turned on him. He carried the industry for years, one promoter argued.\n\nOthers were harsh:\n\nNash Lockdown wasnt charity  it was brand propaganda, a former collaborator claimed. It was strategy.\n\nDebate persists:Was Nash TV a launchpad for artists  or a billboard for the boss?\n\nNash Holdings later released a terse one-page statement confirming the shutdown:\n\nNash Holdings announces the immediate shutdown of its entertainment operations under the NashTV brand.\n\nThe company insisted entertainment was never part of its long-term strategy but acknowledged that Nash TV transformed the music landscape during Covid-19 and helped raise artists such as Saintfloew, Nisha Ts, Raymer, and Ninety6.\n\nThe statement said all artists had been notified and assisted with transitions to new managers and studios.\n\nBehind the scenes, speculation continues  board pressure, financial strain, public backlash, or simply burnout. Whatever the real reason, insiders agree on one thing: Mutarisi has chosen peace over playlists.\n\nHe ended his message with a soft farewell:\n\nSpecial thank you to the NashTV team and followers  love you as always.\n\nMutarisi now plans to fully immerse himself in business, promising a Facebook Live session to explain the shutdown in detail.\n\nFor a man whose name became synonymous with Zimbabwes digital entertainment revolution, the closure is either his boldest move  or the clearest sign that the industrys storms took a toll.\n\nWhat is certain is that the curtain has fallen.Nash TV is no more.\n\nAnd the industry is left with unanswered questions  and, in Nisha Tss case, uncontrollable tears.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Nash TV, the entertainment powerhouse built by businessman Tinashe Mutarisi, has shut down, leaving many young … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/10/nash-tv-shuts-down/\">Continue reading<span class=\"screen-reader-text\"> \"Nash TV Shuts Down\"</span></a></p>",
            "time": "09:49",
            "date": "11 Dec 2025"
        }
    ]
}