{
    "news": [
        {
            "title": "Chirewa A Shooting Star…",
            "url": "https://www.zimeye.net/2025/03/26/chirewa-a-shooting-star/",
            "content": "By A Correspondent\n\nTawanda Chirewa emerged as the hero for Zimbabwe after scoring a last-gasp equaliser to secure a 1-1 draw for the Warriors against Nigerias Super Eagles in their 2026 FIFA World Cup Qualifiers Group C match in Uyo, Nigeria, on Tuesday.\n\nChirewa, who came on as a substitute in the final ten minutes, made an immediate impact, finding the back of the net in injury time to level the score. Earlier in the match, the Super Eagles had taken the lead through a header by Victor Osimhen in the 73rd minute, after a sustained period of pressure from the hosts.\n\nNigeria had dominated possession from the start, with Moses Simon and Osimhen creating early chances. However, Zimbabwes goalkeeper, Washington Arubi, was in fine form, making crucial saves to deny Nigeria the opening goal.\n\nThe Warriors largely relied on counter-attacks but were unable to threaten Nigerias goal during the first half. Despite creating multiple opportunities, Nigeria could not find a way through, and the first half ended goalless.\n\nThe second half saw Nigeria continue to press, firing shots from all angles, but Zimbabwe held firm until the 73rd minute. It was then that Osimhen broke the deadlock, heading in Simons cross to give the Super Eagles the lead.\n\nZimbabwe nearly responded immediately when Knowledge Musonas effort hit the crossbar just three minutes later. Terrence Dzvukamanja also had a chance but blasted his shot over the bar from the edge of the box.\n\nAs the match seemed to be slipping away from Zimbabwe, substitute Tawanda Maswanhise provided the assist for Chirewa, who calmly slotted home the equaliser in the dying seconds of the match, ensuring a dramatic 1-1 draw for the Warriors.\n\nWith the draw, Zimbabwe moved to four points in the group, while Nigeria remains on seven points. The match highlighted Chirewas potential and brought a sense of hope for Zimbabwes qualification campaign.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tawanda Chirewa emerged as the hero for Zimbabwe after scoring a last-gasp equaliser to secure a 1-1 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/chirewa-a-shooting-star/\">Continue reading<span class=\"screen-reader-text\"> \"Chirewa A Shooting Star…\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "Bafana Bafana Coach Fumes Over Bad Treatment",
            "url": "https://www.zimeye.net/2025/03/26/bafana-bafana-coach-fumes-over-bad-treatment/",
            "content": "Sports Correspondent\n\nBafana Bafana coach Hugo Broos was left visibly frustrated after his team was denied access to train at the Felix Houphouet Boigny Stadium in Abidjan, Ivory Coast, ahead of their crucial 2026 FIFA World Cup Qualifier Group C match against Benin. The match is set for Tuesday evening.\n\nThe South African team was blocked from using the stadium for a pre-match training session due to a scheduled game between Ivory Coast and Gambia on Monday night. The situation left Broos enraged, as he voiced his concerns during a press conference ahead of the game.\n\nFirst of all, I have to tell you that Im really not satisfied with the decision that we cant have a pre-match training in the stadium where the game takes place, Broos stated. I think this is a FIFA rule, that every team has the right to have a preliminary training before the game of 60 minutes in the stadium where you play, where the match takes place.\n\nThe coach further expressed his dissatisfaction, saying, Will that have an influence on the game? I dont know. But I know if, tomorrow after the game, Im not at the press conference, there will be a sanction, so we have to follow the rules, where are the rules now?\n\nBroos also pointed out the perceived unfairness in the situation, emphasizing that Benin, the opposition, had already trained at the stadium earlier due to their earlier arrival. You will tell me, Oh, its for both teams. I dont think so. I think Benin has already trained in that stadium because they were here sooner than we were.\n\nThe Bafana Bafana coach made it clear that he felt the situation was unfair, stating, So its all nice to say, Oh, follow the rules! Follow this! We have to follow everything, but we have the right to train in the stadium today where the match will take place, and we cant, and that is not honest and that is not correct.\n\nCurrently, Bafana Bafana are leading Group C with 10 points, while Benin sit in second place with 8 points.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Bafana Bafana coach Hugo Broos was left visibly frustrated after his team was denied access to train at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/bafana-bafana-coach-fumes-over-bad-treatment/\">Continue reading<span class=\"screen-reader-text\"> \"Bafana Bafana Coach Fumes Over Bad Treatment\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "Safety Tips For Pedestrians",
            "url": "https://www.zimeye.net/2025/03/26/safety-tips-for-pedestrians-2/",
            "content": "When walking along the road, it is crucial to prioritize your safety by always walking facing oncoming vehicles. By doing so, you enhance your ability to see approaching traffic and stay aware of your surroundings, relying on both your sight and hearing to assess potential dangers. This simple precaution allows you to step aside or into a safe area, such as a ditch, if a vehicle unexpectedly loses control.\n\nWalking with your back to traffic, on the other hand, puts you in a vulnerable position. In such a scenario, you would have to rely only on your ears to detect a vehicle approaching from behind, which can be risky. A driver may unintentionally hit you without you being aware of their presence, especially if they are speeding or driving too close to the edge of the road.\n\nAdditionally, to avoid the dangers of distracted walking, always keep your focus on the road ahead rather than on your mobile phone. While listening to music or podcasts can make your walk more enjoyable, it can be risky if it prevents you from hearing nearby vehicles. A simple solution is to keep one earphone out, ensuring you can still listen for approaching cars while enjoying your walk.\n\nWhile walking facing oncoming traffic is generally the safest option, its important to note that some areas, such as hills or sharp curves, may make this practice dangerous. In such areas, visibility is limited, and both you and oncoming vehicles may not see each other until its too late. In these situations, walking on the opposite side of the road might be the safer choice.\n\nBy staying alert, walking facing traffic, and avoiding distractions, you can significantly reduce the risk of accidents and ensure a safer walking experience.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When walking along the road, it is crucial to prioritize your safety by always walking facing oncoming vehicles. By doing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/safety-tips-for-pedestrians-2/\">Continue reading<span class=\"screen-reader-text\"> \"Safety Tips For Pedestrians\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "Zanu PF Bigwigs Jostle For Vacant Gutu East Seat…",
            "url": "https://www.zimeye.net/2025/03/26/zanu-pf-bigwigs-jostle-for-vacant-gutu-east-seat/",
            "content": "Tinashe Sambiri\n\nZanu PF bigwigs are already vying for the vacant Gutu East seat, barely 24 hours after MP Benjamin Ganyiwas expulsion from Parliament.\n\nThis development comes amid allegations of Ganyiwa fanning factionalism within the party and holding unsanctioned meetings.\n\nAccording to Deputy Speaker of Parliament Tsitsi Gezi, I have to inform the House that on 17th March, 2025, I was notified by the Zimbabwe African Union Patriotic Front (ZANU PF) Party that Hon. Benjamin Ganyiwa, Member of Parliament for Gutu East Constituency, had ceased to be a member of the ZANU PF Party and no longer represents the interests of the Party in Parliament.\n\nGezi further stated that Ganyiwas seat is now officially vacant, citing Section 129(1)(k) of the Constitution of Zimbabwe.\n\nIn this regard, a vacancy has arisen in Gutu East Constituency by operation of the law. The necessary administrative measures will be taken to inform the President and the Zimbabwe Electoral Commission (ZEC) of the existence of the vacancy in line with section 39 (1) of the Electoral Act [Chapter 2:13].\n\nThe expulsion of Ganyiwa marks another chapter in the ongoing political infighting within Zimbabwes ruling party.\n\nWith his removal from Parliament, Zanu PF now faces the challenge of filling the vacant seat in Gutu East, which may lead to a by-election as stipulated by the Electoral Act.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Zanu PF bigwigs are already vying for the vacant Gutu East seat, barely 24 hours after MP Benjamin … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/zanu-pf-bigwigs-jostle-for-vacant-gutu-east-seat/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Bigwigs Jostle For Vacant Gutu East Seat…\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "Mnangagwa Regime Totally Betrays Impressive Warriors",
            "url": "https://www.zimeye.net/2025/03/26/mnangagwa-regime-totally-betrays-impressive-warriors/",
            "content": "By A Correspondent\n\nThe Zimbabwe national soccer team, known as the Warriors, has been left to navigate a harsh realityplaying their home matches outside the country due to the unavailability of standard stadiums in Zimbabwe.\n\nDespite their impressive performances, the Warriors have been forced to play on foreign soil as stadiums in the country fail to meet international standards required for competitive matches.\n\nThe lack of proper infrastructure has been a constant setback for the team, preventing them from playing at home in front of their passionate supporters.\n\nYet, the Warriors have managed to defy the odds, posting remarkable results even when playing away from home.\n\nTheir resilience has been on full display, with yesterdays 1-1 draw against Nigeria showcasing their determination and skill.\n\nTawanda Chirewas crucial equalizer in the game against Nigeria has earned him praise, with many fans and commentators hailing him as one of the teams heroes.\n\nThese are Zimbabwe Heroes , a fan remarked on social media following the game, highlighting the Warriors perseverance despite the adverse circumstances.\n\nThe teams performance continues to shine through despite the lack of a proper home stadium, proving that talent can thrive even in less-than-ideal conditions.\n\nHowever, the absence of a suitable stadium raises the question: what could the Warriors achieve if they had the proper facilities?\n\nThe frustration among Zimbabwean football fans and players is palpable, with many pointing to the poor governance and corruption within the Zanu PF regime, which has failed to prioritize investment in sports infrastructure.\n\nThe looting of resources and neglect of key sectors, including sports, has left the countrys football facilities in disarray.\n\nIn addition to the Nigeria draw, the Warriors also managed a 2-2 draw against Benin in South Africa, further solidifying their reputation as a formidable team on the continental stage.\n\nThese results have not gone unnoticed, as Zimbabwe has qualified for the 2025 Africa Cup of Nations (AFCON) tournament in Morocco, marking a significant achievement for the national team.\n\nThe Warriors qualification for AFCON, despite the lack of proper home facilities, is a testament to the players talent, determination, and resilience. What if we had our own stadium? one fan asked, pondering the potential of the team if the necessary infrastructure were in place.\n\nThe question remains: when will the Zimbabwean government recognize the value of investing in sports and provide the Warriors with the stadiums they deserve?\n\nUntil that time comes, the Warriors will continue to fight on, representing Zimbabwe with pride and determination on international turf, even as the Mnangagwa regime fails to support them with the resources they need to succeed at home.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe national soccer team, known as the Warriors, has been left to navigate a harsh reality—playing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/mnangagwa-regime-totally-betrays-impressive-warriors/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Totally Betrays Impressive Warriors\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "Geza Unstoppable…",
            "url": "https://www.zimeye.net/2025/03/26/geza-unstoppable/",
            "content": "By A Correspondent\n\nHard-pressed Zimbabweans have rallied behind war veteran Blessed Geza, declaring that the Geza wave is unstoppable as he intensifies his challenge against President Emmerson Mnangagwas leadership.\n\nGeza, who has been an outspoken critic of the current government, has called on Mnangagwa to resign immediately, citing his governments failure to improve the countrys economic situation.\n\nIn a bold statement last week, Geza called for a mass anti-Mnangagwa protest scheduled for March 31, 2025.\n\nGezas growing influence and his public call for action have resonated with many Zimbabweans who are dissatisfied with the governments economic policies and handling of national issues.\n\nSpeaking on his plans for the upcoming protests, Geza firmly stated: President Mnangagwa has failed, and the time for change is now. I am calling on all Zimbabweans to join us in demanding accountability.\n\nThe economic hardships are too much to bear, and we will no longer stay silent.\n\nAs Gezas call for protests gains momentum, Zanu PF has moved to downplay the significance of the protests. Taurai Kandishaya, a Zanu PF youth league official, attempted to deflate the threat posed by Gezas planned demonstrations.\n\nGeza will be marching online, Zoom Demo. Saka iwewe washinga here kuuya panyama? Wadii wangoitawo Zoom Demo nhai shamwari? he quipped, dismissing the protests as an online event that wouldnt have a real-world impact.\n\nHowever, Kandishayas dismissal has not stopped the growing wave of support for Gezas cause.\n\nMany Zimbabweans, particularly those suffering under the current economic conditions, have pledged their support.\n\nTaurai Garwe, a local activist, declared: Tosangana mumastreet d*ko iwe Ed must go newe wacho, meaning that they will take to the streets to demand Mnangagwas resignation.\n\nOther citizens have also voiced their frustrations. A commenter identified as De Klerk added, Even ku Mozambique leadership yanga isipo. General Tongo was in Mozambique, referencing the challenges of leadership and governance within Zimbabwe and the region. Another individual, Shoko, expressed: Tichangomacha hazvititadzisi nhamo. Yakanyanya munyika vanodya vashoma, highlighting the extreme hardships that ordinary Zimbabweans are facing, with a small elite benefitting while the majority suffer.\n\nGezas call for protest is shaping up to be a significant moment in Zimbabwes political landscape, with mounting frustration among the populace against the governments inability to address the countrys economic woes.\n\nThe stage is set for March 31 to reveal whether this movement will gain substantial traction on the streets of Zimbabwe or whether Zanu PF will manage to quell the wave of discontent.\n\nTosangana nhasi manheru na 2030. Ivai nezuva rakanaka. Ndichakuisirai Link manje manje.pic.twitter.com/77Q9ImGMR5\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Hard-pressed Zimbabweans have rallied behind war veteran Blessed Geza, declaring that the “Geza wave” is unstoppable as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/geza-unstoppable/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Unstoppable…\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "We Are Unstoppable, Mnangagwa Declares…",
            "url": "https://www.zimeye.net/2025/03/26/we-are-unstoppable-mnangagwa-declares/",
            "content": "By A Correspondent\n\nIn a bold declaration of strength, President Emmerson Mnangagwa, speaking at the 382nd Ordinary Session of the Politburo in Harare on Wednesday, reaffirmed ZANU PFs unshakable position, calling the party an unstoppable force.\n\nWe must take the lead in addressing the challenges faced by our people, Mnangagwa told the gathering.\n\nOur Party structures need to provide strong leadership, focusing on the issues that impact our citizens.\n\nAs ZANU PF, we have a clear vision and are committed to delivering on our programs. We have overcome disruptive elements that seek to hinder our progress.\n\nZANU PF is an unstoppable force, like an unstoppable train.\n\nThe declaration comes amid increasing political tension, particularly in light of recent calls for Mnangagwas resignation.\n\nWar veteran Blessed Geza has publicly demanded that Mnangagwa step down immediately, further escalating the pressure on the President.\n\nAdding to the political unrest, there are also protests scheduled for March 31, aimed at opposing Mnangagwas bid to extend his presidency beyond the constitutional limits.\n\nThese developments underscore the political challenges faced by the president and his party, even as Mnangagwa maintains a firm stance on the partys resilience and commitment to its goals.\n\nDespite these challenges, Mnangagwas speech at the Politburo reflects his unwavering confidence in ZANU PFs ability to push through any opposition. The presidents characterization of the party as an unstoppable train is seen as a rallying cry to strengthen the partys resolve in the face of growing dissent and pressure from opposition groups.\n\nAs the political landscape continues to evolve in Zimbabwe, all eyes will remain on ZANU PF and its leadership, with many questioning whether Mnangagwas assertion of invincibility can withstand the mounting internal and external challenges facing the party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold declaration of strength, President Emmerson Mnangagwa, speaking at the 382nd Ordinary Session of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/we-are-unstoppable-mnangagwa-declares/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Unstoppable, Mnangagwa Declares…\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "JUST IN: Geza In 2030 Date",
            "url": "https://www.zimeye.net/2025/03/26/just-in-geza-in-2030-date/",
            "content": "By A Correspondent| Firebrand former Zanu PF Central Committee member Blessed Geza has announced that he will deliver a special message to Zimbabweans on Wednesday night at 2030hours.\n\nThis follows the demotion of Army Commander Anselem Sanyatwe who was deployed to the Ministry of Sports, Arts and Culture replacing Kirsty Coventry who has taken up the Presidency of the International Olympics Committee.\n\nMany speculate that Sanyatwes demotion is part of President Emmerson Mnangagwas move to decimate and weaken his opponent and Vice President Constantino Chiwenga by tempering with his power base.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Firebrand former Zanu PF Central Committee member Blessed Geza has announced that he will deliver a special … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/just-in-geza-in-2030-date/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Geza In 2030 Date\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "Tungwarara Attacks Geza As Zanu PF Heavyweights Sweat Over Protests",
            "url": "https://www.zimeye.net/2025/03/26/tungwarara-attacks-geza-as-zanu-pf-heavyweights-sweat-over-protests/",
            "content": "By A Correspondent\n\nIn a heated exchange this week, Paul Tungwarara, President Emmerson Mnangagwas presidential investment advisor, lashed out at war veteran Blessed Geza and his supporters, defending the Presidents leadership and dismissing their online criticism as ineffective.\n\nTungwararas comments come amid rising discontent within certain factions of the Zimbabwean political landscape, with protests and calls for the Presidents resignation growing louder.\n\nTungwarara, speaking to reporters earlier this week, vehemently asserted that President Mnangagwa was delivering on his promises, contrary to the claims made by critics like Geza. We are walking the talk while some are busy making noise on social media, Tungwarara said. He accused Geza and others of relying on digital platforms to undermine the Presidents efforts, rather than engaging in meaningful, real-world change.\n\nThey are good at using WhatsApp and online activism to criticize President Mnangagwa, who is busy working on the ground to improve peoples lives, Tungwarara added.\n\nHis comments reflect the growing frustration within Zanu PF over the persistent online activism and the criticism that has surfaced in recent months, especially as some of the partys heavyweights struggle to manage the rising protests.\n\nMeanwhile, Blessed Geza, a prominent war veteran, has been vocal in his criticism of Mnangagwas leadership. Just days before Tungwararas comments, Geza made a public call for President Mnangagwa to resign, citing the governments failure to deliver on its promises and address the countrys economic challenges. Geza accused the President of not fulfilling his obligations to the people of Zimbabwe, arguing that his continued rule is detrimental to the nations future.\n\nMnangagwa has failed; he must resign, Geza stated in his address to the nation. The call has amplified tensions within the political elite, particularly as protests have intensified both in Zimbabwe and among the Zimbabwean diaspora in South Africa, where Geza has been active.\n\nThe exchange between Tungwarara and Geza is a microcosm of the mounting internal pressure within the ruling Zanu PF party. As protests over economic issues and governance grow, heavyweights within the party are facing increasing difficulty in balancing their allegiance to the President with the rising dissatisfaction among citizens.\n\nWhile Tungwarara defends Mnangagwas administration, the political climate suggests that divisions within Zanu PF are becoming harder to ignore, and the calls for reform, or even resignation, are likely to escalate in the coming months.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a heated exchange this week, Paul Tungwarara, President Emmerson Mnangagwa’s presidential investment advisor, lashed out at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/tungwarara-attacks-geza-as-zanu-pf-heavyweights-sweat-over-protests/\">Continue reading<span class=\"screen-reader-text\"> \"Tungwarara Attacks Geza As Zanu PF Heavyweights Sweat Over Protests\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        },
        {
            "title": "Kwekwe Businessman, Chivhayo’s Runner In Bid To Illegally Seize Control of Mining Firm",
            "url": "https://www.zimeye.net/2025/03/26/kwekwe-businessman-chivhayos-runner-in-bid-to-illegally-seize-control-of-mining-firm/",
            "content": "By A Correspondent Zimasco (Pvt) Ltd has gone to court to block attempts by a Kwekwe-based businessman Shepard Tundiya, through his company Avim Investments (Pvt) Ltd to seize control of the mining company.\n\nThis follows a recent High Court order which Avim lnvestments Pvt secured to take over the prominent mining and chromite ore smelting company.\n\nThe order in question, issued by Justice Mambara, was allegedly directed not at Zimasco (Pvt) Ltd but a completely unrelated and non-registered entity, Sinosteel Zimasco (Pvt) Ltd, as confirmed by a company registry search.\n\nDespite this discrepancy, Tundiya, in collaboration with Harare lawyer Wilson Manase and controversial dealer Wicknell Chivhayos runner, Denny Marandure, allegedly attempted on March 17, to gain control of Zimascos bank accounts at Ecobank by instructing the bank to alter the account signatories in their favour.\n\nEcobank, however, declined to comply, asserting that the court order did not pertain to Zimasco (Pvt) Ltd.\n\nFurthermore, the order had not been served on Zimasco Pvt Ltd but was instead presented directly to the bank.\n\nFollowing the failed attempt at the bank, the individuals visited Zimasco (Pvt) Ltds head office, claiming authority to take over the companys management under the purported court order.\n\nZimasco Pvt Ltd management contends the order was against Sinosteel Zimasco (Pvt) Ltd, not Zimasco (Pvt) Ltd and rejected their actions.\n\nAvim Investments, with the assistance of Kwande Legal Practitioners, later filed an application to correct the court order, to show that Sinosteel Zimasco (Pvt) Ltd was operating as Zimasco (Pvt) Ltd.\n\nThis application was heard by Justice Mambara, who granted the order within just three hourswithout serving it on Zimasco (Pvt) Ltd, an interested party, company sources said.The company said it was never notified, even though it was an affected party.Neither Zimasco nor Ecobank were served.\n\nArmed with the modified court order, Manase and his associates renewed their attempt to gain control of Zimascos accounts. Ecobank again refused to comply, maintaining that the corporate rescue order applied to Sinosteel Zimasco (Pvt) Ltd, not Zimasco (Pvt).\n\nIn response, Zimasco (Pvt) Ltd has urgently filed a High Court application to block the court order.\n\nThe company has also lodged formal complaints with the Judicial Service Commission regarding Justice Mambaras handling of the matter and with the Law Society of Zimbabwe against Manase & Manase and Kwande Legal Practitioners for alleged unethical conduct.\n\nSources say the Chinese embassy in Harare has expressed strong concern over the attempt to seize control of Zimasco (Pvt) Ltd, a key Chinese government investment. The Embassy wants the Government of Zimbabwe to protect the investment, in accordance with the Bilateral Investment Protection and Promotion Agreement between China and Zimbabwe, a source said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimasco (Pvt) Ltd has gone to court to block attempts by a Kwekwe-based businessman Shepard Tundiya, through … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/26/kwekwe-businessman-chivhayos-runner-in-bid-to-illegally-seize-control-of-mining-firm/\">Continue reading<span class=\"screen-reader-text\"> \"Kwekwe Businessman, Chivhayo’s Runner In Bid To Illegally Seize Control of Mining Firm\"</span></a></p>",
            "time": "21:27",
            "date": "26 Mar 2025"
        }
    ]
}