{
    "news": [
        {
            "title": "Marinica Cites Lack of Work Ethic as Warriors Fall 3–1 to Algeria",
            "url": "https://www.zimeye.net/2025/11/14/marinica-cites-lack-of-work-ethic-as-warriors-fall-3-1-to-algeria/",
            "content": "Sports Correspondent  Zimbabwe Warriors coach Marian Marinica has admitted his side did not give their best in their recent friendly against Algeria, which ended in a 31 defeat.\n\nThe game marked a challenging start to Marinicas tenure as national team coach, with all three goals conceded in the first half as Algeria controlled the match from the outset.\n\nI think our work ethic wasnt there in the first half. I dont think my players worked hard enough in the way I expect, Marinica said after the match.\n\nDespite missing several senior players, Algeria proved a tough opponent. They had many senior players absent, but they still had a very good team, coach and personnel, the Zimbabwean coach added.\n\nAlgerias goals came from Baghdad Bounedjah, Mohamed Amoura, and Jaouen Hadjam, while Zimbabwes sole goal arrived late in the 86th minute via a penalty converted by Tawanda Chirewa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Zimbabwe Warriors coach Marian Marinica has admitted his side did not give their best in their recent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/marinica-cites-lack-of-work-ethic-as-warriors-fall-3-1-to-algeria/\">Continue reading<span class=\"screen-reader-text\"> \"Marinica Cites Lack of Work Ethic as Warriors Fall 3–1 to Algeria\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Rainy Season Claims Nine Lives as Storms Wreak Havoc Across Zimbabwe",
            "url": "https://www.zimeye.net/2025/11/14/rainy-season-claims-nine-lives-as-storms-wreak-havoc-across-zimbabwe/",
            "content": "By A Correspondent  Zimbabwes rainy season has so far claimed nine lives and caused widespread destruction, according to the Department of Civil Protection (DCP).\n\nAs of November 7, the disaster management team has documented the impact of severe weather on 43 households, 10 schools, and significant infrastructure across several provinces.\n\nIn an interview with State media, DCP Chief Director Mr Nathan Nkomo provided details of the fatalities and damage. In Chirumanzu District, a child died when a house collapsed during a storm on November 2.\n\nThe storm, accompanied by strong winds, caused severe damage in Wards 4, 15 and 19. Eight households were severely affected and are in urgent need of assistance. Sadly, in Village 16 of Ward 4, one child died after a house collapsed due to the heavy storm, Mr Nkomo said.\n\nOn the same day in Silobela, Kwekwe District, eight miners tragically lost their lives after being trapped underground due to flooding.\n\nIn the Midlands Province, the Dadaya Training Centre suffered major storm damage. Most classroom roofs, teacher cottages, power lines, and other infrastructure were affected. Fortunately, there were no recorded fatalities or injuries, Mr Nkomo noted.\n\nChirumanzu also saw the destruction of several homes, leaving eight families homeless. Moffat Primary School and Musena Secondary School sustained structural damage, including the roof of a two-classroom block being blown off, but no casualties were reported.\n\nIn Matabeleland South, the District Civil Protection Committee provided temporary shelter for displaced families. Area legislator Cde Fisani Moyo pledged US$200 worth of groceries and accommodation for those affected. On November 5, five families in Gwanda Urban were left homeless after their dwellings roof was blown off.\n\nStorms have also heavily damaged educational infrastructure across the country. The Makwe Irrigation Scheme in Gwanda District suffered hail damage on September 29, while Bengo Secondary School lost parts of its roof on October 27. In Masvingo, windstorms on October 27 destroyed seven out of nine roofs at Njovho Primary School, affecting 1,206 learners and numerous teachers.\n\nThe Ministry of Primary and Secondary Education is assessing damage and coordinating emergency repairs. Mr Nkomo stressed the urgency of addressing the destruction: We need adequate resourcestents, food and non-food items. The urgent release of funds by Treasury is critical for disaster preparedness and recovery.\n\nEfforts are ongoing to support affected communities, with tarpaulin tents and 150kg of rice already dispatched to assist eight households in Chirumanzu District.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe’s rainy season has so far claimed nine lives and caused widespread destruction, according to the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/rainy-season-claims-nine-lives-as-storms-wreak-havoc-across-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Rainy Season Claims Nine Lives as Storms Wreak Havoc Across Zimbabwe\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "King Munhumutapa Jailed For Undermining Mnangagwa Authority",
            "url": "https://www.zimeye.net/2025/11/14/king-munhumutapa-jailed-for-undermining-mnangagwa-authority/",
            "content": "Tinashe Sambiri  Timothy Chiminya (58), who has long referred to himself as King Munhumutapa, has been jailed for eight months after the Harare Magistrates Court found him guilty of undermining the authority of President Emmerson Mnangagwa.\n\nAccording to the court, Chiminya spent several years  from 2019 to 2024  attempting to override and interfere with the official appointment of Chief Nyakunhuwa. Despite continuous Government warnings instructing him to stop presenting himself as a parallel authority, he persisted, leading the State to treat his conduct as a direct defiance of presidential powers.\n\nMagistrates imposed a 10-month custodial sentence, with two months suspended on condition of good behaviour, leaving Chiminya to serve an effective eight months.\n\nThe case comes at a time when President Mnangagwa has increasingly associated himself with the historical Munhumutapa legacy. His birthday has already been rebranded as Munhumutapa Day, with critics suggesting the State is tightening control over cultural and historical narratives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Timothy Chiminya (58), who has long referred to himself as “King Munhumutapa,” has been jailed for eight … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/king-munhumutapa-jailed-for-undermining-mnangagwa-authority/\">Continue reading<span class=\"screen-reader-text\"> \"King Munhumutapa Jailed For Undermining Mnangagwa Authority\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Government To Increase ZiG Circulation But Is This The Solution To Economic Crisis?",
            "url": "https://www.zimeye.net/2025/11/14/government-to-increase-zig-circulation-but-is-this-the-solution-to-economic-crisis/",
            "content": "Tinashe Sambiri  Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has revealed that government will increase the circulation of ZiG banknotes in the coming months, saying this is part of efforts to ease ongoing cash shortages.\n\nSpeaking to State media this week, Professor Ncube said, More ZiG cash will be rolled out in the coming months. The aim is to ease shortages and improve public access to the local currency.\n\nHe acknowledged the growing frustration among the public over the limited availability of physical ZiG notes, adding, We are increasing ZiG cash availability to ensure people can transact smoothly.\n\nGovernment introduced the gold-backed ZiG currency in April last year to replace the inflation-battered Zimbabwe dollar. While authorities maintain that the ZiG is stable and supported by solid reserves, the public remains doubtful, citing persistent economic volatility.\n\nEconomists and ordinary citizens alike argue that increasing cash in circulation does not address deeper structural issues such as poor confidence in the local currency, unpredictable pricing, and widespread reliance on the US dollar.\n\nOne economist, speaking on condition of anonymity, remarked, You can print more notes, but that alone will not fix the underlying crisis.\n\nAs government prepares to pump more ZiG notes into the economy, many Zimbabweans are left questioning whether this approach will bring meaningful relief or simply delay the need for more substantive and long-term economic reforms.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has revealed that government will increase the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/government-to-increase-zig-circulation-but-is-this-the-solution-to-economic-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Government To Increase ZiG Circulation But Is This The Solution To Economic Crisis?\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Watch: Zanu PF Captures Ngwere Diki in Latest Publicity Stunt",
            "url": "https://www.zimeye.net/2025/11/14/watch-zanu-pf-captures-ngwere-diki-in-latest-publicity-stunt/",
            "content": "Tinashe Sambiri  Young Zimdancehall artist Ngwere Diki performed at a Zanu PF Inter-District meeting at Gwanzura Stadium in Harare on Thursday in what many critics say was a carefully staged display of political co-option.\n\nRecently, controversial businessman and Zanu PF Central Committee member Kudakwashe Tagwirei gave Ngwere Diki a scholarship and construction materials.\n\nOn Thursday, Tagwirei went further, publicly donating US$200,000, 80 boreholes, and 12,500 food hampers in Harares Zone 2moves seen by some observers as blatant vote-buying and self-promotion ahead of elections.\n\nIn addition to these largesse displays, Tagwirei funded the construction of:\n\nWhile footage shows Ngwere Diki sharing lighter moments with Tagwirei, with captions joking, nhamo yaNgwere Diki yakatopera! critics argue the performance and public fanfare underscore a troubling trend of musicians being used to lend legitimacy to political elites.\n\nSocial media commentators quickly criticised the spectacle. One user asked pointedly, Chii chakadaro? highlighting public disapproval of celebrities being drawn into political machinery in exchange for material rewards.\n\nObservers say the event reflects a deeper problem in Zimbabwe: political influence masquerading as philanthropy, with artists and ordinary citizens alike caught in a system designed to reward loyalty to the ruling party rather than merit or need.\n\nNgwere Diki shares lighter moments with Dr Kuda Tagwirei, popularly known as Nhamoyapera  truly, nhamo yaNgwere Diki yakatopera! Iwe wosvora ?pic.twitter.com/7Ga549Tegq\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Young Zimdancehall artist Ngwere Diki performed at a Zanu PF Inter-District meeting at Gwanzura Stadium in Harare … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/watch-zanu-pf-captures-ngwere-diki-in-latest-publicity-stunt/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Zanu PF Captures Ngwere Diki in Latest Publicity Stunt\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Tagwirei Declares Tenders Belong to ‘Zanu PF Children’",
            "url": "https://www.zimeye.net/2025/11/14/tagwirei-declares-tenders-belong-to-zanu-pf-children/",
            "content": "Tinashe Sambiri  Controversial Zanu PF businessman and Central Committee member Kudakwashe Tagwirei has sparked outrage after openly declaring that government tenders should primarily benefit ruling party supporters, whom he described as Zanu PF children.\n\nSpeaking at a Zanu PF Inter-District meeting held on Thursday at Gwanzura Stadium in Highfield, Tagwirei announced a series of highly politicised donations, including US$200,000 pumped into the Presidential Empowerment Revolving Fund. The money will be shared among the Main Wing, War Veterans, Youth League, and Womens League, each receiving US$50,000.\n\nIn a move critics say is designed to entrench Zanu PF patronage, Tagwirei also pledged to finance the construction of five clinics in Harares Zone 2, drill 80 boreholes, and push party members to register companies with PRAZ so they can access state tenders.\n\nTagwirei made his intentions clear, saying:Zanu PF children must benefit from national programmes; we are saying Zanu PF is for everyone.\n\nObservers say the statement exposes long-standing accusations that public resources are distributed on the basis of political loyalty rather than national interest. Community members also warned that such partisan control over tenders and basic services deepens inequality and erodes trust in public institutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Controversial Zanu PF businessman and Central Committee member Kudakwashe Tagwirei has sparked outrage after openly declaring that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/tagwirei-declares-tenders-belong-to-zanu-pf-children/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Declares Tenders Belong to ‘Zanu PF Children’\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Zambians React To HH–Mnangagwa Harare Meeting",
            "url": "https://www.zimeye.net/2025/11/14/zambians-react-to-hh-mnangagwa-harare-meeting/",
            "content": " BREAKING NEWS | ZAMBIANS REACT TO HHMNANGAGWA HARARE MEETING\n\n14 November 2025\n\nZambias social media platforms erupted this morning with a flood of reactionsranging from excitement and hope to sarcasm and suspicionafter President Hakainde Hichilema met Zimbabwean President Emmerson Mnangagwa in Harare, where the two countries signed five Memoranda of Understanding covering diplomacy, immigration, labour, agriculture, and youth development.\n\nThe Ministry of Information and Media  Zambia posted the announcement on Facebook, triggering hundreds of comments within minutes.\n\n Public Reaction: Warmth, Caution, and Political Jabs\n\nWhile many citizens welcomed the renewed cooperation between the two neighbours, others expressed scepticismparticularly over Mnangagwas political legacy and Zimbabwes governance record.\n\n Calls for Easier Movement Across Borders\n\nSeveral Zambians immediately demanded practical outcomes from the MoUs, especially relating to cross-border travel:\n\n Enthusiastic Supporters Praise HH\n\nSupport for President Hichilema was strong in the comments:\n\nMany described the engagement as overdue and necessary for regional unity.\n\n Mixed Feelings About President Mnangagwa\n\nSome Zambians expressed open distrust of Mnangagwa, often nicknamed the Croc:\n\nDespite this scepticism, others showed respect:\n\n Opposition Figures Mocked for Silence\n\nA recurring theme was the absence of criticism from notable opposition figures:\n\n Frustration With Neglected Mega-Projects\n\nOne user pointedly asked:\n\nSignalling concern that regional cooperation must also revive delayed infrastructure deals.\n\n Mood Summary: Optimism Edged With Regional Realism\n\nAcross platforms, the dominant tone was largely positive, viewing the meeting as a step toward regional peace, trade expansion, and people-to-people integration.\n\nYet the comments also show:\n\nOne user summed up the broader sentiment:\n\nDealing with facts and not sentiments this is progress.\n\n Conclusion\n\nZambias public reaction to todays meeting underscores a population that wants closer regional cooperationbut remains sharply alert to political histories, leadership styles, and the need for tangible results.\n\nAs the signed MoUs move toward implementation, the spotlight now shifts to whether the agreements will produce real change in immigration, agriculture, labour opportunities, and youth development across both nations.\n\nStory developing\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "🔴 BREAKING NEWS | ZAMBIANS REACT TO HH–MNANGAGWA HARARE MEETING 14 November 2025 Zambia’s social media platforms erupted this morning … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/zambians-react-to-hh-mnangagwa-harare-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Zambians React To HH–Mnangagwa Harare Meeting\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Chivayo Uses Hichilema Photo Op to Boost Tarnished Reputation",
            "url": "https://www.zimeye.net/2025/11/14/chivayo-uses-hichilema-photo-op-to-boost-tarnished-reputation/",
            "content": "Tinashe Sambiri  Controversial Zimbabwean businessman and Zanu PF-linked tenderpreneur Wicknell Chivayo on Thursday drew attention on social media after posting about his meeting with Zambian President Hakainde Hichilema at the State House in Lusaka.\n\nChivayo took to Facebook to post a lengthy statement filled with self-congratulatory remarks, in which he described himself as deeply HONOURED to meet Hichilema. He gushed about the Zambian leader, calling him an accomplished BUSINESSMAN, a Pan-Africanist, a sharp-minded ECONOMIC REFORMER and a very HUMBLE man with a passion to always serve the Nation and People of ZAMBIA.\n\nIn what appeared to be an attempt to elevate his own profile, Chivayo elaborated on the discussion he claimed to have had with Hichilema. He said the two spoke about the TIMELESS BOND between Zambia and Zimbabwe, the Siamese twin Nations whose destinies have been intertwined by both geography of the ZAMBEZI RIVER and history of the LIBERATION STRUGGLE. Chivayo further asserted that Hichilema spoke GLOWINGLY of how our founding fathers envisioned a UNITED Southern Africa, while Chivayo himself seemed to bask in reflected glory from the conversation.\n\nHe also claimed to have discussed Zambias energy challenges, writing: I was however thoroughly IMPRESSED by President Hichilemas appreciation of RENEWABLE ENERGY project funding models and his commitment to PARTNER with the private sector in order to URGENTLY address Zambias energy crisis. Beyond energy, Chivayo said he COMMENDED His Excellency for the bold economic reforms his Government has implemented during their FIRST term of office, praising Hichilemas efforts to enhance governance, fiscal discipline, and combat corruption.\n\nWhile Chivayos post focused heavily on his own presence at State House, it unintentionally highlighted the contrast between his self-promotional tone and Hichilemas record. Hichilema, widely respected for restoring investor confidence and growing Zambias GDP, has earned a reputation as a leader committed to transparency and effective governance.\n\nChivayo concluded his post with more self-aggrandisement, stating: MR PRESIDENT, thank you for HONOURING me with your time in between your very BUSY schedule. I am deeply inspired and IMPRESSED by your vision for ONE ZAMBIA, ONE NATION.\n\nObservers on social media were quick to note the irony of Chivayo, a businessman mired in controversy, publicly elevating a leader whose achievements are widely acknowledged across the continent. While Hichilemas leadership has drawn praise for substance and results, Chivayos post was seen by many as another exercise in self-promotion rather than genuine diplomacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Controversial Zimbabwean businessman and Zanu PF-linked tenderpreneur Wicknell Chivayo on Thursday drew attention on social media after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/chivayo-uses-hichilema-photo-op-to-boost-tarnished-reputation/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Uses Hichilema Photo Op to Boost Tarnished Reputation\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Mnangagwa Tells HH, “Whites Are Very Easy To Chase Out!”",
            "url": "https://www.zimeye.net/2025/11/14/mnangagwa-tells-hh-whites-are-very-easy-to-chase-out/",
            "content": "video loading below\n\nZAMBIA  ZIMBABWE BI NATIONAL COMMISSIONhttps://t.co/4AbYXsPlca\n\nWhites are very easy to chase away, Mnangagwa says during his speech addressing@HHichilemaSo, the revolution was fought in many ways, adds Mnangagwahttps://t.co/An152gC5hr\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "06:09",
            "date": "15 Nov 2025"
        },
        {
            "title": "Three Top Masvingo ZANU PF Leaders Chopped for Resisting ED2030",
            "url": "https://www.zimeye.net/2025/11/14/three-top-masvingo-zanu-pf-leaders-chopped-for-resisting-ed2030/",
            "content": "By A Correspondent Three senior ZANU PF District Coordinating Committee (DCC) chairpersons in Masvingo are reportedly facing expulsion as the province intensifies a purge widely seen as part of President Emmerson Mnangagwas push to crush dissent against the emergingED2030agenda. The disciplinary sweeptargeting officials believed to be sympathetic to Vice President Constantino Chiwengahas heightened tensions in a province long regarded as a key battleground in the partys simmering succession war.\n\nThose said to be in the firing line include Zaka DCC chair Clemence Chiduwa, Masvingo District chair Tawanda Dube and Bikitas Chamunorwa Taruona. Their fate follows the recent suspension of Chivi DCC chair Samuel Magonde, who was issued with a prohibition order. While provincial chair Robson Mavhenyengwa confirmed Magondes suspension, he denied claims that more chairpersons were being targeted.\n\nInsiders, however, insist the crisis is broader. They say all four officials travelled to ZANU PF Headquarters in Harare to protest the controversial co-option of central committee members in Chivi and Bikitaan act the provincial leadership viewed as a serious breach of party protocol. Sources add that the officials believed they had been promised access to vehicles similar to those allegedly distributed to central committee members through businessmen Kudakwashe Tagwirei and Paul Tungwarara. When the promises failed to materialise, tensions escalated sharply.\n\nThe turmoil in Masvingo mirrors a wider national confrontation between Mnangagwas loyalistswho are increasingly pushing to extend the Presidents rule beyond the 2028 constitutional limitand Chiwengas faction, which insists the 2017 coup agreement guaranteed the Vice President the presidency after Mnangagwas two terms. Since 2021, Mnangagwas camp has tightened control of provincial executives, youth and womens leagues and central committee placements, systematically eroding Chiwengas influence.\n\nMasvingo, a stronghold of military-linked heavyweights and long associated with Chiwenga loyalists, has become a flashpoint. The targeted purges of DCC leaders are therefore widely interpreted as part of a calculated effort to dismantle Chiwengas grassroots networks ahead of the crucial 2027 ZANU PF elective congress.\n\nAddressing the Provincial Executive Committee (PEC) at Masvingo Polytechnic on October 31, Mavhenyengwa acknowledged deepening fractures within the party.\n\nPreviously I had seen as if the party was united, but now some divisions and groupings are emerging, he said. He cautioned that since no elections were pending, any form of factional mobilisation was unnecessary and dangerous.\n\nHe urged unity and cited his improved relationship with Provincial Affairs Minister Ezra Chadzamirahis former rival for the provincial chairmanshipas an example of how leaders should move past political battles. He also warned DCC leaders against aligning themselves with individuals rather than the collective:The DCC chairperson is for everyone, not individuals. Some are now saying, I am aligned to so and so. That must stop.\n\nHis warnings, however, have done little to mask the worsening internal conflict.\n\nZANU PF remains deeply divided between Mnangagwa loyalists pushing ED2030 and Chiwengas camp, which views the Masvingo purges as a direct assault on the Vice Presidents long-anticipated succession path. For many within the party, the turmoil is not an isolated provincial dispute buta clear sign of a succession war intensifying across ZANU PF structures, revealing a vice president increasingly under siege as Mnangagwas allies consolidate power ahead of 2027.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —Three senior ZANU PF District Coordinating Committee (DCC) chairpersons in Masvingo are reportedly facing expulsion as the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/14/three-top-masvingo-zanu-pf-leaders-chopped-for-resisting-ed2030/\">Continue reading<span class=\"screen-reader-text\"> \"Three Top Masvingo ZANU PF Leaders Chopped for Resisting ED2030\"</span></a></p>",
            "time": "06:09",
            "date": "15 Nov 2025"
        }
    ]
}