{
    "news": [
        {
            "title": "JUST IN: Paul Mwazha Grabs Chivayo’s Cursed Loot",
            "url": "https://www.zimeye.net/2025/10/30/paul-mwazha-grabs-chivayos-cursed-loot/",
            "content": "By A CorrespondentContrary to widespread reports that African Apostolic Church founder Apostle Paul Mwazha had rejected a lavish gift from flamboyant businessman and convicted fraudster Wicknell Chivayo, new information suggests that Chivayos team has successfully delivered the package, a US$190,000 Toyota Land Cruiser 300 ZX and US$107,000 in cash, to the 107-year-old religious leader.\n\nThe revelation contradicts earlier claims that the centenarian preacher had humbly turned down the gifts, citing his lifelong commitment to serving God over material possessions. Sources close to the transaction confirmed toCrime Watchthat the vehicle and cash were accepted by representatives of Mwazhas church on his behalf earlier this week.\n\nChivayo, a controversial ZANU PF-linked tenderpreneur, had publicly announced his intention to honour Mwazha in celebration of his 107th birthday, describing him as one of the most eminent men of God. In a lengthy social media post, he said the gesture was a personal expression of gratitude for the clergymans spiritual influence.\n\nThroughout his extraordinary life, Mutumwa Mwazha has made immeasurable contributions to the spiritual and social well-being of Zimbabwe. His teachings on prayer and unity have transformed generations and strengthened the moral fibre of our society, Chivayo wrote.\n\nHe added that the gift was meant to celebrate 107 years of exceptional grace, pledging to deliver the car and cash through his associates at Exquisite Car Dealership.\n\nThe high-profile donation has divided public opinion. Some Zimbabweans have praised Chivayos generosity, viewing it as a symbolic act of honouring an elder of faith. Others, however, see the gesture as an attempt by a politically connected businessman to cleanse his controversial image by associating with one of the countrys most respected religious figures.\n\nWhile officials from the African Apostolic Church have remained silent on the matter, sources within the church said the delivery was completed quietly to avoid unnecessary publicity.\n\nThe development comes as Chivayo continues to flaunt his wealth and close ties to Zimbabwes ruling elite, having recently spent nearlyUS$1 millionpurchasing vehicles for senior members of his church.\n\nWhether Mwazha personally endorsed the acceptance of the cursed loot, as critics have dubbed Chivayos offerings, remains unclear. But the incident has reignited public debate over the intersection of faith, power, and money in Zimbabwes religious and political life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Contrary to widespread reports that African Apostolic Church founder Apostle Paul Mwazha had rejected a lavish … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/paul-mwazha-grabs-chivayos-cursed-loot/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Paul Mwazha Grabs Chivayo’s Cursed Loot\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Chiwenga Has No Right To Take Over From Mnangagwa, Declares Mutsvangwa",
            "url": "https://www.zimeye.net/2025/10/30/chiwenga-has-no-right-to-take-over-from-mnangagwa-declares-mutsvangwa/",
            "content": "By A Correspondent\n\nZANU PF spokesperson Christopher Mutsvangwa has dismissed speculation that Vice President Constantino Chiwenga could automatically succeed President Emmerson Mnangagwa, describing such claims as unfounded and out of touch with Zimbabwes democratic process.\n\nSpeaking on SABC News recently, Mutsvangwa emphasized that leadership transitions in Zimbabwe are determined by elections, not by appointments or behind-the-scenes agreements. It is not that we do not want him, he said. He can declare his candidacy. There is no provision in the Zimbabwean constitution that the vice president is the automatic leader of the country afterwards.\n\nMutsvangwa used a colorful analogy to stress the point. This is not a papacy. This is not cardinals in Rome, sitting in a cabal, deciding that this is going to be the person succeeding the pope. This is a democratic country, and people go to elections, he said.\n\nHe also reiterated that anyone interested in the presidency must go through the proper channels. If he wants, he can declare his candidacy for elections in the party or outside the party and do the test of the vote. This effort of someone being anointed for whatever reason is totally against the tenets of democratic governance, Mutsvangwa said.\n\nThe ZANU PF spokesperson further pointed out that Chiwenga is not the only figure with ambitions for higher office in Zimbabwe. Why this particular preoccupation with this particular person, except that there are some people who feel that he should be anointed as the leader of Zimbabwe? This is not a papacy. This is a democratic, constitutionally-run country, he added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF spokesperson Christopher Mutsvangwa has dismissed speculation that Vice President Constantino Chiwenga could automatically succeed President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/chiwenga-has-no-right-to-take-over-from-mnangagwa-declares-mutsvangwa/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Has No Right To Take Over From Mnangagwa, Declares Mutsvangwa\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "It’s Trabablas Everywhere, Chamisa Mocks Mnangagwa Over ZESA Fiasco At Parliament",
            "url": "https://www.zimeye.net/2025/10/30/its-trabablas-everywhere-chamisa-mocks-mnangagwa-over-zesa-fiasco-at-parliament/",
            "content": "By A Correspondent\n\nCitizens leader Advocate Nelson Chamisa has taken a swipe at President Emmerson Mnangagwa following the embarrassing power outage that disrupted his State of the Nation Address (SONA) at Parliament earlier this week.\n\nThe incident, which occurred while Mnangagwa was addressing lawmakers, plunged the legislative chamber into darkness and quickly became a subject of national ridicule  symbolizing, for many, the broader failures of governance under the ruling ZANU PF administration.\n\nIn a statement issued on Thursday, Chamisa mocked the episode as a reflection of the countrys decaying systems and leadership paralysis.\n\nTRABABLAS IN PARLIAMENT Its trabablas everywhere, Chamisa wrote. TRABABLAS in the constitution. TRABABLAS in the rigging of elections. TRABABLAS in the ruining party. TRABABLAS in the economy. TRABABLAS in corruption and looting of national resources. TRABABLAS at home and in the diaspora. Its TRABABLAS everywhere. Its chaos everywhere.\n\nHe went on to say that even those responsible for the chaos are now being consumed by their own failures.\n\nFailure consumes even its author!! When failure multiplies, even its author cant be spared. Chibani muParliament here veduwe!! Its the #StateOftheNation depicted! Chamisa added.\n\nThe opposition leaders remarks resonated widely on social media, where citizens echoed similar frustrations about persistent power cuts, corruption, and the countrys economic decline.\n\nThe power outage during Mnangagwas speech has since become a metaphor for what critics describe as Zimbabwes dark state  a nation struggling under the weight of mismanagement and lack of accountability.\n\nWhile government officials have downplayed the incident as a mere technical fault, Chamisas comments underscore a growing sentiment among many Zimbabweans that the blackout symbolized much more than a temporary loss of electricity  it illuminated the failures of leadership at the very top.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Citizens leader Advocate Nelson Chamisa has taken a swipe at President Emmerson Mnangagwa following the embarrassing power … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/its-trabablas-everywhere-chamisa-mocks-mnangagwa-over-zesa-fiasco-at-parliament/\">Continue reading<span class=\"screen-reader-text\"> \"It’s Trabablas Everywhere, Chamisa Mocks Mnangagwa Over ZESA Fiasco At Parliament\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Zanu PF Masvingo Heavyweights Face Jail Over Land Scam",
            "url": "https://www.zimeye.net/2025/10/30/zanu-pf-masvingo-heavyweights-face-jail-over-land-scam/",
            "content": "By A Correspondent\n\nMasvingo  Influential Zanu PF figures, Godard Dunira and former Chivi Central MP Ephraim Gwanongodza, are back in the spotlight after being remanded in a high-profile land fraud case. The allegations accuse them of illegally acquiring and selling hundreds of hectares of land meant for housing and commercial developments.\n\nDuring a remand hearing on 29 October, Magistrate Innocent Befura ordered that the two politicians return to court on 28 November. Earlier this month, both spent a week in remand prison over the case, which involves residential and commercial stands in Victoria Range valued at over US$1 million, originally owned by land development company Shineplus.\n\nUnder their bail conditions, Dunira and Gwanongodza must report to Masvingo Central Police Station every Friday and comply with other court directives.\n\nCourt documents show the case revolves around the alleged illegal grabbing and sale of more than 100 hectares of land from Shineplus. The case has drawn national attention due to the accuseds political influence and the scale of the alleged fraud.\n\nDunira was represented by lawyer Msindo Hungwe, while Gwanongodza was represented by Advocate Tichaona Bhunu.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo – Influential Zanu PF figures, Godard Dunira and former Chivi Central MP Ephraim Gwanongodza, are back … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/zanu-pf-masvingo-heavyweights-face-jail-over-land-scam/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Masvingo Heavyweights Face Jail Over Land Scam\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Human-Wildlife Conflict Demands United Action: PYCD Leads Efforts to Revamp the CAMPFIRE Model",
            "url": "https://www.zimeye.net/2025/10/30/human-wildlife-conflict-demands-united-action-pycd-leads-efforts-to-revamp-the-campfire-model/",
            "content": "By Claris Madhuku| Communities in Chipinge, particularly in Mutema, Chibuwe, and Mahenye, are grappling with devastating losses from recurring human-wildlife conflict. This crisis, exacerbated by fragmented and underfunded initiatives, places crops, livelihoods, and community safety at constant risk as elephants and other wildlife intrude into villages.\n\nThe Platform for Youth and Community Development Trust (PYCD) is at the forefront of advocating for effective implementation of the CAMPFIRE model through a Participatory Action Research framework that includes beneficiary communities and civic society. PYCD envisions a sustainable coexistence between people and wildlife, achievable only when community voices are empowered and placed at the center of decision-making processes.\n\nTo tackle the challenges posed by human-wildlife conflict, PYCD is mobilizing stakeholders to draw from local experiences and knowledge. Their first step involves reviewing the CAMPFIRE model to identify gaps in coordination and funding. This initiative aims to propose a sustainable, community-led approach to wildlife management that prioritizes the protection of livelihoods.\n\nCommunities in Chipinge have decades of lived experience, and with the right support, they can lead the development of practical, inclusive solutions that benefit both humans and wildlife.\n\nIn the past week, communities in Ward 20, Chibuwe, faced severe crop losses due to elephants straying from the Save Valley Conservancy. The destruction of women-led community gardens and irrigation schemes, vital for household nutrition and income, resulted in damages exceeding USD 3,500. Currently, there is no compensation mechanism in place, aside from sharing salvaged elephant meat. Local resident Catherine Vhutuza remarked,\n\nShort-term relief from game meat, especially elephants, is not enough to offset economic losses incurred.\n\nResidents are calling for the Human-Wildlife Conflict Fund to be fully operationalized to compensate affected households, but these efforts remain uncoordinated.\n\nPYCD is actively collaborating with organizations like the Zimbabwe Environmental Law Association (ZELA) and the World Wide Fund for Nature (WWF) to address challenges in the Chipinge district. Key community-based organizations involved include Project Kuchengetedzwa Zviwanikwa (PKZ), Chipinge Residents and Ratepayers Trust (CRRT), Green Institute, Adam Monke Family Trust, and Vemuganga Community Radio.\n\nMr. Claris Madhuku, Director of PYCD, emphasized the importance of community empowerment, stating,\n\nThe CAMPFIRE model still remains our hope for increased local tolerance for wildlife. The missing gap is that the model depends on community empowerment, which is currently lacking. A community-led and locally owned wildlife governance model would ensure that communities benefit from wildlife while being protected from recurring damage.\n\nIn October 2025, the Joint Portfolio Committee on Environment, Climate, and Wildlife held public consultations in Chipinge regarding the Climate Change Management Bill (H.B. 5, 2025). Citizens overwhelmingly called for rural communities to be central in wildlife governance and compensation mechanisms.\n\nPYCD urges communities living alongside the Save Valley Conservancy to be meaningfully empowered and supported. There must be mechanisms for local voices to shape wildlife governance and climate adaptation policies.\n\nMr. Blessing Matasva, Director of the Green Institute, highlighted the necessity of government involvement:\n\nDue to the increasing incidences of human-wildlife conflict, we are engaging with local government stakeholders to urgently operationalize the Human-Wildlife Conflict Fund to protect livelihoods, particularly for women and young people.\n\nTo ensure sustainability, PYCD encourages all community members to report incidents of wildlife destruction and engage in ongoing consultations. This participation will help prioritize community rights, safety, and benefits.\n\nThrough the efforts of Allan Murozvi, its Research and Governance Officer, PYCD is engaging in Participatory Action Research aimed at addressing household benefits and fully devolving the CAMPFIRE model. This initiative will work closely with the Chipinge Rural District Council.\n\nWith collaborative efforts and a unified approach, PYCD is determined to lead the way toward a more sustainable coexistence between humans and wildlife in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Claris Madhuku| Communities in Chipinge, particularly in Mutema, Chibuwe, and Mahenye, are grappling with devastating losses from recurring human-wildlife … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/human-wildlife-conflict-demands-united-action-pycd-leads-efforts-to-revamp-the-campfire-model/\">Continue reading<span class=\"screen-reader-text\"> \"Human-Wildlife Conflict Demands United Action: PYCD Leads Efforts to Revamp the CAMPFIRE Model\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "“Say No to 2030 Agenda,” Church Leader Tells Nation",
            "url": "https://www.zimeye.net/2025/10/30/say-no-to-2030-agenda-church-leader-tells-nation/",
            "content": "By A Correspondent  Bishop Ancelimo Magaya has called on Zimbabweans to reject moves by President Emmerson Mnangagwa to extend his term, describing the effort as unconstitutional and a threat to the countrys democratic principles.\n\nHis warning comes in the aftermath of the bombing of SAPES Trust offices in Harare, an attack he said was aimed at silencing democratic voices.\n\nIn a statement on Thursday, Bishop Magaya said, We condemn in the strongest of terms the bombing of SAPES Trust premises, where a press conference was supposed to be held by a coalition of democratic forces.\n\nHe also condemned the polices violent disruption of the hastily relocated press briefing. We condemn the subsequent brutal show of force by the ZRP in disrupting the press conference. Leaders from different organizations had organized themselves not only to defend the constitution but to give voice to multitudes of Zimbabweans saying no to the 2030 agenda, he added.\n\nBishop Magaya emphasized that the proposed extension of President Mnangagwas term violates the countrys founding democratic principles. Zimbabwe is at its darkest hour from which it must be rescued, a rescue that must happen urgently. This unconstitutional bid to extend Mnangagwas term is an affront to one man, one votethe very principle on which our liberation struggle was founded, he said.\n\nHe urged citizens to take action beyond prayers and discussions. We should all heed the call to say NO to this dictatorship whose signs we have detected way back. Whatever prayers we make for our beloved country, they must result in quantifiable prophetic action. Reflection alone is insufficient; action informed by justice is required, he said.\n\nReferencing Paulo Freires concept of praxis, Bishop Magaya urged Zimbabweans to combine reflection with decisive action. As Freire teaches, theory and action must inform each other in the pursuit of justice. We cannot wait for others; it is upon us to act boldly for the sake of our nation and its future, he concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Bishop Ancelimo Magaya has called on Zimbabweans to reject moves by President Emmerson Mnangagwa to extend … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/say-no-to-2030-agenda-church-leader-tells-nation/\">Continue reading<span class=\"screen-reader-text\"> \"“Say No to 2030 Agenda,” Church Leader Tells Nation\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Respected Methodist Church In Zim Elders In Adultery Storm",
            "url": "https://www.zimeye.net/2025/10/30/respected-methodist-church-in-zim-elders-in-adultery-storm/",
            "content": "By A Correspondent  Two married senior Methodist Church in Zimbabwe (MCZ), a male chaplain, and a female elder serving in South Africa, have been relieved of their duties following allegations of an inappropriate relationship, sparking outrage and embarrassment within the church community.\n\nAccording to a letter addressed to the National Executive Committee of the MCZ South Africa Fellowship, the incident involved one Chaplain, Rev. Mudenda of the Gauteng Section, and a Mrs. Mhandu, a church member and leader. The letter, dated 29 October 2025, reports that the two exchanged inappropriate messages, which were later discovered by Mrs. Mhandus husband, Mr. Mhandu.\n\nThe confrontation that followed led to a heated altercation at the church manse, after which Rev. Mudenda reportedly acknowledged the matter and expressed remorse.\n\nThe Gauteng Section leadership convened an emergency meeting, where it resolved that Rev. Mudenda be relieved of all his duties with immediate effect and relocated to a freedom square for counseling while the disciplinary process unfolds.\n\nMrs. Mhandu was also instructed to step down from all her leadership positions, and both families were placed under pastoral counseling.\n\nIn its resolution, the Gauteng Section described the incident as regrettable and said it had brought considerable embarrassment to the church, particularly after details circulated on social media. The leaders urged congregants to avoid gossip and speculation, emphasizing unity and prayer for healing within the fellowship.\n\nLet us uphold the values of unity, maturity, and compassion. We urge all members to refrain from spreading information that may deepen divisions, the letter reads in part.\n\nThe scandal has reignited debate within Zimbabwes religious circles over recurring reports of pastoral misconduct, especially involving adultery and abuse of power in churches.\n\nOver the years, several denominations have faced similar crises  with clergy accused of exploiting their spiritual authority to engage in illicit relationships with congregants.\n\nIn 2021, a prominent Methodist minister in Bulawayo was suspended over an alleged affair with a choir member, while another high-ranking Apostolic Faith Mission (AFM) pastor in 2019 was accused of impregnating a married congregant.\n\nSuch cases have not been confined to a single denomination  the Roman Catholic Church, the United Methodist Church, and several Pentecostal movements have all had to manage reputational damage arising from similar scandals.\n\nReligious scholars note that the problem often stems from the imbalance of power between clergy and congregants, coupled with inadequate accountability structures. According to sociologist and church ethics researcher Dr. Tafadzwa Moyo, when church leaders occupy revered moral positions, communities often hesitate to challenge them  allowing moral lapses to go unchecked until they explode publicly.\n\nThe Methodist Church in Zimbabwe, one of the countrys oldest and most respected Christian institutions, has long championed discipline, education, and moral integrity among its clergy.\n\nHowever, recent incidents have tested those values.\n\nIn response to the growing number of misconduct cases, the church has strengthened its internal disciplinary procedures, emphasizing counseling and rehabilitation alongside punitive measures.\n\nThe Gauteng Sections decision to relocate Rev. Mudenda and subject both parties to pastoral counseling reflects this dual approach  seeking both accountability and restoration.\n\nMeanwhile, church elders have appealed to congregants to remember the founding values of the Methodist movement  repentance, renewal, and service.\n\nThis is a painful but necessary moment for reflection, one church elder in Johannesburg said. The church must hold its leaders to account, but also help them find redemption.\n\nAs the disciplinary process continues, both Rev. Mudenda and Mrs. Mhandu are expected to remain under pastoral supervision. The Gauteng Section has requested a temporary replacement chaplain to ensure that worship and fellowship activities continue without disruption.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Two married senior Methodist Church in Zimbabwe (MCZ), a male chaplain, and a female elder serving … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/respected-methodist-church-in-zim-elders-in-adultery-storm/\">Continue reading<span class=\"screen-reader-text\"> \"Respected Methodist Church In Zim Elders In Adultery Storm\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Watch : Mutsvangwa Declares Chiwenga Is Not Anointed To Succeed Mnangagwa",
            "url": "https://www.zimeye.net/2025/10/30/watch-mutsvangwa-declares-chiwenga-is-not-anointed-to-succeed-mnangagwa/",
            "content": "By A Correspondent\n\nZANU PF spokesperson Christopher Mutsvangwa has dismissed claims that Vice President Constantino Chiwenga could automatically succeed President Emmerson Mnangagwa, describing such speculation as unfounded and inconsistent with Zimbabwes democratic principles.\n\nIn an interview with SABC News on Tuesday, Mutsvangwa stressed that leadership transitions in the country are determined by elections, not behind-the-scenes arrangements.\n\nIt is not that we do not want him, he said. He can declare his candidacy. There is no provision in the Zimbabwean constitution that the vice president is the automatic leader of the country afterwards.\n\nUsing a colorful analogy, Mutsvangwa said, This is not a papacy. This is not cardinals in Rome, sitting in a cabal, deciding that this is going to be the person succeeding the pope. This is a democratic country, and people go to elections.\n\nHe further emphasized that anyone seeking the presidency must follow the proper process. If he wants, he can declare his candidacy for elections in the party or outside the party and do the test of the vote. This effort of someone being anointed for whatever reason is totally against the tenets of democratic governance, Mutsvangwa said.\n\nThe ZANU PF spokesperson also pointed out that Chiwenga is not the only figure with ambitions for higher office. Why this particular preoccupation with this particular person, except that there are some people who feel that he should be anointed as the leader of Zimbabwe? This is not a papacy. This is a democratic, constitutionally-run country, he added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF spokesperson Christopher Mutsvangwa has dismissed claims that Vice President Constantino Chiwenga could automatically succeed President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/watch-mutsvangwa-declares-chiwenga-is-not-anointed-to-succeed-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Watch : Mutsvangwa Declares Chiwenga Is Not Anointed To Succeed Mnangagwa\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "ZANU PF Boasts of Receiving 250,000 Opposition Defectors Under “Come Home” Campaign",
            "url": "https://www.zimeye.net/2025/10/30/zanu-pf-boasts-of-receiving-250000-opposition-defectors-under-come-home-campaign/",
            "content": "By A Correspondent\n\nZANU PF has claimed that at least 250,000 opposition members have joined the ruling party under its Dzokai Kumusha/Buyani Ekhaya (Come Home) programme, which is aimed at welcoming back former rivals.\n\nThe partys Commissariat Department confirmed the figures, saying the campaign continues to gain momentum nationwide. Coordinator of the programme, Blessing Chebundo, said the initiative has been a major success in strengthening party unity and national development.\n\nOur revolutionary party is all-embracing, and we will continue implementing this programme which has seen thousands from the opposition joining ZANU PF, said Chebundo while addressing a gathering of returnees in Harare yesterday.\n\nHe added that many former opposition members are returning after recognising President Mnangagwas leadership and developmental policies.We have seen a massive transformation of the economy in various sectors such as power, road rehabilitation, food self-sufficiency, and a wheat surplus for the first time in the history of Zimbabwe, he said. With such a developmental trajectory, there is no need to oppose for the sake of opposing.\n\nChebundo also announced that President Emmerson Mnangagwa will meet with 5,000 returnees from the Dzokai Kumusha/Buyani Ekhaya initiative on November 12, 2025, to hear their experiences since rejoining the party.\n\nSpeaking at the same event, ZANU PF Harare Provincial Political Commissar Voyage Dambuza urged all returnees to register formally with the partys Commissariat structures.All political commissars from the four zones in Harare should recruit more members to ensure everyone belongs to ZANU PF, said Dambuza. President Mnangagwa will meet with 5,000 returnees from the opposition next month.\n\nDambuza added that the programme aims to reintegrate those who had previously left the ruling party, describing it as a genuine homecoming.We are going to have a massive recruitment of people from the opposition back into ZANU PF, he said. If you look at how the party performed in recent by-elections, there is an indication that we are regaining ground and reclaiming seats once lost to the opposition.\n\nHe concluded by revealing that some of those returning are among the founding members of the Movement for Democratic Change (MDC).Today we witnessed the return of prominent people from the opposition, people who founded the MDC in 1999. They are coming back, Dambuza stated.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF has claimed that at least 250,000 opposition members have joined the ruling party under its … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/zanu-pf-boasts-of-receiving-250000-opposition-defectors-under-come-home-campaign/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Boasts of Receiving 250,000 Opposition Defectors Under “Come Home” Campaign\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        },
        {
            "title": "Top Methodist Priest Caught Pants Down",
            "url": "https://www.zimeye.net/2025/10/30/top-methodist-priest-caught-pants-down/",
            "content": "By A Correspondent  A senior Methodist Church in Zimbabwe (MCZ) chaplain serving in South Africa has been relieved of his duties following allegations of an inappropriate relationship with a married congregant, sparking outrage and embarrassment within the church community.\n\nAccording to a letter addressed to the National Executive Committee of the MCZ South Africa Fellowship, the incident involved one Chaplain, Rev. Mudenda of the Gauteng Section, and Mrs. Mhandu, a church member and leader. The letter, dated 29 October 2025, reports that the two exchanged inappropriate messages, which were later discovered by Mrs. Mhandus husband, Mr. Mhandu.\n\nThe confrontation that followed led to a heated altercation at the church manse, after which Rev. Mudenda reportedly acknowledged the matter and expressed remorse.\n\nThe Gauteng Section leadership convened an emergency meeting, where it resolved that Rev. Mudenda be relieved of all his duties with immediate effect and relocated to a freedom square for counseling while the disciplinary process unfolds.\n\nMrs. Mhandu was also instructed to step down from all her leadership positions, and both families were placed under pastoral counseling.\n\nIn its resolution, the Gauteng Section described the incident as regrettable and said it had brought considerable embarrassment to the church, particularly after details circulated on social media. The leaders urged congregants to avoid gossip and speculation, emphasizing unity and prayer for healing within the fellowship.\n\nLet us uphold the values of unity, maturity, and compassion. We urge all members to refrain from spreading information that may deepen divisions, the letter reads in part.\n\nThe scandal has reignited debate within Zimbabwes religious circles over recurring reports of pastoral misconduct, especially involving adultery and abuse of power in churches.\n\nOver the years, several denominations have faced similar crises  with clergy accused of exploiting their spiritual authority to engage in illicit relationships with congregants.\n\nIn 2021, a prominent Methodist minister in Bulawayo was suspended over an alleged affair with a choir member, while another high-ranking Apostolic Faith Mission (AFM) pastor in 2019 was accused of impregnating a married congregant.\n\nSuch cases have not been confined to a single denomination  the Roman Catholic Church, the United Methodist Church, and several Pentecostal movements have all had to manage reputational damage arising from similar scandals.\n\nReligious scholars note that the problem often stems from the imbalance of power between clergy and congregants, coupled with inadequate accountability structures. According to sociologist and church ethics researcher Dr. Tafadzwa Moyo, when church leaders occupy revered moral positions, communities often hesitate to challenge them  allowing moral lapses to go unchecked until they explode publicly.\n\nThe Methodist Church in Zimbabwe, one of the countrys oldest and most respected Christian institutions, has long championed discipline, education, and moral integrity among its clergy.\n\nHowever, recent incidents have tested those values.\n\nIn response to the growing number of misconduct cases, the church has strengthened its internal disciplinary procedures, emphasizing counseling and rehabilitation alongside punitive measures.\n\nThe Gauteng Sections decision to relocate Rev. Mudenda and subject both parties to pastoral counseling reflects this dual approach  seeking both accountability and restoration.\n\nMeanwhile, church elders have appealed to congregants to remember the founding values of the Methodist movement  repentance, renewal, and service.\n\nThis is a painful but necessary moment for reflection, one church elder in Johannesburg said. The church must hold its leaders to account, but also help them find redemption.\n\nAs the disciplinary process continues, both Rev. Mudenda and Mrs. Mhandu are expected to remain under pastoral supervision. The Gauteng Section has requested a temporary replacement chaplain to ensure that worship and fellowship activities continue without disruption.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — A senior Methodist Church in Zimbabwe (MCZ) chaplain serving in South Africa has been relieved of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/30/top-methodist-priest-caught-pants-down/\">Continue reading<span class=\"screen-reader-text\"> \"Top Methodist Priest Caught Pants Down\"</span></a></p>",
            "time": "18:35",
            "date": "30 Oct 2025"
        }
    ]
}