{
    "news": [
        {
            "title": "CORYZA INFECTION IN CHICKENS – SILENT PROFIT KILLER!",
            "url": "https://www.zimeye.net/2025/11/27/coryza-infection-in-chickens-silent-profit-killer/",
            "content": "By Dr Trywell Muzerengi\n\nEvery poultry farmer must read this!\n\nHave you ever noticed your birds sneezing, with swollen faces, smelly discharge from the nose and eyes, loss of appetite, and sudden drop in egg production?\n\n You may be dealing with INFECTIOUS CORYZA  a fast-spreading bacterial disease that can destroy your flock and your profit if ignored!\n\n WHAT IS CORYZA?\n\nInfectious Coryza is a highly contagious respiratory disease of chickens caused by Avibacterium paragallinarum. It spreads very fast through:  Direct contact Contaminated feeders & drinkers Farm visitors Poor biosecurity\n\n COMMON SIGNS TO WATCH FOR\n\n Swollen face and wattles Thick, foul-smelling nasal discharge Sneezing and difficulty breathing Drop in egg production Weakness and loss of appetite\n\n Once you see these signs, act immediately!\n\n MANAGEMENT & TREATMENT\n\n Isolate sick birds immediately Administer appropriate antibiotics as prescribed by a veterinarian Add multivitamins to boost immunity Disinfect the pen daily Provide good ventilation and clean water\n\n Note: Treatment controls symptoms but does not completely eliminate the carrier birds!\n\n PREVENTION IS ALWAYS CHEAPER THAN CURE\n\n Practice strict biosecurity Avoid mixing old and new birds Vaccinate your flock where available Keep your environment clean and dry Quarantine new birds for at least 2 weeks\n\n REMEMBER:One infected bird can infect your entire flock within days!\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Every poultry farmer must read this! Have you ever noticed your birds sneezing, with swollen faces, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/coryza-infection-in-chickens-silent-profit-killer/\">Continue reading<span class=\"screen-reader-text\"> \"CORYZA INFECTION IN CHICKENS – SILENT PROFIT KILLER!\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Watch: Job Sikhala’s Biographer Publicly Praises Kuda Tagwirei",
            "url": "https://www.zimeye.net/2025/11/27/watch-job-sikhalas-biographer-publicly-praises-kuda-tagwirei/",
            "content": "Tinashe Sambiri Job Sikhalas biographer, Munyaradzi Angero Savanhu  who authored the book Footprints in the Chains  has reportedly shifted allegiance after appearing at a Zanu PF rally in Mbare on Tuesday, where he openly praised businessman and Zanu PF Central Committee member Kudakwashe Tagwirei.\n\nSavanhus presence at the Zanu PF rally and public endorsement of Tagwirei stunned many within the National Democratic Working Group (NDWG), where Sikhala is a key figure.\n\nIn a statement, the NDWG leadership expressed disbelief at Savanhus move, saying:We are shocked by the video of our leaders biographer, Munyaradzi Angero Savanhu, at a Zanu PF rally. We trusted him as a pastor and a writer, and he got close to our leader. Little did we know he is a snake. This boy is a mess.\n\nThe NDWG Harare provincial structure also criticised Savanhus decision, alleging that he had been enticed by financial gain.Money is powerful to buy even people. Munyaradzi Angero Savanhu, who authored Hon. Job Sikhalas biography Footprints In The Chains, attended Kuda Tagwireis rally at Rufaro Stadium today and testified that he was joining him for goodies.\n\nSavanhu has not yet issued a formal response to the backlash, but his public praise of Tagwirei marks a dramatic shift from his previous associations within the opposition movement.\n\nNot sure what exactly Sikhala saw in this clear malambane and mgodoyi to a point of bringing him closer to him. . We have a lot of seasoned writers in country like Luke Tamborinyoka and others who are not snakes .https://t.co/i3xKoK9hYP\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Job Sikhala’s biographer, Munyaradzi Angero Savanhu — who authored the book Footprints in the Chains — has reportedly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/watch-job-sikhalas-biographer-publicly-praises-kuda-tagwirei/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Job Sikhala’s Biographer Publicly Praises Kuda Tagwirei\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Behind Chiwenga’s Airport Handshake | Video",
            "url": "https://www.zimeye.net/2025/11/27/behind-chiwengas-airport-handshake-video/",
            "content": "Revisiting EDs Departure For Luanda: A Choreographed Handshake, Or A Battle Of Wits At The Tarmac?\n\nACT 1, SCENE 1: Harare International Airport\n\nAs President Emmerson Mnangagwa departed for the 7th AU-EU Summit in Luanda, Angola, a tense, meticulously choreographed moment played out on the red carpet. The entire performancecaptured on national broadcaster ZBCoffers a revealing window into the frosty, yet performative, relationship between Mnangagwa and his deputy, General Constantino Chiwenga.\n\nStanding stiffly in full military regalia, Chiwenga offers ED a formal salute followed by a conspicuously animated double-handed handshake. While speaking in Shona, Chiwenga asks:\n\nRevisiting ED's Departure For Luanda, Angola  A Closer Scrutiny!Act 1 Scene 1 @ Harare International AirportFrom audio. Chiwenga to ED in Shona:\"Zvakanaka. Mofamba mushe. EU muri kunotora nguva yakadini?\"[All is well. Have a safe journey. How long are you going to behttps://t.co/k1hdq4RCKG\n\nZvakanaka. Mofamba mushe. EU muri kunotora nguva yakadini?\n\n(All is well. Have a safe journey. How long will you be away at the EU Summit?)\n\nMnangagwa, noticeably restrained, does not return the exuberance. Instead of locking eyes and replying directly, he mumbles something unintelligible while deliberately turning his head awayfacing the direction he had just walked from. This is at the precise moment when protocol and natural etiquette would demand a firm verbal response to the Acting Presidents question.\n\nTHE DELIBERATE DEFLECTION?\n\nTheres no visible external stimulus or distraction in that direction to warrant the diversion of EDs attention. This body language, when viewed in context, appears to be more than coincidence: it resembles a subtle but calculated act of dismissal.\n\nWhen he eventually turns back to resume his walk, his hand slips free of Chiwengas. The handshake is over. The interaction is awkward, forcedand very telling.\n\nA SPECTACLE FOR THE CAMERAS?\n\nLegal and political analyst Brighton Mutebuka offers a sharp take:\n\nChiwenga may have been straining for small talkwhile performing an appropriate degree of spectacle to convince the audience and TV cameras of his aura around ED.\n\nIndeed, Chiwengas body language is unlike that of the other officials. Others merely offer quick, respectful handshakesbarely performing for the cameras. Chiwengas handshake, however, is theatrical. His exaggerated physical energy contrasts sharply with EDs closed, reserved posture.\n\nIts a duet where only one partner is dancing.\n\nWHATS MISSING FROM THE SCRIPT?\n\nMost tellingly, Chiwengas question  asking about EDs travel itinerary  raises serious protocol concerns. As Acting President, he should have been briefed long before EDs departure. That he felt compelled to ask at the airport either reveals:\n\nWhatever the case, it signals ongoing power dysfunction at the highest levels.\n\nCONTEXT: A FAULTLINE CALLED AGENDA 2030\n\nThis performance occurs amid rising tensions over Mnangagwas suspected push for a third term under Agenda 2030. The militaryespecially Chiwengas factionhas shown increasing discomfort. The handshake, then, is not just a farewell; it is a coded message.\n\nTHE FINAL TURN: EDS SMILEBUT NOT FOR CHIWENGA\n\nAs ED continues down the line, he finally breaks into a smilebut not with Chiwenga. Its only while greeting other officials that he seems relaxed, jovial, his body language easing into natural comfort.\n\nBehind the handshake lies a cold war. A handshake that was meant to say we are united instead screams distance, mistrust, and staged diplomacy. The handshake is not a greeting; its a performance. And the audienceboth national and globalhas now seen the cracks.\n\nFade out. End of Scene.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Revisiting ED’s Departure For Luanda: A Choreographed Handshake, Or A Battle Of Wits At The Tarmac? ACT 1, SCENE 1: … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/behind-chiwengas-airport-handshake-video/\">Continue reading<span class=\"screen-reader-text\"> \"Behind Chiwenga’s Airport Handshake | Video\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Strict Religious Rules On Mwazha Burial",
            "url": "https://www.zimeye.net/2025/11/27/strict-religious-rules-on-mwazha-burial/",
            "content": "By A Correspondent The family of the late African Apostolic Church founder, Archbishop Paul Mwazha, has confirmed that his burial will be conducted under strict religious protocols, in accordance with church doctrine and long-standing family traditions.\n\nArchbishop Mwazha, who died on 20 November 2025 at the age of 107, will be laid to rest in Chirasauta, Chikomba District, Mashonaland East Province.\n\nIn a statement, the Ministry of Home Affairs and Cultural Heritage said the burial will be strictly overseen by close family members and the church, following a formal request by the Mwazha family.\n\nAccording to the programme, Mwazhas remains will be collected from Nyaradzo Funeral Parlour and taken to the family home in Hatfield, where they will lie in state on Friday, 28 November 2025. A church service will be held from 7 pm to 10 pm.\n\nOn Saturday, 29 November, the body will be airlifted to Guvambwa for an all-night body viewing from 4 pm until 6 am. On Sunday, 30 November, it will be flown to Chirasauta Business Centre for final burial rites, scheduled between 9 am and midday.\n\nThe Ministry urged congregants and the general public to respect the strict religious guidelines governing the proceedings.\n\nThousands of followers are expected to gather in Chirasauta on Sunday for the burial, which comes after the family firmly rejected government plans to inter the revered cleric at the National Heroes Acre.\n\nThe decision has stirred national debate, particularly because the ZANU PF-led government had moved swiftly to take charge of the funeral after President Emmerson Mnangagwa conferred national hero status on Mwazha. For decades, the ruling party has used state-assisted burials at the national shrine to assert political authority and symbolically claim influential national figures.\n\nMwazhas family instead insisted on a private, church-centred burial  a rare but decisive departure that interrupts ZANU PFs long-standing practice of leveraging high-profile funerals for political gain. State funerals have often been used to consolidate loyalty, rehabilitate political narratives, or commandeer the legacy of prominent public figures.\n\nIn the months leading up to his death, the political courting of Mwazha had intensified. Senior ZANU PF officials frequently visited him ahead of key political events, and he recently received a luxury vehicle and cash gifts from businessman and convicted fraudster Wicknell Chivayo  one of the ruling partys most visible benefactors. The gestures fuelled public speculation that Mwazhas vast spiritual following was being targeted for political mobilisation.\n\nFamily spokesperson Dr Masimba Mwazha reiterated that the burial would proceed strictly in line with church and family protocols.\n\nThe body of the national hero will leave Harare on Saturday for Chikomba District, where everyone will be gathered. The body will depart for Chirasauta on Sunday for burial at a private function, he said.\n\nArchbishop Mwazha was immediately declared a national hero following his death, with Mnangagwa praising his spiritual leadership and contribution to the growth of African Independent Churches. ZANU PF National Chairperson Oppah Muchinguri-Kashiri, accompanied by CIO Minister Lovemore Matuke, visited the family home in Hatfield to deliver the Presidents condolence message.\n\nBorn on 25 October 1918 at Holy Cross Mission in Chirumanzu, Mwazha became one of the most influential leaders in African Independent Churches, grounded in accounts of divine encounters and a lifelong commitment to spiritual renewal.\n\nHis burial outside Heroes Acre stands as a firm assertion of family and church autonomy  a quiet but unmistakable rebuke of efforts to turn his passing into a political spectacle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The family of the late African Apostolic Church founder, Archbishop Paul Mwazha, has confirmed that his burial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/strict-religious-rules-on-mwazha-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Strict Religious Rules On Mwazha Burial\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Typical Mugabe-Style 2017 Coup Unfolds in Guinea-Bissau",
            "url": "https://www.zimeye.net/2025/11/27/typical-mugabe-style-2017-coup-unfolds-in-guinea-bissau/",
            "content": "Guinea-BissauIn scenes reminiscent of Zimbabwes November 2017 military coup that removed Robert Mugabe from power, a junta in Guinea-Bissau has seized control of the country amid reports that President Umaro Sissoco Embal has been arrested.\n\nGunfire erupted in the capital, Bissau, on Wednesday, and shortly afterwards government sources confirmed to the BBC that Embal had been detained by mutinous soldiers. The military faction later appeared on state television to announce that they were suspending the electoral process as the nation awaited results from Sundays presidential election.\n\nThe officers claimed they had intervened to thwart what they described as a plot by unnamed politicians supported by a well-known drug baron to destabilise the country. They declared the closure of national borders and imposed a night-time curfew.\n\nGuinea-Bissau, precariously wedged between Senegal and Guinea, has long been a coup-prone West African state and a key transit hub for the international drug trade. Since independence from Portugal in 1974, its military has consistently wielded outsized political influence.\n\nResults from the contentious presidential election were expected on Thursday, with both Embal and his main rival Fernando Dias having prematurely declared victory. Dias is backed by former Prime Minister Domingos Simes Pereira, who was controversially barred from running.\n\nLate Wednesday, Embal told France 24 in a phone interview: I have been deposed.\n\nGovernment sources later informed the BBC that Dias, Pereira and Interior Minister Botch Cand had also been taken into custody. The junta is reported to have detained the armys top brass, including Chief of Defence Staff General Biague Na Ntan and his deputy, General Mamadou Tour.\n\nThe situation remains fluid, and the international community is monitoring developments closely as Guinea-Bissau teeters once again on the brink of political upheaval.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Guinea-Bissau — In scenes reminiscent of Zimbabwe’s November 2017 military coup that removed Robert Mugabe from power, a junta in Guinea-Bissau … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/typical-mugabe-style-2017-coup-unfolds-in-guinea-bissau/\">Continue reading<span class=\"screen-reader-text\"> \"Typical Mugabe-Style 2017 Coup Unfolds in Guinea-Bissau\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Suspect Allegedly Killed Daughter In Order To Marry A New Boyfriend",
            "url": "https://www.zimeye.net/2025/11/27/suspect-allegedly-killed-daughter-in-order-to-marry-a-new-boyfriend/",
            "content": "By Farai D Hove | The ZRP has written confirming the arrest of Geviza Fadzai (35) in connection with a murder case which occurred on 25/11/25 at Village 2, Fair Range, Mkwasine.\n\nThe suspect allegedly stabbed her three-year-old daughter on the neck with a knife and went on to inform a neighbour that the child had been attacked by four unknown assailants.\n\nShe then proceeded to the village head, where she claimed that the child had died due to natural causes. The offence later came to light during burial arrangements when a deep cut was observed on the victims neck and a report was made at ZRP Mkwasine.\n\nPolice investigations established that the suspect allegedly killed her daughter so that she could marry her new boyfriend, who was unwilling to marry her while she had a child.\n\nThe victims body was taken to Chiredzi General Hospital for a post-mortem.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | The ZRP has written confirming the arrest of Geviza Fadzai (35) in connection with a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/suspect-allegedly-killed-daughter-in-order-to-marry-a-new-boyfriend/\">Continue reading<span class=\"screen-reader-text\"> \"Suspect Allegedly Killed Daughter In Order To Marry A New Boyfriend\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "State Assisted Funeral For Justice Chatukuta",
            "url": "https://www.zimeye.net/2025/11/27/state-assisted-funeral-for-justice-chatukuta/",
            "content": "By A Correspondent  The government has extended state state-assisted funeral to Supreme Court Judge Feliciah Chatukuta.\n\nJustice Chatukuta passed away in Harare on Saturday, 22 November 2025, reportedly following a cardiac arrest.\n\nShe was 63.\n\nIn a statement, Mnangagwa said:\n\nI learnt with profound sadness of the passing on of Supreme Court Judge, Justice Felicia Chatukuta, a distinguished daughter of the nation and stalwart of the Zimbabwean judiciary. Justice Chatukuta died on the 22nd of November 2025 due to cardiac arrest. She was 63.Justice Chatukuta, whose career in the legal fraternity spanned four decades, exemplified an unquestionable dedication to upholding the rule of law. Her unwavering commitment to the justice delivery system has left an indelible mark on our great nation.\n\nFrom her early days as a young legal practitioner soon after earning her Bachelor of Laws (LLB) degree from the University of Zimbabwe in 1985, Justice Chatukuta demonstrated her dedication to the learned profession through working as a Public Prosecutor and later as a part-time lecturer at her alma mater, the University of Zimbabwe. She also served as a director at the Legal Aid Directorate and continued on the legal path with dedication, honesty and commitment. These qualities saw her being elevated to the bench on the 29th of August 2005, when she was appointed a judge of the High Court of Zimbabwe.\n\nJustice Chatukuta served as a High Court judge for 16 years, distinguishing herself through hard work and utmost integrity until her elevation to the Supreme Court bench on the 3d of June2021. The appointment was in recognition of her high professional and ethical standards of conduct, legal expertise and invaluable contribution to the justice delivery system in Zimbabwe.Despite the lofty appointments, Justice Chatukuta served with humility and a demonstrated thoroughness in the execution of her duties, traits that are worth emulating not only by those serving in the legal fraternity, but by all Zimbabweans. Her passing on is a significant loss to the Zimbabwean judiciary and her legacy will serve as an inspiration for future generations.In recognition of her significant contribution to the Nation, I have directed that she be accorded a State Assisted funeral. May I, on behalf of the ruling Party ZANU (PF), the Government of Zimbabwe, my family and indeed on my own behalf, express my deepest condolences to the Chatukuta family over this painful loss. May the family take comfort in the knowledge that the entire nation of Zimbabwe joins them in mourning the late Justice Chatukuta.May her dear soul rest in eternal peace.\n\nE.D MnangagwaPresident of the Republic of Zimbabwe\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The government has extended state state-assisted funeral to Supreme Court Judge Feliciah Chatukuta.  Justice Chatukuta  passed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/state-assisted-funeral-for-justice-chatukuta/\">Continue reading<span class=\"screen-reader-text\"> \"State Assisted Funeral For Justice Chatukuta\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Disabled People Tell Emmerson: Toda Zhira DzemaSoldier Not Zva Wicknell | HOURLY CARTOON",
            "url": "https://www.zimeye.net/2025/11/27/disabled-people-tell-emmerson-today-zhira-dzemasoldier-not-zva-wicknell-hourly-cartoon/",
            "content": "By Dorrothy Moyo | Imaginary Story Behind the Cartoon:\n\nThe Forked Path: Emmersons Choice\n\nIn a ghostly sketch of a fractured republic, a worn and ragged Emmerson Mnangagwa pushes a wheelchair-bound veteran through the dusty, broken avenues of a forgotten revolution. The man in the wheelchair is no ordinary citizenhe is a living sacrifice, a soldier-turned-ghost of Zimbabwes liberation war, now maimed and discarded. His hand is outstretched, not in desperation, but in guidance. He points aheadnot toward comfort or riches, but toward dignity, sacrifice, and the true legacy of Zimbabwes soldiers.\n\nHe pleads:\n\nToda nzira dzemaSoldier kwete zvaWicknell.\n\n(We want the soldiers path, not Wicknells deception.)\n\nBefore them, in polished boots and blinding medals, stand two uniformed officersdecked in honor, but bloated with vanity. They are unmoved by the veterans plea. One laughs behind dark sunglasses. These are not defenders of the people. These are actors in a theatre of power.\n\nMnangagwa has a choice. Behind him is the pastbattles fought, blood spilled. Before him, two diverging roads: one toward the authentic values of liberation carried in the wounded body of the veteran; the other, toward fabricated glories and wealth without sacrifice, the world of Wicknells toys and military cosplay.\n\nBut the irony is sharp: Emmerson is already pushing forward, not toward the soldiers road, but toward the illusiontoward the medals that mean nothing and the uniforms stitched by looters. In doing so, he drags the very soul of Zimbabwethe wounded veteranwith him, helpless, disillusioned.\n\nIt is a betrayal drawn in pencil, yet heavier than ink.\n\nAnd the road leads only to darkness.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Imaginary Story Behind the Cartoon: “The Forked Path: Emmerson’s Choice” In a ghostly sketch of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/disabled-people-tell-emmerson-today-zhira-dzemasoldier-not-zva-wicknell-hourly-cartoon/\">Continue reading<span class=\"screen-reader-text\"> \"Disabled People Tell Emmerson: Toda Zhira DzemaSoldier Not Zva Wicknell | HOURLY CARTOON\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Police Officers Catch Car Robber Suspects",
            "url": "https://www.zimeye.net/2025/11/27/police-officers-catch-car-robber-suspects/",
            "content": "Police officer asks: At what time did you steal the car? Half past 2, replies one suspect.\n\nAnd what time is it right now?, the officer demands to know, stressing that in Zimbabwe if you steal youll be arrested on the same day.\n\nThese ZRP @PoliceZimbabweofficers are captured on camera interrogating three suspects.\n\nThe suspects were arrested on the same day of committing the crime and were allegedly found in the process of stripping the stolen vehicle for parts.\n\nPolice officer asks: At what time did you steal the car? Half past 2, replies one suspect.And what time is it right now?, the officer demands to know, stressing that in Zimbabwe if you steal youll be arrested on the same day.These ZRP@PoliceZimbabweofficers arepic.twitter.com/kT3Z70Iqmm\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Police officer asks: At what time did you steal the car? “Half past 2,” replies one suspect. And what time … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/police-officers-catch-car-robber-suspects/\">Continue reading<span class=\"screen-reader-text\"> \"Police Officers Catch Car Robber Suspects\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        },
        {
            "title": "Thousands Expected at Paul Mwazha’s Burial",
            "url": "https://www.zimeye.net/2025/11/27/thousands-expected-at-paul-mwazhas-burial/",
            "content": "By A CorrespondentThousands of congregants and followers are expected to gather this Sunday at Chirasauta in Manicaland for the burial of African Apostolic Church founder Archbishop Paul Mwazha, following the familys firm rejection of government plans to have him interred at the National Heroes Acre.\n\nThe decision has sparked national debate, as the ZANU PF-led government had moved swiftly to claim control of the funeral after President Emmerson Mnangagwa conferred national hero status on the revered cleric. The National Heroes Acre has long been used by the ruling party to project political authority and symbolically claim ownership of influential figures.\n\nInstead, Mwazhas family insisted on a private burial aligned with church traditions  a rare but significant refusal that disrupts ZANU PFs longstanding practice of hijacking high-profile funerals for political gain. Over the years, the ruling party has used state-assisted funerals to command loyalty, sanitise its image, and reinforce its dominance over public memory.\n\nIn Mwazhas case, the political manoeuvring had been increasingly pronounced. Senior ZANU PF officials had been publicly courting him ahead of key political events, and he recently received a luxury vehicle and large cash donations from businessman and convicted fraudster Wicknell Chivayo, widely believed to be one of the ruling partys chief financiers. The gifts fuelled speculation that ZANU PF was attempting to leverage Mwazhas immense spiritual following for political mileage.\n\nFamily spokesperson Dr Masimba Mwazha confirmed that the funeral would follow strictly private and church-based protocols.\n\nThe body of the national hero will leave Harare on Saturday for Chikomba District, where everyone will be gathered. The body will depart for Chirasauta on Sunday for burial at a private function, he said.\n\nArchbishop Mwazha died last Thursday and was immediately declared a national hero by Mnangagwa, who praised his leadership within African Independent Churches and his spiritual influence on millions. ZANU PF National Chairperson Oppah Muchinguri-Kashiri, accompanied by CIO Minister Lovemore Matuke, visited the family home in Hatfield to deliver the Presidents condolence message.\n\nArchbishop Mwazha played an important role during the liberation struggle and post-independence in promoting peace and Christianity, Muchinguri-Kashiri said.\n\nBorn on 25 October 1918 at Holy Cross Mission in Chirumanzu, Mwazha became one of the most influential leaders in African Independent Churches, his ministry shaped by accounts of divine encounters and a lifelong commitment to spiritual renewal.\n\nHis burial outside the National Heroes Acre marks a powerful assertion of family and church autonomy  a quiet but resolute pushback against the ruling partys attempt to turn the passing of a religious icon into a political spectacle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Thousands of congregants and followers are expected to gather this Sunday at Chirasauta in Manicaland for the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/27/thousands-expected-at-paul-mwazhas-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Thousands Expected at Paul Mwazha’s Burial\"</span></a></p>",
            "time": "18:35",
            "date": "27 Nov 2025"
        }
    ]
}