{
    "news": [
        {
            "title": "Two Soldiers Bash Colleague To Death",
            "url": "https://www.zimeye.net/2025/05/19/two-soldiers-bash-colleague-to-death/",
            "content": "By A Correspondent\n\nTwo members of the Zimbabwe National Army (ZNA) are standing trial at the High Court in Masvingo for allegedly beating a fellow soldier to death during a violent altercation at a nightclub.\n\nThe accused, Prosper Ncube (35) and Innocent Mazvuru (36), both stationed at Infantry 4/2 Brigade in Gutu, are alleged to have fatally assaulted Simbarashe Albert Gamaan army officer based in Harareon 28 April 2024 during the early hours of the morning at MDD Nightclub near Mpandawana Growth Point.\n\nAccording to court records, the confrontation began when the two accused men questioned Gamas military identity after he claimed to be a soldier. When Gama failed to produce his military ID, they allegedly restrained him with a shoelace and began a brutal assault.\n\nEyewitnesses reported that Gama was repeatedly punched and kicked in the face until he bled and collapsed. Efforts to intervene by a barman, Cephas Mudyiwa, and patron Hardlife Maheya, were allegedly rebuffed by the accused.\n\nProsecutors allege that after assaulting Gama, the two soldiers took US$45 and a mobile phone from his pocket before fleeing the scene.\n\nMilitary Police officer Tapera Mbizvo responded to the incident and found Gama unconscious. He was first taken to the 4/2 Camp Battalion Clinic before being transferred to Gutu Mission Hospital and later to Josiah Magama Tongogara Army Hospital in Harare. Despite medical intervention, he succumbed to his injuries two weeks later.\n\nThe trial is being presided over by Justice Helena Charewa. Innocent Mazvuru is represented by Omen Mafa of Mutendi, Mudisi and Shumba Legal Practitioners.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two members of the Zimbabwe National Army (ZNA) are standing trial at the High Court in Masvingo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/two-soldiers-bash-colleague-to-death/\">Continue reading<span class=\"screen-reader-text\"> \"Two Soldiers Bash Colleague To Death\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Fresh farm invasions in Matabeleland",
            "url": "https://www.zimeye.net/2025/05/19/fresh-farm-invasions-in-matabeleland/",
            "content": "MARSHLANDS FARMMARULA DISTRICT ( MANGWE)\n\nThis is a legal conservancy being run with valid high court order issued in 2020\n\nWomen doing talking is Mary Mliswa who was ex Resident Minister Mashonaland West.\n\nMTHWAKAZI REPUBLIC PARTY [MRP] PRESS STATEMENASZANU-PF THUGS RE-START ILLEGAL FARM INVASIONS IN MATABELELAND\n\nThe Mthwakazi Republic Party (MRP) has learned with shock and outrage about the new wave of illegal farm invasions in Matabeleland. Our President, Cde Thembisani Mfulongatshi Mpofu, witnessed firsthand the unlawful activities when he and other party leaders visited a group of disgruntled white farmers.\n\nThese farm invasions are a clear demonstration of ZANU-PFs disregard for the law and the rights of citizens in Matabeleland. Farms such as Sentinel in Beitbridge, forcefully grabbed by Kembo Mohadi, and WestAcre farm along Plumtree road, partially taken by a ZANU-PF member, are just a few examples of this egregious behavior. The ZANU-PF party members and Central Intelligence Organization Officials are reportedly targeting a number of farms in Matabeleland, which include Marula FARM Marshlands owned by Zeitsman, they are threatening to kill Mrs Knott if she doesnt vacate the farm, the White farmers are no longer feeling safe.\n\nAs a party, we say nothing for us without us. If you want to invade farms, go and do it in Mashonaland. We in Matabeleland will not sit idly by while people come from Mashonaland East to take our land by force. This is a blatant disregard for the Constitution of Zimbabwe, specifically Section 71, which guarantees the right to property.\n\nThese actions also contravene international law, including the Universal Declaration of Human Rights, Article 17, which states that everyone has the right to own property alone or in association with others. Furthermore, the African Charter on Human and Peoples Rights, Article 14, guarantees the right to property.\n\nThe MRP will not stand idly by while our citizens are threatened and intimidated. We will protect the rights of all citizens by all means necessary. We call on the authorities to take immediate action to stop these illegal activities and uphold the rule of law. We urge people from Mashonaland to refrain from using ZANU-PF to occupy our land by force.\n\nWe demand that the government takes immediate action to:\n\nThe MRP will continue to advocate for peace, justice, and the protection of our citizens rights.\n\nMRP For Peace And Justice In Our LifetimeSisonke Sibambene SinguMthwakazi Sesikulungisa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "MARSHLANDS FARMMARULA DISTRICT ( MANGWE) This is a legal conservancy being run with valid high court order issued in 2020 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/fresh-farm-invasions-in-matabeleland/\">Continue reading<span class=\"screen-reader-text\"> \"Fresh farm invasions in Matabeleland\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Emotional Send-off For Sensei Mugove Muhambi",
            "url": "https://www.zimeye.net/2025/05/19/emotional-send-off-for-sensei-mugove-muhambi/",
            "content": "Prominent fitness trainer and martial arts expert, Sensei Mugove Muhambi, was laid to rest at Epworth Cemetery following a moving and well-attended farewell.\n\nMuhambi, who tragically lost his life in a road traffic accident on Saturday, was remembered as a distinguished sports figure and a unifying presence within Zimbabwes fitness and wellness circles.\n\nThousands of mourners joined the funeral procession, which brought traffic to a standstill from his St Martins residence through Seke Road and Chiremba Road, a testament to the profound impact he had on the community.\n\nAmong the dignitaries who attended to pay their respects were Sports, Recreation, Arts, and Culture Minister Lieutenant General (Rtd) Anselem Sanyatwe, Deputy Minister Emily Jesaya, and Finance and Economic Development Permanent Secretary George Guvamatanga.\n\nSensei Mugo, as he was affectionately known, is survived by his wife and two children. His legacy as a mentor, motivator, and community pillar will be cherished by all who knew him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Prominent fitness trainer and martial arts expert, Sensei Mugove Muhambi, was laid to rest at Epworth Cemetery following a moving … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/emotional-send-off-for-sensei-mugove-muhambi/\">Continue reading<span class=\"screen-reader-text\"> \"Emotional Send-off For Sensei Mugove Muhambi\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Mnangagwa Ignores Nikita Mangena’s  Widow",
            "url": "https://www.zimeye.net/2025/05/19/mnangagwa-ignores-nikita-mangenas-widow/",
            "content": "By A Correspondent- The government has ignored the widow of the late national hero and legendary ZIPRA commander, Rodgers Alfred Nikita Mangena, Mrs Sikhubekiso Madeya Mangena, who died last week.\n\nMr Mangena passed away last Sunday and was laid to rest at the Nkulumane Provincial Heroes Acre.\n\nMrs Mangena was granted liberation war heroine status instead of being given national heroine status.Mrs Mangena was one of the women who carried the struggle forward by supporting soldiers. She is one of the women who were dedicated to supporting the liberation struggle, Zanu PF Secretary General, Obert Mpofu said.\n\nThe late Mrs Mangena contributed to the liberation struggle through resource mobilisation during the armed struggle for independence.Let us take a leaf from the Mangenas, their dedication to the struggle is something that should be emulated, Zanu PF Bulawayo Provincial chairman, Jabulani Sibanda said.\n\nLotshe Mangena, the only surviving child of the Mangenas, extended appreciation to the government for also recognising the supportive role played by his mother in the liberation struggle.\n\nI want to thank the government for granting my mother this status. It goes to show that the role played by women during the liberation struggle is also recognised, he said.\n\nThe late Mrs Mangena is survived by her son Lotshe, and nine grandchildren.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- The government has ignored the widow of the late national hero and legendary ZIPRA commander, Rodgers Alfred … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/mnangagwa-ignores-nikita-mangenas-widow/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ignores Nikita Mangena’s  Widow\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Gukurahundist finally gets a handshake in Rome",
            "url": "https://www.zimeye.net/2025/05/19/gukurahundist-finally-gets-a-handshake-in-rome/",
            "content": "A picture tells a thousand words. Vice President Constantino Chiwenga and his Wife in Rome. Mary Mubaiwa still longing to see her children.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A picture tells a thousand words. Vice President Constantino Chiwenga and his Wife in Rome. Mary Mubaiwa still longing to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/gukurahundist-finally-gets-a-handshake-in-rome/\">Continue reading<span class=\"screen-reader-text\"> \"Gukurahundist finally gets a handshake in Rome\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Top SA DJ Short-Changes Zim Mapiano Lovers",
            "url": "https://www.zimeye.net/2025/05/19/top-sa-dj-short-changes-zim-mapiano-lovers/",
            "content": "By Showbiz Reporter-Top South African Amapiano DJ Kelvin Momo left Zimbabwean fans fuming on Saturday night after a disappointing performance at the much-hypedCarpe Diem Season 2, held at First Capitalk Sports Club in Harare.\n\nThe event, which had been marketed as a premium celebration of Africas top electronic music talent, turned sour after headline act Kelvin Momo arrived more than two hours late for his set. Momo showed up at 10:30 PMwell past his scheduled performance time of 8:00 PMand played for less than an hour before abruptly ending his set, leaving fans frustrated and short-changed.\n\nThe event had kicked off at 3 PM and drew hundreds of Amapiano enthusiasts, many of whom had forked out as much as US$30 for VIP access in anticipation of extended sets by top-tier DJs.\n\nI feel robbed. We came here expecting at least three hours of Kelvin Momo, but he barely played. For what we paid, this is unacceptable, said one disgruntled fan.\n\nAnother headline act, Kabza De Small, also failed to deliver a memorable set, further dampening the spirits of attendees who had braved the evening chill in hopes of a musical feast under the stars.\n\nCarpe Diem had promised an electrifying showcase of Africas finest Amapiano talent. The lineup included Kelvin Momo, Kabza De Small, DJ Madeherbelieve, DJ Ash T, DJ Sfiso, Thakzin, DJ Tapiwa, Mimi, and Jay, with organizers marketing the event as a one-of-a-kind celebration of the continents vibrant electronic music scene.\n\nThe Carpe Diem series has grown into a signature event in Zimbabwes entertainment calendar, celebrated for its fusion of sound, culture, and community. The first season featured over 12 DJs from across Africa and was praised for its high energy and pan-African spirit. It was this track record that raised expectations for an even better Season 2.\n\nSet in the relaxed, open-air setting of First Capitalk Sports Club, the event encouraged fans to bring picnic blankets, cooler boxes, and charcoal heaters to create a laid-back, communal atmosphere. But for many, the night ended on a sour note due to poor time management and what fans described as unprofessional conduct by the headline performers.\n\nDespite the backlash, the event organizers, led by seasoned promoter Walter Wanyanya, were praised for maintaining high production values and ensuring a safe and inclusive environment. However, many now say the credibility of the Carpe Diem brand could suffer if headline artists fail to respect fans and deliver promised performances.\n\nWith social media abuzz with disappointed reactions and calls for refunds, it remains to be seen whether Carpe Diem can bounce back and restore confidence among its loyal fan base.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Top South African Amapiano DJ Kelvin Momo left Zimbabwean fans fuming on Saturday night after a disappointing performance … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/top-sa-dj-short-changes-zim-mapiano-lovers/\">Continue reading<span class=\"screen-reader-text\"> \"Top SA DJ Short-Changes Zim Mapiano Lovers\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Central Region Soccer League Match Abandoned After Fan Stabbing Incident",
            "url": "https://www.zimeye.net/2025/05/19/central-region-soccer-league-match-abandoned-after-fan-stabbing-incident/",
            "content": "A Central Region Soccer League match between Shabanie Mine and Gwanda Pirates was abandoned in the 68th minute after a disturbing incident of fan violence. The match, played at Maglas Stadium, took a dark turn when fans of the two teams clashed in the stands, resulting in a fan being stabbed with a knife.\n\nThe violent outbreak marred what should have been an exciting football match, with the safety and well-being of spectators compromised. The incident has raised concerns about security measures at football matches and the behavior of fans.\n\nDetails surrounding the incident are still emerging, but its clear that the situation escalated quickly, prompting match officials to abandon the game. The authorities are likely to investigate the incident and take necessary actions to prevent such occurrences in the future.\n\nThe abandonment of the match serves as a stark reminder of the importance of maintaining safety and security at sports events. Football is meant to be a source of entertainment and unity, not violence and harm.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Central Region Soccer League match between Shabanie Mine and Gwanda Pirates was abandoned in the 68th minute after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/central-region-soccer-league-match-abandoned-after-fan-stabbing-incident/\">Continue reading<span class=\"screen-reader-text\"> \"Central Region Soccer League Match Abandoned After Fan Stabbing Incident\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Mushekwi Shines Bright at Dalian Kun City with Red-Hot Goal-Scoring Form",
            "url": "https://www.zimeye.net/2025/05/19/mushekwi-shines-bright-at-dalian-kun-city-with-red-hot-goal-scoring-form/",
            "content": "Sports Correspondent\n\nVeteran Zimbabwean striker Nyasha Mushekwi has continued his impressive scoring run at his new Chinese League One side, Dalian Kun City.\n\nThe 37-year-old joined the club ahead of the 2025 season after parting ways with Yunnan Yukun, who were promoted to the Chinese Super League in 2024. Despite his age, Mushekwi has remained a potent force in front of goal, netting six goals in nine appearances to become Dalian Kun Citys top scorer.\n\nHis most recent strike came in a 2-1 victory over SZ Juniors on Friday, underscoring his value to the team and his enduring class on the pitch.\n\nMushekwis stellar form adds to a distinguished career in China, where he has now scored over 100 goals across both the Super League and League One since his move in 2016.\n\nThough currently trailing the leagues top scorer, Guy Mbenza of LN Tieren, by five goals, Mushekwis consistency continues to be a key asset for his club as they push for success this season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Veteran Zimbabwean striker Nyasha Mushekwi has continued his impressive scoring run at his new Chinese League One side, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/mushekwi-shines-bright-at-dalian-kun-city-with-red-hot-goal-scoring-form/\">Continue reading<span class=\"screen-reader-text\"> \"Mushekwi Shines Bright at Dalian Kun City with Red-Hot Goal-Scoring Form\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Army Revolt Rumours Dismissed as “Deadly Nonsense” — VP Chiwenga Returns from Rome Amid Turmoil",
            "url": "https://www.zimeye.net/2025/05/19/army-revolt-rumours-dismissed-as-deadly-nonsense-vp-chiwenga-returns-from-rome-amid-turmoil/",
            "content": "Army Revolt Rumours Dismissed as Deadly Nonsense  VP Chiwenga Returns from Rome Amid Turmoil\n\nBy A Correspondent | ZimEye | 19 May 2025  Harare, Zimbabwe | Government sources have strongly dismissed swirling reports claiming the Zimbabwe Defence Forces (ZDF) held a private meeting today without Vice President Constantino Chiwenga and President Emmerson Mnangagwa, and that they had withdrawn security personnel from the two leaders.\n\nThere is no such development, a senior government source told ZimEye on Monday. The murmurs are there, that the VP has let them down. But the army cannot withdraw security from the president and they cannot meet privately and publish it. They will be killed straight away.\n\nThe sources insisted that any authentic military arrangements of such a sensitive nature would never be made public. If the army arranges something, it will never be published, one source said, shutting down speculation of a brewing military revolt.\n\nThe Vice President, who reportedly returned from Rome today, has not commented on the rumours. Meanwhile, ZDF Commander General Valerio Sibanda was confirmed to have been attending a presidential agricultural meeting focused on the arrival of goats and sheep from Belarus  a project already drawing internal criticism over a lack of veterinary expertise and practical benefit to the armed forces.\n\nWhile government insists that the presidents security remains intact, the source acknowledged that ordinary army personnel can withdraw security from the Vice President, but not from the President. Thats impossible.\n\nPresidential Spokesman George Charamba had not commented at the time of writing.\n\nThe controversy was sparked by reports that army commanders had convened without their superiors to protest years of poor conditions, particularly the deteriorating welfare of soldiers. In 2022, Defence Minister Oppah Muchinguri-Kashiri publicly lamented that soldiers had been reduced to rations of just sadza and beans, with many living in townships under squalid conditions due to lack of barracks accommodation.\n\nOur forces are renting accommodation and theyre being insulted daily, Muchinguri told Parliament. Sometimes they go without food, even uniforms  these are constitutional requirements.\n\nDespite the denials, deep internal frustrations remain evident. Other legislators have repeatedly warned that the governments continued neglect of the army and police forces could become a national security threat.\n\nMuchinguri herself is still to respond to viral accusations by war veteran is that she is receiving US$30,000 from corrupt people in order to block the constitutional removal of the president.\n\nStill, the official message seemed repeatedly clear by mid afternoon Monday: no mutiny has taken place, and any attempt by the military to independently challenge presidential authority would be met with instant consequences.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Army Revolt Rumours Dismissed as “Deadly Nonsense” — VP Chiwenga Returns from Rome Amid Turmoil By A Correspondent | ZimEye … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/army-revolt-rumours-dismissed-as-deadly-nonsense-vp-chiwenga-returns-from-rome-amid-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"Army Revolt Rumours Dismissed as “Deadly Nonsense” — VP Chiwenga Returns from Rome Amid Turmoil\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        },
        {
            "title": "Zivhu Claims Mnangagwa Can’t Be Removed Overnight, Do You Agree?",
            "url": "https://www.zimeye.net/2025/05/19/zivhu-claims-mnangagwa-cant-be-removed-overnight-do-you-agree/",
            "content": "By A Correspondent\n\nControversial Zanu PF politician and former legislator Killer Zivhu has sparked heated debate after declaring that President Emmerson Mnangagwa cannot be ousted from office in a matter of months, dismissing the oppositions push for his removal as a joke.\n\nSpeaking over the weekend, Zivhu argued that Mnangagwas rise to power was the result of decades of political groundwork, and any attempt to remove him hastily would be futile.\n\nThe main point many are missing is that it took ED over 50 years to prepare himself to be President, said Zivhu.\n\nYet, some people want to remove him in just three months. Its a joke.\n\nHe directed his criticism at war veteran Blessed Geza, who has openly challenged Mnangagwas leadership.\n\nGeza spent most of his time insulting people. Now, he wants to remove ED urgently. It wont happen, Zivhu added.\n\nIn a separate post, Zivhu questioned the effectiveness of Zimbabwes educated populace, suggesting that despite high literacy levels, the country still struggles with poor decision-making and lack of progress.\n\nHonest discussion: Despite having educated citizens, Zimbabwe faces economic and infrastructure challenges. Whats the disconnect? Is education being utilized effectively for national development? Kana kuti ringori dzungu rokuti takadzidza, hapana zviripo madhti chete,* he said, using blunt language that drew strong reactions online.\n\nZivhu, known for his outspoken and often unfiltered commentary, has previously clashed with both ruling party elites and opposition figures. His latest remarks have once again placed him at the center of political discourse, as the country inches toward the next electoral cycle with growing tension and uncertainty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF politician and former legislator Killer Zivhu has sparked heated debate after declaring that President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/19/zivhu-claims-mnangagwa-cant-be-removed-overnight-do-you-agree/\">Continue reading<span class=\"screen-reader-text\"> \"Zivhu Claims Mnangagwa Can’t Be Removed Overnight, Do You Agree?\"</span></a></p>",
            "time": "08:42",
            "date": "20 May 2025"
        }
    ]
}