{
    "news": [
        {
            "title": "Horror Crash Along Seke Road Near Zororo Cemetery",
            "url": "https://www.zimeye.net/2025/10/09/horror-crash-along-seke-road-near-zororo-cemetery/",
            "content": "By A Correspondent A serious road traffic accident occurred this morning alongSeke Road, oppositeZororo Cemetery.\n\nEyewitnesses reported that several vehicles were involved in the collision, with emergency services rushing to the scene shortly after the crash.\n\nThe extent of injuries and fatalities could not be immediately confirmed, but witnesses described the accident as horrific.\n\nThe accident site, nearManyame Bridge, has become notorious for road tragedies in recent months. Just recently, anotherfatal crashoccurred in the same area, claiming several lives and raising renewed concerns about speeding, reckless driving, and poor road signage along the Seke Road stretch linking Harare to Chitungwiza.\n\nThe area aroundZororo Cemetery, which lies a few kilometres from the Harare city limits, has increasingly become a danger zone for motorists, particularly during peak hours when traffic is heavy. Local residents have long called on authorities to improve road safety measures, including speed humps, visible signage, and increased police patrols.\n\nAccident along seke rd opposite zororo cemetry just nowpic.twitter.com/jpZclxhZZu\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A serious road traffic accident occurred this morning along Seke Road, opposite Zororo Cemetery. Eyewitnesses reported that several … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/09/horror-crash-along-seke-road-near-zororo-cemetery/\">Continue reading<span class=\"screen-reader-text\"> \"Horror Crash Along Seke Road Near Zororo Cemetery\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "Joy For Zimbos As SA Extends ZEPs",
            "url": "https://www.zimeye.net/2025/10/09/joy-for-zimbos-as-sa-extends-zeps/",
            "content": "South Africa- The South African government, through the Home Affairs Ministry, has extended the Zimbabwe Exemption Permit (ZEP) until May 28, 2027.\n\nThe announcement was formalized through the Ministers Immigration Directive No. 21 of 2025, seen by IOL, and affects approximately 180,000 ZEP holders living in South Africa.\n\nThe ZEP programme, first introduced in 2017, was designed to regularize the status of Zimbabwean nationals residing in South Africa under the previous Zimbabwean Dispensation Permit. However, in December 2021, the Department of Home Affairs announced the discontinuation of ZEP, giving holders until December 31, 2022, to transition to other visa categories.\n\nThat decision faced legal challenges, and in 2023, the Johannesburg High Court ruled that the termination of ZEP had been unlawful, directing the government to reconsider the matter through a fair and lawful process.\n\nThe latest extension grants ZEP holders several protections:\n\nProtection from deportation: Holders cannot be arrested, detained, or deported for lacking a valid exemption certificate.\n\nEntry and exit flexibility: ZEP holders may enter and depart South Africa under certain conditions while complying with other entry requirements.\n\nSimplified application process: When applying for other visas or temporary permits, holders are not required to produce a valid exemption certificate.\n\nThe government has also indicated that consultations with affected ZEP holders and stakeholders will continue to determine the long-term future of the program. The Immigration Advisory Board is being reactivated to ensure compliance with the High Courts directive and facilitate fair consultation.\n\nThe extension provides ZEP holders with crucial time to regularize their immigration status, apply for mainstream visas, or make arrangements to leave South Africa. Officials emphasize that this move demonstrates the governments commitment to a lawful and fair immigration process.\n\nZEP holders are encouraged to consult the Department of Home Affairs for further guidance and updates. IOL\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa- The South African government, through the Home Affairs Ministry, has extended the Zimbabwe Exemption Permit (ZEP) until May … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/09/joy-for-zimbos-as-sa-extends-zeps/\">Continue reading<span class=\"screen-reader-text\"> \"Joy For Zimbos As SA Extends ZEPs \"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "ZEPs Extended for Another Two Years",
            "url": "https://www.zimeye.net/2025/10/09/zeps-extended-for-another-two-years/",
            "content": "South Africa Home Affairs Minister Dr. Leon Schreiber has announced a further two-year extension of the Zimbabwe Exemption Permit (ZEP), giving thousands of Zimbabwean nationals more time to regularize their stay in South Africa.\n\nAccording toImmigration Directive No. 21 of 2025, seen byIOL, the new deadline for ZEP validity isMay 28, 2027. The decision affects an estimated180,000 Zimbabweanswho currently live, work, and study in South Africa under the exemption programme.\n\nTheZEPwas first introduced in2017, replacing the earlierZimbabwean Dispensation Permit (ZDP). The initiative was intended to regularize the status of Zimbabwean nationals who had fled economic and political instability back home.\n\nHowever, inDecember 2021, the Department of Home Affairs announced plans to discontinue the ZEP, giving holders untilDecember 31, 2022, to migrate to other visa categories. That move sparked public outcry and legal challenges from civil society groups who argued that the decision was unconstitutional and would cause mass displacement.\n\nInJune 2023, theJohannesburg High Courtruled that the governments termination of the ZEP wasunlawful and procedurally unfair, ordering the department to undertake a fresh consultation process before making any new determination.\n\nDr. Schreibers latest directive effectively complies with that court order, providing ZEP holders withlegal protection and temporary stabilitywhile consultations continue. The extension includes the following key provisions:\n\nThe minister also confirmed that theImmigration Advisory Boardwill be reactivated to facilitate fair consultations and ensure compliance with the High Court directive.\n\nOfficials say the extension aims to strike a balance betweenSouth Africas immigration controlandhumanitarian considerationsfor long-term Zimbabwean residents who have contributed to the countrys economy.\n\nZEP holders are encouraged to seek updated information and guidance from the Department of Home Affairs as the government works toward a long-term solution.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa – Home Affairs Minister Dr. Leon Schreiber has announced a further two-year extension of the Zimbabwe Exemption Permit (ZEP), … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/09/zeps-extended-for-another-two-years/\">Continue reading<span class=\"screen-reader-text\"> \"ZEPs Extended for Another Two Years\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "Kazembe In Trouble Over Illegal Detention",
            "url": "https://www.zimeye.net/2025/10/09/kazembe-in-trouble-over-illegal-detentionkaze/",
            "content": "By A Correspondent  Home Affairs ministry and the Department of Immigration stand accused of operating a parallel justice system after immigration officers allegedly re-arrested and continued to detain a Chinese national weeks after a magistrate ordered his release.\n\nYin Xuntao, a mechanical engineer employed by Zhigao Machinery in Harare, was arrested on 8 August on allegations of money-laundering, exchange-control breaches and firearm offences. A magistrate granted him bail the following day, ordering him to surrender his passport and to deposit US$500. Instead of being released, lawyers say Yin was immediately taken into the custody of immigration officers acting under the Home Affairs ministry and the chief immigration officer, and has been held on what his counsel describe as an extra-judicial warrant  a procedure that lawyers say has no basis in law.\n\nYins legal team at Mahuni Gidiri Law Chambers argues that the conduct amounts to contempt of court and an unlawful subversion of Zimbabwes justice system. The firm says Yin holds a valid temporary employment permit and an investment licence through the Zimbabwe Investment and Development Agency and is not a prohibited person subject to deportation  meaning immigration had no lawful ground to detain him after bail was granted. His lawyers have filed an urgent High Court application seeking his release.\n\nUnder Zimbabwe law the Constitution guarantees that no person  citizen or foreigner  may be detained without trial. Section 50 requires that anyone arrested must be released or brought before a court as soon as possible but not later than forty-eight hours after arrest. If a person is not brought before a court within that 48-hour period they must be released unless a competent court has earlier extended detention.\n\nUntil recently, the Immigration Act contained a provision (section 8(1)) that permitted immigration officers to detain persons for extended periods pending removal. In a landmark judgment handed down on 12 November 2024, High Court Judge Christopher Dube-Banda declared section 8(1) inconsistent with section 50(2)(b) of the Constitution and therefore invalid  holding that immigration officers may not lawfully detain foreign nationals beyond the 48-hour constitutional limit without judicial oversight. That judgment remains binding and has been relied on by human-rights lawyers to challenge lengthy immigration detention.\n\nDespite that ruling, rights groups and litigants say the practice of using immigration powers to hold people beyond constitutional limits has continued, with repeated reports of arbitrary or prolonged detention of activists, opposition figures and migrants. International monitors and local NGOs including Amnesty International and Zimbabwe Lawyers for Human Rights have documented a pattern of arrests and detentions that raise serious human-rights concerns. Legal commentators also note a long history of litigation in Zimbabwe challenging detention without trial that pre-dates the 2013 Constitution.\n\nThe Department of Immigration in Zimbabwe falls within the portfolio of the Ministry of Home Affairs (sometimes styled the Ministry of Home Affairs and Cultural Heritage). The ministry is responsible for internal security, the police and immigration and therefore exercises oversight of immigration operations. Official government pages and international reports routinely list the police and the Department of Immigration as agencies under the Home Affairs ministry.\n\nThat administrative link means the minister for Home Affairs  currently Kazembe Kazembe  is the political head of the ministry that includes the immigration service. It does not, however, give immigration officers judicial powers; the Constitution and the High Courts ruling require that detentions comply with the 48-hour rule and with judicial oversight where extensions are sought.\n\nImmigration has turned itself into a shadow court, deciding who stays behind bars even after bail is granted, a Harare lawyer told reporters. This is nothing short of extra-judicial detention. Yins lawyers say repeated written requests for reasons for his continued incarceration have gone unanswered and that he has been kept incommunicado for nearly two months without charge, hearing or explanation.\n\nHuman-rights organisations warn that the persistence of such detentions  despite clear constitutional language and recent High Court authority  undermines the rule of law and risks creating an arbitrary system where administrative agencies effectively circumvent judicial orders. International and local monitors have documented similar patterns of arbitrary arrest and detention in recent years and have called for strengthened accountability and compliance with court rulings.\n\nThe High Court application filed by Yins lawyers will test whether the immigration officers conduct can be justified under law or whether it constitutes unlawful, extra-judicial detention in breach of the Constitution and the Dube-Banda judgment. If the court reiterates that immigration detention must comply with the 48-hour constitutional limit and require judicial oversight for extensions, it could reinforce the 2024 ruling and compel the authorities to change practice. Rights groups say sustained judicial enforcement, transparent record-keeping of detentions, and independent oversight are needed to prevent future abuses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Home Affairs ministry and the Department of Immigration stand accused of operating a parallel justice system … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/09/kazembe-in-trouble-over-illegal-detentionkaze/\">Continue reading<span class=\"screen-reader-text\"> \"Kazembe In Trouble Over Illegal Detention\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "From Corruption to Pageantry: Chivayo Parades Privilege in Nigeria",
            "url": "https://www.zimeye.net/2025/10/09/from-corruption-to-pageantry-chivayo-parades-privilege-in-nigeria/",
            "content": "By A Correspondent\n\nControversial Zanu PF tenderpreneur Wicknell Chivayo, widely viewed as President Emmerson Mnangagwas protege, has once again drawn attention for all the wrong reasons. On Tuesday, Chivayo reportedly invaded the office of the President of Nigeria, a move that critics say reeks of entitlement and political patronage.\n\nOn Wednesday, Chivayo posted a statement dripping with self-aggrandisement and sycophantic flattery, describing his meeting with Nigerian President Bola Ahmed Tinubu in breathless, almost comical terms.\n\nYesterday, I had the UTMOST PLEASURE and an EXCEPTIONAL OPPORTUNITY to meet with one of AFRICAS most accomplished senior STATESMEN His Excellency articulated with surprising PRECISION Nigerias strategic plan This man is truly an ENCYCLOPEDIA OF KNOWLEDGE, Chivayo wrote, in a post that read more like a fan letter than a professional diplomatic briefing.\n\nObservers and social media users were quick to criticise the spectacle. This is the same man who has been accused of inflating government contracts and tender deals in Zimbabwe, said one analyst. Now hes parading himself in Nigeria, acting as if hes a statesman, while ordinary Zimbabweans struggle under Mnangagwas failing governance.\n\nCritics point out the absurdity of Chivayo attempting to link himself to African renaissance narratives while benefiting personally from close ties to Mnangagwas administration. He calls himself rubbing shoulders with the giants of Africa, yet back home hes a symbol of corruption and cronyism, said one political commentator.\n\nChivayos post was filled with hyperbolic praise, calling President Tinubu a FOUNTAIN OF WISDOM, a BEACON OF HOPE, and a true PATRIARCH of the African renaissance. Many Zimbabweans online mocked the tone, questioning why Mnangagwas tenderpreneur is pontificating on governance and economic transformation while failing to deliver meaningful results at home.\n\nThis is exactly the image problem Zimbabwe faces: a ruling elite that rewards loyalty over competence, using pomp and pageantry abroad to mask a country in crisis, added a local social media user.\n\nThe visit, critics argue, highlights not only Chivayos ostentation but also the Mnangagwa regimes penchant for promoting a circle of privileged insiders while ordinary citizens continue to face economic hardship and corruption in high places.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF tenderpreneur Wicknell Chivayo, widely viewed as President Emmerson Mnangagwa’s protégé, has once again drawn … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/09/from-corruption-to-pageantry-chivayo-parades-privilege-in-nigeria/\">Continue reading<span class=\"screen-reader-text\"> \"From Corruption to Pageantry: Chivayo Parades Privilege in Nigeria\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "Mnangagwa Reduces Number of Conference Delegates In Bid To Gag Chiwenga Sympathisers",
            "url": "https://www.zimeye.net/2025/10/09/mnangagwa-reduces-number-of-conference-delegates-in-bid-to-gag-chiwenga-sympathisers/",
            "content": "By A Correspondent\n\nThe upcoming 22nd Zanu PF Annual National Peoples Conference in Mutare is shaping up to be a tightly controlled affair, with President Emmerson Mnangagwas administration reportedly sidelining allies of Vice President Constantino Chiwenga. The gathering, scheduled for October 13 to 18 at the Mutare Polytechnic Pavilion Grounds, will reportedly have a sharply reduced number of delegates and a heavy focus on the economy  though critics say the downsizing is a political maneuver rather than a genuine attempt at efficiency.\n\nIn previous years, the conference drew over 7 000 attendees, but this year it has been cut to roughly 4 000 participants, including foreign delegates and essential service providers. Observers argue that the move is less about streamlining and more about consolidating Mnangagwas control and limiting dissenting voices within the party.\n\nZanu PF Director of Information and Publicity, Farai Marapira, justified the smaller gathering. The party is focused on ensuring that the conference is a convergence of delegates alone, he said. This ensures that we will not have people milling about during closed plenary sessions. This also ensures that attendees are only composed of the true elected representatives of the people.\n\nCritics, however, contend that the true elected representatives phrasing is being used selectively to exclude Chiwenga allies and other internal critics. Its a clear message that only loyalists to Mnangagwa will have a seat at the table, said one political analyst. The so-called streamlining is really about consolidating power and silencing alternative voices within the party.\n\nMarapira added that the structure will improve communication between the leadership and grassroots. The message of the grassroots is, therefore, cascaded up appropriately and the leaderships responses, likewise, cascade down and are communicated properly, he said.\n\nOpposition figures and party insiders argue that such rhetoric is merely performative, designed to project the illusion of inclusion while concentrating decision-making among Mnangagwas inner circle. The accreditation process for delegates began earlier this week at the partys Harare headquarters, reportedly under intense scrutiny to ensure only loyal supporters are approved.\n\nHeld under the theme, Attainment of Vision 2030 through Economic Empowerment and Value Addition, the conference is officially positioned as a platform to consolidate Zanu PFs 2023 electoral mandate and assess the Second Republics development agenda. Critics, however, insist that the gathering is increasingly about internal power plays rather than genuine policy debate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The upcoming 22nd Zanu PF Annual National People’s Conference in Mutare is shaping up to be a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/09/mnangagwa-reduces-number-of-conference-delegates-in-bid-to-gag-chiwenga-sympathisers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Reduces Number of Conference Delegates In Bid To Gag Chiwenga Sympathisers\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "MweneweBhawa Campaign Firms Up as Chipinge Traditional Leadership Takes a Stand Against Child Marriages",
            "url": "https://www.zimeye.net/2025/10/08/mwenewebhawa-campaign-firms-up-as-chipinge-traditional-leadership-takes-a-stand-against-child-marriages/",
            "content": "By Claris Madhuku| The fight against child marriages and teen pregnancies in Chipinge is gaining momentum, thanks to the resolute stand taken by the local traditional leadership. The #MweneweBhawa campaign, popularised by Vemuganga Community Radio from the programming in collaboration with National Aids Council (NAC), has successfully mobilized critical community stakeholders, including all eight chiefs in the district. Their collective resolutions underscore the importance of Ndau culture and values in combating these pressing social issues.\n\nTraditional Leadership at the Forefront\n\nThe traditional leadership in Chipinge plays a pivotal role as gatekeepers of community values. The traditional leadersChief Mahenye, Mupungu, Garahwa, Musikavanhu, Mutema, Gwenzi, Mapungwana, and Ngungunyanahave reached a consensus to uphold cultural values and promote sound family practices. Their resolutions, announced by Chief Garahwas secretary, have established a framework for addressing child marriages and teen pregnancies.\n\nThese resolutions include significant penalties for families that marry off under-age children and impose fines on business owners, referred to as MweneweBhawa, who fail to safeguard minors in their establishments. The chiefs have also banned revealing clothing, emphasizing the need for modesty in the community. This commitment to traditional values is rooted in the belief that child nurturing is a collective responsibility, encapsulated in the adage, it takes a village to raise a child.\n\nTurning Resolutions into Action\n\nWhile the campaign has set the stage for meaningful change, the challenge lies in rallying all stakeholders to enforce these resolutions. It is crucial that these resolutions do not gather dust due to uncoordinated implementation. The community needs comprehensive support from government agencies, NGOs, and civil society organizations to ensure that the advocacy is both implementable and sustainable.\n\nThe National Aids Council (NAC) and various partners, including the Ministry of Child and Health Care, Ministry of Women Affairs, Gender and Community Development, and educational institutions, must coordinate efforts to bring these resolutions to life. The traditional leaderships authority to enforce compliance at the community level can only be effective if backed by legal frameworks.\n\nThe Role of Community Radios\n\nIn this campaign, community radios like Vemuganga FM and Ndau FM are essential for tracking the progress of the #MweneweBhawa initiative. These platforms provide a voice for the community, disseminating information, raising awareness, and fostering dialogue around the resolutions. They help keep the local population informed and engaged, ensuring that the campaign remains relevant and responsive to community needs.\n\nAddressing Criticism and Moving Forward\n\nWhile the resolutions have been met with some criticismparticularly regarding the restrictions on dress codeits important to recognize the intent behind these measures. Critics argue that personal choice should not be compromised. However, supporters, including the Platform for Youth and Community Development (PYCD), emphasize that these resolutions aim to protect youth and preserve cultural values.\n\nBalancing tradition with modernity requires ongoing dialogue and education. The #MweneweBhawa campaign must continue to adapt and evolve, ensuring community goals are met without infringing on individual rights.\n\nConclusion\n\nThe resolutions by Chipinge traditional leadership are crucial in shaping future campaigns against child marriages and teen pregnancies. The remaining challenge lies in uniting all stakeholders to make these resolutions enforceable before the law. By doing so, the advocacy can be made implementable and sustainable, ensuring the well-being of the communitys youth. The continued support of community radios will be vital in keeping the conversation alive and tracking the campaigns progress.\n\n(Claris Madhuku is a political and social commentator whose views expressed in this article belong to him and not necessarily to the institutions he represents).\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Claris Madhuku| The fight against child marriages and teen pregnancies in Chipinge is gaining momentum, thanks to the resolute … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/mwenewebhawa-campaign-firms-up-as-chipinge-traditional-leadership-takes-a-stand-against-child-marriages/\">Continue reading<span class=\"screen-reader-text\"> \"MweneweBhawa Campaign Firms Up as Chipinge Traditional Leadership Takes a Stand Against Child Marriages\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "Michael Nees Speaks On Clash With Bafana Bafana",
            "url": "https://www.zimeye.net/2025/10/08/michael-nees-speaks-on-clash-with-bafana-bafana/",
            "content": "Sports Correspondent\n\nWarriors head coach Michael Nees has shared insights into the teams preparations ahead of their crucial 2026 FIFA World Cup Qualifiers Group C clash against South Africa on Friday.\n\nZimbabwe will take on Bafana Bafana at Moses Mabhida Stadium in Durban, with kick-off set for 6 pm CAT.\n\nAddressing the media ahead of the encounter, Nees emphasized the importance of discipline and strategy in their approach.\n\nWe must be technically disciplined and apply the correct strategy, he said. We want to have all the players in a proper state and we held our second session, where were working on our tactics and strategies. The other sessions will be analysing and trying to transfer these instructions into action.\n\nBy Tuesday, all the called-up players had arrived in camp, with most of them participating in the second training session as preparations intensified for the highly anticipated fixture.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors head coach Michael Nees has shared insights into the team’s preparations ahead of their crucial 2026 FIFA … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/michael-nees-speaks-on-clash-with-bafana-bafana/\">Continue reading<span class=\"screen-reader-text\"> \"Michael Nees Speaks On Clash With Bafana Bafana\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "ZIFA Boss Nqobile Magwizi Lands FIFA Post",
            "url": "https://www.zimeye.net/2025/10/08/zifa-boss-nqobile-magwizi-lands-fifa-post/",
            "content": "Sports Correspondent\n\nZimbabwe Football Association (ZIFA) president Nqobile Magwizi has been appointed to a key position within FIFA, marking a major milestone for local football administration.\n\nMagwizi will serve as a member of the FIFA Commercial and Marketing Advisory Committee for a four-year term running from 2025 to 2029.\n\nThe committee plays a crucial role in shaping global footballs business landscape by advising on and developing strategies to enhance the sports commercial value.\n\nIts responsibilities include formulating and reviewing FIFAs commercial strategies and assessing how member associations are supported in growing their revenue streams and brand presence.\n\nMagwizis appointment comes less than a year after taking over the ZIFA presidency, signaling growing international recognition of his leadership.\n\nIn a related development, another Zimbabwean football administrator, Stanley Nyachowe, has been appointed to the FIFA Football Technology, Innovation and Digital Transformation Committee.\n\nThe appointments were officially confirmed by the Council of Southern Africa Football Associations (COSAFA) on Wednesday.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe Football Association (ZIFA) president Nqobile Magwizi has been appointed to a key position within FIFA, marking a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/zifa-boss-nqobile-magwizi-lands-fifa-post/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Boss Nqobile Magwizi Lands FIFA Post\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        },
        {
            "title": "Unpacking Emmerson Mnangagwa’s Secret Plan To Purge Chiwenga Allies, Capture Zanu PF…",
            "url": "https://www.zimeye.net/2025/10/08/unpacking-emmerson-mnangagwas-secret-plan-topurge-chiwenga-allies-capture-zanu-pf/",
            "content": "THE COUP BEFORE THE CONFERENCE: Inside Mnangagwas Secret Plan to Purge Chiwenga and Capture ZANU-PF  One Affiliate at a Time\n\nBy Reason Wafawarova\n\nThis is not about the party anymore. Its about 2050. Its about the Mnangagwa dynasty. Senior ZANU-PF Insider\n\nThe Calm Before the Purge:\n\nSomething sinister is brewing beneath the polished rhetoric of unity and development.Inside ZANU-PF, where factional loyalty is disguised as patriotism, a parallel political machine is being quietly assembled  one that answers not to the party, not to government, but to a single man and his dynasty ambitions.\n\nOn September 27, a new layer of intrigue unfolded in Mashonaland West, where Tempter Paul Tungwarara  the End Time Message pastor turned Presidential Economic Advisor  distributed US$200,000 to eight hand-picked ZANU-PF affiliates. Each affiliate pocketed US$25,000 from what insiders now call The Presidential Empowerment Fund  a shadowy channel of cash that flows entirely outside the Office of the President and Cabinet.\n\nBut Tungwarara is no civil servant. He doesnt draw a government salary. His official portfolio is as opaque as the fund he presides over. Yet here he is  dispensing cash on behalf of the President, mobilising the kind of loyalty that bypasses party organs and answers directly to the man in power.\n\nThe Rise of the Affiliates Republic:\n\nThese affiliates have become Mnangagwas political militia in suits.They include the familiar roll call of praise choirs: Women for ED, Makorokoza for ED, Varakashi for ED, Hairdressers for ED, and dozens more.\n\nTheir purpose is simple  to replace ZANU-PFs constitutional structures with a parallel command system personally loyal to Mnangagwa.\n\nThe distribution of funds in Mashonaland West was just one act in a larger national script. Similar operations are underway across all ten provinces.\n\nBy the time the ZANU-PF Annual Conference convenes later this month, these affiliates will be smuggled into the event as bona fide delegates  outnumbering and outshouting legitimate structures such as District Coordinating Committees (DCCs), Provincial Coordinating Committees (PCCs), and even the Central Committee itself.\n\nTheyre rewriting the party rulebook using cash and chaos, one insider remarked. Even the Politburo has been turned into a stage prop.\n\nHistory Repeating Itself  2014, Replayed:\n\nThe plan is chillingly familiar.\n\nIt mirrors the 2014 Conference at the Harare International Conference Centre, where Joice Mujurus political career was theatrically annihilated.\n\nBack then, the theatre was perfect  drugged, drunken youths dragging her loyalists through the mud, frenzied chants of Down with the witch!, choreographed chaos dressed up as spontaneous outrage.\n\nThis year, insiders say, the same playbook is being dusted off.Only the target has changed  this time its Vice President Constantino Chiwenga.\n\nThe script is already written:\n\nStage spontaneous demonstrations of disapproval inside the conference.\n\nForge PCC resolutions calling for Chiwengas expulsion.\n\nStamp the forgeries with Central Committee and Politburo approval.\n\nHire affiliate youths to dramatise the chaos.\n\nAnnounce the expulsion amid orchestrated frenzy.\n\nThe Mujuru purge, part two  this time choreographed for dynastic succession.\n\nThe Money and the Men:\n\nBehind Tungwararas pastoral smile lies a consortium of the regimes most powerful financiers:\n\nKudakwashe Tagwirei, Wicknell Chivayo, Scott Sakupwanya, John Paradza, Delish Nguwaya, and others in the so-called Zvigananda Cartel.\n\nTheir money fuels not just politics but propaganda, not just party loyalty but personal worship.\n\nThe Presidential Empowerment Fund they bankroll is less about empowering citizens and more about buying allegiance before a factional showdown.\n\nThat this fund is administered by a pastor from the morally upright End Time Message Church adds an almost biblical irony.\n\nWilliam Branham must be turning in his grave  watching one of his own clergy preside over the most grotesque looting scheme in Zimbabwes history.\n\nZANU-PF at the Edge of Implosion\n\nAs the conference looms, ZANU-PF stands on a knifes edge.\n\nThe DCCs are being sidelined. The PCCs are being stage-managed. The Central Committee is being forged into a tool of convenience.And the Politburo  once the brain of the party  is now a stamp factory for dynastic ambitions.\n\nWhen party structures become props and loyalty becomes currency, implosion is not a possibility  its an inevitability.\n\nPull Quote:This isnt politics anymore. Its theatre. The purge is scripted, the actors are paid, and the ending has already been written. Senior ZANU-PF Official\n\nCOMING NEXT: INSIDE THE SAKUNDA REPUBLIC  THE MAKING OF A DYNASTY\n\nIn the forthcoming expos, we unpack the machinery behind the Presidential Empowerment Fund, the Sakunda network, and the quiet conversion of Zimbabwe into a family-run state corporation.\n\nBrace for the Conference Coup  the purge that will decide the fate of ZANU-PF, and perhaps, of Zimbabwe itself.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "THE COUP BEFORE THE CONFERENCE: Inside Mnangagwa’s Secret Plan to Purge Chiwenga and Capture ZANU-PF — One Affiliate at a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/08/unpacking-emmerson-mnangagwas-secret-plan-topurge-chiwenga-allies-capture-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Unpacking Emmerson Mnangagwa’s Secret Plan To Purge Chiwenga Allies, Capture Zanu PF…\"</span></a></p>",
            "time": "18:44",
            "date": "09 Oct 2025"
        }
    ]
}