{
    "news": [
        {
            "title": "15 Left Dead In Mnangagwa Home Province",
            "url": "https://www.zimeye.net/2025/01/20/15-left-dead-in-mnangagwa-home-province/",
            "content": "By A Correspondent- At least 15 people have died, and 785 households mostly in the Midlands Provincehave been ravaged by unrelenting rains in Zimbabwe.\n\nPresident Emmerson Mnangagwa hails from the same province.\n\nThe devastation, spanning multiple provinces since September last year, has also severely impacted infrastructure, with 118 schools and 13 health facilities damaged, leaving communities vulnerable and services disrupted.\n\nThe Midlands bears the brunt, with 433 households affected, followed by Manicaland (181), Masvingo (46), and Matabeleland North (47).\n\nAmong the hardest-hit facilities is Muponjane Primary School in Zvishavane, where a powerful January 11 storm caused significant damage, exacerbating classroom shortages.\n\nRepair costs are estimated at $8,120, highlighting the financial strain on local institutions.\n\nTwo men remain stranded in Runde River as water levels rise dangerously, prompting urgent rescue missions.\n\nMeanwhile, artisanal miners have faced fatal disasters. In Hwedza, three miners perished in a mine shaft collapse on December 27, with bodies retrieved a week later.\n\nA similar tragedy struck in Mberengwa last Thursday, claiming two lives, while in Mudzi District, three miners remain trapped underground, despite a 24-hour rescue operation led by police, army, and emergency officials.\n\nFlash floods have compounded the crisis, inundating homes in Mbare, Harare, on January 8, underscoring the citys persistent drainage problems.\n\nIn Mashonaland Central, a January 7 storm devastated Avonda Farm, displacing 11 households. Emergency reliefrice, tinned beef, and sanitizershas been distributed, but the response highlights the broader gaps in disaster preparedness.\n\nZimbabwes vulnerabilities to natural disasters have been laid bare, with insufficient infrastructure, poor planning, and stretched resources leaving communities at risk.\n\nAs heavy rains continue, more lives and livelihoods hang in the balance.\n\nWithout comprehensive disaster management reforms, these tragedies may persist, deepening the cycle of destruction and loss.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- At least 15 people have died, and 785 households mostly in the Midlands Province—have been ravaged by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/20/15-left-dead-in-mnangagwa-home-province/\">Continue reading<span class=\"screen-reader-text\"> \"15 Left Dead In Mnangagwa Home Province\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "AI Industry: Strive Masiyiwa Calls Youths To Invest In AI Tech Knowledge",
            "url": "https://www.zimeye.net/2025/01/20/ai-industry-strive-masiyiwa-calls-youths-to-invest-in-ai-tech-knowledge/",
            "content": "By Business Reporter | ZimEye |As the world rapidly evolves into the era of artificial intelligence (AI), job and business opportunities in AI-related fields are booming in the UK and other Western nations. From AI research and development to quantum computing and applications in various industries, a wealth of opportunities has emerged for individuals and businesses alike. Billionaire entrepreneur Strive Masiyiwa is encouraging the global community, particularly Africans, to engage with this wave of innovation by following leaders like Dr. James Manyika.\n\nDr. Manyika, a Zimbabwean-born tech visionary, currently serves as Senior Vice President of Research, Technology, and Society at Google-Alphabet. His work spans advanced AI innovations, quantum computing, and exploring how AI intersects with society. Masiyiwas recent Facebook post highlighted Manyikas inspiring journey and his contributions to global AI advancements, urging others to recognize and learn from great African leaders like him.\n\nMasiyiwas #ShoutOut is part of a broader initiative to spotlight African scientists, researchers, academics, and innovators on the global stage. In his post, he emphasized the importance of celebrating African talent outside traditional areas like politics, sports, and music, focusing instead on the hidden trailblazers driving global progress in science and technology.\n\nAI Job Growth in the UK and Beyond\n\nThe UK, a global leader in AI innovation, has seen an exponential rise in job openings in AI-related fields. These include roles in machine learning, data analysis, robotics, and quantum computing. With companies like Google DeepMind based in the UK, opportunities for skilled professionals and entrepreneurs to contribute to cutting-edge projects have never been more abundant.\n\nThe Western AI ecosystem offers roles ranging from research scientists and software engineers to product managers focusing on AI solutions. Many organizations are also seeking partnerships with startups, creating fertile ground for entrepreneurs to launch AI-driven ventures.\n\nAfrican Representation in AI\n\nMasiyiwas call to action resonates at a time when global AI development requires diverse perspectives to ensure inclusive growth. He pointed out that Manyikas first foray into AI was a paper on neural networks, written while studying in Zimbabwea testament to Africas potential to produce world-class talent.\n\nMasiyiwas broader message is clear: there is an untapped pool of African talent with the ability to lead in global technology advancements. His vision includes not only celebrating existing leaders like Manyika but also inspiring young Africans to explore opportunities in AI and related fields.\n\nMasiyiwas Digital Inclusion Announcement\n\nMasiyiwa is set to make a significant announcement about digital inclusion at the World Economic Forum in Davos on January 21, 2025. While details remain under wraps, he hinted that the initiative would focus on expanding access to technology and empowering underrepresented communities, potentially opening up more opportunities for African participation in global technology development.\n\nEncouragement to Act\n\nMasiyiwas message also challenges individuals to look inward, highlighting that the next tech pioneer could be anyone willing to embrace curiosity and perseverance. His post reflects his belief in the power of education, mentorship, and collaboration to unlock opportunities in the AI sector.\n\nThe billionaires commitment to nurturing African talent and promoting digital inclusion comes at a pivotal moment. As the world embraces the AI revolution, the need for diverse perspectives and global collaboration has never been more urgent.\n\nFor those inspired by Dr. Manyikas story, the time to act is now. Whether through upskilling, entrepreneurial ventures, or joining AI-driven organizations, the opportunities are vast for those ready to take the leap.\n\n#AIRevolution #GlobalInclusion #TechLeadership\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter | ZimEye | As the world rapidly evolves into the era of artificial intelligence (AI), job and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/20/ai-industry-strive-masiyiwa-calls-youths-to-invest-in-ai-tech-knowledge/\">Continue reading<span class=\"screen-reader-text\"> \"AI Industry: Strive Masiyiwa Calls Youths To Invest In AI Tech Knowledge\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Zanu PF Mash West Endorses Mnangagwa 2030 Agenda",
            "url": "https://www.zimeye.net/2025/01/20/zanu-pf-mash-west-endorses-mnangagwa-2030-agenda/",
            "content": "By A Correspondent\n\nThe ruling ZANU PF party has initiated the implementation process of resolutions passed at the National Peoples Conference held in Bulawayo last year. The first Mashonaland West Provincial Coordinating Committee meeting was held in Chinhoyi, where party leadership, led by politburo member Ziyambi Ziyambi, urged members to unite ahead of implementing party resolutions.\n\nZiyambi emphasized that the ruling party has begun the process to support President Emmerson Mnangagwas Vision 2030 agenda. We have the numbers to ensure a smooth implementation of our party resolutions. We must remain united, maintain discipline, and be mindful of our social media use, Ziyambi said.\n\nHe highlighted the presidents initiatives benefiting ordinary citizens, including solving the land issue through title deed issuance. This development comes as ZANU PF intensifies efforts to achieve Mnangagwas 2030 vision, with other provinces like Midlands also reaffirming their commitment to the agenda .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ruling ZANU PF party has initiated the implementation process of resolutions passed at the National People’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/20/zanu-pf-mash-west-endorses-mnangagwa-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Mash West Endorses Mnangagwa 2030 Agenda\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Morocco In Controversial Plan To Slaughter 3 Million Stray Dogs Ahead of 2030 FIFA World Cup",
            "url": "https://www.zimeye.net/2025/01/20/morocco-in-controversial-plan-to-slaughter-3-million-stray-dogs-ahead-of-2030-fifa-world-cup/",
            "content": "Sports Correspondent\n\nMorocco is considering a massive cull of three million stray dogs in preparation for hosting the 2030 FIFA World Cup. The move aims to improve the appearance of its cities, but it has sparked widespread outrage among animal rights activists.\n\nAccording to reports, Morocco already kills around 300,000 street dogs every year. However, the practice has intensified since FIFA announced Morocco as a co-host for the 2030 tournament. Animal welfare advocates are condemning the plan, citing concerns about animal cruelty and the need for more humane solutions to manage stray dog populations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Morocco is considering a massive cull of three million stray dogs in preparation for hosting the 2030 FIFA … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/20/morocco-in-controversial-plan-to-slaughter-3-million-stray-dogs-ahead-of-2030-fifa-world-cup/\">Continue reading<span class=\"screen-reader-text\"> \"Morocco In Controversial Plan To Slaughter 3 Million Stray Dogs Ahead of 2030 FIFA World Cup\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Watch: How Mnangagwa Carefully Planned To Violate Constitution",
            "url": "https://www.zimeye.net/2025/01/20/watch-how-mnangagwa-carefully-planned-to-violate-constitution/",
            "content": "By A Correspondent\n\nThe Zanu PF leader, Emmerson Mnangagwa, five years ago reportedly plotted to remain in office beyond his constitutionally mandated term in 2028, as revealed in a resurfaced video clip.\n\nIn the video, Mnangagwa boldly states: 2030 Ndinenge Ndichipo (In 2030, I will still be here), which many have interpreted as a clear indication that he had long been planning to extend his presidency.\n\nHis declaration has sparked concerns over his intentions to bypass the countrys constitutional limits, which restrict the president to two terms in office.\n\nThe video footage suggests that Mnangagwas desire to remain in power is not a recent development, but rather a plan he has been nurturing for years. In the clip, he confidently asserts, 2030 Ndinenge Ndichipo, implying that he intended to either amend or sidestep constitutional provisions to extend his rule.\n\nIn recent months, Zanu PF has ramped up its push for the postponement of elections until 2030, further intensifying fears that Mnangagwa may be maneuvering to extend his term beyond 2028.\n\nThe calls for a delay are seen by many as part of a broader strategy to secure Mnangagwas continued hold on power, potentially leading to a violation of Zimbabwes constitution.\n\nOpposition groups and legal experts have criticized the move, labeling it as an attempt to undermine democratic principles. The presidents statement from five years ago now makes sense, given the partys calls for election delays, said one opposition leader.\n\nThis is not just about securing political advantage, but also about manipulating constitutional processes for personal gain.\n\nAs political tensions rise, Mnangagwas supporters argue that such measures are necessary to maintain political stability and continue pursuing long-term development goals, but critics warn that this could erode trust in the countrys democratic institutions.\n\nWith the 2030 deadline approaching, all eyes are on Mnangagwa and Zanu PFs next moves as they continue to push for changes that could extend his rule far beyond the original constitutional limits.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zanu PF leader, Emmerson Mnangagwa, five years ago reportedly plotted to remain in office beyond his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/20/watch-how-mnangagwa-carefully-planned-to-violate-constitution/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: How Mnangagwa Carefully Planned To Violate Constitution\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Zanu PF Members Forced to Prioritize Mnangagwa’s 2030 Agenda",
            "url": "https://www.zimeye.net/2025/01/20/zanu-pf-members-forced-to-prioritize-mnangagwas-2030-agenda/",
            "content": "By A Correspondent\n\nZimbabwes ruling party, Zanu PF, has intensified its efforts to ensure the success of President Emmerson Mnangagwas 2030 agenda.\n\nIn a recent directive, party members have been urged to put party interests above personal projects, prioritizing unity and focus as the party prepares for its next phase of development .\n\nAccording to Brain Munyoro, Zanu PF Masvingo Provincial Political Commissar, members of the Joint Provincial Council are required to attend all meetings and maintain punctuality. Members must adjust their personal programmes and place party initiatives above all else during this period, Munyoro stated.\n\nThe directive also outlined a series of visits to various Zanu PF party districts across Masvingo province, starting on January 22, 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s ruling party, Zanu PF, has intensified its efforts to ensure the success of President Emmerson Mnangagwa’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/20/zanu-pf-members-forced-to-prioritize-mnangagwas-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Members Forced to Prioritize Mnangagwa’s 2030 Agenda\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Kundai Benyu Joins Harare Giants Caps United",
            "url": "https://www.zimeye.net/2025/01/20/kundai-benyu-joins-harare-giants-caps-united/",
            "content": "Sports Correspondent\n\nKundai Benyu has made the move to Zimbabwe and will be playing in the Castle Lager Premier Soccer League next season.\n\nBenyu arrived in the country on Saturday afternoon in preparation for his unveiling at CAPS United.\n\nThe UK-born midfielder, who has earned caps for the Warriors, has reportedly signed a two-year contract with the Harare-based club.\n\nThis will mark his debut in the Zimbabwean top-flight league.\n\nThe move comes after Benyu spent the past two years without a club. His most recent stint was with B Vestmannaeyja in Iceland, where his contract ended on December 31, 2022.\n\nThe 27-year-old, who began his career at Ipswich Town in England, has also had a spell with Helsingborgs IF in Sweden.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kundai Benyu has made the move to Zimbabwe and will be playing in the Castle Lager Premier Soccer … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/20/kundai-benyu-joins-harare-giants-caps-united/\">Continue reading<span class=\"screen-reader-text\"> \"Kundai Benyu Joins Harare Giants Caps United\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Prominent Byo Businessman Found Dead",
            "url": "https://www.zimeye.net/2025/01/19/prominent-byo-businessman-found-dead/",
            "content": "By Crime and Courts Reporter-Prominent Bulawayo businessman and owner of the owner of Samaz Butchery in Luveve, John Tafara Madzikatire, has been found dead.\n\nMadzikatires lifeless body was found inside his black Mercedes-Benz in Cowdray Park on Saturday night.\n\nResidents discovered the car parked on the street around 9 PM and alerted authorities.\n\nMadzikatire had a gunshot wound to the head.\n\nPolice confirmed the death and initially treated the case as a suspected suicide, but Assistant Inspector Nomalanga Msebele, the acting Zimbabwe Republic Police (ZRP) spokesperson in Bulawayo, said investigations are ongoing.The case is being treated as a suicide for now, but investigations are continuing, said Msebele.\n\nHowever, emerging details have raised questions about foul play.\n\nAccording to one of Madzikatires employees, the businessman was last seen around 5 PM on Saturday when he delivered meat to the koChigumira outlet in Luveve.\n\nHe was accompanied by a young woman, who stayed in the car while the delivery was made.\n\nLater that evening, friends informed employees that Madzikatire had allegedly shot himself outside the womans house in Cowdray Park.\n\nWe are in disbelief that the boss killed himself, said an employee who chose to remain anonymous. The butcheries will remain closed until we hear from the family.\n\nZimLive reported that police found a large sum of money inside the car, including over US$4,000 and R19,000 in various currencies.\n\nMadzikatire, a married father of two originally from Mutare, was reportedly found just meters from the home of his alleged mistress.\n\nThe significant cash, his proximity to a mistress house, and the circumstances of his death have led to speculation about possible foul play.\n\nWhile authorities are yet to confirm further details, the case has sent shockwaves through Bulawayos business community.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Prominent Bulawayo businessman and owner of the owner of Samaz Butchery in Luveve, John Tafara Madzikatire, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/prominent-byo-businessman-found-dead/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Byo Businessman Found Dead\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Veteran ZBC Cameraman Declared Provincial Hero",
            "url": "https://www.zimeye.net/2025/01/19/veteran-zbc-cameraman-declared-provincial-hero/",
            "content": "By Munacho Gwamanda- Former Zimbabwe Broadcasting Corporation (ZBC) cameraman Solomon Chinhara, who died, Monday has been laid to rest at Bulawayo Heroes Acre.\n\nChinhara died of flu while in an ambulance en route to the hospital from his plot along Plumtree Road in Matabeleland South last Monday.\n\nThe veteran journalist was declared a Bulawayo provincial hero for contributing to the liberation struggle in the late 1970s.\n\nHis passing marked the end of a chapter in the history of a man who contributed to ZBCs golden era when it stood as the pride of Zimbabwe.\n\nKnown for his commitment and excellence, Chinhara was part of a team that shaped the broadcasters legacy as a trusted voice for the nation.\n\nLast October, Chinhara celebrated 51 years of marriage with his wife, Alice Chinhara Khoza.\n\nThe milestone event, held at their West Acre Farm in Plumtree, was attended by family, friends, neighbours, and members of their church.\n\nDuring its peak in the late 20th century, ZBC symbolised excellence in national broadcasting.\n\nIt was not only a source of reliable news but also a hub of talent that cultivated careers like Chinharas, whose camera work captured the nations triumphs and challenges.\n\nHowever, in recent decades, ZBC has faced significant challenges.\n\nOnce renowned for its professionalism and robust programming, the state broadcaster has struggled under political and economic pressures.\n\nAccusations of political bias, declining resources, and an exodus of talent have tarnished its reputation, leaving it a shadow of its former self.\n\nThe deterioration of ZBC mirrors the broader challenges facing Zimbabwes media landscape, where professionals like Chinhara once thrived.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Former Zimbabwe Broadcasting Corporation (ZBC) cameraman Solomon Chinhara, who died, Monday has been laid to rest at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/veteran-zbc-cameraman-declared-provincial-hero/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran ZBC Cameraman Declared Provincial Hero\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        },
        {
            "title": "Tragic Betrayal: CCC Member Faces Amputation Due to Financial Neglect",
            "url": "https://www.zimeye.net/2025/01/19/tragic-betrayal-ccc-member-faces-amputation-due-to-financial-neglect/",
            "content": "By Shelton Muchena | A dedicated member of the Citizens Coalition for Change (CCC) in Bulilima District is fighting for his lifeand his legdue to a critical lack of funding for necessary surgery. Bongani Khuphe, affectionately known asMperi Wegumbo Gulu,was a prominent Campaign Champion for CCC during the recent 2023 harmonised elections, fervently supporting Senator Solani Moyo and parliamentary candidate Bekezela Maplanka.\n\nFollowing a severe road traffic accident, Khuphe urgently requires $3,000 to undergo a second surgery after complications arose from the first procedure. Despite Khuphes tireless efforts in favor of the CCC, the partys support has been woefully inadequate since the elections, during which Moyo was elected Senator while Maplanka lost her seat to Dingimuzi Phuti.\n\nIn the six months since the accident, fundraising initiatives have only managed to collect a meager $500, leaving Khuphe in a desperate situation. His relative, Kudzani Khuphe, expressed profound disappointment in the partys lack of support. We have a WhatsApp group for donations, yet only $500 has been raised in over six months. What hurts the most is that party officials, including elected ones, have not contributed a single cent, Kudzani lamented.\n\nHe pointed out the irony of Senator Moyo exiting the donation group without contributing while Maplanka has been seen providing assistance to wealthier individuals. Nja Emnyama, wake eli mugroup but wakabuda esatjidza ne tjimwe. Maplanka towa kuyi she is donating things to already rich people but akuna kene lubhatso gwa akasa kumwe wabo, Kudzani stated, highlighting the stark contrast between the support received by Khuphe and that given to others by the partys officials.\n\nAttempts to reach Senator Solani Moyo for comment were unsuccessful, and Bekezela Maplankas phone was unreachable. Ironically, Maplanka was reportedly seen donating goods at Solusi University last week, raising questions about her priorities and commitment to those who stood by her during the election campaign.\n\nKhuphe has been a crucial figure in mobilizing support for the CCC, even showcasing Kalanga poetry during numerous rallies addressed by party leader Nelson Chamisa across Bulilima. In an interview, he confided that he is struggling to gather the necessary funds, saying that trusted friends have been disappearing into thin air.\n\nI am appealing to well-wishers to help me with donations for my surgery as I am in extreme pain. Those who wish to help can contact me at +263 78 347 5211, Khuphe urgently requested.\n\nAs the days pass, the threat of amputation looms ever closer for Khuphe, while Senator Solani Moyo remains in Parliament, seemingly oblivious to the plight of a once-loyal supporter championing the 2030 vision.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena | A dedicated member of the Citizens Coalition for Change (CCC) in Bulilima District is fighting for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/19/tragic-betrayal-ccc-member-faces-amputation-due-to-financial-neglect/\">Continue reading<span class=\"screen-reader-text\"> \"Tragic Betrayal: CCC Member Faces Amputation Due to Financial Neglect\"</span></a></p>",
            "time": "08:25",
            "date": "21 Jan 2025"
        }
    ]
}