{
    "news": [
        {
            "title": "Mutsvangwa, Tagwirei War Intensifies",
            "url": "https://www.zimeye.net/2025/07/22/mutsvangwa-tagwirei-war-intensifies/",
            "content": "By A Correspondent-The simmering feud between ZANU PF spokesperson Christopher Mutsvangwa and powerful businessman Kudakwashe Tagwirei has exploded into the public domain, exposing not only a long-standing grudge over control of Zimbabwes fuel supply sector but also deeper factional battles over who should be President Emmerson Mnangagwas closest political ally.\n\nSpeaking at a press conference in Harare last week, Mutsvangwa took aim at Tagwirei, accusing him of attempting to buy influence within the ruling party through gifts, vehicles, and cash handouts. He dismissed such acts as political opportunism and warned that leadership in ZANU PF could not be purchased.\n\nIf you want to lead, join the queue. I joined this party as a teenager, fought in the liberation war, and have served humbly for decades, Mutsvangwa said.\n\nTagwirei, widely viewed as one of Mnangagwas key enablers and funders, responded swiftly in a strongly worded statement on his X account, @ElderTagwirei, accusing Mutsvangwa of misrepresenting his contributions and disrespecting years of strategic investment and party loyalty.\n\nDr. Tagwirei is not new to ZANU PF. His involvement spans years of active support, partnership, and investment into programmes that have benefited Zimbabweans directly. To suggest he seeks to buy influence is both unfounded and ungrateful, the statement read.\n\nBehind the sharp exchanges lies a deeper and more complex rivalry rooted in both economic and political history. Mutsvangwa and Tagwirei have long harboured mutual resentment, particularly over Zimbabwes fuel sector, where both once jostled for dominance.\n\nFor a long time  Mutsvangwa  then a key government advisor  publicly accused Tagwirei of capturing the states fuel importation system through Sakunda Holdings, benefiting from opaque state tenders and preferential access to foreign currency.\n\nTagwireis role in the controversial Command Agriculture programme, which critics said was a conduit for looting public funds, further strained their relations.\n\nDespite their animosity, both men have one thing in common: they are aligned with Mnangagwa and fiercely opposed to Vice President Constantino Chiwengas presidential ambitions.\n\nTheir public fallout now appears to reflect an internal turf war over proximity to the President, as ZANU PF factions quietly realign ahead of Mnangagwas eventual succession.\n\nThis is a rivalry over who gets to be Mnangagwas most trusted confidant, especially as the question of succession becomes more urgent, a senior party source toldThe Independent. Theyre both anti-Chiwenga, but only one can be the kingmaker.\n\nTagwirei has for years acted as Mnangagwas financial lifeline, reportedly funding party activities and cushioning the regime from economic shocks. Meanwhile, Mutsvangwa  a former liberation war combatant and influential political operator  has used his public platform to shape party narratives and attack rivals, often on Mnangagwas behalf.\n\nBut the recent outburst suggests that Mnangagwas inner circle is fraying under the weight of ambition, patronage, and mistrust. While Mnangagwa has remained silent on the matter, analysts believe the President may be playing both sides to maintain his grip on power.\n\nThis is classic Mnangagwa  letting his lieutenants fight it out while he remains above the fray. But its risky. These internal squabbles could destabilise the party ahead of any leadership transition, said a political analyst.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The simmering feud between ZANU PF spokesperson Christopher Mutsvangwa and powerful businessman Kudakwashe Tagwirei has exploded into the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/mutsvangwa-tagwirei-war-intensifies/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa, Tagwirei War Intensifies\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "Update On Chitungwiza Horrific Accident",
            "url": "https://www.zimeye.net/2025/07/22/update-on-chitungwiza-horrific-accident/",
            "content": "By A Correspondent\n\nCHITUNGWIZA  The Zimbabwe Republic Police has confirmed that 17 people died in a fatal road traffic accident that occurred on the morning of 22 July 2025 at Hunyani Bridge along Seke Road, Chitungwiza.\n\nAccording to a statement issued by Police Chief Staff Officer for Press and Public Relations, Commissioner Paul Nyathi, the accident involved a haulage truck and a Nissan Caravan kombi.\n\nThe haulage truck, which was travelling towards the Harare Central Business District with two occupants on board, lost control and veered onto the oncoming lane, said Commissioner Nyathi.\n\nThe out-of-control truck struck two pedestrians walking on the island of the road. The pedestrians died on the spot, he confirmed.\n\nThe truck then collided head-on with the kombi which was travelling in the opposite direction towards Chitungwiza with 17 passengers on board. The impact caused the truck to drag the kombi off the road, overturn, and land on top of it.\n\nSubsequently, 15 occupants who were in the kombi, including the driver, died on the spot, said Nyathi. Four other peoplethree from the kombi and one from the trucksustained injuries and were taken to Chitungwiza Hospital for treatment.\n\nThe victims include 10 females and seven males. Their bodies were also taken to Chitungwiza Hospital mortuary for post-mortem examinations.\n\nMore details will be released in due course, said Commissioner Nyathi.\n\nThe tragedy has raised renewed concerns over road safety on one of the busiest routes linking Chitungwiza to Harare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent CHITUNGWIZA – The Zimbabwe Republic Police has confirmed that 17 people died in a fatal road traffic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/update-on-chitungwiza-horrific-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Update On Chitungwiza Horrific Accident\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "ZIFA Wields Axe: Technical Director, Referees Manager Among Six Dismissed",
            "url": "https://www.zimeye.net/2025/07/22/zifa-wields-axe-technical-director-referees-manager-among-six-dismissed/",
            "content": "By A Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has dismissed six of its employees as part of what insiders say is a restructuring exercise aimed at streamlining operations.\n\nAmong those shown the exit door are Technical Director Jethro Hunidzarira, Referees Manager Joshua Tigere, and the Human Resources Manager, whose names appeared on the latest list of affected staffers.\n\nSources within ZIFA confirmed that the six received formal letters of dismissal, advising them that July 31st, 2025, would be their final day in office.\n\nWhile no official reason has been provided for the dismissals, speculation is rife that the purge is linked to ongoing internal reviews and performance evaluations.\n\nZIFA has yet to issue a public statement explaining the move or naming the full list of affected employees.\n\nMore details are expected to emerge in the coming days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Football Association (ZIFA) has dismissed six of its employees as part of what insiders say … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/zifa-wields-axe-technical-director-referees-manager-among-six-dismissed/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Wields Axe: Technical Director, Referees Manager Among Six Dismissed\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "Kadewere Finds New Home In Greece",
            "url": "https://www.zimeye.net/2025/07/22/kadewere-finds-new-home-in-greece/",
            "content": "By Sports Correspondent\n\nWarriors forward Tinotenda Kadewere has sealed a new chapter in his football career after joining Greek Super League side Aris Thessaloniki on a free transfer.\n\nThe 29-year-old Zimbabwean international moves from French Ligue 1 club FC Nantes, where he had a short stint, and now looks set to revive his form in Greece.\n\nKadewere has signed a two-year contract with Aris, who are hoping his experience and attacking prowess will boost their frontline ahead of the new season.\n\nThe club confirmed the signing with images of the forward putting pen to paper, marking the beginning of his journey in the Greek top flight.\n\nKadewere will now look to make an impact in Greece as he continues to fly the Zimbabwean flag high in European football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Warriors forward Tinotenda Kadewere has sealed a new chapter in his football career after joining Greek Super … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/kadewere-finds-new-home-in-greece/\">Continue reading<span class=\"screen-reader-text\"> \"Kadewere Finds New Home In Greece\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "Does Chris Really Like Chiwenga?",
            "url": "https://www.zimeye.net/2025/07/22/does-chris-really-like-chiwenga/",
            "content": "Do you think Mutsvangwa likes Chiwenga, or its just Manhize versus Masvingo Zviganandas, game?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "Propaganda Blitz: Mutsvangwa Claims Mnangagwa Gave Zimbabweans the US Dollar",
            "url": "https://www.zimeye.net/2025/07/22/propaganda-blitz-mutsvangwa-claims-mnangagwa-gave-zimbabweans-the-us-dollar/",
            "content": "By Tinashe Sambiri\n\nZanu PF has launched a blatant propaganda offensive by claiming credit for introducing the US dollar into Zimbabwes economy  a move widely credited to the late opposition leader and founding MDC president, Morgan Tsvangirai, during the Government of National Unity.\n\nSpeaking at a press conference at the Zanu PF headquarters in Harare on Monday, party spokesperson Christopher Mutsvangwa boldly declared:\n\nWe brought the US dollar. It was part of our economic reforms and the visionary leadership of President Mnangagwa, who is a selfless patriot.\n\nBut economic historians and citizens alike remember otherwise.\n\nIt was during Tsvangirais tenure as Prime Minister in the 2009 inclusive government that the multi-currency regime was introduced to arrest Zimbabwes historic hyperinflation and economic collapse  a decision Zanu PF initially resisted.\n\nThis is nothing but historical theft, said a political analyst.\n\nZanu PF fought against the multi-currency system until they had no choice. Now they want to rewrite history to sanitize their economic failures.\n\nMutsvangwa didnt stop there. He also lauded controversial Zanu PF heavyweight Obert Mpofu, saying:\n\nObert Mpofu is a selfless leader.\n\nThis despite Mpofus name being synonymous with corruption, diamond looting, and unaccounted millions during his time as Minister of Mines.\n\nMutsvangwa went on to claim that Zanu PF led major reforms:\n\nWe fronted land reform. We fronted economic empowerment. Zanu PF is for the people  that I can testify.\n\nCritics, however, say the partys empowerment narrative has become a tired faade to mask elite plunder.\n\nYou cant praise looters as patriots while the economy is burning, said an economist.\n\nPeople remember who brought the change, and it wasnt Zanu PF. It was the MDC, under Tsvangirai, who stabilized the nation.\n\nAs economic woes persist and inflation spikes again, Zanu PFs bid to rebrand itself as a reformist force is being met with widespread skepticism.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Zanu PF has launched a blatant propaganda offensive by claiming credit for introducing the US dollar into … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/propaganda-blitz-mutsvangwa-claims-mnangagwa-gave-zimbabweans-the-us-dollar/\">Continue reading<span class=\"screen-reader-text\"> \"Propaganda Blitz: Mutsvangwa Claims Mnangagwa Gave Zimbabweans the US Dollar\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "Chamisa Blasts Zanu PF: “You’re Letting Wetlands Vanish While Lying to the World”",
            "url": "https://www.zimeye.net/2025/07/22/chamisa-blasts-zanu-pf-youre-letting-wetlands-vanish-while-lying-to-the-world/",
            "content": "By Tinashe Sambiri\n\nAs Zimbabwe prepares to host the prestigious Ramsar COP15 in Victoria Falls, Citizens leader Advocate Nelson Chamisa has issued a stark warning: the country cannot continue destroying its wetlands while pretending to be a global leader in conservation.\n\nIn a statement released Tuesday, Chamisa called on authorities to stop the hypocrisy and prioritize environmental stewardship over greed-fueled development.\n\nOur wetlands, our heritage, Chamisa wrote. This Wednesday, the 23rd of July 2025, Zimbabwe is opening its doors to the world  hosting the Ramsar COP15 in Victoria Falls, and shining a global spotlight on our rich environmental heritage.\n\nBut beneath the polished speeches and photo ops lies a national crisis. Zimbabwes wetlandscritical for water purification, flood control, and biodiversityhave been under relentless assault, often with the blessing or blind eye of state institutions.\n\nYet, the current state of wetlands across Zimbabwe shows we have urgent work to do, Chamisa said, pointing to uncontrolled urban expansion, illegal sand mining, and politically connected land barons who have turned green spaces into concrete deserts.\n\nEnvironmentalists have long accused Zanu PF of enabling environmental degradation by allowing powerful elites to develop on ecologically sensitive land, especially in Harare, Chitungwiza, and Masvingo. In many cases, permits were issued in clear violation of environmental laws.\n\nWetlands are the kidneys of the Earth and, for Zimbabwe, they are our lifeline, Chamisa emphasized. As a landlocked country, wetlands are critical sources of clean, fresh water and provide vital ecosystem services.\n\nIn his strongest criticism yet, Chamisa slammed Zanu PF for greenwashing while the countrys natural resources vanish:Youre letting wetlands vanish while lying to the world. This regime wants to host environmental conferences while it auctions off our environment behind closed doors. Its shameful.\n\nHe called for African-led solutions to wetland and environmental degradation, urging that the Ramsar conference be more than a diplomatic spectacle.\n\nThis is our moment to protect our wetlands, empower our people, and shape global action rooted in local knowledge, he said. Lets make it count.\n\nMeanwhile, Zanu PF has yet to present a concrete plan to reverse the environmental damage, despite hosting a global summit on the very issue. Critics have called it performative politics, designed to mask the regimes abysmal environmental track record.\n\nA Harare-based conservationist, speaking on condition of anonymity, said, **Its like inviting the world to an anti-smoking summit while chain-smoking in the back room.\n\nZanu PF has allowed wetland destruction to become normalized  theyve turned a natural treasure into a commodity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri As Zimbabwe prepares to host the prestigious Ramsar COP15 in Victoria Falls, Citizens leader Advocate Nelson Chamisa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/chamisa-blasts-zanu-pf-youre-letting-wetlands-vanish-while-lying-to-the-world/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Blasts Zanu PF: “You’re Letting Wetlands Vanish While Lying to the World”\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "Charamba Scolds Varakashi Over Tagwirei Campaign",
            "url": "https://www.zimeye.net/2025/07/22/charamba-scolds-varakashi-over-tagwirei-campaign/",
            "content": "By A Correspondent| Presidential Spokesperson George Charamba has lashed out at pro-Zanu PF online activists, known asVarakashi, for deviating from their core mission by campaigning for controversial businessman Kudakwashe Tagwirei, warning that such conduct undermines party discipline and President Emmerson Mnangagwas authority.\n\nCharamba, a key figure in the formation of theVarakashimovement, expressed deep concern over what he described as growing messaging indiscipline among the groups ranks, accusing them of idolizing individuals other than the President and promoting agendas that do not align with the partys official line.\n\nI am very worried with the turn of events, Charamba said. I was instrumental in the formation and management ofVarakashi: that group of ideologically clear and technically savvy cadres we put together to defend the party, party policies and decisions, the President as the leader of the party, Zanu PF, and the activities of its Government.\n\nCharambas comments come in the wake of a heated internal storm triggered by Zanu PF spokesperson Christopher Mutsvangwas public rebuke of Tagwirei. The remarks sparked a defensive outcry from sections ofVarakashi, who launched coordinated social media campaigns backing the businessman and attacking his critics within the party.\n\nBut Charamba has made it clear that theVarakashis loyalty must be singular and unequivocal  directed solely at President Mnangagwa and the Zanu PF establishment.\n\nZanu PF is a unitary party; it has one President and First Secretary, who is ED Mnangagwa. He is the only person who is the face of the Party, and to whom all members and affiliates must pledge untrammeled loyalty, Charamba said.\n\nHe criticized the emergence ofVarakashioffshoots that align themselves with individuals within the party structure, warning that such splintering creates confusion, multiple agendas, and weakens the core message of the ruling party.\n\nFrankly, I was wistful about that development which amounted to creating affiliates out of an affiliate. That isnt a clever way of organizing communication and propaganda; it leads to loose management and fissiparous messaging, he warned.\n\nCharamba also slammed what he termed false elevation of certain Zanu PF appointees byVarakashimembers, stressing that only the President makes official party policy and keynote pronouncements.\n\nNo subaltern pronounces policy or presents keynote addresses. Not even Vice Presidents! All officials express policies of the Party and the President strictly on behalf of the President who appoints and sends them, he said.\n\nIn a final rebuke, Charamba demanded discipline, loyalty, and clarity among theVarakashi, declaring:\n\nThere is quite some growing indiscipline in our messaging, including expressions of little loyalties to mere appointees or emissaries of the President.That must stop forthwith!\n\nHis remarks are widely seen as an attempt to rein in factional loyalties and silence a rising tide of support for Tagwirei, who some within the party believe is being positioned for greater political influence  an idea that continues to stir tensions at the highest levels of Zanu PF.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Presidential Spokesperson George Charamba has lashed out at pro-Zanu PF online activists, known as Varakashi, for deviating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/charamba-scolds-varakashi-over-tagwirei-campaign/\">Continue reading<span class=\"screen-reader-text\"> \"Charamba Scolds Varakashi Over Tagwirei Campaign\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "BREAKING: Jamwanda Appears As If He’s Taken Blessed Geza’s Job",
            "url": "https://www.zimeye.net/2025/07/22/breaking-jamwanda-appears-as-if-hes-taken-blessed-gezas-job/",
            "content": "By Dorrothy Moyo | In a first of firsts, Presidential Spokesman, George Charamba rushed to make an anti-zvigananda (gluttons) announcement on behalf of Vice President Constantino Chiwenga.\n\nLast week this role was ironically being fulfilled by the anti corruption activist Blessed Geza.\n\nCharamba was still to comment at the time of writing in what spirit I he had published an announcement on behalf of his boss deputy.\n\nHave you not taken@BlessedGezas role Cde Charamba?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | In a first of firsts, Presidential Spokesman, George Charamba rushed to make an anti-zvigananda (gluttons) announcement … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/22/breaking-jamwanda-appears-as-if-hes-taken-blessed-gezas-job/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Jamwanda Appears As If He’s Taken Blessed Geza’s Job\"</span></a></p>",
            "time": "18:45",
            "date": "23 Jul 2025"
        },
        {
            "title": "Watch : Chitungwiza Accident Update…",
            "url": "https://www.zimeye.net/2025/07/22/watch-chitungwiza-accident-update/",
            "content": "Watch: Chitungwiza Accident Update: Video creditOwen Madondopic.twitter.com/s76GlLkUDw\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:45",
            "date": "23 Jul 2025"
        }
    ]
}