{
    "news": [
        {
            "title": "Zanu PF Bigwigs Ignore Mnangagwa",
            "url": "https://www.zimeye.net/2025/09/04/zanu-pf-bigwigs-ignore-mnangagwa/",
            "content": "By A Correspondent  Senior Zanu PF members are increasingly bunking President Emmerson Mnangagwas official functions in what observers say is a clear sign of deepening divisions and manoeuvres in the partys simmering succession battle.\n\nThe latest sign of discontent came to light in a letter addressed to the leadership of Mashonaland West province by Zanu PF provincial chairperson Mary Mliswa-Chikoka. She expressed anger over the failure of senior officials, including Members of Parliament and central committee members, to attend a key event graced by Mnangagwa.\n\nAt the 21st Chinhoyi University of Technology (CUT) graduation ceremony last Thursday  where Mnangagwa capped 3 130 graduands  the only senior government representative was Womens Affairs, Community and SMEs deputy minister Jennifer Mhlanga. The absence of top provincial leaders raised eyebrows, with Mliswa-Chikoka blasting the boycott as silent sabotage.\n\nWhat message are you sending when you deliberately absent yourselves from events graced by the first secretary of our party? Mliswa-Chikoka charged. How can we take seriously those who campaign aggressively to attend the [Zanu PF] peoples conference, yet show no commitment to supporting the Presidents programmes in their own province (sic)?\n\nShe warned that continued absenteeism would be interpreted as disloyalty and a calculated attempt to undermine Mnangagwas authority, threatening to name and shame culprits.\n\nThose who ignored the CUT ceremony despite being invited include central committee and district co-ordinating committee members Phineas Makumbe, Thomas Chidzomba, Christine Gwati, Precious Masango, Tapera Mtovido, Elisha Bhokoro, Archy Ganizani and Rudo Munyonga. Only politburo member Douglas Mombeshora tendered an apology, citing government business.\n\nThis is not the first time senior Zanu PF and government officials have drawn criticism for dodging key events. In Parliament, ministers and their deputies have repeatedly skipped question-and-answer sessions, forcing both the National Assembly and Senate to reprimand them.\n\nThe growing boycott of Mnangagwas programmes reflects wider fissures within Zanu PF as rival factions jostle for power ahead of the partys elective congress. On one side is a faction aligned to Mnangagwa that is pushing for him to extend his tenure beyond the constitutional limit  either by amending the Constitution in his favour or suspending future elections. On the other side, a camp loyal to Vice-President Constantino Chiwenga is quietly mobilising to push him into State House.\n\nAdding to the intrigue is businessman Kudakwashe Tagwirei, who is increasingly being viewed as a dark horse with the financial muscle to influence the succession matrix.\n\nThe latest silent boycott in Chinhoyi has been read by insiders as an early indication of a coup in slow motion within Zanu PF, where political survival often depends on loyalty displays at events presided over by the party leader. As the succession battle heats up, Mnangagwas opponents within his own party appear to be using absence as a weapon of resistance  a tactic that could further destabilise the ruling party ahead of 2028.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Senior Zanu PF members are increasingly bunking President Emmerson Mnangagwa’s official functions in what observers say … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/zanu-pf-bigwigs-ignore-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Bigwigs Ignore Mnangagwa \"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Macdee Reignites Music Scene",
            "url": "https://www.zimeye.net/2025/09/04/macdee-reignites-music-scene/",
            "content": "By Showbiz Reporter Veteran music producer Macdonald Macdee Chidavaenzi has returned with a major collaboration aimed at bridging musical generations in Zimbabwes music industry.\n\nMacdee teamed up with Michael Magz, Madedido, Xtra Large, Calvin Mangena, and Shayne on the trackMari Yangu, blending hip hop, Afrobeat, dancehall, and social commentary.\n\nDespite recent controversies around his personal life, including rumours of divorce, the award-winning producer has chosen to focus on his music.\n\nMy main focus is on music, and this collaboration brings together both the younger and older generation, he said.\n\nMacdee also worked closely with his son and protg, Tadex Made It, who produced the project. The video has already surpassed 30,000 YouTube views, a milestone he says shows fans are embracing the cross-generational experiment.\n\nAs artists, we must be creative and strike a balance between appealing to new and old audiences, he explained. Music should cut across age groups to keep everyone engaged.\n\nKnown as a songwriter, keyboardist, voice tutor, and backing vocalist for leading Zimbabwean artists and churches, Macdee has also made his mark as a scriptwriter and producer of radio commercials. Over the years, he has recorded hit songs and mentored budding producers through his label.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Veteran music producer Macdonald ‘Macdee’ Chidavaenzi has returned with a major collaboration aimed at bridging musical generations … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/macdee-reignites-music-scene/\">Continue reading<span class=\"screen-reader-text\"> \"Macdee Reignites Music Scene\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Mzembi Told Me He Was Poisoned, I Reveal Everything",
            "url": "https://www.zimeye.net/2025/09/04/mzembi-told-me-he-was-poisoned-i-reveal-everything/",
            "content": "By Simba Chikanza | Walter Mzembi himself told me he was poisoned, including everything else which make it difficult for me to rush to conclusions on anything.\n\nI am prompted to write over the incarcerated former Foreign Affairs Minister Walter Mzembi. But I wont just write, I will go on video. I share what he has told me himself, not what Ive heard outside. I reveal not a a twitter post, but investigated evidence, which I come on LIVE video for the public to engage with. Join me today at 7pm Zim time.\n\nPic: Mzembi with his two colleagues, Lloyd Msipa and Pardon Tapfumaneyi\n\nWalter Mzembi himself told me he was poisoned, including everything else which make it difficult for me to rush to conclusions on anything.I am prompted to write over the incarcerated former Foreign Affairs Minister Walter Mzembi. But I wont just write, I will go on video. Ipic.twitter.com/4GRQJ9qp7j\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Simba Chikanza | Walter Mzembi himself told me he was poisoned, including everything else which make it difficult for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/mzembi-told-me-he-was-poisoned-i-reveal-everything/\">Continue reading<span class=\"screen-reader-text\"> \"Mzembi Told Me He Was Poisoned, I Reveal Everything\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Zim Speeds Up Passport Collections in Johannesburg",
            "url": "https://www.zimeye.net/2025/09/04/zim-speeds-up-passport-collections-in-johannesburg/",
            "content": "By a Correspondent The Zimbabwe Consulate in Johannesburg has announced that passports applied for between 13 and 22 August 2025 are now ready for collection at its offices at 20 Ernest Oppenheimer Avenue, Bruma.\n\nApplicants must bring their receipt, paycode, and a valid form of identification  either a national ID or passport  when collecting their documents.\n\nFor parents collecting on behalf of their children, the childs birth certificate must be presented together with the required documents and the parents ID.\n\nThose replacing valid passports are required to surrender them for cancellation, at a fee of R200, before receiving the new document.\n\nMeanwhile, individuals collecting passports on behalf of others must provide an affidavit issued by the South African Police Service (SAPS) or a collection letter from the consulate, along with the required documents and their own proof of identity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent – The Zimbabwe Consulate in Johannesburg has announced that passports applied for between 13 and 22 August 2025 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/zim-speeds-up-passport-collections-in-johannesburg/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Speeds Up Passport Collections in Johannesburg\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Motorist Blows Whistle on Daily Extortion at Police Checkpoints…",
            "url": "https://www.zimeye.net/2025/09/04/motorist-blows-whistle-on-daily-extortion-at-police-checkpoints/",
            "content": "A motorist has raised concerns over daily police roadblocks along Simon Mazorodze Road, describing them as money-making schemes rather than legitimate traffic enforcement.\n\nIn a message to Crime Watch Zimbabwe, the anonymous complainant said: Every single day, from Sunday to Sunday, about 12 to 15 police officers set up a roadblock on Simon Mazorodze, just after Zindoga on the way to town. They never issue tickets but always demand cash, usually $20 or more, for any offense.\n\nThe motorist questioned the legitimacy of the roadblocks, asking: Is this how roadblocks are supposed to work, or have they just turned into money-making schemes?\n\nThe report adds to growing public frustration over alleged corruption and abuse of power at traffic checkpoints.\n\nSource: Crime Watch Zimbabwe\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A motorist has raised concerns over daily police roadblocks along Simon Mazorodze Road, describing them as “money-making schemes” rather than … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/motorist-blows-whistle-on-daily-extortion-at-police-checkpoints/\">Continue reading<span class=\"screen-reader-text\"> \"Motorist Blows Whistle on Daily Extortion at Police Checkpoints…\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Tshabangu Gets Cash Reward For Bootlicking",
            "url": "https://www.zimeye.net/2025/09/04/tshabangu-gets-cash-reward-for-bootlicking/",
            "content": "By A Correspondent\n\nGovernment has once again disbursed millions of taxpayers money to Zanu PF and the Tshabangu-led Citizens Coalition for Change (CCC), raising concerns over the misuse of public funds.\n\nAccording to General Notice 1829, published by Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi in an Extraordinary Government Gazette on Tuesday, a total of ZiG147 682 500 was shared between the ruling party and the CCC.\n\nMinister Ziyambi said: It is hereby notified, in terms of section 3(2) of the Political Parties (Finance) Act that the total amount of moneys payable to political parties in respect of the year beginning 1st of January, 2025 and ending on the 31st of December, 2025, ZiG147 682 500,00. The money shall be disbursed to political parties that qualify in terms of section 3(3) of the Act as follows  (a) ZiG102 343 972, 50 shall be paid to Zanu PF which received 69,3 percent of the total votes cast; and (b) ZiG45 338 527,50 shall be paid to the CCC which received 30,7 percent of the total votes cast.\n\nZanu PF received over ZiG102 million, while Tshabangus CCC pocketed more than ZiG45 million, despite critics saying the payouts effectively reward political loyalty rather than democratic participation.\n\nThe Political Parties (Finance) Act, originally intended to support transparency and reduce dependence on foreign funding, has been criticised as a mechanism for entrenching state patronage. One opposition supporter commented, This is taxpayers money being used to bankroll Zanu PF and reward Tshabangu for doing their dirty work.\n\nGovernment last disbursed ZiG70 million to the two parties in September 2024. Critics argue the latest payout shows how public funds continue to be diverted to sustain political power instead of national development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Government has once again disbursed millions of taxpayers’ money to Zanu PF and the Tshabangu-led Citizens Coalition … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/tshabangu-gets-cash-reward-for-bootlicking/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Gets Cash Reward For Bootlicking\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Nothing Wrong With AG Traveling With President",
            "url": "https://www.zimeye.net/2025/09/03/nothing-wrong-with-ag-traveling-with-president/",
            "content": "By Dr Masimba Mavaza | The attacks against Attorney General Virginia Mabhiza following her appearance in President Emmerson Mnangagwas delegation to the Vatican and China are unfortunate and totally disgusting. The people who call themselves influencers are spreading useless and baseless issues meant to injure the person of the AG.\n\nThe Attorney Generals role in the high-level trip is very important and essential to our country and the nation. The baseless attacks are motivated by jealousy, dubious motives, and double standards.\n\nCriticism of government officials foreign trips can stem from various concerns, such as cost and taxpayer burden. The financial cost of international travel can be significant, and some citizens may question the value for money. But the important issue is to look at the benefits realised from the trip.\n\nHowever, it is essential to recognize the importance of international engagement for a countrys diplomatic relations. Building and maintaining relationships with other countries can lead to mutually beneficial agreements, trade, and cooperation.\n\nOur country is pursuing economic growth. International trade agreements, investments, and partnerships can boost economic growth and create jobs.\n\nGlobal security and stability are achieved by mingling with other countries. Engaging with other countries can help address global challenges such as climate change, pandemics, and conflicts.\n\nIt should be realised that government officials foreign trips are a necessary part of their duties, and the benefits of these trips can outweigh the costs. These visits highlight the significance of the Vatican as a global moral authority and a hub for international diplomacy and cooperation.\n\nThe Attorney General (AG) accompanying the President on foreign trips can serve several purposes: Legal advice: The AG provides legal counsel to the President on matters related to international law, treaties, and agreements. This ensures the President receives informed guidance on the legal implications of diplomatic decisions. International negotiations: The AG may participate in negotiations with foreign governments, providing expertise on legal frameworks and ensuring agreements are properly structured and compliant with domestic and international law. Contract and agreement review: The AG can review and advise on contracts, memoranda of understanding, and other agreements entered into by the government with foreign entities. Diplomatic immunity and privileges: The AG may advise on matters related to diplomatic immunity and privileges, ensuring the President and other officials understand their rights and obligations. Representation: The AGs presence can also demonstrate the governments commitment to upholding the rule of law and ensuring that international engagements are conducted in a transparent and lawful manner.\n\nHaving the AG accompany the President on foreign trips helps ensure that the governments actions are legally sound and aligned with national interests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | The attacks against Attorney General Virginia Mabhiza following her appearance in President Emmerson Mnangagwa’s delegation … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/03/nothing-wrong-with-ag-traveling-with-president/\">Continue reading<span class=\"screen-reader-text\"> \"Nothing Wrong With AG Traveling With President\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Zanu PF Murakashi Slams Trump, Pushes For One-Party Rule In Zimbabwe",
            "url": "https://www.zimeye.net/2025/09/03/zanu-pf-murakashi-slams-trump-pushes-for-one-party-rule-in-zimbabwe/",
            "content": "By A Correspondent\n\nDereck Goto, a member of Varakashi4ED, the Zanu PF-linked online foot soldiers, has taken aim at former U.S. president Donald Trump, accusing him of exposing the weaknesses of Western democracy.\n\nGoto said in a statement on Wednesday that Trumps rise to power was a symptom of a system driven by spectacle, emotional populism and blind loyalty, rather than honesty, wisdom, and the pursuit of the common good.\n\nHe argued that Trumps presidency was not an isolated case but part of a wider decline, showing how public misjudgment and political elites failures can undermine the democratic values they claim to defend.\n\nGoto contrasted this with Chinas governance model, which he praised for its reason, discipline, and meritocracy.\n\nFor Zimbabwe, he suggested, the lesson lies in moving towards a one-party system anchored in stability and competence, instead of depending on liberal multi-party democracy, which he described as prone to chaos and manipulation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Dereck Goto, a member of Varakashi4ED, the Zanu PF-linked online foot soldiers, has taken aim at former … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/03/zanu-pf-murakashi-slams-trump-pushes-for-one-party-rule-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Murakashi Slams Trump, Pushes For One-Party Rule In Zimbabwe\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Pokello Shakes State House",
            "url": "https://www.zimeye.net/2025/09/03/pokello-shakes-state-house/",
            "content": "By Showbiz Reporter-Tensions have reportedly escalated within President Emmerson Mnangagwas family following the viral circulation of images from Pokello Nares extravagant 40th birthday celebration in Italy.\n\nPokello, who is romantically in love with President Mnangagwas son, Emmerson Mnangagwa Jnr, has faced criticism for flaunting her lavish lifestyle amid Zimbabwes ongoing economic challenges.\n\nThe celebration, which took place at Lake Como, saw Pokello and her entourage traveling first class on Emirates, with expenses reportedly exceeding US$8,000.\n\nShe showcased designer outfits, including Louis Vuitton pyjamas valued at US$2,200, and a Dior bag priced at US$4,700 .\n\nThese displays of wealth have sparked outrage among citizens struggling with economic hardships.\n\nSources close to the Mnangagwa family suggest that President Mnangagwas wife, Auxillia Mnangagwa, is displeased with the ongoing relationship between Pokello and her son.\n\nReports indicate that Emmerson Jnr attempted to have Pokello remove the photos from social media, but she refused. This situation has allegedly caused further strain within the family .\n\nPokello, a former Big Brother Africa housemate, rose to stardom after a widely circulated sex tape with musician Stunner.\n\nHer mother is also a small house of former Local Government Minister Ignatius Chombo.\n\nThe Mnangagwa familys internal conflicts and Pokellos public displays of affluence continue to attract media attention, raising questions about the intersection of politics, wealth, and public perception in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Tensions have reportedly escalated within President Emmerson Mnangagwa’s family following the viral circulation of images from Pokello Nare’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/03/pokello-shakes-state-house/\">Continue reading<span class=\"screen-reader-text\"> \"Pokello Shakes State House\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Chillmaster Banned from Driving After Fatal Crash",
            "url": "https://www.zimeye.net/2025/09/03/chillmaster-banned-from-driving-after-fatal-crash/",
            "content": "By A Correspondent | ZimEye | Prominent musician Kudakwashe Hombarume, popularly known as Chillmaster, has been banned from driving for nine months after the High Court criticised a Mbare magistrate for trivialising a fatal road accident.\n\nJustice Mary Zimba Dube, the Judge President, said the trial court misdirected itself by sparing the 24-year-old unlicensed driver a jail sentence and instead sentencing him to community service after he killed 46-year-old Custon Charumbira in April.\n\nThe facts of this case reveal a serious breach of road safety regulations by an offender who, without restraint, took it upon himself to drive a vehicle without a licence, sped, and caused an accident resulting in the loss of life of an innocent person, Justice Dube said. Contrary to a finding of ordinary negligence, the facts disclose gross negligence.\n\nHombarume admitted to driving a Honda Shuttle at 100 km/h in a 60 km/h zone when he struck Charumbira. He was not licensed.\n\nThe magistrate had initially sentenced him to 24 months in jail, wholly suspended on condition of community service, after the musician paid compensation and funeral expenses to the victims family.\n\nHowever, Justice Dube said this was a misjudgment.\n\nShe stated that courts should not allow offenders to avoid custodial sentences simply because they can afford to pay compensation.\n\nJustice Dube ordered the magistrate to reconsider the sentence, including imposing a mandatory driving ban.\n\nMagistrate Tendayi Mukurunge has since prohibited Chillmaster from driving for nine months.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Prominent musician Kudakwashe Hombarume, popularly known as Chillmaster, has been banned from driving for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/03/chillmaster-banned-from-driving-after-fatal-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Chillmaster Banned from Driving After Fatal Crash\"</span></a></p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        }
    ]
}