{
    "news": [
        {
            "title": "Obadiah Musindo Defends Looting Zvigananda",
            "url": "https://www.zimeye.net/2025/11/01/obadiah-musindo-defends-looting-zvigananda/",
            "content": "By A Correspondent\n\nChinhoyi  Destiny for Africa Network founder and cleric Rev Dr Obadiah Musindo has sparked outrage after publicly defending individuals accused of looting public resources, insisting that those being called Zvigananda are misunderstood patriots rather than corrupt elites.\n\nSpeaking during a pastors conference in Chinhoyi this week, Dr Musindo said critics were jealous of successful people and urged Zimbabweans to respect those whom God has blessed. His comments, however, have drawn sharp criticism from citizens who accuse him of glorifying corruption and shielding politically connected businessmen.\n\nThere is nothing wrong with success, Musindo declared. Those you call Zvigananda are blessed people who are using their wisdom to prosper. We must not demonize them because of envy.\n\nThe term Zvigananda, which loosely means the cunning ones, has become a common label for business figures accused of exploiting state tenders and political connections for personal enrichment. Many Zimbabweans use it to refer to individuals allegedly benefitting from opaque deals while ordinary citizens struggle to survive.\n\nThis statement from Musindo is a slap in the face to millions of suffering Zimbabweans, said a Chinhoyi resident who attended the meeting. How can a pastor defend looting and call it a blessing? People are hungry because of these so-called blessed businessmen.\n\nAnother resident added, If these men are truly patriotic, let them show us their tax records and how many jobs theyve created without government handouts.\n\nMusindos remarks come at a time when public anger over corruption and inequality is mounting. Civil society groups have condemned the clerics comments as dangerously tone-deaf.\n\nReligious leaders should be standing with the poor, not with looters, said an activist from the Zimbabwe Anti-Corruption Forum. To call those accused of corruption visionaries is to normalize theft.\n\nDespite the backlash, Musindo doubled down, insisting that Zimbabwe needs to celebrate its rich sons and warning that hatred for the wealthy would block national progress.\n\nObservers say the controversy has reignited debate over the role of the church in national affairs and its silence on corruption. As one analyst noted, When preachers start defending those accused of plundering public funds, the moral compass of the nation is in serious trouble.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chinhoyi – Destiny for Africa Network founder and cleric Rev Dr Obadiah Musindo has sparked outrage after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/obadiah-musindo-defends-looting-zvigananda/\">Continue reading<span class=\"screen-reader-text\"> \"Obadiah Musindo Defends Looting Zvigananda\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "It’s Impossible For Mnangagwa To Extend Term Of Office Without A Referendum: MP Unpacks Facts",
            "url": "https://www.zimeye.net/2025/11/01/its-impossible-for-mnangagwa-to-extend-term-of-office-without-a-referendum-mp-unpacks-facts/",
            "content": "By Hon Johnson Matambo, Kuwadzana West Constituency MP\n\nPresident Emmerson Mnangagwas second and final term is set to expire in 2028, but growing calls from within ZANU PF to extend his stay in power beyond the constitutional limit have sparked fierce debate about the legality of such a move. Some loyalists have floated the idea of adding two extra years to his mandate  stretching his tenure to 2030  without holding a referendum.\n\nHowever, this proposal directly contradicts the clear provisions of Zimbabwes Constitution.\n\nUnderstanding Section 328  Why Term Limit Extensions Need a Referendum\n\nThe Claim:Proponents of the extension argue that Parliament can simply insert a seven-year term without amending Section 95, claiming it is merely a duration change rather than a term-limit amendment. They insist that because it does not explicitly alter the two-term limit, it does not trigger the need for a national referendum.\n\nHowever, this interpretation is legally flawed and unconstitutional.\n\nThe Constitutional Reality\n\nUnder Section 95(2) of the Constitution, a presidential term is clearly defined as five years. Any attempt to alter that duration  whether increasing it to seven or ten years  amounts to an amendment of the term-limit provision. Such a change automatically invokes the safeguards set out in Section 328(6) and (7), which state that:\n\nAny amendment affecting the tenure or term of the President requires a 90-day public notice.\n\nIt must secure two-thirds approval in both the National Assembly and the Senate.\n\nMost importantly, it must be subjected to a national referendum since it affects Chapter 5 of the Constitution, which deals with the Presidency.\n\nNo Retroactive Benefit\n\nSection 328(7) is unequivocal: no sitting or former President can benefit from any amendment that extends or alters the term of office. This means even if Parliament were to pass such an amendment, President Mnangagwa would not be eligible to benefit from it, as he has already served under the current constitutional provisions.\n\nTherefore, any attempt to extend his term without a referendum is not only unconstitutional but also a direct violation of democratic principles and the rule of law.\n\nThe Bigger Picture\n\nZimbabwes Constitution was crafted to prevent the manipulation of presidential terms  a safeguard against authoritarian entrenchment. Extending a leaders tenure through parliamentary manoeuvres undermines the sovereignty of the people, who are the ultimate custodians of constitutional power.\n\nAs the nation approaches the end of President Mnangagwas final term, the Constitution must remain the guiding compass. Any legitimate change to the duration or limit of presidential terms must be done transparently, with the full consent of citizens through a referendum.\n\nIn short, Parliament cannot lawfully extend the Presidents term without a referendum, and any such move would be unconstitutional and invalid. The will of the people, not political expediency, must prevail.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Hon Johnson Matambo, Kuwadzana West Constituency MP President Emmerson Mnangagwa’s second and final term is set to expire in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/its-impossible-for-mnangagwa-to-extend-term-of-office-without-a-referendum-mp-unpacks-facts/\">Continue reading<span class=\"screen-reader-text\"> \"It’s Impossible For Mnangagwa To Extend Term Of Office Without A Referendum: MP Unpacks Facts\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "Prof Welshman’s AI-Road Accident Exposes High Corruption In Judiciary System",
            "url": "https://www.zimeye.net/2025/11/01/prof-welshmans-ai-road-accident-exposes-high-corruption-in-out-judiciary-system/",
            "content": "BY MANDLA MPOFU\n\nThe Supreme Court of Zimbabwe has ruled that legal arguments filed by Professor Welshman Ncube, which cited twelve fictitious judgments generated by artificial intelligence, are invalid and must be treated as a nullity. The court accepted Ncubes apology for the errors, which he attributed to a graduate researcher who relied on AI without verifying the output. The court dismissed the appeal and ordered Pulserate Investments to cover the respondents costs on a higher scale.\n\nThis ruling highlights the importance of professional diligence and accuracy in legal arguments. The Supreme Court bench  Justices Susan Mavangira, Felistus Chatukuta, and Hlekani Mwayera  dismissed the appeal by Pulserate Investments Company due to flawed legal submissions prepared by Professor Ncube. These submissions contained a dozen fictitious cases generated by AI, which Ncubes researcher failed to verify. Ncube apologized for the mistake, describing it as a catastrophic lapse in professional judgment and a failure to verify AI-generated cases.\n\nWhile the court accepted his apology, it dismissed the appeal and ordered Pulserate to pay the respondents costs. The silence of the Judicial Service Commission (JSC) and Thabani Mpofu, despite being aware of the issue since July 3, raises questions about accountability and the seriousness with which such misconduct is treated.\n\nProfessor Ncubes apology, though appreciated, does not absolve him of responsibility. Concerns about the consequences of not addressing such misconduct are valid, and it is crucial for the legal profession to uphold high standards of integrity and professionalism. Questions about potential censure, personal liability for costs, and referral for disciplinary hearing are pertinent and deserve serious consideration. The situation highlights the urgent need for transparency and accountability within the legal system to maintain public trust.\n\nThe silence of Thabani Mpofu  who was vocal in the case against Judge Katiyo  exposes bias and double standards. It further suggests that Justice Katiyo is being persecuted merely because he is perceived as a pro-government judge. There is no evidence that Judge Katiyo is pro-government, yet the way the JSC rushed to attack him and set up a tribunal for his removal clearly shows he is a victim of an opposition-driven plot led by senior judges within the JSC who are bent on punishing anyone perceived to support government.\n\nThe behaviour of the JSC and senior High Court judges is unacceptable, immature, and undermines both the authority of the President and the integrity of the justice system itself. The charges and attacks by the JSC are viewed as an attempt to discredit the President and weaken his authority. The clear motive appears to be isolating the President and tarnishing his legacy. Every judge serves at the pleasure of the President, not the JSC.\n\nAn interesting case has also emerged where Judge President Mary Zimba delivered a judgment in a matter in which no legal practitioner appeared. This mirrors the same situation for which Judge Katiyo is being harassed. While Katiyos case was a mere technical glitch, the Judge Presidents was deliberate  she moved swiftly to obstruct justice by issuing illegal judgments to cover her mistakes. It is well known that the JSC Secretary will not take any action against the Judge President because she is being used to intimidate other judges into submission.\n\nOur justice system is now controlled by one individual who treats judges as his subordinates. The partiality and actions of the JSC weaken national institutions and contradict the Presidents mandate. It is clear that these actions are self-serving, aimed at avoiding scrutiny  particularly as the JSC Secretary continues to operate as a life executive secretary with no term limit.\n\nThere is now a plot to personalise the judiciary, with one judge being groomed to take over as Judge President and the current JP earmarked for promotion to the Supreme Court through the influence of the JSC. The JSC employs relatives, wives, and concubines of the JSC Secretary. We will soon publish the names of these individuals.\n\nCurrently, judges are treated like children  controlled by the JSC Secretary and instructed which parties to favour in their cases. It is disheartening that the plot to dismantle the justice system is being led by the JSC in collaboration with Advocate Thabani Mpofu.\n\nOne must ask: if Judge Katiyo is not being victimised for perceived pro-government links, why has Thabani Mpofu not reported Welshman Ncube to the Law Society? Why has the JSC not taken any action against Ncube? Why is the Judge President immune from the same scrutiny that other judges face?\n\nAs a nation, we must call for respect for our judiciary and its institutions.\n\nThree senior Supreme Court judges  Justices Mavhangira JA, Chatukuta JA, and Mwayera JA  sitting in Harare as the highest appellate court, dismissed the appeal by Pulserate Investments Company after discovering a dozen fictitious cases cited in the legal arguments by Professor Welshman Ncube, a senior opposition lawyer. Another opposition lawyer, Thabani Mpofu, moved for the removal of those false cases from the record. The Supreme Court agreed and expressed strong displeasure at such conduct.\n\nHowever, Thabani Mpofu did not publicise this matter on social media as he did with Judge Katiyos case  revealing a clear bias within the system. What is interesting is that both the JSC and Mpofu have been aware of this issue since July 3 yet remain silent.\n\nAn apology alone cannot undo the damage caused  poison remains poison, whether delivered personally or through a messenger. The learned Professor bears full responsibility, as he himself admitted. If the court had not detected the false citations, Zimbabwe would have witnessed a serious miscarriage of justice  not only misleading precedent from the highest court but also a grave indictment on our judiciarys credibility.\n\nIf such conduct does not warrant censure, what kind of misconduct will? Shouldnt the senior counsel have been held personally liable for costs, or even referred for disciplinary proceedings? Why did Mpofu not file a complaint against such serious misconduct if he truly stands for justice?\n\nEven the court itself should have held the lawyer accountable. The pattern of selective complaints must end; justice must be consistent across the board, or we risk trivialising our courts. One cannot imagine a whole case filled with fabricated citations designed to mislead the court going uninvestigated.\n\nAre we, as a society, rubber-stamping such behaviour? Why should a client suffer for the sins of a lawyer? Seeking legal advice should not lead to punishment.\n\nNow, the JSC has gone silent  both on the case involving the Judge President and on Thabani Mpofus complicity. If all judges serve at the pleasure of the President, why single out one judge for punishment? If the Ministry of Justice turns a blind eye, then indeed, things will fall apart.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BY MANDLA MPOFU The Supreme Court of Zimbabwe has ruled that legal arguments filed by Professor Welshman Ncube, which cited … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/prof-welshmans-ai-road-accident-exposes-high-corruption-in-out-judiciary-system/\">Continue reading<span class=\"screen-reader-text\"> \"Prof Welshman’s AI-Road Accident Exposes High Corruption In Judiciary System\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "Watch: Mutsvangwa Claims Zimbabweans In Support Of Mnangagwa",
            "url": "https://www.zimeye.net/2025/11/01/watch-mutsvangwa-claims-zimbabweans-in-support-of-mnangagwa/",
            "content": "By A Correspondent\n\nZANU PF spokesperson Christopher Mutsvangwa has claimed that Zimbabweans are overwhelmingly supportive of President Emmerson Mnangagwas leadership, dismissing reports of internal party divisions and speculation about succession plans.\n\nIn an interview with SABC News on Tuesday, Mutsvangwa said public sentiment clearly favours the President and that any discussions about the vice president automatically succeeding him were misguided.\n\nThe people have spoken, he said. Zimbabweans are behind President Mnangagwa. Leadership transitions are determined by the will of the people through elections, not rumours or factional speculation.\n\nAddressing the succession chatter, Mutsvangwa added: It is not correct to assume the vice president is next in line. There is no constitutional provision for automatic succession. Anyone who wants to lead must contest in an election, just like any other citizen.\n\nUsing a vivid analogy, Mutsvangwa likened the situation to a papal succession: This is not Rome, where cardinals sit in secret and decide who becomes pope. This is a democratic country  our leaders are chosen by the people.\n\nHe further defended discussions about extending the Presidents term in office, claiming that it reflects popular support rather than political manoeuvring. When people talk about the duration of the term, it is because they trust his leadership. The public has shown its confidence in him, Mutsvangwa said.\n\nZIMBABWEANS IN FULL SUPPORT OF PRESIDENT MNANGAGWA_____________________Distributed byZANU PF Headquarters:: INFORMATION AND PUBLICITY DEPARTMENTFollow us:Website:https://t.co/Xet05cB7ayFacebook: ZANU PF PARTYX:@ZANUPF_OfficialTiktok:https://t.co/ZA8bLVb551.officialpic.twitter.com/jCdNXyf9lS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF spokesperson Christopher Mutsvangwa has claimed that Zimbabweans are overwhelmingly supportive of President Emmerson Mnangagwa’s leadership, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/watch-mutsvangwa-claims-zimbabweans-in-support-of-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Mutsvangwa Claims Zimbabweans In Support Of Mnangagwa\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "Tanzania Erupts Into Total Chaos As Electoral Commission Declares Samia Suluhu Hassan Winner Of Controversial Polls",
            "url": "https://www.zimeye.net/2025/11/01/tanzania-erupts-into-total-chaos-as-electoral-commission-declares-samia-suluhu-hassan-winner-of-controversial-polls/",
            "content": "By A Correspondent\n\nTanzania descended into turmoil on Saturday after the national electoral commission declared President Samia Suluhu Hassan the winner of what opposition parties and observers are calling a deeply flawed and rigged election.\n\nAccording to the official announcement, Hassan allegedly secured an astonishing 97.66 percent of the total vote  a figure that many Tanzanians have dismissed as mathematical fiction.\n\nThis is not an election; its a selection, shouted one angry protester in Dar es Salaam as security forces fired tear gas to disperse crowds. How can one person get almost 100 percent in a real democracy? We have been robbed.\n\nViolent clashes were reported in several cities, including Mwanza, Arusha, and Zanzibar, as opposition supporters took to the streets demanding a fresh vote. Eyewitnesses said police used live ammunition in some areas, while internet access was severely restricted across the country.\n\nThis is a dark day for our nation, said a university lecturer from Dodoma. People went out to vote hoping for change, but the system was already predetermined. The election commission has become an extension of the ruling party.\n\nDespite the unrest, the electoral commission stood by its figures, insisting that the polls were free and fair. One senior official claimed that the results reflect the will of the Tanzanian people, a statement that immediately sparked further outrage.\n\nAs night fell, streets remained tense, with military vehicles patrolling major towns and opposition leaders reportedly placed under house arrest. We are witnessing the death of democracy in Tanzania, said another protester. This country is on fire, and its because the peoples voice has been silenced.\n\nThe situation remains volatile, with fears that the crisis could spiral into nationwide instability if dialogue is not urgently initiated.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tanzania descended into turmoil on Saturday after the national electoral commission declared President Samia Suluhu Hassan the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/tanzania-erupts-into-total-chaos-as-electoral-commission-declares-samia-suluhu-hassan-winner-of-controversial-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Tanzania Erupts Into Total Chaos As Electoral Commission Declares Samia Suluhu Hassan Winner Of Controversial Polls\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "BREAKING: Walter Magaya Arrested",
            "url": "https://www.zimeye.net/2025/11/01/breaking-walter-magaya-arrested/",
            "content": "Prophet Walter Magaya Arrested in Harare Following Years of Rape and Fraud Allegations\n\nBy ZimEye News | 1 November 2025\n\nBy Investigations Reporter | ZimEye | The Zimbabwe Republic Police (ZRP) has confirmed the arrest of Prophetic Healing and Deliverance (PHD) Ministries founder, Prophet Walter Magaya, in connection with multiple reports of rape and fraud.\n\nAccording to a police statement issued by Commissioner Paul Nyathi, Chief Staff Officer for Press and Public Relations, Magaya was apprehended early Saturday morning by a special police crack team.\n\nThe Zimbabwe Republic Police confirms the arrest of Prophetic Healing and Deliverance (PHD) Church Leader, Walter Magaya, in connection with several reports of rape and fraud, read the official ZRP statement.The suspect was arrested early today by a police crack team. More details will be released in due course.\n\nZimEyes Exclusive Investigations Since 2015\n\nThis dramatic arrest follows a decade of consistent investigative coverage by the ZimEye news network, which since 2015 has exposed numerous testimonies of alleged sexual abuse and manipulation involving Magaya.\n\nZimEye was the first media outlet to air exclusive recordings and testimonies implicating the PHD leader in a pattern of predatory behaviour under the guise of spiritual deliverance.\n\nIn one landmark expos, ZimEye released an audio recording of the late Nigerian televangelist TB JoshuaMagayas long-time mentordiscussing the growing scandals around Magayas ministry, warning of the fall of the anointed if accountability was not enforced.\n\nThose 2015-2018 reports, initially dismissed by Magayas followers as attacks on the church, have now been vindicated by official police action.\n\nPattern of Cover-Ups and Survivor Intimidation\n\nZimEyes archives detail repeated incidents in which survivors were silenced through intimidation, cash settlements, or threats of spiritual curses. Many of the victims, young women and former congregants, reported psychological trauma and economic manipulation.\n\nSome complainants had also lodged formal complaints to the police years ago, but their cases reportedly stalled under political pressure and alleged interference by influential figures in Harare.\n\nZRP Crackdown Marks Turning Point\n\nThe deployment of a ZRP crack team marks what sources inside the Ministry of Home Affairs describe as a turning point in the states willingness to confront religious abuse with political protection.\n\nZimEye understands that Magaya is currently being held for questioning at Harare Central Police Station, where detectives are compiling case dockets spanning almost ten years.\n\nAwaiting Court Appearance\n\nPolice say more details will be released in due course, with indications that Magaya could appear in court early next week facing multiple counts of rape and fraud.\n\nThis marks a historic development in one of Zimbabwes longest-running cases of alleged spiritual exploitation, financial deception, and sexual abuse within a religious organisation.\n\nZimEye will continue to track the story and release additional evidence and survivor testimonies from its decade-long investigative files.\n\nZimEye.com  Investigating Without Fear or Favour 2025\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Prophet Walter Magaya Arrested in Harare Following Years of Rape and Fraud Allegations By ZimEye News | 1 November 2025 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/breaking-walter-magaya-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Walter Magaya Arrested\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "Just In: Police Arrest Walter Magaya For Rape, Fraud",
            "url": "https://www.zimeye.net/2025/11/01/just-in-police-arrest-walter-magaya-for-rape-fraud/",
            "content": "By A Correspondent\n\nHarare The Zimbabwe Republic Police (ZRP) has confirmed the arrest of prominent Prophetic Healing and Deliverance (PHD) Ministries founder, Prophet Walter Magaya, over allegations of rape and fraud.\n\nAccording to a statement released by the police on Saturday, Magaya was taken into custody in Harare following a coordinated operation by a specialist law enforcement team.\n\nThe Zimbabwe Republic Police confirms the arrest of Prophetic Healing and Deliverance (PHD) Church Leader, Walter Magaya, in connection with several reports of rape and fraud, said Police Spokesperson, Commissioner Paul Nyathi.\n\nHe added that the high-profile preacher was arrested early today by a police crack team, and investigations are currently underway.\n\nCommissioner Nyathi said further information would be shared once preliminary inquiries are complete. More details will be released in due course, he stated.\n\nAs of Saturday afternoon, police officials had not disclosed where Magaya was being held or the number of cases he is facing. The arrest marks a dramatic twist for one of Zimbabwes most influential religious figures, whose ministry has attracted thousands of congregants across the country and beyond.\n\nThe ZRP statement was signed by Commissioner Nyathi, the Chief Staff Officer for Press and Public Relations, and addressed to the Commissioner-General of Police.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – The Zimbabwe Republic Police (ZRP) has confirmed the arrest of prominent Prophetic Healing and Deliverance … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/just-in-police-arrest-walter-magaya-for-rape-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Just In: Police Arrest Walter Magaya For Rape, Fraud\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "More Coup-Like Tanks Seen in Msasa",
            "url": "https://www.zimeye.net/2025/11/01/more-coup-like-tanks-seen-in-msasa/",
            "content": "By A Correspondent  More Zimbabwe National Army (ZNA) tanks and armoured vehicles were seen conducting drills in Msasa and along Harare Drive on Friday.\n\nThis sent shockwaves across the capital, rekindling chilling memories of the November 2017 coup that ousted long-time ruler Robert Mugabe.\n\nSeveral convoys of military hardware were seen moving towards the city centre, sparking widespread speculation on social media about renewed military activity in national politics.\n\nIt seems the military has started conducting drills every month  but in preparation for what? read a post on the popularCrime Watchplatform. This morning, I spotted a convoy of military vehicles moving along Harare Drive.\n\nThe exercises come amid mounting tension within the ruling ZANU PF party following the just-ended Annual National Peoples Conference in Mutare, which reaffirmed President Emmerson Mnangagwas controversial Vision 2030 agenda. The conference also endorsed his continued leadership beyond 2028, effectively dashing Vice President Constantino Chiwengas long-standing presidential ambitions.\n\nSources at the conference said the atmosphere was tense, particularly after a Central Intelligence Organisation (CIO)officer and ZANU PF member was arrested for allegedly attempting to smuggle a firearm into the venue. The incident deepened existing mistrust within Mnangagwas inner circle and exposed growing divisions between military-aligned factions loyal to Chiwenga and those backing Mnangagwa.\n\nThe MnangagwaChiwenga succession feud dates back to the aftermath of the 2017 coup. At the time, the two men reportedly struck a gentlemens agreement that Mnangagwa would serve a single term before handing power to Chiwenga, who had led the military operation that ousted Mugabe. However, Mnangagwas determination to extend his rule  now projected to 2030  has shattered that understanding and triggered a simmering cold war within the ruling elite.\n\nIn recent years, Mnangagwa has systematically eroded Chiwengas influence through cabinet reshuffles, the forced retirement of senior generals aligned with the vice president, and the promotion of loyalists within both the army and ZANU PF structures.\n\nPolitical analysts say the sudden visibility of tanks in Harare is unlikely to be coincidental.\n\nMilitary movements of this nature, in such a volatile political climate, send a message  whether of deterrence or defiance, a political analyst told this publication. They reflect the unresolved power struggle within the states coercive institutions.\n\nThe last time armoured vehicles rolled through Harares streets, the military claimed it was targeting criminals around the president. Days later, however, Mugabe was deposed, and Mnangagwa rose to power with the armys backing.\n\nEight years on, the reappearance of tanks in the capital has revived fears among Zimbabweans  a stark reminder that in the countrys fragile political landscape, the military remains the ultimate arbiter of power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — More Zimbabwe National Army (ZNA) tanks and armoured vehicles were seen conducting drills in Msasa and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/more-coup-like-tanks-seen-in-msasa/\">Continue reading<span class=\"screen-reader-text\"> \"More Coup-Like Tanks Seen in Msasa\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "Zimbabwean Woman Dies After Jumping From Cruise Ship",
            "url": "https://www.zimeye.net/2025/11/01/zimbabwean-woman-dies-after-jumping-from-cruise-ship/",
            "content": "By A Correspondent Tragedy has struck after a Zimbabwean woman,Rumbidzai Nyamurowa, who worked for theViking Star Cruise Ship, reportedly jumped into the sea and remains missing.\n\nThe incident occurred around11:30 a.m. on October 27while the vessel was sailing between theGreek island of CreteandSicily, Italy.\n\nItalian maritime authorities have since launched a large-scale search operation, but Nyamurowas body has not yet been recovered.\n\nIn a statement,Viking Cruisesconfirmed the incident, saying:\n\nWe can confirm that a crew member went overboard on October 27 while the Viking Star was sailing between Crete and Sicily. Our thoughts are with the individuals family and loved ones. We are cooperating fully with the relevant authorities.\n\nThe company said it would not release further details at this stage, citing respect for the privacy of the deceaseds family and colleagues.\n\nThe reason behind Nyamurowas decision to jump overboard remains unclear, and investigations are ongoing.\n\nNyamurowas death has shocked many Zimbabweans at home and abroad, with tributes flooding social media platforms describing her as kind, hardworking, and full of life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Tragedy has struck after a Zimbabwean woman, Rumbidzai Nyamurowa, who worked for the Viking Star Cruise Ship, reportedly jumped … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/zimbabwean-woman-dies-after-jumping-from-cruise-ship/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Woman Dies After Jumping From Cruise Ship\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        },
        {
            "title": "Six Die in Pavilion Bus Crash",
            "url": "https://www.zimeye.net/2025/11/01/six-die-in-pavilion-bus-crash/",
            "content": "By A Correspondent Six people have died while several others were injured after a Pavilion Yutong bus was involved in a fatal accident at the 131-kilometre peg along the HarareMukumbura Road on Thursday.\n\nIn a statement, national police spokespersonCommissioner Paul Nyathisaid the bus, which was carrying55 passengers, allegedly suffered a tyre burst around4:30 AM, causing the driver to lose control. The vehicle overturned once and landed on its side, killing six people on the spot and injuring40 others.\n\nThe bodies of the deceased were taken to Bindura Provincial Hospital for post-mortem, while the injured were ferried toKaranda, Madziwa, Mt Darwin, andBindura Hospitalsfor treatment, said Commissioner Nyathi.\n\nThe deceased have been identified as:\n\nPolice have urged motorists to exercise extreme caution and ensure that their vehicles are roadworthy before embarking on long-distance journeys, especially during the holiday season when traffic volumes are high.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Six people have died while several others were injured after a Pavilion Yutong bus was involved in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/01/six-die-in-pavilion-bus-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Six Die in Pavilion Bus Crash\"</span></a></p>",
            "time": "06:11",
            "date": "02 Nov 2025"
        }
    ]
}