{
    "news": [
        {
            "title": "Mt Selinda High School Leaps into the Future with Starlink Internet and New Bus",
            "url": "https://www.zimeye.net/2025/07/09/mt-selinda-high-school-leaps-into-the-future-with-starlink-internet-and-new-bus/",
            "content": "Chipinge Mt Selinda High School in rural Chipinge has embraced a bold new chapter in education, commissioning a new school bus and installing Starlink satellite internet, signalling a transformative shift in rural learning.\n\nAt a colourful ceremony attended by the Ministry of Primary and Secondary Education, the United Church of Christ in Zimbabwe (UCCZ), parents, alumni, and students, at the weekend, school head Mr. Phineas Mundeta described the dual investment as a historic transformation for the school and its surrounding community.\n\nThis is not just a bus  its a vehicle for dreams, for access, and for visibility, he said, adding that the improved transport will allow students to access academic competitions, career expos, and field trips previously out of reach.\n\nMt Selinda has shown consistent academic improvement, with Mr. Mundeta noting a steady rise in pass rates since 2019.\n\nThe schools excellence in science education has earned it recognition as the Chipinge district STEM hub and recipient of the Ministrys Permanent Secretarys Merit Award for discipline and academic performance.\n\nAdding to the schools modernization is the installation of high-speed Starlink internet. This development opens unprecedented digital learning opportunities for both learners and educators. Students can now access virtual lessons, research portals, coding platforms, and online academic content, while teachers benefit from global training resources and professional networks.\n\nThis connection ends the digital exclusion of our learners, said Mr. FOS Bandama, Education Secretary for UCCZ. It means global libraries, virtual science labs, and collaboration across borders.\n\nCommunity leaders and development practitioners hailed the initiative as a model for rural schools nationwide.\n\nMr. Claris Madhuku, an alumnus and director of the Platform for Youth and Community Development (PYCD), said the move represents a strategic effort to bridge Zimbabwes digital divide.\n\nIf scaled up, this can transform the future of thousands of rural learners. Digital literacy is now foundational for participation in the 21st-century economy, he said.\n\nThe development supports Zimbabwes Vision 2030 and the Ministrys digital learning strategy, which aims to ensure equitable access to education through ICT integration.\n\nGuest speaker Professor Lovemore Madhuku, also an alumnus, urged students to aim high, crediting his own academic journeybeginning as one of the first A-level students at Mt Selinda in 1985to the schools formative influence.\n\nSource-Vemuganga Community Radio\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chipinge – Mt Selinda High School in rural Chipinge has embraced a bold new chapter in education, commissioning a new school … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/mt-selinda-high-school-leaps-into-the-future-with-starlink-internet-and-new-bus/\">Continue reading<span class=\"screen-reader-text\"> \"Mt Selinda High School Leaps into the Future with Starlink Internet and New Bus\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "DA to lay criminal charges against Mchunu",
            "url": "https://www.zimeye.net/2025/07/09/da-to-lay-criminal-charges-against-mchunu/",
            "content": "The Democratic Alliance (DA) will lay criminal charges against Police Minister Senzo Mchunu at the Cape Town Central Police Station on Thursday.\n\nThis, in the light of statements by KZN Police Commissioner, Lieutenant General Nhlanhla Mkhwanazi, that Mchunu is affiliated to persons linked to criminal activities.\n\nMkhwanazi also indicated that top police officials are involved in criminal activities.\n\nThe DA says laying criminal charges against Mchunu forms part of their ongoing efforts to hold those in power accountable and to protect the rule of law.The Democratic Alliance (DA) will lay criminal charges against Police Minister Senzo Mchunu at the Cape Town Central Police Station on Thursday.\n\nThis, in the light of statements by KZN Police Commissioner, Lieutenant General Nhlanhla Mkhwanazi, that Mchunu is affiliated to persons linked to criminal activities.\n\nMkhwanazi also indicated that top police officials are involved in criminal activities.\n\nThe DA says laying criminal charges against Mchunu forms part of their ongoing efforts to hold those in power accountable and to protect the rule of law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Democratic Alliance (DA) will lay criminal charges against Police Minister Senzo Mchunu at the Cape Town Central Police Station … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/da-to-lay-criminal-charges-against-mchunu/\">Continue reading<span class=\"screen-reader-text\"> \"DA to lay criminal charges against Mchunu\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Minister Mchunu admits knowing Brown",
            "url": "https://www.zimeye.net/2025/07/09/minister-mchunu-admits-knowing-brown/",
            "content": "Police Minister Senzo Mchunu Admits Knowing Brown Mogotsi After Denying Association to Parliament Amid Mkhwanazis Explosive SAPS Corruption Allegations\n\nPolice Minister Senzo Mchunu has admitted to knowing Brown Mogotsi, a man he previously denied any association with during a parliamentary session. This admission, made in a statement from his office on 9 July 2025, follows explosive allegations by KwaZulu-Natal (KZN) Provincial Police Commissioner Lieutenant-General Nhlanhla Mkhwanazi. Mkhwanazi has accused Mchunu and other senior South African Police Service (SAPS) officials of corruption, claiming they are protecting criminals and undermining critical investigations. The unfolding scandal has sparked widespread outrage, calls for investigations, and fears about the integrity of the countrys police force.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Police Minister Senzo Mchunu Admits Knowing Brown Mogotsi After Denying Association to Parliament Amid Mkhwanazi’s Explosive SAPS Corruption Allegations Police … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/minister-mchunu-admits-knowing-brown/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Mchunu admits knowing Brown\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "João Pedro Haunts Former Club as Chelsea Storm Into Club World Cup Final",
            "url": "https://www.zimeye.net/2025/07/09/joao-pedro-haunts-former-club-as-chelsea-storm-into-club-world-cup-final/",
            "content": "Sports Correspondent\n\nNEW JERSEY  Joo Pedro delivered a stunning performance against his boyhood club Fluminense, scoring both goals in Chelseas 20 victory in the Club World Cup semifinal on Tuesday night.\n\nThe 23-year-old Brazilian forward, who joined Chelsea from Brighton & Hove Albion for 60 million ($81.5 million) just last week, made his first start in Chelsea colors a memorable one, netting in the 18th and 56th minutes at MetLife Stadium in New Jersey.\n\nHis opening goal was a spectacular curling strike that left Fluminense goalkeeper Fbio rooted to the spot. His second came from a swift Chelsea counterattack, calmly slotted home to seal the Blues place in Sundays final, where they will face either Real Madrid or Paris Saint-Germain.\n\nThough elated with the result, Pedro admitted it was an emotionally complex moment to knock out the club that nurtured him.\n\nIm happy to score my first goal, but also I know this tournament is very important for them, he told reporters after the match. I cant just say sorry, but I have to be professional. I play for Chelsea. They pay me to score goals. And today I was happy to score.\n\nFluminense, the last South American side in the competition, saw their campaign ended by one of their own. Pedro, who came through their youth academy and made 25 league appearances for the Rio de Janeiro side in 2019, moved to England that same year  first joining Watford, then Brighton, and now Chelsea.\n\nFluminense had high hopes after reaching the quarterfinals and previously appearing in the 2023 Club World Cup final under the tournaments former format. But on this night, it was a homegrown talent now wearing blue who shattered their dreams.\n\nChelsea now eye a historic moment in Sundays final, with Joo Pedro quickly becoming a hero among Blues fans  and a heartbreaker for Fluminense faithful.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent NEW JERSEY – João Pedro delivered a stunning performance against his boyhood club Fluminense, scoring both goals in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/joao-pedro-haunts-former-club-as-chelsea-storm-into-club-world-cup-final/\">Continue reading<span class=\"screen-reader-text\"> \"João Pedro Haunts Former Club as Chelsea Storm Into Club World Cup Final\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Zvigananda Team Buying Spree Continues",
            "url": "https://www.zimeye.net/2025/07/09/zvigananda-team-buying-spree-continues/",
            "content": "Sports Correspondent\n\nScotland FCs aggressive recruitment drive shows no signs of slowing down, with the club confirming the signing of Malawian striker Khuda Muyaba.\n\nThe 31-year-old forward arrives as a direct replacement for Namibian striker Sydney Urikhob, who was recently released by the club.\n\nMuyaba brings with him a wealth of experience from South Africa, having featured for clubs such as Polokwane City, Richards Bay, and Venda FC.\n\nThe signing signals Scotland FCs intent to bolster its attacking options as part of an ongoing squad overhaul under the Zvigananda-led leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Scotland FC’s aggressive recruitment drive shows no signs of slowing down, with the club confirming the signing of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/zvigananda-team-buying-spree-continues/\">Continue reading<span class=\"screen-reader-text\"> \"Zvigananda Team Buying Spree Continues\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Key Facts About Cutting Livestock Production Costs…",
            "url": "https://www.zimeye.net/2025/07/09/key-facts-about-cutting-livestock-production-costs/",
            "content": "By Doctor Trywell Muzerengi\n\nImproving Local Feed Resources for Better Livestock Nutrition\n\nFeeding remains one of the biggest expenses in livestock production, consuming up to 80% of total input costs. For both smallholder and commercial farmers, the reliance on expensive and sometimes unavailable commercial feeds is a major challenge. However, utilizing locally available feed resources can provide a sustainable, affordable, and effective solutionif managed strategically.\n\nHere are key areas that farmers can focus on to improve livestock nutrition while cutting costs:\n\nIn conclusion, livestock farming can become more profitable and sustainable by shifting focus toward improving local feed resources. With the right knowledge, group initiatives, and proper feed management, farmers can significantly lower costs while improving animal health and productivity.\n\nInstagram: lasmuzagro1\n\nLinkedIn: Lasmuz Agro\n\nlasmuzagrosolutions@gmail.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Doctor Trywell Muzerengi Improving Local Feed Resources for Better Livestock Nutrition Feeding remains one of the biggest expenses in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/key-facts-about-cutting-livestock-production-costs/\">Continue reading<span class=\"screen-reader-text\"> \"Key Facts About Cutting Livestock Production Costs…\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Video: Robbers Pounce On Truck Driver On Detour Along Masvingo–Beitbridge Road",
            "url": "https://www.zimeye.net/2025/07/09/video-robbers-pounce-on-truck-driver-on-detour-along-masvingo-beitbridge-road/",
            "content": "By A Correspondent\n\nDelays in construction endanger drivers lives\n\nA truck driver was ambushed and robbed on 07 July 2025 while navigating a detour along the MasvingoBeitbridge highway  an area increasingly viewed as a hotspot for violent crime due to poor road infrastructure and stalled upgrades.\n\nAccording to eyewitnesses and circulating video footage, the robbery took place late at night near an unlit, isolated section of the detour. The attackers, who remain unidentified, forcibly stopped the truck, overpowered the driver, and stole valuables and cargo before fleeing the scene.\n\nThe incident has sparked renewed outrage, with critics pointing fingers at the Zanu PF-led government for failing to expedite the completion of roadworks along the key economic corridor.\n\nThis wouldnt be happening if construction had been completed on time, said a local transporter. These half-done detours are a death trap for drivers.\n\nOpposition voices have also weighed in, accusing the ruling regime of dragging key processes and prioritizing political optics over public safety. Some allege that corruption and mismanagement have contributed to the prolonged delays, turning the detour into a criminal haven.\n\nAuthorities say investigations are ongoing, but residents and truckers remain fearful, urging immediate government action to ensure safety and accountability on one of Zimbabwes most vital highways.\n\nWATCH | On 07 July 2025, a truck driver was robbed near a detour along the BeitbridgeMasvingo route.@PoliceZimbabwepic.twitter.com/7b1MqZAtr9\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Delays in construction endanger drivers’ lives… A truck driver was ambushed and robbed on 07 July 2025 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/video-robbers-pounce-on-truck-driver-on-detour-along-masvingo-beitbridge-road/\">Continue reading<span class=\"screen-reader-text\"> \"Video: Robbers Pounce On Truck Driver On Detour Along Masvingo–Beitbridge Road\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Gert Nel Primary Sets the Pace in Gutu with Academic and Sporting Excellence",
            "url": "https://www.zimeye.net/2025/07/09/gert-nel-primary-sets-the-pace-in-gutu-with-academic-and-sporting-excellence/",
            "content": "By A Correspondent\n\nGUTU  Gert Nel Government Primary School in Chatsworth, Gutu District, is fast emerging as a beacon of excellence in both academics and sports.\n\nAs the only government primary school in the district, the institution is steadily building a strong reputation for producing well-rounded pupils under the capable leadership of Headmaster Mr Musara Trannie.\n\nWith an enrolment of 447 pupils and 16 dedicated teachers, Gert Nel continues to fulfil its mission of providing quality education in a child-friendly environment.\n\nLast year, the school recorded an impressive 72.5% pass rate, placing it among the top-performing government-run institutions in the region.\n\nOutside the classroom, Gert Nel has also distinguished itself in the sporting arena. The schools basketball team recently clinched top honours at the zonal competitionsan achievement credited to the talent of the pupils and the dedication of their coaches. Its tennis players also came out on top at the same level, reinforcing the schools growing reputation as a formidable contender in primary school sports.\n\nKey staff membersincluding Deputy Head Matizanadzo Rumbidzai, Senior Teacher Manamike Edson, and Teacher-in-Charge Mpofu Brightonhave been instrumental in steering both academic and extracurricular achievements.\n\nTheir teamwork has cultivated a dynamic learning environment where pupils are encouraged to express themselves and thrive.\n\nThe school is equipped with modern learning resources, including a well-stocked library and an ICT roomfacilities that remain rare in many rural schools. These tools have played a crucial role in promoting digital literacy and enhancing academic performance.\n\nGert Nel also enjoys strong support from its vibrant Old Students Association, chaired by Chigome Joel, which plays an active role in backing school programmes and events.\n\nIn addition, the School Development Committee (SDC) has been central to the schools recent progress. Led by Chairperson Tizai Givemore, the committee includes Vice Chairperson Mrs Hall, Treasurer Muramba Rudo, Secretary Mushayahanya, and member Mandati.\n\nTheir hands-on involvement has been pivotal in driving development efforts and ensuring a stable learning environment.\n\nParents, community members, and education stakeholders in Gutu District have commended Gert Nel Government Primary School for its holistic approach to education and its commitment to nurturing young talent.\n\nAs the school continues to raise the bar, it stands as a model of what can be accomplished through visionary leadership, committed staff, active alumni, and strong community engagement.\n\nGert Nel Government Primary School learners excel\n\nThe tennis team \n\nGert Nel Government Primary School\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent GUTU – Gert Nel Government Primary School in Chatsworth, Gutu District, is fast emerging as a beacon … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/gert-nel-primary-sets-the-pace-in-gutu-with-academic-and-sporting-excellence/\">Continue reading<span class=\"screen-reader-text\"> \"Gert Nel Primary Sets the Pace in Gutu with Academic and Sporting Excellence\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Desperate Mutsvangwa Claims Mnangagwa, Chiwenga Inseparable",
            "url": "https://www.zimeye.net/2025/07/09/desperate-mutsvangwa-claims-mnangagwa-chiwenga-inseparable/",
            "content": "By A Correspondent\n\nHARARE  In what many are viewing as a desperate attempt to downplay intensifying factional tensions, Zanu PF spokesperson Ambassador Christopher Mutsvangwa has claimed that President Emmerson Mnangagwa and his deputy, Vice President Constantino Chiwenga, are inseparable despite persistent reports of internal discord.\n\nIn a statement issued on Tuesday night, Mutsvangwa feebly painted a picture of unshakable unity between the two leaders, even as signs of political strain continue to emerge from within the ruling party.\n\nThey have been well steeled through the toughest of character tests, Mutsvangwa said. A petty or fleeting quarrel is never carried into battle as comrades wade into battle. The stakes are so high. They pale at the prospect of supreme sacrifice.\n\nFraming the relationship in wartime rhetoric, Mutsvangwa added: Tiffs have no place in gunfire being exchanged in anger with the enemy. Your comrade is, after all, your keeper.\n\nHe further claimed, I have had the opportunity to know and grow with both President Mnangagwa and VP Chiwenga for over five decades. According to Mutsvangwa, the two leaders have stood together through national threats and continue to focus on developmental projects like road infrastructure and agriculture.\n\nBut observers remain unconvinced. With reports of infighting, succession battles, and growing friction between rival camps within Zanu PF, Mutsvangwas insistence on harmony has only deepened speculation that all is not well.\n\nThe louder the denials, the deeper the cracks, one political analyst remarked. Mutsvangwa sounds less like a spokesperson and more like a man trying to hold a collapsing structure together with slogans.\n\nAs internal power games escalate ahead of the partys future leadership contests, Mutsvangwas desperate appeal for unity may be less about reality  and more about damage control.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – In what many are viewing as a desperate attempt to downplay intensifying factional tensions, Zanu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/desperate-mutsvangwa-claims-mnangagwa-chiwenga-inseparable/\">Continue reading<span class=\"screen-reader-text\"> \"Desperate Mutsvangwa Claims Mnangagwa, Chiwenga Inseparable\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Mnangagwa’s Top Advisor Grabs City Sports Club Refurbishment Tender",
            "url": "https://www.zimeye.net/2025/07/09/mnangagwas-top-advisor-grabs-city-sports-club-refurbishment-tender/",
            "content": "By A Correspondent\n\nHARARE  A storm is brewing over the controversial awarding of a contract to refurbish the iconic City Sports Centre in Harare to Paul Tungwarara, a special advisor to President Emmerson Mnangagwa.\n\nThe deal, awarded without public tender, has raised concerns over transparency and executive interference in local governance.\n\nTungwararas company, Prevail Group, was granted the exclusive rights to renovate the City Sports Centre in what is being framed as a strategic partnership by City of Harare officials.\n\nMayor Jacob Mafume confirmed the development earlier this week and admitted that no formal tendering process was followed.\n\nThis is a strategic partnership. Its an ideal arrangement for the city, Mafume said. We need to think outside the box. The President directed us to enter into this agreement, and we obliged.\n\nCritics, however, say the awarding of the multimillion-dollar deal to a politically connected individualwithout open biddingundermines both transparency and the autonomy of the city council.\n\nThis is nothing more than state capture at municipal level, said a city official who spoke on condition of anonymity. The mayor is openly admitting that he acted on presidential orders. What happened to procurement laws?\n\nPaul Tungwarara, a known business ally of Mnangagwa and influential figure within the ruling elite, has previously been linked to several high-value state-linked projects, often under murky circumstances. His latest involvement has ignited allegations of favoritism and disregard for procurement regulations.\n\nWhile Mafume insists the partnership will bring much-needed investment to a dilapidated facility, residents and civic watchdogs are questioning why the deal bypassed public scrutiny.\n\nWe deserve better. These backdoor deals rob the city of accountability, said Patience Sibanda, a youth sports coordinator. City Sports Centre belongs to the people, not politicians.\n\nAs Harare grapples with deteriorating infrastructure and a public outcry over corruption, the City Sports Centre deal has become yet another flashpoint in the broader debate over governance, influence, and impunity in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – A storm is brewing over the controversial awarding of a contract to refurbish the iconic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/09/mnangagwas-top-advisor-grabs-city-sports-club-refurbishment-tender/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Top Advisor Grabs City Sports Club Refurbishment Tender\"</span></a></p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        }
    ]
}