{
    "news": [
        {
            "title": "Warriors Boost AFCON Preparations…",
            "url": "https://www.zimeye.net/2025/12/09/warriors-boost-afcon-preparations/",
            "content": "Sports Correspondent  The Warriors build-up to the 2025 Africa Cup of Nations is gathering momentum, with several foreign-based players expected to reinforce the national team camp in the coming days.\n\nThe squad began its preparations two weeks ago, starting with locally based players reporting first. England-based midfielder Marvelous Nakamba has already linked up with the team, joining camp last week to add experience and stability in midfield.\n\nDefender Teenage Hadebe is also set to join his teammates after arriving from the United States last week, providing a major boost to the defensive department.\n\nAt the same time, ZIFA has been in negotiations with English League One side Plymouth Argyle regarding the release of defender Brendan Galloway. The club had initially wanted Galloway to feature in their fixture against Wycombe Wanderers on Tuesday before allowing him to join the Warriors.\n\nWith the official deadline for player release set for 15 December, the technical team remains confident that all targeted players will report on time. The AFCON tournament is scheduled to kick off in Morocco on 21 December, giving Zimbabwe limited but crucial days to fine-tune their preparations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – The Warriors’ build-up to the 2025 Africa Cup of Nations is gathering momentum, with several foreign-based players … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/warriors-boost-afcon-preparations/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Boost AFCON Preparations…\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "State Security Agents Arrest Masvingo Mirror Journalists Over Ezra Chadzamira Land Grab Saga",
            "url": "https://www.zimeye.net/2025/12/09/state-security-agents-arrest-masvingo-mirror-journalists-over-ezra-chadzamira-land-grab-saga/",
            "content": "By A Correspondent  State security agents have taken into custodyMasvingo Mirroreditor Garikai Mafirakureva, news editor Simbarashe Mtembo, and the outlets driver, Tinashe Koga. The trio was picked up by a team of nine armed CID officers and seven CIO operatives reportedly led by an officer identified as Nkala.\n\nThe journalists are currently being held at Masvingo Central Police Station. They were arrested while standing outside a contested piece of land that Masvingo Minister of State, Ezra Chadzamira, is accused of seizing from a widow before beginning construction of a school on the site. Water pipes belonging to Masvingo City Council at the property have also reportedly been damaged.\n\nMasvingo Mirror staff members\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – State security agents have taken into custody Masvingo Mirror editor Garikai Mafirakureva, news editor Simbarashe Mtembo, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/state-security-agents-arrest-masvingo-mirror-journalists-over-ezra-chadzamira-land-grab-saga/\">Continue reading<span class=\"screen-reader-text\"> \"State Security Agents Arrest Masvingo Mirror Journalists Over Ezra Chadzamira Land Grab Saga\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "George Guvamatanga Claims Private Sector Behind Removal Of USD",
            "url": "https://www.zimeye.net/2025/12/09/george-guvamatanga-claims-private-sector-behind-removal-of-usd/",
            "content": "Tinashe Sambiri Finance Ministry secretary George Guvamatanga on Monday claimed that the private sector played a central role in setting 2030 as the deadline to end Zimbabwes multicurrency system and adopt a sole local currency.\n\nSpeaking at a post-budget conference in Harare, Guvamatanga insisted that the government did not originate the 2030 target. He said the date was included in the relevant statutory instrument (SI) following pressure from the Confederation of Zimbabwe Industries (CZI).\n\nThe 2030 date was never a government date. I remember I worked on the SI, and I argued that lets not put a closing date on this, Guvamatanga explained. There was strong pushback from CZI, who said we want a date, and we put a date.\n\nHe added that ongoing consultations with industry stakeholders had since led to a reconsideration of the timeline. Guvamatanga also revealed that the statutory instrument itself was largely drafted by the Bankers Association of Zimbabwe (BAZ) in collaboration with CZI.\n\nThe SI is not even ours; it was largely driven by BAZ, and CZI had influence. They wrote the SI; its their lawyers who wrote the SI. CZI came with the date, BAZ came with the SI, and we simply published it, he said.\n\nFinance Minister Mthuli Ncube, who attended the conference, expressed support for removing the deadline altogether.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Finance Ministry secretary George Guvamatanga on Monday claimed that the private sector played a central role in setting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/george-guvamatanga-claims-private-sector-behind-removal-of-usd/\">Continue reading<span class=\"screen-reader-text\"> \"George Guvamatanga Claims Private Sector Behind Removal Of USD\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "Mnangagwa Speaks Of Ending Corruption As Zvigananda Loot State Resources At Will",
            "url": "https://www.zimeye.net/2025/12/09/mnangagwa-speaks-of-ending-corruption-as-zvigananda-loot-state-resources-at-will/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwa has once again pledged a crackdown on corruption, yet critics argue that while lofty promises are made, looting by well-connected individualsoften referred to locally as Zviganandacontinues unabated.\n\nIn a statement marking the 2025 International Anti-Corruption Day on Tuesday, Mnangagwa reaffirmed his commitment to uphold good governance, strengthen institutional integrity and maintain a zero-tolerance stance on corruption.\n\nHe touted achievements under the National Anti-Corruption Strategy, which he launched in 2020, claiming that close to 2,500 cases have been investigated, over 800 dockets sent to the National Prosecuting Authority (NPA), with a 60% conviction rate and assets worth more than US$20 million recovered.\n\nHowever, opposition voices and civil society observers argue that these numbers paint a misleading picture. Many high-profile cases appear stalled or result in minimal penalties, while insiders continue to exploit state resources with impunity. As one activist noted: The President talks about zero tolerance, yet the so-called Zvigananda continue to move freely, looting public funds while ordinary citizens suffer.\n\nMnangagwa commended the Zimbabwe Anti-Corruption Commission (ZACC) and the NPA, but conceded that more must be done to strengthen their investigative capacity and synergies to expunge the perception of a catch-and-release trend. Critics, however, say the perception of selective justice has only worsened over the years, with enforcement appearing politically motivated.\n\nThe government has also introduced a fast-track court system and approved the Whistle-blowers and Witness Protection Bill, intended to accelerate the fight against corruption. Yet, analysts warn that legislation alone cannot curb entrenched graft if political will is lacking. One legal expert commented: Bills and strategies look good on paper, but unless there is consistent accountability, corruption will continue to thrive.\n\nObservers argue that while Mnangagwa speaks of ending corruption, the reality on the ground tells a starkly different storyone where those with connections continue to loot state resources at will, leaving the average Zimbabwean to bear the cost.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa has once again pledged a crackdown on corruption, yet critics argue that while lofty promises … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/mnangagwa-speaks-of-ending-corruption-as-zvigananda-loot-state-resources-at-will/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Speaks Of Ending Corruption As Zvigananda Loot State Resources At Will\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "Varakashi Claim Zimbabwe Ranked 10th in Africa ” for Road Quality”",
            "url": "https://www.zimeye.net/2025/12/09/varakashi-claim-zimbabwe-ranked-10th-in-africa-for-road-quality/",
            "content": "Tinashe Sambiri On Tuesday, Zanu PF online activists, known locally as Varakashi, celebrated a report from Nigerias Vanguard claiming that Zimbabwe has been ranked 10th among African countries with the best road quality.\n\nThe report listed the top ten as follows:1 Namibia2 South Africa3 Morocco4 Botswana5 Egypt6 Algeria7 Tunisia8 Angola9 Cte dIvoire Zimbabwe\n\nVarakashi shared the ranking on social media with enthusiasm, posting: Zim Ranked 10th in Africa for Best Road Quality This is a proud moment for our nation.\n\nHowever, critics have dismissed the claim as out of touch with reality, pointing to the numerous potholes, deteriorating highways, and poorly maintained urban roads across the country. One Harare commuter commented: Its laughable to say our roads are in the top ten in Africa when you can barely drive through a single suburb without hitting a pothole.\n\nDespite the accolades in the report, many Zimbabweans remain frustrated by the state of the nations roads and see the ranking as a political boast rather than a reflection of reality.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– On Tuesday, Zanu PF online activists, known locally as Varakashi, celebrated a report from Nigeria’s Vanguard claiming that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/varakashi-claim-zimbabwe-ranked-10th-in-africa-for-road-quality/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi Claim Zimbabwe Ranked 10th in Africa ” for Road Quality”\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "Video: Anti-Presidential Criticism Group Vows to Arrest Those Opposing Mnangagwa",
            "url": "https://www.zimeye.net/2025/12/09/video-anti-presidential-criticism-group-vows-to-arrest-those-opposing-mnangagwa/",
            "content": "Tinashe Sambiri In a controversial move raising eyebrows across the country, the leader of the Anti-Presidential Criticism Group, a Zanu PF-aligned organisation, threatened to arrest anyone publicly opposing President Emmerson Mnangagwa.\n\nSpeaking at a recent rally organised by the group, the leader said:\n\nWe will not tolerate anyone speaking against our President. Those who oppose him will face consequences.\n\nThe statement has sparked widespread concern among opposition supporters and civil society groups, who argue that such threats undermine democratic principles and freedom of expression in Zimbabwe. The group claims its actions are aimed at protecting the image and authority of the President, but critics say it reflects a growing intolerance toward dissent.\n\nOnly in Zimbabwe | The leader of the Anti-Presidential Criticism group, a Zanu PF-aligned organisation, was speaking at a recent event they organised.pic.twitter.com/nEcd9gMP41\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– In a controversial move raising eyebrows across the country, the leader of the Anti-Presidential Criticism Group, a Zanu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/video-anti-presidential-criticism-group-vows-to-arrest-those-opposing-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Video: Anti-Presidential Criticism Group Vows to Arrest Those Opposing Mnangagwa\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "Mnangagwa USD 400 000 Donation To Warriors – Blessing Or Curse ?",
            "url": "https://www.zimeye.net/2025/12/09/mnangagwa-usd-400-000-donation-to-warriors-blessing-or-curse/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwas recent donation of US$400,000 to the Zimbabwe Senior Mens football team, the Warriors, has sparked debate over whether such handouts are a genuine boost or a distraction from deeper issues in Zimbabwean sports.\n\nThe contribution, announced this week by Minister of Sport, Recreation, Arts and Culture Anselem Sanyatwe at a ZIFA-organised send-off event in Harare, was said to come directly from the Presidents office, rather than the state fiscus. Sanyatwe said: Let me proudly inform you that the President of the Republic of Zimbabwe injected a total of US$400,000 from his office, and not fiscus, for the welfare of our Warriors during AFCON.\n\nWhile the ceremony brought together Deputy Minister Emily Jesaya, ZIFA president Nqobile Magwizi, business representatives, and football supporters, critics argue that such lavish donations do little to address the systemic issues plaguing football in the country. Questions have been raised about transparency, the source of the funds, and whether similar support trickles down to grassroots clubs struggling for basic resources.\n\nAnalysts noted that while players may benefit in the short term, the focus on one-off donations risks masking chronic underfunding and poor infrastructure across Zimbabwean football. It is commendable to support the national team, but $400,000 for a send-off does not solve the long-standing neglect of youth development and domestic leagues, one sports commentator said.\n\nAt the event, Minister Sanyatwe urged the Warriors to give their all in the challenging Group B, which includes South Africa, Angola, and Egypt. Meanwhile, ZIFA unveiled the teams new jersey for AFCON, designed by local brand Warrior Pride, ahead of their departure for Morocco on 16 December.\n\nObservers suggest that while the gesture may generate temporary excitement, the move raises serious questions about prioritisation and whether Zimbabwean football is being used for political pageantry rather than meaningful development.\n\nEmmerson Mnangagwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa’s recent donation of US$400,000 to the Zimbabwe Senior Men’s football team, the Warriors, has sparked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/mnangagwa-usd-400-000-donation-to-warriors-blessing-or-curse/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa USD 400 000 Donation To Warriors – Blessing Or Curse ?\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "USA 🇺🇸State of Connecticut Gov officially Proclaims March 29, 2026, “Hon. Sir Wicknel Chivhayo Day,” Claims Mukungunugwa",
            "url": "https://www.zimeye.net/2025/12/09/usa-%f0%9f%87%ba%f0%9f%87%b8state-of-connecticut-gov-officially-proclaims-march-29-2026-hon-sir-wicknel-chivhayo-day-claims-mukungunugwa/",
            "content": "Pro ZANU PF photographer, Cleopas Mukungunugwa has written saying the USA  State of Connecticuts Governor Ned Lamont, is officially proclaiming March 29, 2026, as Hon. Sir Wicknel Chivhayo Day.\n\nHe published this at a time\n\nHe said:\n\nZimbabwean businessman Sir Wicknell Chivhayo is being recognized in the USA  as the State of Connecticut, through Governor Ned Lamont, officially proclaims March 29, 2026, as Hon. Sir Wicknel Chivhayo Day in honour of his HBIU Global Peace Award. This international recognition highlights Zimbabwes growing global presence and positive image, reflecting the nations progress and opportunities under the visionary leadership of President E.D. Mnangagwa.\n\nZimbabwean businessman Sir Wicknell Chivhayo is being recognized in the USA  as the State of Connecticut, through Governor Ned Lamont, officially proclaims March 29, 2026, as Hon. Sir Wicknel Chivhayo Day in honour of his HBIU Global Peace Award. This internationalpic.twitter.com/z3PUZyYZze\n\nIn addition, Heart Bible International University will inaugurate the Hon. Sir Wicknel Chivhayo Scholarship Foundation, empowering talented African students to access world-class education and leadership development.\n\n1. What are the legal implications of such a thing happening to the@NedLamontupon him associating a specified convicted foreign money launderer like@wicknellchivayoa US Day figure, to the Govt,2. and do US citizens really know who Chivayo is in light of the I NC\n\nNDIKUNZWEI FUTY Muchiti HEE HEE Sir Wicknell HAVADIWI KU AMERICA imikaaa Kwatova Ne SIR WICKNELL CHIVHAYO DAY !! Apa Vamwe SISI VACHINGOTI WE NEED NEW LEADERS ON X Zero Relevance PaGround .. umwewo Wake Nekuside achingonyepa Hanzi PANDAKASANGANA NATRUMP IMIKAA @wicknellchivayo @TinotendaGacha1 @MudiwaHood @CrimeWatchZim @advocatemahere @LynneStactia\n\nSir Wicknell CHIBABA CHENYU !!\n\nIwe WOSVORA?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Pro ZANU PF photographer, Cleopas Mukungunugwa has written saying the USA 🇺🇸 State of Connecticut’s Governor Ned Lamont, is officially … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/usa-%f0%9f%87%ba%f0%9f%87%b8state-of-connecticut-gov-officially-proclaims-march-29-2026-hon-sir-wicknel-chivhayo-day-claims-mukungunugwa/\">Continue reading<span class=\"screen-reader-text\"> \"USA 🇺🇸State of Connecticut Gov officially Proclaims March 29, 2026, “Hon. Sir Wicknel Chivhayo Day,” Claims Mukungunugwa\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "Cde Torai Zvombo Declared Provincial Hero",
            "url": "https://www.zimeye.net/2025/12/09/cde-torai-zvombo-declared-provincial-hero/",
            "content": "By A Correspondent  The late former Radio Two head, Timothy Makoni  affectionately known as TZ by his colleagues  has been declared a provincial hero. He will be buried today in Nyazura, Manicaland Province.\n\nMakoni, who died last week on Friday at his farm in Nyazura near Mutare, was not only a respected broadcaster but also a war veteran who operated under the liberation nameCde Torai Zvombo.\n\nHis long-time colleague and close friend, veteran broadcaster John Masuku, paid a heartfelt tribute soon after news of Makonis passing broke. Below is Masukus detailed remembrance, shared on his Facebook page:\n\nIt is with a heavy heart that I share the sad news about the departure of Timothy Makoni (Cde Torayi Zvombo-cum-Cde Syrup), a former ZBC workmate, friend, and neighbour. This comes only a few weeks after reporting about and mourning Temba Bassopo Moyo, a digital news gathering guru and media scholar.\n\nMakoni died this morning in Nyazura, where he went farming after leaving the public broadcaster in 2001. He loved and enjoyed farming. Long before the land reform programme, he always took leave in November to till the land in rural Chendambuya in Manicaland.\n\nHe is the former Head of Radio Two (now Radio Zimbabwe), having previously led Radio Four (now National FM) while also serving as Area Manager for Mbare Studios when I was Controller Radio Services and later Controller at Montrose Studios.\n\nWe both left ZBC in 2001 during the era of massive retrenchments overseen by then Minister of Information Jonathan Moyo, Board Chair Dr Gideon Gono, and CEO Alum Mpofu.\n\nTZ or Syrup, as we affectionately called him, was a former freedom fighter. After sustaining injuries on the front, he was deployed to the ZANU Department of Informations Voice of Zimbabwe to broadcast from Madagascar.\n\nHe joined ZBC at Independence, starting at Radio One (then General/English Service), before moving to Radio Two under the leadership of Victor Mhizha Murira (Cde Victor Mhizha), deputised by Amon Nyamambi uMaqhulayibambe, and later Godwin Mbofana, father to Comfort Mbofana.\n\nMakoni, a devout Catholic educated at St Benedict Mission School, had a pleasant personality and related well with people from all walks of life.\n\nDuring his tenure at Mbare Studios, he worked with and led notable broadcasters such as Ezra Tshisa Sibanda, Eric Knight, Brenda Moyo, Sam Sibanda, Loveness Muchina, Lazarus Tembo, Joseph Panganayi Mukaronda, Nonceba Mnkandla, Simon Pashoma Ncube, Maguire Mike Godzongere, Lisbern Nasasara, Albert Mtimanzi Kashiri, Zenzo Ncube and Aaron Chiundura Moyo, among many others.\n\nI had made a strong promise to visit Timothy at his farm in Nyazura and had finalised plans with another friend and war veteran, Douglas Justice Dhliwayo (Cde Justice Chikukwa), my Executive Producer onEconomic Forumon ZBC-TV and proprietor of Medianet Studio. At Independence, I worked with Justice on the TV News Desk at Pockets Hill as Sub-Editor and Newsreader.\n\nOnly two weeks ago, I spoke with Timothy at length about the excruciating pain he had been experiencing, which kept him bedridden most of the time, though he had begun taking short walks ahead of a major operation. I told him, If my car is not ready for the urgent trip, I will come by public transport. He then gave me directions on where to disembark and walk to his farm.\n\nMy condolences go to Timothy Makonis family and friends, especially his children, who were of similar age and school streams as mine.\n\nHe called me Joe and I called him TZ.\n\nMHDSRIP.\n\nCOURTESY: JM Archives\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The late former Radio Two head, Timothy Makoni — affectionately known as TZ by his colleagues … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/cde-torai-zvombo-declared-provincial-hero/\">Continue reading<span class=\"screen-reader-text\"> \"Cde Torai Zvombo Declared Provincial Hero\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        },
        {
            "title": "Auxillia Mnangagwa’s Christmas Gifts Blitz Fail To Impress Struggling Citizens",
            "url": "https://www.zimeye.net/2025/12/09/auxillia-mnangagwas-christmas-gifts-blitz-fail-to-impress-struggling-citizens/",
            "content": "Tinashe Sambiri First Lady Dr Auxillia Mnangagwa, patron of the Angel of Hope Foundation, on Monday delivered early Christmas gifts to childrens homes, elderly institutions, hospitals, and members of the uniformed forces across the country  a move that has drawn sharp criticism from observers who view it as more spectacle than substance.\n\nAlthough the donations were presented as an act of compassion during the festive season, some critics argue that such gestures fail to address the deepening social and economic hardships facing many Zimbabweans. The First Lady distributed groceries and other basic supplies sourced through Angel of Hope Foundation partners.\n\nDespite the negative reactions, Mrs Mnangagwa said it warms her heart to stand with those in need, insisting that the outreach is driven by compassion and goodwill.\n\nHowever, analysts maintain that charity events of this nature highlight the governments failure to provide adequate social support systems, with some noting that festive-season handouts do little to ease long-term suffering.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– First Lady Dr Auxillia Mnangagwa, patron of the Angel of Hope Foundation, on Monday delivered early Christmas gifts … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/09/auxillia-mnangagwas-christmas-gifts-blitz-fail-to-impress-struggling-citizens/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa’s Christmas Gifts Blitz Fail To Impress Struggling Citizens\"</span></a></p>",
            "time": "21:07",
            "date": "09 Dec 2025"
        }
    ]
}