{
    "news": [
        {
            "title": "Retire Mnangagwa Now, Citizens Tell Zimbabwe’s Military",
            "url": "https://www.zimeye.net/2025/05/21/retire-mnangagwa-now-citizens-tell-zimbabwes-military/",
            "content": "By A Correspondent\n\nA group of concerned Zimbabwean citizens has made a formal appeal to the Zimbabwe Defence Forces, urging them to intervene in what they describe as a national crisis marked by presidential incapacity, widespread corruption, and captured state institutions. The letter, dated 20 May 2025, outlines serious allegations against President Emmerson Mnangagwa and calls for his immediate retirement in the interest of restoring constitutional order and protecting national integrity.\n\nSee letter below:\n\nTo: The Commander Defence Forces of Zimbabwe National ArmyCc: All Service Chiefs, All General and Senior OfficersFrom: The Citizens of ZimbabweDate: 20 May 2025\n\nRE: Request for Intervention on State Capture and Presidential Incapacity\n\nDear Commander Defence Forces,\n\nWe, the citizens of Zimbabwe, have sent Blessed Geza to speak on our behalf, highlighting the urgent need for your intervention in addressing the rampant state capture and corruption perpetrated by President Emmerson Mnangagwa and his associates.\n\nDespite overwhelming evidence, there has been a glaring lack of investigation or accountability, suggesting a culture of impunity. Our constitution, specifically Section 212, empowers the Army to restore order, protect territorial integrity, peace, the rule of law, and democratic institutions.\n\nWe bring to your attention the following pressing concerns:\n\nWe implore you, as the guardians of our nations integrity, to intervene before its too late. We seek your assistance in restoring the rule of law, ensuring accountability, and protecting our democratic institutions.\n\nWe have faith in the Zimbabwe National Armys commitment to upholding the Constitution and defending our nations interests. We urge you to take swift and decisive action to address these critical issues.\n\nPlease note this is just a cover note  a detailed report is attached.\n\nThank you for your attention to this matter.\n\nYours sincerely,The Citizens of Zimbabwe\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A group of concerned Zimbabwean citizens has made a formal appeal to the Zimbabwe Defence Forces, urging … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/retire-mnangagwa-now-citizens-tell-zimbabwes-military/\">Continue reading<span class=\"screen-reader-text\"> \"Retire Mnangagwa Now, Citizens Tell Zimbabwe’s Military\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Fake O-Level Certificates Land Duo in Legal Trouble Over Nursing School Applications",
            "url": "https://www.zimeye.net/2025/05/21/fake-o-level-certificates-land-duo-in-legal-trouble-over-nursing-school-applications/",
            "content": "By A Correspondent\n\nTwo women from Mutare and Harare are facing legal consequences after allegedly forging Ordinary Level certificates to gain entry into nursing training programs at Parirenyatwa and Chitungwiza hospitals.\n\nThe accused are Lisa Chiedza Chivasa (22), from Hobhouse in Mutare, and Tendai Florence Muroiwa from Harare.\n\nMuroiwa has already been convicted and sentenced to one year in prison, wholly suspended on condition of good behavior. She was also ordered to perform 210 hours of community service at Greendale Clinic.\n\nChivasa appeared before the same magistrate and was granted US$50 bail while awaiting trial.\n\nAccording to the state, on May 16, 2025, Chivasa misrepresented her academic qualifications while applying to the Parirenyatwa School of Nursing. She submitted a forged certificate claiming to have passed five O Level subjects, including a C in Combined Science, a C in Agriculture, and an A in Mathematics.\n\nHowever, the state alleges that Chivasa actually received an E in Combined Science, a D in Agriculture, and was ungraded in Mathematics.\n\nThe forgery was uncovered by human resources manager Macdonald Magavu during a routine verification of credentials. He alerted loss control officers, leading to a police report and Chivasas subsequent arrest.\n\nNomsa Kangara appeared for the state in the matter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two women from Mutare and Harare are facing legal consequences after allegedly forging Ordinary Level certificates to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/fake-o-level-certificates-land-duo-in-legal-trouble-over-nursing-school-applications/\">Continue reading<span class=\"screen-reader-text\"> \"Fake O-Level Certificates Land Duo in Legal Trouble Over Nursing School Applications\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Prison Guard Up For Cell-Phone Theft",
            "url": "https://www.zimeye.net/2025/05/21/prison-guard-up-for-cell-phone-theft/",
            "content": "By Crime and Courts Reporter- Police have arrested a prison officer for stealing cellphones from three of his neighbours at Harare Central Prison Camp.\n\nClive Kahiya confessed to the theft and led to the recovery of some of the stolen phones.\n\nHis three neighbours were asleep when he gained entry into their rooms through an unlocked door.\n\nHe stole a Samsung A02 phone, which had US$100 in its porch, from Lovemore Chipinda.\n\nThe phone was tucked under the pillow.\n\nHe stole two cellphones, a Samsung Note 10 and a Samsung Note 25G, from Tawanda Mpofu.\n\nBoth Samsung cellphones were on the charger. Harare provincial police spokesperson Inspector Luckmore Chakanza confirmed the case.\n\nPolice arrested a man for theft. All the stolen cellphones were recovered from the accused person who resides in a separate room to where the complainants stay.\n\nTotal value of cellphones stolen from the trio is US$$890 and US$740 was recovered, said Insp Chakanza.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- Police have arrested a prison officer for stealing cellphones from three of his neighbours at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/prison-guard-up-for-cell-phone-theft/\">Continue reading<span class=\"screen-reader-text\"> \"Prison Guard Up For Cell-Phone Theft\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Top Music Celebrity In Hit-and-Run Drama",
            "url": "https://www.zimeye.net/2025/05/21/top-music-celebrity-in-hit-and-run-drama/",
            "content": "By A Correspondent- One of Zimbabwes most promising musical talents and Afro-fusion sensationAshton Mbeu Nyahora, has landed in hot water aftera warrant of arrest was issued against him, four months after he was involved in aNew Years Day car crashin Harare.\n\nThe Mavanga hitmaker, who was driving a Toyota Aqua at the time of the accident, is accused ofnegligent drivingand failing to take responsibility for damages caused to another motorist,Patikayi Murisa, whose Peugeot 407 was hit at the intersection of Harare Drive and Borrowdale Road.\n\nWhat has shocked many is not just the incident itself, butMbeus conduct in the aftermath, which has left fans and observers questioning his integrity as a public figure.\n\nIt has been five months of hell for me because Mbeu has not been picking up my calls after he caused the accident on January 1, Murisa toldH-Metro.\n\nI didnt know him personally, but as a celebrity, I expected him to cooperate in resolving the matter. Instead, he vanished.\n\nMurisa said efforts to resolve the matter amicably hit a brick wall as Mbeu allegedlyignored calls, refused to communicate, and even referred Murisa to his wife,Faith Mashami who later claimed she was no longer with the musician.\n\nScreenshots of WhatsApp conversations shared with this publication confirm that Mashami eventually told Murisa to reach out to Mbeu directly, stating:\n\nWe are no longer staying together.\n\nMurisa, who had initially hoped to avoid legal action, said he was left withno choice but to approach the police, leading to the issuance of the warrant of arrest.\n\nThey had agreed to fix my car, which is still parked at home. I didnt want it to end this way, but he gave me no option, Murisa added.\n\nIronically, it was onlyafter the warrant was issuedthat Mbeu resurfaced, reportedlypleading for a meeting with Murisa at Highlands Police Station.\n\nContacted for comment, Mbeu admitted the delay but maintained he is now cooperating.\n\nI know the guy, Im meeting him on Thursday. We are actually talking, he said.\n\nIn a now-controversial post on social media, Mbeu reflected on surviving the accident, writing:\n\nOn the 1st of January 2025, just a day before my second borns birthday, I got into a horrible accident and almost lost my life I owe God my life. I will rise again and even stronger! Mbeu ndini!\n\nHowever, critics argue that while he had time to post about the crash online,he failed to do the honourable thing and make amendswith the man whose vehicle and life were upended.\n\nIn a country where celebrities are expected to be role models, Mbeus silence, deflection, and delay raise uncomfortable questions aboutthe social responsibility of public figures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- One of Zimbabwe’s most promising musical talents and Afro-fusion sensation Ashton “Mbeu” Nyahora, has landed in hot water … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/top-music-celebrity-in-hit-and-run-drama/\">Continue reading<span class=\"screen-reader-text\"> \"Top Music Celebrity In Hit-and-Run Drama\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "15,000 Teachers Flee Mnangagwa Government Amid Collapse of Sector",
            "url": "https://www.zimeye.net/2025/05/21/15000-teachers-flee-mnangagwa-government-amid-collapse-of-sector/",
            "content": "By A Correspondent- At least 15,000 teachers have resigned or taken early retirement, fleeing the collapsing education sector under President Emmerson Mnangagwas administration due to poor salaries, deplorable working conditions, and psychological distress, teachers unions have revealed.\n\nProgressive Teachers Union of Zimbabwe (PTUZ) president Takavafira Zhou said the mass exodus reflects a growing crisis that is crippling the countrys education system, particularly in the sciences where critical shortages are now widespread.\n\nYes, we have received such cases, Zhou said. What is most worrisome is thedelay in processing retirement benefitsfor those who formally retire  some even die before accessing their pensions. The sciences  Mathematics, Physics, Chemistry, Biology, Combined Science and ICT  are the most affected.\n\nZhou added that while accurate data is hard to obtain, estimates show that Zimbabwe is losingbetween 15,000 and 20,000 teachers annuallydue to desertions.\n\nThese statistics are computable, he explained. Apart from monthly provincial reports, the Salary Services Bureau provides monthly updates on members whose dues can no longer be deducted after leaving the profession.\n\nZhou accused the government ofdeliberately punishing teachers, saying many have been demoralised by continuous blame and lack of support, despite doing their best under dire conditions.\n\nThere is a general feeling that the government is fixing teachers for a crime best known to the employer. Many are psychologically affected.\n\nHe also slammed the governmentstop-down imposition of curricula reformswith little consultation, planning, or provision of teaching materials.\n\nThere is little room for genuine engagement. The government imposes changes without appropriate educational taxonomy, prudence, interoperability, or standardisation  let alone resources for implementation.\n\nThe exodus of educators marks adeepening crisis in Zimbabwes public sector, with long-term implications for the countrys human capital and development prospects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- At least 15,000 teachers have resigned or taken early retirement, fleeing the collapsing education sector under President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/15000-teachers-flee-mnangagwa-government-amid-collapse-of-sector/\">Continue reading<span class=\"screen-reader-text\"> \"15,000 Teachers Flee Mnangagwa Government Amid Collapse of Sector\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Pharmacy Employee Steals USD 300 000 From Company",
            "url": "https://www.zimeye.net/2025/05/21/pharmacy-employee-steals-usd-300-000-from-company/",
            "content": "BY A Correspondent\n\nA credit controller at Varichem Pharmaceutical Company was on Wednesday arraigned before the court facing charges of theft of trust property after allegedly embezzling US$300,000 from his employer.\n\nMilton Goremusandu, 42, appeared before Harare magistrate Marewanazvo Gofa, who remanded him in custody until Thursday for a bail ruling.\n\nGoremusandu is alleged to have committed the offence in collaboration with his subordinate, Edwell Sibanda, a debtors clerk, who is already on remand.\n\nAccording to court documents, earlier this month the complainant received a tip-off from a whistleblower indicating that Goremusandu and Sibanda were working together to steal funds from the company.\n\nA preliminary internal investigation revealed that between 2021 and May 2025, the accused collected cash from various company clientsTrinity Pharmacy (US$252,930), Vidamac Pharmaceuticals (US$36,350), Asca Health Care (US$33,220), and Care Point Pharmacy Chinhoyi (US$24,829)but failed to bank or submit the received funds, read the court papers.\n\nGoremusandu allegedly instructed Sibanda to process fraudulent journal entries that debited customers who did not owe the company and credited those who had paid, in a bid to conceal the theft.\n\nUsing this method, the accused is said to have prejudiced the company of a total of US$347,329.\n\nThe matter was reported to the police on 12 May 2025, leading to Sibandas arrest at his workplace two days later.\n\nOn 18 May 2025, police searched Goremusandus residence and recovered a grey Toyota Fortuner SUV valued at approximately US$60,000 and a white Toyota Corolla Axio worth around US$10,000. The vehicles, believed to be proceeds of the crime, were found in the possession of his wife, Miranda Rutendo Mativenga.\n\nThe total amount allegedly stolen stands at US$347,329, with two motor vehicles valued at US$70,000 being held as exhibits\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BY A Correspondent A credit controller at Varichem Pharmaceutical Company was on Wednesday arraigned before the court facing charges of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/pharmacy-employee-steals-usd-300-000-from-company/\">Continue reading<span class=\"screen-reader-text\"> \"Pharmacy Employee Steals USD 300 000 From Company\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Warriors Clash with Bafana Bafana in 2025 COSAFA Cup",
            "url": "https://www.zimeye.net/2025/05/21/warriors-clash-with-bafana-bafana-in-2025-cosafa-cup/",
            "content": "Sports Correspondent\n\nThe Zimbabwe national football team has learned its group stage opponents for the upcoming 2025 COSAFA Cup, set to run from June 4 to 15 in Bloemfontein, South Africa.\n\nDrawn into Group A, the Warriors will face off against regional rivals and tournament hosts South Africa, along with Mauritius and Mozambique.\n\nThis years edition features fourteen teams divided into four groups, with only the group winners progressing to the semifinals.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe national football team has learned its group stage opponents for the upcoming 2025 COSAFA Cup, set … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/warriors-clash-with-bafana-bafana-in-2025-cosafa-cup/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Clash with Bafana Bafana in 2025 COSAFA Cup\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Warriors Coaching Duo to Miss COSAFA as ZIFA Seeks Interim Replacement",
            "url": "https://www.zimeye.net/2025/05/21/warriors-coaching-duo-to-miss-cosafa-as-zifa-seeks-interim-replacement/",
            "content": "Tinashe Sambiri/Sports Correspondent\n\nWarriors head coach Michael Nees and his assistant Takesure Chiragwi will not be available to lead the national team at the upcoming COSAFA tournament.\n\nThe duo is set to travel to Morocco with the senior national team, which is scheduled to play two international friendly matches against Niger and Burkina Faso.\n\nWith their absence confirmed, the Zimbabwe Football Association (ZIFA) has begun the search for an interim coach to guide the Warriors during the COSAFA competition.\n\nLast year, the team was led at the tournament by Jairos Tapera, who stepped in on a temporary basis. It remains to be seen whether ZIFA will turn to him again or appoint a new face to take charge of the campaign.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri/Sports Correspondent Warriors head coach Michael Nees and his assistant Takesure Chiragwi will not be available to lead the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/warriors-coaching-duo-to-miss-cosafa-as-zifa-seeks-interim-replacement/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Coaching Duo to Miss COSAFA as ZIFA Seeks Interim Replacement\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Zanu PF Heavyweight Distances Self From Swiftly Constructed Fuel Service Station",
            "url": "https://www.zimeye.net/2025/05/21/zanu-pf-heavyweight-distances-self-from-swiftly-constructed-fuel-service-station/",
            "content": "By A Correspondent\n\nZanu PF MP for Mberengwa Central, Tinashe Shumba, is at the centre of controversy after the rapid construction of a fuel service station near Mucheke River in Masvingo, raising concerns about political influence and regulatory shortcuts.\n\nThe GTS-branded station, believed to stand for Goga Tinashe Shumba  a combination of the MPs nickname and initials  was completed and operational within five weeks.\n\nLocated in the proposed site for Masvingos new Central Business District and smart city, it is currently the only structure in the undeveloped zone.\n\nShumba, who has a background in gold mining and was once a security guard, denied ownership of the station. Im merely a contractor at the site, he told The Masvingo Mirror, distancing himself from direct links to GTS despite evidence from Chronicle identifying him as the proprietor of multiple GTS stations in Mberengwa and Kwekwe.\n\nThe project initially faced resistance from the Environmental Management Agency (EMA), which halted construction in February for non-compliance.\n\nThe new GTS service station was ordered to stop construction work on 11 February 2025 because it did not yet have an EMA certificate of development, said an official at EMA Masvingo.\n\nHowever, the ban was lifted within days, and by May 12, the station was already serving customers.\n\nCritics argue the speed and approval process reflect preferential treatment. If it were any ordinary citizen, theyd still be battling with paperwork. This is what unchecked political power looks like, said a local resident who declined to be named.\n\nShumba is no stranger to controversy. In 2024, the Deputy Judge President, Justice Garainesu Mawadze, issued a court order barring him and Kubatana Mining Syndicate from evicting villagers in Mberengwa in pursuit of gold mining. Villagers accused him of using armed men to intimidate them and boasting that no authority could stop him.\n\nAccording to Chronicle, Shumba rose from humble beginnings to become a symbol of government empowerment, leveraging gold mining ventures to build a growing business empire that now includes fuel retail.\n\nWhether the GTS service station is a mark of entrepreneurial success or a case of political privilege remains a divisive question in Masvingo  but for now, the pumps are running.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF MP for Mberengwa Central, Tinashe Shumba, is at the centre of controversy after the rapid … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/zanu-pf-heavyweight-distances-self-from-swiftly-constructed-fuel-service-station/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Heavyweight Distances Self From Swiftly Constructed Fuel Service Station\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        },
        {
            "title": "Military Stamps Up Request To Retire President Mnangagwa | FULL TEXT",
            "url": "https://www.zimeye.net/2025/05/21/military-stamps-up-request-to-retire-president-mnangagwa-full-text/",
            "content": "FULL TEXT BELOW\n\nHistory was struck today 21st May 2025, when the Zimbabwe Defence Forces stamped up two official requests to retire President Emmerson Mnangagwa on the grounds of incapacitation and other concerns.\n\nThe documents were officially stamped by two arms of the ZDF, the ZNA (army) and the Airforce.\n\nThe development is the first time since war veteran Blessed Geza began press conferences calling for a constitutional and legal resolution to the Zimbabwean crisis.\n\nDetails of the documentation and the original stamped files are availed by the ZimEye news network.\n\nFULL TEXT BELOW\n\n.\n\nCall for Intervention by Citizens to the Zimbabwe National Army on State Capture and Presidential Incapacity\n\nWe, the citizens of Zimbabwe, implore the Zimbabwe National Army to intervene in the pressing issues of state capture and presidential incapacity. The current administration, led by President Emmerson Mnangagwa, has been marred by corruption, nepotism, and regionalism, resulting in widespread suffering and the undermining of the rule of law.\n\nCorruption\n\nPresident Mnangagwa and his close associates have been involved in numerous corrupt activities, including: Corruptly awarding companies formerly owned by the Zimbabwe National Army to Kuda Tagwirei. Awarding state tenders to cartels without following procurement procedures. Involvement in the goat project, involving the transfer of funds to Mnangagwas account in the Mpofu and Chimombe court case. Forcibly seizing mines from their rightful owners and awarding them to Mnangagwas family members and associates. Awarding tenders to cartels that charge unreasonable and exorbitant prices, with 100% funding from the Treasury, yet no work has been done. A case in point is Wicknell Chivhayo, who was awarded the Gwanda Solar Project, but to date, nothing has materialised. Over and above that, Chivhayo received millions of dollars even after a court challenge by ZESA.\n\nFailure to Address Bread and Butter Issues\n\nThe President has failed to address critical issues affecting ordinary Zimbabweans, including: Poor remuneration for civil servants, with salaries below the poverty datum line. High unemployment rates, leading to increased crime and drug abuse among the youth. Essential services have collapsed due to corruption and mismanagement. Vision 2030 should focus on upgrading and building new infrastructure, not merely maintaining existing structures. Hospitals are in a dire and deplorable state. Our roads have become death traps for our loved ones. Poor water reticulation systems are a public health hazard. Everything is now being termed a presidential scheme, raising serious questions about the role of line ministries. Natural resources are being diverted for personal gain rather than being channelled through relevant ministries for the benefit of all Zimbabweans.\n\nPresidential Incapacity\n\nThere are growing concerns about the Presidents health, specifically vascular dementia, which may impair his ability to perform his duties. According to Section 97 of the Constitution, if the President is incapacitated due to a medical condition, Parliament should investigate with a view to his removal from office. Section 97 clearly outlines the grounds for removal: gross misconduct, wilful violation of the Constitution, and physical or mental incapacity. There is clear evidence that President Mnangagwa has violated the Constitution, which warrants his removal from office.\n\nAttempt to Extend Presidential Term Limit\n\nThe 2030 Agenda includes a plan to amend the Constitution to extend the presidential term limit to 2030, in violation of Sections 91(2) and 328(7). This attempt has received mixed reactions, with the majority supporting the 2013 Constitution as it stands. Amending the Constitution requires two separate referendums, a costly process that diverts funds from critical needs such as healthcare. Our road network has become deadly, and water reticulation failures pose serious health risks. We, the citizens, oppose any constitutional amendment designed to benefit Emmerson Mnangagwa and his close associates.\n\nHuman Rights Abuses\n\nThe current regime stands accused of numerous human rights abuses, including: Suppression of Freedom of Speech, Association, and ExpressionThe regime has deployed the police to deter citizens from peacefully demonstrating, despite constitutional guarantees of these freedoms. Arbitrary Arrests and DetentionOn March 31, 109 citizens were arrested and only granted bail after one month. Journalist Blessed Mhlanga was also arrested and spent nearly three months in remand prison before being granted bail. Compromised JudiciaryZimbabwes judiciary has been captured and compromised, eroding public trust and allowing those in power to act with impunity.\n\nNepotism, Regionalism, and Tribalism\n\nThe President has consistently promoted nepotism and regionalism, appointing relatives and extended family to key positions and prioritising personal and regional interests over national well-being.\n\nWe, the citizens of Zimbabwe, urge the Zimbabwe National Army to intervene in these urgent matters to restore the rule of law, accountability, and transparency.\n\nWe have appended our signatures as citizens from all 10 provinces on the attached separate page.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "FULL TEXT BELOW History was struck today 21st May 2025, when the Zimbabwe Defence Forces stamped up two official requests … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/21/military-stamps-up-request-to-retire-president-mnangagwa-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"Military Stamps Up Request To Retire President Mnangagwa | FULL TEXT\"</span></a></p>",
            "time": "06:43",
            "date": "22 May 2025"
        }
    ]
}