{
    "news": [
        {
            "title": "UK-Based Zimbabwean Community Mourns Sudden Death of Lillian Marizana Veli",
            "url": "https://www.zimeye.net/2025/06/30/uk-based-zimbabwean-community-mourns-sudden-death-of-lillian-marizana-veli/",
            "content": "Milton Keynes, UK  Monday, 30 June 2025\n\nBy A Correspondent | ZimEye | The Zimbabwean community in the UK is mourning the sudden passing of Lillian Marizana Veli, a beloved sister, friend, and community figure who was based in the UK. Her death was confirmed on Monday afternoon by family friend Mukoma Gwangu, who took to social media expressing shock and grief over the tragic loss.\n\nIn a heartfelt post, Gwangu wrote:\n\nHi Brothers and Sisters, its really disturbing to receive the SAD news that sister Lillian Marizana Veli2nd from right with the golden belthas passed on.\n\nHe shared a photo of Lillian taken during his 60th birthday celebration in Milton Keynes in January 2024, where she was pictured smiling alongside her sisters. She came and chatted me together with her sisters that day, he reflected, paying tribute to what would become one of her last public gatherings.\n\nLillian was remembered by friends and fellow Zimbabweans for her warm presence, charm, and graceful spirit. Condolence messages have since flooded social media:\n\nOther mourners including Agnes Makatendeka, Carol WaShe, and Magolide Tshuma also paid tribute, with many describing her death as a heartbreaking loss and calling her an angel heaven has gained.\n\nThe cause of her death has not yet been disclosed.\n\nLillians passing has sent ripples across the diaspora, particularly within the Milton Keynes Zimbabwean network, where she was a familiar and cherished face.\n\nFuneral arrangements and memorial service details are expected to be announced by the Marizana family in due course.\n\nMay her soul rest in eternal peace. \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Milton Keynes, UK – Monday, 30 June 2025 By A Correspondent | ZimEye | The Zimbabwean community in the UK … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/uk-based-zimbabwean-community-mourns-sudden-death-of-lillian-marizana-veli/\">Continue reading<span class=\"screen-reader-text\"> \"UK-Based Zimbabwean Community Mourns Sudden Death of Lillian Marizana Veli\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Where Should Edgar Lungu Be Buried? The Battle Between State Power and Family Wishes",
            "url": "https://www.zimeye.net/2025/06/30/where-should-edgar-lungu-be-buried-the-battle-between-state-power-and-family-wishes/",
            "content": "By Brilliant Pongo | Former Zambian President Edgar Lungu lies in death as he did in life  at the centre of political division, and constitutional debate. His passing in South Africa has become more than a family tragedy; it has become a national spectacle and a test of Zambias soul.\n\nReports reveal a stark reality: the Zambian government has taken the Lungu family to court to prevent them from burying him in South Africa, insisting he be buried in Zambia with state honours. The familys wishes and the states demands stand in direct opposition.\n\nThis raises a profound question: Who owns a former President in death  the family or the nation?\n\nThe Meaning of a State Funeral.\n\nA state funeral is more than a ceremonial farewell. It is a powerful political and cultural ritual where a nation reclaims the deceased as its own. The draped flag, the gun salutes, the military pallbearers, and the national mourning period  all these are symbols that transcend personal grief. They are public statements that this life, this legacy, belonged to the people.\n\nBut herein lies the disagreement. A person does not cease to be a father, husband, or brother simply because they held the highest office. Their body becomes a contested site between state honour and family dignity.\n\nZambias Constitutional Stance.\n\nZambias constitution and national protocols empower the government to accord former Presidents state funerals. The underlying logic is simple: the office they held was not personal; it was national. Their burial becomes a symbolic reaffirmation of state continuity and national identity.\n\nYet the same constitution does not strip families of their cultural rights. There is no explicit clause to forcibly override family wishes. Burial, in African tradition, remains a sacred family matter, even if that family is the nation.\n\nWhy Does the Family Want South Africa?\n\nThe Lungu familys preference to bury him in South Africa remains only partly explained. Perhaps it is practical, perhaps emotional, or perhaps it is a silent protest against a state they feel did not respect him in life. What is clear is that this preference has unleashed deeper political currents between President Hakainde Hichilemas administration and Lungus supporters.\n\nThe African Mirror  Mugabe and Smith\n\nThis dispute is not new in southern Africa. We witnessed it with Ian Smith, Rhodesias former Prime Minister. Smith died in South Africa in 2007. There was no state funeral. His ashes were quietly scattered on his family farm in Zimbabwe. The Zimbabwean state under Robert Mugabe chose to let his passing slip by with no national recognition.\n\nIronically, when Robert Mugabe himself died in 2019, the tables turned. His family refused to let the state bury him at the National Heroes Acre in Harare. They feared his legacy would be manipulated in death as it was in life. After bitter public wrangling, the family prevailed, and Mugabe was buried in his rural village of Kutama, despite intense government pressure.\n\nBoth cases show one truth: burial is political.\n\nWhy This Matters.\n\nThe question is not merely about Edgar Lungus resting place. It is about power, ownership, dignity, and memory. If the state insists on burial in Zambia against the familys will, it reasserts its authority but risks trampling family traditions. If the family prevails, it may embolden future families to disregard national symbolism.\n\nUltimately, in Africa, burial is the final act of storytelling. Where a man is buried, and how, defines how he is remembered. Will Lungu be remembered as a national leader accorded the final salute, or as a father whose familys wishes were honoured against all odds?\n\nIn the end, perhaps both the state and the family must recognise that death demands humility. It is not a platform for settling political scores. It is the final stage where a human being must be allowed to rest  with dignity, honour, and peace.\n\nThat is what Edgar Lungu deserves.\n\nBrilliant Pongo is a journalist, poet, and social commentator based in the United Kingdom.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Brilliant Pongo | Former Zambian President Edgar Lungu lies in death as he did in life – at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/where-should-edgar-lungu-be-buried-the-battle-between-state-power-and-family-wishes/\">Continue reading<span class=\"screen-reader-text\"> \"Where Should Edgar Lungu Be Buried? The Battle Between State Power and Family Wishes\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Terrence Dzvukamanja Poised for Move to Scotland",
            "url": "https://www.zimeye.net/2025/06/30/terrence-dzvukamanja-poised-for-move-to-scotland/",
            "content": "Warriors striker Terrence Dzvukamanja is set to complete a move to Scotland in the upcoming transfer window, which opens tomorrow. Barring any last-minute changes, the forward will be joining a Scottish club as he looks to take the next step in his career.\n\nDzvukamanja is a talented and versatile forward known for his intelligent movement, sharp finishing, and ability to operate both as a central striker and in deeper attacking roles. He has been a consistent performer for both club and country, earning praise for his work rate and tactical awareness. His potential move to Scotland is seen as an exciting opportunity to showcase his skills on a new stage and further develop as a player.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Warriors striker Terrence Dzvukamanja is set to complete a move to Scotland in the upcoming transfer window, which opens tomorrow. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/terrence-dzvukamanja-poised-for-move-to-scotland/\">Continue reading<span class=\"screen-reader-text\"> \"Terrence Dzvukamanja Poised for Move to Scotland\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Lungu, Mnangagwa Stuck Splashing Chivayo Loot for 10 Years, HH Steps In To Construct First Gwanda-Style 100 Mega Watt Solar Plant In Under One Year",
            "url": "https://www.zimeye.net/2025/06/30/lungu-mnangagwa-stuck-splashing-chivayo-loot-for-10-years-hh-steps-in-to-construct-first-gwanda-style-100-mega-watt-solar-plant-in-under-one-year/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "ZIFA Pays Tribute To Brian Banda",
            "url": "https://www.zimeye.net/2025/06/30/zifa-pays-tribute-to-brian-banda/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has expressed deep sorrow following the untimely passing of FC Platinum captain Brian Banda, who tragically lost his life due to injuries sustained in a car accident on Sunday.\n\nIn an official statement released Monday, ZIFA extended heartfelt condolences to Bandas family, his club, teammates, and the wider football fraternity. The association described Banda as a true ambassador of the game whose commitment, leadership, and passion left a lasting impact both on and off the pitch.\n\nBrian Banda was more than just a footballer  he was a symbol of resilience, discipline, and sportsmanship. His presence will be sorely missed in the local football scene, the statement read.\n\nBanda, who had earned respect across the Premier Soccer League for his commanding presence in midfield and his calm leadership style, had been instrumental in FC Platinums recent domestic success. His tragic death has cast a shadow over the football community, with tributes pouring in from fans, clubs, and fellow players across the country.\n\nZIFA confirmed it is working closely with FC Platinum to support funeral arrangements and provide all necessary assistance to the Banda family during this difficult time.\n\nAs the nation mourns, plans are underway to hold a moment of silence in upcoming matches as a mark of respect for Bandas contribution to Zimbabwean football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has expressed deep sorrow following the untimely passing of FC Platinum captain Brian … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/zifa-pays-tribute-to-brian-banda/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Pays Tribute To Brian Banda\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "How to Handle Birth Complications in Animals: A Guide to Dystocia Management",
            "url": "https://www.zimeye.net/2025/06/30/how-to-handle-birth-complications-in-animals-a-guide-to-dystocia-management/",
            "content": "By Dr. Trywell Muzerengi\n\nDefinition:Dystocia refers to difficult or abnormal labor, where an animal is unable to give birth naturally without human assistance. This condition is commonly observed in domestic animals such as cows, goats, and sheep.\n\nCommon Causes of Dystocia:\n\nSigns of Dystocia:\n\nProlonged straining without progress\n\nVisible fetal parts with no advancement\n\nRepeated restlessness, lying down, and getting up\n\nNo delivery after 23 hours of active labor\n\nFirst Aid / On-Farm Management:\n\nPrevention Tips:\n\nProvide balanced and adequate nutrition during pregnancy\n\nUse appropriate breeding stock to reduce the risk of oversized fetuses\n\nClosely monitor animals as they approach parturition\n\nBe ready to assist at the first sign of complications\n\nProper understanding and timely management of dystocia can save both the mother and offspring. Always seek veterinary support when in doubt to ensure the best outcome.\n\n[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Definition:Dystocia refers to difficult or abnormal labor, where an animal is unable to give birth naturally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/how-to-handle-birth-complications-in-animals-a-guide-to-dystocia-management/\">Continue reading<span class=\"screen-reader-text\"> \"How to Handle Birth Complications in Animals: A Guide to Dystocia Management\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Zimbabwe’s Inflation Rises As ZiG Falls",
            "url": "https://www.zimeye.net/2025/06/30/zimbabwes-inflation-rises-as-zig-falls/",
            "content": "By A Correspondent\n\nZimbabwes annual inflation, measured in Zimbabwe Gold (ZiG), rose to 92.5% in June 2025, according to new data from the Zimbabwe National Statistics Agency (Zimstat) released Friday. The figure marks a slight increase from 92.1% in May and 85.7% in April, underlining the countrys ongoing economic turmoil and persistent cost-of-living pressures.\n\nWhile annual inflation remains alarmingly high, month-on-month inflation eased to 0.3% in June, down from 0.9% in May, offering a modest sign of short-term price stability.\n\nZimstat attributed the rise in annual inflation to surging costs in rentals, water, fuel, and communication services  basic necessities that continue to stretch household incomes amid Zimbabwes worsening economic climate.\n\nThe ZWG month-on-month inflation rate was 0.3% in June 2025, shedding 0.6 percentage points on the May 2025 rate of 0.9%, Zimstat said.The ZWG year-on-year inflation rate (annual percentage change) for the month of June 2025, as measured by the all-items ZWG Consumer Price Index (CPI), was 92.5%.\n\nPrices denominated in U.S. dollars also showed signs of strain, with annual USD inflation ticking up to 14% in June, up from 13.9% in May. However, month-on-month USD inflation remained in negative territory at -0.2%, compared to -0.3% the previous month  a marginal improvement.\n\nZimstat noted that food and non-alcoholic beverages were the key drivers behind the modest USD price increases.\n\nThe data also highlighted the rising cost of basic survival in Zimbabwe. In June, the Food Poverty Line (FPL) for one person stood at ZiG 874.23, while the Total Consumption Poverty Line (TCPL) was ZiG 1,280.05  a sobering reflection of deepening economic strain for the average citizen.\n\nDespite these figures, the Reserve Bank of Zimbabwe (RBZ) has called on the public to remain calm, urging them to disregard the sharp annual ZiG inflation rates, arguing that they do not accurately reflect real-time price dynamics in the market.\n\nLooking ahead, the RBZ projects that ZiG inflation will stay elevated until September, after which it expects a gradual decline, potentially reaching 30% by year-end.\n\nThe rising inflation and falling currency come at a time when many Zimbabweans are struggling to make ends meet, with salaries lagging far behind rising prices  yet another reminder of the fragile economic conditions gripping the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s annual inflation, measured in Zimbabwe Gold (ZiG), rose to 92.5% in June 2025, according to new … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/zimbabwes-inflation-rises-as-zig-falls/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe’s Inflation Rises As ZiG Falls\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Wife Catches S*x-Starved Sabhuku Raping Donkey…",
            "url": "https://www.zimeye.net/2025/06/30/wife-catches-sx-starved-sabhuku-raping-donkey/",
            "content": "By A Correspondent\n\nA shocking case of bestiality has rocked a Masvingo village, where a 71-year-old sabhuku, Martin Gaviro, was convicted after being caught by his wife having sexual intercourse with a donkey  not once, but twice.\n\nGaviro, from Gaviro Village under Chief Shumba, appeared before Magistrate Elizabeth Hanzi, who sentenced him to 12 months in prison.\n\nHowever, the sentence was wholly suspended for five years on the condition that he does not commit a similar offence within that period.\n\nThe incidents occurred on May 2 and May 12, 2025, at his rural homestead. According to the court, Gaviros wife, Dzivaidzo Gaviro, walked in on him engaging in the act on both occasions and later became a key witness during the trial.\n\nIn his defense, Gaviro shockingly claimed he turned to the donkey because his wife was allegedly refusing him conjugal rights  a justification the court dismissed as unacceptable and criminal.\n\nProsecutor Precious Takuva, representing the National Prosecuting Authority (NPA), explained how the events unfolded: on May 2, Dzivaidzo had stepped outside around 3 AM and noticed her husband was missing. Upon searching for him, she found him in the kraal, sexually abusing the animal. She initially chose to forgive him and didnt report the matter.\n\nBut the situation escalated on May 12, when she again caught Gaviro completely naked and once again engaging with a donkey at around 4:45 AM. This time, he reportedly fled the scene unclothed, prompting Dzivaidzo to take action.\n\nShe reported the disturbing matter to Chief Shumba, who then advised her to notify the police  leading to Gaviros arrest and subsequent conviction.\n\nThe case has sparked outrage in the community, with many calling for stiffer penalties for such disturbing offences, especially from those in positions of traditional authority.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking case of bestiality has rocked a Masvingo village, where a 71-year-old sabhuku, Martin Gaviro, was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/wife-catches-sx-starved-sabhuku-raping-donkey/\">Continue reading<span class=\"screen-reader-text\"> \"Wife Catches S*x-Starved Sabhuku Raping Donkey…\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Daniel Garwe In The Spotlight As Political Vultures Seize Seke Farms",
            "url": "https://www.zimeye.net/2025/06/30/daniel-garwe-in-the-spotlight-as-political-vultures-seize-seke-farms/",
            "content": "By A Correspondent| In what is being described as a brazen act of corruption and political manipulation, several farms earmarked for development by the Manyame Rural District Council (MRDC) have reportedly been seized and parceled out to politically connected elites under opaque and controversial circumstances.\n\nThe affected farmsDinnotar, Kimcote, Gilstone, Tantalon, and Edinburghfall under the jurisdiction of MRDC. However, the local authority has effectively been stripped of any development land, throwing future planning efforts into disarray.\n\nAccording to sources, Edinburgh Farm was allegedly allocated to Pinnacle Holdings, owned by businessman and ZANU PF politician Phillip Chiyangwa; Dinnotar was reportedly handed to Godwills Masimirembwa; while Gilstone was offered to CFI Holdings. Most alarming, insiders say, is the fate of Gilstone Farm, which had previously been offered to MRDC for a housing scheme under the Gilstone Rural Service Centre initiative. The project was designed to address the acute housing shortage in Seke District and reduce the burden on residents who travel long distances to Beatrice.\n\nDocuments seen by this publication reveal that the late Mashonaland East Provincial Affairs Minister, Dr. Joel Biggie Matiza, had formally recommended the farm for council development. Detailed plans were drawn up, roads were graded, and a tuck survey was conducted. MRDC had also pledged to offer affordable housing, particularly targeting youths in the province.\n\nHowever, the project was abruptly reversed by then Minister of Lands, Douglas Mombeshora. In a letter dated 7 October 2016, he informed the then incoming Minister of Provincial Affairs, Retired Brigadier General Ambrose Mutinhiri, that the land was earmarked for agricultural use and instructed the council to find an alternative site for residential development.\n\nOn the same day, then Minister of Rural Development, Abednico Ncube, wrote to Mombeshora requesting that part of Gilstone and Kimcote be allocated to the council for residential stands. The request was denied. A similar appeal from acting Provincial Administrator Mr. Kutamahufa, dated 21 September 2016, also went unanswered.\n\nIronically, part of the land was later taken over by the Lands Housing Trustan entity allegedly linked to Mombeshora himselfand a private housing scheme was established near the Skyline Tollgate. This publication is in possession of multiple letters from MRDC protesting the takeover and pleading for intervention, all to no avail.\n\nFast-forward to 2025, and the same land has reportedly been subdivided and distributed among well-connected individuals, leaving MRDC landless and unable to meet the growing demand for residential stands. In desperation, local residents have resorted to Sabhuku dealsinformal agreements with village headsto secure land for shelter.\n\nAt the centre of the controversy is current Minister of Local Government and ZANU PF Mashonaland East Provincial Chairperson, Dr. Daniel Garwe, who is alleged to be presiding over the current wave of land grabs. Several political figures, speaking on condition of anonymity, accused Garwe of sidelining Seke and obstructing MRDCs development plans.\n\nSources indicate that desperate stakeholders are now lobbying for direct intervention from President Emmerson Mnangagwa to resolve the impasse.\n\nDocuments in our possession show that MRDC has been pursuing the Gilstone development project since 1997 and had already committed over US$1.7 million toward its implementation. The project was expected to yield at least 10,000 housing units.\n\nSeke has become a hotspot for illegal land sales and invasions, further complicating the already volatile land situation.\n\nWhen contacted for comment, MRDC Chairman Ian Manyere expressed cautious optimism that Minister Garwe would ultimately support the councils bid to secure land for development. District Planner Mr. Cosmas Murepa is reportedly making ongoing efforts to engage the ministry on the matter.\n\nMeanwhile, the council is also grappling with multiple legal disputes stemming from land allocations it made at Gilstone before losing control of the property.\n\nMRDC Chief Executive Officer, Dr. Farirai Guta, had not responded to questions by the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| In what is being described as a brazen act of corruption and political manipulation, several farms earmarked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/daniel-garwe-in-the-spotlight-as-political-vultures-seize-seke-farms/\">Continue reading<span class=\"screen-reader-text\"> \"Daniel Garwe In The Spotlight As Political Vultures Seize Seke Farms\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        },
        {
            "title": "Mutsvangwa Fumes Over Own Ally’s Humiliating Defeat In Zanu PF Manicaland Women’s League Election",
            "url": "https://www.zimeye.net/2025/06/30/mutsvangwa-fumes-over-own-allys-humiliating-defeat-in-zanu-pf-manicaland-womens-league-election/",
            "content": "By A Correspondent\n\nZANU PF spokesperson Christopher Mutsvangwa is reportedly furious after his preferred candidate, Mercy Sacco, suffered a humiliating defeat in the Manicaland Womens League election.\n\nThe outcome is being interpreted as a significant political blow to Mutsvangwas influence in the province.\n\nThe re-run election, held in Mutare on Sunday, saw Dorothy Mabika triumph over Sacco with 23 votes to 16, in a contest supervised by ZANU PF National Political Commissar Munyaradzi Machacha. The rerun had been ordered by the partys commissariat following the nullification of the initial April poll due to procedural irregularities.\n\nA source close to the developments revealed:\n\nShefu (Mutsvangwa) is not happy. He wants to reverse the results of the election. He will take the matter to the President.\n\nDespite the tension behind the scenes, Machacha maintained that the process had gone according to plan:\n\nWe were instructed to come and redo the election for the chairwoman. We have just concluded that task with Mabika emerging as the winner, he said.Our results are going to be presented to the Politburo for endorsement. But so far, everything has gone smoothly, and we hope from now going forward, Manicaland and the league will be united.\n\nHe acknowledged the support both candidates commanded:\n\nThe figures were 23 for Mabika and 16 for Sacco, both women demonstrating that they have got a following in the executive and deserve respect. Both ladies should now work together to unite the people as Chairwoman and Vice Chairperson.\n\nIn her acceptance speech, Dorothy Mabika thanked her supporters and called for unity within the party:\n\nI want to thank the women who remained resolute in supporting my candidature. I want to thank them for their confidence in me, and I am now praying for unity, she said.I will work with everyone for the party and the country to achieve Vision 2030. Im humbled by the confidence shown by the women of Manicaland. Now its time to unite, rebuild, and work for the party and the nation.\n\nAlthough the official results still await Politburo endorsement, the outcome has sparked internal friction, particularly given Mutsvangwas high-profile backing of Sacco. With political temperatures rising, attention now turns to how the ruling party will manage fractures and alliances in Manicaland amid growing tensions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF spokesperson Christopher Mutsvangwa is reportedly furious after his preferred candidate, Mercy Sacco, suffered a humiliating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/30/mutsvangwa-fumes-over-own-allys-humiliating-defeat-in-zanu-pf-manicaland-womens-league-election/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Fumes Over Own Ally’s Humiliating Defeat In Zanu PF Manicaland Women’s League Election\"</span></a></p>",
            "time": "18:47",
            "date": "01 Jul 2025"
        }
    ]
}