{
    "news": [
        {
            "title": "Caps United’s Bunjira Involved In Fatal Accident, Recovering",
            "url": "https://www.zimeye.net/2025/08/16/caps-uniteds-bunjira-involved-in-fatal-accident-recovering/",
            "content": "By Sports Reporter | Rusape, Zimbabwe  16 August 2025 | CAPS United Marketing Manager and former Warriors star, Alois Bunjira, was rushed to Rusape General Hospital this morning after being involved in a fatal road traffic accident along the RusapeNyanga Road.\n\nThe accident occurred at around 10:00am, near St. Faiths High School, approximately 8km from Rusape town. According to police, the crash happened when an Isuzu pickup truck with three passengers on board attempted to overtake a bus and collided head-on with Bunjiras BMW vehicle.\n\nTwo passengers from the Isuzu died instantly, while three other people were injured and taken to Rusape General Hospital, where they are receiving treatment.\n\nBunjira, who was travelling with one passenger, sustained injuries but survived the impact. He was on his way to his rural home in Honde Valley to oversee route certification for the Honde Valley Marathon, an event he is working to upgrade into a qualifier for the prestigious Comrades Marathon in South Africa.\n\nThe Zimbabwe Republic Police (ZRP) confirmed the accident in a statement, noting that the bodies of the deceased were transferred to the Rusape General Hospital mortuary for post-mortem.\n\nThis tragedy has sent shockwaves across the football fraternity and athletics community, with fans expressing relief at Bunjiras survival but mourning the loss of lives in the crash.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter | Rusape, Zimbabwe – 16 August 2025 | CAPS United Marketing Manager and former Warriors star, Alois … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/caps-uniteds-bunjira-involved-in-fatal-accident-recovering/\">Continue reading<span class=\"screen-reader-text\"> \"Caps United’s Bunjira Involved In Fatal Accident, Recovering\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "Kwekwe United Keen To Punish Ailing DeMbare",
            "url": "https://www.zimeye.net/2025/08/16/kwekwe-united-keen-to-punish-ailing-dembare/",
            "content": "Sports Correspondent\n\nKwekwe United FC are preparing to face fellow strugglers Dynamos FC in what promises to be a tense Castle Lager Premier Soccer League clash on Sunday. Both sides have endured difficult seasons, and the upcoming encounter offers a chance to halt their respective slumps.\n\nWe have since shifted our focus to MD25, Kwekwe United said, emphasizing their determination to grab points despite recent challenges.\n\nThe match will take place at Ascot Stadium, kicking off at 15:00 hours, with tickets priced at $3.\n\nFans are bracing for a hard-fought contest as both sides seek to climb out of the bottom half of the league standings, with pride and crucial points on the line.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kwekwe United FC are preparing to face fellow strugglers Dynamos FC in what promises to be a tense … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/kwekwe-united-keen-to-punish-ailing-dembare/\">Continue reading<span class=\"screen-reader-text\"> \"Kwekwe United Keen To Punish Ailing DeMbare\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "List Of Foiled Zim Coup Plotters",
            "url": "https://www.zimeye.net/2025/08/16/list-of-foiled-zim-coup-plotters/",
            "content": "By Crime & Courts Reporter  Assistant Inspector Simbarashe Mandizvidzas dramatic arrest has once again thrust Zimbabwes long-running saga of alleged coup plots into the spotlight, fuelling speculation over how the State uses such cases to tighten control over the security sector.\n\nMandizvidza, 35, who served at the Police General Headquarters Salaries Services Bureau Liaison Office, was remanded in custody after prosecutors accused him of declaring himself commander of the Zimbabwe Republic Police (ZRP) in a YouTube broadcast. In hisGondo Harishayevideos, he ordered Chinese nationals to leave the country within 48 hours and announced the disbandment of the Traffic Section  pronouncements the State insists were false and destabilising.\n\nHe is further accused of fraudulently seizing a police Ford Ranger by deceiving a senior officer, before posting a second video claiming control of the ZRP and invoking Commissioner-General Stephen Mutambas name. Authorities argue this was a deliberate bid to sow confusion and disaffection within the police ranks.\n\nThe ZRP has publicly branded him a rogue policeman, while the State has opposed bail, warning that he might tamper with video evidence. Yet, critics note that Zimbabwe has a long tradition of securitising dissent, with coup allegations often surfacing at moments of political fragility.\n\nA Political Weapon: Coup Allegations Through the Years\n\nMandizvidzas case adds him to a controversial list of at least 27 others accused of plotting coups in the past two decades  cases that rarely result in convictions but often succeed in sidelining those perceived as threats:\n\nFrom Mugabes rule to Mnangagwas presidency, coup narratives have become a powerful tool: casting the ruling elite as perpetual targets of shadowy plots while disciplining ambitious figures within the army and police.\n\nMandizvidzas arrest  the first of a serving police officer openly proclaiming himself ZRP commander on video  may be theatrically unique, but politically it follows a well-worn script: a heavy-handed prosecution, prolonged detention, and the silencing of another voice deemed threatening to the ruling establishment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime & Courts Reporter — Assistant Inspector Simbarashe Mandizvidza’s dramatic arrest has once again thrust Zimbabwe’s long-running saga of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/list-of-foiled-zim-coup-plotters/\">Continue reading<span class=\"screen-reader-text\"> \"List Of Foiled Zim Coup Plotters\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "Shock As Man Kills Mentally Challenged Neighbour",
            "url": "https://www.zimeye.net/2025/08/16/shock-as-man-kills-mentally-challenged-neighbour/",
            "content": "By A Correspondent\n\nResidents of Murehwa were left horrified after a mentally challenged man was allegedly murdered in a brutal attack late on August 12, 2025. Police have since arrested a suspect in connection with the incident.\n\nKudakwashe Dzimauta was taken into custody following the death of Godfrey Baye, who was discovered by his brother, Simbarashe Baye (33), lying in a pool of blood with multiple severe injuries. Baye, reportedly struggling with mental challenges, was allegedly intoxicated at the time of the attack.\n\nAccording to reports, the deceased and Dzimauta were returning home from Taloo Business Centre along with a third individual, Innocent Pangura. Pangura reportedly arrived home first, while Baye continued toward his residence, where the fatal incident is believed to have occurred around 11 pm under Chief Mangwendes jurisdiction.\n\nProvincial police spokesperson for Mashonaland East, Inspector Simon Chazovachiyi, confirmed the investigation, saying: Our officers from Musami and the Criminal Investigations Department attended the scene. They found the body with a broken right arm and three deep cuts on the forehead. The deceaseds neck was tied with a shirt, suggesting he had been dragged from the site of the attack.\n\nInspector Chazovachiyi added: Following investigations, we traced and arrested the suspect. A knife and shoes with blood stains were recovered. The body has been taken to Murewa District Hospital mortuary and is awaiting postmortem. The suspect is assisting police with further inquiries.\n\nThe gruesome killing has sent shockwaves through the community, highlighting ongoing concerns over violence and safety in the district.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Residents of Murehwa were left horrified after a mentally challenged man was allegedly murdered in a brutal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/shock-as-man-kills-mentally-challenged-neighbour/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Man Kills Mentally Challenged Neighbour\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "Cash Windfall For Cross Border Traders 4ED As Zanu PF Seeks To Buy Votes Ahead Of By-election…",
            "url": "https://www.zimeye.net/2025/08/16/cash-windfall-for-cross-border-traders-4ed-as-zanu-pf-seeks-to-buy-votes-ahead-of-by-election/",
            "content": "By A Correspondent\n\nAs the Masvingo Urban Ward 7 by-election approaches on September 13, Zanu PF has come under scrutiny for distributing cash grants to local traders, with critics warning that the timing appears politically motivated.\n\nOn Thursday, members of the Crossborder Traders for ED-Masvingo Chapter received funds through the Presidential Empowerment Scheme.\n\nMasvingo Provincial Affairs and Devolution Minister Ezra Chadzamira praised President Mnangagwa during the handover, describing him as a God-anointed leader committed to mass empowerment.\n\nChadzamira said: Our President, Dr Cde ED Mnangagwa, was anointed by God to lead this country. He has been driving development initiatives that align with Vision 2030 and empower ordinary Zimbabweans.\n\nThe 26 members of the Crossborder Traders for ED-Masvingo Chapter received cash grants totaling US$20,000, with individual amounts ranging from US$200 to US$500. The funding was facilitated by the Presidential Investment Advisor to the United Arab Emirates, Dr Paul Tungwarara.\n\nChadzamira urged the recipients to use the money wisely: I expect you to grow your businesses and create wealth for your families, ensuring this support leads to tangible development in our communities.\n\nCrossborders for ED national chairperson David Masore also paid tribute to the Presidents policies, saying: President Mnangagwa has consistently walked the talk with his mantra of leaving no one and no place behind. His policies aim to improve the welfare of ordinary Zimbabweans.\n\nMasore additionally thanked Dr Tungwarara for advising the President on expanding funding to empower citizens and commended Minister Chadzamira for providing affordable residential stands to members in Masvingo province.\n\nThe beneficiaries came from all seven administrative districts of Masvingo province and received their cash amid an event marked by pomp and ceremony. Political analysts, however, have cautioned that such handouts risk being perceived as a strategy to influence voter sentiment ahead of the September 13 by-election.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As the Masvingo Urban Ward 7 by-election approaches on September 13, Zanu PF has come under scrutiny … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/cash-windfall-for-cross-border-traders-4ed-as-zanu-pf-seeks-to-buy-votes-ahead-of-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Cash Windfall For Cross Border Traders 4ED As Zanu PF Seeks To Buy Votes Ahead Of By-election…\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "Govt Officials Who Lied About Progress Muzuva, the Injured Nurse, Must Resign",
            "url": "https://www.zimeye.net/2025/08/16/govt-officials-who-lied-about-progress-muzuva-the-injured-nurse-must-resign/",
            "content": "By Engineer Jacob Kudzayi Mutisi |  The lies told by government officials over the plight of injured rural nurse, Progress Muzuva have been brutally exposed and those responsible must resign immediately if the government is to clear its name and restore public confidence.\n\nMuzuva, a dedicated nurse from rural Masvingo, sustained life-threatening injuries in 2018 while saving both a newborn baby and her mother during a violent ambulance transfer. In the process of delivering the baby and ensuring the survival of both mother and child, she suffered spinal and leg fractures that have left her battling ill health for years. Hers is a story that should have inspired national gratitude and support. Instead, it has become a symbol of betrayal and dishonesty.\n\nOn 8 August 2025, the Ministry of Health issued a press statement claiming that Muzuva had been fully supported by government since her injury. The statement insisted she was receiving free treatment, had all her medical expenses covered, and continued to benefit from state support.\n\nWithin hours, however, Muzuva produced receipts and medical records that painted a very different picture. Only a day before the Ministrys announcement, she had paid for her own X-rays and consultation fees at Masvingo General Hospital. Other records stretching back years showed repeated out-of-pocket payments for treatment and medication. Her evidence demolished the governments narrative and exposed the statement as a deliberate attempt to mislead the nation.\n\nLocal journalists, following up on the case, confirmed her story. They retraced her medical journey, interviewed family and community members, and even met the now eight-year-old child she delivered in the ambulance that night. Their findings revealed a tale of courage and sacrifice betrayed by official deceit. Rather than honouring a frontline health worker who risked everything to save lives, the Ministry attempted to mask its years of neglect with a fabricated account of benevolence.\n\nThis was not a simple miscommunication. It was a calculated lie, crafted and released by officials who knew the truth but chose to deceive. The damage done goes beyond Muzuva herself. By portraying her as fully supported, the Ministry effectively discouraged well-wishers, NGOs and members of the public who might have come to her aid. They believed, wrongly, that she was already being looked after. In other words, the lie not only smeared the governments credibility but also deprived Muzuva of potential assistance.\n\nSuch dishonesty cannot be swept under the carpet. The officials involved in drafting, approving and releasing that false statement have betrayed the trust of the people of Zimbabwe. They have insulted the sacrifice of one of their own frontline workers, a hero, a woman whose bravery deserves national recognition, not abandonment.\n\nThe only way forward is accountability. Those responsible must resign immediately. Anything less would amount to condoning deceit and setting a dangerous precedent where government officials can lie with impunity. A government that fails to protect its heroes and then lies to its citizens has lost its moral compass.\n\nThe Zimbabwean public has endured many hardships, but it has always looked to its leaders for honesty. In this case, the Ministry of Health failed spectacularly. The resignation of those involved is not just about punishing wrongdoing, it is about sending a clear message that Zimbabwe is a nation that values truth, integrity and justice.\n\nProgress Muzuva deserves better. Zimbabwe deserves better. The officials who lied must go.\n\nEngineer Jacob Kudzayi Mutisi\n\n+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi | The lies told by government officials over the plight of injured rural nurse, Progress … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/govt-officials-who-lied-about-progress-muzuva-the-injured-nurse-must-resign/\">Continue reading<span class=\"screen-reader-text\"> \"Govt Officials Who Lied About Progress Muzuva, the Injured Nurse, Must Resign\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "Zanu PF Wins Makoni Ward 8 Seat As Independent Candidate Pulls Out Of Race",
            "url": "https://www.zimeye.net/2025/08/16/zanu-pf-wins-makoni-ward-8-seat-as-independent-candidate-pulls-out-of-race/",
            "content": "By A Correspondent\n\nZANU PF has further tightened its hold on Makonde District after Bothwell Madhishi won the Rural Ward 8 seat uncontested, following the withdrawal of independent candidate Everest Chandigere.\n\nThe Zimbabwe Electoral Commissions Makonde District elections officer, Shepherd Kawocha, confirmed the outcome on Wednesday at the Makonde Rural District Council offices in Lions Den, bringing the by-election to an abrupt end before a single vote was cast. Madhishi will succeed his late sister, Clr Ramu Madhishi, who passed away in June after a prolonged illness.\n\nZanu PF provincial leadership hailed the uncontested victory as evidence of the oppositions disarray. Cde Mary Mliswa-Chikoka, provincial chairman, said: ZANU PF continues to capitalise on the oppositions disorganization, particularly in rural constituencies where our mobilisation networks are strongest.\n\nProvincial youth chairperson, Tapiwa Masenda, added: The oppositions influence is fading across the province, and ZANU PF aims to secure more than 90 percent of the vote in upcoming harmonised elections.\n\nObservers note that the unopposed win allows ZANU PF to retain control of Makonde Rural Ward 8, historically considered a party stronghold, without testing its support at the ballot box. Madhishi is expected to assume office immediately, with a focus on service delivery and development projects in the largely agrarian ward  though some residents question whether these promises will address the wards pressing needs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF has further tightened its hold on Makonde District after Bothwell Madhishi won the Rural Ward … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/zanu-pf-wins-makoni-ward-8-seat-as-independent-candidate-pulls-out-of-race/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Wins Makoni Ward 8 Seat As Independent Candidate Pulls Out Of Race\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "Citizens Leader Advocate Nelson Chamisa’s Special Message To Nation…",
            "url": "https://www.zimeye.net/2025/08/16/citizens-leader-advocate-nelson-chamisas-special-message-to-nation/",
            "content": "By Tinashe Sambiri\n\nCitizens leader Advocate Nelson Chamisa has once again sought to uplift the nations spirits, delivering a message of encouragement at a time when Zimbabwe is facing deep economic challenges and worsening corruption scandals.\n\nIn a brief statement on Friday, Chamisa declared: ZIMBABWE SHALL RISE & SHINE Have no regrets for being a Zimbabwean! Be of good cheer. Our story will shock the world. Happy Friday!!\n\nHis message comes as the country continues to grapple with economic turmoil, widespread poverty, and allegations of corruption and looting linked to Zanu PF officials. For many Zimbabweans struggling to make ends meet, Chamisas words are seen as a call to remain hopeful despite the crisis.\n\nPolitical observers note that Chamisa has consistently positioned himself as a voice of optimism, urging citizens to look beyond the current hardships.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Citizens leader Advocate Nelson Chamisa has once again sought to uplift the nation’s spirits, delivering a message … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/citizens-leader-advocate-nelson-chamisas-special-message-to-nation/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens Leader Advocate Nelson Chamisa’s Special Message To Nation…\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "How ZRP Mandizvidza Military-Coup Is Just Another Hopewell Chin’ono Anti-Geza-Fiction",
            "url": "https://www.zimeye.net/2025/08/16/how-zrp-mandizvidza-military-coup-is-just-another-hopewell-chinono-anti-geza-fiction/",
            "content": "By Farai D Hove | Analysis| Late last year 2024, a group of varakashis (online bullies-pictured) known for authoring so called Essays4ED, ran out of stories to write following the resignation of Nelson Chamisa from the Mahere-fested CCC party. They also struggled to popularise their we need new leaders, demand for Chamisa to die off totally.\n\nFast forwards to 2025, a new crowd-pull has emerged: there are 5 young heroes whove begun popping out of the dark, every time Emmerson Mnangagwas lost popularity, and all of them are famous over a police arrest story making them very popular for alleged bravery. The five are:\n\n1. Talent Rusere, a fake professor and fake lawyer, running a fake South African lawyers organisation. Rusere managed to deceive media houses that he is genuinely exposing state corruption together with Mr Hopewell Chinono, in two countries, Zimbabwe and Mozambique. He was arrested soon after his stint.\n\n2. Young hero number 2 is an award winning inventor, calling himself Maxwell Chikumbutso.\n\nChikumbutso is a fake inventor running a fake name name. His real name is Sangulani Chikumbutso and he popped out of the dark on 28 January 2025 soon after Mnangagwa had lost popularity to Constantino Chiwenga. Chikumbutso claimed that he is fixing the economy by introducing free electricity and cars that run forever without charging. His story was believable because of an arrest claim that Mnangagwa announced saying he was poisoned and arrested for his invention.\n\n 3. The third young person is a little known assistant inspector Simbarashe Mandizvidza who at the time when Mnangagwa was losing popularity, he popped out to play a Geza hero character, whos removing Mnangagwa. He was arrested soon after this and the police failed to produce a single picture on the day as is usual with all such high profile arrests.\n\n4. The fourth young person is Emmerson Mnangagwa himself who at the time that Mandizvidza was making his proclamations, he (Mnangagwa) was struggling to prove that his name is in Rhodesia prosecution documents as a convicted young man over bombing a train. Documents prove that there is no one with his name who bombed any train in 1965, or at any time in the 16 year Chimurenga-Umvukela-Rhodesia-Bush War.\n\n5. The 5th person is an award boasting journalist, called Hopewell Chinono who has continued his practice of falsely accusing the civil society of tension with the army(2018-2025).\n\nWhen Mnangagwa lost popularity to Chiwenga in March 2025, he generated false claims that a group of soldiers stole firearms in Mutare. He also claimed that there were bombings at various premises, incidents that did not happen at all. These were insider-stagings by state operatives. As a result of Chinonos posts, 94 activists have been arrested and been slapped with charges over participating in the activities Chinono doctored.\n\nThe hero number 3, has been arrested after being accused of stealing a police car, in a fashion similar to the Chinono claims he published on 27 March 2025.\n\n\nHopewell Chinono was reached for comment.\n\nEmmerson Mnangagwa was reached for comment. \n\nTalent Rusere was reached for comment and he pleaded saying that him and Hopewell Chinono are being persecuted over their activism.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | Analysis | Late last year 2024, a group of varakashis (online bullies-pictured) known for authoring … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/how-zrp-mandizvidza-military-coup-is-just-another-hopewell-chinono-anti-geza-fiction/\">Continue reading<span class=\"screen-reader-text\"> \"How ZRP Mandizvidza Military-Coup Is Just Another Hopewell Chin’ono Anti-Geza-Fiction\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        },
        {
            "title": "Minister Chadzamira Claims Mnangagwa Is A ‘God-Given Leader’",
            "url": "https://www.zimeye.net/2025/08/16/minister-chadzamira-claims-mnangagwa-is-a-god-given-leader/",
            "content": "By A Correspondent\n\nMasvingo Provincial Affairs and Devolution Minister Ezra Chadzamira has sparked controversy by describing President Emmerson Mnangagwa as a God-given leader.\n\nWith the Masvingo Urban Ward 7 by-election set for September 13, Zanu PF is facing criticism over distributing cash grants to local traders, with observers warning that the timing appears politically motivated.\n\nOn Thursday, members of the Crossborder Traders for ED-Masvingo Chapter received funds through the Presidential Empowerment Scheme. Chadzamira praised the President during the handover, calling him a God-anointed leader committed to mass empowerment.\n\nChadzamira said: Our President, Dr Cde ED Mnangagwa, was anointed by God to lead this country. He has been driving development initiatives that align with Vision 2030 and empower ordinary Zimbabweans.\n\nThe 26 members of the Crossborder Traders for ED-Masvingo Chapter shared US$20,000 in cash grants, with individual amounts ranging from US$200 to US$500. The funding was facilitated by the Presidential Investment Advisor to the United Arab Emirates, Dr Paul Tungwarara.\n\nChadzamira urged the recipients to use the funds responsibly: I expect you to grow your businesses and create wealth for your families, ensuring this support leads to tangible development in our communities.\n\nCrossborders for ED national chairperson David Masore also praised the Presidents policies, saying: President Mnangagwa has consistently walked the talk with his mantra of leaving no one and no place behind. His policies aim to improve the welfare of ordinary Zimbabweans.\n\nMasore added his gratitude to Dr Tungwarara for advising the President on expanding empowerment funding and commended Minister Chadzamira for providing affordable residential stands to members in Masvingo province.\n\nThe cash recipients came from all seven administrative districts of Masvingo province and received their funds amid pomp and ceremony. Political analysts, however, caution that such handouts could be seen as an effort to sway voter sentiment ahead of the September 13 by-election.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo Provincial Affairs and Devolution Minister Ezra Chadzamira has sparked controversy by describing President Emmerson Mnangagwa as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/16/minister-chadzamira-claims-mnangagwa-is-a-god-given-leader/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Chadzamira Claims Mnangagwa Is A ‘God-Given Leader’\"</span></a></p>",
            "time": "09:31",
            "date": "17 Aug 2025"
        }
    ]
}