{
    "news": [
        {
            "title": "Highlanders Appoint Denzil Mnkandla as New CEO",
            "url": "https://www.zimeye.net/2025/08/01/highlanders-appoint-denzil-mnkandla-as-new-ceo/",
            "content": "By Sports Correspondent\n\nBULAWAYO  Highlanders Football Club has announced the appointment of Denzil Mnkandla as its new Chief Executive Officer, effective immediately.\n\nIn a statement released Friday, August 1, 2025, the club said Mnkandla brings a wealth of experience to Bosso, having previously served in various administrative capacities at FC Platinum.\n\nWe are pleased to announce the appointment of Mr. Denzil Mnkandla as the new Chief Executive Officer, read the statement.\n\nDescribing him as a seasoned football administrator, Highlanders said they are confident Mnkandlas leadership will steer the club forward.\n\nWe welcome Mr. Mnkandla to the countrys oldest, most followed and supported football team, the club added.\n\nSupporters were urged to rally behind the new CEO.\n\nPlease join us in extending a warm welcome to Mr. Mnkandla as he takes on this new role, the club said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent BULAWAYO – Highlanders Football Club has announced the appointment of Denzil Mnkandla as its new Chief Executive … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/highlanders-appoint-denzil-mnkandla-as-new-ceo/\">Continue reading<span class=\"screen-reader-text\"> \"Highlanders Appoint Denzil Mnkandla as New CEO\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "ZIMFEST 2025 Declared a Huge Success as Organisers Praise Community Spirit",
            "url": "https://www.zimeye.net/2025/08/01/zimfest-2025-declared-a-huge-success-as-organisers-praise-community-spirit/",
            "content": "By A Correspondent | ZimEye | 1 August 2025\n\nDUNSTABLE  The Mayor of Dunstable has hailed ZIMFEST 2025 as a vibrant celebration of cultural diversity and unity, following his attendance at the high-profile Zimbabwean cultural festival held on Saturday, 26 July.\n\nWriting in a public statement, the Mayor said she was honoured to attend the annual event, which brought together nearly 20,000 people from across the UK to celebrate Zimbabwean music, cuisine, and heritage.\n\nZimfest was a celebration of rhythm, identity, and unity, the Mayor said, adding that it was a powerful reminder of how cultural events strengthen community ties and foster inclusion.\n\nShe was accompanied by his consort, Jules, and friends, who earlier in the day had joined him in supporting Dunstable Town Football Club. Despite having to leave early due to a packed schedule, the Mayor praised the organisers for their warm hospitality and the events electrifying atmosphere.\n\nShe also extended special thanks to Jan Paul and the ZIMFEST team for their invitation and hospitality, describing the experience as beyond words.\n\nDuring the visit, the Mayor met with officials from the Zimbabwe High Commission UK and held meaningful conversations with Zimbabwean leaders living in the UK. He also commended King Alfred, a Zimbabwean community organiser in Dunstable, who coordinated stage performances and helped keep the event running smoothly.\n\nEvents like Zimfest are not just about music and foodthey are bridges between cultures, the Mayor said. They provide valuable insight into how communities can learn from and support each other.\n\nThe events organisers have also released a statement thanking attendees for their support and clarifying that no fines were issued against the festival, contrary to social media rumours.\n\nZIMFEST continues to grow in prominence as a cornerstone event for the Zimbabwean diaspora in the UK, with plans already underway for an even bigger 2026 edition.\n\n#ZimFest2025 #DunstableMayor #CommunityUnity #CulturalCelebration #ZimbabweDiaspora\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | 1 August 2025 DUNSTABLE – The Mayor of Dunstable has hailed ZIMFEST 2025 as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/zimfest-2025-declared-a-huge-success-as-organisers-praise-community-spirit/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMFEST 2025 Declared a Huge Success as Organisers Praise Community Spirit\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "DeMbare Increase Players’ Bonuses Ahead Of Do Or Die Clash With MWOS",
            "url": "https://www.zimeye.net/2025/08/01/dembare-increase-players-bonuses-ahead-of-do-or-die-clash-with-mwos/",
            "content": "By Sports Correspondent\n\nFading Harare giants Dynamos FC have significantly increased player bonuses in a desperate bid to escape relegation, ahead of a crucial Castle Lager Premier Soccer League clash against MWOS at Rufaro Stadium tomorrow.\n\nThe Glamour Boys are deep in crisis, languishing near the foot of the table with just 16 points from 23 games. With only 11 matches remaining, they trail the safety zone by eight points.\n\nIn response, the clubs leadership, under growing pressure, has hiked player winning bonuses by over 300 percent to boost morale and spark a turnaround.\n\nWe have increased the players winning bonuses starting this week. The players know this already and they are excited. They want to deliver and save the team, said club executive chairman Moses Maunganidze.\n\nSources close to the club revealed that the revised bonuses range between US$350 and US$400 per win, with potential for more under special match incentives. The new financial injection has come via unnamed partners working with Dynamos sponsors Sakunda Holdings.\n\nBeyond financial incentives, the club has also engaged a team of psychologists to address players mental fatigue and low confidence. They started working with the players last week and the attitude is now better. We will move along with the team of those psychologists until the end of the season, Maunganidze confirmed.\n\nThe game against MWOS will mark the official start of Kelvin Kaindus reign as head coach. The former Highlanders boss replaces the suspended Saul Chaminuka and becomes the third coach to lead Dynamos this season, after Lloyd Chigowes brief stint and Chaminukas troubled spell.\n\nKaindu is expected to receive his work permit today, just in time for tomorrows must-win match. What is almost certain is that Kaindu will start his tenure this weekend, said club spokesperson David Chikomo.\n\nKaindu will be assisted by former Yadah Stars coach Thomas Ruzive, who joined the team at training to familiarise himself with the squad. The rest of the technical bench, including assistant Takesure Chinyama, remains unchanged.\n\nDynamos on-field woes have been glaring. The team has only managed two wins all season and scored a mere six goals in 23 outings. Alarmingly, they have not found the net in their last seven matches.\n\nIn a further bid to bolster their survival hopes, the club has confirmed six new mid-season signings. These include the return of midfielder Denver Mukamba, Ghanaian duo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Fading Harare giants Dynamos FC have significantly increased player bonuses in a desperate bid to escape relegation, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/dembare-increase-players-bonuses-ahead-of-do-or-die-clash-with-mwos/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Increase Players’ Bonuses Ahead Of Do Or Die Clash With MWOS\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "ZCDC on autopilot.. management approach threatens viability",
            "url": "https://www.zimeye.net/2025/08/01/zcdc-on-autopilot-management-approach-threatens-viability/",
            "content": "By A Correspondent| The Zimbabwe Consolidated Diamond Company (ZCDC) is on autopilot after failing to pay employee with inside sources blaming the current top management of failing to impliment sound policies to drive the diamond miner.\n\nWith many workers having lost their jobs while remuneration of those still on the job remains unclear, a critical conversation about the companys management practices and future strategy is necessary.\n\nInstead of attributing the failure to pay salaries on time solely to fluctuating international market prices, ZCDC management must take a hard look at its internal operations, according to industry captains.\n\nIn a confidential email seen written by ZCDC Chief Executive Office Douglas Zimbango to staff on the July salaries update, he casted the blame on the current diamonds sales joint venture between ZCDC and its Dubai based partner.\n\nAs you may be aware, the JV sales arrangement was up for review on 15 June 2025. As management, we were of the view that most of the conditions precedent were not reasonable met and the average price per carat was at its lowest for May production at $17.17 per carat against total operating costs of $30.71 per carat and production costs of $23.79. We could not accept that price and so referred the matter to both Mutapa and our board.\n\nThe board and Mutapa were of the view that we should suspend the JV while our legal teams reviewed the arrangement but to keep the business running, we then offered the May and June production to the JV Partner on a without Prejudice on consignment with a reduced commission and overall oversight by ZCDC. The JV partner on 30th July 2025 then rejected this outright and so tomorrow we are meeting with the board for guidance, Zimbango said.\n\nGiven this scenario, we are unable to pay salaries and fund production unless drastic decisions are made for which we hope will be done at tomorrows board meeting., he added.\n\nAccording to sources at ZCDC, the decision to cut jobs, particularly affecting local miners, seems to sidestep the real issues plaguing the company. A serious restructuring plan is essential, focusing on enhancing operational efficiency rather than reducing the workforce.\n\nAccording to the sources who requested anonymity for fear or reprisal noted that ZCDC should consider optimizing its mining operations by investing in modern mining services. This could include adopting new technologies and training for the workforce to improve productivity and reduce costs.\n\nGoing foward, Streamlining the procurement process is another area where ZCDC could significantly enhance efficiency. By negotiating better contracts and sourcing materials locally, the company can reduce expenses and support the local economy.\n\nUpgrading the processing plant is crucial. Implementing advanced processing techniques can improve yield and reduce waste, directly impacting profitability, a senior management source at ZCDC said.\n\nThe recent surge in stolen stones, particularly from ZCDC operations in Mutare, highlights the urgent need for improved security measures. Investing in state-of-the-art security systems and protocols could help safeguard assets and prevent further losses.\n\nDespite the negative results, the question remains: why has the top management remained untouched?\n\nThe recent appointment of Mutapa as Chairman of ZCDC, replacing Mr. Munashe Shava, raises questions about the ultimate plan of the Mutapa Fund for the company.\n\nZCDC therefore stands at a crossroads.\n\nSenior Industry captains further opined that Instead of retrenching local miners, management should prioritize a comprehensive restructuring plan that focuses on optimizing operations and improving security.\n\n The future of ZCDC depends on its ability to adapt to market challenges while supporting its workforce and community.\n\nThe management must act decisively on these critical points to ensure the long-term sustainability of the company and the livelihoods of those who depend on it. The time for change is now, a senior industry captains further opined said.\n\nAnother senior industry player added that the JV has been instrumental in supporting ZCDC financially.\n\nAs far as we know the JV has been supporting financially ZCDC as a Trading House that was purchasing and paying the stones to ZCDC even when the market was low and the stones were kept in the vaults in Dubai waiting for better times for selling them, the industry player added.\n\nGoing foward there are a lot of questions which require answers as the struggles of the diamond miner persist.\n\nWhat is the real role of the Dubai JV? where someonetimes it is painted as the solution of everything while when it is convenient for ZCDC too management, the JV is blamed for being the cause of the companya struggles.\n\nThere are also questions being asked if the Dubai JV sets up the sale prices or it is just a broker of some sort?\n\nThe sale prices being under the production cost are set by the JV or it is the current situation in the international markets? These are some of the questions which require answers.\n\nZCDC management have the duty to answer.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Zimbabwe Consolidated Diamond Company (ZCDC) is on autopilot after failing to pay employee with inside sources … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/zcdc-on-autopilot-management-approach-threatens-viability/\">Continue reading<span class=\"screen-reader-text\"> \"ZCDC on autopilot.. management approach threatens viability\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "ZRP Adopts Drone Technology – Citizens Ask Whether Priorities Are Right",
            "url": "https://www.zimeye.net/2025/08/01/zrp-adopts-drone-technology-citizens-ask-whether-priorities-are-right/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has certified 27 officers as drone pilots in a move officials say is part of a broader strategy to modernise policing and embrace digital tools in crime prevention.\n\nThe graduation ceremony, held at the ZRP Sports Club on Wednesday, was highlighted by the force as a step forward in deploying technology-driven solutions under the Electronic Traffic Management System (ETMS).\n\nAs the ZRP continues to embrace technology in policing, 27 police officers graduated with drone pilot certificates at ZRP Sports Club this afternoon, the organisation said in a statement on Thursday.\n\nHowever, the initiative has triggered public debate, with critics questioning whether such efforts are addressing the real and immediate challenges faced by citizens on the ground. Many pointed to the forces continued struggles with basic service delivery, such as the lack of digital payment systems at roadblocks and the inconsistent issuance of traffic tickets.\n\nDigitisation Digitise this whole entity. We are 20+ years behind other nations. Come on people!! commented @Lovely Ndai on social media.\n\nAnother user, Isibaya Esikhulu, added: What technology when the department doesnt even have ticket books at roadblocks?\n\nThe department doesnt take ZiG and you can only pay cash USD. There isnt even a POS machine at a single station across the country.\n\nThe ETMS is intended to modernise traffic enforcement, reduce corruption, and enhance transparency by using automated systems to detect violations. These include the use of speed sensors, cameras, and number plate recognition to log offences and issue fines without direct police interaction.\n\nDespite these advancements, citizens remain skeptical about the broader impact of such programs in the face of persistent operational gaps. Concerns over accountability, consistency in enforcement, and access to payment systems continue to dominate public discussion.\n\nWhile the ZRPs move toward drone technology signals a commitment to innovation, the force is under growing pressure to ensure that basic policing infrastructure is not left behind.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has certified 27 officers as drone pilots in a move officials say … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/zrp-adopts-drone-technology-citizens-ask-whether-priorities-are-right/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Adopts Drone Technology – Citizens Ask Whether Priorities Are Right\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "Battle for Robert Mugabe’s Estate Takes New Twist as Alleged Son’s Claim Dismissed",
            "url": "https://www.zimeye.net/2025/08/01/battle-for-robert-mugabes-estate-takes-new-twist-as-alleged-sons-claim-dismissed/",
            "content": "By A Correspondent\n\nThe long-running legal dispute over the estate of the late former President Robert Gabriel Mugabe has taken another dramatic turn, with the High Court throwing out an application by a man claiming to be Mugabes son.\n\nTonderayi Gabriel Mugabe approached the court seeking to reopen the estate (Estate DR 2703/19), arguing that he had been unjustly excluded from the distribution of Mugabes assets.\n\nRepresented by lawyer Muchivete Hungwe, Tonderayi requested permission to challenge the Master of the High Courts decision to finalise and close the estate in December 2020.\n\nHowever, High Court judge Justice Fatima Maxwell dismissed the application, citing an inordinate delay and lack of credible evidence.\n\nThe delay is inordinate, and the explanation given for it is not satisfactory, Justice Maxwell said in her ruling. The court noted that the application had been filed in February 2025, more than four years after the estate was closed.\n\nTonderayi claimed he was born in 1977 in Mozambique to Hilda Maeka and was the biological son of the late president.\n\nHe submitted DNA test results, a revised birth certificate, and affidavits from relatives in an effort to support his case. But the court was not convinced.\n\nNone of the annexures take the applicants case anywhere, Justice Maxwell stated. The inclusion of the fathers details on a birth certificate is proof of acknowledgement of paternity. The exclusion, therefore, when the birth certificate was obtained during the lifetime of the alleged father, is a clear indication that paternity was not acknowledged.\n\nA DNA report submitted by Tonderayi suggested a sibling relationship with an individual named Lawrencia Mugabe. However, the judge said this fell short of establishing a direct biological link to the late president.\n\nWhat it shows is that he might have been sired by one of the males related to the person who was tested, the court noted.\n\nThe judge also dismissed the 2022 re-registration of Tonderayis birth certificate, which changed his surname to Mugabe, as insufficient to prove paternity.\n\nThe law does not allow a near relative to come forward and acknowledge paternity on behalf of a father in circumstances such as this, Justice Maxwell said.\n\nThe court further criticised Tonderayi for failing to take timely action or provide a coherent timeline of events. Erroneous proceedings are not an excuse that prevents the running of the time within which the application for review is to be filed, she added.\n\nThe ruling also pointed to the potential prejudice to beneficiaries of the estate, who had relied on the closure of the matter over four years ago.\n\nThe balance of convenience favours the dismissal of this application, Justice Maxwell concluded, ordering that the case be dismissed with costs.\n\nThe ruling solidifies the legal finality of Mugabes estate, now administered by his daughter, Bona Nyepudzayi Mugabe, who was represented by lawyer Addington Chinake of Kantor & Immerman.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The long-running legal dispute over the estate of the late former President Robert Gabriel Mugabe has taken … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/battle-for-robert-mugabes-estate-takes-new-twist-as-alleged-sons-claim-dismissed/\">Continue reading<span class=\"screen-reader-text\"> \"Battle for Robert Mugabe’s Estate Takes New Twist as Alleged Son’s Claim Dismissed\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "Citizens Leader Advocate Chamisa Sparks Fresh Hope With Simple “Happy New Month” Message",
            "url": "https://www.zimeye.net/2025/08/01/citizens-leader-advocate-chamisa-sparks-fresh-hope-with-simple-happy-new-month-message/",
            "content": "By Tinashe Sambiri\n\nIn a country weary from economic turmoil and political uncertainty, a few simple words from Nelson Chamisa lit up social media and stirred hope among his followers.\n\nHappy New Month, the former Citizens Coalition for Change (CCC) leader wrote on his official WhatsApp Channel on August 1  a short message that carried unexpected emotional weight for thousands of Zimbabweans hungry for direction and inspiration.\n\nThough Chamisa stepped away from the CCC last year, he continues to command attention and loyalty from a significant portion of the population.\n\nHis silence in recent months had sparked speculation, but his brief message quickly reminded supporters why they continue to look to him as a symbol of hope.\n\nEven when he says something as short as Happy New Month, it feels powerful, said one of his followers in Harare.\n\nHe hasnt abandoned us  hes still with the people.\n\nWhile the message was not political on the surface, many interpreted it as a quiet signal that Chamisa remains engaged with the nations struggles, even outside formal party structures.\n\nThe post has since been widely shared and reposted across platforms, with comments urging him to come back and lead again.\n\nDespite leaving the CCC amid internal tensions and alleged infiltration, Chamisas popularity remains intact  and his words, no matter how few, still move the nation.\n\nFor now, the country waits to see whether the man many still call President has more than just greetings in store.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri In a country weary from economic turmoil and political uncertainty, a few simple words from Nelson Chamisa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/citizens-leader-advocate-chamisa-sparks-fresh-hope-with-simple-happy-new-month-message/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens Leader Advocate Chamisa Sparks Fresh Hope With Simple “Happy New Month” Message\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "School Expels Learner For Urinating In Class",
            "url": "https://www.zimeye.net/2025/08/01/school-expels-learner-for-urinating-in-class/",
            "content": "By A Correspondent\n\nA Form Four pupil at Nyakatsapa High School in Mutasa District has been expelled after reportedly urinating into a bottle during a lesson, according to State media.\n\nThe student, a boarder whose identity has been withheld for legal reasons, will now sit for his final ZIMSEC examinations as a private candidate during the next term.\n\nSpeaking to State media, the learners father condemned the schools decision, arguing that it was unnecessarily harsh given his sons academic level.\n\nI think the school authorities were heavy-handed in their decision to expel my son, he said. What hurts me the most is that my child is in Form Four and has been told that he can only return to write the final ZIMSEC exams next term.\n\nHe further claimed that the boy had asked for permission to go to the toilet but the teacher refused, leaving him with no option.\n\nThe boy is in Form Four, and even if he had shown disciplinary problems, I think there could have been a diplomatic and constructive way of dealing with someone who will be sitting for exams in October, just three months from now, he added.\n\nThe school head , Mr. Misheck Rwizi, quoted by The Herald, confirmed the incident, although he said it had been handled by his deputy.\n\nThe parent actually came and discussed the matter with the deputy headmaster. I heard about it. Yes, that issue of urinating in a bottle in class was mentioned, said Mr. Rwizi.\n\nHe also indicated that the student had been involved in other disciplinary issues in the past, though this was considered the most serious.\n\nThe school has not issued a public statement on the matter, and education authorities are yet to comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Form Four pupil at Nyakatsapa High School in Mutasa District has been expelled after reportedly urinating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/school-expels-learner-for-urinating-in-class/\">Continue reading<span class=\"screen-reader-text\"> \"School Expels Learner For Urinating In Class\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "No Vacancies in Presidium, Zanu PF Murakashi Declares",
            "url": "https://www.zimeye.net/2025/08/01/no-vacancies-in-presidium-zanu-pf-murakashi-declares/",
            "content": "By A Correspondent\n\nA staunch Zanu PF supporter and prominent member of the Varakashi4ED online campaign team, Tanaka Gumbo, has declared that the highest offices in Zimbabwes leadership structure are sealed until 2030  firmly occupied by President Emmerson Mnangagwa and Vice President Constantino Chiwenga.\n\nGumbo made the bold claims via his official Facebook page on Thursday, amid mounting speculation over succession battles and internal jostling within the ruling party.\n\nThe offices of The President and the Vice President of Zimbabwe have got no vacancies! he wrote. Kusvika 2030 Emmerson Dambudzo Mnangagwa and His Vice President The Rtd General Constantino Guvheya Dominic Nyikadzino Chiwenga [are] moving the Republic in a progressive motion ahead [towards] Vision 2030!\n\nGumbo went on to reaffirm loyalty to the current leadership, stating, Tinoda kungoti pamberi naBaba Mnangagwa neVISION 2030. Vanenge vachipooo and vanenge vachingotonga! Pamberi negwara remusangano!\n\nHe also used hashtags such as #Vision2030, #EDelivers, and #EDPromisED  slogans often repeated in pro-government social media messaging  and made a nod to controversial businessman Wicknell Chivayo with #EDHuchi Sir Wicknell.\n\nGumbos comments appear to endorse the continued leadership of both Mnangagwa and Chiwenga until 2030, despite swirling rumours of factional divisions within Zanu PF.\n\nThe ruling party has not officially responded to his post, nor has it addressed concerns about internal succession tensions that have periodically resurfaced.\n\nPolitical analysts have long warned that unresolved leadership ambitions could destabilise the party ahead of the next election cycle.\n\nFor now, Gumbos remarks suggest that loyalists are closing ranks around the current leadership  even if some in the party may have different ideas behind closed doors.\n\nThe Office of the President and Cabinet is yet to issue a formal statement on the 2030 agenda.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A staunch Zanu PF supporter and prominent member of the Varakashi4ED online campaign team, Tanaka Gumbo, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/no-vacancies-in-presidium-zanu-pf-murakashi-declares/\">Continue reading<span class=\"screen-reader-text\"> \"No Vacancies in Presidium, Zanu PF Murakashi Declares\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        },
        {
            "title": "Cash-Strapped Govt Turns to Informal Sector for Revenue",
            "url": "https://www.zimeye.net/2025/08/01/cash-strapped-govt-turns-to-informal-sector-for-revenue/",
            "content": "By A Correspondent\n\nFinance Minister Mthuli Ncube has revealed that the government is working on new measures to tax Zimbabwes informal sector, in a bid to expand its revenue base amid tightening fiscal constraints.\n\nPresenting the 2025 Mid-Term Budget Review Statement in Parliament on Thursday, Ncube said the Treasury was actively exploring ways to integrate the informal economy into the tax system.\n\nThe informal sector remains a critical component of our economy, Ncube said. However, it also presents challenges in terms of revenue collection. Government is therefore considering new measures to bring this sector into the tax net in a fair and sustainable manner.\n\nNo specific timeline or detailed framework was provided, but the Minister insisted that any approach would be aimed at formalising the sector without stifling economic activity. We want to ensure that small businesses are not burdened but supported to grow while contributing meaningfully to national development, he added.\n\nThe announcement comes as Treasury has already spent 35% of the approved 2025 national budget  approximately US$3.3 billion  with limited room to increase spending. Ncube emphasized that the government would maintain a strict fiscal discipline and ruled out any budget extensions. There is no intention to increase the budget. The remaining 65% is sufficient to take us to the end of the year, he said.\n\nAlthough the government has set an ambitious economic growth target of 6% for 2025, Ncube admitted that GDP growth for 2024 has been revised downward to just 1.7%. Meanwhile, he pointed to a 30.2% rise in foreign currency inflows during the first half of the year, claiming it reflected improved confidence in the economy.\n\nNcube also highlighted structural changes in the economy, noting that manufacturing now contributes 15.3% of GDP  surpassing agriculture. However, agriculture is expected to rebound strongly in 2025 with projected growth of 21.1%, supported by ongoing investments and regulatory reforms.\n\nThe Finance Minister said government would continue reviewing business licences, fees, and regulatory frameworks, particularly in the agricultural sector. Within two weeks, we expect to complete the review of agricultural regulations and fees to remove bottlenecks affecting productivity, he said.\n\nDespite Ncubes reassurances, the proposed taxation of the informal sector has already raised concerns among traders and small business operators, many of whom feel overburdened by existing costs and levies. Critics argue that the move is a sign of desperation by a government that has run out of new revenue streams.\n\nWith public debt now standing at 46.5% of GDP (in US dollar terms), the pressure on Treasury to find additional funds is mounting  and for many, the informal sector is the easiest target.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Finance Minister Mthuli Ncube has revealed that the government is working on new measures to tax Zimbabwe’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/cash-strapped-govt-turns-to-informal-sector-for-revenue/\">Continue reading<span class=\"screen-reader-text\"> \"Cash-Strapped Govt Turns to Informal Sector for Revenue\"</span></a></p>",
            "time": "06:50",
            "date": "02 Aug 2025"
        }
    ]
}