{
    "news": [
        {
            "title": "Bakery Manager Jailed for Theft, Gambling",
            "url": "https://www.zimeye.net/2025/01/08/bakery-manager-jailed-for-theft-gambling/",
            "content": "By A Correspondent\n\nA 28-year-old shift manager at Bakers Inn, William Gonese, has been sentenced to two-and-a-half years in prison for stealing US$3,420 from his workplace to fund online betting. Gonese, who was convicted after pleading guilty to theft, will serve an effective 10-month prison term.\n\nAccording to court records, Gonese stole the money during a single night shift, hoping to win enough through online betting on a platform called Aviator to repay the money and impress his new wife. However, his plan backfired, and he lost the entire amount.\n\nGonese was entrusted with a float of US$3,420 to serve customers at a Bakers Inn outlet on Chinhoyi Street in Harare. However, by the next day, he called the Simbisa Bakers Inn Audit Manager, Yusuf Bruce, and confessed to losing US$470 in cash and US$2,950 in InnBucks deposits through online betting.\n\nA reconciliation at the shop confirmed that the full amount of US$3,420 had been misappropriated. Gonese was initially sentenced to 30 months imprisonment, but 12 months were suspended on condition of good behavior, and another 10 months were suspended on condition that he repay the stolen money to his employer.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 28-year-old shift manager at Baker’s Inn, William Gonese, has been sentenced to two-and-a-half years in prison … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/bakery-manager-jailed-for-theft-gambling/\">Continue reading<span class=\"screen-reader-text\"> \"Bakery Manager Jailed for Theft, Gambling\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Police Accuse Schools Of Copying Wicknell Chivayo Money Stashing",
            "url": "https://www.zimeye.net/2025/01/08/police-accuse-schools-of-copying-wicknell-chivayo-money-stashing/",
            "content": "By Dorrothy Moyo | Harare  The Zimbabwe Republic Police (ZRP) has accused schools of mishandling cash in the style of the infamous conduct of businessman Wicknell Chivayo, who has come to symbolize the misuse of large sums of unaccounted money.\n\nChivayo, whose name has become synonymous with failed accountability after receiving $5 million for the countrys non-existent Gwanda Solar Plant, has not delivered a single solar panel in nearly a decade. Instead of cautioning Chivayo for wasting millions on luxury cars while schools remain in darkness, the police have turned their attention to schools, accusing them of piling stashes of cash on their premises.\n\nPolice Accusations Against Schools\n\nNational police spokesperson Commissioner Paul Nyathi has issued a strong warning to schools to stop holding large amounts of money on-site. Speaking as schools prepare to reopen next week, Nyathi urged authorities to deposit funds into banks and enhance security measures to avoid armed robberies, which have become increasingly common.\n\nSchool authorities should employ guards from reputable security service providers and install CCTV at entry points and administration offices. Above all, they must stop keeping cash on-site, Nyathi said.\n\nThe remarks, however, have ignited a firestorm of criticism, with many accusing the police of unfairly targeting schools while allowing Chivayos financial mismanagement to go unchecked.\n\nSchools Are Being Made Scapegoats\n\nCritics argue that the polices focus on schools is misplaced and hypocritical. Schools have been left to manage their finances in difficult circumstances, often without reliable electricityan issue directly tied to Chivayos failure to deliver solar power infrastructure.\n\nHow can the police accuse schools of mishandling cash when the biggest offender, Wicknell Chivayo, is walking free after wasting millions that could have revolutionized energy access for these very institutions? asked the frustrated education advocate, Wesley Banda.\n\nChivayo famously spent part of the $5 million payment meant for the Gwanda Solar Plant on a fleet of luxury cars and personal expenses. Activists have called for him to sell these assets to fund solar panels for schools, but no action has been taken against him.\n\nRising Robberies Amid Systemic Failures\n\nThe ZRPs warning comes amid an increase in armed robberies targeting schools, especially during fee collection periods. Criminals have used guns, machetes, and iron bars to steal cash and valuables from institutions that store money on-site due to limited banking access or infrastructure.\n\nNotable incidents include: Bulawayo: $17,280 stolen from a cash box. Masvingo: $22,800 stolen by a lone armed robber posing as a parent. Ruwa and Gweru: More than $17,500 stolen from two private schools by armed gangs.\n\nWhile the police have urged schools to adopt electronic payment systems, critics point out that such measures do not address the deeper issue of resource scarcity and unreliable electricitya gap Chivayos solar plant was supposed to fill.\n\nParallels Between Schools and Chivayo\n\nThe comparison between schools and Wicknell Chivayo has sparked outrage. Public commentators have noted that schools, unlike Chivayo, are victims of a broken system, forced to store cash due to a lack of viable alternatives. Chivayo, on the other hand, has become a symbol of squandered opportunity and unaccountable wealth.\n\nInstead of accusing schools of copying Chivayos behavior, the police should be holding him accountable for failing to deliver the solar power that could have prevented these robberies in the first place, said a parent from Harare.\n\nPublic Calls for Accountability\n\nThe polices accusations have drawn criticism from educators, parents, and civil society groups, who are demanding that law enforcement shift its focus back to Chivayo. Many are calling for investigations into how Chivayo was able to misappropriate public funds without facing significant consequences, leaving schools and other public institutions to deal with the fallout.\n\nFor nearly a decade, Chivayo has failed to deliver what he was paid for. If the police want to caution anyone about money management, they should start with him, not schools trying to survive in the system he helped cripple, said a teacher from Gwanda.\n\nConclusion\n\nAs schools prepare to reopen amid rising crime and mounting financial pressures, the polices accusations have only added to the frustration of communities struggling to ensure safety and continuity in education. The enduring presence of Chivayos unaccountable wealth serves as a stark reminder of systemic failures that leave schools and citizens vulnerable.\n\nFor now, the question remains: will the police redirect their focus to the root causes of these issues, or will schools continue to bear the brunt of the blame?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Harare — The Zimbabwe Republic Police (ZRP) has accused schools of mishandling cash in the style … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/police-accuse-schools-of-copying-wicknell-chivayo-money-stashing/\">Continue reading<span class=\"screen-reader-text\"> \"Police Accuse Schools Of Copying Wicknell Chivayo Money Stashing\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Lake Kariba Water Levels Rise Amid Ongoing Power Challenges",
            "url": "https://www.zimeye.net/2025/01/08/lake-kariba-water-levels-rise-amid-ongoing-power-challenges/",
            "content": "By A Correspondent\n\nThe water levels at Lake Kariba have been steadily rising following consistent rainfall in both the reservoir and its immediate catchment area, reaching 475.87 meters (2.61% usable storage) by January 6, 2025. This marks an improvement compared to the 477.28 meters (12.32% usable storage) recorded on the same date last year.\n\nZambia and Zimbabwe, both reliant on Kariba Dam for power generation, have faced significant power shortages due to historically low water levels, leading to increased load shedding in recent months. The situation has been exacerbated by the below-normal rainfall during the 2023/24 season, causing a continued decline in water levels.\n\nAccording to the Zambezi River Authority, the usable live storage for power generation as of June 5, 2024, was 477.34 meters, compared to 479.67 meters during the same period in 2023. The Kariba Dam was designed to operate within water levels of 475.50 meters and 488.50 meters to generate hydropower for both Zimbabwe and Zambia.\n\nAs the region continues to navigate these challenges, the rising water levels bring some hope, but the struggle to meet power demand remains ongoing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The water levels at Lake Kariba have been steadily rising following consistent rainfall in both the reservoir … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/lake-kariba-water-levels-rise-amid-ongoing-power-challenges/\">Continue reading<span class=\"screen-reader-text\"> \"Lake Kariba Water Levels Rise Amid Ongoing Power Challenges\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Husband Kills Wife Over Birth Control Pills",
            "url": "https://www.zimeye.net/2025/01/08/husband-kills-wife-over-birth-control-pills/",
            "content": "By A Correspondent\n\nA horrific incident has shaken the community of Chipinge, Zimbabwe, after Felix Maphosa, 29, brutally murdered his 47-year-old wife in a fit of rage.\n\nThe deadly dispute erupted on December 31, 2024, when Maphosa discovered that his wife had been taking birth control pills without his knowledge.\n\nAccording to the National Prosecuting Authority, the argument escalated, and Maphosa violently attacked his wife, striking her on the head three times with an iron bar and then hammering a nail into her chest.\n\nAfter committing the crime, Maphosa went to a beer hall, returning the next morning to find his wife dead. He has been charged with murder and was remanded in custody until January 17, 2025. Maphosa has been advised to apply for bail at the High Court.\n\nThis incident has raised concerns about domestic violence and the devastating consequences of unchecked anger.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A horrific incident has shaken the community of Chipinge, Zimbabwe, after Felix Maphosa, 29, brutally murdered his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/husband-kills-wife-over-birth-control-pills/\">Continue reading<span class=\"screen-reader-text\"> \"Husband Kills Wife Over Birth Control Pills\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Simba Bhora Clears Deck: 13 Players Released",
            "url": "https://www.zimeye.net/2025/01/08/simba-bhora-clears-deck-13-players-released/",
            "content": "By A Correspondent\n\nSimba Bhora has parted ways with 13 players, including 2024 Soccer Star of the Year Walter Musona, following the expiration of their contracts at the end of 2024.\n\nThe mass exodus comes after the clubs successful 2024 Castle Lager Premier Soccer League season, where they won their first-ever league title.\n\nOther notable departures include Patson Jaure, Talent Chawapiwa, Perfect Chikwende, Tichaona Chipunza, Valentine Musarurwa, Tymon Mvula, and Mthokozisi Msebe.\n\nIn a significant coaching change, Tonderai Ndiraya has also left Simba Bhora to join newcomers Scottland FC, who are set to begin their first season in the top-flight league. Musona is reportedly set to follow Ndiraya to Scottland FC.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Simba Bhora has parted ways with 13 players, including 2024 Soccer Star of the Year Walter Musona, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/simba-bhora-clears-deck-13-players-released/\">Continue reading<span class=\"screen-reader-text\"> \"Simba Bhora Clears Deck: 13 Players Released\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Bill Antonio Returns to Action After 10-Month Layoff",
            "url": "https://www.zimeye.net/2025/01/08/bill-antonio-returns-to-action-after-10-month-layoff/",
            "content": "Sports Correspondent\n\nFormer Dynamos FC winger Bill Antonio made a successful return to the pitch on Sunday, playing his first match in ten months after recovering from a long-term knee injury.\n\nThe 22-year-old Zimbabwean international ruptured his ACL during a Belgian Pro League game in March and underwent months of rehabilitation.\n\nAntonio marked his return with a 30-minute appearance in a behind-closed-doors practice match against Beveren, where he even scored an early effort, although it was ruled out for offside.\n\nKV Mechelen ultimately won the practice match 4-0. Antonios successful return is a promising sign for his future in the sport.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Dynamos FC winger Bill Antonio made a successful return to the pitch on Sunday, playing his first … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/bill-antonio-returns-to-action-after-10-month-layoff/\">Continue reading<span class=\"screen-reader-text\"> \"Bill Antonio Returns to Action After 10-Month Layoff\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Sports Commentator Baba Mthethwa Claims Ex-Wife Hired Hitmen to Kill Him",
            "url": "https://www.zimeye.net/2025/01/08/sports-commentator-baba-mthethwa-claims-ex-wife-hired-hitmen-to-kill-him/",
            "content": "By A Correspondent\n\nA dramatic and shocking revelation has emerged from popular SuperSport commentator Baba Mthethwa, who alleges that his ex-wife, Kgomotso Koosimile, has hired hitmen to take his life. This startling accusation comes amidst a long-standing feud between the two, with Koosimile claiming that Mthethwa owes her a staggering R1-million.\n\nMthethwa, known for his iconic catchphrase Ho thaaaaaata-bannaaaa!, revealed that he has received threatening calls from individuals who claim to have been sent by Koosimile. One chilling call allegedly came while Mthethwa was working at Orlando Stadium, with the caller threatening to harm him after the game.\n\nKoosimile has vehemently denied the allegations, instead accusing Mthethwa of failing to settle the R1-million debt he supposedly owes her. According to Koosimile, she used her own funds to pay off Mthethwas debts and also loaned him money during their marriage.\n\nThe bitter dispute between the two began during their divorce proceedings in 2017. Koosimile claims that Mthethwa had nothing when they met, and she supported him financially, even providing him with a place to stay. However, Mthethwa allegedly became abusive and controlling, forcing Koosimile to live in fear.\n\nAs the situation continues to escalate, Mthethwa has vowed to take action against Koosimile, stating that he is ready for war and will not back down. The shocking allegations have sent shockwaves through the sports community, with many calling for calm and urging the two parties to resolve their differences amicably.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A dramatic and shocking revelation has emerged from popular SuperSport commentator Baba Mthethwa, who alleges that his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/sports-commentator-baba-mthethwa-claims-ex-wife-hired-hitmen-to-kill-him/\">Continue reading<span class=\"screen-reader-text\"> \"Sports Commentator Baba Mthethwa Claims Ex-Wife Hired Hitmen to Kill Him\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Bakery Manager’s Sweet Deal Turns Sour…",
            "url": "https://www.zimeye.net/2025/01/08/bakery-managers-sweet-deal-turns-sour/",
            "content": "By A Correspondent\n\nA 28-year-old shift manager at Bakers Inn, William Gonese, has been sentenced to two-and-a-half years in prison for stealing US$3,420 from his workplace to fund online betting. Gonese, who was convicted after pleading guilty to theft, will serve an effective 10-month prison term.\n\nAccording to court records, Gonese stole the money during a single night shift, hoping to win enough through online betting on a platform called Aviator to repay the money and impress his new wife. However, his plan backfired, and he lost the entire amount.\n\nGonese was entrusted with a float of US$3,420 to serve customers at a Bakers Inn outlet on Chinhoyi Street in Harare. However, by the next day, he called the Simbisa Bakers Inn Audit Manager, Yusuf Bruce, and confessed to losing US$470 in cash and US$2,950 in InnBucks deposits through online betting.\n\nA reconciliation at the shop confirmed that the full amount of US$3,420 had been misappropriated. Gonese was initially sentenced to 30 months imprisonment, but 12 months were suspended on condition of good behavior, and another 10 months were suspended on condition that he repay the stolen money to his employer.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 28-year-old shift manager at Baker’s Inn, William Gonese, has been sentenced to two-and-a-half years in prison … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/bakery-managers-sweet-deal-turns-sour/\">Continue reading<span class=\"screen-reader-text\"> \"Bakery Manager’s Sweet Deal Turns Sour…\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "Mutare Cops Arrested for Bribery",
            "url": "https://www.zimeye.net/2025/01/07/mutare-cops-arrested-for-bribery/",
            "content": "By A Correspondent| Two police officers, Sergeant Chiponda Dudzai Jennifer and Constable Mutsago Glynislynn, from Mutare have been arrested on allegations of soliciting and accepting a bribe from a motorist.\n\nThe officers allegedly demanded a bribe of USD$$90.00 to release the motorists vehicle.\n\nThe motorist reported the incident to the Zimbabwe Anti-Corruption Commission (ZACC), and a trap was set up resulting in the accuseds arrest after they accepted USD$20.00.\n\nThey will appear at the Mutare Magistrate Court tomorrow (January 8, 2025) to answer charges of Bribery as defined in the Criminal Law (Codification and Reform) Act, Chapter 9:23.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Two police officers, Sergeant Chiponda Dudzai Jennifer and Constable Mutsago Glynislynn, from Mutare have been arrested on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/mutare-cops-arrested-for-bribery/\">Continue reading<span class=\"screen-reader-text\"> \"Mutare Cops Arrested for Bribery\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        },
        {
            "title": "As ZimEye Revealed Oppah Is Acting President Of Zimbabwe Rep At Ghana Inauguration",
            "url": "https://www.zimeye.net/2025/01/07/as-zimeye-revealed-oppah-is-acting-president-of-zimbabwe-rep-at-ghana-inauguration/",
            "content": "As the ZimEye news network accurately reported, Defence Minister Oppah Muchinguri isrepresenting the President Of Zimbabwe in Ghana today, instead of Vice President Constantino Chiwenga. (read more)pictures below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "As the ZimEye news network accurately reported, Defence Minister Oppah Muchinguri is representing the President Of Zimbabwe in Ghana today, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/07/as-zimeye-revealed-oppah-is-acting-president-of-zimbabwe-rep-at-ghana-inauguration/\">Continue reading<span class=\"screen-reader-text\"> \"As ZimEye Revealed Oppah Is Acting President Of Zimbabwe Rep At Ghana Inauguration\"</span></a></p>",
            "time": "21:46",
            "date": "08 Jan 2025"
        }
    ]
}