{
    "news": [
        {
            "title": "Angry Zanu PF Supporters Disrupt Party Meeting",
            "url": "https://www.zimeye.net/2024/12/22/angry-zanu-pf-supporters-disrupt-party-meeting/",
            "content": "By Political Reporter- Zanu PF party supporters in Bikita forced the partys Masvingo Provincial chairman, Ezra Chadzamira to adjourn a crucial party meeting after they protested over the sacking of their councillor on allegations of being anti-2030.\n\nThe areas ward 12 councillor, BrightonMushekwa, was issued with a prohibition order for not supporting the ED2030 agenda.\n\nThe meeting in Bikita, where the Zanu PF members were supposed to get free fertiliser, was called off after supporters demanded answers on why their councillor was issued with a prohibition order.\n\nThey said they can only accept the fertiliser distributed by their councillor.\n\nMushekwa, is among the over dozen party officials who have since appeared before the provincial disciplinary committee on allegations of opposing the 2030 agenda and supporting Chiwenga.\n\nChadzamira and his team from Masvingo at the meeting openly accused Mushekwa of getting money from Chiwenge to mobilise party supporters to turn against Mnangagwa.\n\nThe disrupted meeting was attended by district coordinating chairperson Taruona Chomunoda and provincial executive member Simon Muchafa, who rose to fame when his audio recording attacking Chiwenge and retired army general Engelbert Rugeje was leaked in October.\n\nChomunoda demanded questions in writing when contacted for comment.He did not respond to any of the questions.-Standard\n\nIn the audio, Muchafa is heard saying he would not support anyone who doesnt come from Masvingo to take over as president from Mnangagwa.\n\nDelight Mandebvu, the provincial youth chairman, Joulshua Chamisa Ward 23 chairman, Joshua Dhewa (Zanu PF shadow councillor ward 23) also attended the meeting held at Chikukutu turn off on Tuesday.The chairman was addressing people when a group of supporters demanded an explanation on the sacking of Mushekwa, a source who attended the meeting said.The supporters ordered that the fertiliser would not be distributed if their councillor was not there.They said they know the reason why their councillor was sacked and demanded that not even a single bag of fertilisers would be distributed by anyone else.The situation got worse when Chamunoda ordered the police to arrest the supporters, which saw the meeting being called off prematurely. Standard\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- Zanu PF party supporters in Bikita forced the party’s Masvingo Provincial chairman, Ezra Chadzamira to adjourn a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/angry-zanu-pf-supporters-disrupt-party-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Angry Zanu PF Supporters Disrupt Party Meeting\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Video-Networth: ED 10 Billion, Valerio 680 Million Fadzayi Mahere Alleged Boyfriend 150 Million",
            "url": "https://www.zimeye.net/2024/12/22/video-networth-ed-10-billion-valerio-680-million-fadzayi-mahere-boyfriend-150-million/",
            "content": "Shocking Report Unveils Net Worth of Zimbabwes Key Political and Military Figures\n\nA detailed report released by a video analyst, The African, has revealed the alleged net worth of the countrys leading political and military figures. The report sheds light on the massive wealth accumulated by these individuals, many of whom have faced accusations of corruption, mismanagement, and abuse of power.\n\nThe list outlines the top 10 richest politicians in Zimbabwe, placing them alongside the nations wealthiest business figures. Below are the key figures identified in the report:\n\n10. Ozias Bvute  Net Worth: $150 Million\n\nBackground: Member of Parliament for Goromonzi North Constituency and former Managing Director of Zimbabwe Cricket.\n\nSource of Wealth: Allegedly accumulated wealth while serving as wealth manager for the late President Robert Mugabe. Owns extensive land holdings in Harare.\n\nFACTS: Tendai Biti cannot in any way credibly call for an anti Mnangagwa 2030 crusade, after assisting the same dictator to get into 2030 gear, the same way Fadzayi Mahere@advocatemahereis a ZANU-mafia who gets Mnangagwa court support to win an empty defamation court case,https://t.co/xd26CCDWfB\n\n9. Oppah Muchinguri  Net Worth: $250 Million\n\nBackground: Current Minister of Defense and a long-time Zanu PF member.\n\nSource of Wealth: Accused of profiting from elephant sales to China and owning numerous properties and large tracts of land across Zimbabwe.\n\n8. Joram Gumbo  Net Worth: $500 Million\n\nBackground: Former Minister of Transport and Infrastructure Development.\n\nSource of Wealth: Allegedly embezzled funds from the Zimbabwe National Roads Authority and Zimbabwe Airways.\n\n7. Ignatius Chombo  Net Worth: $620 Million\n\nBackground: Former Minister of Finance and Local Government.\n\nSource of Wealth: Accused of acquiring vast tracts of land during his tenure and mismanaging slum clearance projects under Operation Murambatsvina.\n\n6. General Valerio Sibanda  Net Worth: $680 Million\n\nBackground: Commander of the Zimbabwe Defense Forces.\n\nSource of Wealth: Benefited from diamond mining in the Democratic Republic of Congo (DRC) and investments in agriculture and major companies in Zimbabwe.\n\n5. Obert Mpofu  Net Worth: $800 Million\n\nBackground: Long-time cabinet member serving in multiple ministries, including Mines and Mining Development.\n\nSource of Wealth: Owns extensive real estate, hotels, and ranches across Zimbabwe.\n\n4. John Panonetsa Mangudya  Net Worth: $900 Million\n\nBackground: Governor of the Reserve Bank of Zimbabwe.\n\nSource of Wealth: Allegedly gained significant wealth during his tenure as Governor, alongside pre-existing business ventures.\n\n3. Constantino Chiwenga  Net Worth: $3.5 Billion\n\nBackground: Vice President of Zimbabwe and former Army General.\n\nSource of Wealth: Owns several diamond mines and has investments in multiple companies. Alleged misuse of his position for personal enrichment.\n\n2. Grace Mugabe  Net Worth: $5 Billion\n\nBackground: Widow of the late President Robert Mugabe and former First Lady.\n\nSource of Wealth: Took control of the wealth amassed by Robert Mugabe, including properties, businesses, and diamond mines.\n\n1. Emmerson Mnangagwa  Net Worth: $10 Billion\n\nBackground: Current President of Zimbabwe and long-time Zanu PF leader.\n\nSource of Wealth: Holds vast investments in fuel, agriculture, pipelines, and diamond mines. Accused of using his political influence to dominate key industries.\n\nPublic Reaction\n\nThe report has ignited widespread outrage among Zimbabweans, many of whom struggle with poverty and economic instability. Critics argue that the wealth of these political elites has been amassed at the expense of the nation, with allegations of corruption and exploitation tarnishing their reputations.\n\nCalls for Transparency\n\nOpposition leaders and civil society groups are demanding greater transparency and accountability from the government. This report underscores the stark inequalities in our country. The people of Zimbabwe deserve answers, said a spokesperson for a prominent civic organization.\n\nAs the revelations continue to spark debate, the spotlight remains on Zimbabwes leadership to address these allegations and implement measures to curb corruption and ensure equitable distribution of resources.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Shocking Report Unveils Net Worth of Zimbabwe’s Key Political and Military Figures A detailed report released by a video analyst, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/video-networth-ed-10-billion-valerio-680-million-fadzayi-mahere-boyfriend-150-million/\">Continue reading<span class=\"screen-reader-text\"> \"Video-Networth: ED 10 Billion, Valerio 680 Million Fadzayi Mahere Alleged Boyfriend 150 Million\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mnangagwa Aide Booed At Party Meeting",
            "url": "https://www.zimeye.net/2024/12/22/mnangagwa-aide-booed-at-party-meeting/",
            "content": "By Political Reporter- Zanu PF Masvingo Provincial chairman, Ezra Chadzamira was recently forced to adjourn a crucial party meeting in Bikita after party supporters had protested over the sacking of their councillor on allegations of being anti-2030.\n\nThe areas ward 12 councillor, BrightonMushekwa, was issued with a prohibition order for not supporting the ED2030 agenda.\n\nThe meeting in Bikita where the Zanu PF members were supposed to get free fertiliser was called off after supporters demanded answers on why their councillor was issued with a prohibition order.\n\nThey said they can only accept the fertiliser distributed only by their councillor.\n\nMushekwa, is among the over dozen party officials who have since appeared before the provincial disciplinary committee on allegations of opposing the 2030 agenda and supporting Chiwenga.\n\nChadzamira and his team from Masvingo at the meeting openly accused Mushekwa of getting money from Chiwenge to mobilise party supporters to turn against Mnangagwa.\n\nThe disrupted meeting was attended by district coordinating chairperson Taruona Chomunoda and provincial executive member Simon Muchafa, who rose to fame when his audio recording attacking Chiwenge and retired army general Engelbert Rugeje was leaked in October.\n\nChomunoda demanded questions in writing when contacted for comment.He did not respond to any of the questions.-Standard\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- Zanu PF Masvingo Provincial chairman, Ezra Chadzamira was recently forced to adjourn a crucial party meeting in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/mnangagwa-aide-booed-at-party-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Aide Booed At Party Meeting\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Bombshell Valerio Sibanda Letter Written By Kerina Mujati",
            "url": "https://www.zimeye.net/2024/12/22/bombshell-valerio-sibanda-letter-written-by-kerina-mujati/",
            "content": "Controversial Letter by Kerina Mujati Challenges Zimbabwes Leadership and Land Policies\n\nIn a scathing open letter, Zimbabwean activist Kerina Mujati has publicly criticized the countrys leadership, targeting President Emmerson Mnangagwa and raising concerns over land policies and national security. The letter, addressed to General Valerio Sibanda, the Commander of the Zimbabwe Defence Forces, accuses the government of jeopardizing the countrys stability and betraying the core ideals of Zimbabwes liberation struggle.\n\nKey Allegations Raised\n\nMujatis letter highlights several explosive allegations, including:\n\nMismanagement of Land: The letter accuses President Mnangagwa of granting title deeds to foreign entities, including Belarusians and Chinese, while Zimbabweans remain without access to land. Mujati condemns this as a reversal of the liberation wars goals, which were centered on reclaiming land for Zimbabweans.\n\nPrecabe Farm Controversy: The activist claims that Precabe Farm, associated with Mnangagwa, has become a hub for private activities, including arms storage and potential human rights violations. She calls for an investigation into alleged unmarked graves and misuse of the farm as a private military base.\n\nLeadership Betrayal: Mujati asserts that Mnangagwas administration is prioritizing personal and foreign interests over the nations welfare, describing his governance as a pathetic sellout.\n\nCall to Action\n\nThe letter appeals directly to General Sibanda, urging him to prioritize national interests and investigate the claims against Mnangagwa. Mujati questions the militarys allegiance, asking whether it serves the people or remains complicit in supporting Mnangagwas controversial actions.\n\nA Broader Debate\n\nThe allegations have sparked fresh debate about Zimbabwes post-independence land redistribution policies and the role of foreign entities in the countrys economy. Critics of Mnangagwas administration have long accused it of cronyism and undermining the gains of the liberation struggle.\n\nUncertain Consequences\n\nMujatis letter reflects growing frustration among segments of Zimbabwean society with the current leadership. Whether this public outcry will lead to meaningful investigations or reforms remains to be seen. For now, the controversy has amplified tensions over land ownership, governance, and the legacy of the countrys liberation war.\n\nAs the situation develops, all eyes are on General Sibanda and the Zimbabwe Defence Forces to see how they respond to this high-stakes call for accountability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Controversial Letter by Kerina Mujati Challenges Zimbabwe’s Leadership and Land Policies In a scathing open letter, Zimbabwean activist Kerina Mujati … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/bombshell-valerio-sibanda-letter-written-by-kerina-mujati/\">Continue reading<span class=\"screen-reader-text\"> \"Bombshell Valerio Sibanda Letter Written By Kerina Mujati\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Clinton Larsen Resigns as Magesi FC Head Coach",
            "url": "https://www.zimeye.net/2024/12/22/clinton-larsen-resigns-as-magesi-fc-head-coach/",
            "content": "By A Correspondent\n\nClinton Larsen has announced his resignation as head coach of Magesi FC, effective immediately, following a 3-0 loss to the Carling All Stars in the Carling Cup on Saturday at Orlando Stadium.\n\nIn an emotional statement made live on TV, Larsen confirmed, This is my last game as Magesi coach. I am bidding farewell to the club after two years, helping the team get promoted and winning a trophy. Those are two moments I am very proud of. I wish the club all the best moving forward and thank the chairman for giving me the opportunity to lead this team.\n\nUnder Larsens leadership, Magesi achieved promotion to the top-flight league last season and secured the Carling Knockout trophy this campaign, defeating Mamelodi Sundowns 2-1 in the final.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Clinton Larsen has announced his resignation as head coach of Magesi FC, effective immediately, following a 3-0 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/clinton-larsen-resigns-as-magesi-fc-head-coach/\">Continue reading<span class=\"screen-reader-text\"> \"Clinton Larsen Resigns as Magesi FC Head Coach\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Shocking Pictures Of Thokozani Khupe",
            "url": "https://www.zimeye.net/2024/12/22/shocking-pictures-of-thokozani-khupe/",
            "content": "By Political Reporter  Former Deputy Prime Minister Thokozani Khupe made a rare public appearance after maintaining a low profile in recent months due to her ongoing battle with cancer.\n\nKhupe, who recently revealed she is fighting another form of cancer, was seen distributing Christmas gifts to the elderly in Ward 28.\n\nIn a post shared on X (formerly Twitter), she reflected on her day, which included sharing lunch and holiday cheer alongside Councillors Ntando Ndlovu and Siboniso Moyo.\n\nToday (Saturday), I spent a wonderful day with the elderly in Ward 28, including a remarkable 100-year-old, she wrote. We enjoyed lunch together and shared Christmas groceries to bring holiday cheer. Wishing everyone a Merry Christmas and a Happy New Year!\n\nThe former deputy prime minister has been a public advocate for cancer awareness since her initial diagnosis.\n\nToday, I spent a wonderful day with the elderly in Ward 28, including a remarkable 100-year-old, alongside Councillors Ntando Ndlovu and Siboniso Moyo.  We enjoyed lunch together and shared Christmas groceries to bring holiday cheer.  Wishing everyone a Merry Christmas and apic.twitter.com/hAF0dgI6Qb\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter – Former Deputy Prime Minister Thokozani Khupe made a rare public appearance after maintaining a low profile … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/shocking-pictures-of-thokozani-khupe/\">Continue reading<span class=\"screen-reader-text\"> \"Shocking Pictures Of Thokozani Khupe\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Top Musician & War-Vet Predicts The Fall Of Mnangagwa",
            "url": "https://www.zimeye.net/2024/12/22/top-musician-war-vet-predicts-the-fall-of-mnangagwa/",
            "content": "ByShowbiz Reporter-Respected musician and war veteran Clive Malunga, known for his candid views and contributions to Zimbabwean arts and liberation history, has predicted the political downfall of President Emmerson Mnangagwa.\n\nIn a viral video circulating on social media, the Jenaguru Arts Centre founder warns that Mnangagwa might not remain in power for another two years, citing rising discontent within the nation.\n\nMalunga also criticized efforts to extend Mnangagwas rule beyond the constitutional limit of two terms, which ends in 2028.\n\nMnangagwa wont see 2030 or even 2026 because he isnt God, and he wasnt appointed by God to be President of Zimbabwe. Zimbabwe is boiling! declared Malunga.\n\nTati tingobuda pachena@nickmangwanaunotamba iwe uchamhanya hakopic.twitter.com/uk2QHXScxo\n\nMalungas remarks follow his history of sharp criticism against the government.\n\nLast year, he accused the ruling party of hijacking the revolution,taking particular aimat Mnangagwas close association with controversial preacher Passion Java during the 2023 election campaign.\n\nIn another viral clip, Malunga lamented, The revolution has gone to the dogs.\n\nThe government Sunday dismissed Malungas predictions.\n\nSpokesperson Nick Mangwana responded with a veiled jab on social media, mocking Malungas credibility and hinting at alleged links to a losing Zanu PF faction.\n\nMangwana posted on X:\n\nPUZZLE: We have had our fair share of washed-up musicians. Some have had their prime. While others never even had a prime. Some tried to revive their careers by joining a ruling party faction. They joined the wrong one which lost contestation for power and now given to intermittent rants. Who is it?\n\nMalungas bold statements have rekindled public debate about the nations political future amid mounting economic and social challenges.\n\nKnown for his agitating stance, the former liberation fighter remains an influential figure whose wordscontinue toresonate with many Zimbabweans seeking accountability and change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Respected musician and war veteran Clive Malunga, known for his candid views and contributions to Zimbabwean arts and liberation … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/top-musician-war-vet-predicts-the-fall-of-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Top Musician & War-Vet Predicts The Fall Of Mnangagwa\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "I Will Go To Chikurubi If Mnangagwa Stays Beyond 2028: Clive Malunga",
            "url": "https://www.zimeye.net/2024/12/22/i-will-go-to-chikurubi-if-mnangagwa-stays-beyond-2028-clive-malunga/",
            "content": "By A Correspondent\n\nVeteran musician and war hero Clive Malunga has weighed in on the ongoing debate about President Emmerson Mnangagwas political future, stating that the current leader will not remain in power beyond 2028.\n\nMalunga, best known for his hit song Nesango, which speaks about Zimbabwes liberation struggle, made his comments during a recent interview with Change Radio.\n\nHe dismissed the growing speculation about Mnangagwas potential for a 2030 term, saying, Only God the Almighty knows ones fate, not a fellow creature like Mnangagwa. Mr. Mnangagwa is not God. Stop the 2030 mantra, who knows, maybe he will not even go beyond 2026 in office.\n\nMalunga, a war veteran who participated in the liberation struggle in its later stages, boldly declared that if Mnangagwa manages to stay in power beyond 2028, he would be willing to face serious consequences. I vow to be taken to Chikurubi Maximum Prison if Mnangagwa remains in office beyond 2028 he declared.\n\nMalungas remarks add fuel to the ongoing discussions surrounding Mnangagwas leadership and the future of Zimbabwes political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran musician and war hero Clive Malunga has weighed in on the ongoing debate about President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/i-will-go-to-chikurubi-if-mnangagwa-stays-beyond-2028-clive-malunga/\">Continue reading<span class=\"screen-reader-text\"> \"I Will Go To Chikurubi If Mnangagwa Stays Beyond 2028: Clive Malunga\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Avoid Tailgating Always…",
            "url": "https://www.zimeye.net/2024/12/22/avoid-tailgating-always/",
            "content": "Drivers should always maintain a safe following distance, ensuring they do not tailgate or follow another vehicle more closely than is reasonable and prudent. This distance should be determined by factors such as the speed of the vehicles, traffic conditions, and the state of the road.\n\nMany rear-end collisions occur because drivers follow too closely, not allowing enough time to react in case of sudden stops or changes in traffic. Maintaining a safe distance can prevent such accidents and ensure safer driving for everyone on the road.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Drivers should always maintain a safe following distance, ensuring they do not tailgate or follow another vehicle more closely than … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/avoid-tailgating-always/\">Continue reading<span class=\"screen-reader-text\"> \"Avoid Tailgating Always…\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        },
        {
            "title": "Clive Malunga Declares Mnangagwa Won’t Stay in Power Beyond 2028",
            "url": "https://www.zimeye.net/2024/12/22/clive-malunga-declares-mnangagwa-wont-stay-in-power-beyond-2028/",
            "content": "By A Correspondent\n\nVeteran musician and war hero Clive Malunga has weighed in on the ongoing debate about President Emmerson Mnangagwas political future, stating that the current leader will not remain in power beyond 2028.\n\nMalunga, best known for his hit song Nesango, which speaks about Zimbabwes liberation struggle, made his comments during a recent interview with Change Radio.\n\nHe dismissed the growing speculation about Mnangagwas potential for a 2030 term, saying, Only God the Almighty knows ones fate, not a fellow creature like Mnangagwa. Mr. Mnangagwa is not God. Stop the 2030 mantra, who knows, maybe he will not even go beyond 2028 in office.\n\nMalunga, a war veteran who participated in the liberation struggle in its later stages, boldly declared that if Mnangagwa manages to stay in power beyond 2028, he would be willing to face serious consequences. I vow to be taken to Chikurubi Maximum Prison if Mnangagwa remains in office beyond 2028, he declared.\n\nMalungas remarks add fuel to the ongoing discussions surrounding Mnangagwas leadership and the future of Zimbabwes political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran musician and war hero Clive Malunga has weighed in on the ongoing debate about President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/clive-malunga-declares-mnangagwa-wont-stay-in-power-beyond-2028/\">Continue reading<span class=\"screen-reader-text\"> \"Clive Malunga Declares Mnangagwa Won’t Stay in Power Beyond 2028\"</span></a></p>",
            "time": "06:28",
            "date": "23 Dec 2024"
        }
    ]
}