{
    "news": [
        {
            "title": "Missing Boy Found In Matusadonha Game Park",
            "url": "https://www.zimeye.net/2025/01/03/missing-boy-found-in-matusadonha-game-park/",
            "content": "By Hon Mutsa Murombedzi MP\n\nA boy missing & found in Matusadonha Game Park\n\nA true miracle in remote Kasvisva community, Nyaminyami in rural Kariba, a community where one wrong turn could easily lead into a game park.\n\n8-year-old Tinotenda Pudu wandered away, lost direction & unknowingly headed into the perilous Matusadonha Game Park.\n\nAfter 5 long, harrowing days in the jungle near Hogwe River, which feeds into Ume River, the boy has been found alive by the incredible rangers from Matusadona Africa Parks.\n\nHis ordeal, wandering 23km from home, sleeping on a rocky perch, amidst roaring lions, passing elephants, eating wild fruits and just the unforgiving wild is too much for an 8year old.\n\nWe are overwhelmed with gratitude to the brave park rangers, the tireless Nyaminyami community who beat night drums each day to get the boy hear sound & get the direction back home & everyone who joined the search.\n\nAbove all, we thank God for watching over Tinotenda and leading him back home safely. This is a testament to the power of unity, hope, prayer and never giving up @highlight\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Hon Mutsa Murombedzi MP A boy missing & found in Matusadonha Game Park A true miracle in remote Kasvisva … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/missing-boy-found-in-matusadonha-game-park/\">Continue reading<span class=\"screen-reader-text\"> \"Missing Boy Found In Matusadonha Game Park\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Top Zanu PF Official  Praises Ian Smith",
            "url": "https://www.zimeye.net/2025/01/03/top-zanu-pf-official-praises-ian-smith/",
            "content": "By A Correspondent\n\nKiller Zivhu, a former ZANU PF member and ex-Member of Parliament for Chivi South, has expressed admiration for the strategic foresight of Ian Smiths administration, highlighting a key difference between the current government and the colonial-era regime.\n\nZivhu stated that Smith excelled in long-term planning, an area he believes the current ZANU PF government should focus on improving.\n\nTheres a stark difference between us and them, Zivhu remarked. They focused on long-term plans, thinking 100 years ahead, while we tend to concentrate on immediate concerns like Christmas and elections.\n\nZivhu emphasized that the ruling party needs to shift its approach and adopt a more forward-thinking strategy, noting, We need to embrace a more futuristic mindset to bridge the gap.\n\nHis comments come amidst ongoing debates about whether Ian Smiths administration or the current leadership under President Emmerson Mnangagwa has been more effective. While many government officials and ZANU PF supporters have dismissed any comparison between Smith and Mnangagwa as an insult to Zimbabwes liberation struggle, Zivhus remarks suggest a different perspective on governance and planning.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Killer Zivhu, a former ZANU PF member and ex-Member of Parliament for Chivi South, has expressed admiration … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/top-zanu-pf-official-praises-ian-smith/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zanu PF Official  Praises Ian Smith\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Mandla Mpofu Returns Home After Struggling in Botswana Premier League",
            "url": "https://www.zimeye.net/2025/01/03/mandla-mpofu-returns-home-after-struggling-in-botswana-premier-league/",
            "content": "Sports Correspondent\n\nFormer Highlanders head coach Mandla Mpofu has reflected on his time in the Botswana Premier League after his departure from Sua Flamingoes just before the festive season break.\n\nUnlike his compatriots Madinda Ndlovu and the late Rahman Gumbo, who left a lasting legacy in Botswanas top league, Mpofu faced significant challenges in making his mark.\n\nMpofu was dismissed by Sua Flamingoes following a series of disappointing results that saw the team drop to fourth place, with just 13 points from 12 games.\n\nNow back in Zimbabwe, Mpofu is focusing on new opportunities. I had a good time in Botswana. It was a valuable learning experience, and I was happy with the teams environment and the results we achieved. Before my departure, we were in fourth position, 12 points behind the leaders. Now Im back home, supporting Tshisas junior development initiative, Mpofu shared.\n\nBefore his tenure at Sua Flamingoes, the former Highlanders boss also had an unproductive spell with another Botswana club, Masitaoka.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Highlanders head coach Mandla Mpofu has reflected on his time in the Botswana Premier League after his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/mandla-mpofu-returns-home-after-struggling-in-botswana-premier-league/\">Continue reading<span class=\"screen-reader-text\"> \"Mandla Mpofu Returns Home After Struggling in Botswana Premier League\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "The Undertaker Seeks Delay of ZIFA Elections Amid Appeal",
            "url": "https://www.zimeye.net/2025/01/03/the-undertaker-seeks-delay-of-zifa-elections-amid-appeal/",
            "content": "By A Correspondent\n\nThe much-anticipated ZIFA elections, scheduled for January 25, could face a significant delay following reports that one of the disqualified presidential candidates, Benjani The Undertaker Mwaruwari, has filed an appeal with the Court of Arbitration for Sport (CAS).\n\nMwaruwari, along with Walter Magaya, Farai Jere, and Themba Mliswa, was barred from contesting the elections after failing to meet the required eligibility criteria. Mwaruwari, in particular, was disqualified due to not having the necessary five O Levels.\n\nHowever, it is now reported that Mwaruwari has formally appealed this disqualification to CAS, which could lead to the postponement of the elections until the legal process is resolved. If the appeal is upheld, the elections may be delayed until further notice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The much-anticipated ZIFA elections, scheduled for January 25, could face a significant delay following reports that one … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/the-undertaker-seeks-delay-of-zifa-elections-amid-appeal/\">Continue reading<span class=\"screen-reader-text\"> \"The Undertaker Seeks Delay of ZIFA Elections Amid Appeal\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Mnangagwa Friend Listed Among Corrupt Leaders In The World",
            "url": "https://www.zimeye.net/2025/01/03/mnangagwa-friend-listed-among-corrupt-leaders-in-the-world/",
            "content": "By A Correspondent\n\nThe Organized Crime and Corruption Reporting Project (OCCRP) has released its annual report, ranking Kenyan President William Ruto as the second most corrupt leader globally.\n\nThe report, which assesses corruption and organized crime across various governments, has drawn attention to widespread allegations of corruption involving top officials within Rutos administration.\n\nThe OCCRPs findings have raised serious concerns about the extent of corruption within Kenyas political elite, with specific focus on reports of embezzlement, misuse of public funds, and ties to corrupt business practices.\n\nDespite Rutos promises to fight corruption and uphold transparency, his government has been embroiled in multiple scandals, which have tarnished his reputation and raised questions about the effectiveness of his anti-corruption efforts.\n\nThe ranking places Ruto just behind other global figures often associated with corruption, and this development is expected to lead to increased international pressure for accountability in his administration. Critics argue that this high rank highlights the urgent need for comprehensive reforms to address corruption at the highest levels of government in Kenya.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Organized Crime and Corruption Reporting Project (OCCRP) has released its annual report, ranking Kenyan President William … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/03/mnangagwa-friend-listed-among-corrupt-leaders-in-the-world/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Friend Listed Among Corrupt Leaders In The World\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Government Confirms Schools Opening Dates",
            "url": "https://www.zimeye.net/2025/01/02/government-confirms-schools-opening-dates/",
            "content": "By Munacho Gwamanda- The Ministry of Primary and Secondary Education has reaffirmed that schools will officially open for the first term of 2025 onTuesday, January 14, with the term set to conclude onThursday, April 10.\n\nThis clarification follows a wave of misinformation circulating on social media claiming that schools would reopen earlieron Monday, January 6.\n\nIn a press statement issued on December 31, 2024, the Ministry urged the public to disregard these false claims and treat them with the contempt they deserve.\n\nOfficials emphasised that the official school calendar remains unchanged, and no new directives havebeen issued.\n\nThe Ministryextended its gratitude toeducators, parents, guardians, and stakeholders for their unwavering dedication and support throughout 2024.\n\nIt encouraged them to continue demonstrating the same level of commitment in the upcoming academic year.\n\nWhile the Ministry lauded educators for their dedication, it comes against the backdrop of persistent challengesfaced by teachers, including poor remuneration and inadequate working conditions.\n\nTeachers have long decried their low salaries,which areoften eroded by inflation, leaving many struggling to meet basic needs.\n\nDespite these hardships, educators have shown remarkable resilience, continuing to prioritise their duties and deliver quality education to learners.\n\nTeachers have resorted to various means to sustain themselves, with some taking on extra jobs or engaging in small businesses to supplement their meagre incomes.\n\nThishas not deterred their commitment to education, as many remain on the frontlines, ensuring that schools function effectively.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- The Ministry of Primary and Secondary Education has reaffirmed that schools will officially open for the first … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/02/government-confirms-schools-opening-dates/\">Continue reading<span class=\"screen-reader-text\"> \"Government Confirms Schools Opening Dates\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Chivhayo Extends US$5K To A Woman He Embarrassed In Vic-Falls",
            "url": "https://www.zimeye.net/2025/01/02/chivhayo-extends-us5k-to-a-woman-he-embarrassed-in-vic-falls/",
            "content": "By Showbiz Reporter-Controversial businessman and Zanu PF apologist Wicknell Chivhayo has compensated a woman he embarrassed at Victoria Falls International Airport.\n\nDisembarking his private jet alongside his new wife, Chivhayo,  last week began handing out $100 notes to airport staff as a gesture of goodwill during the festive season.\n\nHowever, chaos erupted when non-staff passengers joined the scramble for cash.\n\nAmong the unintended recipients was a woman in a pink top and blue jeans, who was publicly shamed after Chivhayo realized his mistake and denied her further money.\n\nDespite her pleas, the incident, captured on video, went viral. Social media was awash with ridicule, with many questioning her morality for attempting to secure the cash.\n\nFacing public backlash for his handling of the situation, Chivhayo Thursday, took to his X account and issued an apology offering compensation to the humiliated woman.\n\nLabelling her experience a trial turned triumph, Chivhayo announced he had allocated $5,000 as a goodwill gesture to repair her damaged reputation.\n\nIn his post, Chivhayo stated:To this woman, I want you to know that in life, what may seem like a moment of humiliation can become a point of breakthrough Please urgently contact my lawyer, Mr. Sikhumbuzo Mpofu of Munangate & Associates, and collect USD5000 cash for the reputational damage this incident has caused.\n\nChivhayos flamboyant lifestyle and history of contentious dealings have long been under scrutiny.\n\nFrom government contracts to unexplained sources of wealth, his every move seems to stir public debate.\n\nWhile some commend his generosity, others view it as a calculated move to distract from his past controversies.\n\nFor now, the woman at the center of the storm has a chance to turn public ridicule into a tangible win, thanks to an apology steeped in both humility and spectacle.\n\nFrom VICTIM to VICTORYMy attention has been drawn to the UNFORTUNATE CRITICISM directed at the woman in the video circulating on social media, who did not receive USD100 like other airport staff during my recent visit to VICTORIA FALLS. As I prepared to board my private jetpic.twitter.com/syEqdldRMT\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Controversial businessman and Zanu PF apologist Wicknell Chivhayo has compensated a woman he embarrassed at Victoria Falls International … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/02/chivhayo-extends-us5k-to-a-woman-he-embarrassed-in-vic-falls/\">Continue reading<span class=\"screen-reader-text\"> \"Chivhayo Extends US$5K To A Woman He Embarrassed In Vic-Falls\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Anger Management And Road Safety",
            "url": "https://www.zimeye.net/2025/01/02/anger-management-and-road-safety/",
            "content": "Driving requires more than just the physical ability to operate a vehicle; it demands total concentration and a sense of calm. How you feel behind the wheel can significantly impact your safety and that of others on the road. Whether youre feeling relaxed, anxious, or hot-tempered, your emotions affect your judgment, reaction times, and overall driving behavior.\n\nIts essential to recognize the profound influence emotions have on your driving and actively work to control them. Emotional reactions can alter your decision-making process, leading to dangerous maneuvers or poor judgment. For example, anxiety might cause you to overreact or hesitate, while anger could lead to aggressive driving and reckless behavior. Stress can cloud your focus, increasing the likelihood of mistakes.\n\nThe key to maintaining safety on the road lies in emotional regulation. Regardless of the emotional state youre in, never allow your feelings to dictate your actions behind the wheel. Losing control can lead to dangerous situations, not only putting yourself and your passengers at risk but also endangering other drivers and pedestrians.\n\nHere are a few strategies for managing emotions while driving:\n\nBy recognizing the link between emotions and driving behavior, and by taking steps to manage your stress, you can significantly reduce the risk of accidents. Remember, driving is a responsibility that requires a clear mind and a calm demeanor. Never let emotions take the wheel.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :tr*************@gm***.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Driving requires more than just the physical ability to operate a vehicle; it demands total concentration and a sense of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/02/anger-management-and-road-safety/\">Continue reading<span class=\"screen-reader-text\"> \"Anger Management And Road Safety\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Simba Bhora Boss Pulls Out Of ZIFA Polls?",
            "url": "https://www.zimeye.net/2025/01/02/simba-bhora-boss-pulls-out-of-zifa-polls/",
            "content": "Sports Correspondent\n\nSimba Bhora president Simba Buju Ndoro has announced his withdrawal from the ZIFA executive committee elections, which are set to take place on January 25, 2025.\n\nThis decision comes despite Ndoro having successfully passed the ethics and integrity test, a key requirement for candidates seeking positions on the board.\n\nNdoro had initially entered the race for one of the six ordinary board member positions on the ZIFA executive committee, a highly anticipated election that has attracted considerable attention.\n\nHis decision to pull out has raised questions about his future involvement in Zimbabwean football governance.\n\nWhile the reasons behind his withdrawal have not been fully disclosed, it is believed that Ndoro may have reassessed his position or faced challenges that led to his decision.\n\nHis exit leaves a vacancy for one of the board member positions, intensifying the competition among the remaining candidates.\n\nThe ZIFA executive committee election is expected to be a crucial event for the future direction of Zimbabwean football, with several high-profile figures and key players vying for leadership positions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Simba Bhora president Simba “Buju” Ndoro has announced his withdrawal from the ZIFA executive committee elections, which are … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/02/simba-bhora-boss-pulls-out-of-zifa-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Simba Bhora Boss Pulls Out Of ZIFA Polls?\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        },
        {
            "title": "Mnangagwa Ditches War Veterans",
            "url": "https://www.zimeye.net/2025/01/02/mnangagwa-ditches-war-veterans/",
            "content": "By A Correspondent\n\nA recent survey conducted by the Zanu PF Operation Restore Legacy Facebook page has highlighted the governments failure to address the concerns of war veterans, with the performance of War Veterans Minister Monica Mavhunga drawing particularly harsh criticism.\n\nThe survey, published on Wednesday, offers a detailed analysis of her ministrys performance, which has sparked growing dissatisfaction among former liberation fighters and their supporters.\n\nThe evaluation scores given to Minister Mavhungas handling of war veterans issues are alarming. According to the survey, her performance in key areas has been rated poorly, particularly in providing essential support and services to veterans of Zimbabwes liberation struggle. The surveys findings are as follows:\n\nSupport for Veterans: 2/10\n\nAccess to Healthcare for Veterans: 3/10\n\nPension & Financial Support: 2/10\n\nCommunity Reintegration Programs: 0/10\n\nCrisis Response: 1/10\n\nThis results in a dismal overall score of 1.6/10, further illustrating the extent to which war veterans feel neglected by the current administration. The surveys authors also included a direct question to followers: Do you agree???\n\nThis question echoes the frustration of many Zimbabweans who feel that the government has not honored its promises to those who fought for the countrys independence.\n\nThe poor ratings for Minister Mavhunga come amid mounting complaints from war veterans regarding unmet promises and deteriorating conditions. Issues such as lack of healthcare, delayed pension payments, and insufficient community reintegration programs have been persistent concerns for this group.\n\nMany war veterans, who are key supporters of President Emmerson Mnangagwa and his government, are now expressing growing discontent.\n\nThe negative assessment of Mavhungas performance underscores a broader perception that the Mnangagwa administration has failed to meet the expectations of the nations war veterans.\n\nDespite their role in Zimbabwes liberation struggle, veterans have complained about being sidelined in favor of other government priorities, leading some to question the governments commitment to the very people who helped establish the nations independence.\n\nThe surveys damning results reflect a growing rift between the government and war veterans, raising concerns about Mnangagwas leadership and his ability to address the grievances of one of the countrys most important constituencies.\n\nAs war veterans continue to voice their frustrations, the government may be forced to reassess its approach and find more effective ways to honor their sacrifices and support their welfare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A recent survey conducted by the Zanu PF Operation Restore Legacy Facebook page has highlighted the government’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/02/mnangagwa-ditches-war-veterans/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ditches War Veterans\"</span></a></p>",
            "time": "08:35",
            "date": "03 Jan 2025"
        }
    ]
}