{
    "news": [
        {
            "title": "Struggling Air Zimbabwe In US$1 Million Debt Clearance",
            "url": "https://www.zimeye.net/2025/07/03/struggling-air-zimbabwe-clears-us1-million-debt/",
            "content": "By BusinessReporter-The struggling national airliner,Air Zimbabwesaidit had cleared its over US$1 million to key international service providers.\n\nThis development will see Air Zimbabwe re-joining global ticketing and code-sharing platforms, hence boosting passenger numbers and the airlines international footprint.\n\nSpeaking on the development in Victoria Falls this Tuesday, Air Zimbabwe Chief Executive Officer,MrEdmund Makona,said the airline identified global visibility as a critical business enabler in its turnaround plan.\n\nWe asked ourselves: whats on the critical path to our revival? Visibility on global selling platforms was top. Without it, we couldnt do code-sharing or interlining. Now, with shareholder support, we have cleared most of the debt, said Mr Makona.\n\nMr Makona confirmed that Air Zimbabwe is now integrating its systems with global distribution networks, the backbone of international travel bookings.\n\nThe integration process is expected to takeaboutthree months or lessandoncecompleted, passengers worldwide will once again be able to book Air Zimbabwe flights through any travel agent or partner airline.\n\nRejoining code-sharing platforms also means Air Zimbabwe flights can now be sold through partner carriers globally, improving access to Zimbabwes major tourist destinations and boosting arrivals.\n\nTourism experts have welcomed the move, noting its significance in enhancing Zimbabwes visibility and competitiveness as a destination.\n\nThat is a big leap in the right direction.Its aseriousenabler of increased inboundtravelby tourists.This new chapter in national colours is something to celebrate. We are confident Air Zimbabwe will become one of the airlines of choice. With immigration now fully online, we anticipate a surge in international tourist arrivals, said Mr Clement Mukwasi, a tourism executive.\n\nWith renewed partnerships and system upgrades underway, Air Zimbabwe is preparing for a stronger presence on the global aviation map.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter- The struggling national airliner, Air Zimbabwe said it had cleared its over US$1 million to key international service providers. This development will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/struggling-air-zimbabwe-clears-us1-million-debt/\">Continue reading<span class=\"screen-reader-text\"> \"Struggling Air Zimbabwe In US$1 Million Debt Clearance\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "‘Daddy’ Pastor Walter Masocha Convicted of Sexual Abuse After Competing with Journalist Over Same Victim",
            "url": "https://www.zimeye.net/2025/07/03/daddy-pastor-walter-masocha-convicted-of-sexual-abuse-after-competing-with-journalist-over-same-victim/",
            "content": "STIRLING, SCOTLAND  By A Correspondent | ZimEye | Disgraced preacher Walter Masocha, founder of the Agape for All Nations Ministries International, has been convicted of multiple sexual offences after a chilling trial revealed years of exploitation disguised as deliverance.\n\nMasochawho once competed (as it were) with Zimbabwean journalist Hopewell Chinono for the attention and trust of the same complainant during trial in 2014, used his spiritual authority to molest, manipulate, and attempt to rape women in his congregation under the pretense of casting out demons and fulfilling Gods will.\n\nThe 61-year-old was found guilty of attempted rape, indecent assault, and sexual assault at the High Court in Livingston, relating to a series of incidents that took place between 2006 and 2012 at properties in and around Stirling.\n\nGod Has Given You to Me\n\nOne victim, now 39, testified that Masocha began abusing her when she was just 20. Referring to him as Dad or Daddy, she said he used spiritual language to groom and violate her, claiming divine instruction to care for her intimately.\n\nGod has given you to me to nurture you, look after you, and love you in any way you want to be loved, she recalled him saying.\n\nShe described being groped during church surgeries, kissed by force, slapped on the bottom, and in one instance, nearly raped in his bedroom before managing to escape. On another occasion, Masocha guided her hand onto his erect penis while fully clothed, during a private session at his Sauchieburn mansion.\n\nCompeting Daddies for the Same Victim.\n\nOne of the victims trust and vulnerability was not only exploited by Masocha. Evidence and testimonies reveal that high-profile journalist Hopewell Chinono also portrayed himself as a Daddy figure toward the same woman, creating an emotionally manipulative environment of religious and psychological dominance.\n\nWhile Chinono has not been charged with any offence, the courtroom revelations cast light on a disturbing pattern outside: two influential Zimbabwean men vying for control over the same vulnerable womaneach presenting himself as a saviour, protector, or father figure, only to cause further emotional trauma.\n\nPretending to Remove Demons\n\nAnother woman, now 58, testified that Masocha had also molested her approximately 20 years ago. She said he claimed she was a gift from God and that he was removing demons from her by placing his hand in her underwear and groping her genitals.\n\nHe said God had told him to kiss me to bless me through his holy lips, she said.\n\nHer husband told the court that when they confronted Masocha in accordance with Zimbabwean tradition, the preacher fell to the floor and asked for prayer, saying, Im sorry. I loved you too much.\n\nRepeat Predator.\n\nMasocha was previously convicted in 2015 for sexually assaulting a woman and groping a schoolgirl during church sessions. In that case, he also claimed to be removing demons. The conviction was later quashed on appeal due to procedural errors (that happened after the other Daddy character, Hopewell Chinono had encroached the main complainant for an affair disguised as a news interview), but the latest guilty verdicts leave no doubt about his pattern of abuse.\n\nJudge Susan Craig remanded Masocha in custody ahead of sentencing scheduled for July 28, calling his actions appalling and warning that a custodial sentence is inevitable. A risk assessment is also underway to determine whether he qualifies for an extended sentence due to the danger he poses to the public.\n\nWalter Masocha wasnt just a pastor and a preacher. He was a predator who thought that his power and position rendered him immune from suspicion, said lead prosecutor Michael McIntosh.\n\nJournalists social media supporters mislabelled complainant.\n\nThroughout the periods since the 2014 hearings, one of the elderly complainants was labelled a mad person by the Daddy character Hopewell Chinonos online supporters. But she was not at all insane, says one complainant whos now an adult. She says: a lot of you ask me why am I talking about this now? Why did I not talk about this when it happened? When it happened? I wont talk about it because I think of the time there was a lady who came up and spoke about it and people said that the devil speaking about speaking to her she lying you know shes probably shes angry or something And Lady In because I feel like it was a cold and we were like brainwashed to believe this person this one man so I never spoke about never spoke about my experience because I didnt think anybody would believe me because Woman who told her truth and we didnt believe her.\n\nFrom Archbishop to Sex Offender.\n\nMasocha, a ZAOGA pastor, and a former accountancy lecturer at the University of Stirling, founded his church in 2007 and quickly grew it into a global ministry with over 2,000 members across the UK, US, Canada, and parts of Africa. He awarded himself the title of Archbishop and drew a salary comparable to the Archbishop of Canterbury.\n\nBut behind the titles and televised sermons was a man abusing power, hiding behind God, and taking advantage of vulnerable women looking for prayer and healing.\n\nSupport Services: If you or someone you know has been affected by abuse in a religious setting, please contact local safeguarding services or support hotlines in your area.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "STIRLING, SCOTLAND — By A Correspondent | ZimEye | Disgraced preacher Walter Masocha, founder of the Agape for All Nations … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/daddy-pastor-walter-masocha-convicted-of-sexual-abuse-after-competing-with-journalist-over-same-victim/\">Continue reading<span class=\"screen-reader-text\"> \"‘Daddy’ Pastor Walter Masocha Convicted of Sexual Abuse After Competing with Journalist Over Same Victim\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "South Africa’s Former Deputy President Dies",
            "url": "https://www.zimeye.net/2025/07/03/south-africas-former-deputy-president-dies/",
            "content": "By A Correspondent\n\nFormer Republic of South Africa Deputy President David Mabuza has died at the age of 64.\n\nMabuza passed away in hospital on Wednesday after battling a long illness, his family confirmed in a brief statement.\n\nIt is with great sadness that we announce the passing of our beloved David Dabede Mabuza. He died peacefully after a prolonged illness surrounded by close family, the statement read.\n\nMabuza served as South Africas Deputy President from 2018 to 2023 under President Cyril Ramaphosa and played a key role in the African National Congress (ANC). Known for his influence within the ruling party and often referred to as The Cat for his political survival skills, Mabuza remained a pivotal figure in South African politics even after stepping down from active government duties.\n\nMessages of condolence have started pouring in from across the political spectrum, with the ANC saying, Comrade Mabuzas contribution to the ANC and to the countrys democratic project cannot be overstated. His passing is a great loss to the movement and the nation.*\n\nDetails regarding funeral arrangements will be announced in due course, the family said.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Republic of South Africa Deputy President David Mabuza has died at the age of 64. Mabuza … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/south-africas-former-deputy-president-dies/\">Continue reading<span class=\"screen-reader-text\"> \"South Africa’s Former Deputy President Dies\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "LIVE: Tagwireyi Heads Home After Being Chucked Out Of ZANU Central Committee Meeting",
            "url": "https://www.zimeye.net/2025/07/03/live-tagwireyi-heads-home-after-being-chucked-out-of-zanu-central-committee-meeting/",
            "content": "video loading below\n\n@ZimEyeits not genuine to say Elon was appointed after years of lobbying, what is wrong with co-option after using his influence to lobby?\n\nThe tenderpreneur Kuda Tagwirei has been kicked out of a@ZANUPF_OfficialCentral Committee meeting. Impeccable sources who spoke to Simba Chikanza@schikanzaconfirmed the development, the first of its kind in less than 2 months after a string of nation-shaking events thathttps://t.co/vFfntY70HCpic.twitter.com/h6AFcKR4SJ\n\nThe tenderpreneur Kuda Tagwirei has been kicked out of a @ZANUPF_OfficialCentral Committee meeting. Impeccable sources who spoke to Simba Chikanza @schikanza confirmed the development, the first of its kind in less than 2 months after a string of nation-shaking events that began when anti corruption war veteran @BlessedGeza announced a threat to tenderpreneurs and some military generals accused of obtaining bribes.\n\nTagwirei was booted during the meeting in an emotive instruction issued by Vice President Constantino Chiwenga, just after 1pm, a source speaking on condition of anonymity further confirmed to ZimEye.\n\nCalls to the man for a comment were not responded to. Other calls to central committee members failed as they were still locked up.\n\nThe incident happens a day after several his motor vehicle donations to members of the politburo were blocked yesterday by the VP Chiwenga.\n\nThe incident suggests a major rift, the first of its kind visibly suggesting that President Mnangagwas attempts to make Tagwirei a Central Committee member have been blocked, as previously reported by ZimEye yesterday.\n\nZANU PF Director @marapira_farai did not respond to requests for comment.\n\nThe ZANU PF spokesman Chris Mutsvangwa was reached comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below The tenderpreneur Kuda Tagwirei has been kicked out of a @ZANUPF_OfficialCentral Committee meeting. Impeccable sources who spoke … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/live-tagwireyi-heads-home-after-being-chucked-out-of-zanu-central-committee-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"LIVE: Tagwireyi Heads Home After Being Chucked Out Of ZANU Central Committee Meeting\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "Real Madrid CF Mourn Liverpool Star Diogo Jota",
            "url": "https://www.zimeye.net/2025/07/03/real-madrid-cf-mourn-liverpool-star-diogo-jota/",
            "content": "Sports Correspondent\n\nSpanish La Liga giants Real Madrid have released an official statement mourning the tragic death of Liverpool forward Diogo Jota and his brother Andr Silva, who both died in a car accident in Spain on Thursday morning.\n\nReal Madrid C. F., its president and Board of Directors are deeply saddened to learn of the passing of Liverpool FC player Diogo Jota and his brother Andr Silva, who played for F. C. Penafiel, the club said.\n\nIn the heartfelt statement, the 15-time European champions extended their condolences to the grieving families and the clubs affected by the tragedy.\n\nReal Madrid expresses its condolences and support to their family, loved ones and teammates at their respective clubs. Real Madrid shares in the deep sorrow felt by the footballing world. May they rest in peace, the club concluded.\n\nThe football world has been left in shock by the sudden loss of two young talents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Spanish La Liga giants Real Madrid have released an official statement mourning the tragic death of Liverpool forward … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/real-madrid-cf-mourn-liverpool-star-diogo-jota/\">Continue reading<span class=\"screen-reader-text\"> \"Real Madrid CF Mourn Liverpool Star Diogo Jota\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "FC Platinum Captain Brian Banda Laid to Rest in Bulawayo",
            "url": "https://www.zimeye.net/2025/07/03/fc-platinum-captain-brian-banda-laid-to-rest-in-bulawayo/",
            "content": "Sports Correspondent\n\nFC Platinum captain Brian Banda, who tragically died in a road accident was laid to rest on Thursday at West Park Cemetery in Bulawayo.\n\nBorn on September 9, 1995, at Luveve Clinic in Bulawayo, Banda attended Rosecamp Primary School before moving on to Milton High School and later Entumbane High School.\n\nHis football journey began with local clubs H.R.M. and Ajax Hotspurs Juniors, where he quickly showed promise.\n\nBrian passed away on June 29, 2025, following a fatal accident along the Zvishavane-Filabusi Road, cutting short a promising football career and a life admired by many in Zimbabwes sporting community.\n\nBanda rose to prominence in the Zimbabwe Premier Soccer League, making his professional debut for Highlanders in 2016. He came on as a second-half substitute for King Nadolo in Matchday 5 against Chapungu Uniteda match Highlanders won 1-0.\n\nOver his time with Highlanders, Banda became a fan favorite, known for his work ethic and consistency. He scored eight league goals and featured in 117 matches across all competitions99 league appearances and 18 in cup games. Despite occasional setbacks, he won three trophies with the club and carved a legacy as one of the teams key midfielders.\n\nAt the end of the 2020 season, Banda transferred to FC Platinum. He made an immediate impact, scoring on his debut in a 6-1 victory over Tenax CS in the opening match of the 2021 season. He went on to earn 114 caps for the club, scoring six goalsfive in league matches and one in a cup competition.\n\nOne of the highlights of his FC Platinum career came on Matchday 11 of the 2024 season when he made his 100th league appearance in a 1-1 draw against his former team, Highlanders.\n\nBeyond his club career, Banda also represented Zimbabwe at the international level, earning nine caps for the senior national team.\n\nBrian Banda leaves behind a legacy of dedication, leadership, and professionalism both on and off the pitch.\n\nHis untimely death is a significant loss to Zimbabwean football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent FC Platinum captain Brian Banda, who tragically died in a road accident was laid to rest on Thursday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/fc-platinum-captain-brian-banda-laid-to-rest-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"FC Platinum Captain Brian Banda Laid to Rest in Bulawayo\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "BREAKING: Tagwirei Kicked Out Of Central Committee Meeting",
            "url": "https://www.zimeye.net/2025/07/03/breaking-tagwirei-kicked-out-of-central-committee-meeting/",
            "content": "The tenderpreneur Kuda Tagwirei has been kicked out of a @ZANUPF_OfficialCentral Committee meeting. Impeccable sources who spoke to Simba Chikanza @schikanza confirmed the development, the first of its kind in less than 2 months after a string of nation-shaking events that began when anti corruption war veteran @BlessedGeza announced a threat to tenderpreneurs and some military generals accused of obtaining bribes.\n\nTagwirei was booted during the meeting in an emotive instruction issued by Vice President Constantino Chiwenga, just after 1pm, a source speaking on condition of anonymity further confirmed to ZimEye.\n\nCalls to the man for a comment were not responded to. Other calls to central committee members failed as they were still locked up.\n\nThe incident happens a day after several his motor vehicle donations to members of the politburo were blocked yesterday by the VP Chiwenga.\n\nThe incident suggests a major rift, the first of its kind visibly suggesting that President Mnangagwas attempts to make Tagwirei a Central Committee member have been blocked, as previously reported by ZimEye yesterday.\n\nZANU PF Director @marapira_farai did not respond to requests for comment.\n\nThe ZANU PF spokesman Chris Mutsvangwa was reached comment.\n\nThe tenderpreneur Kuda Tagwirei has been kicked out of a@ZANUPF_OfficialCentral Committee meeting. Impeccable sources who spoke to Simba Chikanza@schikanzaconfirmed the development, the first of its kind in less than 2 months after a string of nation-shaking events thathttps://t.co/vFfntY70HCpic.twitter.com/h6AFcKR4SJ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The tenderpreneur Kuda Tagwirei has been kicked out of a @ZANUPF_OfficialCentral Committee meeting. Impeccable sources who spoke to Simba Chikanza … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/breaking-tagwirei-kicked-out-of-central-committee-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Tagwirei Kicked Out Of Central Committee Meeting\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "Farming: What Is Dystocia?",
            "url": "https://www.zimeye.net/2025/07/03/farming-what-is-dystocia/",
            "content": "By Dr. Trywell Muzerengi\n\nDefinition:Dystocia refers to difficult or abnormal labor, where an animal is unable to give birth naturally without human assistance. This condition is commonly observed in domestic animals such as cows, goats, and sheep.\n\nCommon Causes of Dystocia:\n\nSigns of Dystocia:\n\nProlonged straining without progress\n\nVisible fetal parts with no advancement\n\nRepeated restlessness, lying down, and getting up\n\nNo delivery after 23 hours of active labor\n\nFirst Aid / On-Farm Management:\n\nPrevention Tips:\n\nProvide balanced and adequate nutrition during pregnancy\n\nUse appropriate breeding stock to reduce the risk of oversized fetuses\n\nClosely monitor animals as they approach parturition\n\nBe ready to assist at the first sign of complications\n\nProper understanding and timely management of dystocia can save both the mother and offspring. Always seek veterinary support when in doubt to ensure the best outcome.\n\nlasmuzagrosolutions@gmail.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Definition:Dystocia refers to difficult or abnormal labor, where an animal is unable to give birth naturally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/farming-what-is-dystocia/\">Continue reading<span class=\"screen-reader-text\"> \"Farming: What Is Dystocia?\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "Zvigananda Destroying Nation, Gorimbo Continues Sparring With Zanu PF Varakashi",
            "url": "https://www.zimeye.net/2025/07/03/zvigananda-destroying-nation-gorimbo-continues-sparring-with-zanu-pf-varakashi/",
            "content": "By A Correspondent\n\nZimbabwean UFC fighter Themba Gorimbo has once again ignited political controversy, openly criticizing ZANU PF loyalists, accusing them of destroying opportunities for ordinary citizens and blocking progress in Zimbabwe.\n\nIn a statement shared on his official social media platforms on Wednesday, Gorimbo called out the so-called Zviganandaa derogatory slang term referring to ZANU PF-connected elites and their close associatesblaming them for the ongoing brain drain and economic hardship that has forced millions of Zimbabweans to remain in foreign countries.\n\nAre you a Zimbabwean and living in South Africa but circumstances dont allow you to go back home? Gorimbo asked his followers. Say yes if you are and your reason not to go home. Lets see how people actually feel. Voice of the voiceless.\n\nHe went on to address the diaspora more broadly:Are you a Zimbabwean in any foreign land but wish to go back home? What is not allowing you to go home vana vamai?\n\nSwitching to a mix of Shona and English, the UFC fighter spoke of his own desire to contribute to Zimbabwes development, but expressed frustration over the lack of meaningful opportunities and political interference:\n\nNeniwo ndotoda kundo trenera Zimbabwe ndichiuya kuno kuzorova vanhu ndodzokera kanyi ndeindo tovewa ndiri kumba, he wrote. But ha ma1. Kutojadhira uri kuno plus ma opportunity for vana because paZimbabwe ma opportunity asarira zvigananda nevana vazvo. Nevamwe vano benefiter by association.\n\nTranslation: Even I would love to train in Zimbabwe, go compete abroad and return home, just like anyone else. But its tough. Life outside is expensive, and opportunities for the youth back home have been monopolised by these Zvigananda and their associates.\n\nGorimbos remarks have drawn sharp backlash from ZANU PF hardliners and online defenders, known as Varakashi, who quickly labelled him unpatriotic and accused him of using his platform to attack the ruling party. Some warned him to stay out of Zimbabwean politics and focus on fighting in the cage.\n\nHowever, Gorimbos supporters have rallied behind him, applauding his bravery for speaking truth to power. Many Zimbabweans across the diaspora echoed his sentiments in the comment sections, sharing stories of blocked dreams and the longing to return homeif only conditions improved.\n\nDespite the criticism, Gorimbo has not backed down, positioning himself as the voice of the voiceless and vowing to continue raising uncomfortable truths.\n\nHis remarks reflect a growing tension between politically-connected elites and the broader populationparticularly the youth and professionals in the diasporawho feel shut out of Zimbabwes political and economic system.\n\nWhether his outspokenness will attract further political backlash or inspire wider discourse, one thing is certain: Themba Gorimbo is not pulling any punchesinside or outside the ring.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean UFC fighter Themba Gorimbo has once again ignited political controversy, openly criticizing ZANU PF loyalists, accusing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/zvigananda-destroying-nation-gorimbo-continues-sparring-with-zanu-pf-varakashi/\">Continue reading<span class=\"screen-reader-text\"> \"Zvigananda Destroying Nation, Gorimbo Continues Sparring With Zanu PF Varakashi\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "“We Care,” Says Mnangagwa, But Zimbabweans Ask: Where Is the Care When We Are Suffering Daily?",
            "url": "https://www.zimeye.net/2025/07/03/we-care-says-mnangagwa-but-zimbabweans-ask-where-is-the-care-when-we-are-suffering-daily/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has once again repeated his administrations familiar promise of caring for the peopledespite growing public frustration over widespread poverty, unemployment, and deteriorating public services across the country.\n\nAddressing the 384th Ordinary Session of the ZANU PF Politburo in Harare on Wednesday, Mnangagwa celebrated the partys recent by-election victories in Matabeleland South, Matabeleland North, Manicaland, and Masvingo provinces.\n\nI congratulate Matabeleland South, Matabeleland North, Manicaland and Masvingo Provinces for securing decisive victories for our Party in the recently held Parliamentary and local authority by-elections, he said.\n\nHe claimed the results reflect the ruling partys continued popularity and the impact of what he described as people-centered policies.\n\nThe overwhelming success in these elections continues to attest to the strength of our grassroots mobilisation strategies and the popularity of our people-centered policies. Makorokoto, Amhlophe, Mnangagwa declared.\n\nBut as he praised electoral outcomes and claimed growing support for the government, millions of ordinary Zimbabweans continue to grapple with crippling inflation, meager salaries, collapsing healthcare, and chronic shortages of basic services.\n\nOur people-centered development programmes and projects across every sector [are] gaining the support and appreciation of the citizens, said Mnangagwa. Government, on its part, will continue to prioritize the capacitation and resourcing of our Government Ministries, Departments and Agencies to sustain the momentum of high-impact programmes and projects.\n\nHowever, many citizens took to social media to express disbelief, with some accusing the president of being out of touch with the reality on the ground.\n\nThere is no electricity, water is a luxury, hospitals are broken, and people cant afford a loaf of bread. Where exactly is this care? one online user posted.\n\nWhile Mnangagwa continues to repeat we care rhetoric in political forums, many Zimbabweans feel that these words are not backed by tangible actions to improve livelihoods. As the ruling party sets its sights on consolidating political power, the gap between official narratives and daily survival continues to widen.\n\nFor now, the promises of high-impact programmes offer little comfort to those struggling to get through each dayand many are left wondering when, if ever, the suffering will end.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has once again repeated his administration’s familiar promise of caring for the people—despite growing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/03/we-care-says-mnangagwa-but-zimbabweans-ask-where-is-the-care-when-we-are-suffering-daily/\">Continue reading<span class=\"screen-reader-text\"> \"“We Care,” Says Mnangagwa, But Zimbabweans Ask: Where Is the Care When We Are Suffering Daily?\"</span></a></p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        }
    ]
}