{
    "news": [
        {
            "title": "Harare Comes Alive as DeMbare Win Ignites Excitement",
            "url": "https://www.zimeye.net/2025/03/31/harare-comes-alive-as-dembare-win-ignites-excitement/",
            "content": "Sports Correspondent\n\nDynamos finally recorded their first victory of the 2025 Castle Lager Premier Soccer League season, defeating defending champions Simba Bhora 1-0 on Sunday.\n\nAfter drawing their first three games, the Glamour Boys secured a crucial win courtesy of Shadreck Nyahwas decisive strike in the second half. Notably, this goal marked the first time Simba Bhora have conceded this season.\n\nThe win propelled Dynamos to sixth place in the standings with six points, while Simba Bhora dropped to eleventh position. This victory is expected to ignite the teams momentum as they strive to climb the ranks in the Premier Soccer League.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos finally recorded their first victory of the 2025 Castle Lager Premier Soccer League season, defeating defending champions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/harare-comes-alive-as-dembare-win-ignites-excitement/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Comes Alive as DeMbare Win Ignites Excitement\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "WATCH LIVE: Geza, War Veterans Address Zimbabweans After Army Blocked By Demonstrators",
            "url": "https://www.zimeye.net/2025/03/31/watch-live-geza-war-veterans-address-zimbabweans-after-army-blocked-by-demonstrators/",
            "content": "Video loading below.\n\nWar Veterans leadership are addressing Zimbabweans after protesters managed to repel police and army in Harare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Video loading below…. War Veterans’ leadership are addressing Zimbabweans after protesters managed to repel police and army in Harare.",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "Andy Rinomhota’s Brother Dies",
            "url": "https://www.zimeye.net/2025/03/31/andy-rinomhotas-brother-dies/",
            "content": "Sports Correspondent\n\nThe Zimbabwean football community is mourning the loss of Joseph Itai, the brother of Warriors international Andy Rinomhota. Joseph, 30, tragically passed away after sustaining injuries during a Muay Thai boxing match in Thailand.\n\nAccording to reports, Joseph was participating in his first Muay Thai fight when he received a fatal kick to the ribs. He collapsed shortly after leaving the ring and was pronounced dead.\n\nAndy Rinomhota took to Instagram to pay a heartfelt tribute to his brother, saying, My love for you will never fade, and your memory will forever be etched in my heart.\n\nThe Zimbabwe Football Association (ZIFA) has also extended its condolences to Andy and his family, saying, We stand in solidarity with Andy during this profound sorrow May the cherished memories of his brother bring him comfort.\n\nCardiff City, Andys club, has also offered their support, stating, Our thoughts and love are with Andy Rinomhota and his family We are all with you, Andy.\n\nThe football community is rallying around Andy during this difficult time, offering their condolences and support as he comes to terms with the loss of his beloved brother.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwean football community is mourning the loss of Joseph Itai, the brother of Warriors international Andy Rinomhota. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/andy-rinomhotas-brother-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Andy Rinomhota’s Brother Dies\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "Tycoon Philip Mataranyika’s Marriage Collapses Amid Infidelity Allegations",
            "url": "https://www.zimeye.net/2025/03/31/tycoon-philip-mataranyikas-marriage-collapses-amid-infidelity-allegations/",
            "content": "By A Correspondent| Philip Mataranyika, co-founder of Nyaradzo Group, has reportedly separated from his wife, Mavis, after years of marriage due to irreconcilable differences, sources close to the family have revealed.\n\nThe couple, once regarded as a model of success and stability, allegedly parted ways following claims of infidelity on Mataranyikas part. According to insiders, he was involved with female family friends, a discovery that ultimately led Mavis to end the marriage despite undergoing extensive counseling in an attempt to salvage their relationship.\n\nNyati had been unfaithful to Maiguru for several years, a family source disclosed. He even had affairs with well-known female business associates.\n\nSources indicate that Mataranyika has since relocated to the United Kingdom, where he is reportedly living with a woman of mixed race.\n\nHe is now in a relationship with a colored woman and has built Mavis a mansion in Goromonzi, where she is currently engaged in horticulture, said an anonymous insider.\n\nAlthough Mataranyika has largely maintained a low profile, his name was previously linked to socialite and former Nyaradzo international brand ambassador, Madame Boss. The connection was brought to light in controversial claims by whistleblower Tatelicious after Madame Bosss abrupt removal from the ambassadorial role.\n\nThe estranged couple shares three childrenNigel, Tapiwa, and Tendekaiwho have witnessed their parents rise from modest beginnings to the helm of a multimillion-dollar business empire.\n\nThe financial implications of the separation remain undisclosed, including the specifics of Maviss divorce settlement. The couples wealth spans across multiple ventures, including Calundike Exports and Eureka Finance, businesses reportedly built from Mataranyikas earnings during his decade-long tenure at Old Mutual.\n\nMeanwhile, tensions are said to be mounting within Nyaradzo Groups leadership. Co-founders Farai Rwodzi and his uncle, Timothy Chiganze, are allegedly unhappy with Mataranyikas unilateral decision-making, particularly regarding diaspora investments.\n\nAttempts to reach Mataranyika and Mavis for comment were unsuccessful, as both remained unreachable at the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Philip Mataranyika, co-founder of Nyaradzo Group, has reportedly separated from his wife, Mavis, after years of marriage … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/tycoon-philip-mataranyikas-marriage-collapses-amid-infidelity-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Tycoon Philip Mataranyika’s Marriage Collapses Amid Infidelity Allegations\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "COS Scammer Exposed By BBC Africa Eye",
            "url": "https://www.zimeye.net/2025/03/31/cos-scammer-exposed-by-bbc-africa-eye/",
            "content": "\"If I had known there was no job, I would not have come here.\"#BBCAfricaEyegoes undercover to expose the UK immigration scammers preying on the hopes of aspiring African migrants. Watch the film: 'Stranded: Exposing the UKs immigration scammers':https://t.co/pPaOPphL4ppic.twitter.com/6JNxCxaBXt\n\nSecret filming shows brazen tactics of UK immigration scammers.https://t.co/FEU80XoweM\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "Drunk Hwindi Says Will Stand With Troubled ED",
            "url": "https://www.zimeye.net/2025/03/31/drunk-hwindi-says-will-stand-with-troubled-ed/",
            "content": "A Harare tout has declared he is ready to stand with the troubled Zanu PF leader Mr Emmerson Mnangagwa as political tension rises in Zimbabwe.\n\nSaka he is defending President ari one ? Where is Fasto , Tino  nevamwe?pic.twitter.com/tXQyFQR6kn\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Harare tout has declared he is ready to stand with the troubled Zanu PF leader Mr Emmerson Mnangagwa as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/drunk-hwindi-says-will-stand-with-troubled-ed/\">Continue reading<span class=\"screen-reader-text\"> \"Drunk Hwindi Says Will Stand With Troubled ED\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "Undercover Soldiers, Riot Police Flood Harare",
            "url": "https://www.zimeye.net/2025/03/31/undercover-soldiers-riot-police-flood-harare/",
            "content": "By Munacho Gwamanda- The panicking President Emmerson Mnangagwa government Monday deployed undercover military intelligence agents and riot police in Harares Central Business District (CBD) and crush any individuals suspected to be part of todays planned national shutdown.\n\nThe directive comes in response to growing public discontent fueled by war veteran Blessed Geza, whose recent scathing remarks against President Emmerson Mnangagwas administration have galvanized opposition supporters.\n\nGeza has beenvocal in calling for mass protests against Mnangagwas leadership, citing economic mismanagement, rampant corruption, and a worsening human rights record.\n\nHis latest outburst, which went viral on social media, directly accused the ruling Zanu PF of presiding over a dictatorship and called on Zimbabweans to reclaim their country through peaceful demonstrations.\n\nAmid fears of widespread unrest, the state took a drastic step on Sunday, recalling security personnel from leave at the eleventh hour and ordering them to report for duty immediately.\n\nSoldiers who spoke toNewsDayyesterday revealed that they hadbeen givenstrict instructions to report for duty by 9 AMat the latestafter receiving recall notices via phone calls.\n\nSources further disclosed that security forces hadbeen placedon 100% standby for a five-minute move.\n\nThis means that everyone will be on duty and ready to react within five minutes if there is a call, a source said. Several officers who were on leave were called back and ordered to report for duty. Some had ignored previous calls made about a fortnight ago, but today (yesterday), everyone hasbeen directedto cut short their leave and return to their posts.\n\nGovernmentsheavy-handed response signals its determination to suppressany form ofdissent, as authorities remain wary of growing opposition sentiment.\n\nPrevious protests havebeen metwith brutal crackdowns, and todays demonstrationsare expectedto be no different.\n\nDespite the intimidation tactics, opposition activists insist they will proceed with the demonstrations, accusing Mnangagwas government of using state machinery to silence dissent.\n\nThe coming hours will reveal whether the security clampdown will deter protestors or embolden them further in their defiance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- The panicking President Emmerson Mnangagwa government Monday deployed undercover military intelligence agents and riot police in Harare’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/undercover-soldiers-riot-police-flood-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Undercover Soldiers, Riot Police Flood Harare\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "Teachers Union “Endorses” M31 Protests",
            "url": "https://www.zimeye.net/2025/03/31/teachers-union-endorses-m31-protests/",
            "content": "By A Correspondent\n\nThe Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has expressed strong support for the March 31 protests, advising both teachers and students to stay home on the day due to concerns over safety.\n\nIn a statement issued ahead of the protests, ARTUZ highlighted the security risks posed by the widespread deployment of security forces across the country.\n\nThe union, which represents teachers, emphasized that the safety of both educators and learners could not be guaranteed under such conditions.\n\nWe advise teachers and learners to stay home on 31 March 2025. We have noted massive deployment of security operatives nationwide. Safety of learners and teachers cannot be guaranteed in such a context, the union said in its statement.\n\nARTUZ further pointed out the historical context of security forces actions, noting that they have often been involved in brutalizing citizens during previous unrest. Both the security operatives, who have a history of brutalizing citizens, and whoever they are going after, pose a serious security threat to ordinary citizens, the statement continued.\n\nThe teachers unions endorsement of the protests underscores growing dissatisfaction with the governments handling of the nations ongoing crisis, as well as concerns over public safety during times of unrest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) has expressed strong support for the March 31 protests, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/teachers-union-endorses-m31-protests/\">Continue reading<span class=\"screen-reader-text\"> \"Teachers Union “Endorses” M31 Protests\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zanu PF Youth League Boss Taurai Kandishaya Claims Business As Usual Despite Empty Streets",
            "url": "https://www.zimeye.net/2025/03/31/zanu-pf-youth-league-boss-taurai-kandishaya-claims-business-as-usual-despite-empty-streets/",
            "content": "Tinashe Sambiri\n\nIn Zimbabwe, a nationwide stay away was staged by suffering residents who are increasingly frustrated by the countrys escalating crisis. The public demonstration of discontent was prompted by worsening economic conditions, corruption, and an ongoing political stalemate. However, despite the evident frustration among the citizens, Zanu PF Youth League Deputy Commissar Taurai Kandishaya insisted on Monday that it was business as usual in the capital city of Harare, describing the situation as calm and under control.\n\nKandishayas comments came in stark contrast to the images captured across the city that day. Photographs of the capitals streets show an alarming emptiness, with businesses shuttered, vehicles few and far between, and the usual bustle of city life absent. The contrast between the political narrative and the visual reality seemed to underscore the deepening divide between the governments perception and the lived experiences of many Zimbabweans.\n\nIts business as usual. Our people love peace. They dont want to be used by detractors. Those staying away are doing so for safety only, Kandishaya remarked during his statement. His attempt to downplay the growing dissatisfaction among the populace was seen by many as a reflection of the disconnection between government officials and the struggles facing ordinary citizens.\n\nThe mass stay away, which was organized to protest against the worsening economic conditions, power cuts, fuel shortages, and inflation, was also a show of solidarity with the opposition and prominent figures calling for change. One such figure gaining significant support is war veteran Blessed Geza, who has been outspoken in his demand for President Emmerson Mnangagwas resignation. Gezas call for Mnangagwa to step down is shared by a growing portion of Zimbabweans, particularly among those who feel that the current leadership has failed to address the countrys most pressing issues.\n\nKandishayas comments about safety and peace also appear to ignore the climate of fear and repression in which many Zimbabweans find themselves. Critics have pointed to heavy-handed tactics by security forces, often targeting opposition activists, protestors, and any public figures speaking out against the government. The governments narrative of peace and stability stands in contrast to the real experiences of citizens who fear arrest, harassment, and violence for voicing their dissent.\n\nAs the nation grapples with increasing social and economic pressures, the growing public unrest is unlikely to subside. The disparity between official statements and the lived reality of Zimbabweans may only intensify the calls for meaningful political change. Many now look to figures like Blessed Geza for leadership, as calls for President Mnangagwas resignation continue to gain momentum.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri In Zimbabwe, a nationwide stay away was staged by suffering residents who are increasingly frustrated by the country’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/zanu-pf-youth-league-boss-taurai-kandishaya-claims-business-as-usual-despite-empty-streets/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Youth League Boss Taurai Kandishaya Claims Business As Usual Despite Empty Streets\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        },
        {
            "title": "Mnangagwa Must Go, Harare Protesters Declare",
            "url": "https://www.zimeye.net/2025/03/31/mnangagwa-must-go-harare-protesters-declare/",
            "content": "By A Correspondent\n\nOn Monday morning, a peaceful protest in Central Harare was abruptly interrupted when police dispersed demonstrators, despite claims of peaceful intent by the organizers. A group of Harare residents gathered briefly near the Central Business District (CBD) to voice their opposition to President Emmerson Mnangagwas third-term agenda, but their efforts were swiftly thwarted by law enforcement.\n\nThe protest, which was organized by war veteran Blessed Geza, was part of a growing movement calling for the government to address the countrys political and economic crisis. Geza, a prominent figure in the opposition, had urged citizens to take to the streets to oppose Mnangagwas bid for a third term, which he and others argue would further entrench the current regimes hold on power.\n\nIn a statement leading up to the protest, Geza explained that the demonstrations were intended to be peaceful and were meant to signal widespread dissatisfaction with the governments direction. We are protesting because we cannot allow a third term for Mnangagwa. The people are suffering, and this government is doing nothing to address our needs, Geza said.\n\nHowever, when the protesters assembled in Central Harare, their gathering was short-lived. Police, who had been heavily deployed in the area, moved quickly to disperse the crowd. Eyewitnesses reported that officers used force to scatter the protesters, creating a tense atmosphere in the heart of the city.\n\nOne protester, who asked to remain anonymous, shared their frustration: We just wanted to express ourselves, but the police came and chased us away. We are tired of this government. We have the right to protest, but they just want to silence us.\n\nAnother resident, who was caught up in the incident, voiced their concern over the heavy-handed tactics used by law enforcement: We were not violent; we just wanted to make our voices heard. But instead of listening, the police treated us like criminals. Its clear that the government doesnt care about its people.\n\nThe swift police action reflects ongoing concerns over the governments handling of public dissent. Critics argue that the use of force to suppress protests is a sign of growing authoritarianism under President Mnangagwas rule.\n\nDespite the disruption, the message behind the protest is resonating with many Harare residents. As the country faces worsening economic conditions, the call for political change continues to gain momentum. While the police may have succeeded in dispersing the crowd on Monday, the underlying dissatisfaction with Mnangagwas leadership remains palpable. As one protester put it, They can chase us away today, but we will keep fighting for our rights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent On Monday morning, a peaceful protest in Central Harare was abruptly interrupted when police dispersed demonstrators, despite … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/31/mnangagwa-must-go-harare-protesters-declare/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Must Go, Harare Protesters Declare\"</span></a></p>",
            "time": "06:41",
            "date": "01 Apr 2025"
        }
    ]
}