{
    "news": [
        {
            "title": "School Driver Arrested For Inflating Cost Of Tractor Part",
            "url": "https://www.zimeye.net/2025/03/04/school-driver-arrested-for-inflating-cost-of-tractor-part/",
            "content": "A Chaplin High School driver, Davie Maravanyika (58), is facing fraud charges for allegedly inflating the cost of a tractor part.\n\nHe reportedly received a verbal quotation of US$35 for the part and US$20 for fitting. However, on January 29, he submitted a quote claiming a total cost of US$355.\n\nWhen the schools bursar contacted Gazaet (Pvt) Ltd for payment, the company refused to accept the money, disowning the quotation. A Zimbabwe Anti-Corruption Commission (ZACC) investigation later revealed that the quotation was never issued by Gazaet and that its serial number did not match the companys official records.\n\nMaravanyika was arrested on February 27 and appeared in court the following day, represented by Advocate Militao. He was granted US$100 bail and ordered not to interfere with state witnesses, to reside at his given address, and to report to ZACC Gweru every fortnight. His trial is set to begin on March 20.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A Chaplin High School driver, Davie Maravanyika (58), is facing fraud charges for allegedly inflating the cost of a tractor … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/04/school-driver-arrested-for-inflating-cost-of-tractor-part/\">Continue reading<span class=\"screen-reader-text\"> \"School Driver Arrested For Inflating Cost Of Tractor Part\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Chimombe’s Illness Delays Court Trial?",
            "url": "https://www.zimeye.net/2025/03/04/chimombes-illness-delays-court-trial/",
            "content": "By A Correspondent\n\nThe High Court has once again delayed the trial of business partners Moses Mpofu and Mike Chimombe after it was revealed that Chimombe is too ill to attend court.\n\nChimombe, who had only appeared in court following an order from Justice Pisirayi Kwenda for the Zimbabwe Prisons and Correctional Services to bring him in, had previously failed to show up, citing health issues.\n\nThe accused was eventually brought to court in the afternoon, and the judge postponed the trial to March 17.\n\nOriginally scheduled to begin in October last year, the trial was delayed due to several defense applications. The two men face charges of defrauding the government of seven million US dollars in a failed Presidential Goat Pass-on Scheme.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The High Court has once again delayed the trial of business partners Moses Mpofu and Mike Chimombe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/04/chimombes-illness-delays-court-trial/\">Continue reading<span class=\"screen-reader-text\"> \"Chimombe’s Illness Delays Court Trial?\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Mnangagwa’s Party Accused of Exploiting Rural Women with Empty Promises",
            "url": "https://www.zimeye.net/2025/03/04/mnangagwas-party-accused-of-exploiting-rural-women-with-empty-promises/",
            "content": "By A Correspondent\n\nThe ZANU PF Womens League has come under fire for what critics describe as a political move aimed at securing rural votes, after unveiling ten solar-powered incubators for all provinces, which they claim are part of the partys empowerment agenda.\n\nThe incubators, each designed to hold up to 36,000 eggs, were presented as a step towards rural economic development under the promise of Vision 2030. However, some rural women have voiced skepticism about the real benefits of the initiative, with many questioning the feasibility and practicality of the project.\n\nIn a statement during the launch, ZANU PF Secretary for Women Affairs, Mabel Chinomona, said, Every woman must do something with these incubators; when we say Vision 2030, this is what we mean. It is now up to the provinces to work.\n\nDespite the upbeat rhetoric, many local women argue that the promises are more about boosting political capital than providing meaningful support. One woman from a rural district, who wished to remain anonymous, expressed concern: We were promised the world, but where is the support for the tools and training we need to make this project viable? We have seen similar promises before with no real follow-through.\n\nZANU PF officials, including Chinomona, have also praised President Emmerson Mnangagwas leadership, attributing significant economic progress to his governance. Chinomona added, We must cherish this development. President Mnangagwa has over-achieved in all sectors of the economy.\n\nHowever, critics argue that these so-called empowerment projects are merely window dressing to garner rural support ahead of upcoming elections. Its easy to hand out an incubator, but harder to ensure it leads to long-term sustainable growth. Women in rural areas need access to better healthcare, education, and infrastructure, not just a few machines, said another rural activist.\n\nAdditionally, there have been calls within the party for discipline and unity, with some suggesting that political infighting and internal divisions have hindered the development efforts meant to benefit local communities.\n\nWe must be disciplined always, this is the foundation of the party. Women must also remain united to foster development, echoed ZANU PF Womens League Secretary for Administration, Senator Monica Mutsvangwa, stressing party loyalty as key to achieving progress.\n\nWhile the incubator initiative may be seen as a step toward rural empowerment, it remains to be seen whether it will lead to tangible improvements in the lives of women in these communities or merely serve as a political tool for the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ZANU PF Women’s League has come under fire for what critics describe as a political move … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/04/mnangagwas-party-accused-of-exploiting-rural-women-with-empty-promises/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Party Accused of Exploiting Rural Women with Empty Promises\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Zimbabwe Grapples With Soaring Murder Cases",
            "url": "https://www.zimeye.net/2025/03/04/zimbabwe-grapples-with-soaring-murder-cases/",
            "content": "By A Correspondent\n\nA disturbing trend has emerged in Zimbabwe, as the Zimbabwe Republic Police (ZRP) reported a staggering 40 murder cases across the country in just the first two months of 2025.\n\nAccording to police reports, Harare and Masvingo provinces recorded the highest number of murder cases, tying for the unenviable top spot.\n\nThe ZRP has expressed deep concern over this alarming spike in violent crime, citing the need for urgent attention and collective action to address the root causes of this trend.\n\nThe police reports highlight the need for increased vigilance and cooperation between law enforcement agencies, communities, and individuals to prevent and combat violent crime.\n\nAs the ZRP works to investigate and prosecute these cases, the authorities are urging citizens to report any suspicious activity and to work together to create safer communities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A disturbing trend has emerged in Zimbabwe, as the Zimbabwe Republic Police (ZRP) reported a staggering 40 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/04/zimbabwe-grapples-with-soaring-murder-cases/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Grapples With Soaring Murder Cases\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Another Top Company Executive Resigns",
            "url": "https://www.zimeye.net/2025/03/03/another-top-company-executive-resigns/",
            "content": "By Business ReporterProplastics Limited Chief Executive Officer Kudakwashe Leo Chigiya has resigned, markingyetanother high-profile executive departure in Zimbabwes turbulent corporate landscape.\n\nChigiya officially stepped down on 19 February 2025. His journey with Proplastics beganin1993 as a Graduate Trainee in Plastics Technology.\n\nOver the years, he climbed the ranks, holding key roles such as Quality Controller, Quality Assurance Manager, and Technical Manager, where he played an instrumental role in several pioneering manufacturing projects.\n\nIn 2003, he left the company to further his career in Plastics Technology in South Africa but returned on 29 May 2015 to takeupthe position of Chief Executive Officer.\n\nDuring his tenure, Chigiya spearheaded strategic initiativesthat strengthenedProplastics position in Zimbabwes manufacturing sector.\n\nIn a statement, Proplastics Limited acknowledged his contributions:\n\nThe Board of Directors of Proplastics Limited wishes to announce the resignation of the Chief Executive Officer, Mr Kudakwashe Leo Chigiya, with effect from 19 February 2025. Kudakwashe has served the company with dedication and commitment, and the Board expresses its sincere gratitude for his invaluable contributions to the companys growth and success.\n\nFinance Director Paschal Changunda hasbeen appointedActing Chief Executive Officer, effectiveimmediatelyuntil a permanent successoris identified.\n\nChigiyas resignation is part of a broader wave of executive departures across Zimbabwean businesses, manyof which are grappling with an increasingly unstable economic environment.\n\nIn recent weeks, other major listed companies, including OK Zimbabwe, EcoCash, and Econet Zimbabwe, have also experienced leadership transitions,signallingdeeperchallenges within the corporate sector.\n\nThe introduction of the Zimbabwe Gold (ZiG) currency is at the heart of the crisis, which has further strained businesses already struggling with economic instability.\n\nThe Reserve Bank of Zimbabwe (RBZ) introduced ZiGin a bidto stabilize the countrys volatile exchange rate and curb inflation.\n\nHowever, the currency has sparked widespread uncertainty, with businesses finding it difficult to secure foreign currency, settle debts, and maintain stable pricing structures.\n\nThe manufacturing sector, in particular, has been hard-hit, with companies like Proplastics facing rising production costs, erratic foreign currency allocations, and declining consumer purchasing power.\n\nThe challenges posed by ZiG have led to operational inefficiencies, reduced investor confidence, and an exodus of top executives unwilling to navigate the growing financial turbulence.\n\nEconomic analysts have warned that continued instability could lead to more company closures and job losses if the government fails to implement effective economic reforms.\n\nThe executive shake-ups within Zimbabwes largest firms underscore the urgent need for policies that restore business confidence and foster economic growth.\n\nAs Zimbabwes corporate sector undergoes these dramatic shifts, all eyes remain on policymakers to determine whether the country can chart a path towards economic stabilityor whether more businesses will succumb to the financial pressures of the ZiG era.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter–Proplastics Limited Chief Executive Officer Kudakwashe Leo Chigiya has resigned, marking yetanother high-profile executive departure in Zimbabwe’s turbulent corporate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/another-top-company-executive-resigns/\">Continue reading<span class=\"screen-reader-text\"> \"Another Top Company Executive Resigns\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Nakamba Out Of Warriors Clash With Super Eagles",
            "url": "https://www.zimeye.net/2025/03/03/nakamba-out-of-warriors-clash-with-super-eagles/",
            "content": "Sports Correspondent\n\nMarvelous Nakamba has suffered an injury and will be out of the Warriors next World Cup Qualifiers against Benin and Nigeria this month.\n\nNakamba sustained a soleus injury in the calf muscles and will be out of action for at least least six weeks.\n\nLuton Town boss Matt Bloomfield. confirmed the injury, saying: Shandon (Baptiste) and Marv, both out six weeks. Both got soleus injuries, so well be missing them for a little period of time.\n\nThe gaffer added: We took Marv off at half time [at Watford] because I felt like he wasnt moving very well. I didnt realise he was injured.\n\nWe were getting overrun. Weve spoken about that already. About how we need to be quicker. We need to be fitter. We need to be more robust and playing more games regularly. so weve had to make three changes to affect the game at half time. and then I found out that he had a tight calf. Then I got told he had a scan and it was six weeks out.\n\nNakamba has made 21 league appearances this season after returning from long term knee injury that sidelined him for over nine months.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Marvelous Nakamba has suffered an injury and will be out of the Warriors’ next World Cup Qualifiers against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/nakamba-out-of-warriors-clash-with-super-eagles/\">Continue reading<span class=\"screen-reader-text\"> \"Nakamba Out Of Warriors Clash With Super Eagles\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "MWOS Stun Fading Bulawayo Giants Bosso",
            "url": "https://www.zimeye.net/2025/03/03/mwos-stun-fading-bulawayo-giants-bosso/",
            "content": "Sports Correspondent\n\nHighlanders suffered a shocking 1-0 defeat to newcomers MWOS FC in their opening match of the 2025 Castle Lager Premier Soccer League season. The match was played at Baobab Stadium in Ngezi.\n\nMWOS FC dominated the first half, with Innocent Zambezi, Tafadzwa George, and Nigel Matinha all coming close to scoring. Highlanders, on the other hand, struggled to create scoring opportunities.\n\nThe deadlock was finally broken in the 67th minute when George scored the winning goal for MWOS FC. Despite a late push, Highlanders were unable to recover and suffered a disappointing loss.\n\nIn another match, Dynamos and ZPC Kariba played out a goalless draw in Harare. The result leaves Highlanders searching for their first win of the season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Highlanders suffered a shocking 1-0 defeat to newcomers MWOS FC in their opening match of the 2025 Castle … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/mwos-stun-fading-bulawayo-giants-bosso/\">Continue reading<span class=\"screen-reader-text\"> \"MWOS Stun Fading Bulawayo Giants Bosso\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Essential Fire Extinguisher Tips for Vehicle Safety",
            "url": "https://www.zimeye.net/2025/03/03/essential-fire-extinguisher-tips-for-vehicle-safety/",
            "content": "Fire extinguishers are an important safety tool to have in your vehicle, but proper storage and maintenance are crucial to ensuring their effectiveness in an emergency. Here are some key tips to keep your fire extinguisher in top condition and ready for use.\n\nFirst and foremost, never expose your fire extinguisher to direct sunlight. Prolonged exposure to the suns rays can lead to dangerous conditions, potentially causing the extinguisher to explode, which could result in harm or damage to your vehicle. Always store it in a cool, dry place to ensure safety.\n\nIt is equally important to store your fire extinguisher in an accessible spot inside your vehicle. Avoid keeping it in the boot, as this could prevent you from accessing it quickly in the event of a fire. During a car fire, the vehicles electronic components may fail, causing the boot to become locked. This would make it difficult or impossible to reach your extinguisher. Instead, store it under your car seat or in the glove compartment where it can be quickly retrieved.\n\nIn addition to proper storage, regular checks are vital. Always verify the expiration date on your fire extinguisher. If the extinguisher is past its expiration date and is refillable, take it to a recognized agent to have it refilled, often at a lower cost than the original purchase price.\n\nRemember, keeping a fire extinguisher in your vehicle is an essential safety measure that can save lives in an emergency. By following these simple tips, you can ensure that your fire extinguisher remains effective when you need it most.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Fire extinguishers are an important safety tool to have in your vehicle, but proper storage and maintenance are crucial to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/essential-fire-extinguisher-tips-for-vehicle-safety/\">Continue reading<span class=\"screen-reader-text\"> \"Essential Fire Extinguisher Tips for Vehicle Safety\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Zanu PF Sparks Controversy with Early Victory Claim for 2030 Polls",
            "url": "https://www.zimeye.net/2025/03/03/zanu-pf-sparks-controversy-with-early-victory-claim-for-2030-polls/",
            "content": "By A Correspondent\n\nZanu PF has ignited controversy with its early claim of victory in the 2030 elections, despite the fact that, according to the current constitution, elections are scheduled for 2028.\n\nThe declaration by Zanu PF official Taurai Kandishaya on Sunday has raised concerns over the partys intentions to manipulate the electoral process and postpone the upcoming polls to extend President Emmerson Mnangagwas rule.\n\nKandishayas statement suggests a clear agenda to maintain power beyond the constitutional limits, as he boldly declared that the ruling party would win resoundingly in the 2030 elections.\n\nHis remarks come at a time when internal debates within Zanu PF are intensifying over whether Mnangagwa should step down at the end of his second term in 2028, as mandated by the constitution.\n\nOn Facebook, Kandishaya boasted of the partys growing influence, claiming that over 200 opposition members from various splinter groups in Chiredzi had defected to Zanu PF, citing the partys unprecedented economic development projects as their reason for switching allegiance. He wrote: Over 200 opposition members in Chiredzi have defected to ZANU PF, from various opposition splinter groups, citing the Second Republics unprecedented economic development projects as the reason for their switch.\n\nThis comes as the commissariat department is intensifying mobilisation efforts to solidify the Party structures. We are already winning 2030 elections.\n\nWhile the party celebrates these defections as a sign of political strength, the focus on the 2030 polls has added fuel to the growing speculation that Zanu PF may attempt to postpone the 2028 elections, a move that would require changing the constitution. This has led to confusion and division within the party, as some hardliners argue that Mnangagwa should not seek to extend his rule past 2028, while others appear to be positioning themselves for a longer tenure.\n\nKandishayas premature focus on 2030 reflects the partys intention to shift the electoral narrative, even though the current constitutional framework mandates elections in 2028. Critics are wary of these moves, fearing they may undermine democratic processes and further consolidate power within the ruling party. As Zanu PF continues to push for constitutional changes and celebrates its alleged developmental successes, observers are increasingly concerned about the implications of these political maneuvers for Zimbabwes democratic future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF has ignited controversy with its early claim of victory in the 2030 elections, despite the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/zanu-pf-sparks-controversy-with-early-victory-claim-for-2030-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Sparks Controversy with Early Victory Claim for 2030 Polls\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        },
        {
            "title": "Mwendaz WeDrip Dismisses Death Reports",
            "url": "https://www.zimeye.net/2025/03/03/mwendaz-wedrip-dismisses-death-reports/",
            "content": "By A Correspondent\n\nMwendaz WeDrip is alive and well, and he has dismissed circulating rumors of his death.\n\nIn an exclusive interview with Zim Celebsofficial on Monday, the popular socialite laughed off the claims and assured his fans of his well-being.\n\nI am alive. Today is March 3rd, look, I am fit and fine. Give me the bereavement fund so that I may squander it! said Mwendaz, humorously addressing the false reports.\n\nEarlier, there were widespread rumors on social media claiming that the iconic Zimbabwean socialite, known for his bold fashion and comedic skits, had passed away. These reports were quickly dismissed by Mwendaz himself.\n\nReports of my death are false, he confirmed, assuring his followers that he was in good health.\n\nMwendaz WeDrip, whose real name is Campion Tichaona Jani, is a beloved figure in Zimbabwes entertainment scene, celebrated for his creativity and unique contributions to the countrys cultural landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mwendaz WeDrip is alive and well, and he has dismissed circulating rumors of his death. In an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/03/mwendaz-wedrip-dismisses-death-reports/\">Continue reading<span class=\"screen-reader-text\"> \"Mwendaz WeDrip Dismisses Death Reports\"</span></a></p>",
            "time": "06:29",
            "date": "05 Mar 2025"
        }
    ]
}