{
    "news": [
        {
            "title": "EcoCash Betrays Customers",
            "url": "https://www.zimeye.net/2025/09/30/ecocash-betrays-customers/",
            "content": "By A Correspondent Zimbabwes largest mobile money service, EcoCash, is increasingly coming under fire from customers who accuse it of providing unreliable, opaque, and exploitative services.\n\nI am one of those frustrated customers. Recently, I hadZIG 1,100in my EcoCash account when, without warning, I received a text message stating that the money had been transferredwithout my consentto an EcoCash bank account under what they callEcoCash Banking Services Recoveries., said one customer.\n\nAlarmed, I contacted the EcoCash customer care centre for an explanation. What I was told was both disturbing and unconvincing. According to the agent, when customers buy goods in supermarkets using EcoCash, the system sometimes fails to capture the full transaction. As a result, the company later deducts the balance silently under its so-called recoveries, he added.\n\nThis practice is nothing short of outrageous. How can a financial services company the size of Econet allow such a faulty system to operateone that dips into customers wallets without prior notification, explanation, or consent?\n\nFor years, EcoCash has been plagued bypoor service delivery, technical failures, and weak customer support.Complaints from users range from failed transactions, funds mysteriously disappearing, and delayed reversals to frequent network outages that leave people stranded at points of sale. Many customers also complain that EcoCashs call centre is unresponsive and rarely resolves issues.\n\nThis is not the first time EcoCash has been accused of mishandling its platform. In2019 and 2020, the Reserve Bank of Zimbabwe was forced to intervene after EcoCash was implicated in facilitating illegal foreign currency trades. At the same time, the service had become notorious for network disruptions that left millions unable to access their money for hours, further eroding public trust.\n\nDespite these past warnings and interventions, little seems to have improved. Instead, the company now appears to have normalised the controversial practice ofrecovering funds silentlya move that feels more like daylight robbery than fair banking practice. Rather than notifying customers in advance or seeking their consent, EcoCash deducts money first and only explains if the victim follows up with complaints.\n\nEfforts to get a formal comment fromEconet Wireless Zimbabwe, the parent company of EcoCash, were unsuccessful.\n\nUnless Econet urgently fixes these systemic failures, improves transparency, and restores customer confidence, EcoCash risks losing the goodwill it once enjoyed as a revolutionary mobile money service. Instead, it will be remembered for frustrating, cheating, and betraying the very people it was meant to serve.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe’s largest mobile money service, EcoCash, is increasingly coming under fire from customers who accuse it of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/ecocash-betrays-customers/\">Continue reading<span class=\"screen-reader-text\"> \"EcoCash Betrays Customers\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Painful Video of Live Grenade Thrown At VP Chiwenga’s Wife After Mnangagwa’s Fled",
            "url": "https://www.zimeye.net/2025/09/30/painful-video-of-live-grenade-thrown-at-vp-chiwengas-wife-after-mnangagwas-fled/",
            "content": "video loading below\n\nBomb video footage shows Mnangagwa enjoyed 6 seconds advance time to escape explosion targeting VP Chiwenga and wife on 23 Jun 2018.Footage credit: Conical Tower.@VOAAfricahttps://t.co/Hn8KhXSFAxpic.twitter.com/aJnUZGfjHM\n\nEmmerson Mnangagwas loud statement that VP Constantino Chiwenga and his wife, Marry Mubaiwa bombed themselves on 23 June 2018 | AUDIT OF LIVE FOOTAGEhttps://t.co/jT4BYga54Tpic.twitter.com/OzhNyDvRcb\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Below is the painful video footage of a White City 2018 live grenade throw at VP Constantino Chiwenga’s wife soon … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/painful-video-of-live-grenade-thrown-at-vp-chiwengas-wife-after-mnangagwas-fled/\">Continue reading<span class=\"screen-reader-text\"> \"Painful Video of Live Grenade Thrown At VP Chiwenga’s Wife After Mnangagwa’s Fled\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Seke Homes Flooded Inside In Sewage | Video",
            "url": "https://www.zimeye.net/2025/09/30/seke-homes-flooded-inside-in-sewage-video/",
            "content": "We are in Unit A Seke Chitungwiza, and sewer is flowing mumaRoads and mudzimba (in the houses). We have been having this sewer problem for over a year now. Mukaiburitsawo pamwe tingabatsirike. Takutyira outbreak yoCholera, tibatsireiwo plea\n\nvideo loading below\n\nWe are in Unit A Seke Chitungwiza, and sewer is flowing mumaRoads and mudzimba (in the houses).We have been having this sewer problem for over a year now. Mukaiburitsawo pamwe tingabatsirike. Takutyira outbreak yoCholera, tibatsireiwo please. https://t.co/Hn8KhXTdq5pic.twitter.com/Wm9eOslrbi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "We are in Unit A Seke Chitungwiza, and sewer is flowing mumaRoads and mudzimba (in the houses). We have been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/seke-homes-flooded-inside-in-sewage-video/\">Continue reading<span class=\"screen-reader-text\"> \"Seke Homes Flooded Inside In Sewage | Video\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "NetOne Boss Arrested Over US$1 Million Fraud",
            "url": "https://www.zimeye.net/2025/09/30/netone-boss-arrested-over-us1-million-fraud/",
            "content": "Crime and Courts Reporter- NetOne Chief Executive Officer, Raphel Mushanawani, has been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) on allegations of fraud amounting to US$1.2 million.\n\nIn a statement released Monday, ZACC confirmed that Mushanawani is facing charges of criminal abuse of office and fraud.\n\nMushanawani allegedly participated in a fraudulent transaction involving US$1.2 million.\n\nThe money purportedly went towards the replacement of the companys SAGE 1000 system, consultancy and training services and was released without the approval of the executive committee and the board.\n\nMushanawani is expected to appear at Harare Magistrates Court today.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Crime and Courts Reporter- NetOne Chief Executive Officer, Raphel Mushanawani, has been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/netone-boss-arrested-over-us1-million-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"NetOne Boss Arrested Over US$1 Million Fraud\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Chamuka: Mnangagwa Should Honour Unity Accord, Make Mpofu Vice President",
            "url": "https://www.zimeye.net/2025/09/30/chamuka-mnangagwa-should-honour-unity-accord-make-mpofu-vice-president/",
            "content": "By Takudzwa Changadeya| Opposition Peoples Unity Party (PUP) leader Herbert Chamuka has criticised President Emmerson Mnangagwas recent politburo reshuffle, arguing that the demotion of Obert Mpofu disregards the historical agreements of the 1987 Unity Accord.\n\nIn a reshuffle announced this week, Mnangagwa reassigned Mpofu from his influential post as ZANU-PF Secretary for Administration to the relatively minor role of Secretary for Information and Communication Technology (ICT).\n\nThe politburo is the partys highest decision-making body, and its resolutions are binding.\n\nChamuka said the move undermined the legacy of the Unity Accord and diminished the standing of one of the most prominent ex-ZAPU leaders.\n\nThe reshuffle which was done by the president Emmerson Dambudzo Mnangagwa wasnt good to the history of the country.\n\nThere are individuals within the government and ZANU-PF who are respected, who hold the strongholds of the party, and who were devalued by being taken from respected positions and appointed to posts that should be given to younger members. Obert Mpofu is one of them, Chamuka said.\n\nHe added that Mnangagwa should give Obert Mpofu respect and his actual party position in line with the Unity Accord.\n\nThe Accord, signed between Robert Mugabes ZANU and Joshua Nkomos ZAPU in 1987, guaranteed that senior ZAPU figures would hold influential posts, including one of the two vice-presidential seats.\n\nWhen Vice-President John Nkomo died in 2013, discussions within ZANU-PF reportedly pointed to Mpofu as a possible successor.\n\nAt the time, his stature as a Matabeleland leader and former ZAPU cadre positioned him as one of the natural beneficiaries of the agreement.\n\nAccording to history, one of the vice-presidential posts was reserved for ZAPU.\n\nAfter John Nkomos death, Obert Mpofu was supposed to be considered.\n\nInstead, he has been moved into lesser roles, which is a clear devaluation compared to what the Accord promised, Chamuka argued.\n\nZANU-PF activist Tonderai Chidawa, however, defended the reshuffle, saying Mpofu had failed to unite the party.\n\nHis demotion reflects concerns within the party over his leadership and possible ties to a dossier that implicated senior officials in corruption, Chidawa said.\n\nChamuka dismissed such reasoning, insisting that the broader issue was about honouring the Unity Accord and restoring balance between the former liberation movements.\n\nWe complained about Robert Mugabes leadership, and now we are complaining about Emmerson Mnangagwa.\n\nBut we have never tested leadership from the ZAPU side. That is why this Accord must be respected, Chamuka said.\n\nThe Unity Accord ended the bloody Gukurahundi conflict in Matabeleland and merged ZAPU and ZANU into ZANU-PF.\n\nIt remains one of the foundational documents of Zimbabwes post-independence politics.\n\nFor Chamuka, failing to uphold its spirit risks reopening old wounds and alienating long marginalised communities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Takudzwa Changadeya| Opposition People’s Unity Party (PUP) leader Herbert Chamuka has criticised President Emmerson Mnangagwa’s recent politburo reshuffle, arguing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/chamuka-mnangagwa-should-honour-unity-accord-make-mpofu-vice-president/\">Continue reading<span class=\"screen-reader-text\"> \"Chamuka: Mnangagwa Should Honour Unity Accord, Make Mpofu Vice President\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Magaya Loses Properties",
            "url": "https://www.zimeye.net/2025/09/30/magaya-loses-properties/",
            "content": "By A Correspondent  Controversial preacher Prophet Walter Magaya, founder of the Prophetic Healing and Deliverance (PHD) Ministries, has lost control of his multimillion-dollar hotel and stadium complex in Harare after the High Court issued a writ of execution.\n\nAccording to court records (Case Number SH3294/25), Chinese national Li Xiu Yun successfully obtained the order for the sale in execution of Magayas rights and title to Stand 168 of Prospect, a 3.84-hectare property situated along Smuts Road in Waterfalls, Harare.\n\nThe property, once touted as a flagship investment by Magayas ministry, houses a four-star-standard hotel, several cluster houses and lodges, and a modern football stadium. The facilities turned the Prospect area into a hub of activity, hosting football matches, church events, and attracting local and international visitors.\n\nThe impending auction marks one of the biggest financial and legal blows to Magayas empire, which has grown over the past decade through a combination of religious influence, business ventures, and real estate acquisitions.\n\nSince founding PHD Ministries in 2012, Magaya aggressively expanded into property and hospitality. His hotel in Waterfalls was marketed as a premium accommodation centre, catering not only to church pilgrims but also to business travellers and sports tourists.\n\nThe stadiumone of the largest privately built sports facilities in Hararewas particularly significant. It became a venue for football and community events, often doubling as a stage for his mega-church gatherings that drew tens of thousands of congregants.\n\nMagaya also invested in residential estates, commercial centres, and health facilities, framing his ventures as part of a broader vision to empower communities through employment creation and infrastructure development.\n\nHowever, many of these projects were marred by controversy. Some collapsed midway due to financial difficulties, while others were tied to lawsuits involving unpaid contractors, disgruntled investors, and foreign partners who accused Magaya of breach of contract.\n\nIn 2018, President Emmerson Mnangagwa personally commissioned Magayas Yadah Stadium in Waterfalls, hailing it as a model of private investment that could complement government efforts to revive Zimbabwes ailing infrastructure. The event symbolised the close ties Magaya had cultivated with the political establishment, projecting him not only as a spiritual leader but also as an influential player in the countrys economic landscape.\n\nAt the commissioning, Mnangagwa praised Magayas vision and urged other church leaders and businesspeople to emulate him in supporting national development. The endorsement cemented Magayas reputation as a politically connected clergyman whose projects carried the weight of state approval.\n\nYet, despite such high-profile backing, cracks soon appeared in his empire. Allegations of financial mismanagement, debts owed to foreign investors, and legal disputes increasingly dogged his ventures.\n\nThe latest High Court ruling is tied to Magayas dispute with Li Xiu Yun, a Chinese investor who is owed substantial sums. The writ of execution authorises the sale of PHD Ministries rights and title to the hotel, stadium, and associated properties to recover the debt.\n\nFor the thousands of PHD congregants who regarded the Waterfalls complex as the heart of their ministry, the looming auction represents not only the loss of a spiritual home but also the collapse of one of Zimbabwes most ambitious religious property projects.\n\nFor Magaya himself, the ruling is a humiliating reversal from the days when he shared a stage with the President to celebrate his business vision.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Controversial preacher Prophet Walter Magaya, founder of the Prophetic Healing and Deliverance (PHD) Ministries, has lost … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/magaya-loses-properties/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Loses Properties\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Masvingo Man Dies After Drinking Guchu…",
            "url": "https://www.zimeye.net/2025/09/30/masvingo-man-dies-after-drinking-guchu/",
            "content": "By A Correspondent\n\nChivi  A 48-year-old man from Ngundu has died after consuming two litres of a traditional sexual enhancement drink commonly known as guchu.\n\nMasvingo police confirmed the tragic incident, saying the man, identified as Knowledge Chikafu of Mutsimba Village under Headman Gororo, collapsed after taking the mixture on Sunday afternoon.\n\nReports indicate that Chikafu purchased the concoction at the Ngundu bus terminus and drank it while on his way home. Shortly after, he began vomiting. His brother later rushed him to Gororo Clinic around 4:30pm when his condition worsened.\n\nHe was referred to Chivi District Hospital the same day before being transferred to Masvingo Provincial Hospital as his health continued to deteriorate. He died on Wednesday night.\n\nPolice said an elderly woman from Chikamure Village, Headman Madzivire area, has been arrested in connection with the case. A container believed to have been used in preparing the concoction was also recovered.\n\nAuthorities have urged members of the public to avoid purchasing unregulated remedies, warning that such practices can lead to loss of life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chivi – A 48-year-old man from Ngundu has died after consuming two litres of a traditional sexual … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/masvingo-man-dies-after-drinking-guchu/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Man Dies After Drinking Guchu…\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Soldiers Beat Up Goromonzi Villagers",
            "url": "https://www.zimeye.net/2025/09/30/soldiers-beat-up-goromonzi-villagers/",
            "content": "By A Correspondent  Soldiers have beaten up villagers in Goromonzi for resisting a controversial project involving a Chinese brick-moulding company that the Air Force of Zimbabwe claims is part of a radar installation.\n\nThe brutality is the latest episode in a long-running pattern where the military, often acting in the interests of the ruling Zanu PF, is deployed against ordinary citizens resisting forced evictions to make way for state-linked or foreign projects.\n\nThe affected villagers, led by Friday Ngoshi, Ephraim Kabvuri and William Kapeta, have approached the High Court seeking protection from eviction and the desecration of graves in Gutsa village. They are represented by lawyer Norman Mugiya.\n\nThey cited several powerful figures as respondents, among them district development co-ordinator Prisca Dube, Chief Chikwaka, Goromonzi Rural District Council CEO Trust Madhovi, councillor Aaron Shamhu, MP Ozias Bvute, Air Force of Zimbabwe wing commander Masongelwa Ndhlovu, Zimbabwe Defence Forces commander General Valerio Sibanda, and Defence minister Oppah Muchinguri-Kashiri.\n\nNgoshi is the head of Gutsa village, Kabvuri serves as secretary of the council of elders, while Kapeta is vice-chairperson of the Zimbabwe Ex-Political Prisoners, Detainees and Restrictees Childrens Association. The village has around 400 households, with an average of five members each.\n\nThe plaintiffs told the court they have lived in the area since time immemorial and consider it their only home. But their lives were upended in June 2025 when Wing Commander Ndhlovu and his officers surveyed the area and soon after pegged land without consulting villagers. When challenged, Ndhlovu allegedly declared that the army is above the law and the ruling Zanu PF party and could do as it pleased.\n\nIn July, soldiers reportedly began clearing land, digging trenches that destroyed roads, homes, and even graveyards. Villagers were threatened with death if they resisted and told to demolish their own houses or face having them burnt down by the Air Force.\n\nAccording to the plaintiffs, the Air Force has partnered Chinese nationals who are moulding bricks under the guise of constructing a radar system. Our rights have been stripped and we have been reduced to aliens in our own country, the villagers submitted, accusing Ndhlovu of deploying armed men to crush dissent.\n\nThis case is not isolated. Zimbabwes post-independence history is littered with examples of military-backed land seizures, from Operation Murambatsvina in 2005 that displaced hundreds of thousands, to repeated army crackdowns on mining and land disputes where villagers stood in the way of politically connected elites and foreign investors. Soldiers have also been used to instill fear during election seasons, ensuring Zanu PFs dominance in rural areas.\n\nThe Goromonzi villagers argue that their eviction violates the Constitution, which prohibits forced removal without a court order and provides for the protection of ancestral land and graves.\n\nIn response, Ndhlovu insisted that villagers should have cited the Air Forces commanding officer responsible for radar projects. He claimed that the relocation was sanctioned in 2014 after the decision to move the Air Force radar from Mt Hampden to Goromonzi to allow for construction of the new Parliament.\n\nNdhlovu said the Lands ministry was tasked with relocating affected families and that due process was followed, including consultations with stakeholders. He denied any violation of graves and argued that alternative land was being secured.\n\nThe Air Force defended its partnership with the Chinese company, claiming it was contributing revenue to the national fiscus. The construction is lawful and due process was followed, the Air Force said in its submission. The construction of the radar is of national interest and fully supported by government. Above all, it is essential for safeguarding the villagers from radiation exposure which over time will be detrimental to their health.\n\nDespite these claims, the case highlights once again the enduring tension between communities defending their ancestral land and an increasingly militarised state that uses the army to enforce displacements. For the Gutsa villagers, the court battle may be their last hope to resist a system where, as they allege, the army and Zanu PF act as law unto themselves.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Soldiers have beaten up villagers in Goromonzi for resisting a controversial project involving a Chinese brick-moulding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/soldiers-beat-up-goromonzi-villagers/\">Continue reading<span class=\"screen-reader-text\"> \"Soldiers Beat Up Goromonzi Villagers\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Man Bashes Uncle Over Food Dispute",
            "url": "https://www.zimeye.net/2025/09/30/man-bashes-uncle-over-food-dispute/",
            "content": "By A Correspondent\n\nA 24-year-old man from Musani Village, Chipinge, has been convicted of physical abuse under the Domestic Violence Act after attacking his 48-year-old uncle over a disagreement about meal preparations.\n\nChipinge Magistrates Court sentenced the offender to 18 months in prison, with six months suspended on condition of good behavior and 12 months suspended provided he completes 420 hours of community service at Musani Primary School.\n\nAccording to court records, the incident occurred on August 20, 2025, when the victim asked the offenders wife to prepare extra food for visiting guests. The offender reportedly became enraged by the request.\n\nHe lost his temper over a simple request for food, said a court official. He first grabbed the victim, strangling him and striking him with his fists and open hands.\n\nThe violence escalated when the man returned with an electric cable, striking the victim repeatedly. The uncle managed to escape to his bedroom to seek safety, sustaining bruises on both hands and shoulders.\n\nThe victim described feeling terrified and unable to defend himself, the official added. This was a clear case of domestic abuse and intimidation within a family setting.\n\nThe court emphasized that family disputes, no matter how minor, do not justify acts of violence. The offenders sentence blends custodial time with community service as a measure to both punish and rehabilitate him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 24-year-old man from Musani Village, Chipinge, has been convicted of physical abuse under the Domestic Violence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/man-bashes-uncle-over-food-dispute/\">Continue reading<span class=\"screen-reader-text\"> \"Man Bashes Uncle Over Food Dispute\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        },
        {
            "title": "Mnangagwa Aide Caught Offside…",
            "url": "https://www.zimeye.net/2025/09/30/mnangagwa-aide-caught-offside/",
            "content": "By A Correspondent\n\nSpecial Investment Advisor to the President, Dr. Paul Tungwarara, has caused a stir with remarks suggesting that President Emmerson Mnangagwas position is beyond the reach of the ballot box.\n\nSpeaking to a crowd over the weekend after returning from Dubai, where he visited his newborn child, Dr. Tungwarara addressed rumours that he had fled Zimbabwe amid corruption allegations.\n\nI went to Dubai to see my child, a baby, he said. People started saying I had fled Fled from what? Fled from who?\n\nTurning to the presidency, he framed it as divinely ordained. The Bible tells us that leaders are appointed by God, he declared. If a person is appointed by God, they can only be removed by God. Its not the peoples vote, the vote doesnt even work. The one who removes a person is God.\n\nDr. Tungwarara also reaffirmed his support for the current administration, emphasizing loyalty and political solidarity. We are ready to defend our party and defend our president. And nothing is going to stop us, he said.\n\nHis comments came shortly after he was pictured alongside President Mnangagwa at the 3rd National War Veterans Assembly, where he spoke about connecting grassroots empowerment programs to the Presidents vision.\n\nAnalysts suggest Tungwararas statements could spark debate about the balance between religious authority and democratic governance in Zimbabwe, raising questions about the role of elections in determining political leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Special Investment Advisor to the President, Dr. Paul Tungwarara, has caused a stir with remarks suggesting that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/30/mnangagwa-aide-caught-offside/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Aide Caught Offside…\"</span></a></p>",
            "time": "06:10",
            "date": "01 Oct 2025"
        }
    ]
}