{
    "news": [
        {
            "title": "Warriors vs. Benin: Match Details",
            "url": "https://www.zimeye.net/2025/03/14/warriors-vs-benin-match-details/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has announced ticket prices for the Warriors upcoming 2026 FIFA World Cup Qualifier against Benin.\n\nThe match will take place on Thursday, 20 March, at Moses Mabhida Stadium in Durban, South Africa, with kick-off scheduled for 6:00 PM CAT.\n\nGeneral tickets are priced at 50 rands and can be purchased through the Pros website.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has announced ticket prices for the Warriors’ upcoming 2026 FIFA World Cup Qualifier … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/warriors-vs-benin-match-details/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors vs. Benin: Match Details\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Al Ahly Threatens to Withdraw from Top Flight Amid Refereeing Disputes",
            "url": "https://www.zimeye.net/2025/03/14/al-ahly-threatens-to-withdraw-from-top-flight-amid-refereeing-disputes/",
            "content": "Sports Correspondent\n\nAl Ahlys Official Statement:\n\nIn an emergency board meeting held on Tuesday morning, Al Ahly expressed deep concern over the ongoing instability within Egyptian football, particularly the lack of coordination between the Egyptian Football Association (EFA) and the Professional Clubs Association. The club voiced frustration over repeated administrative errors that have led to persistent crises in the sport.\n\nA key issue discussed was the decision to assign Egyptian referees to officiate the upcoming Cairo Derby against Zamalek. Al Ahly highlighted that they had formally requested foreign referees for the match, citing previous controversies surrounding local officiating that have affected match outcomes. Additionally, the club reiterated its previous calls for a complete overhaul of the refereeing system, including the appointment of a foreign expert to lead the refereeing committee.\n\nDespite multiple requests, Al Ahly claims their concerns have been ignored, further eroding trust in the current system. The statement stressed that the club cannot accept continued inconsistencies in officiating that could undermine the fairness of the competition.\n\nAs a result, Al Ahlys board has decided to:\n\nInsist on postponing the match until the EFA fulfills its commitment to appointing foreign referees as originally promised.\n\nWithdraw from the league if their demands are not met.\n\nRemain in continuous session to monitor developments and take further necessary actions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Al Ahly’s Official Statement: In an emergency board meeting held on Tuesday morning, Al Ahly expressed deep concern … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/al-ahly-threatens-to-withdraw-from-top-flight-amid-refereeing-disputes/\">Continue reading<span class=\"screen-reader-text\"> \"Al Ahly Threatens to Withdraw from Top Flight Amid Refereeing Disputes\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Mnangagwa Minister’s Parents Robbed In Violent Home Invasion",
            "url": "https://www.zimeye.net/2025/03/14/mnangagwa-ministers-parents-robbed-in-violent-home-invasion/",
            "content": "By Crime and Courts Reporter-Armed robbers have stormed the home ofZimbabwesMinister of Youth, Sport, Arts, and Recreation, Kirsty Coventry, along with her husband, Robert Edwin, and Lyn Coventry, in the affluent suburb of Glen Lorne, Harare.\n\nThe criminals made off with valuables worth an estimatedUS$90,000in a daring heist.\n\nAccording to reports, two masked men brandishing weapons forced their way into the Coventry residence, where they overpowered the couple and bound their legs with shoelaces.\n\nThe robbers then ransacked the house, looting astaggering haulthat includedUS$15,000 in cash,jewelryvalued at US$60,000, Olympic-branded clothing, travel bags, three hair dryers, hearing aids worth US$5,000, and three high-powered hunting firearms.\n\nPolice have yet to issue an official statement on the incident, which comes amid aworrying surge in armed robbery casesacross Zimbabwe in recent years.\n\nThe rising trend is partly blamed on economic instability, forcing businesses and individuals to store large sums of cash outside the formal banking system due togrowing distrust in financial institutions.\n\nKirsty Coventry,Zimbabwesmost decorated Olympian, is best known for herremarkable achievements in swimming.\n\nShe wonseven Olympic medals, includingtwo golds, making her the most successful African female swimmer in history.\n\nShe also holdsmultipleworld records and has represented Zimbabwe with distinction atfive Olympic Games (2000, 2004, 2008, 2012, and 2016).\n\nFollowing her retirementfrom competitive swimming, Coventry transitioned into sports administration and politics.\n\nIn2018,PresidentEmmerson Mnangagwaappointed her Minister of Youth, Sport, Arts, and Recreation.\n\nIn this role, she has pushed forgreaterinvestment in grassroots sports, the revival ofZimbabwesfootball program, and reforms to improve thecountrysathletics and arts sectors.\n\nCoventry has also served as amember of the International Olympic Committee (IOC)and chaired the IOCAthletesCommission, advocating forthe rights of athletesworldwide.\n\nDespite criticism over her association withMnangagwasadministration, she has maintained that her goal is to develop sports and empower young people in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Armed robbers have stormed the home of Zimbabwe’s Minister of Youth, Sport, Arts, and Recreation, Kirsty Coventry, along … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/mnangagwa-ministers-parents-robbed-in-violent-home-invasion/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister’s Parents Robbed In Violent Home Invasion\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Be Patient On The Road",
            "url": "https://www.zimeye.net/2025/03/14/be-patient-on-the-road/",
            "content": "In our fast-paced world, impatience often seeps into our daily lives, including how we behave behind the wheel. But the road is not a place for rash decisions or hasty actionsits a place where patience can literally save your life. If you refuse to exercise patience while riding or driving, you might find yourself in a far worse situation: as a patient in a hospital bed, a casualty in a morgue, or another statistic in a graveyard.\n\nThe roads are filled with vital signs and markings that serve a critical purpose. Road signs, signals, and lane markings arent just there for decorationthey are messages designed to guide and protect you. When you choose to ignore them, whether by speeding, overtaking dangerously, or neglecting to follow traffic rules, you put yourself and others at risk.\n\nPatience on the road means taking the time to properly assess your surroundings, respecting speed limits, yielding when necessary, and abiding by the rules set forth to ensure everyones safety. These guidelines are not meant to slow you down or ruin your day; they are meant to preserve your life. A single moment of impatience could lead to an irreversible consequence.\n\nFor example, ignoring a red light or failing to yield could lead to a tragic collision, leaving not only you but also others involved suffering the consequences. If youre driving too fast for road conditions or overtaking on blind corners, you might be tempting fate. That sudden moment of impatience can result in an accident that could change your life foreveror end it prematurely.\n\nThe road messages are clear. The speed limits are there to keep you safe. The warning signs are there to prepare you for potential hazards ahead. The lane markings are there to help you stay in your lane and avoid dangerous intersections. Respecting these messages is an act of self-preservation. Ignoring them could place you in a hospital bed, or worse, a morgue.\n\nSo, the next time you find yourself behind the wheel, take a deep breath and remind yourself of the consequences of impatience. Your life is worth more than reaching your destination a few minutes earlier. Be patient. Respect the road, its messages, and the safety of those around you. It could mean the difference between life and death.\n\nDrive safe. Be patient. Save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In our fast-paced world, impatience often seeps into our daily lives, including how we behave behind the wheel. But the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/be-patient-on-the-road/\">Continue reading<span class=\"screen-reader-text\"> \"Be Patient On The Road\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Embarrassed Mnangagwa Administration Frees Opposition Councillor Arrested Over TikTok Video",
            "url": "https://www.zimeye.net/2025/03/14/embarrassed-mnangagwa-administration-frees-opposition-councillor-arrested-over-tiktok-video/",
            "content": "THENational Prosecuting Authority (NPA) on Friday 14 March 2025 ceased the prosecution ofIshmael Maukazuva, the Councillor for Ward 12 in Chikomba West constituency in Mashonaland East province, who had been in detention for the past two days, after he was arrested by Zimbabwe Republic Police (ZRP) officers and charged with undermining authority of or insulting President Emmerson Mnangagwa.\n\nCouncillor Maukazuva, who was represented byPaidamoyo SaurombeofZimbabwe Lawyers for Human Rights, was arrested by ZRP officers on Wednesday 12 March 2025, where he was accused of insulting President Mnangagwa, when he allegedly forwarded a Tiktok video clip on Chivhu Residents and Ratepayers Association WhatsApp group, showing a woman allegedly criticising President Mnangagwa for reportedly mismanaging the economy and also passing on some insulting messages against the ruling ZANU PF political party leader.\n\nBut on Friday 14 March 2025, prosecutors from the NPA withdrew charges against Councillor Maukazuva on the basis that they had not first obtained a certificate to prosecute from the Prosecutor-General, authorising them to take legal action against the opposition political party Councillor.\n\nAccording to prosecutors, Councillor Maukazuva allegedly undermined authority of or insulted President Mnangagwa, when he allegedly circulated a Tiktok video clip containing some derogatory and vulgar language reportedly uttered by an unidentified woman, who was criticising the countrys leader.\n\nProsecutors claimed that Councillor Maukazuvas conduct of allegedly forwarding the Tiktok video clip of the unidentified woman making some disparaging remarks against President Mnangagwa, including accusing him of bringing misfortunes among Zimbabweans and urging him to relinquish power to a young person, was unlawful.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "THE National Prosecuting Authority (NPA) on Friday 14 March 2025 ceased the prosecution of Ishmael Maukazuva, the Councillor for Ward 12 in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/embarrassed-mnangagwa-administration-frees-opposition-councillor-arrested-over-tiktok-video/\">Continue reading<span class=\"screen-reader-text\"> \"Embarrassed Mnangagwa Administration Frees Opposition Councillor Arrested Over TikTok Video\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Bestiality: Man Forces Self On Neighbour’s Calf, Blames Evil Spirits For Act",
            "url": "https://www.zimeye.net/2025/03/14/bestiality-man-forces-self-on-neighbours-calf-blames-evil-spirits-for-act/",
            "content": "By A Correspondent\n\nA 67-year-old Shurugwi man, Twoboy Shamhu, appeared in court facing bestiality charges for having sex with his neighbors calf.\n\nShamhu claimed he was driven to the act due to being sex-starved by his girlfriend and the loss of his wife.\n\nHe also blamed evil spirits for his actions.\n\nMagistrate Sithabile Zungula sentenced Shamhu to six months in jail, suspending two months on condition of good behaviour.\n\nThe remaining four months were commuted to community service, although the exact number of hours was not specified.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 67-year-old Shurugwi man, Twoboy Shamhu, appeared in court facing bestiality charges for having sex with his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/bestiality-man-forces-self-on-neighbours-calf-blames-evil-spirits-for-act/\">Continue reading<span class=\"screen-reader-text\"> \"Bestiality: Man Forces Self On Neighbour’s Calf, Blames Evil Spirits For Act\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Muchinguri-Kashiri Struggles To Clear Air On 2030 Agenda",
            "url": "https://www.zimeye.net/2025/03/14/muchinguri-kashiri-struggles-to-clear-air-on-2030-agenda/",
            "content": "By A Correspondent\n\nZanu PF National Chairperson Oppah Muchinguri-Kashiri struggled to clarify the controversial 2030 agenda during a meeting with party leadership, including provincial heads, directors, and ministers at the party headquarters in Harare on Thursday.\n\nThe agenda, which some claim is aimed at extending President Emmerson Mnangagwas term in office, has stirred considerable debate within the party.\n\nMuchinguri-Kashiri addressed the issue, urging the leadership to serve the party with loyalty and selflessness, regardless of the challenges.\n\nI urge the Party leadership in its entirety to serve the Party selflessly and loyally, come rain, come night, she emphasized.\n\nShe also sought to clear up misunderstandings regarding the 2030 agenda, which some individuals have used to further their personal interests.\n\nOn the 21st National Peoples Conference Resolutions Number 1, the Party leadership observed, with dismay, the abuse of the resolution and the weaponization of the 2030 slogan, Muchinguri-Kashiri said.\n\nShe made it clear that the resolution was a collective outcome and should not be monopolized by a select few for personal gain.\n\nThe resolution is a collective outcome which cannot be monopolized by a few individuals for personal gains and glory, she added.\n\nMuchinguri-Kashiri condemned those exploiting the 2030 agenda to stir division within the party.\n\nThose few individuals are now exploiting the resolution and the 2030 slogan to provoke discord and petty disciplinary cases. This must stop forthwith, she said, urging unity and discipline within the party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF National Chairperson Oppah Muchinguri-Kashiri struggled to clarify the controversial 2030 agenda during a meeting with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/muchinguri-kashiri-struggles-to-clear-air-on-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Muchinguri-Kashiri Struggles To Clear Air On 2030 Agenda\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "NSSA Board Chair Questioned In Extortion Case",
            "url": "https://www.zimeye.net/2025/03/14/nssa-board-chair-questioned-in-extortion-case/",
            "content": "By A Correspondent| National Social Security Authority (NSSA) board chairperson Emmanuel Fundira was interviewed by police yesterday in connection with an extortion case involving Paula January.\n\nAlthough January is the one under investigation for extortion, Fundira was questioned based on audio recordings and text messages in which she mentioned him while making extortion demands against Rainbow Tourism Group (RTG) executives.\n\nFundira, who is being represented by Makiya and Partners Legal Practitioners, has not been charged with any wrongdoing. However, his name surfaced in the ongoing probe linked to the targeting of RTG executives.\n\nThis comes amid concerns that RTG executives are being pursued as part of a broader scheme to weaken the tourism giants stock. NSSA, which holds a 91.6% stake in RTG, recently announced plans to dispose of 56% of its shares, prompting speculation about attempts to devalue the company for potential buyers.\n\nInvestigations into RTG executives for alleged financial misconductcovering salaries, gratuities, and allowanceswere dismissed by the tourism groups board as baseless. Minister of Public Service, Labour, and Social Welfare Edgar Moyo previously held a meeting between NSSA and RTG board members, where it was agreed that Fundira would engage the Zimbabwe Anti-Corruption Commission (ZACC) to address the allegations.\n\nRTG board chairperson Douglas Hoto confirmed that discussions were underway to resolve the matter, emphasizing that RTG remained committed to transparency and corporate governance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| National Social Security Authority (NSSA) board chairperson Emmanuel Fundira was interviewed by police yesterday in connection with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/nssa-board-chair-questioned-in-extortion-case/\">Continue reading<span class=\"screen-reader-text\"> \"NSSA Board Chair Questioned In Extortion Case\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "Human Rights Defender Blasts Minister Garwe for Targeting Vendors",
            "url": "https://www.zimeye.net/2025/03/14/human-rights-defender-blasts-minister-garwe-for-targeting-vendors/",
            "content": "By Tatenda Maposa, Human Rights Defender\n\nThe ultimatum issued by the Minister of Local Government and Public Works, Daniel Garwe, does not offer a solution to Zimbabwes ongoing economic challenges. With the countrys inflation rate standing at 57.5% according to the Consumer Price Index, and over 80% of the population engaged in informal economic activities, Garwes approach seems misinformed and ineffective.\n\nInstead of exploring innovative ways to address the informal sector, the minister has resorted to authoritarian tactics that fail to address the root causes of the issue.\n\nIt is critical for the minister to recognize that informal employment in Zimbabwe is linked to vulnerability, including heightened risks of food insecurity, limited employment rights, and inadequate social protection. Rather than resorting to heavy-handed measures, the government should consider solutions that take these challenges into account.\n\nWe call on Minister Garwe to reconsider his stance and work toward people-centered solutions that acknowledge the hardships citizens are currently enduring.\n\nReports from various towns have highlighted instances where local councils are seizing peoples belongings by force. This raises serious concerns about how such actions will be accounted for by the nation. The people feel that the minister has made decisions in isolation, without proper consultation with citizens. As a result, his actions are likely to deepen the suffering of already vulnerable populations, further exacerbating poverty.\n\nWe urge the government to establish designated, affordable spaces for informal vendors and to formalize the sector, which already plays a significant role in the countrys GDP. Rather than relying on harsh measures, it is essential to implement economic policies that create sustainable solutions, enabling the development of a world-class Zimbabwe with a thriving, viable economy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tatenda Maposa, Human Rights Defender The ultimatum issued by the Minister of Local Government and Public Works, Daniel Garwe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/human-rights-defender-blasts-minister-garwe-for-targeting-vendors/\">Continue reading<span class=\"screen-reader-text\"> \"Human Rights Defender Blasts Minister Garwe for Targeting Vendors\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        },
        {
            "title": "ZANU PF Announces Nov Coup Orders On Shaddy",
            "url": "https://www.zimeye.net/2025/03/14/zanu-pf-announces-nov-coup-orders-on-shaddy/",
            "content": "Harare South ZANUPF official Shadreck Mashayamombe has been slapped with a prohibition order onsimilar grounds as those that subjected @edmnangagwa around 6 Nov 2017 for disloyalty, treachery, andviolation of the Code of Conduct. MORE TO FOLLOW.\n\nHarare South@ZANUPF_OfficialShadreck Mashayamombe has been slapped with a prohibition order on similar grounds as those that subjected@edmnangagwaaround 6 Nov 2017 for disloyalty, treachery, and violation of the Code of Conduct.pic.twitter.com/9HnXnwZjnM\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare South ZANUPF official Shadreck Mashayamombe has been slapped with a prohibition order on similar grounds as those that subjected … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/14/zanu-pf-announces-nov-coup-orders-on-shaddy/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Announces Nov Coup Orders On Shaddy\"</span></a></p>",
            "time": "09:07",
            "date": "15 Mar 2025"
        }
    ]
}