{
    "news": [
        {
            "title": "Trump Punishes Zim Sex Workers",
            "url": "https://www.zimeye.net/2025/05/17/trump-punishes-zim-sex-workers/",
            "content": "By Health Reporter- The recent cuts to USAID funding for NGOs in Zimbabwe have severely impacted the countrys sex workers, particularly in Mutare, where access to vital HIV prevention medication has been disrupted.\n\nSex workers operating near the Forbes Border Postwho primarily serve truck drivers and other transient clientssay the withdrawal of USAID-supported organisations has left them without access to pre-exposure prophylaxis (PrEP), a medication that significantly reduces the risk of contracting HIV.\n\nPrEP, which involves a daily antiretroviral pill (typically a combination of tenofovir and emtricitabine), has been proven to reduce HIV infection by up to 99% when taken consistently. It is specifically targeted at high-risk groups, including sex workers, injection drug users, and people in relationships with HIV-positive partners.\n\nWithout this critical support, sex workers in Mutare say they are now more vulnerablenot only to HIV but also to a host of social and economic hardships.\n\nIn response, the Senate Thematic Committee on HIV and AIDS has launched a nationwide consultation to assess access to HIV prevention and sexual and reproductive health services among sex workers. During a recent visit to a well-known hideout near Forbes Border Post, senators heard harrowing stories of survival, discrimination, and pleas for support.\n\nRophina, a sex worker who spoke during the visit, said the absence of PrEP is exposing them to serious risk.\n\nWe are seeing more clients refusing to use protection. Some truck drivers even abandon us on the road without paying. Business is down, and competition is stiff, especially with younger girls joining the trade, she said.\n\nRophina added that drug abuseoften facilitated by foreign truckersis becoming rampant among younger sex workers, leading some to default on their medication.\n\nThats why we are appealing for the government to make PrEP available at all times. Even with protection, condoms can burst. We also need help tackling drug abuse, which is worsening our situation, she said.\n\nA middle-aged sex worker, using the pseudonym Margarine, urged the government to provide vocational training and educational scholarships to help them exit the industry.\n\nMany of us passed O-Level and A-Level exams. We just need opportunitiesscholarships, training, or business supportto transition into decent work, she said.\n\nThe thematic committees chairperson, Senator Angeline Tongogara, said the visits are part of a fact-finding mission to evaluate the accessibility and effectiveness of HIV and reproductive health services for sex workers. The goal, she said, is to reduce HIV prevalence and improve the well-being of this marginalised group.\n\nWe are gathering insights to make recommendations that will enhance access to health services for sex workers, said Senator Tongogara.\n\nNational AIDS Council (NAC) Director of Monitoring and Evaluation, Mr. Amen Mpofu, confirmed that current PrEP supplies are now restricted to pregnant and breastfeeding women following new US Government funding policies.\n\nWe have sufficient antiretroviral drugs for treatment. The Global Fund is supporting 710,000 patients, and the US has ordered ARVs that will last until September 2025, said Mr. Mpofu.\n\nHe warned, however, that the biggest casualties of the aid cuts are PrEP and voluntary male circumcision programmes.\n\nTo cover the shortfall, NAC will procure PrEP through domestic resources, including the AIDS Levy, which is a critical home-grown solution, he added.\n\nMr. Mpofu urged government planning for a future without external support after 2026, calling for local funding strategies to sustain HIV prevention programmes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Health Reporter- The recent cuts to USAID funding for NGOs in Zimbabwe have severely impacted the country’s sex workers, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/trump-punishes-zim-sex-workers/\">Continue reading<span class=\"screen-reader-text\"> \"Trump Punishes Zim Sex Workers\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "DeMbare Fans Threaten To Boycott Harare Derby Over Poor Team Management",
            "url": "https://www.zimeye.net/2025/05/17/dembare-fans-threaten-to-boycott-harare-derby-over-poor-team-management/",
            "content": "Sports Correspondent\n\nSupporters of Harare giants Dynamos FC have threatened to boycott their upcoming clash with fierce rivals Caps United, set to take place at Rufaro Stadium on Sunday.\n\nThe protest is rooted in growing dissatisfaction with the leadership of club boss Bernard Marriott Lusengo, whom many fans blame for the teams continued struggles.\n\nIn a strongly worded statement issued Friday, the Dynamos Mambara Chapter said the problems facing the club start with the owner and extend to the fans.\n\nMa problem eku Dembare anotangira ku muridzi wayo kusvika kumafans, the group said, pointing fingers at Lusengos management style.\n\nThey also expressed frustration over a perceived lack of communication and direction from club leadership, saying: Ichi tikungochinzwa pa social media, atisi kuziva kuti ndiyani ati tigare kumba.\n\nThe statement further highlighted confusion over who truly represents the clubs interests: Dembare ine varidzi, ma chapter ane varidzi, kozotiwo vanhuwo vanoti tisu masapota chaiwo chaiwo.\n\nThe group referenced past incidents to illustrate their grievances, recalling: Izvezvi kumisa bus apa kuti ma chapters pindai arisvike Bulawayo, munenge matukanwa, marovanwa, zvekusatozotaudzana.\n\nChallenging the logic of a proposed boycott, they added: Okay mati imimi derby empty stadium muchamisa here? Makepe kepe kupinda mu ground?\n\nTensions are clearly mounting ahead of the high-stakes derby, as discontent among Dynamos supporters continues to rise.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Supporters of Harare giants Dynamos FC have threatened to boycott their upcoming clash with fierce rivals Caps United, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/dembare-fans-threaten-to-boycott-harare-derby-over-poor-team-management/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Fans Threaten To Boycott Harare Derby Over Poor Team Management\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "No Shortage Of ARVs In Country, Government Claims- But How True Is This?",
            "url": "https://www.zimeye.net/2025/05/17/no-shortage-of-arvs-in-country-government-claims-but-how-true-is-this/",
            "content": "By A Correspondent\n\nDespite growing concerns about shortage of essential drugs, government insists there is adequate supply of Anti- Retroviral drugs (ARVs) in Zimbabwe.\n\nBut questions remain as to whether the official narrative aligns with on-the-ground realities.\n\nAddressing the media on Friday, 16 May, Health and Child Care Minister Douglas Mombeshora dismissed reports of ARV shortages and promised accountability regarding troubling allegations of patient exploitation.\n\nThe Ministry takes these reports with the utmost seriousness, said Mombeshora.\n\nAs the custodians of public health, we are committed to addressing these concerns openly and truthfully, while ensuring that the rights and dignity of all people living with HIV are protected.\n\nMombeshora categorically denied claims that the country was running out of life-saving ARV medication, asserting that Zimbabwes stock levels remain stable.\n\nThere is no risk of stock-outs for all treatment regimens, he declared. According to the Minister, the country currently has eight months worth of adult first-line ARVs and four months of paediatric first-line ARVs in reserve.\n\nHe further detailed that the Ministry follows a minimum-maximum inventory system to monitor supply levels, with 14 months as the maximum and 8 months as the minimum threshold. Shipments of a new fixed-dose combination paediatric ARV are also expected to arrive in July, adding another five months coverage.\n\nHowever, his reassurances contrast with growing public outcry from areas like Chiredzi, where some patients report being forced to pay for ARVs or being denied access altogether. Social media has been awash with claims of healthcare workers selling drugs illegally and extorting vulnerable patients.\n\nMombeshora acknowledged these concerns, saying: Immediate investigations are underway, and any healthcare worker found guilty will face swift disciplinary action. No one entrusted with the duty of care should ever exploit the vulnerable.\n\nHe reiterated that ARVs are provided free of charge and urged patients who encounter demands for payment to report such cases directly to authorities. Contact the Provincial Medical Director, the District Medical Officer, the Zimbabwe Republic Police, or my office, he said.\n\nDelays in drug shipments earlier this yearcaused by a Stop Work Order from the U.S. Governmentalso fuelled fears of shortages. Mombeshora admitted the disruptions but said domestic intervention bridged the gap.\n\nOur ART medicine requirements for 2025 are fully funded. We mobilised domestic resources through the National AIDS Council to ensure uninterrupted supply, he said.\n\nStill, some observers remain sceptical, pointing out inconsistencies between government claims and patient experiences in clinics.\n\nAs public scrutiny intensifies, the Ministry has pledged to protect gains made toward the UNAIDS 95-95-95 targets to end AIDS by 2030. Yet, the pressing question persists: if there is truly no shortage, why are patients in some areas still struggling to access free treatment?\n\nUntil investigations are concluded and accountability enforced, the governments claims may continue to be met with doubt from those on the ground.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Despite growing concerns about shortage of essential drugs, government insists there is adequate supply of Anti- Retroviral … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/no-shortage-of-arvs-in-country-government-claims-but-how-true-is-this/\">Continue reading<span class=\"screen-reader-text\"> \"No Shortage Of ARVs In Country, Government Claims- But How True Is This?\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "Veteran Karate Master Dies",
            "url": "https://www.zimeye.net/2025/05/17/veteran-karate-master-dies/",
            "content": "VETERAN karateka Sensei Mugove Muhambi, who represented Zimbabwe on several international stages, died on Saturday morning following a fatal road traffic accident along Borrowdale Road in Harare.\n\nSensei Muhambi was a highly respected figure in Zimbabwes martial arts community, known not only for his skill and discipline but also for his dedication to nurturing young talent across the country. Over the years, he competed in numerous regional and international tournaments, flying Zimbabwes flag high and earning accolades for his commitment to the sport.\n\nBeyond the dojo, Muhambi was deeply involved in community work, often using karate as a tool to instill discipline, confidence, and purpose among youth. His efforts in promoting the martial art in schools and communities helped popularize karate as both a sport and a way of life in Zimbabwe.\n\nFellow martial artists and students have described his death as a major loss to the karate fraternity and the nation at large. Tributes have poured in from across the country and abroad, with many remembering him as a humble, passionate, and inspiring mentor.\n\nDetails of his funeral arrangements will be announced in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VETERAN karateka Sensei Mugove Muhambi, who represented Zimbabwe on several international stages, died on Saturday morning following a fatal road … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/veteran-karate-master-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran Karate Master Dies\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "British Embassy Disproves Hopewell Chin’ono’s Claim That He Was UK-Police-Cleared For Money Laundering Of Fake Sportscar Property Wealth",
            "url": "https://www.zimeye.net/2025/05/17/british-embassy-disproves-hopewell-chinonos-claim-that-he-was-uk-police-cleared-for-money-laundering-of-fake-sportscar-property-wealth/",
            "content": "The British embassy @ukinzimbabwe issued a statement that disproves Mr Hopewell Chinonos claim that says he once obtained a police clearance declaration that he is not a fugitive from justice in Britain.\n\nThe development might put an end to long running social media narratives the journalist has been generating using a political allegations-cover-letter-since 2011 encouraging identity scammers, saying that they will never be discovered. In 2024 alone two airport scammers were publicly encouraged by the journalist (29 April 2024-26 Aug 2024), and one of them tried to hack Gatwick Airports database to delete her fake name entered UK with in the same year 2001, that Hopewell Chinono changed his own name.\n\nIn a 6 hour spaces podcast in Feb 2024, Mr Chinono, who has operated identity documents with at least 3 different names, repeatedly declared saying the British Government had to issue a statement to say Hopewell Chinono is not a fugitive from justice in Britain.  A political support letter he publicised dated 2011, hes used to encourage airport security violations, has no such wording, and ZimEye wrote to the embassy requesting the alleged disclosure. Chinono success in evading scrutiny last year alone encouraged at least two people to violate airport security, and a friend in Aug 2024 moved on to try to hack Gatwick Airport database to delete a fake name she used in the same notorious year, 2001, when Chinono rushed to also change his name. This is the same year, many identity scammers (including the 9/11 bombers ) committed injustices against the US and UK airport jurisdictions due to technological loopholes only closed up 14 years later.\n\nResponding to questions, the embassy publicised their response stating broadly, that it has never at any time issued a police clearance check. The British Embassy in Harare does not issue police clearances, the statement read. The embassy then afterwards directed Mr Chinono and anyone being potentially misled by his statements, saying You can apply for a basic disclosure here:\n\nChinono @daddyhope was reached for comment.\n\nThe public now expect Mr Chinono to disclose the UK company he says financed his first property in a 50,000 sportscar loan in 1996. He has previously contradicted himself saying he was financed by no UK money and that it was a local CABS Zimbabwe bank mortgage worth USS60,000. .\n\nFULL STORY FOLLOWS BELOW\n\nThe British embassy@ukinzimbabweissued a statement that disproves Mr Hopewell Chinonos claim that says he once obtained a police clearance declaration that he is not a fugitive from justice in Britain.In a 6 hour spaces podcast in Feb 2024, Mr Chinono, who has operatedhttps://t.co/rZbCylnsIzpic.twitter.com/D9WOFtKEf6\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The British embassy @ukinzimbabwe issued a statement that disproves Mr Hopewell Chin’ono’s claim that says he once obtained a police … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/british-embassy-disproves-hopewell-chinonos-claim-that-he-was-uk-police-cleared-for-money-laundering-of-fake-sportscar-property-wealth/\">Continue reading<span class=\"screen-reader-text\"> \"British Embassy Disproves Hopewell Chin’ono’s Claim That He Was UK-Police-Cleared For Money Laundering Of Fake Sportscar Property Wealth\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "Is ZEC’s Call For Peaceful Campaign Ahead Of Gutu Gutu East By-election Sincere?",
            "url": "https://www.zimeye.net/2025/05/17/is-zecs-call-for-peaceful-campaign-ahead-of-gutu-gutu-east-by-election-sincere/",
            "content": "By A Correspondent\n\nThe Zimbabwe Electoral Commission recently called for peace and adherence to the Electoral Code of Conduct ahead of the Gutu East parliamentary by-election scheduled for June 14, 2025.\n\nWith three candidates in the fray, this call is crucial for a credible electoral process.\n\nThe Zimbabwe Electoral Commission emphasized the importance of upholding the code of conduct, stating that political parties and contestants must ensure a peaceful election by shunning violence and intimidation for a credible outcome.\n\nThis message was echoed by the Zimbabwe Electoral Commission Midlands Provincial Election Officer, who stressed the need for peace during the electoral process.\n\nThe three candidates contesting the by-election are Zvarevashe Masvingise of ZANU-PF, Gift Gonese as an independent candidate, and Zivanjo Givanai Nzvenga of the National Constitutional Assembly.\n\nThe Zimbabwe Electoral Commissions call for peaceful elections highlights the need for all stakeholders to work towards a credible outcome.\n\nThe sincerity of this call remains to be seen as the by-election approaches.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Electoral Commission recently called for peace and adherence to the Electoral Code of Conduct ahead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/is-zecs-call-for-peaceful-campaign-ahead-of-gutu-gutu-east-by-election-sincere/\">Continue reading<span class=\"screen-reader-text\"> \"Is ZEC’s Call For Peaceful Campaign Ahead Of Gutu Gutu East By-election Sincere?\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "Fatal Accident: Harare Fitness Trainer Sensei Mugove Muhambi Dies in Head-On Collision",
            "url": "https://www.zimeye.net/2025/05/17/fatal-accident-harare-fitness-trainer-sensei-mugove-muhambi-dies-in-head-on-collision/",
            "content": "Harare  Saturday, 17 May 2025\n\nBy Farai D Hove | ZimEye | Popular Harare fitness trainer Sensei Mugove Mugo Muhambi has died in a tragic car crash following a violent head-on collision between a Honda Fit and a Toyota GD6 along Borrowdale Road early this morning.\n\nAccording to eyewitnesses, the impact occurred around dawn, leaving both vehicles completely mangled. The Honda Fit, driven by Sensei Mugo, bore the brunt of the collision and was crushed beyond recognition. He died on the spot.\n\nPhotos from the scene show a horrific wreckage  debris strewn across the road, one vehicle flipped upside down, and thick smoke hanging in the morning air as bystanders looked on in shock.\n\nTraffic was briefly halted as emergency responders and police attended the scene. The cause of the crash is still under investigation, but preliminary reports suggest high speed may have been a contributing factor.\n\nMourners have already taken to social media to express heartbreak over the death of Sensei Mugo, widely known for his dedication to wellness, community boot camps, and motivating hundreds through his fitness journey.\n\nHe was more than a trainer  he was a brother, a mentor, and a true warrior spirit, wrote one of his clients.\n\nFurther details, including funeral arrangements, are expected to be released by the family in due course.\n\nMHDSRIP.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – Saturday, 17 May 2025 By Farai D Hove | ZimEye | Popular Harare fitness trainer Sensei Mugove “Mugo” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/fatal-accident-harare-fitness-trainer-sensei-mugove-muhambi-dies-in-head-on-collision/\">Continue reading<span class=\"screen-reader-text\"> \"Fatal Accident: Harare Fitness Trainer Sensei Mugove Muhambi Dies in Head-On Collision\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "Geza Challenges Gen Chiwenga To Remove ” Munhu Wako Mnangagwa” Who Is Now Troubling Whole Nation",
            "url": "https://www.zimeye.net/2025/05/17/geza-challenges-gen-chiwenga-to-remove-munhu-wako-mnangagwa-who-is-now-troubling-whole-nation/",
            "content": "By A Correspondent\n\nOutspoken war veteran Blessed Geza has accused First Lady Auxillia Mnangagwa of capturing state power and effectively taking control of Zimbabwes affairs.\n\nIn a fiery address on Friday night, Geza said, I have come to speak about General Chiwenga. He recalled the events of 2017, when the military led by Chiwenga intervened to remove President Robert Mugabe, claiming he was surrounded by corrupt officials. The operation led by General Chiwengawe all know it, said Geza.\n\nHe stated that Chiwenga invoked the Constitution, saying the military had a duty to act when the Constitution was under threat. The man next to him was General SB Moyo. I remember his words: We are not entering to do anything else other than address the thieves surrounding the president.'\n\nGeza criticized President Emmerson Mnangagwa, saying, What shocks me is that the man who is ruling now had run away to South Africa. He claimed Mugabe had warned Chiwenga against trusting Mnangagwa, allegedly saying, Chiwenga, I decided to hand over to you. This person you want to take overyoull regret it one day. Geza blamed the current crisis on the decision to reinstate Mnangagwa, saying, The problems we are now seeing in the country are because of that decision by the generals.\n\nHe called on Chiwenga to take responsibility and correct the mistake, saying, The ones who must fix this are the generalsGeneral Chiwenga. I said to Comrade Bombshell, and the people are saying: Please remove this person you imposed.'\n\nReferring to a liberation war anthem, Geza said, Chiwenga and the generals know a wartime song called Nzira dzemaSoja dzekuzvibatana nadzothe soldiers code of conduct. It is our guiding light, our contract with the masses. When we went to war, Chiwenga was the one who taught us this song.\n\nTurning to allegations of corruption, he said, In the case of Zvigananda, they took army companies without paying a penny. They took Command Agriculture money and never repaid it. They seized the national fuel pipeline and didnt pay a cent. This isnt the way of the soldiers.\n\nGeza expressed concern over the detention of political prisoners and protestors, saying, We have people like Job Sikhala, Jacob Ngarivhume, Blessed Mhlangaprotesters arrested for demonstrating. Whats their crime? We hear their only crime is being associated with money that went into Emmersons bank account. So why are you oppressing these boys? Why are you denying them bail? This needs fixing.\n\nHe urged military leaders to act, saying, All this is happening in the eyes of Gen Chiwenga and Gen Sanyatwe. The povothe peopleare crying: Please redeem us. We beg you.'\n\nGeza accused Auxillia Mnangagwa of being the real power behind the presidency, saying, We are seeing state capture. If we look at South Africa, this is what destroyed Comrade Jacob Zuma. Under Mugabe, there was an allegation that state power was sexually transmitted. This time, its no longer an allegation. Its a fact. Auxillia Mnangagwa is now in control.\n\nConcluding his remarks, Geza condemned the silence of the generals. Generals, you have let us down. Why is it, Gen Chiwenga, that youre failing to give orders to [Police Commissioner] Mutamba to arrest the Zviganandas? We are stuck in the bush, and no one seems to care.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Outspoken war veteran Blessed Geza has accused First Lady Auxillia Mnangagwa of capturing state power and effectively … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/geza-challenges-gen-chiwenga-to-remove-munhu-wako-mnangagwa-who-is-now-troubling-whole-nation/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Challenges Gen Chiwenga To Remove ” Munhu Wako Mnangagwa” Who Is Now Troubling Whole Nation\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "Please Rescue Nation From Mnangagwa Misrule, Geza Appeals To Army Commanders",
            "url": "https://www.zimeye.net/2025/05/17/please-rescue-nation-from-mnangagwa-misrule-geza-appeals-to-army-commanders/",
            "content": "By A Correspondent\n\nOutspoken war veteran Blessed Geza has launched a scathing attack on the countrys leadership, accusing First Lady Auxillia Mnangagwa of capturing state power and calling on military commanders to intervene and save Zimbabwe from what he described as a national crisis.\n\nIn a fiery address on Friday night, Geza opened by saying, I have come to speak about General Chiwenga, as he reflected on the 2017 military intervention that led to the ousting of former President Robert Mugabe. Geza reminded the nation of how the army, led by then-Commander Constantino Chiwenga, acted to remove Mugabe, citing the influence of corrupt officials. The operation led by General Chiwengawe all know it, he said.\n\nGeza emphasized that the military had invoked the Constitution to justify their actions at the time. The man next to him was General SB Moyo. I remember his words: We are not entering to do anything else other than address the thieves surrounding the president,' he recalled.\n\nTurning to President Emmerson Mnangagwa, Geza leveled sharp criticism, saying, What shocks me is that the man who is ruling now had run away to South Africa. He further alleged that Mugabe had advised Chiwenga against trusting Mnangagwa, reportedly warning, Chiwenga, I decided to hand over to you. This person you want to take overyoull regret it one day.\n\nGeza held the military leadership responsible for what he sees as the nations current turmoil, stating, The problems we are now seeing in the country are because of that decision by the generals. He urged Chiwenga to rectify the mistake: The ones who must fix this are the generalsGeneral Chiwenga. I said to Comrade Bombshell, and the people are saying: Please remove this person you imposed.'\n\nQuoting a wartime anthem to press his point, Geza said, Chiwenga and the generals know a wartime song called Nzira dzemaSoja dzekuzvibatana nadzothe soldiers code of conduct. It is our guiding light, our contract with the masses. When we went to war, Chiwenga was the one who taught us this song.\n\nHe went on to detail allegations of corruption under the current administration, saying, In the case of Zvigananda, they took army companies without paying a penny. They took Command Agriculture money and never repaid it. They seized the national fuel pipeline and didnt pay a cent. This isnt the way of the soldiers.\n\nGeza also condemned the detention of political activists and protestors. We have people like Job Sikhala, Jacob Ngarivhume, Blessed Mhlangaprotesters arrested for demonstrating. Whats their crime? We hear their only crime is being associated with money that went into Emmersons bank account. So why are you oppressing these boys? Why are you denying them bail? This needs fixing.\n\nCalling on the military leadership to take decisive action, Geza declared, All this is happening in the eyes of Gen Chiwenga and Gen Sanyatwe. The povothe peopleare crying: Please redeem us. We beg you.'\n\nHe accused First Lady Auxillia Mnangagwa of wielding undue influence, stating, We are seeing state capture. If we look at South Africa, this is what destroyed Comrade Jacob Zuma. Under Mugabe, there was an allegation that state power was sexually transmitted. This time, its no longer an allegation. Its a fact. Auxillia Mnangagwa is now in control.\n\nIn conclusion, Geza lamented the silence of top military officials, asking, Generals, you have let us down. Why is it, Gen Chiwenga, that youre failing to give orders to [Police Commissioner] Mutamba to arrest the Zviganandas? We are stuck in the bush, and no one seems to care.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Outspoken war veteran Blessed Geza has launched a scathing attack on the country’s leadership, accusing First Lady … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/please-rescue-nation-from-mnangagwa-misrule-geza-appeals-to-army-commanders/\">Continue reading<span class=\"screen-reader-text\"> \"Please Rescue Nation From Mnangagwa Misrule, Geza Appeals To Army Commanders\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        },
        {
            "title": "Chamisa Loyalist Defects From Tshabangu’s CCC",
            "url": "https://www.zimeye.net/2025/05/17/chamisa-loyalist-defects-from-tshabangus-ccc/",
            "content": "By A Correspondent- A Nelson Chamisa close senior member of the Citizens Coalition for Change (CCC), Gift Gonese, who contested the 2023 general election under the party banner, has distanced himself from the faction led by Sengezo Tshabangu and registered to contest the upcoming Gutu East by-election as an independent candidate.\n\nGonese will face off against Zivanai Nzvenga of the National Constitutional Assembly (NCA) and Zanu PFs Zvavaresha Masvingise in the by-election scheduled for June 14, 2025.\n\nThis latest development marks yet another high-profile defection from the Tshabangu-led CCC faction, amid growing divisions and contestations over leadership and candidate selection within the opposition movement.\n\nDespite Citizens Coalition for Change founder Nelson Chamisa currently on political sabbatical, sources indicate that Gonese still enjoys significant backing from Chamisas loyalists, who are rallying behind his independent candidacy.\n\nSpeaking toThe Masvingo Mirrorafter filing his nomination papers at the Masvingo Magistrates Court, Gonese alleged that the 2023 election was rigged in favour of Zanu PF. He said the people of Gutu East were fully aware of what he termed electoral manipulation and expressed confidence in his prospects.\n\nPeople in Gutu East are well aware that elections to Zanu PF are about rigging. They know that the ground is not even, and the path to the election is thorny. I am back in the ring at the invitation of the citizens. We have done a lot of groundwork, and we are confident of delivering victory, said Gonese.\n\nThe nomination process was conducted in Court 2 of the Masvingo Magistrates Court before a Zimbabwe Electoral Commission (ZEC) nomination officer and two assessors.\n\nNCA candidate Zivanai Nzvenga acknowledged that his party is still small and was unable to field a candidate in 2023. However, he expressed optimism about his chances in the upcoming poll.\n\nZanu PFs candidate, Zvavaresha Masvingiseformer councillor for Ward 14 in Gutu Eastsaid he had done his homework. However, his candidacy is not without controversy. A faction within Zanu PF is reportedly unhappy with the outcome of the partys primary election process, alleging that the primaries were rigged in Masvingises favour and vowing to undermine his campaign.\n\nMasvingise is running under the Zanu PF banner following the expulsion of former MP Benjamin Ganyiwa, a move some believe was politically motivated due to Ganyiwas alleged links to Vice President Constantino Chiwengas faction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- A Nelson Chamisa close senior member of the Citizens Coalition for Change (CCC), Gift Gonese, who contested … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/17/chamisa-loyalist-defects-from-tshabangus-ccc/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Loyalist Defects From Tshabangu’s CCC\"</span></a></p>",
            "time": "06:42",
            "date": "18 May 2025"
        }
    ]
}