{
    "news": [
        {
            "title": "Drama As Kaycee’s Wife Appears To Clash With Tallyn Over Corpse",
            "url": "https://www.zimeye.net/2025/06/08/drama-as-kaycees-wife-appear-to-clash-with-tallyn-over-corpse/",
            "content": "By Showbiz Reporter | ZimEye | There was drama at the funeral of Kaycie (Kudzaishe Chipadza), yesterday when his wife screamed at both the corpse and a yellowbone sociallite popularly known as Tallyn, using the confrontational phrase Tallyn wako auya, wawaitamba naye!.\n\nThe screamer was in the form of a mocking song.\n\nKaycie was reported dead earlier in the week and family members confirmed the development to ZimEye while weeping. Further confirmation was not possible and a report suggesting a police officer has verified the death remained unverified on Saturday.\n\nBut a whole funeral memorial was conducted for Kaycie which had a crowd assemble at Coventry.\n\nHis death comes at a time when the geo-tagged fraud convict of over five (5) years imprisonment(Kaycee), was facing new charges that include human trafficking and he was named in an investigative documentary covering his colleague Hopewell Chinonos operations since 1996 and in the last 14 years during which the journalisthas been using journalism-talk to cover up his falsehoods that he was police cleared by the British embassy in a 2011 letter that the consulate has made clear is no police clearance of him or any his multiple identities.\n\nhttps://www.facebook.com/share/v/1FyT76fcWx/?mibextid=wwXIfr\n\nFor years Kaycee and one of his girlfriends were both enjoying social media campaign support from Hopewell Chinono whose 29 April 2024 FB post was against Heathrow Airport security officers who caught the female suspect in their act.\n\nIn the video below another female colleague of Kaycees is greeted with loud singing from women visibly led by Kaycees widow, Beverly. Tallyn did not respond to requests for comment.\n\nvideo loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter | ZimEye | There was drama at the funeral of Kaycie (Kudzaishe Chipadza), yesterday when his wife … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/drama-as-kaycees-wife-appear-to-clash-with-tallyn-over-corpse/\">Continue reading<span class=\"screen-reader-text\"> \"Drama As Kaycee’s Wife Appears To Clash With Tallyn Over Corpse\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "Michael Nees Praises Impressive Kadewere…",
            "url": "https://www.zimeye.net/2025/06/08/michael-nees-praises-impressive-kadewere/",
            "content": "Sports Correspondent\n\nZimbabwe national team coach Michael Nees expressed satisfaction with Tinotenda Kadeweres performance, despite the Warriors 2-0 loss to Burkina Faso on Friday.\n\nKadewere, making his first appearance under Nees after a spell on the sidelines due to injury, started the match and played the full 90 minutes.\n\nI think Tinotenda Kadewere played very well. I didnt expect him to last 90 minutes, Nees said after the match. My plan was to play him for 60 minutes, but after Khama Billiat was substituted, Tino had to take on more responsibility. He showed quality and remains in good shape. I think he played excellently.\n\nThe coach also acknowledged the efforts of other debutants who featured in the match, emphasizing that the encounter was a valuable test against what he described as Burkina Fasos strongest team.\n\nWe have several new players, and we wanted to assess them to expand our pool of talent, Nees added.\n\nNewcomers Sean Fusire and Mason Mushore earned their first caps, while Bill Antonio also made his first appearance under Nees. Jonah Fabisch was named in the squad but did not feature in the game.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe national team coach Michael Nees expressed satisfaction with Tinotenda Kadewere’s performance, despite the Warriors’ 2-0 loss to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/michael-nees-praises-impressive-kadewere/\">Continue reading<span class=\"screen-reader-text\"> \"Michael Nees Praises Impressive Kadewere…\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "Emotional Send-Off For Zim Gospel Singer",
            "url": "https://www.zimeye.net/2025/06/08/emotional-send-off-for-zim-gospel-singer/",
            "content": "By A Correspondent\n\nBULAWAYO  Beloved gospel singer and spiritual leader, Pastor Siphethangani Sibanda, popularly known as Pastor Barak, was laid to rest at Umvutsha Park Cemetery in Bulawayo following a deeply emotional farewell attended by family, friends, and fellow musicians.\n\nPastor Barak passed away on Wednesday at the age of 47. He was remembered not only as a gifted gospel artist but also as a loving husband, devoted father, and a man of great spiritual impact whose music ministry transformed lives across Zimbabwe.\n\nA funeral service held at his Bulawayo church drew a large gathering, including prominent gospel musicians and long-time collaborators. Together, they paid tribute to a man many described as a pillar of strength in the local gospel scene.\n\nFellow gospel singer Everton Mlalazi, who shared the stage with Pastor Barak in the gospel ensemble Family Voices, said his loss was a huge blow to the entire ministry.\n\nWe are deeply saddened to have lost someone who was not only a mentor but also a beacon of love and a valued collaborator. His legacy will live on through the countless lives he touched, Mlalazi said.\n\nBrighton Ncube, also of Family Voices, echoed the sentiment.\n\nAs part of the Family Voices group, we are grieving the loss of a mentor, a champion of love, and a wonderful team player. He will be deeply missed, said Ncube.\n\nIn one of the most heartfelt moments of the ceremony, Pastor Baraks wife, Rachel Sibanda, paid tribute to her husbands loving nature and leadership, describing the pain of losing a man who had been her strength.\n\nI have lost a wonderful partner. Pastor Barak was a good man who radiated love and kindness. Wherever he went, he was followed by grace, and his leadership qualities shone through. He was often chosen to lead, not just because of his title, but because of his heart. I am going to miss him dearly, she said.\n\nPastor Baraks gospel journey spanned decades, during which he became a household name and source of encouragement to many through his uplifting songs and unwavering faith.\n\nWhile his passing leaves a void in the gospel music community, his message of love, unity, and devotion to God will continue to resonate with his followers and future generations alike.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent BULAWAYO – Beloved gospel singer and spiritual leader, Pastor Siphethangani Sibanda, popularly known as Pastor Barak, was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/emotional-send-off-for-zim-gospel-singer/\">Continue reading<span class=\"screen-reader-text\"> \"Emotional Send-Off For Zim Gospel Singer\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "CIO Operative Causes Chaos In Gutu",
            "url": "https://www.zimeye.net/2025/06/08/cio-operative-causes-chaos-in-gutu/",
            "content": "By A CorrespondentChaos erupted in Gutu District last Tuesday,  when a known Central Intelligence Organisation (CIO) operative, only identified by his nickname Stavo, allegedly led an illegal citizen arrest and harassment of local villagers engaged in voluntary roadside grass-clearing for school childrens safety.\n\nThe incident occurred at around 11 a.m. when Stavo, driving a red Honda Fit reportedly linked to previous political violence, blocked a highway and aggressively confronted a local resident who was part of the roadside maintenance initiative.\n\nThe confrontation escalated when four men exited the vehicle and surrounded the man in an intimidating formation.\n\nSoon after, Gutu Ward 35 Zanu PF Councillor and former Rural District Council CEO,Benson Kurauone Dandira, arrived in a white Nissan twin cab, accompanied by a group of party supporters.\n\nAccording to eyewitnesses, Dandiras entourage appeared ready to engage in violence, causing alarm among villagers, most of whom were armed only with sickles and slashers used for clearing the roadside.\n\nThis followed a morning campaign convoy involving Zanu PF officials in which an unregistered green Ford Ranger  believed to belong to the CIO  transported rally equipment through the same road.\n\nThe villagers say Stavo, previously seen at political gatherings and bars in the area, has developed a reputation for bullying and harassment in the district.\n\nDuring the confrontation, Stavo reportedly seized a mobile phone from local parentTendai Jayben, which had US$300 tucked inside its cover.\n\nWhen the phone was returned five hours later, the money was missing. Jayben said she was never informed about who had taken the money or why she had been detained.\n\nStavo is said to have shouted, You have been arrested, without identifying himself or presenting valid credentials.\n\nWhen the villagers demanded identification, he instead instructed a police officer namedO. Sibanda, allegedly known for accompanying such operations, to produce his ID.\n\nAccording to legal experts familiar with the case, Stavo claimed the arrest was conducted under the Feret system  a shadowy joint operations team comprising agents from the CIO, Criminal Investigations Department (CID), army, prisons, and police.\n\nHowever, arrest powers lie exclusively with the Zimbabwe Republic Police, raising questions about the legality of the entire operation.\n\nThe victim was forcibly taken toGutu Police Station, where he was detained for five hours without being formally charged. Dandira reportedly told the detainee that he had been arrested for clearing roadside grass without the councillors permission.\n\nCritics have described the incident as evidence of the increasing militarisation and politicisation of Zimbabwes intelligence services. This is not how a professional State intelligence agency should function. The CIO has become a militia at the service of Zanu PF, one human rights activist said.\n\nTheZimbabwe Human Rights Commission (ZHRC)last year released a report highlighting similar concerns, warning that intelligence officers were becoming too visible in political processes and were routinely involved in rights violations in rural areas.\n\nAttempts to reach the CIO Director General Fulton Mangwanyafor comment were unsuccessful.\n\nThis latest incident adds to growing calls for security sector reforms amid fears that State institutions are being repurposed into partisan instruments of repression.\n\n-Online\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– Chaos erupted in Gutu District last Tuesday, when a known Central Intelligence Organisation (CIO) operative, only identified by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/cio-operative-causes-chaos-in-gutu/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Operative Causes Chaos In Gutu\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "Chamisa being sarcastic about crocodiles",
            "url": "https://www.zimeye.net/2025/06/08/chamisa-being-sarcastic-about-crocodiles/",
            "content": "I LOVE NATUREThis river is so crocodile-infested but they all just disappeared the moment I got here. I generally dont trust crocodiles!!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I LOVE NATURE…This river is so crocodile-infested but they all just disappeared the moment I got here. I generally don’t … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/chamisa-being-sarcastic-about-crocodiles/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa being sarcastic about crocodiles\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "ZANU PF Claims Credit for Promoting Peace As Zimbabwe Burns",
            "url": "https://www.zimeye.net/2025/06/08/zanu-pf-claims-credit-for-promoting-peace-as-zimbabwe-burns/",
            "content": "By A Correspondent\n\nHARARE  ZANU PF has defended its record on peace and racial harmony, with party spokesperson Christopher Mutsvangwa claiming the ruling party has moved mountains to promote unity both within Zimbabwe and across the region, despite persistent socio-economic challenges.\n\nIn a statement issued last week, Mutsvangwa sought to position the partyand President Emmerson Mnangagwa in particularas champions of racial tolerance and mediators of peace. He argued that Zimbabwe under Mnangagwas leadership is an example of peaceful racial co-existence in Africa.\n\nPresident Mnangagwa has gone out of his way to engage with white communities, Mutsvangwa said, highlighting what he described as a deliberate effort to include diverse voices in the countrys political and economic spheres.\n\nThe President has appointed individuals from various racial backgrounds to key cabinet positions as a clear demonstration of this commitment.\n\nThese comments come at a time when Zimbabwe is grappling with a deepening economic crisis marked by inflation, rising unemployment, and widespread public discontent. Critics argue that the ruling partys rhetoric about harmony does not reflect the lived realities of many citizens.\n\nNonetheless, Mutsvangwa insisted that Zimbabwes leadership is making positive contributions beyond its borders as well. On a regional scale, he claimed that Mnangagwa played a discreet but effective role in defusing racial tensions in South Africa.\n\nPresident Mnangagwa also played a mediating role in easing tensions between South African President Cyril Ramaphosa and the Afrikaner community, further underscoring his dedication to fostering racial harmony, he said.\n\nWhile the claims have sparked debate, with opposition figures questioning their validity amid growing unrest, ZANU PF maintains that its policies and outreach efforts are aimed at building a more inclusive and peaceful society.\n\nThe ruling partys stance comes as it gears up for another election cycle and faces increasing pressure to address the root causes of the countrys economic and political instability. Whether such declarations of peace-building will resonate with the broader population remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – ZANU PF has defended its record on peace and racial harmony, with party spokesperson Christopher … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/zanu-pf-claims-credit-for-promoting-peace-as-zimbabwe-burns/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Claims Credit for Promoting Peace As Zimbabwe Burns\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "Government Bans Musombondiya",
            "url": "https://www.zimeye.net/2025/06/08/government-bans-musombondiya/",
            "content": "By A Correspondent\n\nThe government has officially outlawed the manufacture and distribution of illicit alcoholic brews popularly known as musombodhiya or kambwa. This prohibition was enacted through Statutory Instrument 62 of 2025, issued by the Minister of Home Affairs, Kazembe Kazembe, under the Harmful Liquids Act. The amendment, titled theHarmful Liquids Act (Amendment of Schedule to Act) Notice, 2025, expands the scope of banned substances.\n\nAccording to the statutory instrument, the Acts schedule now includes any unregulated, unauthorised or illegally produced alcoholic beverages containing ethanol, including those referred to by street names such as kambwa or musombodhiya.\n\nThe move comes amid growing public concern over the widespread use of dangerous homemade brews and other harmful substances, such as methamphetaminecommonly known locally as guka, mutoriro, or dombo.\n\nIn response, an inter-ministerial committee has been established to address the escalating crisis of drug and alcohol abuse, particularly among the youth. Plans are also underway for the development of rehabilitation centres to support recovery efforts.\n\nCommunity leaders and other stakeholders have emphasized the need for sustainable youth empowerment initiatives, particularly income-generating projects, as a way to combat the root causes of substance abuse, with youth idleness identified as a key driver of the problem.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The government has officially outlawed the manufacture and distribution of illicit alcoholic brews popularly known as “musombodhiya” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/government-bans-musombondiya/\">Continue reading<span class=\"screen-reader-text\"> \"Government Bans Musombondiya\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "Stop Abusing Dr Joshua Nkomo’s Legacy, ZAPU Challenges Zanu PF",
            "url": "https://www.zimeye.net/2025/06/08/stop-abusing-dr-joshua-nkomos-legacy-zapu-challenges-zanu-pf/",
            "content": "By A Correspondent\n\nZAPU has slammed Zanu PF for what it calls the shameless exploitation of the legacy of the late Vice President Dr Joshua Mqabuko Nkomo in the ruling partys campaign efforts ahead of the June 14 Insiza South by-election.\n\nThis comes after Zanu PF officials repeatedly invoked the name of Father Zimbabwe during a weekend rally in Insiza, where party heavyweights including Industry Minister Nqobizitha Mangaliso Ndlovu, Deputy ICT Minister Dingumuzi Phuti, former Matabeleland South Minister Abednico Ncube, and ex-Cabinet Minister Andrew Langa gathered in support of the partys candidate, Delani Moyo.\n\nZanu PF Political Commissar Munyaradzi Machacha claimed Dr Nkomo had endorsed the partys land reform policies, stating:\n\nEven on his death bed he held President Mugabe by his hand and asked him to promise that, even if he dies, the land redistribution programme was not going to be halted, but instead would be fast-tracked so that people get value for what they fought for.\n\nBut ZAPU has condemned these remarks, accusing Zanu PF of distorting history and dishonouring Nkomos true legacy.\n\nZanu PF has no moral standing to speak on behalf of Dr Nkomo or use his legacy to score political points, said a senior ZAPU official who requested anonymity.\n\nIt is the same party that persecuted him and his supporters, forced a Unity Accord under duress, and continues to marginalise Matabeleland to this day. Invoking his name now is not only hypocritical, its deeply offensive to those who truly knew what he stood for.\n\nZanu PFs Delani Moyo is contesting against Thabani Mlotshwa of ZAPU, Mbongeni Moyo of the Zimbabwe National Revival Party, and independent candidate Lesley Dube. The seat was left vacant following the death of sitting MP Farai Taruvinga in March.\n\nSpeaking after the rally, Moyo vowed to complete development projects initiated by his predecessor while introducing his own.\n\nTaruvinga had several projects, which he had started, so once I am elected, those projects must be completed because its a party programme. I also have mine that I will start now as an MP because I have been doing a lot of projects for our people here, said Moyo.\n\nHowever, ZAPU says the people of Insiza deserve more than symbolic references to past heroes.\n\nWhat they need are jobs, functioning infrastructure, and honest leadership. Not recycled slogans or history lessons aimed at covering up present-day failures, the party official added.\n\nZanu PF provincial chairperson Nqobizitha Ndlovu said the partys real focus is on surpassing its own 2023 results.\n\nThe challenge we have as a party is not coming from those challenging our candidate, but it is us as we want to surpass the figures we achieved in the last national elections, said Ndlovu.\n\nBut ZAPU says such rhetoric further shows Zanu PF is more interested in numbers than meaningful change.\n\nDr Nkomos legacy is one of unity, peace, and empowermentnot manipulation. We will not allow it to be hijacked, ZAPU said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZAPU has slammed Zanu PF for what it calls the shameless exploitation of the legacy of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/stop-abusing-dr-joshua-nkomos-legacy-zapu-challenges-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Stop Abusing Dr Joshua Nkomo’s Legacy, ZAPU Challenges Zanu PF\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "Former Cabinet Minister Battles for Life After Axe Attack in Alleged Love Triangle- Family Dismisses Death Rumours",
            "url": "https://www.zimeye.net/2025/06/08/former-cabinet-minister-battles-for-life-after-axe-attack-in-alleged-love-triangle-family-dismisses-death-rumours/",
            "content": "By A Correspondent\n\nJune 8, 2025\n\nHWANGE  Former Cabinet Minister and long-serving Binga South Member of Parliament Joel Gabbuza is fighting for his life in hospital after being viciously attacked in what sources describe as a suspected love triangle gone wrong.\n\nThe former Minister of Water Resources and Development was reportedly assaulted with an axe by a man who accused him of having an affair with his wife. The attack is said to have taken place late on Friday, June 7, 2025.\n\nAs news of the brutal assault spread, social media was quickly flooded with unverified reports claiming Gabbuza had died from his injuries. However, his family has moved swiftly to dismiss those rumours.\n\nHe is receiving treatment at Hwange Colliery Hospital. His condition has improved from last night, he is now able to speak, his son told CITE in a telephone interview. We are making arrangements to transfer him to Mpilo Hospital in Bulawayo.\n\nThe alleged assailant is believed to have fled the scene following the attack. While police have yet to release an official statement, residents say the motive appears to be deeply personal.\n\nGabbuza, a respected figure in Zimbabwean politics, served as MP for Binga from 2000 under the opposition MDC. After boundary adjustments in 2008, he represented Binga South until his recall from Parliament in October 2023. During the Government of National Unity between ZANU PF and the MDC from 2009 to 2013, he served as Minister of Water Resources and Development.\n\nDespite being out of active politics in recent months, Gabbuza remained a prominent voice in the Matabeleland region. The attack has shocked many, especially those who have long viewed him as a quiet and disciplined statesman.\n\nAs investigations continue, Gabbuzas family is urging the public not to spread misinformation and to respect their privacy during this difficult time.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent June 8, 2025 HWANGE – Former Cabinet Minister and long-serving Binga South Member of Parliament Joel Gabbuza … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/former-cabinet-minister-battles-for-life-after-axe-attack-in-alleged-love-triangle-family-dismisses-death-rumours/\">Continue reading<span class=\"screen-reader-text\"> \"Former Cabinet Minister Battles for Life After Axe Attack in Alleged Love Triangle- Family Dismisses Death Rumours\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        },
        {
            "title": "Zimbabwean Women Say No to More Babies: A Bold Shift in Fertility Trends",
            "url": "https://www.zimeye.net/2025/06/08/zimbabwean-women-say-no-to-more-babies-a-bold-shift-in-fertility-trends/",
            "content": "By A Correspondent\n\nZimbabwe is witnessing a significant social shift as more educated and economically empowered women choose to have fewer childrenor none at all. This trend is contributing to a nationwide decline in the countrys desired fertility rate, signaling changing attitudes toward motherhood, gender roles, and personal autonomy.\n\nTraditionally, Zimbabwean society has placed high value on large families, often viewing motherhood as both a rite of passage and a measure of a womans success. However, this perception is rapidly evolving. Womenparticularly in urban areas and among higher socio-economic classesare redefining what it means to lead fulfilling lives, with many placing career advancement, financial independence, and personal well-being above the cultural expectation of raising large families.\n\nThis isnt about rejecting motherhood, said a Masvingo-based psychologist. Its about making informed choices. Women are recognizing that they have options beyond traditional roles.\n\nAccording to recent demographic and health surveys, Zimbabwes total fertility rate has gradually declined over the past two decades. While economic hardship, urbanization, and access to reproductive healthcare have played a role, the most significant factor appears to be the empowerment of women through education and employment.\n\nEducated women are more likely to understand and access family planning services. They are also more attuned to the economic demands of raising children in a changing world where quality of life often outweighs quantity of offspring. Many women are now questioning whether having many children is compatible with their personal goals and the realities of modern life.\n\nTheres pressure to be a superwomansuccessful, attractive, a good mother, a good wife, said one urban professional woman. But Ive chosen to prioritize my peace and my professional goals. I dont feel guilty about having just one child. Or none.\n\nThe trend has sparked debate in various sectors of society. Some traditionalists express concern that this shift could undermine cultural values and lead to population decline. Others argue it is a natural and necessary evolution, aligning with global movements toward gender equality and sustainable living.\n\nAs Zimbabwe continues to grapple with economic instability and high unemployment rates, the decision by many women to delay or forgo childbearing may also be seen as a pragmatic response to national challenges.\n\nThis phenomenon is not unique to Zimbabwe. Across the globe, countries are experiencing similar trends as women gain greater access to education and employment. What sets Zimbabwe apart, however, is how rapidly and boldly its women are embracing this new directionreshaping not just their futures, but that of the nation.\n\nIn a society where the phrase a womans place is in the home once echoed loudly, Zimbabwean women are now raising a different kind of voice. One that says: We will choose when, how, and if we become mothers.\n\nAnd in that choice, lies the quiet revolution of a nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe is witnessing a significant social shift as more educated and economically empowered women choose to have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/08/zimbabwean-women-say-no-to-more-babies-a-bold-shift-in-fertility-trends/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Women Say No to More Babies: A Bold Shift in Fertility Trends\"</span></a></p>",
            "time": "18:47",
            "date": "09 Jun 2025"
        }
    ]
}