{
    "news": [
        {
            "title": "Chinamasa Robbed, Loses Car & Gun",
            "url": "https://www.zimeye.net/2025/02/28/chinamasa-robbed-loses-car-gun/",
            "content": "ByMunacho Gwamanda-Long-serving Cabinet minister and Zanu PF legal guru Patrick Chinamasa has fallen victim to a daring robbery at his Rusape farm.\n\nA gang of four robbers stormed the property, subduing the security guard and farm manager before ransacking the house in search of money.\n\nThey tied the hands of the farm manager and security guard, force-marched them inside, and covered them with blankets. They overturned beds and sofas, looking for cash, which fortunately was not there, said Mrs. Chinamasa.\n\nThe robbers made off with a brand-new blue Mazda BT-50 double cab, which had only travelled 12,000 km, along with a pistol from the gun cabinet, a box of cocking oil, and a set of kitchen knives.\n\nThey drove away in my car. We suspect they arrived in a white Toyota Wish. Police from Headlands responded the same night, and the case has since been transferred to the Criminal Investigations Department in Rusape, she added.\n\nAuthorities are investigating the heist, which appears to have been a calculated attempt to steal money and valuables.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Long-serving Cabinet minister and Zanu PF legal guru Patrick Chinamasa has fallen victim to a daring robbery at his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/chinamasa-robbed-loses-car-gun/\">Continue reading<span class=\"screen-reader-text\"> \"Chinamasa Robbed, Loses Car & Gun \"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "Top Zim Journalist Dies, Buried In London",
            "url": "https://www.zimeye.net/2025/02/28/top-zim-journalist-dies-buried-in-london/",
            "content": "By Munacho Gwamanada-Veteran Zimbabwean journalist and long-serving BBC World Service correspondent Lewis Machipisa, was laid to rest in London on Thursday, nearly two months after his passing.\n\nMachipisa, who dedicated his life to journalism andwas widely respectedfor his humility and professionalism, diedin his sleepat his home in Catford, Southeast London, on January 7, 2025.\n\nHe was 52.\n\nHis burialwas attendedby close relatives and members of the Zimbabwean journalism fraternity based in the United Kingdom, whopaid their last respects to a man many described as a mentor, a friend, and an unwavering voice for truth.\n\nMachipisas journey in journalism began at Harare Polytechnics School of Journalism in 1991.\n\nHis natural curiosity and deep commitment to storytelling saw him rise quickly in the profession. He started his career as a correspondent forInterPress Service (IPS) in Harare in 1993, where he gained recognition for his incisive reporting on human rights, governance, and social justice issues.\n\nHis work at IPS gave a voice to marginalized communities and held those in power accountable.\n\nHis talent soon caught the attention of the BBC World Service, and he joined their Zimbabwe bureau, where he reported on key political and economic developments during a time of increasing state restrictions on the media.\n\nHis balanced and fearless reportingwonhim accolades and respect from colleagues and audiencesalike.\n\nIn the early 2000s, as Zimbabwes political landscape became more hostile to independent journalists, Machipisa relocated to London, joining the ranks of many exiled Zimbabwean journalists.\n\nAtthe BBC World Service, he continued his passionate work, covering Southern African affairs with integrity and depth.\n\nHis ability to explain complex issues with clarity and nuance made him a trusted voice on Zimbabwean affairs.\n\nBeyond his professional achievements, Machipisa was known for his kindness and humility.\n\nColleagues and friends remember him as a generous mentor whowas always willing toshare his knowledge with younger journalists.\n\nDespite his high-profile career, he remained down-to-earth, approachable, and deeply connected to the Zimbabwean diaspora community in the UK.\n\nHe often used his platform to support initiativesaimed at empowering Zimbabwean journalists and advocatingfor press freedom.\n\nHis passing leaves a significant void in the media fraternity, particularly among Zimbabwean journalists in exile, who looked up to him as a guiding figure.\n\nRest in peace, Lewis Machipisa. Your voice may be gone, but your work and influence will endure.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanada-Veteran Zimbabwean journalist and long-serving BBC World Service correspondent Lewis Machipisa, was laid to rest in London on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/top-zim-journalist-dies-buried-in-london/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zim Journalist Dies, Buried In London\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "EMA Forces Closure Of Ran Mine In Bindura",
            "url": "https://www.zimeye.net/2025/02/28/ema-forces-closure-of-ran-mine-in-bindura/",
            "content": "By A Correspondent\n\nThe Environmental Management Agency (EMA) has temporarily shut down Ran Mine in Bindura following the discovery of cyanide traces in the water supply of Chipadze suburb. This contamination resulted from a water spillage on Thursday from the mines slime dam, raising serious concerns about public health.\n\nThe shutdown is intended to give authorities more time to address the environmental and health risks posed by the spillage, which has not only affected the local water supply but also led to the death of fish in Pote River and Arcadia dams.\n\nMaxwell Mupotsa, EMAs Provincial Environment and Publicity Officer, explained the agencys findings: Our laboratory analysis from Thursday up to today has been sampling boreholes and streams close to Mushambanhaka into Pote River, where there are reports of fish dying. We found that there are traces of cyanide in the area as well as clusters in Chipadze. We ordered them to stop operations and focus mainly on this health hazard.\n\nThe mines temporary closure follows a meeting of the Bindura Civil Protection Unit on Wednesday, which reviewed the laboratory results and agreed on an immediate community awareness campaign to address the contamination issue.\n\nEnvironmental Health Officer Fungai Mangwambi urged residents to take precautions: We just advised the community not to use the water from their wells because they are not fully protected. They must use the reticulated water from the council or local authority, which is a bit safer as from now, since we are expecting underground contamination.\n\nHowever, the situation has left Chipadze residents divided. While some expressed confusion and concern, others questioned the previous assurances given by the mine. One resident shared their frustration: We were told the mine conducted tests and the water was safe, but we saw with our own eyes that vegetables and trees were affected. On top of that, we have some shallow wells, and now we are surprised we are being told not to use the water. Our health is now at risk because we have been drinking that water.\n\nAnother resident added, We are no longer sure what to believe because when they tested, they said the water was safe. Now we are being told not to wash plates after hearing that fish, especially catfish, died at Pote.\n\nA disabled resident, concerned about the potential health risks, expressed worry about the waters reach: I use a wheelchair, and when I pass my gate, there is water. I dont know to what extent I will be affected since I handle that water when wheeling my wheelchair.\n\nAs authorities continue to monitor the situation, Chipadze residents remain anxious about the safety of their water and their health.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Environmental Management Agency (EMA) has temporarily shut down Ran Mine in Bindura following the discovery of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/ema-forces-closure-of-ran-mine-in-bindura/\">Continue reading<span class=\"screen-reader-text\"> \"EMA Forces Closure Of Ran Mine In Bindura\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "A Tribute To Rugby Legend",
            "url": "https://www.zimeye.net/2025/02/28/a-tribute-to-rugby-legend/",
            "content": "Sports Correspondent\n\nZimbabwes rugby community is in mourning following the passing of former Zimbabwe Rugby Union (ZRU) President Aaron Jani. Jani, 54, succumbed to a long illness in Harare on Wednesday.\n\nA respected figure in African rugby, Jani served as ZRU president for six years, driving growth and development in the sport. Prior to his presidency, he chaired the U20 committee.\n\nAs a player, Jani was a skilled winger, representing club rugby teams and the national team, the Sables. His dedication to the sport earned him widespread admiration.\n\nJani also held the position of Rugby Africa Treasurer, demonstrating his influence and commitment to rugby beyond Zimbabwes borders.\n\nThe Zimbabwe Rugby Union will announce funeral arrangements in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe’s rugby community is in mourning following the passing of former Zimbabwe Rugby Union (ZRU) President Aaron Jani. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/a-tribute-to-rugby-legend/\">Continue reading<span class=\"screen-reader-text\"> \"A Tribute To Rugby Legend\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "Robbers Drive Off With Patrick Chinamasa’s Twin Cab And Gun",
            "url": "https://www.zimeye.net/2025/02/28/robbers-drive-off-with-patrick-chinamasas-twin-cab-and-gun/",
            "content": "Robbers Raid ZANU PF Legal Secretary Patrick Chinamasas Farm, Steal Vehicle and Gun\n\nHeadlands, Zimbabwe  In a daring heist, armed robbers raided the farm of ZANU PF Secretary for Legal Affairs, Patrick Chinamasa, making off with a brand-new Mazda BT-50 double cab vehicle, a pistol, and other valuables.\n\nThe robbery occurred under the cover of darkness when four men overpowered the security guard stationed at the main entrance of the farm before targeting the farm manager. The suspects tied up both men, force-marched them into the main farmhouse, and covered them with blankets while they ransacked the property.\n\nDetails of the Heist\n\nAccording to Mrs. Chinamasa, the robbers were thorough in their search for money, overturning beds, sofas, and combing through every room in the house.\n\nThey took the car keys of my brand-new Mazda BT-50, blue in color, which we were yet to register. It had only travelled for 12,000 km. They also took a pistol from the gun cabinet, a box of cocking oil, and a set of kitchen knives. It was more of the money which they wanted, Mrs. Chinamasa told Manila Post.\n\nThe robbers are believed to have arrived at the farm in a white Toyota Wish vehicle, which may have been used as their getaway car.\n\nPolice Investigation Underway\n\nThe incident was reported to local authorities the same night, and officers from Headlands responded promptly to record statements. The case has now been transferred to the Criminal Investigations Department (CID) in Rusape for further investigation.\n\nPolice are actively pursuing leads and have launched a manhunt for the robbers. Meanwhile, security has been tightened at the farm as investigations continue.\n\nCommunity on High Alert\n\nThe brazen nature of the robbery has left the local community on edge, with residents expressing concerns over rising crime in the area. Authorities have urged the public to remain vigilant and report any suspicious activities to the nearest police station.\n\nThis high-profile robbery has also sparked political and security concerns, as Patrick Chinamasa is a prominent figure within the ruling ZANU PF party.\n\nStay tuned for more updates on this developing story.-state media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Robbers Raid ZANU PF Legal Secretary Patrick Chinamasa’s Farm, Steal Vehicle and Gun Headlands, Zimbabwe — In a daring heist, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/robbers-drive-off-with-patrick-chinamasas-twin-cab-and-gun/\">Continue reading<span class=\"screen-reader-text\"> \"Robbers Drive Off With Patrick Chinamasa’s Twin Cab And Gun\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "Mark Ngwazi haasi aakutozviMaka Ngozi here?",
            "url": "https://www.zimeye.net/2025/02/28/mark-ngwazi-haasi-aakutozvimaka-ngozi-here/",
            "content": "Mark Ngwazi haasi aakutozviMaka Ngozi here?\n\nMark Ngwazi throws a Biblical joke in an FB post.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mark Ngwazi haasi aakutozviMaka Ngozi here? Mark Ngwazi throws a Biblical joke in an FB post.",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "N’anga Successfully Steals Cop’s USD20,000",
            "url": "https://www.zimeye.net/2025/02/28/nanga-successfully-steals-cops-usd20000/",
            "content": "Traditional Healer Jailed for Theft and Money Laundering in $20,100 Scam.\n\nMutare, Zimbabwe  A traditional healer from Matondo Village in Chigodora, Petros Chiropa (35), has been sentenced to 54 months in prison after being found guilty of theft of trust property and money laundering involving US$20,100.\n\nMutare provincial magistrate, Ms. Annie Ndiraya, delivered the verdict, ordering Chiropa to also restitute US$8,100 to his victim, Assistant Commissioner Florence Marume of the Zimbabwe Republic Police in Masvingo. Prosecutor Mr. Tafadzwa Zulu led the States case against Chiropa.\n\nThe Crime and Court Proceedings\n\nChiropa was convicted on two counts of theft of trust property under Section 133 (2)(b) of the Criminal Law (Codification and Reform) Act, Chapter 9:23, as well as contravening the Money Laundering and Proceeds of Crime Act, Chapter 9:23.\n\nThe court heard that Assistant Commissioner Marume had entrusted her domestic worker, Precious Nyasha Manyawu, with US$20,100 for safekeeping. However, when Marume requested the money on December 16, 2023, Manyawu failed to produce it, prompting an investigation.\n\nIt was discovered that Chiropa, with Manyawus assistance, had stolen the money and spent it on lavish items, including a Toyota Runx, household furniture, a 55-inch plasma TV, and a solar panel.\n\nA Romantic Plot Unveiled\n\nThe trial exposed a romantic relationship between Chiropa and Manyawu, through which they allegedly hatched the plan to steal from Marume. Manyawu, who had been a trusted domestic worker for eight years, has already been punished and is currently serving her sentence at Mutare Remand Prison.\n\nChiropa initially pleaded not guilty, claiming the charges were fabricated and asserting his status as a famous traditional healer of means. He further muddied his defense by offering inconsistent statements about his profession, at one point claiming to also be a truck driver and businessman.\n\nAbsconding and Arrest\n\nThe trial was marked by Chiropas initial release on bail, after which he absconded. Authorities later re-arrested him, and he was held in remand prison for violating bail conditions.\n\nMagistrate Ms. Ndiraya noted the overwhelming evidence against Chiropa, including his influence over Manyawu and his extravagant expenditures following the theft.\n\nLegal and Community Repercussions\n\nThe case has drawn widespread attention, particularly regarding the abuse of trust and the role of traditional healers in Zimbabwean society. The harsh sentence and restitution order serve as a warning against financial crimes and the abuse of social and professional influence.\n\nChiropas sentencing brings some closure to Assistant Commissioner Marume, who has since recovered US$12,000 of the stolen amount.\n\nThe case highlights the need for vigilance in handling trust property and reinforces the legal consequences of betrayal and financial misconduct.\n\nStay with us for more updates on this developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Traditional Healer Jailed for Theft and Money Laundering in $20,100 Scam. Mutare, Zimbabwe — A traditional healer from Matondo Village … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/nanga-successfully-steals-cops-usd20000/\">Continue reading<span class=\"screen-reader-text\"> \"N’anga Successfully Steals Cop’s USD20,000\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "Free US$30,000 Bank Glitch Case",
            "url": "https://www.zimeye.net/2025/02/28/free-us30000-bank-glitch-case/",
            "content": "By A Correspondent | Bulawayo, Zimbabwe  A Bulawayo couple accused of exploiting a technical glitch at Stanbic Bank Zimbabwe to allegedly spend over US$30,000 both in Zimbabwe and South Africa will learn their fate today as the court delivers its verdict.\n\nFrank Sibanda (65) and his wife, Fransisca Netsai Sibanda (65), of Pelandaba suburb, appeared before Bulawayo regional magistrate Mrs. Dambudzo Malunga, facing 47 counts of theft. The couple, currently out on US$500 bail each, has maintained their innocence, claiming they believed the funds were deposited by their daughter, Rudo Sibanda, who resides in Harare.\n\nThe State closed its case after calling two witnesses to testify against the couple. As part of their bail conditions, the Sibandas were required to surrender their passports, report twice a week at Bulawayo Central Police Station, and remain at their registered address.\n\nHow the Alleged Fraud Unfolded\n\nAccording to prosecutor Mr. Owen Mugari, the saga began on February 5 last year when Fransisca opened a Silver banking segment account at Stanbic Banks Joshua Nkomo Street branch. Her daughter, Rudo, had allegedly falsely declared that her mother was an employee of her Harare-based company, Cominergy Construction Mining Energy, to facilitate the account opening.\n\nFransisca was subsequently issued a Visa chip-and-PIN card for transactions. The alleged fraudulent activity started on April 5 when Fransisca attempted a US$17.95 purchase at National Foods Bulawayo using a Steward Bank point-of-sale (POS) machine. When the transaction failed, Steward Bank initiated a standard reversal process through ZimSwitch.\n\nHowever, due to a technical error, the reversal was processed with a grossly overstated amount of ZWG579,116.21, which was mistakenly auto-converted and credited into Fransiscas Stanbic US dollar account. This unexpected windfall resulted in a deposit of US$40,850.86.\n\nForensic Audit Exposes Discrepancy\n\nThe alleged misuse of funds came to light following a routine forensic audit by Stanbic Bank, which revealed significant discrepancies in its financial records. The audit findings prompted an investigation that led to the couples arrest.\n\nWhile the prosecution argued that the Sibandas knowingly exploited the glitch, the defense maintained that they had no reason to suspect the funds did not originate from their daughter.\n\nA Community Holds Its Breath\n\nThe case has captured public attention, with many eagerly awaiting the courts ruling. A guilty verdict could lead to severe legal consequences for the elderly couple, while an acquittal would raise questions about the banks internal controls and oversight mechanisms.\n\nThe verdict is expected to set a precedent in Zimbabwean legal circles, particularly concerning cases involving financial institutions and technical errors.\n\nStay tuned for live updates as this story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Bulawayo, Zimbabwe — A Bulawayo couple accused of exploiting a technical glitch at Stanbic Bank Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/free-us30000-bank-glitch-case/\">Continue reading<span class=\"screen-reader-text\"> \"Free US$30,000 Bank Glitch Case\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "Overzealous Mahiya Attacks Geza…",
            "url": "https://www.zimeye.net/2025/02/28/overzealous-mahiya-attacks-geza/",
            "content": "By A Correspondent\n\nWar veterans leader Douglas Mahiya has accused Blessed Geza of being a bogus war veteran. Mahiyas comments came during the launch of The Harare Province Presidential War Veterans Fund at the ZANU PF headquarters in Harare on Tuesday.\n\nWe are war veterans, and a trained cadre will not, at any given point, insult the party leadership. The one who is doing that is not a genuine war veteran. Never ever insult the party leadership. It shows lack of discipline, Mahiya said, referring to Gezas controversial remarks.\n\nGeza had recently challenged President Emmerson Mnangagwas attempt to stay in power beyond his constitutional mandate, sparking a public dispute. Mahiyas strong words were aimed at those within the war veterans community who, according to him, failed to show respect and loyalty to the party leadership.\n\nHis remarks highlighted the growing divisions within ZANU PF, with some war veterans openly questioning the Presidents political longevity. However, Mahiya made it clear that such behavior was incompatible with the values of genuine war veterans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veterans leader Douglas Mahiya has accused Blessed Geza of being a “bogus” war veteran. Mahiya’s comments … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/overzealous-mahiya-attacks-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Overzealous Mahiya Attacks Geza…\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        },
        {
            "title": "Tough Luck Mighty Warriors",
            "url": "https://www.zimeye.net/2025/02/28/zifa-praises-mighty-warriors-despite-loss-2/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has heaped praise on the Mighty Warriors, despite their heartbreaking loss to Angola in the penalty shootout.\n\nZIFA President Nqobile Magwizi expressed admiration for the teams performance, saying, They were very unfortunate that they lost on penalties, but they gave a good account of themselves.\n\nThe Mighty Warriors had staged a remarkable comeback, winning 2-1 in the return leg against Angola in Pretoria. However, the teams earlier 2-1 loss in Luanda meant that the aggregate score was tied at 3-3, forcing a penalty shootout.\n\nUnfortunately, the Mighty Warriors lost the shootout 5-4, bringing an end to their campaign. Despite the disappointment, ZIFAs praise acknowledges the teams resilience and determination.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has heaped praise on the Mighty Warriors, despite their heartbreaking loss to Angola … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/28/zifa-praises-mighty-warriors-despite-loss-2/\">Continue reading<span class=\"screen-reader-text\"> \"Tough Luck Mighty Warriors\"</span></a></p>",
            "time": "20:26",
            "date": "28 Feb 2025"
        }
    ]
}