{
    "news": [
        {
            "title": "LIVE NEWS REVIEW: Blessed Geza Explains How ED’s Being Escorted Home",
            "url": "https://www.zimeye.net/2025/04/29/live-news-review-blessed-geza-explains-how-eds-being-escorted-home/",
            "content": "Blessed Geza Exposes Alleged $1.9 Billion Corruption Scandal Tied to Kudakwashe Tagwirei and Emmerson Mnangagwa\n\nBy Farai D Hove | ZimEye |  29 April 2025\n\nBULAWAYO  Inan explosive revelation made on the aftermath of the ZimbabweInternational Trade Fair (ZITF), activist and whistleblower Cde Blessed Geza accused businessman Kudakwashe Tagwirei of amassing unprecedented wealth through state-sponsored corruption, surpassing telecommunications mogul Strive Masiyiwadespite having not a single product to showcase.\n\nSpeaking publicly on Tuesday, Geza detailed what he described as a systematic looting scheme involving military-owned companies, state assets, and debt write-offs orchestrated with the full knowledge and support of President Emmerson Mnangagwa.\n\nYou need to know how Tagwirei made money. First of all, he started with one service station called Takunda, Geza began. Soon after that, we heard of Command Agriculture. We later discovered it wasnt his moneyit was government money he never returned.\n\nAccording to Geza, Tagwireis wealth ballooned through the appropriation of government and army-linked firms, including platinum interests under Great Dyke Investments (GDI), the Sandawana emerald mine, and entities under liquidation. He alleged Tagwirei accrued a staggering USD900 million in unsecured debt and later offset it by transferring shares in Kuvimba Mining Housean entity he claimed was fraudulently revalued and used to erase liabilities without government receiving actual cash.\n\nLet me assure you as long as I keep coming to you, action is being taken. We are simply taking precaution to make sure that there wont be loss of blood our progressive forces are on the ground as we speak, says@BlessedGezahttps://t.co/2BjxBPGxL4\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Blessed Geza Exposes Alleged $1.9 Billion Corruption Scandal Tied to Kudakwashe Tagwirei and Emmerson Mnangagwa By Farai D Hove | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/live-news-review-blessed-geza-explains-how-eds-being-escorted-home/\">Continue reading<span class=\"screen-reader-text\"> \"LIVE NEWS REVIEW: Blessed Geza Explains How ED’s Being Escorted Home\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "Geza Exposes How Tagwirei’s Now Richer than Strive Masiyiwa Without A Single Product To Display At ZITF",
            "url": "https://www.zimeye.net/2025/04/29/geza-exposes-how-tagwireis-now-richer-than-strive-masiyiwa-without-a-single-product-to-display-at-zitf/",
            "content": "Blessed Geza Exposes Alleged $1.9 Billion Corruption Scandal Tied to Kudakwashe Tagwirei and Emmerson Mnangagwa\n\nBy Farai D Hove | ZimEye |  29 April 2025\n\nBULAWAYO  Inan explosive revelation made on the aftermath of the ZimbabweInternational Trade Fair (ZITF), activist and whistleblower Cde Blessed Geza accused businessman Kudakwashe Tagwirei of amassing unprecedented wealth through state-sponsored corruption, surpassing telecommunications mogul Strive Masiyiwadespite having not a single product to showcase.\n\nSpeaking publicly on Tuesday, Geza detailed what he described as a systematic looting scheme involving military-owned companies, state assets, and debt write-offs orchestrated with the full knowledge and support of President Emmerson Mnangagwa.\n\nYou need to know how Tagwirei made money. First of all, he started with one service station called Takunda, Geza began. Soon after that, we heard of Command Agriculture. We later discovered it wasnt his moneyit was government money he never returned.\n\nAccording to Geza, Tagwireis wealth ballooned through the appropriation of government and army-linked firms, including platinum interests under Great Dyke Investments (GDI), the Sandawana emerald mine, and entities under liquidation. He alleged Tagwirei accrued a staggering USD900 million in unsecured debt and later offset it by transferring shares in Kuvimba Mining Housean entity he claimed was fraudulently revalued and used to erase liabilities without government receiving actual cash.\n\nLet me assure you as long as I keep coming to you, action is being taken. We are simply taking precaution to make sure that there wont be loss of blood our progressive forces are on the ground as we speak, says@BlessedGezahttps://t.co/2BjxBPGxL4\n\nAfter a year, he returned and said he was selling the whole of Kuvimba. By then, he had brought in his company CBZ Capital to re-evaluate it. Kuvimba was now valued at USD5.4 billion, Geza claimed, asserting that this led to Tagwirei and Mnangagwa walking away with USD1.9 billion in corrupt money through the formation of a new state holding firm, Mutapa Investment Fund.\n\nGezas tirade did not spare the Seventh-Day Adventist Church, which he accused Tagwirei of attempting to buy through patronage, nor the state of public education and healthcare in Zimbabwe. Now look at the country. Our civil servants are getting peanuts someone without a Grade Seven certificate getting USD540 million for merely standing near Mnangagwa. How does that happen?\n\nIn a dramatic call to action, Geza urged nationwide protests and solidarity with striking university lecturers and students. Family of Zimbabwe, unite together. Go on shutdown so that Mnangagwa may be sent home Lets unite to build our country.\n\nThe allegations, if substantiated, implicate Zimbabwes top political and economic power brokers in one of the most extensive financial scandals since independence.\n\nAs of publication, neither Tagwirei nor Mnangagwa had publicly responded to Gezas claims.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Blessed Geza Exposes Alleged $1.9 Billion Corruption Scandal Tied to Kudakwashe Tagwirei and Emmerson Mnangagwa By Farai D Hove | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/geza-exposes-how-tagwireis-now-richer-than-strive-masiyiwa-without-a-single-product-to-display-at-zitf/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Exposes How Tagwirei’s Now Richer than Strive Masiyiwa Without A Single Product To Display At ZITF\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "Mnangagwa’s #ED2030 Campaign Minister Caught In Tribal Storm",
            "url": "https://www.zimeye.net/2025/04/29/mnangagwas-ed2030-campaign-minister-caught-in-tribal-storm/",
            "content": "By Munacho Gwamanda-Local Government Minister Daniel Garwe has found himself at the centre of a tribal controversy after reprimanding Bulawayo Mayor David Coltart for hosting a meeting with self-proclaimed Ndebele monarch, King Bulelani Lobhengula Khumalo, during the Easter holidays.\n\nThe meeting, which took place at the Bulawayo Mayors Parlour, reportedly saw Mayor Coltart formally address Bulelani as King Bulelani, a gesture that has triggered backlash from government officials, including Minister Garwe.\n\nIn a statement issued on 23 April 2025, Garwe reiterated the governments longstanding position rejecting Bulelanis claim to the throne of King Lobengula, describing it as unlawful and without constitutional basis.For the avoidance of doubt, Garwe said, the Zimbabwe Constitution does not provide for kingship. His claim is baseless, unfounded, and a legal nullity. He cited Section 283(a) of the Constitution of Zimbabwe Amendment (No. 20) Act of 2013, read together with Sections 3(1) and (2) of the Traditional Leaders Act [Chapter 29:17], which stipulates that the appointment, removal, and suspension of Chiefs must be done by the President on the recommendation of the Provincial Assembly of Chiefs, via the National Council of Chiefs and the responsible Minister, and in accordance with prevailing traditional customs.\n\nGarwe warned that any engagement with Bulelani undermines constitutional processes and misleads the public.\n\nHe further condemned Bulelani as a fraudulent impostor, calling on both the Mayors office and the residents of Bulawayo to reject his claim and public appearances.\n\nThe Minister demanded an explanation from Mayor Coltart regarding the circumstances under which Bulelani was invited and received.\n\nHe also questioned whether the invitation had been sanctioned, either explicitly or implicitly, by the Ministry of Local Government and Public Works or any other authorised entity.\n\nThe incident has sparked fresh debate on identity, legitimacy, and cultural recognition in Zimbabwe, once again bringing unresolved historical tensions between central government and Matabeleland into sharp focus.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Local Government Minister Daniel Garwe has found himself at the centre of a tribal controversy after reprimanding Bulawayo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/mnangagwas-ed2030-campaign-minister-caught-in-tribal-storm/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s #ED2030 Campaign Minister Caught In Tribal Storm\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "Andrew Wutaunashe’s Splits Up Again After Calling Mnangagwa Jesus And Demanding A Brand New Car",
            "url": "https://www.zimeye.net/2025/04/29/andrew-wutaunashes-splits-up-again-after-calling-mnangagwa-jesus-and-demanding-a-brand-new-car/",
            "content": "video loading below\n\nBy A Correspondent | ZimEye | Francistown, Botswana  Barely 5 months after demanding that Botswana citizens must buy him a brand new car, Prophet Andrew Wutaunashe, who is Zimbabwes President Emmerson Mnangagwas kingmaker, has revealed he has been deserted by large crowds of followers in Botswana  a stunning fallout following a scandal over his demands for a brand-new car from his congregation last Christmas.\n\nWutaunashe made the announcement during an emotional sermon on Sunday, April 27, 2025- in Francistown, admitting that not only had ordinary church members left him, but also Archbishop Kuleletse, the leading bishop of his Botswana church, had formally cut ties.\n\nIn a lengthy and prayer-laden address, Wutaunashe tried to console his remaining flock:\n\nBarely 3 years after telling@JustinWelby@churchofenglandthat his UK trip is because he is troubled for the poor, Emmerson Mnangagwas giant-bellied prophet, Andrew Wutaunashe, 5 days ago, demands a car from poor Botswana church members (pictured). The preacher advised byhttps://t.co/uDQbeJ6Q95pic.twitter.com/UXfqzFzfCh\n\nArchbishop Kuleletse felt that he should leave us, Wutaunashe said. I personally thought that he shouldnt, but he said that he felt that is what God wants him to do but we might just pray for him; keep on loving him.\n\nThe dramatic collapse in support follows a major expos by the ZimEye news network, which revealed how Wutaunashe had demanded a brand-new vehicle from his poor Botswana congregation  to be delivered within four months  at a time when he was also condemning Western nations for supposedly lacking compassion for the needy.\n\nIn his Christmas sermon last December, Wutaunashe had declared his expectation:\n\nI know all the bishops love me so at Easter camp next year, the bishops will give me a car I wont tell them what type, otherwise they will be in shock.\n\nThe ZimEye expos triggered widespread anger, particularly among Botswana citizens, who felt betrayed by a leader they once trusted. Members accused him of exploiting their loyalty while living lavishly at their expense.\n\nA Church in CrisisIn his Sunday sermon, Wutaunashe tried to frame the mass desertions as part of a divine process:\n\nDont worry about sons who go away; they will always come back even Jesus went away from his Father but came back.\n\nDespite the hopeful rhetoric, the departure of Archbishop Kuleletse is seen as a massive blow to Wutaunashes operations in Botswana, a country that was once a stronghold for his regional influence.\n\nThe preacher, visibly shaken, launched into a prayer asking for blessings on Kuleletses new path and encouraged his remaining followers to rebuild the Francistown church to a greater later glory.\n\nWutaunashe also took the opportunity to pray for the Zimbabwean government, notably for Emmerson Mnangagwa, urging divine intervention to bring to completion what he called Mnangagwas work of peace and progress.\n\nMeanwhile:Latest revelations suggest that at the time of writing another compounding scandal involving a still to be named son of a bishop who was at the time ofthe desertion having an affair with the wife of another senior church leader.\n\nLooking AheadAs Wutaunashe struggles to rebuild in Francistown, questions remain about his broader credibility across Southern Africa, especially amid rising scrutiny of self-styled prophets and their financial dealings. Whether he can recover from this scandal remains to be seen.\n\nFULL TRANSCRIPT:\n\nI keep promising myself that I will find myself to Francistown just to comfort myself and to comfort you that Archbishop Kuleletse felt that he should leave us, I personally thought that he shouldnt but he said that he felt that is what God wants him to do, so that he can start another work or something, but we might just pray for him; keep on loving him; and me my Prayer I was thinking of it this morning that you shouldnt worry about sons who go away they will always come back because you see Jesus even Jesus went away from his father but he came back; say hallelujah; I know you are not Father so you wont know, so I will always be longing that I will see Bishop Kuleletse; but anyway God has allowed it so let the wheel be done so you must go on and build a great church in Francis town. I heard someone say this is the home of Christ Africa who was saying that? Was it you? You must go and build it again so I have taken it seriously. Amen, he better build it. You better build it because if you dont, somebody else will do it.. you hear someone say this is the home of Chris at AFRICA in the village in Zimbabwe, but lets pray. Lets start by just raising our hands. Lets pray for Archie Bishop. And lets pray that God will guide his footsteps. Father we thank you for your servant who led his sheep for so many years Father you know where he stands right now we put him in your hands Lord that heavenly father your purposes will be achieved through his life in the name of the Lord Jesus Christ that it will be well with him that his footsteps will be guided by you thank you heavenly father Above all you gave us is not just people, but its the vision; let the vision fulfil in this place as you gave us longer ago bless us oh God today as we come before you; we now thank you for the nation of Botswana and we give you things for Kings, for our president in this nation Heavenly Father; for the whole cabinet and leaders; and we pray that you may put your hand of guidance in the way they lead heavenly father by bringing a peaceable life; and progress and the prosperity of Botswana; in the name of the Lord Jesus; remember in your special way the travails of Zimbabwe; we pray in the name of Jesus that you may also fulfil Philippians one verse six the work you began through Emmerson Mnangagwa by helping to bring to completion two piece undisturbed in the nation your plan and your progress will prevail in the nation, but today as we come before you remember every nation in which heavenly father you have been able to put the footprint of this church bless those nations or father heavenly father as we cry unto you remember also my father at the convention my father which is taking place in UK from this Friday onwards in the city of Leeds we pray that you may visit us even in greater ways of Father in the name of the Lord Jesus but today touch everyone and bless us heavenly father in the revelation of your word and let there be hope; and there be a new confidence in every life Satan I bind you and I discard you your Demons and spirits that take away revelation we cast you away in the name of Jesus we command the veil to be lifted and I say in the name of Jesus they shall be yes a revelation blessing and upwards movement for everyone who hears this word and father I now pray in particular for this church oh God here in Francistown, put my feet here as your apostle in the name of the Lord Jesus Christ by this presence today you may give this Church and new beginning in the name of the Lord Jesus Christ may the glory of the latter house of the Francistown citywide family of God Church will be greater than that of the former and in this place there will be peace in the name of the Lord Jesus Christ. I bless these people that they will stand to build this work and that they will not despise the day of small things but that they will be faithful and that oh God this will be a great house beautiful for you my father thank you Father in Jesus name lets clap our hands unto the Lord. And say Amen; Turn to your neighbour and smile and shake their hand and give a big Francistown smile and say welcome to the Francistown  citywide family of God Church, tell them this is the church we are building to a greater later glory; shout hallelujah, praise God: lets be seated in Gods presence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below… By A Correspondent | ZimEye | Francistown, Botswana – Barely 5 months after demanding that Botswana citizens … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/andrew-wutaunashes-splits-up-again-after-calling-mnangagwa-jesus-and-demanding-a-brand-new-car/\">Continue reading<span class=\"screen-reader-text\"> \"Andrew Wutaunashe’s Splits Up Again After Calling Mnangagwa Jesus And Demanding A Brand New Car\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "Goal Drought Hits DeMbare",
            "url": "https://www.zimeye.net/2025/04/29/goal-drought-hits-dembare/",
            "content": "Sports Correspondent\n\nHarare football giants Dynamos FC continue to endure a frustrating run in front of goal, having now failed to find the back of the net in five consecutive Castle Lager Premier Soccer League matches.\n\nThe latest blank has intensified pressure on head coach Lloyd Mablanyo Chigowe, whose efforts to reignite the once-feared DeMbare spark are now being met with growing skepticism from fans and analysts alike.\n\nThe club, once a dominant force in Zimbabwean football, has struggled to rediscover the form that brought them glory in past decades. Their current form has left supporters disillusioned and questioning whether the team has lost its competitive edge.\n\nThis is not the Dynamos we used to know, lamented a long-time supporter outside Rufaro Stadium. No goals in five games? Thats unheard of for a team with such a proud legacy.\n\nWhile the teams defense has held reasonably firm, their inability to convert chances up front has raised alarms. Chigowe, who took over with the promise of reviving the teams attacking philosophy, now finds himself under increasing scrutiny from both the clubs hierarchy and the passionate Mbare faithful.\n\nClub insiders hint at possible tactical adjustments in upcoming fixtures, but for many fans, resultsand goalsare the only remedy that will restore belief in the coachs vision.\n\nWith fixtures piling up and pressure mounting, all eyes will be on Dynamos next match as they desperately seek to end their barren run and restore pride to their crest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Harare football giants Dynamos FC continue to endure a frustrating run in front of goal, having now failed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/goal-drought-hits-dembare/\">Continue reading<span class=\"screen-reader-text\"> \"Goal Drought Hits DeMbare\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "#ED2030 Agenda-Mnangagwa Extends Judges’ Retirement Age",
            "url": "https://www.zimeye.net/2025/04/29/ed2030-agenda-mnangagwa-extends-judges-retirement-age/",
            "content": "By Crime and Courts Reporter-President Emmerson Mnangagwas government has extended the mandatory retirement age for judges from 65 to 70 years, triggering fears that the move is part of a broader strategy to entrench his grip on power through a compliant judiciary.\n\nThe Judicial Service Commission (JSC) announced that the extension, which comes into effect on 1 May 2025, was enacted through Statutory Instrument 42 of 2025, known as the Judicial Service (Amendment) Regulations, 2025 (No. 3). The regulations were officially published last Friday.\n\nThe new rules stipulate that any judge appointed on pensionable terms before the effective date may retire at 65 but can opt to continue serving until 70 with full pension.\n\nThose appointed after 1 May 2025 will have a fixed retirement age of 70. The Paymaster is now required to furnish the JSC annually with a list of judges nearing retirement age.\n\nJudges may still voluntarily retire from age 60 after giving three months notice, and the JSC may also force retirement for permanent medical unfitness or inefficiency due to non-medical factors.\n\nWhile the JSC says the move aligns with international trends and aims to retain judicial expertise, critics view it as a calculated political manoeuvre.\n\nThey argue it will allow Mnangagwa to retain loyal judges in key positions, especially as he eyes a controversial extension of his presidency beyond the constitutional limit of two terms.\n\nThe move has reignited concerns about the ruling Zanu PF partys long-standing practice of using the judiciary to consolidate political power.\n\nSince independence in 1980, Zimbabwes courts have played a controversial role in legitimising executive decisions and suppressing dissent.\n\nUnder former president Robert Mugabe and now Mnangagwa, the judiciary has often been accused of lacking independence, particularly in electoral disputes and cases involving opposition leaders and activists.\n\nIn recent years, the Constitutional Court has repeatedly dismissed challenges to Mnangagwas contested election victories, and government critics have frequently faced harsh sentences in politically sensitive trials.\n\nJudicial appointments have also drawn criticism for allegedly favouring individuals with ties to the ruling elite.\n\nMnangagwa, who rose to power via a military-assisted transition in 2017, has faced increasing internal and external pressure over democratic backsliding and human rights abuses.\n\nWith murmurs within Zanu PF about succession and factional tension mounting, the judiciary could once again become a battleground for power retention.\n\nThe timing of the retirement age extension has therefore raised alarm bells within opposition and civil society circles, who see it as a prelude to legal manoeuvring aimed at removing constitutional barriers to a third term.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-President Emmerson Mnangagwa’s government has extended the mandatory retirement age for judges from 65 to 70 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/ed2030-agenda-mnangagwa-extends-judges-retirement-age/\">Continue reading<span class=\"screen-reader-text\"> \"#ED2030 Agenda-Mnangagwa Extends Judges’ Retirement Age\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "PSL Suspends Seven Players Ahead of Matchday 9",
            "url": "https://www.zimeye.net/2025/04/29/psl-suspends-seven-players-ahead-of-matchday-9/",
            "content": "Sports Correspondent\n\nThe Premier Soccer League (PSL) has handed down suspensions to seven players, effective immediately, ahead of the highly anticipated matchday 9 fixtures.\n\nThis decision comes as a significant blow to the respective teams, as they will have to navigate these crucial matches without their key players.\n\nAffected Players and TeamsThe suspended players include:\n\nThese players will miss their teams matchday 9 games, and their absence is likely to impact their teams strategies and performance.\n\nImplications for the TeamsThe suspensions come at a critical juncture in the season, with teams vying for top spots in the league table. The absence of these key players will undoubtedly pose challenges for their respective teams as they seek to maintain their competitive edge.\n\nAs the matchday 9 fixtures approach, all eyes will be on the teams to see how they adapt to the absence of their suspended players and navigate the challenges ahead.\n\nLeague Action ContinuesDespite the suspensions, the Castle Lager Premier Soccer League will continue to captivate fans with thrilling matches and intense competition. The leagues commitment to fair play and discipline is evident in the PSLs decision to suspend the players, ensuring that the integrity of the game is maintained.\n\nThe upcoming matches are set to be highly competitive, with teams looking to capitalize on their opponents weaknesses and secure crucial wins.\n\nAs the league progresses, fans can expect more exciting matches and dramatic twists and turns.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Premier Soccer League (PSL) has handed down suspensions to seven players, effective immediately, ahead of the highly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/psl-suspends-seven-players-ahead-of-matchday-9/\">Continue reading<span class=\"screen-reader-text\"> \"PSL Suspends Seven Players Ahead of Matchday 9\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "Kombi Driver in Trouble After Sideswiping Mnangagwa’s Security Vehicle",
            "url": "https://www.zimeye.net/2025/04/29/kombi-driver-in-trouble-after-sideswiping-mnangagwas-security-vehicle/",
            "content": "A commuter omnibus driver found himself in serious trouble on Monday after driving the wrong way down a one-way street in central Harare and sideswiping a Ford Raptor from the Presidents motorcade, which was proceeding normally through the area.\n\nWitnesses say all four doors of the security vehicle swung open immediately after the incident. The kombi driver was swiftly apprehended and now faces serious consequences.\n\nSource: Zanu PF\n\nKombi Driver in Trouble After Sideswiping Mnangagwa's Security VehicleA commuter omnibus driver found himself in serious trouble on Monday after driving the wrong way down a one-way street in central Harare and sideswiping a Ford Raptor from the Presidents motorcade, which waspic.twitter.com/ZCYP0GqlG2\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A commuter omnibus driver found himself in serious trouble on Monday after driving the wrong way down a one-way street … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/kombi-driver-in-trouble-after-sideswiping-mnangagwas-security-vehicle/\">Continue reading<span class=\"screen-reader-text\"> \"Kombi Driver in Trouble After Sideswiping Mnangagwa’s Security Vehicle\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "Geza To Speak On Way Forward Today…",
            "url": "https://www.zimeye.net/2025/04/29/geza-to-speak-on-way-forward-today/",
            "content": "Let us make a date at 20:30hrs tonight.pic.twitter.com/iNym2zIRmP\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:42",
            "date": "30 Apr 2025"
        },
        {
            "title": "Chirundu Border Tension: Zimbos, Zambians Clash Over Disparities",
            "url": "https://www.zimeye.net/2025/04/29/chirundu-border-tension-zimbos-zambians-clash-over-disparities/",
            "content": "By A Correspondent\n\nChirundu Border Post is currently a hotspot of unrest as tensions escalate between Zambian and Zimbabwean nationals.\n\nZambian citizens have staged a protest, blocking Zimbabweans from entering Zambia in a show of defiance against perceived unequal treatment at the border.\n\nThis follows a series of arrests by Zambian immigration authorities targeting Zimbabwean nationals attempting to cross without proper documentation. In contrast, Zambians have reportedly been entering Zimbabwe without similar scrutiny or consequences.\n\nZimbabwean nationals claim they are being forced to pay exorbitant sumsup to 24,000 Kwacha (around USD 800)to secure their release when detained. The rising frustration over what many view as harassment and exploitation erupted into open protest today, with Zimbabweans confronting the perceived injustice.\n\nAdding to the unrest, Zambian vendors have also joined the protests, alleging that Zimbabwean immigration officials have denied them entry to sell their goods, further straining the cross-border relations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chirundu Border Post is currently a hotspot of unrest as tensions escalate between Zambian and Zimbabwean nationals. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/29/chirundu-border-tension-zimbos-zambians-clash-over-disparities/\">Continue reading<span class=\"screen-reader-text\"> \"Chirundu Border Tension: Zimbos, Zambians Clash Over Disparities\"</span></a></p>",
            "time": "06:42",
            "date": "30 Apr 2025"
        }
    ]
}