{
    "news": [
        {
            "title": "Obert Mpofu Denies Writing Firing Letter",
            "url": "https://www.zimeye.net/2024/12/13/obert-mpofu-denies-writing-firing-letter/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "Road Accident Fund Exposes Fraudsters",
            "url": "https://www.zimeye.net/2024/12/13/road-accident-fund-exposes-fraudsters/",
            "content": "By A Correspondent\n\nThe Road Accident Fund (RAF) has issued a public warning regarding individuals intentionally throwing themselves in front of moving vehicles in an attempt to claim compensation.\n\nThe RAF has revealed that these individuals typically follow cars at low speeds to reduce the risk of fatal injury, though they still sustain harm in the process. Officials have emphasized that these actions will not lead to successful claims and have urged people to reconsider such dangerous behavior.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Road Accident Fund (RAF) has issued a public warning regarding individuals intentionally throwing themselves in front … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/road-accident-fund-exposes-fraudsters/\">Continue reading<span class=\"screen-reader-text\"> \"Road Accident Fund Exposes Fraudsters\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "Latest On ZIFA Polls",
            "url": "https://www.zimeye.net/2024/12/13/latest-on-zifa-polls/",
            "content": "Sports Correspondent\n\nBenjani Mwaruwari, the iconic former captain of the Zimbabwe national football team, has officially declared his candidacy for the presidency of the Zimbabwe Football Association (ZIFA).\n\nSources within ZIFA confirmed that Mwaruwari submitted his nomination papers in Harare ahead of the official deadline on Wednesday.\n\nWidely known as The Undertaker, Mwaruwari revealed that he had first reached out to fellow football legend Peter Ndlovu to inquire whether Ndlovu would be contesting the position. Ndlovu confirmed he would not be running. Mwaruwari added that he has received strong backing from other prominent figures in Zimbabwean football, who believe that a former player at the helm of ZIFA could be the key to addressing the longstanding issues of corruption and mismanagement that have plagued the sport in the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Benjani Mwaruwari, the iconic former captain of the Zimbabwe national football team, has officially declared his candidacy for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/latest-on-zifa-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Latest On ZIFA Polls\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "Varakashi Sound Alarm On Power Crisis",
            "url": "https://www.zimeye.net/2024/12/13/varakashi-sound-alarm-on-power-crisis/",
            "content": "By A Correspondent\n\nZanu PF hardliners, known as Varakashi, have finally acknowledged that the ongoing electricity load shedding has become a significant problem for the nation.\n\nIn a statement released on Wednesday, the Varakashi group, which runs the Operation Restore Legacy Facebook page, expressed their concerns over the worsening power situation.\n\nThey stated, A lot needs to be done for electricity load shedding to be a thing of the past. The government must engage the best companies or investors who can revive the Kariba Dam Hydro Power Plant.\n\nThe group also provided a visual explanation of the current state of the power supply. They shared two photos, with the first showing the turbines at the Kariba Dam, noting, These are our turbines, and only 2 out of 5 are working. Unfortunately, as of yesterday, only one turbine was functional.\n\nThe second photo depicted Zambias situation, which is similarly strained. Zambia also had only 2 turbines working. Water levels have decreased so much despite other challenges, they added.\n\nThe Varakashis comments highlight the growing frustration and urgency surrounding the ongoing power crisis in the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF hardliners, known as Varakashi, have finally acknowledged that the ongoing electricity load shedding has become … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/varakashi-sound-alarm-on-power-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi Sound Alarm On Power Crisis\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "Zanu PF Youth League In Turmoil",
            "url": "https://www.zimeye.net/2024/12/13/zanu-pf-youth-league-in-turmoil/",
            "content": "By A Correspondent\n\nInfighting within the ZANU PF Youth League has escalated, as Youth League Secretary Tinoda Machakaire has demanded that his deputy, John Paradza, immediately retract a circular that he issued, which allegedly nullified a recent reshuffling of the national executive council.\n\nOn December 9, 2024, Machakaire announced the reshuffle of the ZANU PF Youth League, a move that was met with resistance from Paradza. Paradza argued that the reshuffle was unconstitutional and instructed the affected officials to remain in their positions.\n\nIn his response, Paradza referred to specific provisions within the partys constitution, asserting, May you acquaint yourself with the provisions of Article 26(340)(1)&(2) which provide for the functions and responsibilities of the Deputy Secretary for Youth Affairs. He emphasized that as Deputy Secretary for Youth Affairs, Machakaire had no right to interfere with the functions of the Secretary for Youth Affairs, stating that Machakaire had no constitutional basis for making such a move.\n\nParadza further challenged Machakaires actions, saying, In your letter, you have made vague reference to the composition of the Youth League National Executive Council without particularity on the provision you rely on in making your assertions. He pointed out that there had been no breach of the constitution in the reshuffle, as no official had been removed from the National Executive Council.\n\nMachakaire, in his own letter, defended the reshuffle, stating, Adjustments in the departmental leadership of the Youth League National Executive Council have been implemented purely for the purposes of enhancing the fulfilment of the Youth Leagues constitutional obligations and the execution of the National Peoples Conference Resolutions.\n\nHe also made it clear that the changes were in line with guidance from his principal, asserting, As head of the Youth League, I have communicated the adjustments as I have been duly guided by my Principal in terms of Article 10(88)(1), (2)&(13) and Article 26(339)(1)&(4).\n\nIn conclusion, Machakaire ordered Paradza to withdraw his circular immediately, warning that failure to do so would result in further disciplinary actions. Your much circulated and published correspondence contesting the communicated position is irregular and must be withdrawn forthwith, failing which the appropriate measures shall be set in motion, he stated.\n\nThe growing tension within the Youth League highlights deepening divisions within ZANU PF, with significant implications for the partys future cohesion.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Infighting within the ZANU PF Youth League has escalated, as Youth League Secretary Tinoda Machakaire has demanded … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/zanu-pf-youth-league-in-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Youth League In Turmoil\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "Young Warriors Out Of U-17 AFCON",
            "url": "https://www.zimeye.net/2024/12/13/young-warriors-out-of-u-17-afcon/",
            "content": "Sports Correspondent\n\nThe Zimbabwe U-17 team has been eliminated from the 2025 U-17 Africa Cup of Nations (AFCON) qualifiers after a 2-0 defeat to Angola in the semifinals of the COSAFA Qualifier.\n\nThe Young Warriors conceded one goal in each half of the match, which was held at the University of Johannesburgs AW Muller Stadium.\n\nAngola, who topped Group C, secured the first qualification spot for the 2025 U-17 AFCON in Ivory Coast. The second qualifier will be determined after the second semifinal between South Africa and Zambia.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe U-17 team has been eliminated from the 2025 U-17 Africa Cup of Nations (AFCON) qualifiers after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/young-warriors-out-of-u-17-afcon/\">Continue reading<span class=\"screen-reader-text\"> \"Young Warriors Out Of U-17 AFCON\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "Mambo Dhuterere’s Wife Arrested",
            "url": "https://www.zimeye.net/2024/12/13/mambo-dhutereres-wife-arrested/",
            "content": "By A Correspondent\n\nThe wife of renowned gospel musician Mambo Dhuterere has been arrested on charges of fraud. She appeared in the Harare Magistrates Court this morning, escorted by officers from the Criminal Investigations Department.\n\nMambo Dhuterere, a well-known figure in the gospel music scene, has released several albums throughout his career.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The wife of renowned gospel musician Mambo Dhuterere has been arrested on charges of fraud. She appeared … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/mambo-dhutereres-wife-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"Mambo Dhuterere’s Wife Arrested\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "People Deliberately Throwing Themselves In Front Of Moving Cars For Compensation Claims",
            "url": "https://www.zimeye.net/2024/12/13/people-deliberately-throwing-themselves-in-front-of-moving-cars-for-compensation-claims/",
            "content": "By A Correspondent\n\nThe Road Accident Fund (RAF) has issued a public warning regarding individuals intentionally throwing themselves in front of moving vehicles in an attempt to claim compensation.\n\nThe RAF has revealed that these individuals typically follow cars at low speeds to reduce the risk of fatal injury, though they still sustain harm in the process. Officials have emphasized that these actions will not lead to successful claims and have urged people to reconsider such dangerous behavior.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Road Accident Fund (RAF) has issued a public warning regarding individuals intentionally throwing themselves in front … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/people-deliberately-throwing-themselves-in-front-of-moving-cars-for-compensation-claims/\">Continue reading<span class=\"screen-reader-text\"> \"People Deliberately Throwing Themselves In Front Of Moving Cars For Compensation Claims\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "The Undertaker Eyes ZIFA Presidency",
            "url": "https://www.zimeye.net/2024/12/13/the-undertaker-eyes-zifa-presidency/",
            "content": "Sports Correspondent\n\nBenjani Mwaruwari, the iconic former captain of the Zimbabwe national football team, has officially declared his candidacy for the presidency of the Zimbabwe Football Association (ZIFA).\n\nSources within ZIFA confirmed that Mwaruwari submitted his nomination papers in Harare ahead of the official deadline on Wednesday.\n\nWidely known as The Undertaker, Mwaruwari revealed that he had first reached out to fellow football legend Peter Ndlovu to inquire whether Ndlovu would be contesting the position. Ndlovu confirmed he would not be running. Mwaruwari added that he has received strong backing from other prominent figures in Zimbabwean football, who believe that a former player at the helm of ZIFA could be the key to addressing the longstanding issues of corruption and mismanagement that have plagued the sport in the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Benjani Mwaruwari, the iconic former captain of the Zimbabwe national football team, has officially declared his candidacy for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/the-undertaker-eyes-zifa-presidency/\">Continue reading<span class=\"screen-reader-text\"> \"The Undertaker Eyes ZIFA Presidency\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        },
        {
            "title": "S A Intensifies Deportations While Botswana Welcomes Zimbabwean Talent",
            "url": "https://www.zimeye.net/2024/12/12/s-a-intensifies-deportations-while-botswana-welcomes-zimbabwean-talent/",
            "content": "South Africa The Department of Home Affairs and the Border Management Authority (BMA) have intensified anti-immigration measures, unveiling drones and deportation busesin a bidto curb illegal border crossings ahead of the festive season.\n\nThese measures, described by critics as xenophobic, primarily target Zimbabweans and other regional migrants seeking refuge in Pretoria amid economic hardships back home.\n\nAt the same time, Botswana has adopted a more inclusive approach, expediting documentation processes for skilled Zimbabweans to fill labour gaps in its booming economy, particularly in the diamond sector.\n\nThe use of drones, hailed as a first-of-its-kind initiative, was launched by Democratic Alliance (DA) Home Affairs Minister Leon Schreiber.\n\nAt the launch event, Schreiber emphasised the governments commitment to monitoring South Africas bordersmore rigorously.\n\nNo longer will it be the case that people can move around without us having eyes on them, Schreiber said. We want to send a very clear message to people who want to violate South Africas immigration laws: for the very first time, you wont even know that we are seeing you. We are above you, we are around you, and we are watching for infringements along the borderline.\n\nThe drones willbe supplementedby body cameras for border guards to prevent corruption and ensure safety.\n\nTo further bolster enforcement, the government has introduced buses tasked with deporting undocumented migrants back to their home countries.\n\nSchreiber stressed the importance of distinguishing between those who follow the law and contribute to the South African economy and those who do not.\n\nWe welcome anytraveler, investor, tourist, or skilled person who will follow our laws and help us build South Africa. But that is different from people who violate our law and dont want to comply with our rules.\n\nIn a symbolic demonstration of the new measures, the first wave of deportations saw 290 illegal miners sent back to Mozambique.\n\nWhile South Africa tightens its grip, Botswana has taken a markedly different stance.\n\nThe country announced plans to expedite work permits and documentation for skilled Zimbabweansalreadycontributing to its economic growth.\n\nThe move, celebrated by many Zimbabwean professionals, is part of Botswanas broader strategy to harness regional talent in key industries.\n\nThe contrasting approaches highlight divergent regional strategies toward migration.\n\nWhile South Africas methods are increasingly focused on border militarisation and mass deportations, Botswanas policies appear to underscore the potential of skilled migrants to foster economic development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa – The Department of Home Affairs and the Border Management Authority (BMA) have intensified anti-immigration measures, unveiling drones and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/s-a-intensifies-deportations-while-botswana-welcomes-zimbabwean-talent/\">Continue reading<span class=\"screen-reader-text\"> \"S A Intensifies Deportations While Botswana Welcomes Zimbabwean Talent\"</span></a></p>",
            "time": "2024-12-13 06:24:16"
        }
    ]
}