{
    "news": [
        {
            "title": "VP Chiwenga, ED Lock Horns In Mutare",
            "url": "https://www.zimeye.net/2025/10/16/vp-chiwenga-ed-lock-horns-in-mutare/",
            "content": "By A CorrespondentVice PresidentConstantino Chiwengaand his boss,President Emmerson Mnangagwa, are set to lock horns at the ruling partysZANU PF Annual ConferenceinMutare, which began this week. Their supporters are reportedly gearing up for a tense confrontation amid deepeningsuccession battlesand growing mistrust within the Presidium.\n\nChiwenga has already shown remarkable defiance in recent months, having directly challenged Mnangagwa to halt and investigate his allies who are pushing for the controversialVision 2030 Agendaa campaign many within ZANU PF view as a veiled attempt to extend Mnangagwas rule beyond the constitutional two-term limit.\n\nOutspoken former Norton MPTemba Mliswahas warned that Chiwenga could even beexpelled from ZANU PFduring the Mutare conferencean outcome that would mark the most dramatic escalation yet in the ruling partys long-simmering internal feud.\n\nIn anexplosive interview with ZimEye, Mliswa  a former ZANU PF Mashonaland West Provincial Chairperson and one of the partys most outspoken insiders  predicted that Mnangagwa will use the conference toconsolidate his grip on powerand politicallyneutralize his deputy.\n\nIf theres anyone to be chased this week, it could be Chiwenga at congress, because ED can fire anyone at conference, Mliswa declared. The only safe person at the conference is ED. No one can move a motion to remove him because it has to be on the agenda, and the conference is not an elective congress  just like in 2017.\n\nThe current confrontation revives memories of the2017 political upheavalthat ousted long-time rulerRobert Mugabe. Then, Chiwenga  as Commander of the Zimbabwe Defence Forces  led the military intervention, code-namedOperation Restore Legacy, which paved the way for Mnangagwas rise to power.\n\nHowever, the alliance forged in the heat of the coup began tofracture almost immediatelyafter the transition.Chiwenga, who saw himself as the guarantor of the post-Mugabe political order, reportedly expected a rotational leadership arrangement or succession pact. Mnangagwa, however, swiftlycentralized power, surrounded himself with loyalists such asZiyambi Ziyambi,Owen Ncube, andKudakwashe Tagwirei, and embarked on a campaign to weaken Chiwengas influence within both thepartyand themilitary.\n\nBy 2019, Chiwengas health challenges, frequent medical trips to China, and the removal of key military figures loyal to him  including Air Marshal Perrance Shiri and SB Moyo  left himincreasingly isolated. The2023 elections, which cemented Mnangagwas second term, further widened the rift as the Presidents allies began floating theED2030narrative, signalling his intentions to remain in power beyond his constitutional mandate.\n\nThe latest flashpoint came with theleak of a confidential dossier, reportedly authored and presented by Chiwenga before the ZANU PF Politburo in September 2025. In the document, Chiwenga accused Mnangagwa and his business allies Tagwirei, Wicknell Chivhayo, Delish Nguwaya, andScott Sakupwanya ofstate capture and grand corruption, alleging they were using state resources to entrench a dynastic political agenda under the guise of Vision 2030.\n\nThe dossiers publication has shaken the ruling elite. Mnangagwas inner circle has branded it adeclaration of war,with some calling for Chiwengasimmediate dismissal or arrestfor undermining the President.\n\nAccording to Mliswa, such defiance could mark Chiwengasfinal fall:\n\nThe only person untouchable is ED, he emphasized. He holds all the cards. Chiwenga, just like anyone else, can be dismissed even before the conference ends. Those thinking otherwise are living in denial.\n\nAdding to the tension,campaign-style fliersemblazoned with the messagePresident for 2028 & Beyond  General Constantino G.D.N. Chiwengahave flooded the streets of Mutare.The leaflets carry bold slogans such asNo to corruption, no to patronage and cronyism  enough is enoughandI stand for Zimbabweans, not ZANU PF interests,signalling an open challenge to Mnangagwas authority.\n\nFor many party observers, these fliers representthe clearest indication yet of factional defiancewithin ZANU PFs ranks and a symbolic reawakening of the 2017 fault lines  this time, with Mnangagwa wielding the same instruments of power once used against Mugabe.\n\nInsiders say the Mutare conference could prove to be adecisive momentfor both men. Mnangagwa is expected to use the event toreassert controlandpurge dissent, while Chiwengas allies are bracing for potential political retribution.\n\nMliswa likened the current tensions to theprelude to the November 2017 coup, when Mnangagwa and Chiwenga worked together to oust Mugabe  but warned that this time, the former general standsisolated and vulnerable.\n\nWho controls the chairpersons? Mliswa asked. The only person safe is Mnangagwa because he can only be removed at congress. The Vice President, including Chiwenga, can be fired by ED even as the conference ends.\n\nAs the Mutare conference unfolds,ZANU PFs internal battle lines have never been sharper. Whether Mnangagwa moves decisively against his deputy or seeks a temporary truce, the outcome will define not onlythe future of the ruling partybut alsoZimbabwes political trajectoryleading into the 2030 elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —Vice President Constantino Chiwenga and his boss, President Emmerson Mnangagwa, are set to lock horns at the ruling party’s ZANU PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/16/vp-chiwenga-ed-lock-horns-in-mutare/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga, ED Lock Horns In Mutare\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Coup Looms As ED Bootlickers Push for VP Chiwenga’s Arrest",
            "url": "https://www.zimeye.net/2025/10/16/coup-looms-as-ed-bootlickers-push-for-vp-chiwengas-arrest/",
            "content": "By A Correspondent- History appears to be repeating itself in Zimbabwes corridors of power, with Justice Minister and staunch Mnangagwa loyalist Ziyambi Ziyambi now calling for the arrest of Vice President Constantino Chiwenga, accusing him of treason  the same charge levelled against him and the military top brass by the Mugabe administration in November 2017.\n\nIn a damning letter dated17 September 2025, Ziyambi condemned a confidential dossier authored by Chiwenga and presented to PresidentEmmerson Mnangagwa, describing it as fundamentally flawed, inciteful, and treasonous. He alleged that the Vice Presidents document sought to undermine a constitutionally elected President and rekindle the appetite to return Zimbabwe to November 2017  a clear allusion to the military coup that toppled the late Robert Mugabe.\n\nZiyambi accused Chiwenga of plotting to destabilize the state and subvert constitutional order, calling his actions adirect threat to national security. He further claimed that Chiwengas push for the arrest of controversial businessmenKudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, andDelish Nguwayaover multi-billion-dollar corruption scandals was merely a smokescreen for a broader plan to seize control of government.\n\nThis behaviour, Ziyambi reportedly wrote, is treasonous in nature and should be crushed decisively under Zimbabwes laws protecting the sovereignty of the State and the authority of the President.\n\nUnderSection 20of ZimbabwesCriminal Law (Codification and Reform) Act, treason is punishable bylife imprisonment or death, underscoring the gravity of Ziyambis accusations.\n\nThe Justice Minister also mounted a spirited defence of MnangagwasVision 2030 Agenda, which critics have dismissed as a tool to entrench Mnangagwas hold on power, insisting that the programme is lawful, constitutional, and supported by the will of the people.\n\nThe escalating feud between the President and his deputy marks the most serious internal confrontation withinZANU-PFsince 2017  when the partys then mouthpiece,The Herald, ran with the now-infamous headlineZanu-PF unfazed by Chiwenga, accusing him of treasonous statements just days before the military deposed Mugabe.\n\nPolitical analysts warn that Ziyambis remarks suggest that Mnangagwas loyalists arereplaying the script of 2017, this time turning the same accusations once used to justify the coup against their former ally.\n\nThe parallels are unmistakable, said one political commentator. In 2017, Chiwenga was accused of treason for defending the military. Today, he faces the same charge for allegedly defying the President. Its as if the revolution has come full circle.\n\nIf the treason allegations are formally pursued, observers warn that Zimbabwe could be on the brink of anotherhigh-stakes power struggle, testing bothZANU-PFs internal unityand theresilience of the countrys constitutional order.\n\nZimEye News | Developing Story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- History appears to be repeating itself in Zimbabwe’s corridors of power, with Justice Minister and staunch Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/16/coup-looms-as-ed-bootlickers-push-for-vp-chiwengas-arrest/\">Continue reading<span class=\"screen-reader-text\"> \"Coup Looms As ED Bootlickers Push for VP Chiwenga’s Arrest\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Hon Desire Moyo Burial Set For Today",
            "url": "https://www.zimeye.net/2025/10/16/hon-desire-moyo-burial-set-for-today/",
            "content": "By A Correspondent\n\nHon. Desire Moyo, the respected political figure, will be laid to rest today, 16th October 2025, in Bulawayo. The funeral and burial program has been shared with the public, with the funeral service scheduled to start at 9 a.m.\n\nHon. Moyo tragically passed away last Friday in a motor vehicle accident. According to reports, the vehicle he was travelling in collided with an elephant near Shangani, resulting in his untimely death.\n\nFamily, friends, and well-wishers are expected to attend the funeral to pay their final respects to the late Hon. Moyo, who is remembered for his dedication to public service.\n\nThe burial comes as the nation mourns the sudden loss of a prominent leader whose life was cut short in a tragic accident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Hon. Desire Moyo, the respected political figure, will be laid to rest today, 16th October 2025, in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/16/hon-desire-moyo-burial-set-for-today/\">Continue reading<span class=\"screen-reader-text\"> \"Hon Desire Moyo Burial Set For Today\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "VP Chiwenga Faces Treason Charges",
            "url": "https://www.zimeye.net/2025/10/16/vp-chiwenga-faces-treason-charges/",
            "content": "By A Correspondent  President Emmerson Mnangagwas top ally, and Justice Minister Ziyambi Ziyambi, has called for the arrest of Vice President Constantino Chiwenga, accusing him of treason, one of the most serious offences under Zimbabwean law.\n\nIn a damning letter dated 17 September 2025, Ziyambi slammed a confidential dossier authored and presented by Chiwenga to President Emmerson Mnangagwa, branding it fundamentally flawed, inciteful, and treasonous. The Justice Minister charged that the Vice Presidents document amounted to an attempt to undermine a constitutionally elected President and to rekindle the appetite to return Zimbabwe to November 2017, in reference to the military coup that ousted the late Robert Mugabe.\n\nZiyambi accused Chiwenga of plotting to destabilise the state and subvert constitutional order, describing his conduct as a direct threat to national security. He said the Vice Presidents calls for the arrest of prominent businessmen Kudakwashe Tagwirei, Wicknell Chivhayo, Scott Sakupwanya, and Delish Nguwaya, over alleged multi-billion-dollar corruption were merely a smokescreen for a wider agenda to seize control of government.\n\nThis behaviour, Ziyambi reportedly wrote, is treasonous in nature and should be crushed decisively under Zimbabwes laws protecting the sovereignty of the State and the authority of the President.\n\nUnder Section 20 of Zimbabwes Criminal Law (Codification and Reform) Act, treason is punishable by life imprisonment or death, underscoring the seriousness of Ziyambis accusation.\n\nThe minister also defended Mnangagwas controversial Vision 2030 Agenda, widely viewed by critics as an attempt to entrench the Presidents rule, insisting it was lawful, constitutional, and supported by the will of the people.\n\nThe unprecedented public rift between Mnangagwas camp and the powerful Vice President marks the most serious internal confrontation within ZANU-PF since the 2017 coup, with both men being former army generals who once jointly led Operation Restore Legacy.\n\nPolitical observers warn that if the treason charge against Chiwenga is formally pursued, it could ignite the gravest power struggle in Zimbabwes post-Mugabe era, testing not only ZANU-PFs internal cohesion but also the resilience of the countrys fragile constitutional order.\n\nZimEye News | Developing Story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — President Emmerson Mnangagwa’s top  ally, and Justice Minister Ziyambi Ziyambi, has called for the arrest of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/16/vp-chiwenga-faces-treason-charges/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Faces Treason Charges\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Mliswa Says VP aMiswa | Zvigananda 5 – General 0",
            "url": "https://www.zimeye.net/2025/10/16/mliswa-says-vp-amiswa-zvigananda-5-general-0/",
            "content": "By Sabhuku Temba Mliswa |\n\nI have spoken about political miscalculations by the VP and him getting misleading advice. Now lately he has lost it on so many fronts:\n\nObert Mpofu his right hand man -(Reshuffled) 0-1Sanyatwe another ally-(Reshuffled) 0-2Central Committee Vehicles (Given Against His Opinion) 0-3ZANU PF Director General, Brigadier Gen (Rtd) Ezekiel Zabanyana (Fired) 0-4Kuda Tagwirei (CC Co-Option Done) 0-5.\n\nHe reportedly even tried to stop Party Commissar Machacha from reading about co-options but was overruled by ED!\n\nUnomira wega muZANU PF!\n\nSCORELINEZvigananda 5- General 0\n\nSCORELINEZvigananda 5- General 0 (@TembaMliswa)https://t.co/Hn8KhXSFAx\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sabhuku Temba Mliswa | I have spoken about political miscalculations by the VP and him getting misleading advice. Now … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/16/mliswa-says-vp-amiswa-zvigananda-5-general-0/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Says VP aMiswa | Zvigananda 5 – General 0\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Bafana Bafana Secure Spot at 2026 FIFA World Cup",
            "url": "https://www.zimeye.net/2025/10/16/bafana-bafana-secure-spot-at-2026-fifa-world-cup/",
            "content": "Sports Correspondent\n\nSouth Africas national football team, Bafana Bafana, has secured automatic qualification to the 2026 FIFA World Cup, joining eight other African nations in the tournament.\n\nThe nine African teams that have booked their places so far are:\n\nThe 10th African representative will be decided through continental playoffs scheduled for next month.\n\nThe playoffs will feature Nigeria, Cameroon, Gabon, and the Democratic Republic of Congo (DRC), who finished as the four best-ranked second-placed teams in the qualifiers.\n\nBafana Bafanas qualification marks a major achievement for South African football as the team prepares to compete on the expanded 48-team stage at the 2026 World Cup, set to be hosted jointly by the United States, Canada, and Mexico.\n\nFootball fans across the continent are eagerly anticipating the upcoming playoffs, which will determine the final African team to join the prestigious tournament.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent South Africa’s national football team, Bafana Bafana, has secured automatic qualification to the 2026 FIFA World Cup, joining … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/16/bafana-bafana-secure-spot-at-2026-fifa-world-cup/\">Continue reading<span class=\"screen-reader-text\"> \"Bafana Bafana Secure Spot at 2026 FIFA World Cup\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Despite Rising Political Pressure, Mnangagwa Insists Zanu PF Is Invincible",
            "url": "https://www.zimeye.net/2025/10/16/despite-rising-political-pressure-mnangagwa-insists-zanu-pf-is-invincible/",
            "content": "Zanu PF First Secretary President Emmerson Dambudzo Mnangagwa reaffirmed the partys strength and resilience during the 388th Ordinary Session of the Politburo in Harare on Tuesday, sending a clear warning to critics and detractors.\n\nAddressing members, Mnangagwa condemned those he said were undermining national interests and ongoing development projects.\n\nShame, shame, shame on all those who are denigrating our national interests, and ongoing people-centred projects and programmes, he said.\n\nThe President emphasized that the party would not be shaken by negative characterizations.\n\nWe are ZANU PF, and will not be deterred. We reject the negative and harmful characterisations of our Party and country, Mnangagwa added, stressing that the party remains focused on its agenda despite detractors.\n\nPolitical analysts suggest that Mnangagwas remarks reflect a strategy to consolidate support within Zanu PF while countering opposition narratives ahead of the partys upcoming Annual Conference.\n\nHis strong message underscores Zanu PFs intent to project stability and unity as it navigates an increasingly tense political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zanu PF First Secretary President Emmerson Dambudzo Mnangagwa reaffirmed the party’s strength and resilience during the 388th Ordinary Session of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/16/despite-rising-political-pressure-mnangagwa-insists-zanu-pf-is-invincible/\">Continue reading<span class=\"screen-reader-text\"> \"Despite Rising Political Pressure, Mnangagwa Insists Zanu PF Is Invincible\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "ZimDaily Cartoon Mocks Geza: “Chiwenga Gave Us ED — Nhasi Anaka?”",
            "url": "https://www.zimeye.net/2025/10/15/zimdaily-cartoon-mocks-geza-chiwenga-gave-us-ed-nhasi-anaka/",
            "content": "HARARE  Satirical heat is intensifying as Zimbabwe heads toward the defining showdown over Resolution Number 1, with ZimDaily dropping a biting cartoon and message that ridicule current power struggles within ZANU PF.\n\nA comic released Wednesday portrays a fatigued military figure  clearly modeled after Vice President Constantino Chiwenga  desperately trying to dig his way across a chasm using a shovel and pickaxe, only to make things worse. The caption:Trying to replace ED with Chiwenga be like\n\nThe accompanying post mockingly states:\n\nChiwenga gave us ED nhasi anaka? (Chiwenga gave us ED now today hes better?)\n\nThis jab lands amid growing national tension following a fiery midweek address by activist Blessed Geza, who has called for a nationwide protest on Wednesday 17 October  the same day ZANU PF is expected to vote on Resolution 1, which seeks to extend President Emmerson Mnangagwas term beyond 2028.\n\nThe cartoon adds sharp commentary to a rising sentiment in both ruling party circles and the broader public: that a switch from Mnangagwa to Chiwenga may simply be trading one strongman for another  or as some put it, kutsiva zigandanga nerimwe zigandanga.\n\nThe ZimDaily cartoon arrives as senior ZANU PF members, intelligence memos, and opposition activists brace for a historic internal vote that could rupture the already fragile ruling party. With Blessed Gezas call to action coinciding with the resolution day, public sentiment is hardening around the demand for a total system change  not just another recycled military figurehead.\n\nThe satire underscores a haunting dilemma for millions of Zimbabweans:Are we digging ourselves deeper trying to escape the pit?\n\n More updates to follow as tensions rise ahead of 17 October.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "HARARE — Satirical heat is intensifying as Zimbabwe heads toward the defining showdown over Resolution Number 1, with ZimDaily dropping … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/zimdaily-cartoon-mocks-geza-chiwenga-gave-us-ed-nhasi-anaka/\">Continue reading<span class=\"screen-reader-text\"> \"ZimDaily Cartoon Mocks Geza: “Chiwenga Gave Us ED — Nhasi Anaka?”\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Time for Mnangagwa to Uphold His Constitutional Oath",
            "url": "https://www.zimeye.net/2025/10/15/time-for-mnangagwa-to-uphold-his-constitutional-oath/",
            "content": "By Engineer Jacob Kudzayi Mutisi-Time and time again, President Emmerson Mnangagwa has declared that he is a constitutionalist, a man who upholds the rule of law and respects the will of the people as enshrined in the Constitution of Zimbabwe. He has constantly emphasised that his leadership is guided by constitutional principles and democratic values.\n\nHowever, the current attempts by Daniel Gware and his crew to push for constitutional manipulation, aimed at extending the presidential term beyond what the law allows, are in direct contradiction to everything the President has stood for. It is concerning that individuals within the ruling party appear determined to pressure the Head of State into breaking the very law he helped craft and swore to defend.\n\nZimbabwes Constitution is not just a document of convenience; it is the supreme law of the land, a product of the peoples will and a symbol of their hope for accountable governance. Any effort to tamper with its provisions for political gain undermines the integrity of our democracy and betrays the trust of the citizens who voted for it.\n\nNow, as the ZANU PF 22nd Annual National Peoples Conference is just hours away, the moment of truth has arrived. This conference presents President Mnangagwa with the perfect opportunity to reaffirm his commitment to the Constitution and silence those who are advocating for unconstitutional amendments.\n\nTrue leadership is measured not by how much power one can accumulate, but by how faithfully one can protect the institutions that safeguard the peoples rights and freedoms. The President must use this platform to decisively put this matter to rest and demonstrate to Zimbabwe and to the world that he remains a leader of principle, integrity and constitutional fidelity.\n\nThe nation awaits his word.\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi-Time and time again, President Emmerson Mnangagwa has declared that he is a constitutionalist, a man … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/time-for-mnangagwa-to-uphold-his-constitutional-oath/\">Continue reading<span class=\"screen-reader-text\"> \"Time for Mnangagwa to Uphold His Constitutional Oath\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        },
        {
            "title": "Blessed Geza’s Full Statement In Full Text",
            "url": "https://www.zimeye.net/2025/10/15/blessed-gezas-full-statement-in-full-text/",
            "content": "Call to Action for Zimbabweans.\n\nThe moment we have been yearning for is upon us. In just two days, on 17 October 2025, we will flood the streets of Harare to reclaim our dignity from the corrupt and indifferent regime. For those in other cities such as Bulawayo, Masvingo, Mutare, Gweru, and others who cannot travel to Harare, protest from wherever you are. Your voice matters. Zimbabwe cannot afford another day with Emmerson in office.\n\nConstitutional BasisUnder Section 2-1-2 of the Constitution, the Zimbabwe Defence Forces are duty-bound to protect the nation, its people, and its interests. Similarly, under Section 2-1-9, the Zimbabwe Republic Police are tasked with protecting life and property, upholding the law, and maintaining peace and order. The same Constitution grants the people the right to protest peacefully.\n\nTo the military and police: We plead with you not only to respect the democratic right of citizens to protest peacefully but also to ensure their safety. We look up to you, united in this cause.\n\nOur DemandsOn 17 October, Zimbabweans, let us rise as one. Our message is clear:\n\nRoadmap for Action\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Call to Action for Zimbabweans. The moment we have been yearning for is upon us. In just two days, on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/15/blessed-gezas-full-statement-in-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza’s Full Statement In Full Text\"</span></a></p>",
            "time": "06:34",
            "date": "17 Oct 2025"
        }
    ]
}