{
    "news": [
        {
            "title": "President Mnangagwa Sends CIO Staff To Go Remind The Late Robert Mugabe To Attend His Meeting",
            "url": "https://www.zimeye.net/2025/04/23/president-mnangagwa-sends-cio-staff-to-go-remind-the-late-robert-mugabe-to-attend-his-meeting/",
            "content": "By A Correspondent | ZimEye | Yesterday President Emmerson Mnangagwa sent a security detail to remind the late President Robert Mugabe to attend a meeting with him.\n\nMugabe died 6 years ago. Coincidentally, 6 years is also the period in which Mnangagwa in a recent speech says he has allowed state procurement thugs to thrive.\n\nThe incident happened the same day anti corruption activist Blessed Geza announced further allegations that Mnangagwa is suffering from acute dementia.\n\nThe President sent someone from the B1 branch of the CIO, go to President Mugabe and call him, I cant hold the meeting without him, sources told ZimEye.\n\nFurther details were not available.\n\nThe Presidents office had not passed comment over the matter at the time of writing.\n\nThe development comes at a time when the president is accused of having lost his capacities to a health challenge.\n\nGeza says the country is now being run by his wife and businessman Kuda Tagwirei.  ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Yesterday President Emmerson Mnangagwa sent a security detail to remind the late President Robert … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/23/president-mnangagwa-sends-cio-staff-to-go-remind-the-late-robert-mugabe-to-attend-his-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"President Mnangagwa Sends CIO Staff To Go Remind The Late Robert Mugabe To Attend His Meeting\"</span></a></p>",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "Kombi Driver Abducted by Men In Toyota Fortuner in Dzivarasekwa Extension",
            "url": "https://www.zimeye.net/2025/04/23/kombi-driver-abducted-by-men-in-toyota-fortuner-in-dzivarasekwa-extension/",
            "content": "Harare  April 23, 2025 | ZimEye News Desk\n\nBy A Correspondent | ZimEye | A kombi driver has been abducted by a group of unidentified men in Dzivarasekwa Extension, Harare, in a dramatic escalation of violent incidents that rocked the area earlier this morning.\n\nThe abduction occurred at Transerv, a local service centre, just hours after a violent assault spree by five unidentified men driving two white Toyota GD6 Fortuners, without number plates. Witnesses told ZimEye that the gang, dressed in civilian clothing, descended into the suburb around 10AM and began indiscriminately beating residents with baton sticks.\n\nAt least 16 people were assaulted, accused by the attackers of burning tyres on Chesa Road in Dzivarasekwa Extension. However, residents say they have no knowledge of who was behind the tyre-burning.\n\nWe do not know who burnt the tyres. We arrived at the spot and found the six tyres already burning on the road, said one witness.\n\nThe violence continued for over 15 minutes, forcing local shops to shut down. A tyre repairman known only as Shamhamha was among those severely injured. He was reportedly struck with a shovel and later admitted to Parirenyatwa Hospital, where his condition remains unknown. Efforts to get official comment from hospital authorities were unsuccessful at the time of publication.\n\nIn a disturbing turn, the same group is believed to have later abducted a kombi driver from Transerv. The motive behind the kidnapping is unclear, and the identity of the victim has not yet been released.\n\nThe assailants, still unidentified, effectively shut down the entire area during the assault. Tensions remain high in Dzivarasekwa Extension as residents fear further violence.\n\nAuthorities have yet to issue an official statement.\n\nThis is a developing story. More to follow.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – April 23, 2025 | ZimEye News Desk By A Correspondent | ZimEye | A kombi driver has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/23/kombi-driver-abducted-by-men-in-toyota-fortuner-in-dzivarasekwa-extension/\">Continue reading<span class=\"screen-reader-text\"> \"Kombi Driver Abducted by Men In Toyota Fortuner in Dzivarasekwa Extension\"</span></a></p>",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "ZITF 2025 Farm Produce",
            "url": "https://www.zimeye.net/2025/04/23/zitf-2025-farm-produce/",
            "content": "Matabeleland South Cattle Breeder Obert Chinhamo livestock at ZITF 2024\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Matabeleland South Cattle Breeder Obert Chinhamo livestock at ZITF 2024",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "Details In Brig Gen Rungani’s Death",
            "url": "https://www.zimeye.net/2025/04/23/details-in-brig-gen-runganis-death/",
            "content": "By Political Reporter- Thestate media has whitewashed the brutal legacy of Retired Brigadier General Victor Chikudo Rungani, who died Tuesday in Harare, erasing from public memory the terror he unleashed duringZimbabwesdarkest political chapter.\n\nOnce one of the late President RobertMugabeschief enforcers, Rungani orchestrated a campaign of violence during the 2008 elections that left scores of opposition MDC supporters dead, maimed, or psychologically scarred.\n\nAt the time, he was Director of the Zimbabwe NationalArmysEngineering and Military Equipment Directorate.\n\nBut in the lead-up to the June 2008 run-off election, he was deployed to Mashonaland East, not to buildbut to destroy.\n\nThere, Rungani personally directed torture sessions and killings, earning infamy as one of the architects of ZANU PFs scorched-earth strategy to cling to power after Mugabe lost the first round to Morgan Tsvangirai.\n\nState-owned media, however, only reported that Rungani died at Mbuya Dorcas Hospital in Waterfalls, portraying him as a decorated military man who bolstered engineering within the armed forces.\n\nThey omitted the blood on his hands.\n\nCIO Minister Lovemore Matuke, confirmingRunganisdeath, joined the chorus of silence, saying only:I received the sad news from his wife,without acknowledging the suffering the general inflicted.\n\nBorn in Bikita, Masvingo province, Rungani was a key cog in the Joint Operations Command (JOC)the shadowy military cabal thathijackedZimbabweselections and democracy under the guise of defending sovereignty.\n\nHis death was first announced on social media by the Children of War Veterans Association (COZWVA), where his son, Hardlife Rungani, is an active member.\n\nDuring the 2008 run-off, Rungani oversaw a reign of terror in Mashonaland East as part of a nationwide military offensive.\n\nVillageswere turnedinto zones of fear, with mass beatings, gang rapes, abductions, and re-education camps known aspungweswhere MDC activistswere torturedovernight.\n\nHe operated in tandem with a cast of infamous commanders: Major General Engelbert Rugeje in Masvingo, Brigadier General David Sigauke in Mashonaland West, Brigadier General Douglas Nyikayaramba in Manicaland, Air Vice Marshal Abu Basutu in Matabeleland South, Air Vice Marshal Henry Muchena in Harare, Brigadier General Sibusiso Moyo in the Midlands, Brigadier General Sibangumuzi Khumalo in Matabeleland North, Brigadier General Etherton Shungu in Mashonaland Central, Colonel Chris Sibanda in Bulawayo, and Air Commodore Mike Tichafa Karakadzai in Harare.\n\nThese men, backed by the Central Intelligence Organisation and more than 80,000 youth militia, launched an all-out war on dissent that ultimately forced Morgan Tsvangirai to withdraw from the run-off.\n\nTheir campaign was not just politicalit waspersonal, brutal, and systematic.Runganislegacyis stainedwith the screams of those who were never allowed to vote freely.\n\nWhile his death may signal the end of onemanschapter, it reopens deep national wounds and reminds Zimbabwe that the architects of its pain have never been held accountable.\n\nRunganisname, like those of his comrades, lives onnot inhonour,but in infamy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- The state media has whitewashed the brutal legacy of Retired Brigadier General Victor Chikudo Rungani, who died Tuesday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/23/details-in-brig-gen-runganis-death/\">Continue reading<span class=\"screen-reader-text\"> \"Details In Brig Gen Rungani’s Death\"</span></a></p>",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "ZITF 2025 Day Three in Pictures",
            "url": "https://www.zimeye.net/2025/04/23/zitf-2025-day-three-in-pictures/",
            "content": "Agriculture is the cornerstone of a progressive nation.  Farmers are exhibiting at ZITF 2024.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Agriculture is the cornerstone of a progressive nation. Farmers are exhibiting at ZITF 2024.",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "ZRP Warn Geza on abuse of social media",
            "url": "https://www.zimeye.net/2025/04/23/zrp-warn-geza-on-abuse-of-social-media/",
            "content": "Zimbabwe Republic Police Spokesperson Assistant Commissioner Paul  Nyathi has warns Bleasee Geza on abuse of social media.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabwe Republic Police Spokesperson Assistant Commissioner Paul Nyathi has warns Bleasee Geza on abuse of social media.",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "Popular Midlands Zanu PF Mbinga Dies",
            "url": "https://www.zimeye.net/2025/04/23/popular-midlands-zanu-pf-mbinga-dies/",
            "content": "By Farai D Hove | ZimEye | Popular Zanu PF Midlands capital Mbinga Lazarus T. Chikadaya has died.\n\nChikadaya, who is known for supporting President Mnangagwa in Gweru, died early this morning in Harare.\n\nHe is widely known as the founder and managing director of Drawlink Civil Engineering and was hailed by the ZANU PF-controlled state media as a towering figure in the Midlands economic landscape.\n\nDetails surrounding the cause of his death are still emerging, but sources confirm he passed away peacefully in the capital.\n\nTributes have already begun to pour in on social media, with many describing him as a visionary leader, a generous mbinga, and a passionate patriot who always wore his heartand often his scarffor Zimbabwe.\n\nCentral Radio 95.8, which broke the news on their social media platforms, described him as a trailblazer whose legacy in civil engineering will not be forgotten.\n\nChikadayas larger-than-life presence, community contributions, and unmistakable laugh will be deeply missed. Plans for his funeral and memorial are expected to be announced soon.\n\nMore details to follow as this story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | Popular Zanu PF Midlands capital Mbinga Lazarus T. Chikadaya has died. Chikadaya, who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/23/popular-midlands-zanu-pf-mbinga-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Popular Midlands Zanu PF Mbinga Dies\"</span></a></p>",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "Week 2 Action Heats Up in Harare Province Elite Junior Football Development League",
            "url": "https://www.zimeye.net/2025/04/23/week-2-action-heats-up-in-harare-province-elite-junior-football-development-league/",
            "content": "Sports Correspondent\n\nHARARE  Week 2 of the Harare Elite Junior Football Development League (HPJFDL)  sees a thrilling lineup of matches across the capital, as young footballers take to the field in a celebration of skill, sportsmanship, and youth empowerment.\n\nFrom Mbare to Borrowdale, the city will be alive with the sound of cheering crowds and the unmistakable rhythm of grassroots football. The league, which brings together junior teams from across Harare, continues to grow in popularity as it unearths some of Zimbabwes brightest future stars.\n\nIts still sports development, though its soccer, said organizing secretary Reuben Dauti. We are covering the whole capital city  talent, entertainment, and development for our youth in Zimbabwe.\n\nThe HPJFDL, now gaining recognition as a cornerstone of youth sports in the city, aims to bridge the gap between community football and professional development. Coaches, parents, and scouts all showed up in numbers, with some matches drawing impressive crowds for the junior level.\n\nWith more fixtures lined up, the HPJFDL promises to keep nurturing young footballers while uniting communities around the beautiful game. Organizers say they are committed to expanding the reach of the league and ensuring every child in Harare has access to football opportunities.\n\nThis is just the beginning, Dauti added. The vision is big. Were not just building players, were building future leaders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent HARARE – Week 2 of the Harare Elite Junior Football Development League (HPJFDL) sees a thrilling lineup of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/23/week-2-action-heats-up-in-harare-province-elite-junior-football-development-league/\">Continue reading<span class=\"screen-reader-text\"> \"Week 2 Action Heats Up in Harare Province Elite Junior Football Development League\"</span></a></p>",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "ED’s Gweru Mbinga Lazarus Chikadaya Dies",
            "url": "https://www.zimeye.net/2025/04/23/eds-gweru-mbinga-lazarus-chikadaya-dies/",
            "content": "ED Gweru Businessman Lazarus T. Chikadaya Dies in Harare\n\nHarare, Zimbabwe  April 23, 2025\n\nBy Farai D Hove | ZimEye | ZANU PF is mourning the sudden passing of renowned Gweru tender-preneur Lazarus T. Chikadaya, who died early this morning in Harare.\n\nChikadaya, widely known as the founder and managing director of Drawlink Civil Engineering, was hailed by the ZANU PF controlled state media as a towering figure in the Midlands economic landscape.\n\nDetails surrounding the cause of his death are still emerging, but sources confirm he passed away peacefully in the capital. Tributes have already begun to pour in on social media, with many describing him as a visionary leader, a generous mbinga, and a passionate patriot who always wore his heartand often his scarffor Zimbabwe.\n\nCentral Radio 95.8, which broke the news on their social media platforms, described him as a trailblazer whose legacy in civil engineering will not be forgotten.\n\nChikadayas larger-than-life presence, community contributions, and unmistakable laugh will be deeply missed. Plans for his funeral and memorial are expected to be announced soon.\n\nMore details to follow as this story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ED Gweru Businessman Lazarus T. Chikadaya Dies in Harare Harare, Zimbabwe – April 23, 2025 By Farai D Hove | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/23/eds-gweru-mbinga-lazarus-chikadaya-dies/\">Continue reading<span class=\"screen-reader-text\"> \"ED’s Gweru Mbinga Lazarus Chikadaya Dies\"</span></a></p>",
            "time": "18:33",
            "date": "24 Apr 2025"
        },
        {
            "title": "Samaita Sets Momentum In Premier League",
            "url": "https://www.zimeye.net/2025/04/23/samaita-sets-momentum-in-premier-league/",
            "content": "Sports Correspondent\n\nLloyd Mutasas masterful tactics have been instrumental in MWOS impressive start to the Castle Lager Premier Soccer League season. The seasoned coachs ability to motivate his team and stick to his game plan has paid dividends, with his side conceding only once in 630 minutes of football.\n\nMWOS goalkeeper Martin Mapisa has been instrumental in the teams success, boasting five clean sheets in the campaign. The Punters have developed a reputation for grinding out results, with four of their five wins coming via 1-0 scorelines.\n\nMutasas impressive start to the season stands in stark contrast to his namesakes, Chigowe and Chitembwe. Chitembwes CAPS United has struggled, losing four games in a row, including a shocking defeat to Bikita Minerals. The Green Machines poor form has put Chitembwes future in doubt.\n\nMeanwhile, MWOS continues to thrive under Mutasas guidance, with their next match sure to be a closely watched encounter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Lloyd Mutasa’s masterful tactics have been instrumental in MWOS’ impressive start to the Castle Lager Premier Soccer League … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/23/samaita-sets-momentum-in-premier-league/\">Continue reading<span class=\"screen-reader-text\"> \"Samaita Sets Momentum In Premier League\"</span></a></p>",
            "time": "18:33",
            "date": "24 Apr 2025"
        }
    ]
}