{
    "news": [
        {
            "title": "Zulu faces challenges in SA",
            "url": "https://www.zimeye.net/2025/06/25/zulu-faces-challenges-in-sa/",
            "content": "BREAKING LEGAL DRAMA: Lawyer Needs a Lawyer  Makebi Zulu Named in Pretoria Lawsuit as Lungu Family Faces Skyrocketing Legal Bills\n\nBy A Correspondent | PRETORIA, SOUTH AFRICA  In a jaw-dropping legal twist, prominent Zambian lawyer and politician Makebi Zulu has found himself at the center of an international legal showdown  one so tangled, its now being joked that even the lawyer needs a lawyer.\n\nThe family of late former Zambian President Edgar Chagwa Lungu is reportedly paying a staggering legal bill to Zulu, who is spearheading the familys efforts to bury the late leader in South Africa  a move now facing fierce resistance from the Zambian government. But heres the catch: Zulu is not admitted to the South African Bar, and by law, cannot argue in South African courts without meeting strict legal thresholds, including registering through the Legal Practice Council  just as no South African lawyer can argue in Zambian courts without passing through the ZIA.\n\nThe matter escalated dramatically this week when Zambias Attorney General, Mr. Mulilo D. Kabesha SC, filed a public interest litigation in the Gauteng Division of the High Court of South Africa, Pretoria, seeking an urgent interdict to halt the burial.\n\nThe State vs. The Family\n\nThe lawsuit targets the Lungu family  including former First Lady Esther Nyawa Lungu, daughters Tasila and Bertha, sons Chiyesu and Dalitso, and associates Charles Phiri and Makebi Zulu  along with Two Mountains Pty, the South African funeral home currently holding Lungus remains.\n\nKabesha argues that Lungus burial is not a private family affair, but a matter of national interest, governed by Zambian law which mandates military honours and ceremonial rites for a former Head of State. Even if Lungu expressed a preference for a more discreet burial abroad  a claim Kabesha disputes  the Attorney General maintains that public interest must override personal wishes.\n\nHe cites the precedent of Kenneth Kaunda, Zambias founding president, whose own familys burial preferences were set aside by the Zambian courts in favour of interment at Embassy Park, the official burial site for the countrys top statesmen.\n\nThe interim court hearing is scheduled for Wednesday, 25th June 2025 at 08:00hrs, where the Pretoria High Court will decide whether to halt the burial pending full resolution of the dispute.\n\nA Legal Feeding Frenzy\n\nBut beyond the constitutional questions and political symbolism, a new drama is unfolding  the lawyers are cashing in.\n\nWith multiple high-profile parties lawyered up in two countries, some observers say Zambia is witnessing the beginning of a legal gold rush. We are talking about dozens of billable hours, cross-border consultations, constitutional arguments, and possible appeals, one legal insider noted. And Makebi Zulu, even if he cant argue in South Africa himself, is at the heart of it.\n\nIronically, Zulu  a sharp legal mind known for courtroom theatrics in Lusaka  might now need South African legal representation to defend himself in a Pretoria courtroom. Hes a lawyer, but now hell need a lawyer, one source quipped.\n\nAs the funeral becomes a courtroom battlefield, its not just about where Lungu will be buried  but who will profit most before he is.\n\nWho Pays the Bill?\n\nReports suggest the Lungu familys legal tab is ballooning, with some critics asking if state resources are being used indirectly. Meanwhile, public interest in the case is surging, with calls for full transparency on who is funding whom  and how much Zambians may ultimately pay for this constitutional fight over one mans final resting place.\n\nAs the Pretoria court convenes at dawn tomorrow, one thing is clear: when presidents die, lawyers live.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Makebi Zulu is a lawyer but he’ll be looking for a lawyer. Now imagine how much money lawyers will make … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/25/zulu-faces-challenges-in-sa/\">Continue reading<span class=\"screen-reader-text\"> \"Zulu faces challenges in SA\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Tagwirei Launches Parallel Zanu PF Structure",
            "url": "https://www.zimeye.net/2025/06/24/tagwirei-launches-parallel-zanu-pf-structure/",
            "content": "By A Correspondent Controversial businessman and Mnangagwas long-time ally, Kudakwashe Tagwirei, has launched another Zanu PF parallel structurethat aimsto revive the fading ED2030 re-election campaign.\n\nTagwirei, recently elected into ZANU PFs Central Committee, will be theGuest of Honourat a high-profile eventorganisedbyYoung Women 4 Economic Developmentheld at NUST Ceremonial Hall tomorrow.\n\nBranded as part of theLeadership Success Seriesunder the theme The Land Tenure: Unlocking the Potential of Young People, the gathering will see thelaunch of the Vendors 4 ED Presidential Empowerment Fund, a strategic populist move aimed at consolidating Mnangagwas grassroots support.\n\nBut critics say the event is less about youth empowerment and more about power consolidation by Mnangagwas loyalists, infamously referred to as theZviganandafaction a term now synonymous with sycophants and corrupt praise-singers enabling Mnangagwas third-term ambitions.\n\nJoining Tagwirei on the poster and backing the ED2030 project are other prominentZviganandafigures:\n\nAnalysts say this group carefully chosen for their undivided loyalty to Mnangagwa, forms the nucleus of a political machinery preparing the ground for anED2030 campaign, a project aimed at extending Mnangagwas presidency beyond the constitutional limit of two terms.\n\nNotably absent from both the program and the platform are veterans, military figures, and other long-serving ZANU PF cadres who have grown increasingly uneasy with Tagwireis rising political role and the growing cult of personality around Mnangagwa.\n\nTheZviganandatakeover has deepened the partyssuccession crisis, particularly irkingVice President Constantino Chiwenga, who many believed was next in line after his pivotal role in the 2017 coup that brought Mnangagwa to power.\n\nWhile Chiwenga remains publicly silent, insiders say heis watchingTagwireismanoeuvreswith growing unease.\n\nTagwireis recent appointment to the Central Committee, confirmed by party legal affairs secretaryPatrick Chinamasa, was facilitated through back channels.Though nominated by Masvingo province,it wasHarare Province  closely aligned with Mnangagwa thatcleared a slot for him,signallinghow the Presidents inner circle is shaping the partys future trajectory.\n\nPolitical analysts argue that theresurrection of the ED2030 slogan, once abandoned after public backlash, reflects a deliberate effort to entrench Mnangagwas hold on power  and effectively block Chiwengas presidential ambitions in 2028.\n\nMeanwhile, theVendors 4 ED,Hairdressers 4 ED,Pastors 4 ED, and evenChildren of War Veterans 4ED,all paraded at the NUST event, are increasingly seen not as empowerment vehicles but as political instruments in a broader re-election strategy disguised as youth and womenmobilisation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Controversial businessman and Mnangagwa’s long-time ally, Kudakwashe Tagwirei, has launched another Zanu PF parallel structure that aims to revive … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/tagwirei-launches-parallel-zanu-pf-structure/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Launches Parallel Zanu PF Structure\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "ZANU PF Pulls MPs for A Caucus",
            "url": "https://www.zimeye.net/2025/06/24/zanu-pf-pulls-mps-for-a-caucus/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Police Name Headlands Honda Fit Horror Crash Victims",
            "url": "https://www.zimeye.net/2025/06/24/police-name-headlands-honda-fit-horror-crash-victims/",
            "content": "By Crime and Courts Reporter The Zimbabwe Republic Police (ZRP) has released the names of five of the six victims who perished in a horrific road accident involving a Honda Fit and a heavy truck in Headlands on Sunday evening.\n\nThe fatal crash occurred around 7:30 PM on June 23, 2025, near the Yorkshire area at the 142-kilometre peg along the Harare-Mutare Highway. According to police spokesperson Commissioner Paul Nyathi, preliminary investigations suggest the Honda Fit driver was heading towards Mutare with five passengers when he attempted to overtake a tractor on a blind curve. In the process, the vehicle collided head-on with an oncoming Sino Howo truck.\n\nAll six occupants of the Honda Fit died on the spot. Their bodies were taken to Rusape General Hospital for post-mortem examinations.\n\nOn Tuesday, June 24, Commissioner Nyathi confirmed that five of the victims had been positively identified by their next of kin. They are:\n\nThe identity of the sixth victim is still being verified and will be released once relatives have been informed.\n\nCommissioner Nyathi extended the polices condolences to the bereaved families and appealed to all motorists to adhere to road safety regulations, particularly avoiding dangerous overtaking on blind spots.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter — The Zimbabwe Republic Police (ZRP) has released the names of five of the six victims … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/police-name-headlands-honda-fit-horror-crash-victims/\">Continue reading<span class=\"screen-reader-text\"> \"Police Name Headlands Honda Fit Horror Crash Victims\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Court Action To Block Lungu Burial In SA",
            "url": "https://www.zimeye.net/2025/06/24/court-action-to-block-lungu-burial-in-sa/",
            "content": "BREAKING: Attorney General Kabesha moves to stop Lungu burial in SA\n\nTHE burial of former president president Edgar Lungu scheduled for South Africa tomorrow may be hampered by legal proceedings that have been institued by Zambias Attorney General, Mulilo Kabesha in the Gauteng Division of the High Court of South Africa,\n\nThe suit which is directed against former first lady Esther Lungu, four of Lungus children along with family lawyer Makebi Zulu and the company running the morgue where his remains habe been kept is seeking an interim court order to prevent the burial of Lungu who died in South  Africa about three weeks ago\n\nThe Attorney General is requesting that no burial take place until all disputes regarding Dr. Lungus final resting place are resolvedspecifically, whether he should be interred in Zambia with full military honours, customs, and traditions, as mandated by Zambian law and in keeping with public interest.\n\nIn his application, the Attorney General contends that a state funeral for a former Zambian Head of State is a formal public event governed by strict military protocols and intended to honour individuals of national significance.\n\nKabesha further argues that, even if it were true a point he denies that the late President wished not to have a state funeral, such personal wishes must yield to the greater public interest.\n\nThe Attorney General also cites legal precedent, noting that the Zambian courts previously set aside the burial wishes of the nations founding President, Dr. Kenneth Kaunda, in favour of public interest considerations relating to interment at Embassy Park.\n\nThose named in the lawsuit include former First Lady Esther Nyawa Lungu, Bertha Lungu, Tasila Lungu, Chiyesu Lungu, Dalitso Lungu, Charles Phiri, and Makebi Zulu.\n\nThe Attorney General has additionally named Two Mountains Pty (the Morgue), where Dr. Lungus remains are currently held, as a respondent.\n\nThis action has been brought before the Pretoria High Court under Article 177(5)(c) of the Constitution of the Republic of Zambia, in the Attorney Generals capacity as government representative and protector of the Zambian public interest.\n\nHearing of the Interim Interdict Application against the burial is expected to be heard tomorrow, Wednesday 25th June 2025 at 08:00hrs in the morning.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BREAKING: Attorney General Kabesha moves to stop Lungu burial in SA THE burial of former president president Edgar Lungu scheduled … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/court-action-to-block-lungu-burial-in-sa/\">Continue reading<span class=\"screen-reader-text\"> \"Court Action To Block Lungu Burial In SA\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "BREAKING: Attorny General Kabesha moves to stop Lungu burial in SA",
            "url": "https://www.zimeye.net/2025/06/24/breaking-attorny-general-kabesha-moves-to-stop-lungu-burial-in-sa/",
            "content": "President of Zambia Hakainde Hichilema.\n\nAttorney General launches public interest litigation opposing burial of former President in South Africa.\n\nZambias Attorney General, Mr. Mulilo D. Kabesha SC, has filed a public interest lawsuit in the Gauteng Division of the High Court of South Africa, Pretoria.\n\nThe suit is directed against members of the late Presidents family and two other individuals, seeking an interim court order to prevent the burial of the late 6th Republican President, Dr. Edgar Chagwa Lungu.\n\nThe Attorney General requests that no burial take place until all disputes regarding Dr. Lungus final resting place are resolvedspecifically, whether he should be interred in Zambia with full military honours, customs, and traditions, as mandated by Zambian law and in keeping with public interest.\n\nIn his application, the Attorney General contends that a state funeral for a former Zambian Head of State is a formal public event governed by strict military protocols and intended to honour individuals of national significance.\n\nHe further argues that, even if it were true a point he denies that the late President wished not to have a state funeral, such personal wishes must yield to the greater public interest.\n\nThe Attorney General also cites legal precedent, noting that the Zambian courts previously set aside the burial wishes of the nations founding President, Dr. Kenneth Kaunda, in favour of public interest considerations relating to interment at Embassy Park.\n\nThose named in the lawsuit include former First Lady Esther Nyawa Lungu, Bertha Lungu, Tasila Lungu, Chiyesu Lungu, Dalitso Lungu, Charles Phiri, and Makebi Zulu.\n\nThe Attorney General has additionally named Two Mountains Pty (the Morgue), where Dr. Lungus remains are currently held, as a respondent.\n\nThis action has been brought before the Pretoria High Court under Article 177(5)(c) of the Constitution of the Republic of Zambia, in the Attorney Generals capacity as government representative and protector of the Zambian public interest.\n\nHearing of the Interim Interdict Application against the burial is expected to be heard tomorrow, Wednesday 25th June 2025 at 08:00hrs in the morning.- ZNBC#EdgarLungu\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "President of Zambia Hakainde Hichilema Attorney General launches public interest litigation opposing burial of former President in South Africa Zambia’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/breaking-attorny-general-kabesha-moves-to-stop-lungu-burial-in-sa/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Attorny General Kabesha moves to stop Lungu burial in SA\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Why Is Lungu Family Publicly Insulting Kenneth Kaunda Twice?",
            "url": "https://www.zimeye.net/2025/06/24/why-is-lungu-family-publicly-insulting-kenneth-kaunda-twice/",
            "content": "Why is Edgar Lungu insulting Kenneth Kaunda twice by resting aside Nelson Mandelas wife, something he personally blocked the late Presidents wishes of burying next to his wife? Is the Lungu family ready for a lawsuit from the Kaundas over this injury to feelings?\n\nWhy is Edgar Lungu insulting Kenneth Kaunda twice by resting aside Nelson Mandelas wife, something he personally blocked the late Presidents wishes of burying next to his wife? Is the Lungu family ready for a lawsuit from the Kaundas over this injury to feelings?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Why is Edgar Lungu insulting Kenneth Kaunda twice by resting aside Nelson Mandela’s wife, something he personally blocked the late … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/why-is-lungu-family-publicly-insulting-kenneth-kaunda-twice/\">Continue reading<span class=\"screen-reader-text\"> \"Why Is Lungu Family Publicly Insulting Kenneth Kaunda Twice?\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Warriors Coach Michael Nees Visits CAPS United Training Camp",
            "url": "https://www.zimeye.net/2025/06/24/warriors-coach-michael-nees-visits-caps-united-training-camp/",
            "content": "Sports Correspondent\n\nWarriors head coach Michael Nees paid a visit to CAPS United today, where he attended the teams training session and held discussions with key figures at the club.\n\nDuring the visit, Nees met with CAPS United owner Farai Jere and interacted with players and technical staff. The visit is part of the national team coachs ongoing engagement with local clubs as he assesses talent and strengthens ties within Zimbabwean football.\n\nNees presence was welcomed by the CAPS United camp, with players expressing motivation and appreciation for the national team coachs interest in their progress.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors head coach Michael Nees paid a visit to CAPS United today, where he attended the team’s training … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/warriors-coach-michael-nees-visits-caps-united-training-camp/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Coach Michael Nees Visits CAPS United Training Camp\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "ZRP Responds to Allegations of Ration Theft by Senior Officers",
            "url": "https://www.zimeye.net/2025/06/24/zrp-responds-to-allegations-of-ration-theft-by-senior-officers/",
            "content": "By A Correspondent| The Zimbabwe Republic Police (ZRP) has refuted claims that senior officers are stealing food rations meant for junior officers, following a story published in a local daily under the headlineZRP Bosses Steal Rations: Juniors.\n\nIn a strongly worded press statement, the ZRP emphasized that the Commissioner-General of Police is not aware of any such allegations and is urgently seeking to verify the claims. The police leadership has called on anyone with credible and verifiable information to report directly and confidentially to Police General Headquarters.\n\nThe Commissioner-General of Police is frantically trying to ascertain the veracity of the allegations, reads the statement signed by Commissioner Nyathi P., Chief Staff Officer for Press and Public Relations. Anyone with credible and verifiable information is free to personally come to Police General Headquarters and confidentially give the information directly.\n\nThe police also assured the public and its members that adequate safeguards are in place to prevent abuse of the rations facility. According to the statement, all police commanders have been made aware of these measures to ensure transparency and accountability.\n\nThe ZRP expressed appreciation for the governments ongoing efforts to improve the welfare of police officers and reiterated that it does not condone any misuse of the support systems provided.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Zimbabwe Republic Police (ZRP) has refuted claims that senior officers are stealing food rations meant for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/zrp-responds-to-allegations-of-ration-theft-by-senior-officers/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Responds to Allegations of Ration Theft by Senior Officers\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Air Ambulances: Govt Battles Operational Costs, Lack of Pilots",
            "url": "https://www.zimeye.net/2025/06/24/air-ambulances-govt-battles-operational-costs-lack-of-pilots/",
            "content": "Health and Child Care Minister Dr Douglas Mombeshora has revealed that Zimbabwes air ambulance service has already saved hundreds of lives, even as the government battles operational challenges, including a lack of local pilots.\n\nAddressing Parliament recently, Mombeshora said the governments air evacuation programme had airlifted hundreds of critically ill patients to major referral hospitals in Harare and Bulawayo since its launch.\n\nTo date, 345 patients have been flown to the Harare base at Sally Mugabe Central Hospital, while 66 patients were evacuated to the Bulawayo base at the United Bulawayo Hospitals, he said. These cases have included maternity complications, premature births, and other critical emergencies. Many lives have been saved.\n\nHe added that plans were underway to expand the service by positioning more air ambulances in strategic regional centres such as Victoria Falls, Mutare, and Masvingo.\n\nHowever, the health minister admitted that a shortage of pilots was hindering full operational capacity.\n\nThere are currently no pilots for the helicopters, Mombeshora said, highlighting the complexity and expertise required to operate the air ambulances.\n\nThe air ambulance assetsnamely the helicoptersare wholly owned by the government of Zimbabwe. Operating these aircraft requires highly technical expertise, including checks by IATA-certified engineering technicians before and after each flight.\n\nTo address the shortfall, the government recently signed a contract with aviation firm Game Drive to provide certified pilots and technical staff. The company will also train Zimbabwean personnel to eventually take over operations from foreign experts, primarily Russian nationals who had been manning the programme.\n\nThe objective is to ensure sustainability and build our own local capacity, said Mombeshora.\n\nThe air ambulance service was introduced as part of broader efforts to improve emergency medical care and reduce preventable deaths, especially in rural and remote parts of the country where ground ambulance services are often limited.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Health and Child Care Minister Dr Douglas Mombeshora has revealed that Zimbabwe’s air ambulance service has already saved hundreds of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/24/air-ambulances-govt-battles-operational-costs-lack-of-pilots/\">Continue reading<span class=\"screen-reader-text\"> \"Air Ambulances: Govt Battles Operational Costs, Lack of Pilots\"</span></a></p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        }
    ]
}