{
    "news": [
        {
            "title": "Tagwirei Declares Zanu PF Members Totally In Control Of Public Funds",
            "url": "https://www.zimeye.net/2025/11/16/tagwirei-declares-zanu-pf-members-totally-in-control-of-public-funds/",
            "content": "Tinashe Sambiri  Controversial Zanu PF businessman and Central Committee member Kudakwashe Tagwirei has sparked outrage after openly declaring that government tenders should primarily benefit ruling party supporters, whom he described as Zanu PF children.\n\nSpeaking at a Zanu PF Inter-District meeting held on Thursday at Gwanzura Stadium in Highfield, Tagwirei announced a series of highly politicised donations, including US$200,000 pumped into the Presidential Empowerment Revolving Fund. The money will be shared among the Main Wing, War Veterans, Youth League, and Womens League, each receiving US$50,000.\n\nIn a move critics say is designed to entrench Zanu PF patronage, Tagwirei also pledged to finance the construction of five clinics in Harares Zone 2, drill 80 boreholes, and push party members to register companies with PRAZ so they can access state tenders.\n\nTagwirei made his intentions clear, saying: Zanu PF children must benefit from national programmes; we are saying Zanu PF is for everyone.\n\nObservers say the statement exposes long-standing accusations that public resources are distributed on the basis of political loyalty rather than national interest. Community members also warned that such partisan control over tenders and basic services deepens inequality and erodes trust in public institutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Controversial Zanu PF businessman and Central Committee member Kudakwashe Tagwirei has sparked outrage after openly declaring that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/tagwirei-declares-zanu-pf-members-totally-in-control-of-public-funds/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Declares Zanu PF Members Totally In Control Of Public Funds\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Gen Chiwenga in Secret Meeting With Botswana President Duma Gideon Boko",
            "url": "https://www.zimeye.net/2025/11/16/gen-chiwenga-in-secret-meeting-with-botswana-president-duma-gideon-boko/",
            "content": "Tinashe Sambiri- Vice President General (Rtd) Dr Constantino Chiwenga on Friday held a closed-door meeting with Botswanas President Duma Gideon Boko in Gaborone, sources have confirmed.\n\nChiwenga, who arrived in Botswana ahead of the SADC World Childrens Day commemorations, quietly met President Boko for what officials described as a high-level diplomatic engagement. The meeting was not initially included in the public schedule.\n\nGovernment spokesperson Nick Mangwana confirmed Chiwengas presence in Gaborone, saying: Vice President General (Rtd) Dr. C.G.D.N. Chiwenga has arrived in Gaborone, Botswana, to attend this years SADC region World Childrens Day commemorations to be held this Saturday.\n\nHowever, he did not comment on the private talks.\n\nOne government official said the meeting was strictly confidential and intended to deepen communication between Harare and Gaborone.\n\nA senior regional diplomat added: The Vice President and President Boko held a productive discussion. It was a quiet but important engagement between the two countries.\n\nAnother source familiar with the discussions said: These types of closed-door meetings are common when leaders want to address sensitive strategic matters. The conversation was cordial, direct, and focused on regional collaboration.\n\nWhile details remain undisclosed, officials say the meeting underscores ongoing efforts to enhance political and economic ties between Zimbabwe and Botswana.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri- Vice President General (Rtd) Dr Constantino Chiwenga on Friday held a closed-door meeting with Botswana’s President Duma Gideon … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/gen-chiwenga-in-secret-meeting-with-botswana-president-duma-gideon-boko/\">Continue reading<span class=\"screen-reader-text\"> \"Gen Chiwenga in Secret Meeting With Botswana President Duma Gideon Boko\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Former Veteran ZBC Broadcaster Dies",
            "url": "https://www.zimeye.net/2025/11/16/former-veteran-zbc-broadcaster-dies/",
            "content": "By A Correspondent  Veteran broadcaster, academic, and former head of ZBC Television News in the early 1980s, Dr Temba Basopo Moyo, has died.\n\nThe news was confirmed on Sunday by former colleagues, who described him as one of the founding pillars of Zimbabwes post-independence broadcasting industry.\n\nA condolence message shared among former ZBC staff read:Good day family. We are sorry to share the sad news that our colleague, Dr Temba Basopo-Moyo, has passed on. Please keep his family in your thoughts and prayers.\n\nA chapel service will be held today at Nyaradzo Funeral Parlour on Herbert Chitepo Avenue at 16:00, followed by burial tomorrow at Glen Forest.\n\nFormerly Nemapare, Dr Basopo Moyo was a respected academic and media expert. At the time of his death, he served as Dean of Information Technology and Multimedia Communications at the Zimbabwe Open University (ZOU), where he played a central role in establishing degree programmes in Information Technology, Software Engineering, Networking, and Multimedia Communications.\n\nHis passing closes a significant chapter in Zimbabwes media history. Dr Basopo Moyo was part of thefirst generation of professional broadcasters who returned home after independence, bringing international training and expertise to transform the Rhodesia Broadcasting Corporation (RBC) into the Zimbabwe Broadcasting Corporation (ZBC). He returned from training in the United States and became part of a cohort that included:\n\nThey worked alongside distinguished pre-independence broadcasters and liberation-era media cadres such as:\n\nTogether, this diverse group formed the backbone of Zimbabwes national broadcaster in the early 1980s, professionalising news production, expanding African-language programming, and laying the foundations for Radio One, Radio Two (now Radio Zimbabwe), Radio Three (Power FM), and Radio Four (National FM).\n\nDr Basopo Moyo was known for his technical expertise, calm leadership, and commitment to using broadcasting as a nation-building tool at a time when Zimbabwe sought to rebuild after a long liberation struggle. Veteran broadcasterJohn Masuku, who profiled Dr Moyo and his contemporaries in April 2024, noted that their generation brought together skills acquired inside and outside the country during the struggle for freedom, and united around a shared belief in Zimbabwes non-reversible post-colonial development trajectory.\n\nDr Moyos legacy spans public broadcasting, media training, academic leadership, and institution-building. His contribution helped shape generations of journalists, technicians, and media scholars.\n\nZimbabwe has lost a pioneer, a mentor, and a distinguished nation-builder.\n\nMay his soul rest in peace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Veteran broadcaster, academic, and former head of ZBC Television News in the early 1980s, Dr Temba … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/former-veteran-zbc-broadcaster-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Former Veteran ZBC Broadcaster Dies\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Musician Andy Muridzo “Refuses” To Chant Zanu PF Slogan",
            "url": "https://www.zimeye.net/2025/11/16/musician-andy-muridzo-refuses-to-chant-zanu-pf-slogan/",
            "content": "Tinashe Sambiri- Musician Andy Muridzo is trending after he chose not to chant the Zanu-PF party slogan during a party event held last week in Harare.\n\nInstead of using the party-specific chant, Muridzo addressed the crowd with a message focused on Zimbabwe as a whole. He called for national unity, progress, and development, while condemning those he described as enemies of the nation. He deliberately avoided phrases that signal support for the ruling party alone.\n\nPamberi neZimbabwe, Pamberi nekuvaka Nyika Pamberi neZimbabwe, Muridzo said, flatly refusing to chant Pamberi neZanu PF.\n\nEyewitnesses say the crowd was initially surprised by his decision, but many applauded his approach. Muridzo reportedly continued performing his set, using the platform to highlight social issues and encourage young Zimbabweans to contribute positively to the country.\n\nThe singers stance has sparked widespread discussion on social media, with many praising him for prioritizing national unity over party politics.\n\nObservers note that Muridzos approach reflects a growing trend among artists who use their platforms to promote inclusivity, social development, and national pride rather than partisan loyalty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri- Musician Andy Muridzo is trending after he chose not to chant the Zanu-PF party slogan during a party … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/musician-andy-muridzo-refuses-to-chant-zanu-pf-slogan/\">Continue reading<span class=\"screen-reader-text\"> \"Musician Andy Muridzo “Refuses” To Chant Zanu PF Slogan\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "🟥 Hit-and-Run Accident Near ZITF Grounds",
            "url": "https://www.zimeye.net/2025/11/16/%f0%9f%9f%a5-hit-and-run-accident-near-zitf-grounds/",
            "content": "By A Correspondent | Bulawayo  Police have opened a full-scale investigation following a fatal hit-and-run accident that occurred on the evening of 15 November 2025 along Burnside Road, directly opposite the ZITF Grounds.\n\nAccording to a statement released by the Zimbabwe Republic Police, an unidentified man died instantly after being struck by a motorist who fled the scene without stopping.\n\nAuthorities say the victim, whose identity remains unknown, was wearing a black tracksuit and black sandals at the time of the collision. His body has since been transported to the United Bulawayo Hospital (UBH) mortuary where a post-mortem will be conducted.\n\nPolice are appealing to anyone who may have witnessed the incident, or who may have information about the vehicle involved, to come forward.\n\nAnyone with information should report at any nearest police station, the ZRP said.\n\nThe area where the crash occurredBurnside Road near the ZITF groundsis typically busy in the evenings, and investigators believe someone may have seen the speeding vehicle moments before or after impact.\n\nThis incident adds to a rising trend of hit-and-run cases recorded in Bulawayo in recent months, prompting renewed calls for improved road safety enforcement and street surveillance.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Bulawayo — Police have opened a full-scale investigation following a fatal hit-and-run accident that occurred on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/%f0%9f%9f%a5-hit-and-run-accident-near-zitf-grounds/\">Continue reading<span class=\"screen-reader-text\"> \"🟥 Hit-and-Run Accident Near ZITF Grounds\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Stacy Macheso Apologises For Plaiting Dad’s Hair",
            "url": "https://www.zimeye.net/2025/11/16/stacy-macheso-apologises-for-plaiting-dads-hair/",
            "content": "Tinashe Sambiri  Stacy Macheso, daughter of Sungura music icon Aleck Cheso Power Macheso, has issued an apology to fans after giving her father a hairstyle that sparked unexpected backlash.\n\nThe new braided look, which Macheso appeared with in public, immediately irked many fans who felt the style did not suit the legendary musician. Social media buzzed with criticism, prompting Stacy to explain what had happened.\n\nPosting on Facebook on Sunday, Stacy said she understood why some fans were upset.\n\nVery sorry guys, all fans, I am really sorry. I am the one who plaited dads hair, she wrote. What happened is I plaited his hair and he went to sleep early, then the following day he dashed to work.\n\nShe added that she did not get the chance to undo the hairstyle before he left home.\n\nI could not find time to undo the plaiting. I have heard you and I will undo the plaiting, Stacy said, laughing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Stacy Macheso, daughter of Sungura music icon Aleck “Cheso Power” Macheso, has issued an apology to fans … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/stacy-macheso-apologises-for-plaiting-dads-hair/\">Continue reading<span class=\"screen-reader-text\"> \"Stacy Macheso Apologises For Plaiting Dad’s Hair\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Police Accuse Prophet Magaya’s Team of Attempting to Bribe Officials to Derail Investigations",
            "url": "https://www.zimeye.net/2025/11/16/police-accuse-prophet-magayas-team-of-attempting-to-bribe-officials-to-derail-investigations/",
            "content": "By A Correspondent  The Zimbabwe Republic Police (ZRP) has accused individuals linked to Prophet Walter Magaya of attempting to interfere with ongoing investigations and court cases.\n\nAccording to police, a team led by Albertina Saikonda, reportedly operating from South Africa, is allegedly raising over USD 200,000 across Zimbabwe, South Africa, and Australia.\n\nThe funds are believed to be intended for bribing investigators, prosecutors, magistrates, and judges to halt or weaken the case against Magaya.\n\nIn a statement on Saturday, the police said:\n\nEfforts to defeat or obstruct the course of justice in PHD Ministries leader Walter Magayas cases are being monitored closely. The Zimbabwe Republic Police is fully aware of coordinated efforts by a team led by Albertina Saikonda to raise funds to the tune of USD 200,000 or more in Zimbabwe, South Africa, and Australia. The money is reportedly intended to approach and compromise police investigators, prosecutors, magistrates, and judges so as to derail the criminal investigations and court proceedings.\n\nThe statement added: The Zimbabwe Republic Police warns individuals, groups, and associates that they will be arrested, as the law will take effect without fear or favour. The police are monitoring the situation with keen interest to ensure law and order and the effective delivery of justice.\n\nAuthorities are urging all potential witnesses to report anyone offering cash or promises to influence the case. All potential witnesses should report anyone dangling any form of offers, cash, or promises to the police so that swift action can be taken, the statement said.\n\nThe ZRP emphasized that anyone involved in attempts to obstruct justice will face the full force of the law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Republic Police (ZRP) has accused individuals linked to Prophet Walter Magaya of attempting to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/police-accuse-prophet-magayas-team-of-attempting-to-bribe-officials-to-derail-investigations/\">Continue reading<span class=\"screen-reader-text\"> \"Police Accuse Prophet Magaya’s Team of Attempting to Bribe Officials to Derail Investigations\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Picture: Young Women 4ED Members Surround Kembo “More Hardy” At His Birthday Bash",
            "url": "https://www.zimeye.net/2025/11/16/picture-young-women-4ed-members-surround-kembo-more-hardy-at-his-birthday-bash/",
            "content": "Tinashe Sambiri  A picture of Vice President Kembo Mohadi surrounded by members of Young Women 4ED is currently circulating widely on social media.\n\nIn a statement on Sunday, Young Women 4ED said:\n\nYesterday (Saturday), Young Women for Economic Development had the honour of attending the Sports Gala and birthday celebration of Vice President Hon. Dr. K.C.D (Rtd Col) Mohadi in Beitbridge, Matabeleland South.\n\nThe event brought together communities, leaders, youths, and various stakeholders in a vibrant atmosphere celebrating unity, empowerment, and national development.\n\nAs YW4ED, we remain committed to promoting youth participation, nurturing leadership potential, and driving meaningful contributions toward Zimbabwes socio-economic progress.\n\nIt was a memorable day filled with energy, purpose, and celebrationan experience that continues to inspire our work.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – A picture of Vice President Kembo Mohadi surrounded by members of Young Women 4ED is currently circulating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/picture-young-women-4ed-members-surround-kembo-more-hardy-at-his-birthday-bash/\">Continue reading<span class=\"screen-reader-text\"> \"Picture: Young Women 4ED Members Surround Kembo “More Hardy” At His Birthday Bash\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Has Macheso Reinvented Self…or Gone Too Far?",
            "url": "https://www.zimeye.net/2025/11/16/has-macheso-reinvented-selfor-gone-too-far/",
            "content": " BREAKING NEWS: ALICK MACHESOS BOLD NEW HAIRSTYLE SETS ZIMBABWE ALIGHT  FANS DIVIDED AS CHESO POWER UNVEILS UNEXPECTED LOOK\n\nZimEye | Entertainment Desk\n\n17 November 2025\n\nZimbabwean music legend Alick Cheso Power Macheso has shocked fans nationwide after unveiling a dramatic new hairstyle during a recent live performance  a look that has instantly erupted into one of the most heated online debates of the year.\n\nThe 56-year-old sungura maestro, known for his signature clean-cut appearance and timeless stage presence, appeared on stage sporting tightly braided cornrows, a complete departure from his long-standing public image. As images and videos flooded Facebook, TikTok and WhatsApp overnight, fans reacted with everything from laughter to admiration, disbelief to outright concern.\n\nPUBLIC OUTCRY & COMEDY: MID-LIFE CRISIS?\n\nSocial media immediately exploded with memes and heated commentary.\n\nOne comment that quickly went viral read:\n\nMid life crisis kkkkk!  Tafadzwa Gana.\n\nAnother fan suggested the look reminded them of a different era:\n\nStyle iyi yandifungisa Peter Tangwena.\n\nAnd in a lighter jab, one user wrote:\n\nMabhbhii achivhayo! Hahahaha!\n\nThe comparison to 1970s hairstyles and rural aesthetics featured heavily, with fans joking that the superstar was returning to his roots.\n\nADMIRATION FROM OTHERS: AGE IS JUST A NUMBER\n\nDespite the jokes, many applauded Machesos confidence:\n\nYes baSharo its a free country. Zvakakanaka zvakadaro.\n\nAge is just a number!\n\nNice style mdhara, drip ndiyo iyoyo.\n\nSome commended the singer for breaking monotony and embracing trends usually dominated by younger artists.\n\nCONCERNED FANS ASK: IS MACHESO OKAY?\n\nA smaller but noticeable group of fans expressed concern.\n\nSome comments implied the transformation was too drastic and out of character:\n\nTiri kunyara baba.\n\nAkurwara here?\n\nVanhu ngavasiye zvinodhaka full stop.\n\nOne commenter even boldly speculated:\n\nMacheso gay.  a controversial remark that has fueled additional debates about respect and boundaries in fan discussions.\n\nCULTURAL DEBATE IGNITES\n\nMachesos hairstyle has opened broader questions about:\n\nSome users defended him fiercely:\n\nMdara hamuna wamatadzira. Kudhra maitomboiswa perm. Vanoiziva here?\n\nOthers felt he crossed a line:\n\nWhy an ambassador dress code aah?\n\nWHAT THIS MEANS FOR MACHESOS BRAND\n\nBrand analysts say Macheso may be intentionally:\n\nIn a rapidly evolving entertainment landscape where artists like Jah Prayzah, Winky D and Enzo Ishall frequently reinvent their looks, Macheso may simply be catching up with modern image strategy.\n\nBACKSTAGE SOURCES SPEAK\n\nSources close to Macheso told ZimEye:\n\nSharo ari kungoita zvema-fashion. Hakuna drama. Vari kufara nezvavari kuita. Its just a hairstyle.\n\nThe team dismissed rumours of health issues or personal distress.\n\nIS THIS AN EVOLUTION OR A MISSTEP?\n\nWhether Zimbabwe loves it or hates it, one thing is certain:\n\nAlick Macheso has successfully reignited national conversation  without releasing a single new song.\n\nFans now eagerly wait to see whether the hairstyle becomes a permanent signature or just a brief experimental phase.\n\nWHAT DO YOU THINK?\n\nHas Macheso reinvented himself or gone too far?\n\nJoin the debate below.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "🔴 BREAKING NEWS: ALICK MACHESO’S BOLD NEW HAIRSTYLE SETS ZIMBABWE ALIGHT — FANS DIVIDED AS “CHESO POWER” UNVEILS UNEXPECTED LOOK … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/has-macheso-reinvented-selfor-gone-too-far/\">Continue reading<span class=\"screen-reader-text\"> \"Has Macheso Reinvented Self…or Gone Too Far?\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        },
        {
            "title": "Minnie Baloyi-Chiwenga In Surprise Public Appearance",
            "url": "https://www.zimeye.net/2025/11/16/minnie-baloyi-chiwenga-in-surprise-public-appearance/",
            "content": "By A Correspondent Vice President Constantino Chiwengas wife, Colonel Miniyothabo Minnie Baloyi-Chiwenga, made a surprise public appearance this week when she visited controversial disabled musicianGreatman(real nameTongai Gwaze) and donated20 wheelchairsalong withUS$2,000 worth of fuelto support his nationwide wheelchair outreach programme.\n\nGreatman  celebrated for both his music and his self-driven campaign to distribute mobility devices to disabled people across Zimbabwe  had recently appealed for assistance to keep his initiative afloat. Responding to the call, Colonel Baloyi-Chiwenga travelled to the musicians home in one of Harares most under-resourced suburbs, where he has lived and worked for years despite living with a severe disability.\n\nResidents said her unannounced visit brought a rare moment of inspiration to the community. The donation of wheelchairs and fuel support is expected to significantly bolster Greatmans self-funded programme, which has already reached hundreds of beneficiaries across the country.\n\nA visibly emotional Greatman expressed deep gratitude following the visit.I never imagined the Second Lady of Zimbabwe would come to my neighbourhood, to my home,he said.She brought the wheelchairs, left money for fuel, and honoured the work we are doing.\n\nColonel Baloyi-Chiwengas engagement drew praise from locals, who described her as a compassionate and hands-on public figure willing to connect directly with communities far from political power. A serving army colonel and accomplished professional, she has in recent months become increasingly visible in advocacy work around disability inclusion and grassroots welfare support.\n\nShe emphasised that her contribution was meant to strengthen an initiative built on resilience, generosity, and service. Her gesture underscored the principle that disability does not erase human potential, and that leadership is demonstrated not only through policy but also through practical acts of care.\n\nFor Greatman, the donation represents far more than equipment  it is a reinforcement of dignity and opportunity for people who have long struggled without assistance.We move with dignity now,he said.Someone from the highest levels of leadership came here and told us we matter.\n\nAcross Zimbabwe, the intervention has been widely received as part of a growing appreciation for practical, community-centred support for vulnerable groups. Colonel Baloyi-Chiwengas visit, many say, is a reminder that meaningful public service is rooted in compassion, presence, and direct engagement with the people.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Vice President Constantino Chiwenga’s wife, Colonel Miniyothabo “Minnie” Baloyi-Chiwenga, made a surprise public appearance this week when … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/16/minnie-baloyi-chiwenga-in-surprise-public-appearance/\">Continue reading<span class=\"screen-reader-text\"> \"Minnie Baloyi-Chiwenga In Surprise Public Appearance\"</span></a></p>",
            "time": "06:40",
            "date": "17 Nov 2025"
        }
    ]
}