{
    "news": [
        {
            "title": "Super Eagles Eye Maximum Points Against Warriors",
            "url": "https://www.zimeye.net/2025/03/24/super-eagles-eye-maximum-points-against-warriors/",
            "content": "By A Correspondent\n\nThe Super Eagles of Nigeria are gearing up to take on the Warriors of Zimbabwe in a crucial Group C clash of the 2026 FIFA World Cup qualifiers on Tuesday. As the team prepares to face their opponents, coach Eric Chelle is expected to stick with his tried-and-tested 4-4-2 diamond shape, with a few tweaks in personnel.\n\nIn goal, Stanley Nwabali is expected to retain his place, having had a comfortable outing against Rwanda in the previous match. The backline is also expected to remain largely unchanged, with William Troost-Ekong, Calvin Bassey, Ola Aina, and Bruno Onyemaechi forming the defensive quartet. However, Bright Osayi-Samuels fitness will be monitored, and if he fails to recover in time, Onyemaechi will slot in, with Aina shifting to his natural right-back role.\n\nIn midfield, Chelle may opt for a tactical switch, given the struggles of some players to interpret their roles against Rwanda. Alex Iwobi and Wilfred Ndidi are expected to form the central midfield pairing, with Raphael Onyedika potentially coming in for Samuel Chukwueze. Onyedikas introduction would allow Ndidi to play in a more advanced role, while Iwobi continues to provide creativity from deep. Ademola Lookman is expected to play behind the two strikers, providing pace and width to the attack.\n\nUp front, Moses Simon and Victor Osimhen are expected to lead the line, providing a potent attacking threat to the Zimbabwean defense. With the Super Eagles targeting maximum points against the Warriors, Chelles tactical decisions will be crucial in determining the outcome of the match.\n\nAs the Super Eagles take to the pitch on Tuesday, they will be looking to build on their impressive performance against Rwanda and take a significant step towards qualifying for the 2026 FIFA World Cup.\n\nWith the Warriors seeking to cause an upset, the stage is set for an electrifying clash between two teams hungry for victory.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Super Eagles of Nigeria are gearing up to take on the Warriors of Zimbabwe in a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/super-eagles-eye-maximum-points-against-warriors/\">Continue reading<span class=\"screen-reader-text\"> \"Super Eagles Eye Maximum Points Against Warriors\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Rinomhota Backs Warriors to Stun Nigeria in Uyo",
            "url": "https://www.zimeye.net/2025/03/24/rinomhota-backs-warriors-to-stun-nigeria-in-uyo/",
            "content": "Sports Correspondent\n\nZimbabwe midfielder Andy Rinomhota is confident that the Warriors can claim a historic away win against Nigeria in their 2026 FIFA World Cup Qualifiers Group C encounter on Tuesday.\n\nThe two teams will face off at the Godswill Akpabio International Stadium in Uyo, with kick-off scheduled for 6 pm CAT.\n\nThe Warriors will be seeking to build on their impressive performance in the first leg, which ended in a 1-1 draw in 2023.\n\nRinomhota, who made his Warriors debut in the return fixture, believes that the team has what it takes to go one better and secure a win in Uyo.\n\nWere optimistic, Rinomhota said ahead of Tuesdays encounter. We got a result against Nigeria last time, even though it was technically a home game in Rwanda.\n\nThat was my first game  it was a big test, and the team did well to draw. This time, we want to go a step further. We respect Nigeria, but not too much. Well try to impose ourselves.\n\nRinomhotas sentiments reflect the teams determination to push for a positive result and keep their World Cup qualification hopes alive.\n\nWith the Warriors seeking to make a statement in Uyo, Tuesdays encounter promises to be an electrifying clash between two teams hungry for victory.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe midfielder Andy Rinomhota is confident that the Warriors can claim a historic away win against Nigeria in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/rinomhota-backs-warriors-to-stun-nigeria-in-uyo/\">Continue reading<span class=\"screen-reader-text\"> \"Rinomhota Backs Warriors to Stun Nigeria in Uyo\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Always Walk Facing Oncoming Vehicles",
            "url": "https://www.zimeye.net/2025/03/24/always-walk-facing-oncoming-vehicles/",
            "content": "When walking along the road, it is crucial to prioritize your safety by always walking facing oncoming vehicles. By doing so, you enhance your ability to see approaching traffic and stay aware of your surroundings, relying on both your sight and hearing to assess potential dangers. This simple precaution allows you to step aside or into a safe area, such as a ditch, if a vehicle unexpectedly loses control.\n\nWalking with your back to traffic, on the other hand, puts you in a vulnerable position. In such a scenario, you would have to rely only on your ears to detect a vehicle approaching from behind, which can be risky. A driver may unintentionally hit you without you being aware of their presence, especially if they are speeding or driving too close to the edge of the road.\n\nAdditionally, to avoid the dangers of distracted walking, always keep your focus on the road ahead rather than on your mobile phone. While listening to music or podcasts can make your walk more enjoyable, it can be risky if it prevents you from hearing nearby vehicles. A simple solution is to keep one earphone out, ensuring you can still listen for approaching cars while enjoying your walk.\n\nWhile walking facing oncoming traffic is generally the safest option, its important to note that some areas, such as hills or sharp curves, may make this practice dangerous. In such areas, visibility is limited, and both you and oncoming vehicles may not see each other until its too late. In these situations, walking on the opposite side of the road might be the safer choice.\n\nBy staying alert, walking facing traffic, and avoiding distractions, you can significantly reduce the risk of accidents and ensure a safer walking experience.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When walking along the road, it is crucial to prioritize your safety by always walking facing oncoming vehicles. By doing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/always-walk-facing-oncoming-vehicles/\">Continue reading<span class=\"screen-reader-text\"> \"Always Walk Facing Oncoming Vehicles\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Woman Kills Husband After Catching Him with Ex-Wife",
            "url": "https://www.zimeye.net/2025/03/24/woman-kills-husband-after-catching-him-with-ex-wife/",
            "content": "By A Correspondent\n\nA shocking and disturbing incident has shaken the small town of Mwenezi in Zimbabwe, leaving residents reeling in horror.\n\nDaisy Makanaka Moyo, a 25-year-old woman from Headman Mabhena, Chief Negari, has been charged with the murder of her husband, Talent Golden Masuku, 40, after catching him with his ex-wife.\n\nAccording to court records, Masuku had separated from his ex-wife, Shingirai Mativenga, 44, for a year but had apparently rekindled their romance. The couple, who have three children together, met at Negari Business Centre in Mwenezi on July 9, 2024, and spent the day together. They later decided to spend the night at the homestead of a local resident, Obey Matutu.\n\nTragedy struck the following morning when Moyo arrived at the scene, catching her husband and his ex-wife together. In a fit of rage, Moyo allegedly attacked Mativenga with a log, striking her on the head, and also bit her below the chin. Masuku, attempting to intervene, was fatally stabbed by Moyo.\n\nMoyo appeared before Justice Sunsley Zisengwe at the High Court in Masvingo two weeks ago, charged with Masukus murder. The case has sent shockwaves through the community, highlighting the destructive nature of jealousy and the devastating consequences of unchecked emotions.\n\nAs the trial continues, the people of Mwenezi are left to grapple with the aftermath of this tragic event, serving as a stark reminder of the importance of seeking help and support in times of emotional turmoil.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking and disturbing incident has shaken the small town of Mwenezi in Zimbabwe, leaving residents reeling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/woman-kills-husband-after-catching-him-with-ex-wife/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Kills Husband After Catching Him with Ex-Wife\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Mnangagwa On Camera Confidently Awarding Secretary of Transport Ministry That’s Destroyed Nation’s Road Networks",
            "url": "https://www.zimeye.net/2025/03/24/mnangagwa-on-camera-confidently-awarding-secretary-of-transport-ministry-thats-destroyed-nations-road-networks/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Harare Businessman Faces Rape Allegations",
            "url": "https://www.zimeye.net/2025/03/24/harare-businessman-faces-rape-allegations/",
            "content": "By A Correspondent| A 29-year-old businessman from Harare, Innocent Mangwendeza, is set to appear in court on March 26 after being accused of sexually assaulting a former employee while allegedly holding her hostage for months.\n\nMangwendeza, who operates Tiwies Hardware, was reported to the police by the alleged victim, leading to the case being handled by the Family Support Unit at Chinamhora Police Station in Domboshava under reference RRB6286558.\n\nAccording to the complainant, she was employed as a cashier at Mangwendezas business. Since she was new to Harare and had been recommended for the job by the accuseds older brother, she initially stayed at Mangwendezas residence.\n\nThe alleged victim stated that two days after her arrival from Victoria Falls, Mangwendeza traveled to the United Kingdom for a 10-day visit. Upon his return, she claims the abuse began, alleging that he would force himself on her at night, often after returning home intoxicated.\n\nFeeling isolated and with no one to turn to, she endured the ordeal in silence until January this year when she confided in the person who had secured her the job. A confrontation ensued between that person and Mangwendeza, after which a police report was filed.\n\nThe case was initially reviewed by prosecutors in Domboshava before being referred to Harare. On March 12, during a hearing at the Rotten Row Magistrates Court, it was determined that the matter would proceed to a full trial on March 26.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A 29-year-old businessman from Harare, Innocent Mangwendeza, is set to appear in court on March 26 after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/harare-businessman-faces-rape-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Businessman Faces Rape Allegations\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Mnangagwa Minister Hides Behind Finger In Parliament, Claims Shortage Of Power Is Due To Vandalism Of Transformers",
            "url": "https://www.zimeye.net/2025/03/24/mnangagwa-minister-hides-behind-finger-in-parliament-claims-shortage-of-power-is-due-to-vandalism-of-transformers/",
            "content": "By A Correspondent\n\nThe government has attributed ongoing power shortages in Zimbabwe to the theft and vandalism of electrical transformers, with Minister of Energy, July Moyo, revealing that around 6,000 transformers have been stolen across the country.\n\nResponding to questions in the National Assembly last week, Moyo stated that the current electricity shortages were primarily caused by these criminal activities.\n\nThe shortage of electricity is a result of vandalism and theft of ZESA transformers, Moyo claimed.\n\nThe statement comes amidst growing frustration from the public and businesses over frequent power outages, which have been affecting daily life and economic activities across the nation.\n\nWhile Moyos explanation offers one potential reason for the ongoing crisis, many critics argue that the government is avoiding deeper, more systemic issues within the power sector.\n\nThe theft of transformers has been a long-standing issue in Zimbabwe, with criminal gangs targeting these valuable pieces of infrastructure for resale. However, the high number of stolen transformerstotaling 6,000has raised concerns about the effectiveness of security measures and the governments ability to prevent such acts of vandalism.\n\nIn his remarks, Moyo did not elaborate on specific measures being taken to address the ongoing issue of transformer theft or to resolve the wider power crisis. As Zimbabweans continue to struggle with unreliable power supply, many are questioning whether the governments response is adequate or merely an excuse to deflect from more pressing issues in the energy sector.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The government has attributed ongoing power shortages in Zimbabwe to the theft and vandalism of electrical transformers, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/mnangagwa-minister-hides-behind-finger-in-parliament-claims-shortage-of-power-is-due-to-vandalism-of-transformers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister Hides Behind Finger In Parliament, Claims Shortage Of Power Is Due To Vandalism Of Transformers\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Wutawunashe Equates Mnangagwa To Christ, Says March 31 Protests Demonic",
            "url": "https://www.zimeye.net/2025/03/24/wutawunashe-equates-mnangagwa-to-christ-says-march-31-protests-demonic/",
            "content": "Tinashe Sambiri\n\nHarare, Zimbabwe  March 23, 2025\n\nIn a Sunday address, Apostle Andrew Wutawunashe, the leader of the Family of God Church, strongly urged Zimbabweans to place their trust in their nation and its leadership.\n\nHe emphasized the significance of unity and called for unwavering support for President Emmerson Mnangagwa, whom he affirmed was divinely chosen to lead the country.\n\nApostle Wutawunashe called on his congregation to exhibit steadfast faith in Zimbabwe and stand in solidarity with President Mnangagwa for the nations prosperity. He led the assembly in affirmations, stating, We believe in the divine destiny of our nation, and in the fulfillment of Gods promises for Zimbabwe.\n\nReflecting on the nations history, Wutawunashe recounted the sacrifices made by figures such as President Mnangagwa during Zimbabwes liberation struggle.\n\nHe shared the story of Mnangagwas near-death experience at a young age, emphasizing his commitment to the nations freedom and ongoing development. Mnangagwas life has been dedicated to the freedom and prosperity of Zimbabwe, said Wutawunashe, underscoring the Presidents involvement in Vision 2030, a plan aimed at revitalizing the countrys economy and infrastructure.\n\nIn addressing the upcoming March 31 protests, Wutawunashe expressed strong condemnation, likening the intentions behind the demonstrations to the destructive forces that led to the crucifixion of those who brought good to past generations.\n\nHe questioned the reasoning behind targeting President Mnangagwa, emphasizing that he is a leader who has sacrificed his life for the countrys liberation and progress. He warned against actions that could destabilize the nation, adding, We must not allow disruptive forces to lead us into chaos.\n\nThe Apostle urged citizens to seek wisdom and unity, emphasizing the importance of supporting the current leadership in fulfilling its developmental agenda. We must pray for wisdom, for peace, and for unity. Our nations future is tied to these values, he stated. He further called for prayers to protect Zimbabwe from divisive forces and to maintain peace on the streets of the nation.\n\nDrawing inspiration from Psalm 144, Wutawunashe led prayers asking for divine intervention to preserve peace and prosperity in Zimbabwe. He invoked blessings upon the nations leaders, seeking divine guidance and protection from forces that threaten the countrys unity. True progress and happiness come from aligning with Gods will and supporting the leaders He has ordained, Wutawunashe declared.\n\nApostle Wutawunashes address serves as a call for national unity, urging Zimbabweans to support President Mnangagwas leadership and reject actions that may lead to unrest. He emphasizes that faith, prayer, and collective effort are the keys to achieving the countrys divine promises and long-lasting prosperity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Harare, Zimbabwe – March 23, 2025 In a Sunday address, Apostle Andrew Wutawunashe, the leader of the Family … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/wutawunashe-equates-mnangagwa-to-christ-says-march-31-protests-demonic/\">Continue reading<span class=\"screen-reader-text\"> \"Wutawunashe Equates Mnangagwa To Christ, Says March 31 Protests Demonic\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Geza Endorses Teachers’ Protests",
            "url": "https://www.zimeye.net/2025/03/24/geza-endorses-teachers-protests/",
            "content": "Tinashe Sambiri\n\nWar veteran Blessed Geza has expressed his full support for the upcoming teachers protests, criticizing the administration of President Emmerson Mnangagwa for its failure to revive the countrys economy.\n\nTeachers, who have long been voicing their dissatisfaction over low wages and poor working conditions, are planning to stage protests on March 28, 2025, to highlight the Zanu PF regimes inability to address their grievances.\n\nIn a statement released over the weekend, Geza made his position clear, addressing rumors that he was not supportive of the protests. It has come to my attention that there are some people claiming that I dont support the proposed protests by teachers on 28 March 2025. I firmly support them and any other protest planned in the build-up to March 31. Together we stand, Geza said.\n\nGeza, who has been an outspoken critic of the governments handling of the economy, emphasized the importance of solidarity in the face of economic hardships. His endorsement of the protests comes at a time when various sectors, including teachers and other public workers, have grown increasingly frustrated with the governments inability to improve their living conditions or address the economic challenges facing the nation.\n\nAs teachers prepare to take to the streets, Gezas support adds weight to their cause, which calls for better wages, improved working conditions, and a stronger commitment from the government to revitalize the economy.\n\nWith tensions rising, the planned protests are expected to draw significant attention and may play a pivotal role in shaping the national discourse leading up to the March 31 demonstrations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri War veteran Blessed Geza has expressed his full support for the upcoming teachers’ protests, criticizing the administration of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/geza-endorses-teachers-protests/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Endorses Teachers’ Protests\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        },
        {
            "title": "Higher Education Council Cracks Down on Bogus Institutions",
            "url": "https://www.zimeye.net/2025/03/24/higher-education-council-cracks-down-on-bogus-institutions/",
            "content": "By A Correspondent\n\nThe Zimbabwe Council for Higher Education (ZIMCHE) has condemned institutions offering fake certificates.\n\nIn a statement on Sunday, ZIMCHE said:\n\nPRESS STATEMENTZIMCHE Press Statement: Conferment and Use of Fake/Fraudulent DegreesFor Immediate ReleaseHarare, Zimbabwe. 23 March 2025  The Zimbabwe Council for Higher Education (ZIMCHE) has expressed serious concern over the rise of unregistered institutions operating unlawfully and awarding fraudulent undergraduate and postgraduate qualifications, including both allegedly earned and honorary Ph.Ds.\n\nThese activities undermine the integrity and quality of Zimbabwes higher education system and present significant risks to the public. ZIMCHE has identified several unregistered institutions engaged in these illegal practices and has issued closure orders to halt their operations. Unfortunately, some institutions continue to defy the law, enrolling students and issuing fraudulent degrees.\n\nOf particular concern is the misuse of these fraudulent qualifications, as well as the use of false titles such as Professor or Doctor by officials from these unregistered institutions and the recipients of these degrees. This includes unsuspecting members of the public who are deceived into paying for these false qualifications, as well as individuals who knowingly participate in this academic fraud.\n\nAs the regulatory body mandated by The ZIMCHE Act [Chapter 25:27], ZIMCHE is committed to preserving the standards, quality, and credibility of Zimbabwes higher education system. Unregistered institutions are hereby unequivocally warned to cease their operations immediately, withdraw all fraudulent qualifications, and stop issuing or conferring any degrees, including purportedly earned and honorary Ph.Ds. Recipients of these fraudulent qualifications and false titles are strongly urged to stop using them, as they could face legal consequences, including civil and criminal prosecution.\n\nTo protect stakeholders, including students, employers, and the public, ZIMCHE has launched investigations into these unlawful activities. Appropriate legal action will be taken against both unregistered institutions and individuals found complicit in academic fraud.\n\nMembers of the public are encouraged to verify the accreditation status of any institution with ZIMCHE before enrolling in any programs. Employers should also authenticate the qualifications of prospective employees with ZIMCHE. Public vigilance is essential, as some unregistered institutions frequently change locations to avoid detection. Additionally, some of these institutions are not owned by Zimbabweans, while others falsely claim affiliations with dubious international universities that lack proper accreditation in their home countries.\n\nZIMCHE remains steadfast in its commitment to maintaining the integrity and quality of Zimbabwes higher education system. The organization is intensifying efforts to ensure that only accredited institutions are allowed to operate within Zimbabwe, safeguarding the high standards that have been built over decades.\n\nFor further inquiries, please contact ZIMCHE through the following channels:Tel: +2638677009649Email:[emailprotected]Website: www.zimche.ac.zw\n\nZIMCHE remains dedicated to protecting the integrity and credibility of Zimbabwes higher education system.\n\nZIMBABWE COUNCIL FOR HIGHER EDUCATIONwww.zimche.ac.zwQuality Assurance in Higher EducationEmail:[emailprotected]319 Harben Chiron Avenue, Murwo, BEL\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Council for Higher Education (ZIMCHE) has condemned institutions offering fake certificates. In a statement on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/24/higher-education-council-cracks-down-on-bogus-institutions/\">Continue reading<span class=\"screen-reader-text\"> \"Higher Education Council Cracks Down on Bogus Institutions\"</span></a></p>",
            "time": "06:41",
            "date": "25 Mar 2025"
        }
    ]
}