{
    "news": [
        {
            "title": "Double Burial For Horror Crash War Vets",
            "url": "https://www.zimeye.net/2025/08/01/double-burial-for-horror-crash-war-vets/",
            "content": "By A Correspondent  War veterans Abias Pelile and Cde Solomon Nhondova were laid to rest this week at the Gweru Provincial Heroes Acre following a tragic road traffic accident on July 25.\n\nTheir untimely deaths came just hours after the passing of another liberation stalwart, Cde Mundenguma, who was buried at Destiny Memorial Park last weekend.\n\nThe sombre burial ceremony for Pelile and Nhondova was attended by Midlands Provincial Affairs Minister Owen Ncube and Gweru City Mayor Councillor Martin Chivhoko, among other dignitaries.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — War veterans Abias Pelile and Cde Solomon Nhondova were laid to rest this week at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/double-burial-for-horror-crash-war-vets/\">Continue reading<span class=\"screen-reader-text\"> \"Double Burial For Horror Crash War Vets\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mthuli Struggles To Defend Sinking ZiG",
            "url": "https://www.zimeye.net/2025/08/01/mthuli-struggles-to-defend-sinking-zig/",
            "content": "By Business Reporter  Desperate to project optimism in the face of economic turmoil, Finance Minister Professor Mthuli Ncube on Thursday presented the 2025 Mid-Term Budget Review Statement at the new Parliament Building in Mt Hampden. He reviewed the ZiG$270 billion National Budget despite growing public frustration with the worsening cost of living, a rapidly deteriorating currency, and a government seemingly out of touch with reality.\n\nProfessor Ncube claimed Zimbabwe remained in growth mode, citing what he called positive developments during the first half of the year  despite overwhelming evidence pointing to a collapsing economy, with the recently introduced Zimbabwe Gold (ZiG) currency already failing to restore market confidence or curb inflation.\n\nGiven the positive economic developments during the period January to June, we are confident that the projected economic growth of six percent in the 2025 National Budget is achievable, Ncube said. All sectors are expected to record positive growth in 2025, mainly on account of a favourable agriculture season, improved electricity generation, and a stable exchange and inflation rate  notwithstanding declining international mineral commodity prices and a subdued global economic climate.\n\nHowever, Ncubes upbeat tone contrasts sharply with on-the-ground realities: runaway prices in ZiG, shortages of basic goods, and mounting pressure on businesses and households amid an unconvincing monetary reform process. The ZiG, launched in April 2024 to replace the depreciated Zimbabwe dollar, has struggled to gain traction as both retailers and the public continue to rely heavily on the US dollar.\n\nZimbabwes economic problems are rooted in long-term structural weaknesses, including a bloated public sector, weak industrial base, heavy reliance on mining exports, and widespread corruption. According to economists, the frequent currency changes and arbitrary policy shifts have deepened public distrust in formal financial systems.\n\nThe minister claimed that government reforms would enhance the ease of doing business and create a competitive economic environment. Government has, with immediate effect, begun reviewing various fees and charges. In addition, the number of bureaucratic steps and compliance requirements will be drastically reduced. On the fiscal front, the Government will continue to review the existing tax system with a view to reducing observed distortions and granting a supportive regime for business growth and competitiveness, he said.\n\nHe added that policy consistency would be key to maintaining stability. Mr Speaker Sir, the country has enjoyed economic stability during the first half of the year, and I want to assure Honourable Members that both fiscal and monetary authorities are going to stay in that mode. We cannot afford any policy slippages.\n\nYet critics argue that policy slippages have already become the norm. From introducing the ZiG without broad consultation to forcing citizens to pay some taxes in a barely usable local currency, the government has continued to implement inconsistent and often contradictory fiscal and monetary measures.\n\nKey highlights from the 2025 Mid-Term Budget Review include:\n\nZimbabwes economy has long been weighed down by political instability, disputed elections, and tight state control over key economic levers. While the official narrative talks of growth and reform, ordinary Zimbabweans continue to grapple with rising unemployment, deteriorating public services, and a shrinking formal economy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter — Desperate to project optimism in the face of economic turmoil, Finance Minister Professor Mthuli Ncube on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/mthuli-struggles-to-defend-sinking-zig/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Struggles To Defend Sinking ZiG \"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Zim National Grabs Top SA Water Job, Faces Xenophobia",
            "url": "https://www.zimeye.net/2025/08/01/zim-national-grabs-top-sa-water-job-faces-xenophobia/",
            "content": "By A Correspondent  Polokwane A highly qualified Zimbabwean engineer, Kennedy Chihota, has come under fire from some South African political parties and residents following his appointment as Director of Water and Sanitation in the Polokwane Municipality.\n\nDespite the backlash, Mayor John Mpe has defended the decision, stating it was based on professional merit and the urgent need to fix the citys water infrastructure challenges  not on nationality or politics.\n\nChihota is a professionally registered engineer with the Engineering Council of South Africa (ECSA) and boasts an impressive academic and professional background. He holds a Bachelors Degree in Civil Engineering and four Masters Degrees in:\n\nChihota also brings decades of experience in both academic and practical engineering roles. He previously served as a senior lecturer at the University of Limpopo and held key municipal positions including:\n\nSpeaking at Peter Mokaba Stadium, Mayor Mpe underscored that Chihotas appointment is part of a broader strategy to address persistent water backlogs, improve infrastructure, and ensure service delivery across Polokwane.\n\nWere not experimenting. Were hiring based on proven experience and capability, said Mpe. Mr. Chihotas record speaks for itself. Our focus is delivery, not where someone was born.\n\nHowever, political groups such as the Economic Freedom Fighters (EFF) and ActionSA have criticised the move, arguing that such top jobs should be reserved for South Africans, especially in the face of poor service delivery in areas like Seshego and Mankweng.\n\nThe appointment has also exposed growing tensions within the municipality. Reports suggest disagreements between the City Manager and some councillors over hiring processes, staff promotions, and alleged irregularities in financial management.\n\nWhile the backlash appears to be fuelled in part by growing anti-immigrant sentiment, the municipality insists that it cannot afford to compromise on service delivery by sidelining skilled professionals on the basis of nationality.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Polokwane — A highly qualified Zimbabwean engineer, Kennedy Chihota, has come under fire from some South African … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/zim-national-grabs-top-sa-water-job-faces-xenophobia/\">Continue reading<span class=\"screen-reader-text\"> \"Zim National Grabs Top SA Water Job, Faces Xenophobia\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "White South Africans Have Migrated To Zimbabwe Saying It’s Safer, Way Better",
            "url": "https://www.zimeye.net/2025/08/01/white-south-africans-have-migrated-to-zimbabwe-saying-its-safer-way-better/",
            "content": "VIRAL PODCAST CLIP IGNITES DEBATE OVER ZIMBABWES BUSINESS REALITY VS PERCEPTION\n\nBy Dorrothy Moyo | July 29, 2025.\n\nZimbabwes Global Image vs On-the-Ground Reality (whose podcast is this? Tag the producers name below)Speaker 1:I just feel like Zimbabwe has become a sort of running gag now when people talk about failed states or basket cases. The name comes up all over the world. I waspic.twitter.com/Qpo4T0VCTt\n\nA short clip from a recent podcast has gone viral, spotlighting a provocative conversation about Zimbabwe and its reputation. Speakers argue that while Zimbabwe is frequently portrayed alongside Venezuela as a failed state or basket case, the lived experienceespecially for some white South African migrants (whove relocated to Zim)paints a more nuanced picture.\n\n Podcast Claims in Focus\n\nThe podcast dialogue criticises the global habit of naming Zimbabwe and Venezuela when discussing failed states, contending that this perception overlooks pockets of stability in Zimbabwe where safety, infrastructure, and economic activity persist.\n\nThe speakers board flights to Harare regularly, noting their fellow white Afrikaner passengers commonly work in mining and infrastructure, enjoying what one describes as a quality of life thats second to none.\n\n What Published Opinion Shows\n\nZimbabwe as a Racial Fantasy or a Real Place\n\nScholar Percy Zvomuya criticises external narratives that treat Zimbabwe as a blank canvas for projections from outsidersespecially South Africansrather than acknowledging its own diverse realities. He writes:\n\nZimbabwe is its own self, its own country, not some echo chamber from which people hope to catch reverberated strains of their own discourses .\n\nThis resonates with the podcast critique: Zimbabwes image is too often dominated by external tropes rather than grounded in complex internal realities.\n\nWhite Zimbabwean Experience and Privilege\n\nReports on the white community in Zimbabwe highlight how colonial legacies shaped privilege. As historian Chris McGreal observed in The Observer (2008), before Mugabes land seizures, white Zimbabweans kept their houses and their pools and their servants and benefitted from booming farm revenues . That pattern left deep social and economic stratification long after independence.\n\nDespite harsh land reforms, white professionals and business-oriented migrantsincluding South Africanshave often remained influential in key sectors such as mining, agriculture, and infrastructure, especially via contractual leases or investments. Some sources note troubled conditions for poorer whites after farm seizures, in contrast to an elite minority maintaining comfort .\n\n Context Matters: Limitations of the Narrative\n\nWhile the podcast depicts genuine aspectssuch as foreign investment and relative safety in certain enclavesit skips over broader systemic issues:\n\n Analysis: Where Perception Meets Reality\n\nThe viral clip touches on genuine phenomenasome white South African migrants have found niches in Zimbabwes remaining economic sectors, and there are enclaves of relative safety in major cities. But this doesnt reflect the national picture. Published commentary and research underscore a history of racial inequity, economically motivated land redistribution, and a pattern of privileged continuity for a tiny minority.\n\n Broader Takeaways\n\nThis discussion reminds readers that context and diversity of experiences matter. Zimbabwes image as a failed state may resonate globally, but realities on the ground reveal complexityand caution against simplistic narratives.\n\nPodcast Summary: Zimbabwes Global Image vs On-the-Ground Reality\n\nSpeaker 1:\n\nI just feel like Zimbabwe has become a sort of running gag now when people talk about failed states or basket cases. The name comes up all over the world. I was listening to a podcast the other day, and when the conversation turned to collapsed economies, it wasnt Afghanistan or Libya that dominated the discussionit was Venezuela and Zimbabwe. These are the two countries that always get mentioned.\n\nSpeaker 2:\n\nTrue, but ironically, there are many things in Zimbabwe that actually work better than in some so-called developed countries.\n\nSpeaker 1:\n\nWell, you go there often. And I go there often too, as you know. For example, I feel perfectly safe walking the streets of HarareI dont worry about getting mugged. Thats something I cant say for some cities out here.\n\nSpeaker 2:\n\nAnd there are parts of Zimbabwe where people are living in absolute comfortenjoying fabulous lifestyles. Im specifically talking about white South Africans who have moved to Zimbabwe and now enjoy a quality of life thats arguably second to none.\n\nSpeaker 1:\n\nYes, and speaking of development, we have a friend in asset management who also travels to Zimbabwe a lot. She talks about the infrastructure projects happening there and the kinds of investments Zimbabwe is still managing to attractespecially in the energy and mining sectors.\n\nSpeaker 2:\n\nExactly. And just to add to thatevery time I fly to Zimbabwe, the flights are always packed with white Afrikaners, most of whom are involved in mining and infrastructure projects. That tells you something.\n\nCore Themes:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIRAL PODCAST CLIP IGNITES DEBATE OVER ZIMBABWE’S BUSINESS REALITY VS PERCEPTION By Dorrothy Moyo | July 29, 2025. A short … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/white-south-africans-have-migrated-to-zimbabwe-saying-its-safer-way-better/\">Continue reading<span class=\"screen-reader-text\"> \"White South Africans Have Migrated To Zimbabwe Saying It’s Safer, Way Better\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Police Name Bindura Manjuzu Drowning Victims",
            "url": "https://www.zimeye.net/2025/08/01/police-name-bindura-manjuzu-drowning-victims/",
            "content": "By Crime and Courts Reporter  Police have released the names of two women who drowned during a suspected Manjuzu traditional ceremony at Nyaure River in Manhenga Village, Bindura.\n\nThe victims were identified as Ellen Mlauzi (49) and Ethel Nyabundu (22). They had attended the ceremony in the company of Pauline Kadzviti (48), Tabeth Sagwidza (39), Emma Sagwidza (35), and a man identified as Jacob Peter.\n\nThe group is reported to have been conducting traditional rites when tragedy struck.\n\nManjuzu, commonly associated with mermaid spirits in Zimbabwean spiritual belief systems, are thought by followers to bring wealth, beauty, and prosperity. The practice has gained popularity, particularly among women seeking better fortunes in life. However, concerns persist over the spiritual and physical dangers involved in these rituals, especially those performed near water bodies.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident.\n\nThe Zimbabwe Republic Police confirms the drowning of two women at Nyaure River, Manhenga Village, Bindura, he said. The deceased were reportedly conducting traditional rituals with two other women and one man.\n\nAccording to police reports, one of the women began displaying signs of spiritual possession, moved into deep water, and drowned. The man attempted to rescue her but failed. In the ensuing panic, another woman also drowned. One body was retrieved shortly after the incident, while the other was recovered the following day by the police Sub-Aqua Unit.\n\nComm Nyathi urged the public to exercise extreme caution near water bodies.\n\nWe continue to urge members of the public to avoid engaging in life-threatening activities in rivers and dams. This tragic loss of life could have been prevented, he said.\n\nThe practice of Manjuzu initiation continues to spark debate. While some adherents claim to have experienced prosperity, others warn of spiritual consequences. Several women involved in such practices say they were chosen by the spirits and did not actively seek them out.\n\nOne self-identified Manjuzu follower from Chitungwiza claimed the spirits had brought nothing but fortune to her life:Since realising I have a water spirit, Ive never faced any misfortune. Everything is going well for me, she said, dismissing claims that the practice is harmful or linked to witchcraft. Its not evil. Christians are just misinformed.\n\nAnother woman, speaking anonymously, said:These things came to meI didnt look for them. I was chosen. I see visions, and I live with this gift I didnt ask for.\n\nHowever, religious leaders such as Apostle Bigboy Kathumba warn that water spirit practices are linked to anti-marriage curses and short-lived material wealth.\n\nThis spirit is influencing even churches and pastors. Some young people, including men with no clear source of income, are falling under its spell, said Kathumba. There are spiritual signs when someone is possessed by njuzu spirits.\n\nPolice say investigations into the Bindura drownings are ongoing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter — Police have released the names of two women who drowned during a suspected Manjuzu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/police-name-bindura-manjuzu-drowning-victims/\">Continue reading<span class=\"screen-reader-text\"> \"Police Name Bindura Manjuzu Drowning Victims \"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mthuli Ncube Driving A Range Rover Flocking USD600,000",
            "url": "https://www.zimeye.net/2025/08/01/mthuli-ncube-driving-a-range-rover-flocking-usd600000/",
            "content": "The following is a full spec breakdown for the 20222025 Range Rover L460 Autobiography, one of the most luxurious trims in the Range Rover lineup. This model which Prof Mthuli Ncube was driven to the parliament building in yesterday, is worth USD600,000 in Zimbabwe.\n\n RANGE ROVER L460 AUTOBIOGRAPHY  FULL SPECIFICATION (20222025)\n\n Powertrain Options\n\nYou can choose from several engine configurations depending on the region:\n\nEngine Type Power 0100 km/h Top SpeedP530 4.4L Twin-Turbo V8 (BMW-sourced) 523 hp, 750 Nm ~4.6 sec ~250 km/hP400 3.0L Turbocharged I6 with Mild Hybrid 395 hp, 550 Nm ~5.5 sec ~225 km/hD350 3.0L Turbo Diesel I6 345 hp, 700 Nm ~6.1 sec ~230 km/hPHEV (P440e / P510e) Plug-in Hybrid 3.0L I6 + Electric 434503 hp ~5.5 sec ~225 km/hEV version Coming late 2025\n\nAll models feature 8-speed ZF automatic transmission and all-wheel drive (AWD).\n\n Dimensions & Capacity Length: 5,052 mm (Long Wheelbase: 5,252 mm) Width: 2,048 mm (with mirrors folded) Height: 1,870 mm (air suspension adjustable) Wheelbase: 2,997 mm (3,197 mm for LWB) Boot Capacity: ~818 litres (up to 2,061 litres with seats down) Towing Capacity: 3,500 kg (braked)\n\n Key Features  Interior & Comfort 24-way heated, cooled, and massage front seats (semi-aniline leather) Executive class rear seats with power recline and calf rests Meridian Signature Sound System (35 speakers, 1,600W) 13.1 Pivi Pro Touchscreen + 13.7 Interactive Driver Display Rear-seat entertainment screens (11.4 dual HD displays) Panoramic sliding roof 4-zone climate control Cabin Air Purification Pro (anti-allergen, PM2.5 filter) Wireless phone charging with signal booster Interior ambient lighting (configurable) Soft-close doors\n\n Safety & Driver Assistance Adaptive Cruise Control with Steering Assist Emergency Braking (AEB) Blind Spot Assist 360 Surround Camera ClearSight rear-view mirror Driver Condition Monitor Park Assist (automated parallel/perpendicular parking) Lane Keep Assist Traffic Sign Recognition Matrix LED or Digital LED headlights\n\n Exterior Styling Distinctive bronze or copper vertical side accent (Autobiography Signature) Gloss Black roof (contrast option) 2223 Diamond Turned Alloy Wheels Flush deployable door handles LED DRLs with dynamic turn signals Rear light bar with hidden-until-lit tail lights\n\n Technology OTA (Over-the-Air) software updates Amazon Alexa integration Apple CarPlay / Android Auto (Wireless) Terrain Response 2 & All-Terrain Progress Control Dynamic Air Suspension with pre-emptive ride control via GPS Configurable Terrain Modes (Mud, Sand, Snow, Rock, etc.)\n\n Luxury Extras (Optional/Customizable) Refrigerator in center console Deployable rear tables Power deployable side steps Leather-wrapped headliner (Suedecloth/Alcantara optional) Privacy Glass & Acoustic Laminated Glass SV Bespoke customization (color, finish, monograms)\n\n Estimated Price (2025 Market)\n\nRegion Estimated Price (Autobiography V8)USA $158,000  $180,000 USDUK 135,000  160,000 GBPSouth Africa ZAR 3.8  4.5 millionZimbabwe (Duty Paid) USD $450,000  $600,000\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The following is a full spec breakdown for the 2022–2025 Range Rover L460 Autobiography, one of the most luxurious trims … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/mthuli-ncube-driving-a-range-rover-flocking-usd600000/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Ncube Driving A Range Rover Flocking USD600,000\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Top Zanu PF Cadres Die in Horror Crash",
            "url": "https://www.zimeye.net/2025/08/01/top-zanu-pf-cadres-die-in-horror-crash/",
            "content": "By A Correspondent Midlands-based war veterans Abias Pelile and Cde Solomon Nhondova were laid to rest this week at the Gweru Provincial Heroes Acre following a tragic road traffic accident on July 25.\n\nTheir untimely deaths came just hours after the passing of another liberation stalwart, Cde Mundenguma, who was buried at Destiny Memorial Park last weekend.\n\nThe sombre burial ceremony for Pelile and Nhondova was attended by Midlands Provincial Affairs Minister Owen Ncube and Gweru City Mayor Councillor Martin Chivhoko, among other dignitaries.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Midlands-based war veterans Abias Pelile and Cde Solomon Nhondova were laid to rest this week at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/top-zanu-pf-cadres-die-in-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zanu PF Cadres Die in Horror Crash\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "No Power, No Teachers, No Clinics—But Mavetera Gives Them Starlink",
            "url": "https://www.zimeye.net/2025/08/01/no-power-no-teachers-no-clinics-but-mavetera-gives-them-starlink/",
            "content": "By A Correspondent\n\nInformation Communication Technology Minister Tatenda Mavetera has hailed the deployment of Starlink internet kits to Zimbabwes rural district councils as a major step in bridging the digital dividebut critics say the move reeks of misplaced priorities in a country where basic public services are in shambles.\n\nIn a statement issued Wednesday, Mavetera announced that her ministry had distributed both computers and Starlink kits to all rural local authorities, claiming it was part of a broader push toward nationwide digital inclusion.\n\nAs we journey towards our digital transformation agenda of empowering every corner through ICT services in Zimbabwe, our Ministry deployed firstly computers and secondly Starlink kits to all our Rural District Councils and local authorities, she said.\n\nShe went on to declare that no village should be left offline, portraying the rollout as a key milestone toward achieving the governments Vision 2030 agenda.\n\nBut for communities that still lack electricity, healthcare facilities, qualified teachers, and even clean drinking water, the introduction of satellite internet is being met with more confusion than celebration.\n\nCritics argue that flashy technology projects mean little in rural councils where dilapidated clinics operate without nurses, schools have no textbooks or toilets, and entire wards go for weeks without power.\n\nStarlink kits will bridge connectivity gaps in our rural district councils, Mavetera insisted, yet offered no plan for how these kits will function in areas with no power or trained personnel to manage them.\n\nTo make matters worse, Starlink itself has operated in a legal grey area in Zimbabwe. The government previously warned against the use of the Elon Musk-owned satellite service, and there has been no official statement on the current legal framework or procurement process behind this sudden nationwide rollout.\n\nIn an apparent effort to frame the initiative as a broader reform drive, Mavetera also pointed to a sensitisation workshop conducted by the Ministry of Local Government and Public Works. The workshop included the launch of aMinimum Service Delivery Standards Dashboard, a digital tool meant to track real-time government performance.\n\nHowever, many observers view the dashboard as yet another symbolic gesture with little bearing on the daily struggles faced by rural populations. Data dashboards, they say, wont patch potholes, deliver medication, or fix broken boreholes.\n\nThese efforts are about closing the digital divide and fueling #Vision2030 through #DigitalizeZimbabwe, Mavetera addedwords that increasingly ring hollow for citizens confronting daily service delivery failures.\n\nAs the government continues to trumpet digital transformation, Zimbabweans are left wondering why leaders are prioritising internet kits over real, tangible improvements in their lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Information Communication Technology Minister Tatenda Mavetera has hailed the deployment of Starlink internet kits to Zimbabwe’s rural … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/no-power-no-teachers-no-clinics-but-mavetera-gives-them-starlink/\">Continue reading<span class=\"screen-reader-text\"> \"No Power, No Teachers, No Clinics—But Mavetera Gives Them Starlink\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Horror As Prophet’s Ritual Leaves Two Women Dead",
            "url": "https://www.zimeye.net/2025/08/01/horror-as-prophets-ritual-leaves-two-women-dead/",
            "content": "By A Correspondent\n\nA spiritual cleansing ritual at Nyaure River in Bindura turned into a nightmare after two women drowned while attempting to summon mermaid spirits, known locally as manjuzu. The incident, led by a self-styled prophet, has stunned the local community and provoked outrage from traditional leaders who accuse untrained spiritualists of endangering lives through reckless and unauthorised ceremonies.\n\nAccording to State media, the two victims were part of a group of five young women who had accompanied the prophet to the sacred river in Chief Masemburas area for what was meant to be a spiritual awakening.\n\nThe ritual, however, descended into chaos after one of the women allegedly got taken by the spiritsprompting a frantic and ultimately fatal rescue attempt.\n\nExplaining the ordeal to ZBC News, the prophet said:I went with some women to pray and I wanted to invoke the mermaid spirits. These people had their own issues and during this process one of us was taken by the spirits. We then went into the water to try and rescue her and one of them died. In the process, my wife also died during the rescue.\n\nThe incident has drawn criticism from traditional authorities, who condemned the unsanctioned ritual and failure to follow proper spiritual protocols.\n\nThese are sacred waters, and there are underground spiritual creatures there, said Headman Masembura.Every time you go there you must follow proper rituals and consult with the local leaders. We asked this prophet what he was doing, and he said he brought rice, sweets, biscuits and wine to appease the mermaid spirits of their deceased colleague. In this river, we have never heard of mermaidsbut spiritual things are hard to understand.\n\nBelief in manjuzumystical river beings thought to grant wealth, beauty, or famehas grown in popularity, especially among young women. But spiritual elders warn that the practices are being misused and manipulated by opportunists.\n\nTraditional healer Sekuru Nzou said:The thing that has happened here is shocking. Some people just say we are mermaids but there are procedures to be followed. People who go to rivers with others must have spiritual eyesight.\n\nHe explained that there are different types of manjuzu, including manjuzu enhope, who communicate through dreams and collect river medicine, and others believed to attract prosperity. However, he warned of the dangers of counterfeit rituals.Some people buy fake mermaid spirits and use magic which may lead them into Satanism, he added.\n\nNyasha Simon, a marine spirit believer, echoed the warnings.Manjuzu are real, but many of us young women are abusing them or being conned by fake prophets. If you go to the river with a hidden agenda, you can end up drowning because the spirits will reject you.\n\nThe tragedy has reignited debate over the legitimacy and regulation of African spiritual practices in Zimbabwe. As traditional leaders call for vigilance and respect for ancestral customs, the Bindura community continues to grieve a spiritual journey that ended in death.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A spiritual cleansing ritual at Nyaure River in Bindura turned into a nightmare after two women drowned … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/01/horror-as-prophets-ritual-leaves-two-women-dead/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Prophet’s Ritual Leaves Two Women Dead\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mthuli Presents ZiG$270 Billion Review Budget Amid Economic Collapse",
            "url": "https://www.zimeye.net/2025/07/31/mthuli-presents-useless-zig270-billion-review-budget-amid-economic-collapse/",
            "content": "By Business Reporter  Desperate to project optimism in the face of economic turmoil, Finance Minister Professor Mthuli Ncube on Thursday presented the 2025 Mid-Term Budget Review Statement at the new Parliament Building in Mt Hampden. He reviewed the ZiG$270 billion National Budget despite growing public frustration with the worsening cost of living, a rapidly deteriorating currency, and a government seemingly out of touch with reality.\n\nProfessor Ncube claimed Zimbabwe remained in growth mode, citing what he called positive developments during the first half of the year  despite overwhelming evidence pointing to a collapsing economy, with the recently introduced Zimbabwe Gold (ZiG) currency already failing to restore market confidence or curb inflation.\n\nGiven the positive economic developments during the period January to June, we are confident that the projected economic growth of six percent in the 2025 National Budget is achievable, Ncube said. All sectors are expected to record positive growth in 2025, mainly on account of a favourable agriculture season, improved electricity generation, and a stable exchange and inflation rate  notwithstanding declining international mineral commodity prices and a subdued global economic climate.\n\nHowever, Ncubes upbeat tone contrasts sharply with on-the-ground realities: runaway prices in ZiG, shortages of basic goods, and mounting pressure on businesses and households amid an unconvincing monetary reform process. The ZiG, launched in April 2024 to replace the depreciated Zimbabwe dollar, has struggled to gain traction as both retailers and the public continue to rely heavily on the US dollar.\n\nZimbabwes economic problems are rooted in long-term structural weaknesses, including a bloated public sector, weak industrial base, heavy reliance on mining exports, and widespread corruption. According to economists, the frequent currency changes and arbitrary policy shifts have deepened public distrust in formal financial systems.\n\nThe minister claimed that government reforms would enhance the ease of doing business and create a competitive economic environment. Government has, with immediate effect, begun reviewing various fees and charges. In addition, the number of bureaucratic steps and compliance requirements will be drastically reduced. On the fiscal front, the Government will continue to review the existing tax system with a view to reducing observed distortions and granting a supportive regime for business growth and competitiveness, he said.\n\nHe added that policy consistency would be key to maintaining stability. Mr Speaker Sir, the country has enjoyed economic stability during the first half of the year, and I want to assure Honourable Members that both fiscal and monetary authorities are going to stay in that mode. We cannot afford any policy slippages.\n\nYet critics argue that policy slippages have already become the norm. From introducing the ZiG without broad consultation to forcing citizens to pay some taxes in a barely usable local currency, the government has continued to implement inconsistent and often contradictory fiscal and monetary measures.\n\nKey highlights from the 2025 Mid-Term Budget Review include:\n\nZimbabwes economy has long been weighed down by political instability, disputed elections, and tight state control over key economic levers. While the official narrative talks of growth and reform, ordinary Zimbabweans continue to grapple with rising unemployment, deteriorating public services, and a shrinking formal economy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter — Desperate to project optimism in the face of economic turmoil, Finance Minister Professor Mthuli Ncube on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/mthuli-presents-useless-zig270-billion-review-budget-amid-economic-collapse/\">Continue reading<span class=\"screen-reader-text\"> \"Mthuli Presents ZiG$270 Billion Review Budget Amid Economic Collapse\"</span></a></p>",
            "time": "18:10",
            "date": "01 Aug 2025"
        }
    ]
}