{
    "news": [
        {
            "title": "Mnangagwa Plays Hide & Seek in Politburo",
            "url": "https://www.zimeye.net/2025/07/31/mnangagwa-plays-hide-seek-in-politburo/",
            "content": "By A Correspondent-President Emmerson Mnangagwa on Thursday avoided addressing the explosive controversy surrounding the co-option of his controversial ally, business tycoon Kuda Tagwirei, into Zanu PFs Central Committeechoosing instead to focus on liberation history and party ideology during the partys 385th Politburo session.\n\nThe silence has fueled speculation about deepening divisions and succession tensions within the ruling party, particularly involving Mnangagwas loyalists, Vice President Constantino Chiwengas faction, and outspoken party spokesperson, Christopher Mutsvangwa.\n\nTagwirei, a politically connected businessman often described as Mnangagwas financier and key behind-the-scenes strategist, was recently ejected from a Central Committee meeting at the party headquarters in Harare. This incident unfolded in full view of the President, who to date has offered no official comment on the matter.\n\nJust days later, Mnangagwa appeared alongside Tagwirei at a high-profile golf tournament organised by Tagwirei himselfa calculated move widely interpreted as a signal of solidarity and defiance against internal critics seeking to sideline the businessman.\n\nTagwireis growing presence in party structures has long been a point of contention. Critics within Zanu PF, including allies of Chiwenga and Mutsvangwa, view Tagwirei as emblematic of the moneyed elite who have captured the partys agenda for personal gain, while sidelining the liberation war veterans and military figures who have traditionally anchored Zanu PFs power.\n\nDespite expectations that Thursdays Politburo meeting would address the Tagwirei saga directly, Mnangagwa steered clear of the topic. Instead, he delivered a speech doubling down on the partys ideological roots, calling for loyalty to the party constitution and paying homage to the fallen heroes of the liberation struggle.\n\nZanu PF must never compromise on its constitution, values, principles and ideology We must never be lethargic in our sacred duty to retain power for the purpose of advancing the aspirations of the people, Mnangagwa said.\n\nObservers see the Presidents silence as part of a broader strategy to manage the delicate power balance in Zanu PF, where succession battles have intensified since the 2017 military-assisted ouster of Robert Mugabe.\n\nChiwenga, once seen as Mnangagwas natural successor due to his role in the coup, has reportedly grown frustrated by moves perceived to sideline military and liberation figures in favour of business allies like Tagwirei. Meanwhile, Mutsvangwa has openly criticised what he describes as the growing influence of corrupt tenderpreneurs over party affairs.\n\nMnangagwas calculated avoidance of the Tagwirei issue also coincided with his effort to rally the party ahead of the upcoming Heroes Day and Defence Forces Day commemorations. In his address, he claimed that Zanu PF remains the only party that can be trusted to protect Zimbabwes independence and deliver development.\n\nOur political seeds are sprouting, with a marked increase in grassroots membership across all leagues of the party. There is no room for complacency, he said.\n\nMnangagwa also highlighted the partys clean sweep in recent by-elections, praised deepening diplomatic ties with countries such as Equatorial Guinea, Japan, and Algeria, and reaffirmed his commitment to Pan-African solidarity, referencing his attendance at the Summit of Liberation Movements in South Africa.\n\nThe infrastructure that denied us democracy and independence has mutated and expresses itself in numerous forms We cannot be complacent. Robust and fluid strategies are necessary to guarantee the perpetuity of our people-centred governance, Mnangagwa told regional allies at the summit.\n\nYet, back home, unresolved internal fractures over Tagwireis roleand by extension, over who should control the party after Mnangagwaremain a looming crisis. Critics argue that the Presidents refusal to openly address the matter risks deepening factional mistrust, undermining the unity he publicly calls for.\n\nFor now, Mnangagwa continues to play political hide-and-seekappearing beside Tagwirei in public while keeping the matter off the official agenda, all as the succession storm quietly brews behind closed doors.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa on Thursday avoided addressing the explosive controversy surrounding the co-option of his controversial ally, business … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/mnangagwa-plays-hide-seek-in-politburo/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Plays Hide & Seek in Politburo\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "War Vets Reject Mnangagwa Bribe",
            "url": "https://www.zimeye.net/2025/07/31/war-vets-reject-mnangagwa-bribe/",
            "content": "By A Correspondent-A faction of the Zimbabwe National Liberation War Veterans Association (ZNLWVA) has dismissed reports that its leadership accepted bribes from Zanu PF, insisting their push to hold President Emmerson Mnangagwas administration accountable remains unchanged.\n\nThe faction, led by Andreas Mathibela, held a press conference in Harare on Tuesday to respond to allegations that Mathibela and other executive members were gifted vehicles by a Zanu PF-aligned benefactor in exchange for silence.\n\nThe claims, which have caused internal tensions and sparked a bid to oust Mathibelas leadership, were firmly deniedamid a clear message: the struggle for transparency and economic justice continues.\n\nOur roadmap has not changed, Mathibela told journalists. We have stood very firmly on the issues surrounding the state of our economy and the source of the problems, and thats what we intend to confront.\n\nHe added: Unfortunately, we are dealing with individuals who have amassed immense wealth, and all we have to fight them with is our conviction and the will of the people.\n\nWe know what they are doing is wrong, and we will continue to speak out and act for the betterment of all Zimbabweans.\n\nZimbabwe is grappling with deepening economic woes, marked by industrial decline, job losses, and a public health crisis worsened by mass emigration of skilled professionals. Anti-corruption watchdogs have repeatedly cited graft and mismanagement as key drivers of the crisis.\n\nDespite Zanu PFs claims that the economy is recovering, Mathibela painted a picture of a country in distress and leadership that is out of touch with the reality faced by ordinary citizens.\n\nWe have already taken legal steps to assert our right to peaceful protest, he said. Its enshrined in our Constitution. As long as we remain peaceful, we will continue to demonstrate against the poor management of our economy.\n\nMathibela also made it clear that his group speaks on behalf of the many Zimbabweans who are angry and frustrated.\n\nWe are not happy, and the citizens are not happy about the way our economy is being handled, he said.\n\nThe factions stance appears to signal growing dissent within former liberation war ranks, particularly among those disillusioned by Zanu PFs failure to deliver on its promises.\n\nBy openly rejecting alleged bribes and reaffirming their commitment to challenging corruption and misgovernance, Mathibelas camp has positioned itself as a rare voice of defiance in a political climate where many fear to speak out.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-A faction of the Zimbabwe National Liberation War Veterans Association (ZNLWVA) has dismissed reports that its leadership accepted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/war-vets-reject-mnangagwa-bribe/\">Continue reading<span class=\"screen-reader-text\"> \"War Vets Reject Mnangagwa Bribe\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Breaking News- ZRP Bulawayo disarm robbers",
            "url": "https://www.zimeye.net/2025/07/31/breaking-news-zrp-bulawayo-disarm-robbers/",
            "content": "Zimbabwe Republic Police in Bulawayo have disarmed and arrested robbers. More details to follow after 10am.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabwe Republic Police in Bulawayo have disarmed and arrested robbers. More details to follow after 10am.",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Bindura Women Drown While Performing Manjuzu Rituals",
            "url": "https://www.zimeye.net/2025/07/31/bindura-women-drown-while-performing-manjuzu-rituals/",
            "content": "By A Coreespondent-Two women from Bindura tragically drowned on Monday while performing rituals associated withmanjuzua mermaid spirit revered in some African traditional beliefsat the Nyaure River in the Chief Masembura area.\n\nThe incident has left the local community in shock and drawn condemnation from traditional leaders, who accused the group of violating sacred customs. It has also reignited debate over the controversial and often misunderstoodmanjuzuspirit practices.\n\nAccording to reports, five young women, led by a self-styled prophet, ventured into the wilderness to perform spiritual rituals. What began as a quest for healing and spiritual elevation ended in a double tragedy.\n\nI went with the women to pray and to invoke the mermaid spirits. Each had personal issues they wanted addressed. During the process, one of the women was taken by the spirits. We rushed into the water to rescue her, but one of them drownedand so did my wife, said the prophet.\n\nHeadman Masembura expressed outrage over the disregard for traditional protocol and warned against tampering with sacred water bodies without proper guidance.\n\nThese are sacred waters inhabited by spiritual beings. You dont just go there without consulting traditional authorities and following established rituals, he said. We asked what they were doing and the prophet told us he had brought rice, sweets, biscuits, and wine to appease the spirits of a deceased person. In this river, weve never heard of mermaids before, but the spiritual realm is complex and not easy to understand.\n\nIn recent years,manjuzurituals have become increasingly popular among young women seeking wealth, fame, or healing. Believers claim those born with or spiritually aligned tomanjuzuspirits can achieve success if they honour them properly.\n\nBut opinions remain divided.\n\nThe events here are disturbing, saidSekuru Nzou, a respected traditional healer. People claim to be mermaids or to be spiritually gifted, yet lack the training and spiritual insight required for these dangerous rituals.\n\nHe added, There are realmanjuzuand fake ones. The fake ones often use dark magic, even veering into Satanism. There are three main types ofmanjuzu: those who receive visions and collect herbs from rivers, those who bring wealth, and those connected to dreams. You need deep spiritual understanding before engaging with them.\n\nNyasha Simon, an expert on African spiritualism, echoed similar sentiments.\n\nManjuzuare real, but many young women are now abusing the tradition and falling prey to bogus prophets who promise riches. When people go to rivers with hidden agendas, they often clash with the spirits and sometimes drown, she said.\n\nThe tragic deaths have raised broader concerns about the rise of untrained spiritual leaders and the commercialization of sacred traditions. Much like the rise of fake prophets in Christianity, African traditional religion too is battling internal crises that threaten to erode its authenticity.\n\nWhat remains clear is that whilemanjuzupractices are rooted in deep spiritual belief systems, they demand respect, discipline, and proper knowledgesomething that is increasingly lacking in todays spiritually restless society.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Coreespondent-Two women from Bindura tragically drowned on Monday while performing rituals associated with manjuzu—a mermaid spirit revered in some … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/bindura-women-drown-while-performing-manjuzu-rituals/\">Continue reading<span class=\"screen-reader-text\"> \"Bindura Women Drown While Performing Manjuzu Rituals\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Zimbabwe’s Descent into Lootocracy",
            "url": "https://www.zimeye.net/2025/07/31/zimbabwes-descent-into-lootocracy/",
            "content": "By Engineer Jacob Kudzayi Mutisil | Zimbabwe has been reduced to a shadow of its former promise, a jewel of Africa, a nation of hope and prosperity now lies bruised and exploited under the weight of a political elite that robs its people with impunity. Our country has tragically become a lootocracy, a system where the ruling class treats state resources as personal property, enriching themselves, their families and cronies while the rest of us are condemned to perpetual poverty and broken infrastructure.\n\nZimbabwe continue to be governed by individuals who say nothing new, offer no innovative policies and recycle hollow promises from podiums and press conferences. The script is always the same blame sanctions, blame foreign powers, blame imaginary saboteurs, blame the white and blame Nelson Chamisa. Meanwhile, the only real sabotage is being carried out by those in power who siphon off national wealth through murky tenders, shady mining deals, inflated government projects and illicit financial flows.\n\nThey have turned Zimbabwes vast natural resources, our gold, lithium, diamonds and land into a private feeding trough. Mines operate in secrecy, national assets are sold for a song and billions are lost while schools go without chalk, hospitals lack basic supplies and our young people flee the country in search of hope.\n\nAnd yet, the most haunting question remains: What are you doing about it?\n\nThe silence of the citizen is the loudest approval. Are we so dumb and numb to the theft that we now accept it as normal? Have we resigned ourselves to a fate where suffering is inherited and corruption is tolerated? The people of Zimbabwe must reclaim their voice. It begins not just in the voting booth, but in demanding transparency, accountability and justice every day.\n\nWe must speak out, organise, resist and educate. The courage to challenge the rot must start in our homes, churches, communities and workplaces. The Constitution belongs to us, not to a handful of political bandits and thieves. We must stop hero-worshipping looters and start honouring the honest few.\n\nZimbabwe cannot afford another decade of silence. Our future, our childrens future, depends on what you, the citizen, decide to do. A nation that chooses silence in the face of theft will wake up to find everything stolen, including its soul.\n\nLet us stop this mess before there is nothing left to rise for.\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisil | Zimbabwe has been reduced to a shadow of its former promise, a jewel of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/zimbabwes-descent-into-lootocracy/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe’s Descent into Lootocracy\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Mugabe Spy Minister Exposes Mnangagwa Lies",
            "url": "https://www.zimeye.net/2025/07/31/mugabe-spy-minister-exposes-mnangagwa-lies/",
            "content": "By A Correspondent Former State Security Minister and ZANU PF founding elder Didymus Mutasa has finally broken his silence, responding to explosive claims made by President Emmerson Mnangagwa that accuse him of abandoning ZANU PF and clearing his office to hand over power to the late MDC leader Morgan Tsvangirai following the disputed 2008 elections.\n\nIn a rare and defiant 17-minute interview clip aired by ZimEye, Mutasa dismissed Mnangagwas accusations as a complete fabrication, asserting that he remained loyal to the party throughout the post-election crisis. There was no truth, no integrity. It was a lietotally untrue, he said.\n\nMutasa also criticised what he described as misguided press manipulation, recalling how Rhodesian-era newspapers once portrayed him as politically finished by publishing an altered photo showing him with a white beard.\n\nHe also revisited the deep suspicions that many younger ZANU PF cadres, including former youth leader Kudzanai Chipanga, held toward Mnangagwa even during the liberation struggle.\n\nFurther, Mutasa cast serious doubt on Mnangagwas liberation war record, asking how someone accused of bombing a train could have been transferred so easily between prisons.\n\nIn a closing remark laced with both sarcasm and regret, Mutasa stated:There was nothing like that. No one gave him the power to change the figures.\n\nThis is the first time Mutasa has publicly responded in detail to Mnangagwas claims, which were made earlier this year on the campaign trail. The full 43-minute interview will be aired in segments on ZimEye throughout the week.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former State Security Minister and ZANU PF founding elder Didymus Mutasa has finally broken his silence, responding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/mugabe-spy-minister-exposes-mnangagwa-lies/\">Continue reading<span class=\"screen-reader-text\"> \"Mugabe Spy Minister Exposes Mnangagwa Lies\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Spirits or Scam? Bindura Women Die During Mermaid Summoning Ceremony",
            "url": "https://www.zimeye.net/2025/07/31/spirits-or-scam-bindura-women-die-during-mermaid-summoning-ceremony/",
            "content": "Social Media Reacts to Tragic Drowning of Two Women During Mermaid Ritual in Bindura.\n\n..\n\nBy A Correspondent | ZimEye | Bindura, Zimbabwe \n\nA Tragic Dive into the Spirit World: Bindura Mermaid Ritual Claims Two Lives\n\nWhat was meant to be a spiritual cleansing and a gateway to fortune turned into a haunting tragedy in Binduras Nyaure River this week, when two women drowned during a suspected manjuzu (mermaid spirit) ritual led by a self-styled prophet. The shocking incident has not only left a rural community in mourning, but also stirred a national conversation about the dangers of spiritual desperation, the rise of self-proclaimed prophets, and the controversial pursuit of wealth through marine rituals. As the river continues to flow, so do the questionsand the angeracross Zimbabwe.\n\n Now they will know there is a God who deals with sinners, wrote Matthew King, igniting a storm of online reactions. Sibongile Marapis quickly fired back, questioning the logic: Saka unoti ana njuzu havaziye Mwari here kana munhu akafira mu church wani? (Are you saying mermaids dont know God, yet someone can still die in church?)\n\n Many commenters expressed sadness:\n\nBut it wasnt long before satire and spiritual reflections took centre stage.\n\n Lesley NaOluhle Kwiti Sibanda humorously turned the tragedy into a caution:\n\nThe 3 most difficult things you cant do in this life:\n\n Another comment by Happison Hungwe Chikova referenced the bizarre offering said to have been made to the mermaid spirits:\n\nRice, sweets, biscuits and wine to appease the mermaid spirits of their deceased colleague.\n\nStacey Nkhoma bluntly called it: Tuma ritual twechinhwhera (these foolish rituals), while Tafadzwa Chapfika added, Wawaona wese hande kumvura zvirikowo here, pointing to how many are drawn to river rituals without understanding the spiritual stakes.\n\nTragedy in Masembura\n\nThe incident occurred under the guidance of a self-styled prophet who led five young women into the river to perform a ritual intended to invoke manjuzu spirits. When one woman was taken by the spirits, two others, including the prophets own wife, drowned in the rescue attempt.\n\nThis is a sacred river, warned Headman Masembura, adding that such places require permission and proper rituals. He lamented the prophets use of sweets and wine, calling the act dangerous and disrespectful.\n\nTraditional healer Sekuru Nzou explained:\n\nManjuzu are real but are being abused. There are three types: some dream of spirits and collect medicines, others bring richesbut if you go with the wrong agenda, theyll reject you.\n\nCommentary\n\nThis incident has triggered national soul-searching about the commercialization of African spirituality and the dangers of mixing desperation with counterfeit prophetic practices. Experts warn that the thirst for wealth, beauty, or fame is pushing many young women into risky rituals led by untrained spiritualists.\n\nAs one expert put it:\n\nLike any religion, there are real and fake practitioners. Not everyone who claims to know manjuzu does.\n\nKey Takeaways:\n\n Two women drowned in Nyaure River during a manjuzu ritual led by a self-proclaimed prophet.\n\n The group allegedly used food and wine offerings to invoke mermaid spirits.\n\n Traditional leaders and spiritualists have condemned the ritual, calling for proper procedures and respect for sacred water bodies.\n\n Social media exploded with debate, ridicule, and warnings about fake prophets and dangerous spiritual shortcuts.\n\nZimEye will continue to follow developments on this story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Social Media Reacts to Tragic Drowning of Two Women During Mermaid Ritual in Bindura. ………….. By A Correspondent | ZimEye … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/spirits-or-scam-bindura-women-die-during-mermaid-summoning-ceremony/\">Continue reading<span class=\"screen-reader-text\"> \"Spirits or Scam? Bindura Women Die During Mermaid Summoning Ceremony\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Minnie Baloyi Shares Gym Tip With Trainer",
            "url": "https://www.zimeye.net/2025/07/31/minnie-baloyi-shares-gym-tip-with-male-trainer/",
            "content": "video loading below\n\nVP Chiwengas wife, Minnie Baloyi shares a gym tip with a male trainer, and announces, remember flat tummies are made in the gym and summer bodies are made in winter.At other times, she posts videos of herself leading (the VPs ex wife) Marry Mubaiwas kids into other abs,pic.twitter.com/Zaqc2UEFmS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below…",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Churches, Traditional Leaders Call For Cleansing Ceremony On Harare- Chitungwiza Highway",
            "url": "https://www.zimeye.net/2025/07/31/churches-traditional-leaders-call-for-cleansing-ceremony-on-harare-chitungwiza-highway/",
            "content": "By A Correspondent  Religious and traditional leaders have joined forces in calling for a spiritual cleansing ceremony along the HarareChitungwiza highway, amid growing concern over a disturbing increase in fatal road accidents on the stretch.\n\nThe move comes after a string of horrific crashes in recent months, with many residents and commuters expressing fear and unease about the highway, which connects the capital to one of the countrys busiest dormitory towns.\n\nSpeaking to state media on Tuesday, a prominent church leader said the accidents were no longer just a matter of traffic regulation but also pointed to deeper spiritual issues.\n\nWe cannot ignore the spiritual implications anymore, the leader said. This road has become a site of bloodshed. We believe there are forces that need to be confronted and cleansed spiritually.\n\nTraditional leaders echoed the sentiments, warning that the land may be harbouring unsettled ancestral spirits or lingering spiritual disturbances stemming from past events.\n\nIt is no longer just a black spot. There is something beyond human error going on here, said one headman from the Chitungwiza area. As custodians of the land, we are ready to work with churches to appease the spirits and restore peace.\n\nAccording to the Zimbabwe Republic Police, the HarareChitungwiza road has recorded an alarming spike in accidents, many of them involving public transport. Just last week, a crash near Manyame Bridge claimed 17 lives, followed days later by another accident a few kilometres away that left several seriously injured.\n\nLocal residents have since started to push for not only tighter road safety measures, but also for spiritual intervention. Community leaders say the cleansing ceremony will involve both Christian prayer and traditional rituals, symbolising unity across faiths in addressing the crisis.\n\nWe will not just pray, we will also pour libations, beat drums, and perform rituals, said a traditional healer involved in the initiative. This is not superstition  it is part of acknowledging our spiritual reality.\n\nThe date for the ceremony is expected to be announced soon, with organisers encouraging participation from all sections of society  religious groups, transport associations, civic leaders, and affected families.\n\nThe blood of innocent people has cried out for too long, said the church leader. Its time to act both physically and spiritually.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Religious and traditional leaders have joined forces in calling for a spiritual cleansing ceremony along the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/churches-traditional-leaders-call-for-cleansing-ceremony-on-harare-chitungwiza-highway/\">Continue reading<span class=\"screen-reader-text\"> \"Churches, Traditional Leaders Call For Cleansing Ceremony On Harare- Chitungwiza Highway\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        },
        {
            "title": "Makorokoza Wreak Havoc in Mutare…",
            "url": "https://www.zimeye.net/2025/07/31/makorokoza-wreak-havoc-in-mutare/",
            "content": "By A Correspondent  Mutare is under siege from illegal gold panners, whose uncontrolled activities are now threatening the citys environment, public health, and security, according to a Mutare City Council source.\n\nThe gold panners, commonly referred to as makorokoza, have invaded several areas around the city, leaving trails of destruction and raising serious concern among local authorities.\n\nWe are witnessing environmental destruction on a massive scale, said a Mutare City Council source. These illegal miners are digging indiscriminately, polluting rivers, and using toxic chemicals without any regard for the long-term consequences.\n\nThe source explained that rivers such as Odzi, Sakubva, and Mutare have become hotspots for contamination due to the use of mercury and cyanide in the gold extraction process.\n\nMercury doesnt just disappear  it builds up in the environment and enters the food chain. These rivers supply water to thousands, so this is not just an environmental issue; its a public health emergency.\n\nThe City Council is also concerned about rising crime in areas affected by illegal panning. Residents in suburbs near the mining sites have reported theft, assaults, and violent confrontations.\n\nThese people operate outside the law. Some are armed, and they dont hesitate to intimidate residents or each other. We are seeing a breakdown in public order in certain parts of the city, the Mutare City Council source said.\n\nHealth officials have reportedly recorded cases of skin infections, respiratory problems, and symptoms consistent with mercury poisoning among people living near the mining zones.\n\nThere is no protective gear, no safety measures, and no waste management, said the source. The chemicals used can cause permanent damage to the nervous system, especially in children. Were putting lives at risk by allowing this to continue.\n\nThe economic fallout is also worrying. Illegal gold panning deprives both local and national authorities of tax revenue, while damaging ecosystems that are essential to sectors such as tourism and agriculture.\n\nWe are losing both revenue and resources, the Mutare City Council source said. Once the land is damaged, it takes decades to restore. Thats a direct loss to future generations.\n\nThe Council is calling for urgent intervention from the central government and other regulatory bodies.\n\nWe cant tackle this alone. We need support from the Ministry of Mines, the Environmental Management Agency, and law enforcement. If nothing is done, Mutare will face irreversible damage  environmentally, economically, and socially.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Mutare is under siege from illegal gold panners, whose uncontrolled activities are now threatening the city’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/31/makorokoza-wreak-havoc-in-mutare/\">Continue reading<span class=\"screen-reader-text\"> \"Makorokoza Wreak Havoc in Mutare…\"</span></a></p>",
            "time": "09:16",
            "date": "01 Aug 2025"
        }
    ]
}