{
    "news": [
        {
            "title": "ZIFA Secures Partnership with 4May International",
            "url": "https://www.zimeye.net/2025/03/10/zifa-secures-partnership-with-4may-international/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has announced a strategic corporate partnership with 4May International, a premier high-end mens fashion brand. This three-year agreement, effective from March 1, 2025, to December 31, 2027, marks a significant milestone in ZIFAs commitment to professionalism and excellence.\n\nAs the Official Formal Wear Partner of the Zimbabwe Mens National Soccer Team, 4May International will provide the Warriors\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has announced a strategic corporate partnership with 4May International, a premier high-end men’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/zifa-secures-partnership-with-4may-international/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Secures Partnership with 4May International\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Warriors Coach Michael Nees Explains Delay in Squad Announcement for World Cup Qualifiers",
            "url": "https://www.zimeye.net/2025/03/10/warriors-coach-michael-nees-explains-delay-in-squad-announcement-for-world-cup-qualifiers/",
            "content": "By A Correspondent\n\nWith just over a week to go before the Warriors crucial 2026 World Cup Qualifiers against Nigeria and Benin, coach Michael Nees has revealed why he has delayed announcing the squad.\n\nIn an interview with the Sunday Mail, Nees explained that he needs more time to assess the locally-based players, as the league has just begun. He emphasized that the team is diverse, with players from overseas, South Africa, and local leagues, each with different situations.\n\nNees expressed concerns about the fitness levels of local players, having only played a few matches. He described the process of selecting players without properly assessing their fitness as a blind flight.\n\nThe Warriors will face Benin on March 20 in Durban, South Africa, before traveling to Uyo, Nigeria to take on the Super Eagles on March 25. Nees squad announcement is eagerly anticipated, as fans await the teams preparation for these critical World Cup qualifiers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent With just over a week to go before the Warriors’ crucial 2026 World Cup Qualifiers against Nigeria … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/warriors-coach-michael-nees-explains-delay-in-squad-announcement-for-world-cup-qualifiers/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Coach Michael Nees Explains Delay in Squad Announcement for World Cup Qualifiers\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Minister’s Son Linked To Abduction Scandal",
            "url": "https://www.zimeye.net/2025/03/10/ministers-son-linked-to-abduction-scandal/",
            "content": "By Crime and Courts Reporter- The late Transport Minister, Joel BiggieMatizasson, Batsirai, has been named in the forced disappearance of Environmental activistNadia Vongai Mabvirakare.\n\nNadia was forcibly taken from her home in Chitungwiza last Wednesday evening by unknown men in what appears to be a politically motivated abduction.\n\nHer disappearanceis linkedto a group of politically connected individuals, includingBatsirai, who allegedly sought to seize control of her farming project inMurewa.\n\nA police report hasbeen filedatMakoni Police StationunderRRB Number 6346710, yet authorities have made no progressinlocating her.\n\nMabvirakare, a key figure inGreen Rebirth, an environmental advocacy organization, played a pivotal role in resisting illegal land grabs disguised as development initiatives.\n\nAfter realizingMatizasintentions to take over the Murewa projectunlawfully, the Green Rebirth board urgently filed aHigh Court applicationto block the move.\n\nOn the same daythe case was broughtbefore the court,suspicious individuals, including aCID officer identified as Shenje from Murewa,were reportedly seennear her home.\n\nThat evening, as Mabvirakare stepped outside to lock her gate, she disappeared without a trace.\n\nMabvirakarescase is the latest in a series of politically motivated abductions in Zimbabwe, where activists, opposition figures, and government critics havebeen targetedby suspected state security agents or individuals with strong ties toZanu PF.\n\nFor decades, enforced disappearances havebeen usedtoinstillfear and silence dissent.\n\nTheGukurahundi massacres (1980s), the2008 election violence, and more recent cases like the 2019 abduction and torture ofMDC Alliance activists Joanna Mamombe, Cecilia Chimbiri, and Netsai Marovahighlight a long-standing pattern of repression.\n\nMost of these abductions follow a similar script: victimsare seizedby unidentified men, held incommunicado, tortured, and later dumped in remote areasif theyare foundat all.\n\nThe government routinely denies involvement, while law enforcement agenciesmake little effortto investigate or hold perpetrators accountable.\n\nZanu PF officials and politically connected individualshave repeatedly weaponized state institutions, including thepolice, Central Intelligence Organisation (CIO), and military, to suppress dissent, intimidate opponents, and grab land and resources for personal gain.\n\nCases likeMabvirakaresillustrate how politically connected elites operate with impunity, using violence and intimidation to assert control over economic and environmental resources.\n\nHuman rights groups and opposition leaders have condemned the abduction and demanded an urgent response from authorities.\n\nAmnesty International, the Zimbabwe Human Rights NGO Forum, and other advocacy groupshave called for an immediate investigation and the safe return of Mabvirakare.\n\nHowever, withZimbabweshistory ofstate-sponsored violence, accountability remains elusive.\n\nIf history is any indicator, authorities mayignore, downplay, or outright denytheir role in the disappearance, as they have in numerous past cases.\n\nMabvirakaresfamily, colleagues, and fellow activistsare urginginternational organizations, diplomatic missions, and civil societyto intervene and push for her release.\n\nPLEASE SHARE | MISSINGEnvironmental activist Nadia Vongai Mabvirakare was forcibly taken from her home in Chitungwiza on the evening of Wednesday, March 5th, 2025. A police report has been filed at Makoni Police Station under RRB Number 6346710, but as of today, there haspic.twitter.com/gbhebTibgL\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- The late Transport Minister, Joel Biggie Matiza’s son, Batsirai, has been named in the forced disappearance of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/ministers-son-linked-to-abduction-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Minister’s Son Linked To Abduction Scandal\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Overloading Buses: A Growing Safety Concern",
            "url": "https://www.zimeye.net/2025/03/10/overloading-buses-a-growing-safety-concern/",
            "content": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a common practice, this situation poses serious risks to passengers and needs to be addressed by authorities.\n\nOne of the main dangers of overcrowded buses is the excessive weight that is placed on the vehicle. When a bus is overloaded, it becomes harder for the driver to maintain control, especially when navigating sharp turns or sudden stops. In the event the driver is forced to apply the emergency brake, passengers who are standing are at risk of falling and sustaining injuries due to the lack of support.\n\nMoreover, standing passengers are more vulnerable to accidents in the event of sudden maneuvers. They lack the security of a seat belt or a steady handrail, making them more likely to be thrown off balance and potentially hurt in an accident. The possibility of injury only increases when buses are traveling at high speeds or during congested traffic conditions.\n\nThe safety of passengers should always be a priority, and overloading buses compromises this fundamental principle. Passengers deserve a safe and secure journey, and it is crucial for bus operators and regulatory authorities to enforce strict guidelines on vehicle capacity to prevent overloading.\n\nTo mitigate these risks, authorities should consider increasing inspections of public transportation systems and impose fines for overloading violations. Moreover, bus companies must adhere to regulated passenger limits and ensure that all safety protocols are followed to protect the well-being of those traveling.\n\nIn conclusion, the practice of overloading buses is not only illegal but extremely dangerous. It is essential for both passengers and authorities to recognize the risks involved and work together to prioritize safety in public transport.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/overloading-buses-a-growing-safety-concern/\">Continue reading<span class=\"screen-reader-text\"> \"Overloading Buses: A Growing Safety Concern\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Zim Transformation Certain: Advocate Chamisa",
            "url": "https://www.zimeye.net/2025/03/10/zim-transformation-certain-advocate-chamisa/",
            "content": "By A Correspondent\n\nOpposition leader, Advocate Nelson Chamisa, has acknowledged the widespread criticism and agitation coming from Zimbabwean citizens who are struggling amid the ongoing economic turmoil.\n\nIn a statement released over the weekend, Chamisa addressed the current situation, offering a message of hope and reassurance despite the difficult circumstances.\n\nI am aware of the suffering and frustration of our people, Chamisa said. But I want to assure you that a sudden change is coming. The real change that is coming will cause all to see and know that prayer works and that there is a God in Heaven. He went on to add, #Godisinit.\n\nChamisa urged people to ignore the distractions and negativity surrounding the situation, emphasizing that divine intervention was at hand. Ignore all the sideshows and ignorance. The heavens will confound all, silencing all the disbelief, cynicism, and criticism. It is about His name and fame that must be exalted, not any other mans name or fame, he said.\n\nHe also expressed confidence that Gods plan for Zimbabwe was unfolding, citing the biblical passage Psalm 126:1-3 to reinforce his belief. Gods hand is moving mightily in Zimbabwe. God is not man that He should promise and not do it. He doesnt promise then compromise His promise. Blessed Sabbath, Chamisa concluded, affirming, #Godisinit Forever and always.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader, Advocate Nelson Chamisa, has acknowledged the widespread criticism and agitation coming from Zimbabwean citizens who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/zim-transformation-certain-advocate-chamisa/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Transformation Certain: Advocate Chamisa\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Zanu PF’s Marapira Demands Apology Over Activist’s Alleged Disappearance Allegations",
            "url": "https://www.zimeye.net/2025/03/10/zanu-pfs-marapira-demands-apology-over-activists-alleged-disappearance-allegations/",
            "content": "By A Correspondent| Zanu PF Director of Information, Farai Marapira, has called for a public apology from a social media user who accused him of involvement in the alleged disappearance of environmental activist and farmer, Nadia Vongai Mabvirakare.\n\nReports indicate that Mabvirakare was forcibly taken from her home in Chitungwiza on Wednesday evening. A police report has been filed at Makoni Police Station under RRB Number 6346710.\n\nOn Monday night, an X user identified as @DrAfricanPride alleged that Marapira and Zanu PF national youth member for environment, Batsirai Joel Matiza, were linked to Mabvirakares disappearance.\n\nResponding to the claims, Marapira denied any involvement beyond introducing Mabvirakare to Matiza, whom she had approached for support with a farming project.\n\nThat was the end of my involvement bar updates here and there from the both of them being excited with their project, Marapira said.\n\nHe further explained that tensions arose in January when Matiza informed him that an audit team had discovered financial mismanagement on Mabvirakares part.\n\nAs a person who introduced them, I went to his office to understand better and after they explained, I texted Nadia asking to see her and discuss the matter, he said.\n\nMarapira recounted that Mabvirakare agreed to meet him the next day and told him the case had already been reported to the police.\n\nShe told me to ask him to suspend the police report and asked to meet in a neutral venue he stated.\n\nMarapira has since demanded a public retraction from the netizen who made the allegations.\n\nbe responsible enough to acknowledge publicly that your assertions against me were unwarranted since you also made them publicly, he said.\n\nMaybe next time an inquiry first would help hey.\n\nMeanwhile, police have launched an investigation into Mabvirakares alleged disappearance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Zanu PF Director of Information, Farai Marapira, has called for a public apology from a social media … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/zanu-pfs-marapira-demands-apology-over-activists-alleged-disappearance-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF’s Marapira Demands Apology Over Activist’s Alleged Disappearance Allegations\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Load Shedding Stalls Minister Mavetera’s Donation Of Computers To Masvingo School",
            "url": "https://www.zimeye.net/2025/03/10/load-shedding-stalls-minister-maveteras-donation-of-computers-to-masvingo-school/",
            "content": "By A Correspondent\n\nHon. Tatenda Mavetera, the Minister of ICT, has made a significant contribution to education in Masvingo by donating Core i5 laptops and a Starlink kit during the ZANU-PF Thank You Rally at Gwengavi Primary School in Masvingo West constituency on Saturday.\n\nThis donation aims to empower students with digital tools and promote digital literacy, ensuring the youth have the necessary resources to thrive in the future.\n\nHowever, despite the commendable gesture, concerns are rising that prolonged power outages and the ongoing load shedding crisis could severely limit the impact of Maveteras donation.\n\nWith power outages being a persistent issue across the country, the laptops and Starlink kit may remain underutilized if there is no reliable electricity to charge or operate the devices.\n\nWhile the donation to Gwengavi Primary School and 15 additional schools in Masvingo is a positive step toward improving digital infrastructure, the chronic power shortages in Zimbabwe pose a significant obstacle.\n\nThe lack of consistent electricity to power these new technologies could render the initiative ineffective, as students and teachers may find themselves unable to use the equipment on a regular basis.\n\nThe issue of load shedding has affected various sectors, including education, making it difficult for schools to fully embrace technological advancements.\n\nEven with the provision of modern gadgets, the success of such initiatives is undermined when the power supply remains unreliable.\n\nMinister Maveteras efforts to enhance Zimbabwes digital infrastructure are indeed commendable, but without addressing the root issue of consistent power supply, the long-term effectiveness of these initiatives may be compromised.\n\nThe government must prioritize solutions to the ongoing power crisis to ensure that such donations can truly benefit the future generation and contribute to the countrys digital transformation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Hon. Tatenda Mavetera, the Minister of ICT, has made a significant contribution to education in Masvingo by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/load-shedding-stalls-minister-maveteras-donation-of-computers-to-masvingo-school/\">Continue reading<span class=\"screen-reader-text\"> \"Load Shedding Stalls Minister Mavetera’s Donation Of Computers To Masvingo School\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Chivayo Marries Mnangagwa’s Daughter",
            "url": "https://www.zimeye.net/2025/03/10/chivayo-marries-mnangagwas-daughter/",
            "content": "By A Correspondent\n\nControversial Zanu PF businessman Wicknell Chivayo has announced that he is now married to Lucy Lulu Muteke, the daughter of Zimbabwes President, Emmerson Mnangagwa, by virtue of totem.\n\nIn a statement on Sunday, Chivayo expressed his gratitude for the support he received from President Mnangagwa ahead of his Roora (bride price) ceremony.\n\nChivayo reportedly spent over $100,000 for the event.\n\nChivayo wrote:\n\nA Vote of ThanksYesterday was one of the most special days of our lives, filled with excitement, overwhelming emotions, and a deep sense of gratitude that words can hardly capture.\n\nI never imagined the immense outpouring of love or the large number of people who came to celebrate the beginning of our beautiful journey of love. The night before, as I reflected on the negativity often seen on social media, I never thought our venue would be packed with friends and family, all standing with us and congratulating us.\n\nSo many prayed for this day, hoping for our union to be built on love and for Gods grace to guide us into a lifetime of marital bliss. For this, we are truly and eternally grateful. \n\nI wish to extend our heartfelt gratitude to His Excellency, President E.D. Mnangagwa, Shumba, and aTezvara vangu (my father-in-law), and the First Lady for mentoring us on the sanctity of marriage and the importance of family. Thank you for blessing our union. To my beloved brothers, sisters, and the Chivayo family at large, you went above and beyond to make this day unforgettable.\n\nTo my amazing in-laws, the Muteke family and friends, words fail me in expressing how deeply I appreciate and love you. Your love and prayers have been overwhelming. Youve not only welcomed me as a son-in-law, but as a son and a brother now part of your family. Thank you for entrusting me with your most precious and beautiful daughtera rare gem, a strong and intelligent woman who is a true blessing in my life.\n\nAs long as I have breath in my body, I will protect, cherish, and love her in every possible way.\n\nTo our incredible friends, business associates, and every single person who took time to celebrate with usyour presence made our day even more special and unforgettable.\n\nA special tribute goes to the phenomenal artists who made our day even more memorable: Jah Prayzah & The 3rd Generation Band, Killer T, Enzo Ishall, the Travellers Band, and many others whose top-tier performances kept our guests fully entertained. To the catering team, you created an entirely new level of experience, and every bite was a celebration in itself. To the MC, planners, dcor team, and all service providers who worked tirelessly behind the scenes to make this day perfect, we deeply appreciate you. And to everyone who played a part, whether seen or unseen, thank you from the bottom of our hearts.\n\nYesterday marked the birth of love and a powerful demonstration of family support. For that, we are eternally grateful.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF businessman Wicknell Chivayo has announced that he is now married to Lucy Lulu Muteke, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/chivayo-marries-mnangagwas-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Marries Mnangagwa’s Daughter\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Mine Boss Accused of Beating Workers, Dodging Arrest",
            "url": "https://www.zimeye.net/2025/03/10/mine-boss-accused-of-beating-workers-dodging-arrest/",
            "content": "By A Correspondent| A mine owner in Chinhoyi is facing mounting outrage over allegations of physically abusing his workers, with reports suggesting law enforcement is turning a blind eye due to his alleged ties to the countrys intelligence services.\n\nOscar Kurasha, owner of Vynwk 5 mine, has reportedly assaulted employees with his hands and weapons, sources say.\n\nSome workers, including Tinos Shiri, Crispen Kudyarawanza, Gift Adam, Blessing Makore, and Isaac Moyo, claim Kurasha believes he is untouchable because of his alleged role in the intelligence department.\n\nHe beats us with weapons, and despite our attempts to report him, no one has stepped in to help, one miner told this publication\n\nThe miners allege that 15 workers were recently injured in separate incidents, some suffering broken limbs.\n\nOnly five victims were able to file police reports at Chinhoyi Police Station, but no action has been taken, they claim.\n\nOfficial police records reviewed by this publication indicate multiple complaints against Kurashacited as CR 52/02/25, 83/02/25, 85/02/25, and 90/02/25.\n\nYet, the miners allege police officers at the station have refused to act, raising concerns about possible bribery.\n\nWe know no one is above the law, so why is he getting away with this just because hes in intelligence? one worker asked.\n\nLocal residents are also questioning Kurashas alleged impunity, particularly given reports that he serves at State House.\n\nHe should be upholding the law, not breaking it, one resident said.\n\nEfforts to obtain comment from the police were futile.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A mine owner in Chinhoyi is facing mounting outrage over allegations of physically abusing his workers, with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/mine-boss-accused-of-beating-workers-dodging-arrest/\">Continue reading<span class=\"screen-reader-text\"> \"Mine Boss Accused of Beating Workers, Dodging Arrest\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        },
        {
            "title": "Police Block Opposition MP’s Feedback Meeting…",
            "url": "https://www.zimeye.net/2025/03/10/police-block-opposition-mps-feedback-meeting/",
            "content": "By A Correspondent\n\nThe democratic space in Zimbabwe is rapidly shrinking under Mr Emmerson Mnangagwas Mnangagwas government, with growing concerns about the erosion of political freedoms.\n\nMbizos opposition MP, Corban Madzivanyika, was on Sunday blocked by the police from holding a feedback meeting with his constituents in Kwekwe.\n\nThe meeting, which aimed to engage residents and address local concerns, was abruptly stopped by authorities.\n\nOfficer Commanding Kwekwe, Enock Chishiri, cited the reason for the disruption as the polices preparations for next months Independence celebrations.\n\nThe police are preparing for independence celebrations, and as a result, no public gatherings are permitted at this time, Chishiri explained.\n\nHowever, Madzivanyika believes the true motive behind the ban is politically motivated.\n\nHe suspects that his vocal opposition to the Broadcasting Services Amendment Bill, which he claims is repressive and unfairly forces motorists to pay for Zimbabwe Broadcasting Corporation (ZBC) licenses, has put him in the crosshairs of the authorities.\n\nSpeaking on the incident, Madzivanyika condemned the polices actions, saying, We expect officers to act in a professional and non-partisan manner. It is disappointing to see such tactics being used against those who merely want to engage with their constituents.\n\nThe incident highlights ongoing concerns over the suppression of political space in Zimbabwe, where critics argue that the government is using the police to stifle dissent and limit opposition activities. Critics have long accused the Mnangagwa administration of consolidating power, pushing Zimbabwe closer to becoming a de facto one-party state.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The democratic space in Zimbabwe is rapidly shrinking under Mr Emmerson Mnangagwa’s Mnangagwa’s government, with growing concerns … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/10/police-block-opposition-mps-feedback-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Police Block Opposition MP’s Feedback Meeting…\"</span></a></p>",
            "time": "18:40",
            "date": "11 Mar 2025"
        }
    ]
}