{
    "news": [
        {
            "title": "BUS ACCIDENT: Six Injured in Toyota Hilux and Bus Collision on Bulawayo-Beitbridge Highway",
            "url": "https://www.zimeye.net/2024/12/29/bus-accident-six-injured-in-toyota-hilux-and-bus-collision-on-bulawayo-beitbridge-highway/",
            "content": "Bulawayo  Six people were injured yesterday when a Toyota Hilux collided head-on with a bus along the Bulawayo-Beitbridge highway, near the Bulawayo Student Accommodation Complex. The accident occurred after the Toyota Hilux driver veered into the oncoming lane of the bus traveling from the Kensington, Sihlengeni area.\n\nThe victims included the drivers of both vehicles and four bus passengers, who sustained varying injuries. Bulawayos chief fire officer, Mr. Nhlanganiso Moyo, reported that the fire brigade received the emergency call at 4:30 PM and arrived at the scene within six minutes.\n\nThe Scene and Vehicle Conditions\n\nThe Toyota Hilux, as seen in the aftermath, suffered severe front-end damage. The impact left the vehicle almost unrecognizable, with the hood, bumper, and front-right wheel area completely crushed. The windshield was shattered, and the structural integrity of the front cabin was significantly compromised. The bus also sustained notable damage but remained intact enough to avoid passenger entrapment.\n\nEmergency services swiftly removed the injured individuals from the vehicles, transporting them to United Bulawayo Hospitals (UBH) for medical attention. Thankfully, there were no fatalities, and the fire brigade confirmed that none of the victims were trapped within the wreckage.\n\nEmergency Measures Taken\n\nThe fire brigade also decontaminated a 100-meter stretch of the highway that was heavily affected by oil spillage from the vehicles. This was done using a special detergent to ensure road safety and prevent further incidents.\n\nMr. Moyo commended the quick response of the emergency teams and urged drivers to avoid reckless overtaking and speeding, particularly in areas with blind spots.\n\nThis incident serves as a stark reminder of the importance of responsible driving, especially on busy highways. Investigations into the cause of the crash are ongoing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo – Six people were injured yesterday when a Toyota Hilux collided head-on with a bus along the Bulawayo-Beitbridge highway, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/bus-accident-six-injured-in-toyota-hilux-and-bus-collision-on-bulawayo-beitbridge-highway/\">Continue reading<span class=\"screen-reader-text\"> \"BUS ACCIDENT: Six Injured in Toyota Hilux and Bus Collision on Bulawayo-Beitbridge Highway\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "Zimbabwe Wants To Deport Nigerian Married Couple",
            "url": "https://www.zimeye.net/2024/12/29/zimbabwe-wants-to-deport-nigerian-married-couple/",
            "content": "By A Correspondent | ZimEye |Gweru, Zimbabwe  Success Ibekwe (41) and Destiny Ibekwe (43), a Nigerian couple, have been found guilty of violating Zimbabwes Immigration Act by a magistrate in Gweru. The couple was arrested for remaining in the country illegally after entering through the Beitbridge border in 2019.\n\nThe Ibekwes had been operating a fast-food outlet in Gwerus city center, despite lacking legal immigration status. Authorities apprehended them recently, bringing their unauthorized stay to an end.\n\nFollowing their conviction, the court imposed a fine of USD 200. Failure to pay the fine would result in a two-month prison sentence, after which they would face deportation back to Nigeria.\n\nThis case highlights Zimbabwes ongoing efforts to enforce immigration laws and combat illegal residency within its borders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Gweru, Zimbabwe – Success Ibekwe (41) and Destiny Ibekwe (43), a Nigerian couple, have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/zimbabwe-wants-to-deport-nigerian-married-couple/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Wants To Deport Nigerian Married Couple\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "Bail Hearing for Chivayo’s Former Business Partners Rescheduled …",
            "url": "https://www.zimeye.net/2024/12/29/bail-hearing-for-chivayos-former-business-partners-rescheduled/",
            "content": "By A Correspondent\n\nThe bail hearing for Mike Chimombe and Moses Mpofu, former business partners of Wicknell Chivayo, in the Presidential Goat Pass-On Scheme fraud case, has been rescheduled to January 3, 2025.\n\nAccording to The Herald, the pair is seeking bail under new circumstances. Initially set for January 17, 2025, the hearing was moved forward after their legal team informed Judge President Mary Dube of a crucial legal requirement.\n\nBail applications are required to be heard within 48 hours of filing, with appeals to be resolved within 96 hours. The hearing was originally postponed to December 27, 2024, but the prosecution, citing a lack of preparedness, requested a delay to January 3 to provide a comprehensive response. Both parties agreed to the extension.\n\nChimombe and Mpofu face charges of defrauding the Presidential Goat Pass-On Scheme of US$7.7 million. Earlier this month, their attempt to have the case referred to the Constitutional Court was dismissed by Justice Pisirayi Kwenda. The pair had argued that their arrest, detention, and pre-trial processes infringed upon their constitutional rights, warranting intervention from the Constitutional Court.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The bail hearing for Mike Chimombe and Moses Mpofu, former business partners of Wicknell Chivayo, in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/bail-hearing-for-chivayos-former-business-partners-rescheduled/\">Continue reading<span class=\"screen-reader-text\"> \"Bail Hearing for Chivayo’s Former Business Partners Rescheduled …\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "Mai Titi in Bruno’s Secret Chats",
            "url": "https://www.zimeye.net/2024/12/29/mai-titi-in-brunos-secret-chats/",
            "content": "video loading helow\n\nxplosive Leaked Audio Exposes Tensions Between Mai Titi, Bruno, and Aide Jenel\n\nA leaked audio file featuring a private conversation between Jenel, a close aide of Zimbabwean entertainer Mai Titi (Felistas Murata), and Bruno from Bruno Furnitures, has sent social media into a frenzy. The audio reveals deep-seated frustrations, personal betrayals, and hints of a crumbling relationship within Mai Titis inner circle.\n\nDuring the conversation, Bruno is heard urging Jenel to distance himself from Mai Titi, saying,You must leave Mai Titi; she is wasting your future, seeing all youve told me.Jenel appears to agree, expressing frustration over being drawn into what he describes as Mai Titis personal dramas.\n\nHow long are we going to fight the fights of moms? Jenel remarks, referring to Mai Titi by her nickname. Bruno responds in agreement, stating,You dont lie at all.\n\nThe conversation takes an even more startling turn as Jenel claims that Mai Titi expressed indifference toward Bruno, saying,When I heard that you are now working together, she told me she does not care about Bruno and all. I got shocked.He goes on to reveal that the drama eventually involved reaching out to the Nyathi family, though the specifics of their involvement remain unclear.\n\nJenel laments the constant turmoil surrounding Mai Titi, saying,Moms has her wars, but sometimes she expects us to join her silly wars.Bruno concludes the conversation on a resigned note, saying they shouldjust go ahead Gods way.\n\nPublic Reactions to the Leaks\n\nThe leaked audio has sparked widespread speculation and debate online. Many fans and critics have weighed in on Mai Titis often-publicized feuds, questioning whether this is yet another episode in her series of controversies or a deeper crisis within her camp.\n\nMai Titi, known for her outspoken nature, has not yet issued a response to the allegations. However, the involvement of key figures like Bruno and Jenel suggests the fallout may have broader implications for her personal and professional relationships.\n\nWhats Next?\n\nAs tensions rise, many are left wondering how this revelation will impact\n\nHa ha da LOL \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading helow xplosive Leaked Audio Exposes Tensions Between Mai Titi, Bruno, and Aide Jenel A leaked audio file featuring … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/mai-titi-in-brunos-secret-chats/\">Continue reading<span class=\"screen-reader-text\"> \"Mai Titi in Bruno’s Secret Chats\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "My Goal Is To Transform Football: Sabelo Maphosa",
            "url": "https://www.zimeye.net/2024/12/29/my-goal-is-to-transform-football-sabelo-maphosa/",
            "content": "Former football referee and CAF referees instructor, Sabelo Maphosa, is eager to bring her extensive experience in football to the ZIFA board. With over two decades in the sport, Maphosa is confident that her background in officiating and leadership will enable her to contribute to the growth and development of Zimbabwean football.\n\nMaphosas journey in football began in 1986 when she started refereeing and progressed to the position of match commissioner. She is now a CAF-certified referees instructor, having gained invaluable knowledge and experience along the way. I have been involved in football for over 20 years and I believe I can offer a lot to the development of the game in Zimbabwe, she said.\n\nA key area Maphosa is passionate about is addressing the lack of Zimbabwean referees in international assignments. She believes this issue needs urgent attention, highlighting that poor officiating has negative effects on the sport, including disappointing sponsors and teams. We need officials who maintain high standards and uphold the rules of the game, free from external influences. The decisions of referees should be final, and good officiating can be achieved by focusing on qualified officials starting at grassroots levels, such as NAPH and NASH, she explained.\n\nThe ZIFA board will elect six members to help shape the future of Zimbabwean football, and Maphosa is eager to play her part in the nations football renaissance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Former football referee and CAF referees’ instructor, Sabelo Maphosa, is eager to bring her extensive experience in football to the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/my-goal-is-to-transform-football-sabelo-maphosa/\">Continue reading<span class=\"screen-reader-text\"> \"My Goal Is To Transform Football: Sabelo Maphosa\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "Economists Dismiss Mthuli Ncube Tax Measures",
            "url": "https://www.zimeye.net/2024/12/29/economists-dismiss-mthuli-ncube-tax-measures/",
            "content": "By A Correspondent\n\nEconomic experts have strongly criticized Finance Minister Mthuli Ncubes latest taxation measures, calling them a desperate attempt by the government to compensate for its past mistakes. These measures, they argue, punish ordinary citizens and could worsen the countrys economic woes.\n\nIs Mnangagwa Shifting Frustrations onto Citizens?\n\nA series of new taxes, announced in the 2025 National Budget presented last month, are set to take effect from January 1, 2025. Among the new taxes, a 1% Fast Foods Tax will be levied on the sales value of fast food items, such as pizzas, burgers, and French fries. The government claims this tax aims to promote healthier eating habits.\n\nIn addition, a 10% withholding tax on gross winnings from sports betting will be implemented starting in January. This move is expected to impact those involved in the growing sector of sports betting in Zimbabwe.\n\nEconomists have expressed concern over the potential negative effects of these new taxes, arguing that they may exacerbate the financial burden on citizens already struggling with inflation and high cost of living.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Economic experts have strongly criticized Finance Minister Mthuli Ncube’s latest taxation measures, calling them a desperate attempt … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/economists-dismiss-mthuli-ncube-tax-measures/\">Continue reading<span class=\"screen-reader-text\"> \"Economists Dismiss Mthuli Ncube Tax Measures\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "Festive Season Road Accidents Claim 77 Lives",
            "url": "https://www.zimeye.net/2024/12/29/festive-season-road-accidents-claim-77-lives/",
            "content": "By A Correspondent\n\nA recent report from the Zimbabwe Republic Police (ZRP) reveals a concerning surge in road fatalities during the festive season.\n\nBetween December 15 and 26, a total of 77 lives were lost in over 1,000 traffic accidents. This period covers significant public holidays, including Christmas and Boxing Day.\n\nAccording to Police spokesperson Commissioner Paul Nyathi, although the number of fatalities increased, the total number of accidents recorded actually declined compared to the same period last year.\n\nThis trend suggests that while efforts to reduce accidents may be yielding results, more needs to be done to prevent fatalities.\n\nIn a similar report last year, the Zimbabwe Republic Police noted a considerable improvement in road safety statistics during the festive season, with a decrease in fatal accidents and casualties.\n\nThe Traffic Safety Council of Zimbabwe also recorded a decline in road accidents, with 38,482 incidents reported between January and September 2023 .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A recent report from the Zimbabwe Republic Police (ZRP) reveals a concerning surge in road fatalities during … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/29/festive-season-road-accidents-claim-77-lives/\">Continue reading<span class=\"screen-reader-text\"> \"Festive Season Road Accidents Claim 77 Lives\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "Ramaphosa Intervenes In Frelimo‘s Stage Managed Chaos",
            "url": "https://www.zimeye.net/2024/12/28/ramaphosa-intervenes-in-mozambique-chaos/",
            "content": "South Africa President Cyril Ramaphosa has dispatched his top envoy, Sydney Mufamadi, to Mozambique as the country grapples with violent protests staged-managed by the Frelimo party following contentious election results.\n\nThe unrest appeared to errupt after Mozambiques Constitutional Council confirmed the ruling FRELIMO partys victory in the October elections despite acknowledging significantelectoralirregularities.\n\nThe ruling revised FRELIMO candidate Daniel Chapos victory margin from 71% to 65%, while opposition candidate Venncio Mondlanes share rose to 24% from 20%.\n\nMondlane denounced the decision as legitimizing election fraud, rejected the results, and called for mass protests.\n\nFrelimo which is following a Mnangagwa-Army-Chaos technique to win elections, triggered chaos across the country by deploying police and army officers who began  causing violence.\n\nSince October 21, over 100 deaths have been reported.\n\nGovernments army engineered fires, barricades, teargas and other destruction have brought parts of the capital to a standstill.\n\nAdding to the turmoil, Mondlane has gone into exile, citing threats to his life following the murders of two close aides.\n\nFrom abroad, he has rallied his supporters to initiate a national shutdown, while calling for peaceful protests.\n\nAlthough details of his meetings remain undisclosed, the envoy reiterated South Africas readiness to support Mozambique during this challenging time.\n\nThe intervention comes as the Southern African Development Community (SADC) also signals its willingness to mediate.\n\nCalls for regional assistance have mounted amid fears that the crisis could destabilize neighbouring countries.\n\nMozambiques post-election unrest highlights the fragility of its political landscape, with the ruling party accused of clinging to power at the expense of democratic processes.\n\nAs protests continue, all eyes are on regional powers like South Africa to broker peace and prevent further bloodshed.\n\nSABC/ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa – President Cyril Ramaphosa has dispatched his top envoy, Sydney Mufamadi, to Mozambique as the country grapples with violent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/ramaphosa-intervenes-in-mozambique-chaos/\">Continue reading<span class=\"screen-reader-text\"> \"Ramaphosa Intervenes In Frelimo‘s Stage Managed Chaos\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "“Hwende Smuggling Mnangagwa Minerals Through Mozambique” | Kerina",
            "url": "https://www.zimeye.net/2024/12/28/hwende-smuggling-mnangagwa-minerals-through-mozambique-kerina/",
            "content": "Charlton Hwendes apparent position as a champion of the opposition belies a more sinister reality. In truth, he is an entrenched collaborator of Emmerson Dambudzo Mnangagwas regime, complicit in the plundering of Zimbabwes resources. The clandestine transportation of looted minerals across the Forbes border into Mozambique, facilitated by Hwendes trucks, constitutes a damning indictment of his culpability.\n\nThis duplicity is further underscored by Hwendes sanctimonious denounciations of the late Ian Smith, even as his ally, Mnangagwa, protects the interests of white farmers in the Midlands, thereby perpetuating the historical injustices inflicted upon Black Zimbabweans. Mnangagwas own tenure has been marred by horrifying corruption, including the expropriation of Precabe Farm from the CIO during his ministerial tenure, and the displacement of indigenous Zimbabweans in Chiredzi and Binga to benefit foreign white interests.\n\nHwendes involvement in the Gold Mafia, characterised by the sneaky smuggling of gold to Dubai and linked money laundering, serves as a stark illustration of his entrenched complicity in Zimbabwes corrupt nexus. The oppositions reliance on individuals of Hwendes ilk, who prioritise personal aggrandisement over the welfare of Zimbabweans, ensures that meaningful change will remain an ephemeral chimera.\n\nThe logical question persists: why does Hwende abstain from accountability for Mnangagwas transgressions? The response is straight forward: Hwende is tied under an obligation to the same corrupt infrastructure that sustains Mnangagwas regime. His links in gold mafia, his trucks contracted to ferry out our looted minerals to the Mozambican ports,surely Hwende sees ED as his Saviour the one that butters his bread at the expense of the masses of Zimbabweans.\n\nUltimately, Zimbabwes prospects for meaningful transformation are determined upon a paradigmatic shift in the oppositions leadership. Until Zimbabweans demand authentic, principled leadership, the nation will continue to languish under the weight of corruption and exploitation. Hwende and his cohorts must be held accountable for their actions, and a new era of transparency and accountability must be ushered in. Hwende you are the last sellout of our generation to even dare criticise those calling out Emmerson Dambudzo Mnangagwa as  worst than Ian Douglas Smith. ED might be your Boss yet to Zimbabweans he is a villain who deserve to be hanged by the pee balls.#edmustgo #sayno2to2030#cdesistermwenewazvo#kerinamujati\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Charlton Hwende’s apparent position as a champion of the opposition belies a more sinister reality. In truth, he is an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/hwende-smuggling-mnangagwa-minerals-through-mozambique-kerina/\">Continue reading<span class=\"screen-reader-text\"> \"“Hwende Smuggling Mnangagwa Minerals Through Mozambique” | Kerina\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        },
        {
            "title": "Mozambique’s Baba Jukwa Speaks on LIVE",
            "url": "https://www.zimeye.net/2024/12/28/frelimo-adopts-zanu-pfs-baba-jukwa-tactics/",
            "content": "RESUMO DA LIVE DO UNAY CAMBUMA\n\n1- O que Venncio Mondlane est fazer, vai ficar na histria do mundo. Como o primeiro homem civil do planeta a derrotar uma ditadura militarizada, sem estar presente no pas, apenas utilizando telefone e internet.\n\n2- Pases do ocidente no ajudam Venncio Mondlane porque no precisam dele, precisam de Nyusi e Chapo, para defender seus interesses, por isso no ajudam Venncio Mondlane\n\n3- No se enganem com as naes unidas, esto todos corrompidos\n\n4- Venncio Mondlane no est apenas lutando com a FRELIMO, est tambm destruindo o colono preto em Moambique.\n\n5- Se Venncio Mondlane destru a FRELIMO, vai mostrar para a frica que  possvel destru ditaduras em frica\n\n6-A unio europeia, SADC, e outras instituies no ajudam Venncio Mondlane porque ele  um lider libertador, eles querem lderes poltica para defenderam seus interesses.\n\n7-As Manifestaes s vo doer para a FRELIMO quando visitarem suas residncias e edifcios.\n\n8- No existe verdade eleitoral, devemos arrancar o poder das mos da FRELIMO.\n\n9- Militarmente o VM7 no tem como vencer a FRELIMO, mas ele tem um poder que  mais forte do que qualquer arma do mundo, que  a unio do povo.\n\n10- No precisamos de internacionais para banir a FRELIMO, nos mesmo podemos banir a FRELIMO, s precisamos colocar VM7 no poder.\n\n11-A luta estava quase no fim, mas ns distramos com politiquises.\n\n12- No existem homens catanas  tudo distrao, o nosso foco deve ser a ponta vermelha.\n\n11- A FRELIMO est varrer as ruas para fazer o mundo pensar que est tudo bem em Moambique.\n\n12- A FRELIMO  manipulador e rei da propaganda enganosa em Moambique.\n\n13- Para ir a ponta vermelha, no devemos ser 100, 1000 ou mesmo 5000. Devemos ser milhes e simultaneamente, outras visitam as televises corrompidas pela FRELIMO, a CC, CNE, Tribunais e aeroportos, para que ningum fuja do pas.\n\n14- No vamos perder tempo com pessoas vestidas roupas da FRELIMO, devemos nos foca\n\nUNAY CAMBUMA LIVE SUMMARY 1- What Venncio Mondlane is doing will go down in world history. As the first civilian man on the planet to defeat a militarized dictatorship, without being present in the country, just using the telephone and internet.\n\n2- Western countries dont help Venncio Mondlane because they dont need him, they need Nyusi and Chapo, to defend their interests, thats why they dont help Venncio Mondlane.\n\n3- Dont be fooled by the united nations, they are all corrupt\n\n4- Venncio Mondlane is not only fighting with FRELIMO, he is also destroying the black settlers in Mozambique.\n\n5- If Venncio Mondlane destroyed FRELIMO, he will show Africa that it is possible to destroy dictatorships in Africa\n\n6-The European Union, SADC, and other institutions do not help Venncio Mondlane because he is a liberating leader, they want political leaders to defend their interests.\n\n7-The Demonstrations will only hurt FRELIMO when they visit their homes and buildings.\n\n8- There is no electoral truth, we must wrest power from the hands of FRELIMO.\n\n9- Militarily, VM7 cannot defeat FRELIMO, but it has a power that is stronger than any weapon in the world, which is the unity of the people.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "RESUMO DA LIVE DO UNAY CAMBUMA 1- O que Venâncio Mondlane está fazer, vai ficar na história do mundo. Como … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/28/frelimo-adopts-zanu-pfs-baba-jukwa-tactics/\">Continue reading<span class=\"screen-reader-text\"> \"Mozambique’s Baba Jukwa Speaks on LIVE\"</span></a></p>",
            "time": "06:09",
            "date": "29 Dec 2024"
        }
    ]
}