{
    "news": [
        {
            "title": "Police Intercept Motor Vehicle Loaded With Mbanje",
            "url": "https://www.zimeye.net/2025/06/06/police-intercept-motor-vehicle-loaded-with-mbanje/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) in Featherstone intercepted a Nissan Note at the 103-kilometre peg along the Harare-Masvingo Road on June 4, 2025, leading to the arrest of 30-year-old Brian Bhobho for unlawful possession of mbanje.\n\nBhobho, who was a passenger in the vehicle, was found with dagga concealed in packaging typically used for 12.5 kilograms of flour.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) in Featherstone intercepted a Nissan Note at the 103-kilometre peg along the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/police-intercept-motor-vehicle-loaded-with-mbanje/\">Continue reading<span class=\"screen-reader-text\"> \"Police Intercept Motor Vehicle Loaded With Mbanje\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Mnangagwa Promotes FAZ Boss, Returns Him To The Barracks",
            "url": "https://www.zimeye.net/2025/06/06/mnangagwa-promotes-faz-boss-returns-him-to-the-barracks/",
            "content": "By A Correspondent | Mnangagwa Promotes FAZ Leader Walter Tapfumaneyi to Major General in Apparent Power Consolidation Move\n\nHarare  6 June 2025\n\nIn a move widely seen as an effort to neutralise growing dissent within ZANU PF ranks and secure his grip on power, President Emmerson Mnangagwa has promoted Brigadier General Asher Walter Tapfumaneyithe architect of the controversial Forever Associates Zimbabwe (FAZ) operationto the rank of Major General.\n\nThe announcement, made during a formal ceremony at Zimbabwe Defence Forces (ZDF) Headquarters on Friday, comes just weeks after Tapfumaneyi was transferred from the Central Intelligence Organisation (CIO) to the Zimbabwe National Army. The rapid elevation has sparked concern over what critics call the deepening militarisation of civilian politics in Zimbabwe.\n\nTapfumaneyi, a long-serving CIO operative and former Deputy Director General of the spy agency, is best known for founding and leading FAZa CIO-linked outfit accused of orchestrating voter intimidation and parallel electoral operations in favour of Mnangagwas controversial 2023 re-election. FAZ operatives were widely deployed across rural Zimbabwe where they allegedly surveilled voters, coerced communities, and undermined the integrity of the vote. The group operated outside of Zimbabwe Electoral Commission (ZEC) oversight and in direct violation of constitutional electoral protocols.\n\nObservers from SADC and the European Union condemned FAZs activities, with reports indicating that its command centres near polling stations compromised vote secrecy and enabled systematic voter coercion in ZANU PF strongholds. Despite the outcry, the government has defended FAZ as a patriotic volunteer group.\n\nNow, Tapfumaneyis promotion to Major General signals a reintegration into the formal military command and a reward for loyalty to the ruling elite.\n\nCongratulations to you, Major General Tapfumaneyi, and welcome back to the ZDF. We are looking forward to working with you, said Commander of the Defence Forces General Philip Valerio Sibanda at the investiture ceremony.\n\nIn his remarks, Tapfumaneyi thanked President Mnangagwa for the promotion, pledging loyalty to both the Commander and the Presidents national security objectives.I am determined and committed to supporting the Presidents vision and the Commanders plan in defence of this country and making sure the country remains secure. I want to thank His Excellency for promoting me, he said.\n\nTapfumaneyi has previously served as Permanent Secretary in the Ministry of Veterans of the Liberation Struggle Affairs and played a central role in ZANU PFs post-2017 repressive election machinery.\n\nAnalysts view the promotion as a strategic countermeasure against internal threats, including what some sources describe as a Blessed Geza insurgencya reference to growing discontent within the ruling party from elements believed to be aligned with sidelined war veterans and anti-Mnangagwa factions.\n\nMnangagwa is reinforcing his inner circle with trusted operatives embedded in security organs. Tapfumaneyis rise is no coincidenceits a clear message that loyalty to the party leader will be rewarded with institutional power, said one security analyst who spoke on condition of anonymity.\n\nSince 1980, the ruling party has relied heavily on the military and intelligence arms to retain power, a trend that escalated during the 2008 elections and was cemented by the 2017 military-assisted transition that ousted Robert Mugabe. The 2018 and 2023 elections further entrenched the fusion of party and state, with the army and intelligence agencies playing increasingly direct roles in political affairs.\n\nWith this latest promotion, Mnangagwa appears intent on shielding his presidency from both internal and external threatsensuring that the command structures of the military remain firmly in the hands of loyalists at a time of mounting social, economic, and political discontent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Mnangagwa Promotes FAZ Leader Walter Tapfumaneyi to Major General in Apparent Power Consolidation Move Harare – … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/mnangagwa-promotes-faz-boss-returns-him-to-the-barracks/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Promotes FAZ Boss, Returns Him To The Barracks\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Pupils involved in a fatal road accident in Bulawayo",
            "url": "https://www.zimeye.net/2025/06/06/pupils-involved-in-a-fatal-road-accident-in-bulawayo/",
            "content": "The Zimbabwe Republic Police have attended to a fatal road traffic accident which occurred along Luveve road near Machipisini Shops in Bulawayo where a female juvenile aged 16 years of Mpopoma died on the spot while her friend also a female juvenile aged 17 years sustained fractured legs. Both are students at a local school doing form 3.\n\nIn a press statement, ZRP Inspector Nomalanga Msebele, Press and Public Relations Officer for Bulawayo Province disclosed that on the 6th of June 2025, at around 0730hours a male adult aged 36 years of Cowdray Park, Bulawayo, was driving a white Toyota Hiace along Luveve road due East with 18 passengers on board. He lost control of the vehicle and it veered off to the left side of the road and hit two female juvenile pedestrians who were standing on the roadside at a distance of approximately 20 meters from the road.She said that as a result of the accident, the driver did not sustain any injury however, the now deceased sustained head injuries and died on the spot whilst the other juvenile sustained fractured legs. An ambulance was summoned and it ferried the injured juvenile to Mpilo hospital for treatment and her condition is stable.\n\nThe cause of the accident is suspected to be over speeding hence a charge of CULPABLE HOMICIDE has been preferred against the driver, said Msebele in a statement.\n\nPolice have urged motorists to exercise due care, avoid over speeding, be patient on roads and to always follow road traffic regulations so as to avoid loss of lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Zimbabwe Republic Police have attended to a fatal road traffic accident which occurred along Luveve road near Machipisini Shops … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/pupils-involved-in-a-fatal-road-accident-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Pupils involved in a fatal road accident in Bulawayo\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Lamine Yamal Shines as Spain Edge France 5-4 in Nations League Thriller",
            "url": "https://www.zimeye.net/2025/06/06/lamine-yamal-shines-as-spain-edge-france-5-4-in-nations-league-thriller/",
            "content": "Sports Correspondent\n\nSpain delivered a captivating 54 win over France in the Nations League semifinal, driven by a sensational performance from 17yearoldLamine Yamal.\n\nDespite early dominance from France, Spain struck first.Nico Williamsopened the scoring in the 22nd minute, followed by a composed finish fromMikelMerinojust three minutes later, giving Spain a commanding 20 lead at halftime.\n\nThe narrative shifted in the second half when Yamal entered the spotlight. In the 54th minute, he calmly converted a penalty  becoming the youngest goalscorer in a Nations League semifinal at 17. Just four minutes later,Pedriadded another, and Yamal struck again in the 67th minute, extending Spains lead to an astonishing 50.\n\nFrance responded with intensity.Kylian Mbapppulled one back from the penalty spot in the 59th minute,Rayan Cherkiunleashed a stunning volley in the 79th minute, and Spains lead was further cut whenDani Vivianscored an own goal in the 84th. EvenRandal Kolo Muanifound the net in stoppage time to make it 54, but Spain held on.\n\nYamals two-goal brace not only made history but also reaffirmed his status as one of footballs brightest prospects. Spain now advances to the final, while fans buzz over the extraordinary talent of this 17yearold sensation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Spain delivered a captivating 5‑4 win over France in the Nations League semifinal, driven by a sensational performance … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/lamine-yamal-shines-as-spain-edge-france-5-4-in-nations-league-thriller/\">Continue reading<span class=\"screen-reader-text\"> \"Lamine Yamal Shines as Spain Edge France 5-4 in Nations League Thriller\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Gukurahundi Genocide awareness meetings poorly attended",
            "url": "https://www.zimeye.net/2025/06/06/gukurahundi-genocide-awareness-meetings-poorly-attended/",
            "content": "The Gukurahundi Genocide awareness campaigns that kicked off last month in Matabeleland North and South are poorly attended.A close source to ZimEye revealed that most of the awareness meetings that he has conducted under his jurisdiction are poorly attended.\n\nl can confirm to you that all the meetings are poorly attended and the Gukurahundi Genocide survivors have called on the perpetrator who is the lead in this project to apologize and come in person not through Traditional leadership.\n\nl believe that the message has reached home since the perpetrator has his agents amongst the team that is part of the awareness outreach participants, Source said.\n\nThe Gukurahundi Genocide outreach program seeks to address long standing issues storming from the post-independence genocide that occurred in Matabeleland and part of Midlands during the 1980s widely known as Gukurahundi Genocide.The campaign aims to foster dialogue, promote healing and pave the way to the national reconciliation.\n\nHowever, the Gukurahundi Genocide survivors have criticized the process saying it lacks the fundamental legal frameworks and international standards of national healing and reconciliation.\n\nA lawyer, Sindiao Mazibisa has described the Gukurahundi Genocide outreach program as masese.\n\nThis is a masese set up as the perpetrator is setting the agenda that is not legally backed with no legal framework to set the tone and agenda.said Mazibisa.\n\nA Villager under Chief Masuku in Matopo . Nkululeko Mlotshwa in an interview disclosed that in his Ward they are scheduled to have an awareness meeting on the 16th of June.Chief Masuku has called on for a meeting on the 16th. I will attend the meeting but not whole heartedly because the perpetrator is still in power and he is yet to acknowledge that he participated fully in butchering innocent souls under a political and military planned agenda, said Mlotshwa.Ibhetshu LikaZulu secretary general. Mbuso Fuzwayo in an interview said if a Chief calls for a meeting, his subjects will attend but fear to express their views.We all know the traditional command that our Chiefs have though constitutionally they are not empowered to preside over murder and genocide in Zimbabwe.He added that the Speaker of Parliament, Jacob Mudenda was clear on the outcome of the outreach that its publication will depend on President Emmerson Dambudzo Mnangagwa who is the Chief Perpetrator on Gukurahundi Genocide in the Government of Zimbabwe when he was the Minister of State at the time when the genocide was committed in the 1980s.In an interview with the Sunday Mail last month, Attorney-General, Virginia Mabiza who also heads the Secretariat of the Peace Building Outreach program said that the awareness campaigns in Matabeleland North and South excluding Midlands are designed to educate communities about the objectives of the outreach program.Gukurahundi Genocide Survivors have critiqued the involvement of the lead perpetrator in the program and Traditional Leaders who are not constitutionally mandated to preside over murder and genocide cases such as Gukurahundi Genocide.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Gukurahundi Genocide awareness campaigns that kicked off last month in Matabeleland North and South are poorly attended.A close source … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/gukurahundi-genocide-awareness-meetings-poorly-attended/\">Continue reading<span class=\"screen-reader-text\"> \"Gukurahundi Genocide awareness meetings poorly attended\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Liverpool Retain Zimbabwean Duo for 2025/26 Season",
            "url": "https://www.zimeye.net/2025/06/06/liverpool-retain-zimbabwean-duo-for-2025-26-season/",
            "content": "By Sports Correspondent\n\nLiverpool Football Club has confirmed the retention of two promising Zimbabwean talents, Isaac Mabaya and Trey Nyoni, for the upcoming 2025/26 season. Both players have shown significant potential and have been integral to the clubs development.\n\nIsaac Mabaya, 20, made his senior debut for Liverpool in February 2025 during the FA Cup fourth-round match against Plymouth Argyle. Although he has primarily featured for the U21s, his breakthrough moment showcases his capabilities and dedication. Mabayas progress will be closely watched as he looks to cement his place in the senior squad.\n\nTrey Nyoni, who signed a new contract in October 2024, has already made a notable impact. He made his full debut for Liverpool in the Carabao Cup quarter-final against Southampton in December. Under both Arne Slot and former coach Jrgen Klopp, Nyoni has earned several squad appearances, demonstrating his versatility and talent as a midfielder.\n\nBoth players were not among the seven academy players released by Liverpool, ensuring they will continue to develop their skills and contribute to the clubs future success. With their retention, Liverpool fans can look forward to seeing these talented young players grow and potentially make significant contributions to the first team.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Liverpool Football Club has confirmed the retention of two promising Zimbabwean talents, Isaac Mabaya and Trey Nyoni, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/liverpool-retain-zimbabwean-duo-for-2025-26-season/\">Continue reading<span class=\"screen-reader-text\"> \"Liverpool Retain Zimbabwean Duo for 2025/26 Season\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Chief Ndube of lnsiza has died",
            "url": "https://www.zimeye.net/2025/06/06/chief-ndube-of-lnsiza-has-died/",
            "content": "Chief Ndube of lnsiza has died.\n\nShe was 40.\n\nBorn Nonhlanhla Sibanda, she was installed as Chief Ndube in 2007 after the death of her father Andrew Sibanda in 2001.Acting director of Local government Mr Jusa Zachariah confirmed the demise of the traditional leader.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chief Ndube of lnsiza has died. She was 40. Born Nonhlanhla Sibanda, she was installed as Chief Ndube in 2007 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/chief-ndube-of-lnsiza-has-died/\">Continue reading<span class=\"screen-reader-text\"> \"Chief Ndube of lnsiza has died\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Police Fold Hands As Zanu PF Hooligans Disconnect WiFi Installed By Independent Candidate Gonese In Gutu East",
            "url": "https://www.zimeye.net/2025/06/06/police-fold-hands-as-zanu-pf-hooligans-disconnect-wifi-installed-by-independent-candidate-gonese-in-gutu-east/",
            "content": "By A Correspondent\n\nJust a few days before the 14 June Gutu East by-election, independent candidate Gift Gonese has raised alarm over a disturbing pattern of intimidation, vandalism, and harassment by suspected Zanu PF supporterswith police allegedly turning a blind eye to the lawlessness.\n\nAt the centre of the controversy is the destruction of free WiFi hotspots installed by Gonese as part of his campaign outreach.\n\nAccording to the candidate, local shop owners were forced to disconnect the WiFi under threat of arson by Zanu PF activists.\n\nYes, we received reports from shop owners where we installed free WiFi hotspots that they were asked to disconnect our WiFi by Zanu PF, threatening to burn down their shops and houses if they refused, Gonese said on Monday.\n\nHe further alleged that his campaign posters are being systematically removed and destroyed in broad daylight, often just before Zanu PF rallies.\n\nHe singled out one such incident on Sunday, ahead of a rally addressed by senior Zanu PF figures including National Political Commissar Munyaradzi Muchacha, Secretary for Security Lovemore Matuke, and State Minister Ezra Chadzamira.\n\nThey are threatening our supporters with unspecified action if they vote for us, Gonese added.\n\nThey are also destroying and tearing down our posters in broad daylight.\n\nMultiple sources within Gutu East confirmed that Zanu PF-aligned groups are actively disrupting Goneses campaign activitieswith no response or intervention from the police despite repeated complaints.\n\nResidents and campaign aides describe a climate of fear, where village heads are reportedly being used to coerce communities into voting for Zanu PF.\n\nThey are ordering traditional leaders to marshal people to the polling stations and ensure they are assisted to vote. This is nothing short of electoral coercion, said one source who asked to remain anonymous for safety reasons.\n\nThe lack of police intervention in the face of these blatant electoral violations has sparked outrage.\n\nPolice in Gutu East are not just silenttheyre complicit through inaction, said a local human rights monitor.\n\nWe are witnessing the weaponisation of fear, with state institutions either captured or paralysed.\n\nAs the by-election nears, pressure is mounting on the Zimbabwe Republic Police (ZRP) to explain its failure to uphold electoral laws and protect all candidates and voters equally.\n\nMeanwhile, Gonese insists he will not be intimidated:We will not stop. Were offering people real change, and no amount of thuggery will silence us.\n\nWith just days to go, the Gutu East by-election has become a test not just of political popularitybut of the integrity of Zimbabwes electoral and law enforcement institutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Just a few days before the 14 June Gutu East by-election, independent candidate Gift Gonese has raised … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/police-fold-hands-as-zanu-pf-hooligans-disconnect-wifi-installed-by-independent-candidate-gonese-in-gutu-east/\">Continue reading<span class=\"screen-reader-text\"> \"Police Fold Hands As Zanu PF Hooligans Disconnect WiFi Installed By Independent Candidate Gonese In Gutu East\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Zimbabwe Turns to Belarus for Milk as Local Agriculture Crumbles",
            "url": "https://www.zimeye.net/2025/06/06/zimbabwe-turns-to-belarus-for-milk-as-local-agriculture-crumbles/",
            "content": "By Tinashe Sambiri\n\nIn a move that underscores the dramatic collapse of Zimbabwes once-thriving agricultural sector, the Zimbabwean government has announced plans to import milk, sunflower oil, and agricultural machinery from Belarus  a decision critics say signals the countrys failure to restore self-sufficiency decades after the violent land reform program.\n\nThe announcement was made by Deputy Minister of Lands, Agriculture, Fisheries, Water, and Rural Development, Vangelis Haritatos, during an official visit to Belarus for the Belagro 2025 international exhibition. Zimbabwes milk demand is estimated at 130 million litres per year, and we currently produce 120 million litres, Haritatos told Belarusian Agriculture Minister Yuri Gorlov. We are interested in ramping up the output of this product. We also want to buy sunflower oil and agricultural machinery.\n\nHowever, critics argue that the need to import such basic commodities is a direct consequence of decades of misguided and chaotic agricultural policies. Zimbabwe, once lauded as the breadbasket of Africa, has suffered a steady decline in agricultural productivity since the early 2000s following the violent and racially charged land reform campaign known as hondo yeminda.\n\nThe ZANU-PF-led land seizures displaced thousands of white commercial farmers, many of whom had generations of expertise in large-scale agriculture. Hundreds were killed or forced into exile, and millions of hectares of productive farmland fell into disuse or were handed over to politically connected elites with no agricultural background.\n\nThe irony is staggering, says agricultural economist Tendai Moyo. We chased away people who knew how to farm, and now were going halfway across the world to buy milk. Its not just a policy failure  its a national tragedy.\n\nDespite Haritatos claims that Belarusian machinery has helped dramatically increase agricultural productivity, data from Zimbabwes own Ministry of Agriculture shows continued shortfalls in key commodities like maize, wheat, and dairy products. Critics say that importing machinery is a stopgap solution that does not address the root causes of underperformance, such as lack of investment in farmer training, inconsistent government support, and corruption in land allocation.\n\nThis isnt a partnership of equals  its a band-aid over a self-inflicted wound, says human rights activist Ruvimbo Chitiga. We cant import our way out of bad governance.\n\nWhile the Belarusian partnership may offer short-term relief, many Zimbabweans are left wondering whether their government will ever make the hard decisions necessary to rebuild the agricultural backbone that once fed the region.\n\nAs Zimbabwe ships in milk and machinery from Eastern Europe, the image of a nation that once exported food to its neighbors has faded into memory  replaced by empty silos, idle land, and a growing reliance on foreign aid and imports.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri In a move that underscores the dramatic collapse of Zimbabwe’s once-thriving agricultural sector, the Zimbabwean government has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/zimbabwe-turns-to-belarus-for-milk-as-local-agriculture-crumbles/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Turns to Belarus for Milk as Local Agriculture Crumbles\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        },
        {
            "title": "Chipinge Villagers Demand Justice Over Brutal Assault of Schoolgirls By Green Fuel Security",
            "url": "https://www.zimeye.net/2025/06/06/chipinge-villagers-demand-justice-over-brutal-assault-of-schoolgirls-by-green-fuel-security/",
            "content": "By A Correspondent Chipinge villagers are challenging  Greenfuel to apologise following viral videos of security guards beating helpless female pupils in Chisumbanje.\n\nIn a fortnight of rage and outpouring of public anger, the local communities in and around Chisumbanje Ethanol project, bombarded the premises for the Platform for Youth and Community Development to seek decisive action against Greenfuel Pvt for failure to take responsibility over their unrestrained security guards for excoriating vulnerable girls through excessive beating.\n\nThe public has also turned to social media platforms like WhatsApp and Facebook to express their anger and disdain.\n\nDespite the fact that the two security guards in question (Makina and Komondeya) were subsequently arrested by Chisumbanje police and later charged by Nixon Mangoti at Chipinge Magistrate Court to undergo 280 hours of community service, the local community feel this is not enough.\n\nOnly a public statement from the stubborn Green Fuel company will douse their anger.\n\nMr Claris Madhuku, who is the Director and Team Leader for the Platform for Youth and Community Development (PYCD), expressed worry that this behaviour by Green Fuels security guards was not improving and has been like that for over a decade.\n\nWhile speaking at a live interview hosted by a local community radio Vemuganga FM 106.8, Mr Madhuku said:\n\nPYCD has documented the human rights abuses instigated by Green Fuel security guards since 2009 and can confirm that there are over 10 incidences of unpalatable behaviour that has resulted in loss of life, injury and damage of properties due to the unrestrained behaviour of Green Fuel security guards. I vividly remember that in 2016, one of the Green Fuel security guards Borniface Shungwa (47) shot three (3) villagers and killed one (1) on the allegations these villagers stole sugarcane, Madhuku said.\n\nFor me, it is about the training, orientation and safeguarding issues that must be addressed by Green Fuel, Madhuku added.\n\nDuring the community radio live programme, Mr Owen Dhliwayo, who is a communications and media advocate, voiced out that Green Fuel needed to work hard on its public image to respond to the public outcry of this nature. The local community has harboured a perception that Green Fuel was always operating above the law, therefore fears no consequence from the local community.\n\nBy virtue of having a juristic personality, Green Fuel is liable and should be held accountable to the disgraceful action of its personnel, and has to issue a public apology that shows genuine remorse over the incident, Owen Dhliwayo explained.\n\nMembers of the local community, including those in the diaspora, vented their anger through social media to demand action against Green Fuel should there be no issuance of public apology. The public is citing cases of Green Fuel drivers who are involved in accidents with local community members. The company is accused of poor public relations during accidents and altercations with the local community, preferring to abandon their employees to face the wrath of the community alone.\n\nTonderai Nikisi, a local community member, contributed to the discussion by warning Green Fuel of bigger consequences if there was no apology.\n\nIt is high time something must be done at Green Fuel uuum this is unfair, we are now back to colonial era. People taking justice into their own hands, Tonderai wrote.\n\nThrough his articles, Artwel Chingwara Sithole of Rimbi village described the behaviour by Green Fuel security guards as wanton, disgusting and unacceptable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Chipinge villagers are challenging Greenfuel to apologise following viral videos of security guards beating helpless female pupils … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/06/chipinge-villagers-demand-justice-over-brutal-assault-of-schoolgirls-by-green-fuel-security/\">Continue reading<span class=\"screen-reader-text\"> \"Chipinge Villagers Demand Justice Over Brutal Assault of Schoolgirls By Green Fuel Security\"</span></a></p>",
            "time": "06:42",
            "date": "07 Jun 2025"
        }
    ]
}