{
    "news": [
        {
            "title": "Zvigananda Rubbishes VP Chiwenga",
            "url": "https://www.zimeye.net/2025/09/28/zvigananda-rubbishes-vp-chiwenga/",
            "content": "By A Correspondent ZANU PFs factional wars took centre stage this week afterPaul Tungwarara, one of President Emmerson Mnangagwas campaign point men, openly defied Vice President Constantino Chiwenga by funding parallel ZANU PF structures designed to weaken the generals influence.\n\nTungwarara, Mnangagwas Presidential Investment Advisor, splashedmore than US$200,000on eight ZANU PF affiliate organisations in Mashonaland West through thePresidential Empowerment Fund.\n\nThe money, officially branded as empowerment, is widely seen as part of Mnangagwas broader strategy to build loyalty ahead of 2026 and pave the way for his stay in office beyond 2028.\n\nBeneficiaries includedVaPostori for EDandChildren of War Veterans(US$50,000 each), while six others  among themPastors for ED, Vendors 4 ED, Boyz dza Mdara and Health Ambassadors for ED each received US$20,000.\n\nWhile Tungwarara framed the initiative as part of Mnangagwas Vision 2030 agenda, insiders say the real aim is to entrench Mnangagwas grip on power at the expense of Chiwenga, who has repeatedly complained about the rise of shadowy campaign structures outside the party constitution.\n\nMnangagwas camp has aggressively deployedhashtags and mantrasto sustain his rule beyond constitutional limits. Phrases like#ED2030, #Vision2030, #NyikaInovakwaNeveneVayo (the country is built by its own people), and #LeavingNoOneBehindhave been turned into rallying cries across social media, rallies, and state media.\n\nThese hashtags are amplified daily by ZANU PF affiliates, youth leagues, and state-sponsored influencers, projecting Mnangagwa as the indispensable builder of the nation.\n\nBy constantly framing governance in the language of long-term goals  Vision 2030 being the anchor  Mnangagwas strategists are shifting public discourse to normalise his continued rule well beyond 2028.\n\nCritics say this amounts tohashtag politics masking authoritarian entrenchment, where propaganda slogans replace real accountability.\n\nChiwenga has publicly  mocked these groups and their sponsors asZvigananda corrupt bootlickers enriching themselves under the cover of Mnangagwas mantras.\n\nPaul Tungwarara has become the public face of Mnangagwas empowerment drive.\n\nHis carefully choreographed empowerment shows mirror the style ofKuda Tagwirei, Wicknell Chivayoand other Mnangagwa loyalists who distribute cash, cars, and projects in Mnangagwas name.\n\nZvigananda, despite being tainted by corruption scandals, have remained close to Mnangagwa and instrumental in creating affiliate groups such asMen BelievED, Young Women for ED, Pastors 4 ED, and Mahwindi for ED.\n\nThese outfits mushroomed just before  the 2023 elections, soaking up state funds and crowding out traditional ZANU PF structures like the war veterans, which Chiwenga has historically leaned on.\n\nools, hospitals, and councils remain cash-strapped? And how sustainable is a revolving fund tied to political loyalty rather than transparent national policy?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – ZANU PF’s factional wars took centre stage this week after Paul Tungwarara, one of President Emmerson Mnangagwa’s campaign … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/zvigananda-rubbishes-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Zvigananda Rubbishes VP Chiwenga\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "Madam Boss Ducks Cameras at Harare Court",
            "url": "https://www.zimeye.net/2025/09/28/madam-boss-ducks-cameras-at-harare-court/",
            "content": "By Showbiz Reporter  Popular comedian and socialite Madam Boss, real name Tarisai Cleopatra Chikocho, was on Friday spotted at the Harare Magistrates Court where she was scheduled to testify in the ongoing fraud trial linked to the controversial E-Creator Ponzi scheme.\n\nMadam Boss, dressed in black, appeared alongside her associate Admire Mushambi  popularly known as Mama Vee  who was clad in a brown golf tee. The two were seen hastily leaving the court premises while attempting to avoid cameras from the press and curious onlookers.\n\nTheir appearance is tied to the trial of suspects accused of masterminding the E-Creator scandal, one of the biggest online fraud cases to rock Zimbabwe in recent years.\n\nThe scheme, which lured thousands of unsuspecting citizens with promises of lucrative returns through online investments, collapsed spectacularly in 2023, leaving many people counting their losses.\n\nE-Creator operated under the guise of a legitimate digital marketing and online services company but was later exposed as a classic Ponzi scheme.\n\nAt its peak, it attracted thousands of clients, mainly the unemployed, low-income earners, and young people desperate for quick money.\n\nWhen the scheme inevitably crumbled, victims accused social media influencers and celebrities  including Madam Boss and Mama Vee  of having promoted or associated themselves with the scheme, thereby lending it a false aura of credibility.\n\nAlthough the two entertainers have consistently denied any wrongdoing, they were summoned to testify as witnesses in the fraud case to clarify their role and relationship, if any, with the schemes operators.\n\nHowever, proceedings were once again postponed on Friday after the presiding magistrate indicated that a Chinese interpreter was not available.\n\nThis delay is significant given that one of the key accused persons in the matter is a Chinese national alleged to have orchestrated the multi-million-dollar fraud. The case has now been rescheduled to October 10.\n\nLegal experts say the trial will be closely watched not only for the potential justice it may bring to thousands of defrauded Zimbabweans but also for its implications on the accountability of social media personalities who endorse or promote financial schemes without due diligence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Popular comedian and socialite Madam Boss, real name Tarisai Cleopatra Chikocho, was on Friday spotted at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/madam-boss-ducks-cameras-at-harare-court/\">Continue reading<span class=\"screen-reader-text\"> \"Madam Boss Ducks Cameras at Harare Court\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "ZBC Presenter Dies",
            "url": "https://www.zimeye.net/2025/09/28/zbc-presenter-dies/",
            "content": "By A Correspondent Zimbabwe Broadcasting Corporation (ZBC) Producer and Presenter,Tinovimbanashe Tino Butu, has died.\n\nTino, as she was affectionately known, passed away on Friday in Harare after a courageous battle with cancer. She was 41.\n\nColleagues described her as a trailblazer who mentored many young journalists during her career, combining professionalism with a warm, mentoring spirit.\n\nShe was the daughter ofKillian Butu, a veteran broadcaster who defined Zimbabwes airwaves from the 1980s through the early 2000s.\n\nKillian was one of the most recognisable voices on Radio 2 (now Radio Zimbabwe), hosting popular programmes that entertained and informed a nation in its formative post-independence years.\n\nHis distinctive style and commanding voice made him a household name and an inspiration for younger presenters, including his daughter.\n\nBut Killians later years also exposed the darker side of working for ZBC.\n\nAfter decades of loyal service, he fell on hard times, struggling to make ends meet after leaving the corporation.\n\nHe was recently forced to publicly appeal to businessmanWicknell Chivayo, asking for money to start a poultry project and later for a car to restore some dignity to his life.\n\nChivayos assistance, which he broadcast on social media (video link here), was celebrated by some but widely condemned as a humiliating reminder of how ZBC neglects both its current and former employees.\n\nThis neglect is part of a broader pattern.\n\nZBC, once seen as the pride of national broadcasting, has for years been plagued by financial instability, late salaries, poor medical cover, and lack of pensions or welfare schemes for staff.\n\nBroadcasters who built the institutions legacy have often been left vulnerable, their contributions forgotten until tragedy strikes.\n\nColleagues point out that Tino, despite her dedication and years of service, also had to endure her illness without meaningful institutional support.\n\nTinos career reflected her resilience and versatility in such a difficult environment.\n\nShe joined ZBC in mid 2008 as a sub-editor on the Radio English Desk before transferring to the then Voice of Zimbabwe in Gweru, where she worked as a producer.\n\nShe later moved to Montrose Studios in Bulawayo under the News and Current Affairs Department.\n\nA year later, she returned to Pockets Hill Studios in Harare, where she served with distinction as both sub-editor and presenter until her final days.\n\nShe rose to prominence in the early 2010s as a dynamic radio personality before transitioning into television, where she became well known for her sharp interviews and commanding on-screen presence. She had a unique ability to connect with audiences across generations, and her voice became a trusted companion in many homes, said one fellow broadcaster.\n\nBeyond journalism, Tino was also active in charity work, championing literacy programmes for disadvantaged children. Friends and colleagues remember her as a selfless professional who balanced her media career with community service.\n\nShe is survived by her two daughters,Anesu and Mutsa.\n\nMourners are gathered at Number 8 Derbyshire, Waterfalls, Harare. Burial arrangements will be announced in due course.\n\nTinos passing, following her father Killians humiliating struggles in his later years, has reignited criticism of ZBCs treatment of its workers  a broadcaster that demands loyalty but has repeatedly abandoned those who give it their lives and talent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe Broadcasting Corporation (ZBC) Producer and Presenter, Tinovimbanashe “Tino” Butu, has died. Tino, as she was affectionately known, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/zbc-presenter-dies/\">Continue reading<span class=\"screen-reader-text\"> \"ZBC Presenter Dies\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "Unlicensed Driver Sentenced To 12 Months In Jail for Crash That Cost Victim a Leg…",
            "url": "https://www.zimeye.net/2025/09/28/unlicensed-driver-sentenced-to-12-months-in-jail-for-crash-that-cost-victim-a-leg/",
            "content": "By A Correspondent\n\nA 45-year-old Banket man, Tamuka Gweshe, has been jailed by the Chinhoyi Magistrates Court after causing a serious road accident while driving without a licence.\n\nOn July 21, 2024, at around 9:20 a.m., Gweshe drove negligently and collided head-on with a motorcyclist at the 18km peg along the BanketTrelawney Road. He fled the scene, abandoning the injured victim, who later had his leg amputated due to the severity of the injuries sustained.\n\nThe court handed down the following sentence:\n\nCount One: Driving without a licence  12 months in prison, with 6 months suspended for 5 years.\n\nCount Two: Negligent driving  12 months in prison, with 6 months suspended for 5 years.\n\nGweshe will serve an effective 12-month jail term.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 45-year-old Banket man, Tamuka Gweshe, has been jailed by the Chinhoyi Magistrates’ Court after causing a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/unlicensed-driver-sentenced-to-12-months-in-jail-for-crash-that-cost-victim-a-leg/\">Continue reading<span class=\"screen-reader-text\"> \"Unlicensed Driver Sentenced To 12 Months In Jail for Crash That Cost Victim a Leg…\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "No Mercy for Corrupt Officials, Chiwenga Declares in Masvingo",
            "url": "https://www.zimeye.net/2025/09/28/no-mercy-for-corrupt-officials-chiwenga-declares-in-masvingo/",
            "content": "By A Correspondent\n\nMASVINGO  Vice President General (Rtd) Dr Constantino Chiwenga delivered a blistering address on Thursday, condemning corruption and unethical practices that he said threaten Zimbabwes development and economic progress.\n\nSpeaking at the official opening of the Construction Industry Federation of Zimbabwe (CIFOZ) Annual Congress at a Masvingo hotel, VP Chiwenga did not mince words.\n\nWe cannot and will not tolerate corruption, tender manipulation or unethical dealings that undermine confidence and compromise delivery, he declared, sending a clear warning to business leaders and public officials alike.\n\nThe Vice President emphasized the role of integrity in building sustainable economies. You will agree with me that all thriving economies the world over were built through sacrifice, honesty and hard work, he said.\n\nChiwenga further highlighted the far-reaching consequences of unethical conduct, noting that it erodes public trust and damages reputations. It is common cause that unethical dealings result in public outrage and diminished consumer confidence, which can significantly harm the reputation of companies and individuals, ultimately affecting future business opportunities and national development, he added.\n\nThe VPs speech comes at a time when Zimbabwe is intensifying efforts to enhance transparency and accountability across both public and private sectors.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO – Vice President General (Rtd) Dr Constantino Chiwenga delivered a blistering address on Thursday, condemning corruption … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/no-mercy-for-corrupt-officials-chiwenga-declares-in-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"No Mercy for Corrupt Officials, Chiwenga Declares in Masvingo\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "Chiwenga Confronts Corruption: A Lone Voice in ZANU-PF’s Inner Circle",
            "url": "https://www.zimeye.net/2025/09/27/chiwenga-confronts-corruption-a-lone-voice-in-zanu-pfs-inner-circle/",
            "content": "By Shelton Muchena In England\n\nVice President Constantino Chiwenga has emerged as the only senior ZANU-PF official willing to confront President Emmerson Mnangagwa over corruption, insiders have revealed.\n\nThe former general, who played a decisive role in the 2017 transition by reading the constitution to then-president Robert Mugabe, is once again positioning himself as a defender of the law and the people. This time, however, his battle is against a more entrenched adversary corruption.\n\nAccording to sources close to the government, Chiwenga has repeatedly warned that the cancer of graft is eroding Zimbabwes economy, discouraging investment, and destroying public trust. He has urged the president to act decisively against corrupt officials within the ruling elite.\n\nAnalysts argue that Chiwengas stance is unique in a political environment where speaking against corruption can isolate even the most powerful figures. It is significant because he is taking a stand inside the party, not outside it, said one Harare-based political scientist.\n\nWith the economy struggling, Chiwengas anti-corruption crusade could resonate with ordinary citizens who have long borne the cost of mismanagement and graft. Whether his words will translate into lasting change remains uncertain, but his boldness has reignited the national conversation on accountability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena In England | Comment | Vice President Constantino Chiwenga has emerged as the only senior ZANU-PF official … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/chiwenga-confronts-corruption-a-lone-voice-in-zanu-pfs-inner-circle/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Confronts Corruption: A Lone Voice in ZANU-PF’s Inner Circle\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "Veteran Broadcaster Dies",
            "url": "https://www.zimeye.net/2025/09/27/veteran-broadcaster-dies-5/",
            "content": "By A Correspondent\n\nThe local media fraternity has lost one of its pioneers following the death of veteran broadcaster Tinovimbanashe Butu, who collapsed at her Harare home on Friday evening. She was 41.\n\nColleagues described her as a trailblazer who mentored many young journalists during her career. Butu rose to prominence in the early 2010s as a dynamic radio personality before transitioning into television, where she became well known for her sharp interviews and commanding presence.\n\nShe had a unique ability to connect with audiences across generations, and her voice became a trusted companion in many homes, said one fellow broadcaster.\n\nBeyond journalism, Butu was actively involved in charity work, championing literacy programmes for disadvantaged children. Friends recall her as a selfless figure who balanced professional excellence with community service.\n\nShe leaves behind two daughters. Family representatives said funeral arrangements will be announced once consultations are complete.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The local media fraternity has lost one of its pioneers following the death of veteran broadcaster Tinovimbanashe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/veteran-broadcaster-dies-5/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran Broadcaster Dies\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "Green Dollar Coin UK, CAPS United Seal $4.3 Million Mega Sponsorship Deal…",
            "url": "https://www.zimeye.net/2025/09/27/green-dollar-coin-uk-caps-united-seal-4-3-million-mega-sponsorship-deal/",
            "content": "By Sports Correspondent\n\nHarare giants CAPS United Football Club have landed a massive boost after unveiling a US$4.3 million sponsorship deal with Green Dollar Coin UK in the capital on Friday.\n\nThe multi-year partnership marks one of the biggest financial commitments to Zimbabwean football in recent years and is expected to ease the clubs financial burden while promoting long-term development.\n\nSpeaking at the unveiling ceremony, Noel Mavura, president of Green Dollar Development Bank, described the partnership as a step towards both sporting and economic empowerment.\n\nWe are happy to unveil this US$4.3 million partnership deal, which we believe will go a long way in terms of football development. CAPS United is a big institution, and we are proud to set up this funding partnership with them, said Mavura.\n\nHe added that the initiative goes beyond football, noting:\n\nWe have a mandate to empower African minds with key financial solutions. The Green Dollar Coin is not only an investment but also an empowerment initiative for Zimbabwe and Africa. We are confident this partnership will uplift both the game of football and the broader community.\n\nCAPS United president Farai Jere praised Green Dollar Coin for committing to the club at a time when local football is battling for survival.\n\nI would like to thank Green Dollar Coin for coming up with this noble initiative. This is not just a sponsorship deal, but a true partnership. Football is a great unifier, and Green Dollar Coin has made a significant stride towards football development, Jere said.\n\nHe added that the deal reflects renewed corporate trust in Zimbabwean football:\n\nThis shows that the corporate world is once again showing confidence in local football, and we hope more companies will follow this example.\n\nThe sponsorship package is expected to cover player welfare, infrastructure development, and club operations, giving CAPS United a competitive edge both locally and on the continental stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Harare giants CAPS United Football Club have landed a massive boost after unveiling a US$4.3 million sponsorship … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/green-dollar-coin-uk-caps-united-seal-4-3-million-mega-sponsorship-deal/\">Continue reading<span class=\"screen-reader-text\"> \"Green Dollar Coin UK, CAPS United Seal $4.3 Million Mega Sponsorship Deal…\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "Groceries worth US $ ,7500 donated to Ingutsheni mental health hospital in Bulawayo",
            "url": "https://www.zimeye.net/2025/09/27/groceries-worth-us-7500-donated-to-ingutsheni-mental-health-hospital-in-bulawayo/",
            "content": " By A CorrespondentGroceries worth US$ 7500 were donated today at Ingutsheni Mental Health hospital in Bulawayo.The donation was handed over by Daughters of Virtue, an interdenominational prayer group registered with Evangelical Fellowship of Zimbabwe.\n\nSpeaking at the handover ceremony Daughters of Virtue vice president Pastor Blessed Marara said the donation was a way of celebrating the organisation s Visionary and Philanthropist ,Prophetess Memory Matimbires birthday as witnessed in the past years as she celebrates her birthday every year by giving to the less privileged.\n\nSaid Pastor Marara:We are here in Bulawayo at Ingutsheni Psychiatric Hospital where we have come to donate groceries worth $US7 500 .This is a programme that Prophetess Memory Matimbire of Daughters of Virtue has started years ago where she believes that on her birthday she doesnt want to celebrate alone but she wants to celebrate with the less privileged.So this year she chose to come here at Ingutsheni so that she can do donations in the form of food items.Last year she was at Chitungwiza General Hospital where she donated 600 blankets but this year.She is recognizing that as a government hospital, we as a Church Ministry we can also contribute something so that we can help the less privileged people in our nation.The donation will go a long way in improving the well-being of mental health at the hospital so as to speed up their recovery.\n\nDaughters of Virtue has several departments, one such is Hannah department. Daughters of Virtue International (DOV), a Christian ministry that holds Hannah Camps and prayer meetings to encourage women, particularly those struggling with infertility, by mirroring the biblical story of Hannahs prayer and Gods eventual blessing. These events aim to provide spiritual support and prayer for women seeking the fruit of the womb, and Gods blessing of children.\n\nThe program is inspired by Hannah, the biblical figure in 1 Samuel who was barren for many years but eventually prayed to God and was blessed with the prophet Samuel.\n\nThe core purpose is to pray for women who are crying out for children and help them to trust that God can provide.\n\nDOV hosts Hannah Camps annually which are solely prayer and fasting events where women gather for spiritual encouragement and prayer.\n\nThe initiative is part of the larger Daughters of Virtue International ministry, which also offers other prayer and spiritual support services, as seen in their Ndadhiniwa Prayer Group on their networks. The drive of this initiative was through the Visionary, Prophetess Memory Matimbire who went through a period of six (6) years of barrenness. She is very passionate about this group since she understands the pain of the HANNAH SEASON.\n\nThese camps bring hope to those crying out to God for a breakthrough , in that those who have experienced breakthroughs are allowed to give testimonies and their journey experiences.\n\nCurrently, the DOV Hannah group has 114 pregnancies, 532 nursing mothers and since 2018 to date 4624 births have been recorded including 38 sets of twins and one set of triplets.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "‎ By A Correspondent ‎‎Groceries worth US$ 7500 were donated today at Ingutsheni Mental Health hospital in Bulawayo.The donation was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/groceries-worth-us-7500-donated-to-ingutsheni-mental-health-hospital-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Groceries worth US $ ,7500 donated to Ingutsheni mental health hospital in Bulawayo\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        },
        {
            "title": "Chiwenga’s True Mission: Fighting Corruption, Not Seizing Power",
            "url": "https://www.zimeye.net/2025/09/27/chiwengas-true-mission-fighting-corruption-not-seizing-power/",
            "content": "By Shelton Muchena and Desmond Nleya in England | Vice President Constantino Chiwenga has once again found himself at the centre of political debate, accused by critics of harbouring ambitions for power. Yet such claims collapse under scrutiny, as his record consistently reflects a man devoted not to self-interest but to the pursuit of a better Zimbabwefree from corruption.\n\nRecent reports suggest that Chiwenga has raised concerns about corruption, not directly with President Emmerson Mnangagwa, but within internal party structures. Far from being a sign of disloyalty, this demonstrates his discipline and commitment to addressing problems through proper channels. He did not grandstand before the media for personal glory; instead, he chose to confront the issue where it mattered mostinside the ruling party.\n\nIf Chiwenga were truly power-hungry, history offered him countless opportunities to seize authority. During Operation Restore Legacy in 2017, it was Chiwenga who intervened to stabilise the country and who reached out to Mnangagwa when circumstances forced him temporarily into exile. That is not the conduct of a schemer, but of a loyal comrade devoted to national unity.\n\nCritics such as Christopher Mutsvangwa and Temba Mliswa have tried to trivialise corruption by suggesting that those making allegations should simply go and report to the police. To ordinary Zimbabweans and struggling civil servants, such remarks ring hollow. How can the police act against individuals who enjoy impunity, fly aboard the presidential jet, and flaunt ill-gotten wealth in a country where ordinary citizens are limited to meagre weekly bank withdrawals?\n\nCorruption in Zimbabwe is more than a political embarrassmentit is a national security threat. Allowing those implicated to hide behind their proximity to power is a betrayal of the people. To dismiss Chiwengas call for accountability as personal ambition is to misread the moment.\n\nChiwengas history speaks for itself. As a liberation fighter and soldier, he placed the nation above personal gain. Unlike some who fled during the liberation struggle, his loyalty has never wavered. When detractors belittle him as not a superstar, they overlook his true stature: a man who has defended Zimbabwe on the battlefield and now seeks to defend it from the cancer of corruption.\n\nThe Vice President has made it clear that he is not hungry for power. The only hunger he has ever expressed is to see a better Zimbabweone where corruption is uprooted, resources are directed to the people, and the legacy of the liberation struggle is honoured through service and integrity.\n\nRather than vilify him, the ruling party and the nation should commend his courage. Chiwengas stance is not about succession politics; it is about rescuing Zimbabwe from decay. In a time when corruption undermines trust in government and deepens the suffering of ordinary citizens, Zimbabwe needs leaders who will speak boldly within party structures and act decisively.\n\nChiwenga is not a threat to power. He is a patriot. His loyalty, discipline, and determination to confront corruption must be recognised for what they are: the actions of a man who puts Zimbabwe first.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena and Desmond Nleya in England | Vice President Constantino Chiwenga has once again found himself at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/27/chiwengas-true-mission-fighting-corruption-not-seizing-power/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga’s True Mission: Fighting Corruption, Not Seizing Power\"</span></a></p>",
            "time": "21:26",
            "date": "28 Sep 2025"
        }
    ]
}