{
    "news": [
        {
            "title": "Tshabangu Goes For Pitbulls",
            "url": "https://www.zimeye.net/2025/06/03/tshabangu-goes-for-pitbulls/",
            "content": "By Municipal Reporter-The Harare City Council, led by Mayor Jacob Mafume under the disputed leadership of Sengezo Tshabangus Citizens Coalition for Change (CCC), has ordered the immediate shooting of all stray dogs and is considering a formal ban on dangerous dog breeds, particularly pit bulls.\n\nThis drastic measure follows a horrific incident on Saturday night when 68-year-old Mr. Samuel Machera was mauled to death in Waterfalls by a pack of dogs owned by Mr. Mike Mupinga.\n\nMupinga is expected to appear in court on culpable homicide charges. According to witnesses, Machera had stepped out for a smoke around 9pm and never returned.\n\nHis mangled body was discovered early the next morning in a yard surrounded by knee-high precast walls, raising concerns about animal containment in urban spaces.\n\nResidents have described the dogs as pit bulls, a breed widely associated with a higher risk of violent attacks.\n\nThough experts say not all pit bulls are dangerous, their bite style  the notorious hold-and-shake technique  often causes catastrophic injuries.\n\nOne neighbour, Ms. Catherine Chiwara, revealed she narrowly escaped an attack by the same dogs weeks earlier.\n\nThe tragedy has reignited debates around dangerous dog breeds and public safety. We have instructed municipal police to shoot all stray dogs that are a threat to residents, Mafume said. We are also exploring legal options to ban such breeds, and if necessary, we will urge the government to legislate urgently.\n\nThis move comes amid growing criticism of Tshabangu, who controversially declared himself CCC interim secretary-general and has recalled dozens of elected officials, sparking accusations of collusion with Zanu PF.\n\nHis perceived crackdown on stray animals is being viewed by some as a populist attempt to reclaim political relevance amid growing legitimacy questions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Municipal Reporter-The Harare City Council, led by Mayor Jacob Mafume under the disputed leadership of Sengezo Tshabangu’s Citizens Coalition … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/tshabangu-goes-for-pitbulls/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Goes For Pitbulls\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "Army To Enter And Stay In Harare For 3 Days",
            "url": "https://www.zimeye.net/2025/06/03/army-to-enter-and-stay-in-harare-for-3-days/",
            "content": "BREAKING: Zimbabwe National Army to Conduct Field Training Exercise in Harare Suburbs\n\nHarare  3 June 2025\n\nBy Dorrothy Moyo | ZimEye | The Zimbabwe National Army (ZNA) has announced it will be conducting a field training exercise in several residential areas across Harare from 3 to 6 June 2025, prompting a public advisory not to panic.\n\nIn a notice issued by Colonel Hlengiwe Dube, Director of Army Public Relations, the ZNA stated that the exercise is part of routine training and will be carried out during daytime hours. The affected suburbs include Glen View, Glen Norah, Kuwadzana, Dzivarasekwa, Mt Hampden, and Westgate. Military movements will primarily take place along Solomon Mujuru Road (formerly Kirkman Road).\n\nThe Exercise will be conducted during daytime and will not affect the general publics daily routine. The public is therefore requested not to panic, the statement emphasized.\n\nThe army clarified that the training is a standard procedure designed to keep units operationally ready and is not in response to any specific threat.\n\nThe announcement comes amid heightened public sensitivity to increased military visibility in urban areas, but officials have assured residents that this operation is strictly non-combative and planned well in advance.\n\nResidents are encouraged to go about their business as usual but to remain cautious and give way to military convoys or personnel as needed.\n\nFor further inquiries, members of the public may contact the ZNA Public Relations Directorate at Josiah Magama Tongogara Barracks, Harare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BREAKING: Zimbabwe National Army to Conduct Field Training Exercise in Harare Suburbs Harare – 3 June 2025 By Dorrothy Moyo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/army-to-enter-and-stay-in-harare-for-3-days/\">Continue reading<span class=\"screen-reader-text\"> \"Army To Enter And Stay In Harare For 3 Days\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "What To Know About The New Zimbabwe Media Policy",
            "url": "https://www.zimeye.net/2025/06/03/zimbabwes-new-media-policy-take-aways/",
            "content": "By Mlondolozi Ndlovu-TheZimbabwe Media Policy, approved by Cabinet in March 2025, is presented as a transformative framework to align the countrys media landscape with democratic governance, national development, and digital innovation. TitledPromoting Media Excellence, Diversity and National Development,the policy outlines lofty ambitions: strengthening freedom of expression, enhancing access to information, encouraging professionalism, and asserting media sovereignty.\n\nYet beneath these aspirations lie critical legal and democratic deficiencies, including a disregard for constitutional supremacy, the absence of broad-based stakeholder consultation, and embedded risks of media criminalization. While the policy may appear progressive, it undermines fundamental rights guaranteed in the Constitution of Zimbabwe, replicates existing legal provisions, and risks narrowing civic space through administrative coercion masquerading as reform.\n\nOne of the most glaring omissions in the policys formulation is the failure to conduct meaningful consultation with key stakeholders  including media practitioners, civil society, academia, and the general public. A policy that purports to guide the rights and responsibilities of media actors must, by necessity, include the perspectives of those it regulates. The absence of such consultation not only violates principles of transparency and inclusivity but also silences relevant voices.\n\nThe policy must adhere to democratic expectations of openness and participatory governance. The rushed and top-down approach taken by the Ministry of Information, Publicity and Broadcasting Services further undermines the policys credibility and casts doubt on the genuineness of its developmental intent.\n\nConsultative policymaking ensures that policies reflect lived realities. Excluding independent journalists, rural broadcasters, community media, and advocacy groups means the policy fails to address the practical needs of the very sector it seeks to regulate. Such exclusion amounts to the institutional erasure of relevant voices and has long-term implications for democratic trust and compliance.\n\nAlthough the policy does not explicitly create new criminal offences, it effectively introduces a regulatory framework that permits punitive enforcement mechanisms resembling criminalization. Section 4.8 outlines a series of penalties for media organisations and individuals who violate undefined or vaguely framed standards. These include loss of licenses or accreditation, blocking or removal of content, mandatory apologies, disqualification from media industry awards, and legal action such as lawsuits for defamation, privacy violations, or the dissemination of so-called falsehoods.\n\nWhile framed as administrative or civil measures, these tools can be easily weaponized to punish critical journalism, creating the chilling effect typically associated with criminal sanctions.\n\nMoreover, the policy creates space for the state to impose criminal liability by relying on existing legislation such as theCyber and Data Protection Act a law already used to target and silence dissenting voices, particularly those expressing themselves on digital platforms. In this context, the media policy reinforces, rather than replaces, a broader trend of legal repression, where statutory and regulatory frameworks are selectively enforced to suppress criticism under the pretext of protecting national interest or digital integrity.\n\nSection 2 of the Constitutionestablishes the supremacy of the Constitution over all laws, customs, and practices. It unequivocally states that any law, practice, custom or conduct inconsistent with the Constitution is invalid to the extent of the inconsistency. Therefore, any policy, no matter how well-intentioned, must align with constitutional provisions  particularly the Bill of Rights.\n\nThe policy purports to support freedom of expression and access to information. However, it does so selectively and conditionally, focusing more on state image and sovereignty than on the rights of citizens and journalists. This approach is at odds withSection 61(1)(a)of the Constitution, which guarantees every person the freedom to seek, receive, and communicate ideas and other information.Section 62(1)further guarantees the right to access information held by the state or any government institution or agency. These are not privileges granted at the discretion of the executive  they are foundational freedoms that form the bedrock of a democratic society.\n\nThe loose use of the term other information implies that any information not harmful to society should be freely communicated  including uncomfortable truths that serve the public interest or promote accountability. A policy that dictates the type or nature of information to be communicated  such as insisting only on content that protects the image and sovereignty of Zimbabwe  undermines freedom of expression. This narrows the constitutional scope of expression and risks casting legitimate critique or investigative journalism as threats to national interest.\n\nIn doing so, the policy compromises the essence of freedom of expression guaranteed under Section 61, which protects the right to communicate diverse ideas and information  not just those aligned with state-approved narratives. The policy is therefore restrictive and inconsistent with the spirit of the Constitution.\n\nThe policys strong emphasis on defending national image and sovereignty may be used to suppress dissent or critical journalism under the guise of patriotism. While nation-building is important, using patriotism to police speech, journalism, or activism undermines democracy  particularly when criticism is labeled unpatriotic. True patriotism is not blind obedience or glorification of the state. It is loyalty to the people and values of a nation  and a willingness to hold the state accountable when it deviates from those values.\n\nPatriotism should be encouraged, not mandated  just as in the United States and South Africa, where national loyalty is promoted through democratic values, not enforced narratives.\n\nThe Constitution sets high standards for media freedoms.Section 61(4)explicitly states that freedom of the media is protected and that state-owned media must be impartial. In contrast, the policy introduces vague qualifiers to freedom of expression, referencing the need to protect Zimbabwes sovereignty, image, and economic interests. While national sovereignty is a legitimate concern, it cannot justify blanket censorship or suppression of dissent.\n\nPresident Mnangagwas recent warning to media practitioners against disseminating harmful information that could tarnish Zimbabwes image in the eyes of global investors reflects a broader governmental posture: that media should serve state branding rather than public accountability. Such expectations undermine the watchdog role of the media  essential for democracy, transparency, and good governance.\n\nA media system that conforms only to patriotic narratives cannot fulfill its constitutional duty to seek, receive, and impart information and ideas  especially on issues of public interest, corruption, governance, and electoral integrity.\n\nOne of the structural weaknesses of the policy is itsredundancy. Much of what it claims to introduce already exists in national law:\n\nInstead of reforming or innovating on these laws, the policy merely repackages them, adding layers of bureaucratic control without addressing core sectoral needs such as funding, independence, and the safety of journalists. It introduces new administrative requirements  such as fees for foreign media practitioners and mandatory content deposits for wildlife documentaries  but offers little in terms of actual media development or rights expansion.\n\nBy failing to harmonize existing laws, the policy adds complexity to an already fragmented regulatory landscape. This may deter investment, confuse media actors, and increase the potential for discretionary abuse by state officials.\n\nTo be truly effective, a media policy must promote rights-based governance, align with constitutional protections, and foster an environment conducive to free expression, journalistic integrity, and technological innovation. This requires:\n\nA progressive media policy should enhancepluralism,professionalism, andparticipation not control. The current policy falls short of that democratic imperative.\n\nTo its credit, the policy is guided by commendable principles: media pluralism, freedom of expression, transparency, whistleblower protection, and accountability. These values reflect the language of democratic governance and align  at least rhetorically  with international standards and constitutional commitments.\n\nHowever, while these principles are laudable, many remainaspirationaland are not supported by concrete institutional or legal mechanisms for enforcement. This is especially concerning in areas where violations are most likely to be committed bystate actors including infringements on whistleblower safety, suppression of critical media, and lack of transparency in regulatory oversight. Without independent enforcement bodies, binding legal frameworks, or clear remedial procedures, these principles risk becomingsymbolicrather than substantive.\n\nThat said, the policy does make some important strides toward digital modernization, professional development, and media pluralism. Initiatives such as theMedia Fund, protections against workplace harassment, and efforts to promote local content and language diversity reflect a genuine attempt to align media with national development goals.\n\nIn conclusion, while articulated in developmental language, the policy ultimately prioritizescontrol,image management, andbureaucratic oversightover media freedom, constitutional rights, and sectoral innovation. Its failure to undergo meaningful consultation, its duplication of existing legal frameworks, and its veiled endorsement of criminalization reveal a policy more concerned with managing perception than empowering citizens and institutions.\n\nIn light ofSection 2 of the Constitution, which affirms the supremacy of constitutional rights over any policy or custom, the Media Policy must be urgently revisited to ensure that it does not undermine the very rights it claims to promote. In a democratic nation,media freedom is not a threat to national sovereignty  it is its guarantor.\n\nMlondolozi Ndlovu is the interim MISA Harare Advocacy Chairperson. He is also a media lecturer, legal and media researcher who writes in his own capacity. He is reachable on[emailprotected].\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Mlondolozi Ndlovu-The Zimbabwe Media Policy, approved by Cabinet in March 2025, is presented as a transformative framework to align the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/zimbabwes-new-media-policy-take-aways/\">Continue reading<span class=\"screen-reader-text\"> \"What To Know About The New Zimbabwe Media Policy\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "Watch: Advocate Nelson Chamisa Speaks … I Am With You",
            "url": "https://www.zimeye.net/2025/06/03/watch-advocate-nelson-chamisa-speaks-i-am-with-you/",
            "content": "Watch video below\n\nWatch : Advocate Nelson Chamisa Speaks I Am With You, Don't Lose Hopepic.twitter.com/OxxAS0zFqj\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Watch video below…",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "Griezmann Commits to Atlético Madrid Until 2027",
            "url": "https://www.zimeye.net/2025/06/03/griezmann-commits-to-atletico-madrid-until-2027/",
            "content": "Sports Correspondent\n\nAtltico de Madrid have officially confirmed that French forward Antoine Griezmann has extended his contract with the club until 2027, solidifying his long-term future with the Spanish giants.\n\nThe 34-year-old, widely regarded as one of the most consistent and versatile attackers in Europe, has been a cornerstone of Atlticos attack. Since rejoining the club from Barcelona, Griezmann has recaptured his best form under manager Diego Simeone, becoming the teams top scorer and creative engine.\n\nIn a statement released by the club on Tuesday, Atltico announced: Antoine Griezmann has extended his contract until 30 June 2027. The French international continues to write his story with our club.\n\nGriezmann, who has scored 197 goals in all competitions for Atltico, expressed his satisfaction at continuing his journey in the Spanish capital. Im very happy to continue at a club that I consider my home, said Griezmann.\n\nIve always given everything for this shirt and will continue to do so for the years to come.\n\nHis extension comes at a time when Atltico are aiming to reinforce their squad for a renewed push at domestic and European success. Griezmanns leadership, experience, and ability to perform in big matches remain vital to the clubs ambitions.\n\nFans have welcomed the news with enthusiasm, celebrating the commitment of a player who has become synonymous with Atlticos identity and fighting spirit.\n\nGriezmann is expected to play a key role as the team prepares for the 202526 season, with both La Liga and Champions League titles firmly in their sights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Atlético de Madrid have officially confirmed that French forward Antoine Griezmann has extended his contract with the club … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/griezmann-commits-to-atletico-madrid-until-2027/\">Continue reading<span class=\"screen-reader-text\"> \"Griezmann Commits to Atlético Madrid Until 2027\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "William Chinyanga Speaks From Prison",
            "url": "https://www.zimeye.net/2025/06/03/william-chinyanga-speaks-from-prison/",
            "content": "UK William Chinyanga, a Zimbabwean national based in the United Kingdom, was convicted on false charges of inciting terrorism. His case was compromised by his solicitor, Madeleine Corrcriticized by a judge for riding two horses, who blocked key witnesses and relied on the opinion of name-change scammer Hopewell Chinono. Chinono is also accused of compromising the political career of Chinyangas cousin, Hon. Job Sikhala.\n\nBelow is Chinyangas message to Zimbabweans and the world, dated 03 June 2025.\n\nFull Statement:\n\nDear Zimbabweans,\n\nMy life is in danger. Please help me.\n\nI have been denied release from prison on the grounds that I am still considered a threat to ZANU PF. This is because:(i) I appealed against my conviction. However, I lost my appeal not on merit, but because the prison security and police deliberately withheld crucial appeal documents, including witness statements that had been requested by the appeal judge. Without these, the judge ruled against me.It was my democratic right to appealit is not a crime. But the system tried to blackmail me into admitting that I am a terrorist, which I am not.\n\n(ii) I was enrolled in a prison programme on extremism, called ERG, under the HII framework. I completed 90% of it, but during the process I suffered from depression after the police and prison security confiscated my letters addressed to my lawyer and to the Home Office. These letters explained why I must not be deported. To me, deportation is a death sentenceI would be executed by the ZANU PF regime.\n\nThe plan worked in their favour. Now they are saying I will not be released because I failed to complete the HII programmeignoring the fact that it was the police and prison security who disrupted my participation. Isnt it clear that they sabotaged my progress to manufacture a reason to keep me in prison?\n\nACTION NEEDED:\n\nNote:ZANU PF is working in the background with elements of the UK government through deals involving lithium and diamonds. President Mnangagwa now enjoys free access to Britain despite his regimes record of gross human rights abuses in Zimbabwe.\n\n William Chinyanga\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "UK — William Chinyanga, a Zimbabwean national based in the United Kingdom, was convicted on false charges of inciting terrorism. His … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/william-chinyanga-speaks-from-prison/\">Continue reading<span class=\"screen-reader-text\"> \"William Chinyanga Speaks From Prison\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "William Chinyanga’s Address  To The Nation On June 3 2025",
            "url": "https://www.zimeye.net/2025/06/03/william-chinyangas-address-to-the-nation-on-june-3-2025/",
            "content": "WILLIAM CHINYANGAS NATION ADDRESS  3 JUNE 2025\n\nDear Zimbabweans,\n\nMy life is in danger. Please help me.\n\nI have been denied release from prison, with the justification that I still pose a threat to ZANU PF. This is not justiceit is political persecution.\n\nI was convicted on false charges of inciting terrorism. My solicitor, Madeleine Corrcriticised by a judge for riding two horsessabotaged my defence by blocking key witnesses and siding with the opinion of Hopewell Chinono, a known fraudster involved in the name change scam. His influence not only compromised my case but also the political career of my cousin, Hon. Job Sikhala.\n\nI exercised my democratic right to appeal the conviction. However, my appeal was undermined when prison authorities and police deliberately withheld my appeal documents, including critical witness statements requested by the judge. Deprived of this evidence, the judge dismissed my appeal. This obstruction of justice cannot be ignored.\n\nWhile in prison, I was forced into a course on extremism (ERG under HII). I completed 90% of it but fell into depression after the police and prison authorities confiscated my letters to both my lawyer and the Home Office. These letters were in response to the question of why I should not be deported. For me, deportation would mean execution by the ZANU PF regime.\n\nNow, those same authorities claim I cannot be released because I failed to complete the coursea course they themselves disrupted. This is a calculated move to keep me imprisoned and to set the stage for my deportation.\n\nACTION REQUESTED:\n\n1. I urgently need a criminal lawyer to sue the prison security services on my behalf.\n\n2. I call on you to form a delegation and petition the Prime Minister to stop my deportation and challenge the politically motivated imprisonment I face.\n\nNote: ZANU PF is working behind the scenes with the UK government, brokering deals involving Zimbabwes lithium and diamonds. President Mnangagwa is enjoying free access to Britain despite his well-documented record of human rights abuses.\n\nPlease act now. My life depends on it.\n\nWilliam Chinyanga\n\nWilliam Chinyanga was convicted over false charges of terrorism incitement after his solicitor Madeleine Corr (slammed by a judge for riding two horses) blocked his key witnesses and followed the opinion of the name change scammer, Hopewell Chinono who also compromised the career of his (Chinyangas) cousin, Hon Job Sikhala.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "WILLIAM CHINYANGA’S NATION ADDRESS – 3 JUNE 2025 Dear Zimbabweans, My life is in danger. Please help me. I have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/william-chinyangas-address-to-the-nation-on-june-3-2025/\">Continue reading<span class=\"screen-reader-text\"> \"William Chinyanga’s Address  To The Nation On June 3 2025\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "Jordan Zemura Brings Clean Water and Renovations to Murehwa School",
            "url": "https://www.zimeye.net/2025/06/03/jordan-zemura-brings-clean-water-and-renovations-to-murehwa-school/",
            "content": "Sports Correspondent\n\nZimbabwe international footballer Jordan Zemura has extended a helping hand to his rural roots through a major development initiative at Gumbanjera Primary School in Murehwa, under the banner of his charity, the Jordan Zemura Foundation.\n\nIn a gesture of goodwill aimed at improving educational and living conditions for learners, Zemuras foundation drilled a solar-powered borehole at the school, bringing much-needed access to clean and reliable water. The borehole is expected to benefit not only the pupils but the surrounding community as well.\n\nIn addition, the foundation renovated school blocks, breathing new life into the learning environment for dozens of rural children.\n\nCommunity members and school officials have expressed deep gratitude for the contribution, with many praising Zemura for remembering his roots and giving back meaningfully.\n\nJordans gesture is a reminder that success should always be shared, said one teacher at the school. Hes not just inspiring our children by playing international footballhes uplifting them by creating better conditions for their education.\n\nThe project aligns with the broader mission of the Jordan Zemura Foundation, which focuses on youth empowerment, education, and community development.\n\nZemura, who plays professionally in Europe, has previously expressed a strong commitment to using his platform to make a difference in Zimbabwean communities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe international footballer Jordan Zemura has extended a helping hand to his rural roots through a major development … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/jordan-zemura-brings-clean-water-and-renovations-to-murehwa-school/\">Continue reading<span class=\"screen-reader-text\"> \"Jordan Zemura Brings Clean Water and Renovations to Murehwa School\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "Mnangagwa’s Trabablas Interchange Torments Drivers",
            "url": "https://www.zimeye.net/2025/06/03/mnangagwas-trabablas-interchange-torments-drivers/",
            "content": "By A Correspondent\n\nChaos has gripped Harares traffic scene as motorists grapple with navigating the newly commissioned Trabablas Interchangealso known as Mbudzi Traffic Interchangeamid rising complaints of confusion, unclear road signage, and poor design execution.\n\nCommissioned just last week by President Emmerson Mnangagwa, the multi-million-dollar project was intended to ease congestion in the busy southern part of the capital. However, within days of opening, it has left many drivers bewildered and frustrated.\n\nState broadcaster ZBC News confirmed the widespread confusion in a report aired Monday, stating:Confused turns and missed exitssome motorists are struggling to find their way around the newly opened Trabablas Traffic Interchange.\n\nSocial media has also been flooded with videos and testimonies from frustrated commuters. Many blame either the design of the interchange or the lack of clear road markings and signage.\n\nHow do you expect people to drive properly when the signs are either missing, too small, or placed in the wrong positions? asked Tafadzwa Chirape, a commuter omnibus driver who regularly uses the route.\n\nThis is not about drivers failing to readthis is about a system thats failed from day one.\n\nOthers questioned the quality and planning of the project itself, which had attracted controversy even before its completion.\n\nThey spent millions on this. Was there any proper traffic flow study done? Or is this just another rushed project for optics? said Chipo Mare a local resident and urban planning student based in Masvingo.\n\nDespite the confusion, government officials have yet to address the specific concerns or suggest corrective measures.\n\nCalls for better signage, clear road markings, and public awareness campaigns have grown louder.\n\nMeanwhile, traffic officers stationed at the site are reportedly doing their best to manually direct traffic during peak hours, a short-term solution that many say is unsustainable.\n\nAs public frustration mounts, many Zimbabweans are now questioning not only the practicality of the Trabablas Interchange but also the broader implications of large-scale infrastructure projects implemented without adequate planning and community input.\n\nConfused turns and missed exits, some motorists are struggling to find their way around the newly opened Trabablas Traffic Interchange.pic.twitter.com/aUW3NoIxYr\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chaos has gripped Harare’s traffic scene as motorists grapple with navigating the newly commissioned Trabablas Interchange—also known … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/mnangagwas-trabablas-interchange-torments-drivers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Trabablas Interchange Torments Drivers\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        },
        {
            "title": "Zanu PF Bribes Gutu East Voters With Wheat Ahead Of By-election",
            "url": "https://www.zimeye.net/2025/06/03/zanu-pf-bribes-gutu-east-voters-with-wheat-ahead-of-by-election/",
            "content": "By A Correspondent\n\nIn what critics are calling a vote-buying ploy, the ruling Zanu PF party is set to distribute 30 tonnes of wheat to villagers in Gutu East just days before the crucial June 14 by-election.\n\nThe move has raised eyebrows across the political spectrum, with opposition figures and civil society organisations accusing Zanu PF of using state resources to sway votes in its favour.\n\nIndependent candidate Gift Gonese has strongly condemned the wheat distribution, calling it a textbook case of electoral bribery.\n\nThis is not aid. Its a bribe dressed up as development, Gonese said in an interview Tuesday.\n\nWhere was the wheat all along? Why does it only appear on the eve of an election?\n\nAccording to a Zanu PF official who spoke at a local gathering over the weekend, the ruling party intends to roll out not just food but also several projects to boost its image in the constituency.\n\nWe will soon distribute wheat to villagers and above all, we have a lot of projects that have been lined up in the constituency, the official said.\n\nHowever, community members say there is an unspoken condition to the aid.\n\nThey are telling people that if they dont vote Zanu PF, this food will stop coming, said a villager from Ward 8 who declined to be named. Its not charity. Its a threat.\n\nLocal observers argue that this strategy of material persuasion is not new but part of a well-oiled machine that exploits poverty and food insecurity for political gain.\n\nThis is how they win rural elections, said a Gutu-based civil rights activist. People are desperate. If you give them food and hint its tied to their vote, theyll complyout of survival, not loyalty.\n\nLegal experts also question the ethics and legality of such last-minute distributions.\n\nIt amounts to indirect vote buying, said Harare-based lawyer Tapiwa Munemo. The Electoral Act is clear about undue influence. The timing and scale of the wheat handout should trigger an investigation by ZEC and other electoral watchdogs.\n\nSo far, there has been no comment from the Zimbabwe Electoral Commission (ZEC) on the wheat distribution. The Zimbabwe Republic Police (ZRP), often accused of bias, has also remained silent on the matter.\n\nWith tensions rising ahead of polling day, Gonese has urged voters to see beyond the food and focus on lasting change.Were not offering wheatwere offering a better future, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In what critics are calling a vote-buying ploy, the ruling Zanu PF party is set to distribute … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/03/zanu-pf-bribes-gutu-east-voters-with-wheat-ahead-of-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Bribes Gutu East Voters With Wheat Ahead Of By-election\"</span></a></p>",
            "time": "06:46",
            "date": "04 Jun 2025"
        }
    ]
}