{
    "news": [
        {
            "title": "Mudimu and Baye Boost Warriors Squad Ahead of 2025 AFCON Finals",
            "url": "https://www.zimeye.net/2025/12/03/mudimu-and-baye-boost-warriors-squad-ahead-of-2025-afcon-finals/",
            "content": "By Sports Correspondent The Zimbabwe Football Association (ZIFA) has strengthened the Warriors squad with the addition of defenders Alec Mudimu and Tadius Baye as the team intensifies preparations for the 2025 AFCON finals.\n\nIn a statement, ZIFA confirmed the pairs arrival, highlighting the value they bring to the national team setup.\n\nAlec Mudimu and Tedius Baye have joined the Zimbabwe Warriors camp, adding experience, energy, and defensive strength as preparations intensify, read part of the statement.\n\nZIFA said the Warriors technical team is focused on building momentum and ensuring the squad reaches full readiness ahead of the continental tournament.\n\nThe squad continues to build momentum and readiness for the upcoming AFCON, the association said.\n\nThe latest additions are expected to boost squad depth as Zimbabwe targets a competitive showing at the 2025 finals.\n\nWarriors of Zimbabwe\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent– The Zimbabwe Football Association (ZIFA) has strengthened the Warriors squad with the addition of defenders Alec Mudimu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/mudimu-and-baye-boost-warriors-squad-ahead-of-2025-afcon-finals/\">Continue reading<span class=\"screen-reader-text\"> \"Mudimu and Baye Boost Warriors Squad Ahead of 2025 AFCON Finals\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Nine Pupils Miss ZIMSEC Exam as School Officials Enforce ‘Inappropriate Haircut’ Rule",
            "url": "https://www.zimeye.net/2025/12/03/nine-pupils-miss-zimsec-exam-as-school-officials-enforce-inappropriate-haircut-rule/",
            "content": "By A Correspondent  Nine students at a Mutare school missed the Zimbabwe School Examinations Council (ZIMSEC) Family and Religious Studies (FRS) Ordinary Level exam after the headmaster and school director refused them entry, citing inappropriate haircuts.\n\nEducation Minister Torerai Moyo condemned the officials actions, saying they violated the learners rights and went against Ministry guidelines. While the Ministry does not have a strict policy on hairstyles, it expects students to be neatly dressed with haircuts that clearly identify them as pupils.\n\nThe headmaster and director were arrested two weeks ago on Friday and appeared in the Mutare Magistrates Court the following Monday, Moyo said. Both were granted bail and are scheduled to return to court on 9 December 2025.\n\nThe blocked students arrived 55 minutes after the exam began, missing the Ministrys 15-minute entry window and thus the opportunity to sit the test.\n\nThe incident has sparked discussion on the balance between enforcing school appearance standards and protecting students right to education, raising questions about how far disciplinary measures should go.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Nine students at a Mutare school missed the Zimbabwe School Examinations Council (ZIMSEC) Family and Religious … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/nine-pupils-miss-zimsec-exam-as-school-officials-enforce-inappropriate-haircut-rule/\">Continue reading<span class=\"screen-reader-text\"> \"Nine Pupils Miss ZIMSEC Exam as School Officials Enforce ‘Inappropriate Haircut’ Rule\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "ICT Minister Tatenda Mavetera Warns Zimbabweans of Rising WhatsApp Scams",
            "url": "https://www.zimeye.net/2025/12/03/ict-minister-tatenda-mavetera-warns-zimbabweans-of-rising-whatsapp-scams/",
            "content": "Tinashe Sambiri ICT Minister Tatenda Mavetera issued a warning on Wednesday urging Zimbabweans to remain vigilant against the growing threat of WhatsApp scams, which have increasingly targeted unsuspecting users.\n\nIn her advisory, Mavetera said:\n\nAlert: Stay safe from WhatsApp scams, friends and fellow Zimbabweans. In an era of rising cyber threats, vigilance is key. If you receive a WhatsApp message from a relative or friend urgently requesting money, always call them directly using a voice call to verify their identity before responding. Hackers often compromise accounts and exploit your contact list to scam loved ones. May the good Lord bless your Wednesday.\n\nWhile many welcomed the guidance as timely, the message drew mixed reactions from the public. Critics pointed to Maveteras affiliation with the ruling Zanu PF party, which has faced accusations of manipulating polls and contributing to economic instability, questioning whether her advisory addresses the deeper vulnerabilities faced by Zimbabweans.\n\nCybersecurity experts have also stressed the importance of verifying contacts, avoiding sharing personal information online, and remaining alert to unusual messages, particularly those requesting money transfers.\n\nMaveteras warning highlights the growing cybercrime risks in Zimbabwe, but the mixed public response reflects broader frustrations with governance and economic challenges that leave many citizens exposed to fraud.\n\nTatenda Mavetera ICT Minister\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– ICT Minister Tatenda Mavetera issued a warning on Wednesday urging Zimbabweans to remain vigilant against the growing threat … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/ict-minister-tatenda-mavetera-warns-zimbabweans-of-rising-whatsapp-scams/\">Continue reading<span class=\"screen-reader-text\"> \"ICT Minister Tatenda Mavetera Warns Zimbabweans of Rising WhatsApp Scams\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Economic Recovery Figures Fail to Translate to Daily Relief for Zimbabweans",
            "url": "https://www.zimeye.net/2025/12/03/economic-recovery-figures-fail-to-translate-to-daily-relief-for-zimbabweans/",
            "content": "Tinashe Sambiri While the Reserve Bank of Zimbabwe (RBZ) celebrates a sharp decline in inflation, many ordinary citizens remain sceptical, as the touted economic recovery has yet to improve daily life for most Zimbabweans.\n\nAt its 1 December 2025 meeting, the Monetary Policy Committee (MPC) announced that annual inflation had dropped from 82.7% in September to 19.0% in November, with projections for single-digit inflation in early 2026.\n\nGovernor John Mushayavanhu credited the reduction to prudent monetary policy and strong foreign currency inflows.\n\nHowever, critics argue that these statistics do little to alleviate the hardships faced by households and businesses. The Bank Policy Rate remains at a punishing 35%, while high statutory reserve requirements for deposits continue to restrict access to affordable credit. Small businesses and ordinary borrowers are left struggling, unable to take advantage of the reported macroeconomic improvements.\n\nThe RBZ also highlighted over US$13 billion in foreign currency inflows and US$1 billion in reserves as stabilising factors for the Willing-Buyer Willing-Seller (WBWS) foreign exchange system. Yet many analysts warn that reliance on external inflows leaves Zimbabwe vulnerable to global economic shocks, while domestic production and liquidity constraints continue to frustrate local enterprises.\n\nEven the reduction of the Intermediated Money Transfer Tax (IMTT) from 2% to 1.5% on ZIG-denominated transactions is seen by some as a minor relief that does not address the broader economic challenges affecting ordinary Zimbabweans.\n\nDespite the MPC projecting 6.6% economic growth for 2025, sceptics warn that the figures remain largely theoretical, highlighting a growing disconnect between macroeconomic indicators and the lived realities of citizens. Until policies translate into tangible benefitsaffordable credit, lower borrowing costs, and improved access to basic goodsthe celebrated economic recovery may remain an abstract promise rather than a lived reality for Zimbabweans.\n\nZiG notes on display\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– While the Reserve Bank of Zimbabwe (RBZ) celebrates a sharp decline in inflation, many ordinary citizens remain sceptical, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/economic-recovery-figures-fail-to-translate-to-daily-relief-for-zimbabweans/\">Continue reading<span class=\"screen-reader-text\"> \"Economic Recovery Figures Fail to Translate to Daily Relief for Zimbabweans\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Killer Zivhu’s “General Varova Pasi” Comment Shakes Social Media",
            "url": "https://www.zimeye.net/2025/12/03/killer-zivhus-general-varova-pasi-comment-shakes-social-media/",
            "content": "Tinashe Sambiri Enigmatic Zanu PF official Killer Zivhu sparked a social media storm on Tuesday after posting a cryptic message hinting at political upheaval within the ruling party.\n\nOn X (formerly Twitter), Zivhu wrote:\n\nGeneral varova pasiKutanga nhasi kusvika Friday, umwe unodzingwa chete,\n\nThe ambiguous statement, which translates roughly as The General is gone starting today until Friday, someone will be removed, immediately ignited speculation online, with users debating its meaning and implications for Zanu PFs internal dynamics.\n\nObservers suggest that Zivhus post may be alluding to a potential move by President Emmerson Mnangagwa to oust his deputy, Constantino Chiwenga, amid growing factionalism and infighting within the party.\n\nA political analyst commenting on the post said, Killer Zivhus words are a clear signal of rising tension at the top of Zanu PF. Whether it is a warning or a prediction, it has certainly rattled the party faithful and the public alike.\n\nAs infighting within Zanu PF intensifies, Zivhus brief but striking message underscores the high-stakes maneuvering that continues behind the scenes, leaving social media buzzing with speculation and debate over the fate of key political figures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Enigmatic Zanu PF official Killer Zivhu sparked a social media storm on Tuesday after posting a cryptic message … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/killer-zivhus-general-varova-pasi-comment-shakes-social-media/\">Continue reading<span class=\"screen-reader-text\"> \"Killer Zivhu’s “General Varova Pasi” Comment Shakes Social Media\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Mnangagwa Pleads for Unity as Zanu PF Battles Internal Turmoil",
            "url": "https://www.zimeye.net/2025/12/03/mnangagwa-pleads-for-unity-as-zanu-pf-battles-internal-turmoil/",
            "content": "Tinashe Sambiri  Zanu PF leader Emmerson Mnangagwa on Wednesday publicly appealed for unity within his party, a move widely seen as an acknowledgment of deepening divisions, factionalism and growing resistance among senior members.\n\nAddressing the 388th Ordinary Session of the Zanu PF Politburo at the partys headquarters in Harare, Mnangagwa urged party structures to stop gatekeeping and allow new members to join, signalling rising internal tensions ahead of the 2028 elections.\n\nZanu PF must accommodate new members, he said. Let us not put ourselves and individuals above the party. Our activities must be guided by the constitutions of the party.\n\nHis remarks come amid complaints that long-serving elites are blocking new entrants to protect their influence, creating friction within the party.Mnangagwa warned the Politburo to take responsibility and restore discipline, saying: The Politburo must provide bold guidance for the party. Let us remain disciplined and never put the partys name into disrepute.\n\nAnalysts say the unusually strong language reflects growing instability within Zanu PF, where power struggles and mistrust continue to overshadow government business.\n\nMnangagwa also repeated his claim that unnamed enemies were working to destabilise the country. I challenge the nation to continue to be vigilant safeguarding against any machinations by our enemies, he said  a statement critics often dismiss as a tactic to deflect from domestic problems.\n\nThe President went on to push his long-standing vision for Zimbabwe to become an upper middle-income economy by 2030, despite widespread doubt from citizens struggling with rising prices, low wages and deteriorating public services.\n\nLet us turn Zimbabwe to an upper middle income economy by 2030. The duty is ours, he said. Mnangagwa added that sectors such as manufacturing, tourism, commodity exports and diaspora remittances were giving a positive balance on the current account.\n\nHowever, the optimistic rhetoric did little to mask the underlying message of the day: Zanu PF is grappling with serious internal turmoil, and its leader is now openly pleading for order.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Zanu PF leader Emmerson Mnangagwa on Wednesday publicly appealed for unity within his party, a move widely … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/mnangagwa-pleads-for-unity-as-zanu-pf-battles-internal-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Pleads for Unity as Zanu PF Battles Internal Turmoil\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Walter Magaya Charges USD2000 Per Person",
            "url": "https://www.zimeye.net/2025/12/03/walter-magaya-charges-usd2000-per-person/",
            "content": "The convicted medical fraudster Walter Magaya has announced he is charging people USD2000 per person this Dec. Magaya who faces multiple fraud and rape charges, made the disclosures through the below flyer which he circulated on Wed morning.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The convicted medical fraudster Walter Magaya has announced he is charging people USD2000 per person this Dec. Magaya who faces … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/walter-magaya-charges-usd2000-per-person/\">Continue reading<span class=\"screen-reader-text\"> \"Walter Magaya Charges USD2000 Per Person\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Community Celebrates as Gertnel Primary Launches ECD Block, Honors Graduates",
            "url": "https://www.zimeye.net/2025/12/03/community-celebrates-as-gertnel-primary-launches-ecd-block-honors-graduates/",
            "content": "By A Correspondent  Gertnel Government Primary School successfully held its ECD block groundbreaking ceremony alongside the ECD graduation on 2 December 2025.\n\nThe event was graced by Gutu District Acting District Schools Inspector Mr. Nzuwa, Ward 32 Councillor Mr. Maphosa, ZANU PF provincial member Cde Chagweda and his wife, former Gertnel Primary head Mrs. Mukundu, Mrs. Manyatwa (head of both the primary and secondary schools), and Teachers-in-Charge for infant schools.\n\nThe guest of honour was Mr. Jameson Shumbanhete, head of Rufaro High School.\n\nParents expressed great joy as they watched their children showcase poems and drama. SDC Chairperson Mr. Tizai Givemore praised parents for paying school fees on time.Head of School Mr. Musara also commended parents for supporting the school by paying fees and buying books for their children.\n\nGertnel Primary School currently has an enrolment of 461 learners. Last years pass rate was 72.5% under Mrs. Musiwarwo, and this year the pass rate increased by 20%, showing strong commitment from the teachers. This years Grade 7 classes were taught by Mrs. Chisenzi and Mr. Mukuwe.\n\nGertnel Primary is a unique school with a staff complement of 16 teachers and 3 non-teaching staff. The deputy head is Ms. Matizanadzo, T.I.C is Mr. Mpofu, and the senior teacher is Mr. Manamike.This years ECD B class was under the guidance of Mrs. Musara and Mr. Mpofu.\n\nOfficials at graduation ceremony\n\nGertnel Primary School groundbreaking and graduation\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Gertnel Government Primary School successfully held its ECD block groundbreaking ceremony alongside the ECD graduation on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/community-celebrates-as-gertnel-primary-launches-ecd-block-honors-graduates/\">Continue reading<span class=\"screen-reader-text\"> \"Community Celebrates as Gertnel Primary Launches ECD Block, Honors Graduates\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Action Democratic Movement Challenges Zimbabwean Church Leaders To Speak Truth, Not Politicians’ Words",
            "url": "https://www.zimeye.net/2025/12/03/action-democratic-movement-challenges-zimbabwean-church-leaders-to-speak-truth-not-politicians-words/",
            "content": "Tinashe Sambiri- The Action Democratic Movement (ADM) has issued a powerful call for Zimbabwean churches to reclaim their moral authority, warning religious leaders against becoming instruments of political power while citizens continue to suffer.\n\nIn a statement released on Wednesday, ADM reminded church leaders that their true role is not to serve government interests or provide cover for corruption, but to act as the nations conscience. You were not created to be an extension of government power, nor a shelter for corruption, nor a silent witness to suffering, the statement read.\n\nThe movement highlighted alarming realities facing ordinary Zimbabweans: children learning under trees, women dying in childbirth, families going hungry, victims of abuse suffering in silence, and corruption devouring national resources.\n\nADM criticised the Church for speaking loudly on select issues, such as abortion, while remaining silent on child abuse, domestic violence, political violence, poverty, sexual abuse within churches, exploitation of congregants, and theft of national resources. The Gospel is not selective. Righteousness is not seasonal. Justice is not political. Truth is not negotiable, the statement said.\n\nThe party emphasised that its message is not an attack on Christianity, but a demand for a return to authentic faith. It urged religious leaders to:\n\nReturn to truth even when it is uncomfortable\n\nStand with the oppressed even at personal risk\n\nReject corruption even when profitable\n\nProtect the vulnerable, especially the poor\n\nSpeak boldly for the voiceless\n\nResist political capture\n\nTrue Christianity is not about proximity to powerit is about courage to challenge power, ADM said.\n\nThe statement concluded with a call for spiritual and moral renewal: Rise again, Zimbabwean Church. Be the shepherd, not the spectator. Be the watchman, not the worshipper of power. Be the voice, not the echo.\n\nADMs warning is expected to spark debate over the role of religious institutions in confronting injustice and protecting the vulnerable in Zimbabwe.\n\nAction Democratic Movement\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri- The Action Democratic Movement (ADM) has issued a powerful call for Zimbabwean churches to reclaim their moral authority, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/action-democratic-movement-challenges-zimbabwean-church-leaders-to-speak-truth-not-politicians-words/\">Continue reading<span class=\"screen-reader-text\"> \"Action Democratic Movement Challenges Zimbabwean Church Leaders To Speak Truth, Not Politicians’ Words\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        },
        {
            "title": "Zimbabwean Nurse Grabs Top Health Care Job In UK",
            "url": "https://www.zimeye.net/2025/12/03/zimbabwean-nurse-grabs-top-health-care-job-in-uk/",
            "content": "By a Correspondent  A Zimbabwean midwife has secured a top leadership position in the United Kingdom, less than two years after relocating.\n\nNatsai Mushaninga is now leading a team as theDeputy Ward Manager of the Antenatal and Postnatal Ward at Doncaster Royal Infirmary (DRI).\n\nMushaningas professional journey began in Zimbabwe, where she trained and practised as a midwife. Friends and family know her as Happiness, a name that reflects her warm personality and deep commitment to maternal health. She explained her academic motivation:\n\nI really wanted to learn about the populations that I was serving and how to reduce maternal and neonatal deaths, which is why I completed an additional degree in Geography and Environmental Studies, as well as a Monitoring and Evaluation Special Honours Postgraduate.\n\nSeeking broader exposure, Mushaninga moved to Doncaster in January 2023 to apply her skills in a developed healthcare system and to deepen her understanding of maternal and neonatal care. She credits the Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust (DBTH) for making her transition smooth:\n\nIve been supported by the Trust every step of the way  from finding accommodation and completing bootcamp to registering with the Nursing and Midwifery Council, to helping me reunite with my family five months later.Their support has been incredible, and having my family here has made all the difference.\n\nHer dedication quickly paid off. In less than a year as a Rotational Midwife, Mushaninga was appointedDeputy Ward Managera role that reflects both her clinical expertise and leadership potential.\n\nShe further strengthened her professional profile by completing a leadership programme with theFlorence Nightingale Foundationand participating inElevate, an initiative that supports career advancement for ethnic minority staff.\n\nToday, Mushaninga also serves as aCultural Safety Support Championat DBTH. She sits on theDecision-Making Councilfor internationally educated healthcare professionals and contributes to thePROMPTfaculty, where she supports colleagues and trains students across maternity services.\n\nReflecting on her remarkable rise, she said:\n\nWhen I came here, I didnt see myself being where I am today, but there are so many opportunities in the NHS.My Trust made us aware of them, and I just grabbed every one that came my way.I had to be uncomfortable to become comfortable.\n\nHer journey is now an inspiration to many Zimbabwean health professionals seeking opportunities beyond the countrys borders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent – A Zimbabwean midwife has secured a top leadership position in the United Kingdom, less than two … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/03/zimbabwean-nurse-grabs-top-health-care-job-in-uk/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Nurse Grabs Top Health Care Job In UK\"</span></a></p>",
            "time": "09:35",
            "date": "04 Dec 2025"
        }
    ]
}