{
    "news": [
        {
            "title": "Community Shield Thriller: A Closer Look at Palace’s Winning Formula Against Liverpool…",
            "url": "https://www.zimeye.net/2025/08/11/community-shield-thriller-a-closer-look-at-palaces-winning-formula-against-liverpool/",
            "content": "Sports Correspondent\n\nFA Cup holders Crystal Palace clinched a dramatic Community Shield victory against Premier League champions Liverpool, winning 3-2 on penalties after a 2-2 draw at Wembley.\n\nGoalkeeper Dean Henderson was the standout hero, saving penalties from Alexis Mac Allister and Harvey Elliott. Meanwhile, Liverpools Mohamed Salah saw his kick fly over the bar, opening the door for 21-year-old Palace midfielder Justin Devenny, who had come on as a stoppage-time substitute, to confidently slot the winning penalty past Alisson.\n\nThis victory adds a second major trophy to Palaces cabinet within months, having secured their first-ever major trophy earlier this year. Notably, Palace became the first team in 50 years to win the Community Shield on their debut appearance, the last being Derby County in 1975.\n\nThe match was a thrilling spectacle from start to finish, with early drama unfolding in just the fourth minute. Liverpools four major summer signings made immediate impact, as 116m record signing Florian Wirtz provided the assist for Hugo Ekitikes clinical finish to put Liverpool ahead.\n\nHowever, Palace responded resiliently. Thirteen minutes later, Jean-Philippe Mateta converted a penalty after Virgil van Dijk fouled Ismaila Sarr. Mateta also contributed in the shootout, scoring one of Palaces successful penalties.\n\nHendersons heroics in the shootout, including two crucial saves at the same end where he denied Omar Marmoushs spot-kick in Mays cup final, proved decisive.\n\nLiverpool fans paid a poignant tribute in the 20th minute to Diogo Jota, the forward who wore the number 20 shirt before his tragic passing in a car accident last month.\n\nMeanwhile, Palace await the Court of Arbitration for Sports (CAS) decision on their appeal against demotion from the Europa League, adding an off-field drama to their recent on-pitch success.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent FA Cup holders Crystal Palace clinched a dramatic Community Shield victory against Premier League champions Liverpool, winning 3-2 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/community-shield-thriller-a-closer-look-at-palaces-winning-formula-against-liverpool/\">Continue reading<span class=\"screen-reader-text\"> \"Community Shield Thriller: A Closer Look at Palace’s Winning Formula Against Liverpool…\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Your ZiG Obsession Disastrous, Former MP Warns Mnangagwa",
            "url": "https://www.zimeye.net/2025/08/11/your-zig-obsession-disastrous-former-mp-warns-mnangagwa/",
            "content": "By A Correspondent\n\nThe Mnangagwa regime is once again playing with fire, this time by announcing a bold  some would say reckless  plan to phase out the US dollar by 2030 in favour of the untested Zimbabwe Gold (ZiG).\n\nAccording to the Reserve Bank of Zimbabwe (RBZ), the country will transition from the current multi-currency system to a domestic mono-currency in an orderly manner. The move will be anchored in the upcoming National Development Strategy 2 (NDS2), replacing the already underwhelming NDS1.\n\nRBZ Governor John Mushayavanhu insists the plan will preserve foreign currency accounts and respect existing USD-denominated contracts, but Zimbabweans have heard these promises before. The memory of 2008s hyperinflation and the governments sudden seizure of US dollar bank balances in 2019 remains fresh.\n\nWhile officials boast of stability since ZiG replaced the collapsing Zimbabwe dollar in April 2024, sceptics point out that ZiG still accounts for only a fraction of the money in circulation. The overwhelming majority of transactions  especially in critical imports like fuel and medicines  are still priced in US dollars.\n\nForeign-currency depositors are particularly uneasy, with the RBZs own Mid-Term Review admitting that stakeholders relayed concerns about the fate of their savings post-2030. The absence of legally binding guarantees has only heightened suspicion that the government might be setting the stage for another raid on hard currency deposits.\n\nFormer Masvingo Central Constituency Member of Parliament Jeffryson Chitando criticized the governments plan sharply: The obsession with ZiG is reckless and risks repeating the disastrous mistakes of the past. Zimbabweans cannot afford another currency collapse caused by political vanity and poor economic management.\n\nThe governments framing of de-dollarisation as national sovereignty rings hollow for many Zimbabweans, who see it as a political vanity project detached from economic reality. The 2030 deadline is being pushed as non-negotiable, yet the RBZ has offered no clear explanation of how it will maintain price stability, rebuild public trust, or ensure the new currency holds value beyond paper promises.\n\nPresident Mnangagwas administration appears determined to push forward, regardless of the risks. If history is any guide, ordinary citizens will be the ones left paying the price when political grandstanding collides with economic reality.\n\nFor now, the message from the regime is clear: the US dollars days are numbered. The real question is whether Zimbabweans can trust their leaders not to repeat the catastrophic currency blunders of the past  or whether 2030 will be yet another year of shattered savings and broken promises.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Mnangagwa regime is once again playing with fire, this time by announcing a bold – some … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/your-zig-obsession-disastrous-former-mp-warns-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Your ZiG Obsession Disastrous, Former MP Warns Mnangagwa\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Mnangagwa Honours Four Heroes",
            "url": "https://www.zimeye.net/2025/08/11/mnangagwa-honours-four-heroes/",
            "content": "By A Correspondent  President Emmerson Mnangagwa has posthumously declared four national heroes and presented flags to their families.\n\nThe four include nationalists Jairos Jiri, Brigadier-General (Retired) Lameck Francisco Mutanda, John Mbedzi, and Elos David Malandu.\n\nHonours and awards were also presented to individuals who have represented the country with distinction in various fields.\n\nHeroes Day remains one of Zimbabwes most significant commemorations, a moment to remember and honour those who fought for the independence the nation enjoys today.\n\nUpon arrival, President Mnangagwa inspected a guard of honour mounted by the Presidential Guard. He was joined by his two deputiesVice President General (Retired) Dr Constantino Chiwenga and Colonel (Retired) Kembo Mohadiin laying wreaths at the Tomb of the Unknown Soldier.\n\nThis year, the families of the four newly declared national heroes were each presented with a national flag.\n\nProfessor Vladimir Shubin, former Secretary of the Soviet Afro-Asian Solidarity Committee and Head of the Africa Section of the Communist Party of the Soviet Unions International Department, received the Zimbabwe International Friendship Award.\n\nI am honoured to be here in Zimbabwe to receive this award for my work to help the country achieve independence. This is not my own awardthis is for my country, Russia, he said.\n\nInasem Chitutu, a teenager who bravely rescued two children from a burning house in Bindura, was awarded the Silver Cross of Zimbabwe.\n\nI never thought I would meet the President at such a young age, let alone receive this award, which is closest to my heart. I will forever cherish this, he said.\n\nWith women continuing to play a key role in the health care sector, Dr Madeline Nyamwanzathe first female African medical doctor in Zimbabwereceived the Robert Gabriel Mugabe Commendation Award for Service in Human Capital Development.\n\nI feel grateful to receive this award in recognition of the work I have done, particularly in the health care sector, and I will forever cherish it, she said.\n\nThese living heroes are among more than two thousand veterans of the liberation struggle from across the country who were honoured on Monday.\n\nAs the nation celebrates both the living and the departed heroes, the responsibility to build a thriving Zimbabwe rests with every citizen, as the country works towards becoming an upper-middle-income society by 2030.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has posthumously declared four national heroes and presented flags to their families. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/mnangagwa-honours-four-heroes/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Honours Four Heroes\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Mavetera’s Digital Revolution- Just 30 Laptops and a Lot of Hot Air…",
            "url": "https://www.zimeye.net/2025/08/11/maveteras-digital-revolution-just-30-laptops-and-a-lot-of-hot-air/",
            "content": "By A Correspondent\n\nICT Minister Tatenda Maveteras weekend fanfare over the donation of 30 laptops and 5 Starlink kits to Dopota Primary School in Gokwe South did little to mask the governments ongoing failure to deliver meaningful digital inclusion across Zimbabwe.\n\nMavetera proudly announced, Today, I was honoured to accompany the Hon. Minister of Defence, Cde Oppah Muchinguri Kashiri, who on behalf of His Excellency, President Dr. Emmerson Dambudzo Mnangagwa, officially commissioned a state of the art computer laboratory at Dopota Primary School.\n\nHowever, the pomp and circumstance stand in stark contrast to the everyday realities faced by most Zimbabwean learners. With only 30 laptops and a handful of Starlink kits for an entire school and community, this milestone barely scratches the surface of the countrys vast digital divide.\n\nMaveteras assertion that no learner, no community, and no corner of our nation is left behind as we march towards Vision 2030 is at best aspirational rhetoric and at worst misleading. Vast swathes of Zimbabwe remain disconnected from reliable internet and digital resources, especially in rural areas like Gokwe South where basic infrastructure continues to lag behind.\n\nThe Ministers claim that the Ministry of ICT remain steadfast in driving digital inclusion and creating opportunities for all Zimbabweans to thrive in the Fourth Industrial Revolution does little to conceal the slow pace of progress and lack of tangible impact on the ground.\n\nCritics argue that such token gestures are designed more for political optics than genuine transformation. For many schools, the lack of electricity, trained teachers, and maintenance support for digital facilities means donated equipment often ends up unused or broken.\n\nZimbabwes digital future requires far more than ceremonial launches and social media hashtags.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ICT Minister Tatenda Mavetera’s weekend fanfare over the donation of 30 laptops and 5 Starlink kits to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/maveteras-digital-revolution-just-30-laptops-and-a-lot-of-hot-air/\">Continue reading<span class=\"screen-reader-text\"> \"Mavetera’s Digital Revolution- Just 30 Laptops and a Lot of Hot Air…\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Chadzamira’s Personal Aide Esau Mutanho Suffers Humiliating Defeat in Zanu PF Ward 7 Primary Election …",
            "url": "https://www.zimeye.net/2025/08/11/chadzamiras-personal-aide-esau-mutanho-suffers-humiliating-defeat-in-zanu-pf-ward-7-primary-election/",
            "content": "By A Correspondent\n\nEsau Mutanho, personal aide to Masvingo Minister of State for Provincial Affairs and Devolution Ezra Chadzamira, suffered a heavy defeat in the Zanu PF Masvingo Urban Ward 7 primary election held on Saturday, losing to businessman Simbarashe Shonhiwa, popularly known as Gweja.\n\nMutanho managed only 55 votes, trailing far behind Shonhiwas commanding 192 votes and even behind Angela Mandipakas 67 votes.\n\nDespite Mutanhos close ties to a powerful political figure, the election outcome signals a shift in local support away from established insiders.\n\nHowever, the primary election has been overshadowed by allegations of rigging and controversy.\n\nA Zanu PF official in Rujeko remained confident despite the claims, stating, The ruling party is fully prepared for the Ward 7 Masvingo Urban Council by-election.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Esau Mutanho, personal aide to Masvingo Minister of State for Provincial Affairs and Devolution Ezra Chadzamira, suffered … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/chadzamiras-personal-aide-esau-mutanho-suffers-humiliating-defeat-in-zanu-pf-ward-7-primary-election/\">Continue reading<span class=\"screen-reader-text\"> \"Chadzamira’s Personal Aide Esau Mutanho Suffers Humiliating Defeat in Zanu PF Ward 7 Primary Election …\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Is Emmerson Mnangagwa Crucifying Jenarari: The Man Who Saved From G-40 Wrath ?",
            "url": "https://www.zimeye.net/2025/08/11/is-emmerson-mnangagwa-crucifying-jenarari-the-man-who-saved-from-g-40-wrath/",
            "content": "Emmerson Mnangagwa has all but ditched the man who saved him from the G- 40 wrath.\n\nMnangagwa has now clearly indicated allegiance to controversial businessman Kudakwashe Tagwirei.\n\nWatch video below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Emmerson Mnangagwa has all but ditched the man who saved him from the G- 40 wrath. Mnangagwa has now clearly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/is-emmerson-mnangagwa-crucifying-jenarari-the-man-who-saved-from-g-40-wrath/\">Continue reading<span class=\"screen-reader-text\"> \"Is Emmerson Mnangagwa Crucifying Jenarari: The Man Who Saved From G-40 Wrath ?\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Popular Masvingo Businessman Gweja Wins Zanu PF Ward 7 Primary Election Amid Controversy",
            "url": "https://www.zimeye.net/2025/08/11/popular-masvingo-businessman-gweja-wins-zanu-pf-ward-7-primary-election-amid-controversy/",
            "content": "By A Correspondent\n\nPopular Masvingo businessman Simbarashe Shonhiwa, also known as Gweja, has emerged victorious in the Zanu PF Masvingo Urban Ward 7 primary election held on Saturday.\n\nHowever, his win has been marred by controversy and allegations of rigging.\n\nShonhiwa secured a decisive 192 votes, far ahead of his closest rivals  Angela Mandipaka with 67 votes, Esau Mutanho with 55 votes, and Norman Mungwazi with only 5 votes.\n\nDespite the allegations swirling around the primary, a Zanu PF official in Rujeko expressed confidence in the partys readiness for the upcoming by-election.\n\nThe ruling party is fully prepared for the Ward 7 Masvingo Urban Council by-election, the official said.\n\nThe by-election, scheduled for September 13, follows the unfortunate passing of Councillor Tafara Masimba.\n\nThe political tension in Ward 7 is palpable as the by-election draws near, with all eyes on the ruling party to demonstrate transparency and fairness in the electoral process.\n\nHowever, Zanu PF Masvingo provincial spokesperson Pepukai Chiwewe described the whole process as satisfactory\n\nI am pleased to confirm that Cde Simbarashe Shonhiwa is our duly elected candidate to represent us in the upcoming Masvingo Urban Constituency Ward 7 by-elections. The primary elections were conducted in a free, fair, and transparent manner, allowing eligible voters to exercise their right. Notably, all four participating candidates accepted the results, showcasing a commendable spirit of maturity and party discipline in our internal electoral process. Our united goal is to reclaim Ward 7 for ZANU PF, ably led by His Excellency President Emmerson D. Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Popular Masvingo businessman Simbarashe Shonhiwa, also known as Gweja, has emerged victorious in the Zanu PF Masvingo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/popular-masvingo-businessman-gweja-wins-zanu-pf-ward-7-primary-election-amid-controversy/\">Continue reading<span class=\"screen-reader-text\"> \"Popular Masvingo Businessman Gweja Wins Zanu PF Ward 7 Primary Election Amid Controversy\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Chiwenga Snubs Mnangagwa Scarf Yet Again",
            "url": "https://www.zimeye.net/2025/08/11/chiwenga-snubs-mnangagwa-scarf-yet-again/",
            "content": "By A Correspondent| Vice President Constantino Chiwenga turned heads at the National Heroes Acre today when he arrived for the Heroes Day commemorations wearing a scarf markedly different from President Emmerson Mnangagwas now-iconic Zimbabwe flag-themed neckwear.\n\nMnangagwas scarf, with its bold red, green, yellow, black, and white stripes, has been a constant feature of his public image since 2017.\n\nOver the years, it has transformed from a simple fashion statement into a potent political symbol, with various Zanu PF politicians donning similar scarves at rallies and official events to signal loyalty to the President.\n\nChiwengas decision to once again break from this unofficial dress code has reignited talk of factional tensions within the ruling party.\n\nRumours have long circulated that the Vice President is at loggerheads with Mnangagwa over succession, with influential businessman Kudakwashe Tagwirei believed to be Mnangagwas preferred heir  a move said to be opposed by Chiwenga and his allies.\n\nThe Heroes Day commemorations, meant to honour Zimbabwes liberation heroes, drew top government officials, diplomats, and thousands of citizens.\n\nBut Chiwengas scarf  or rather, his avoidance of Mnangagwas trademark version  became one of the most discussed moments of the day, underscoring how even minor sartorial choices can feed Zimbabwes ever-simmering political intrigue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Vice President Constantino Chiwenga turned heads at the National Heroes Acre today when he arrived for the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/chiwenga-snubs-mnangagwa-scarf-yet-again/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Snubs Mnangagwa Scarf Yet Again\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "SADC Explains Reason Why It Omitted Zambia, Others | Full Print",
            "url": "https://www.zimeye.net/2025/08/11/sadc-explains-reason-why-it-omitted-zambia-others-full-print/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:42",
            "date": "12 Aug 2025"
        },
        {
            "title": "Top Agronomist Dies",
            "url": "https://www.zimeye.net/2025/08/11/top-agronomist-dies/",
            "content": "By Business Reporter-Celebrated and prominent business executive, Dr Edworks Mhandu, executive director of Quton Seed Company, a subsidiary of Seed Co Zimbabwe, has died.\n\nHe was 67.\n\nHe passed away at the Trauma Centre in Harare on Saturday morning.\n\nWe are deeply saddened by the passing of Dr Edworks Mhandu this morning at Borrowdale Trauma Centre, a close relative said.\n\nA true icon in the agricultural sector, he dedicated his career to transforming the industry through his remarkable contributions at Seed Co and Quton.\n\nBeyond his professional excellence, he was a loving husband, a devoted father, an amazing grandfather, and an inspiration to many. His legacy will live on in the countless lives he touched.\n\nDr Mhandu was a key figure in the growth of the countrys agricultural sector, spearheading various programmes to support farmers across the country.\n\nHe previously served as MD for Seed Co Zimbabwe, the countrys largest seed producer in 2020, before he stepped down on medical grounds in 2022.\n\nProf Idah SitholeNiang, Dean of the Faculty of Science at the University of Zimbabwe, said she was devastated to learn about Dr Mhandus death.\n\nI am deeply shocked. My deepest condolences to his family, she said.\n\nI first met Dr Edworks Mhandu in biotech circles over a decade ago. For a while there, I thought he was a plant breeder, only to learn that he was in finance. Such was his brilliance in the seed sector. He then pursued his doctoral studies on Bt cotton and had the privilege of working with him on the subject.\n\nWe later co-authored a commissioned paper on GMOs that was well-received and widely read. He had planned to publish his doctoral thesis and had asked me to write the foreword. He knew the Biotech seed sector back to front and was instrumental in bringing the much-needed attention to GM cotton in Zimbabwe. My deepest condolences to his family and friends. He will be sorely missed.\n\nHe was born on 8 August 1958 at Marondamashanu in Chivhu district.\n\nDr Mhandu is survived by his wife Abigail, three children  Rufaro, Kudzai, Isheanesu and three grandchildren.\n\nMourners are gathered at 2 Innerleithan Road, Mandara.\n\n-Herald\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-Celebrated and prominent business executive, Dr Edworks Mhandu, executive director of Quton Seed Company, a subsidiary of Seed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/11/top-agronomist-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Agronomist Dies\"</span></a></p>",
            "time": "06:42",
            "date": "12 Aug 2025"
        }
    ]
}