{
    "news": [
        {
            "title": "ED Re-Hires Mugabe Top Aide",
            "url": "https://www.zimeye.net/2025/09/06/ed-re-hires-mugabes-top-aide/",
            "content": "By A Correspondent  Misheck Sibanda, the long-time Chief Secretary to the President and Cabinet under the late Robert Mugabe, has returned to public office after being appointed chairperson of the National Railways of Zimbabwe (NRZ) board.\n\nThe appointment, effective September 1, was announced by Mutapa Investment Fund chief executive officer John Mangudya and officially confirmed during a media briefing in Bulawayo this week.\n\nSibanda takes over from Advocate Mike Madiro.\n\nThe move marks a dramatic comeback for a man who was once one of Mugabes most trusted aides but who exited the civil service in the aftermath of the November 2017 coup that ended Mugabes 37-year rule.\n\nFollowing Operation Restore Legacy, led by then-General Constantino Chiwenga, the military compelled Mugabe to resign, ushering in Emmerson Mnangagwa as President.\n\nThat political shift saw widespread purges within the state bureaucracy, with Sibanda and other Mugabe loyalists replaced as Mnangagwa consolidated power.\n\nSibanda himself was succeeded by Martin Rushwaya, who became the Chief Secretary to the Cabinet and the President.\n\nFor years, he maintained a low profile, quietly working on memoirs before being recalled to national duty. His return highlights how Mugabe-era officials, once sidelined, are being reintegrated into state institutions under Mnangagwas administration.\n\nAddressing the media, Sibanda said he was honoured to lead efforts to revive NRZ, a parastatal that has long been the backbone of Zimbabwes transport system but has been crippled by decades of neglect, corruption and mismanagement.\n\nOur President has long recognised that NRZ is not delivering what it should to the economy. He has directed that its resuscitation be accelerated, and I am committed to ensuring this institution once again becomes a driver of growth, he said.\n\nNRZs collapse mirrors the wider decay of Zimbabwes parastatal sector. Once engines of national development, most state-owned enterprises have been systematically looted by Zanu PF elites since the Mugabe era, serving as vehicles for patronage and personal enrichment rather than public service.\n\nFrom the Grain Marketing Board to Air Zimbabwe, parastatals have been riddled with scandals, debt and inefficiency. NRZ, in particular, has suffered from the diversion of resources, opaque procurement deals and failed recapitalisation efforts tied to politically connected cartels.\n\nAt its peak, NRZ moved over 18 million tonnes of cargo annually and employed more than 20,000 workers. By 2017, output had plummeted to just 3.4 million tonnes, forcing industries to rely on costly road transport.\n\nThe deterioration not only increased logistics costs but also damaged highways as bulk minerals and agricultural goods were moved by trucks.\n\nMnangagwa has repeatedly promised to revive NRZ, with successive deals announced with Indian, Russian and Chinese partners  most of which have collapsed amid allegations of corruption.\n\nThis week, during his state visit to China, Mnangagwa revived talks with China Railway International Group (CRIG) over a proposed US$600 million package to rehabilitate the network.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Misheck Sibanda, the long-time Chief Secretary to the President and Cabinet under the late Robert Mugabe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/06/ed-re-hires-mugabes-top-aide/\">Continue reading<span class=\"screen-reader-text\"> \"ED Re-Hires Mugabe Top Aide\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "Police With Dogs Bash Masvingo Journalist, Tear Off Clothes, Grab Camera",
            "url": "https://www.zimeye.net/2025/09/06/police-with-dogs-bash-masvingo-journalist-tear-off-clothes-grab-camera/",
            "content": "By A Correspondent\n\nA disturbing scene unfolded in Masvingo on Thursday evening when police officers, accompanied by dogs, allegedly assaulted Masvingo Mirror Chief Photographer, Nyasha Mariga, before confiscating his work equipment.\n\nMariga was covering a dramatic standoff involving a mshikashika driver who had thrown himself under his vehicle to stop it from being impounded. Eyewitnesses said police officers reacted violently to Marigas attempts to capture the incident on camera. His cellphone and camera were seized, his shirt was torn, and he was taken into custody at Masvingo Central Police Station.\n\nOne bystander described the shocking events: The police went too far. They beat him up and humiliated him for simply doing his job.\n\nThe attack quickly sparked chaos in the city, with angry residents confronting the officers. Crowds reportedly forced the police to retreat, allowing the mshikashika driver to escape to loud cheers. A tow truck called to haul the vehicle away was also chased off after residents threatened to torch it.\n\nThe Masvingo Mirror condemned the assault and said Marigas detention was unlawful. A senior official at the paper demanded his immediate release, stressing: Nyasha has committed no crime. He is a fully accredited journalist with the Zimbabwe Media Commission and has every right to be on the scene taking pictures.\n\nMasvingo police spokesperson Inspector Kudakwashe Dhewa was not immediately available for comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A disturbing scene unfolded in Masvingo on Thursday evening when police officers, accompanied by dogs, allegedly assaulted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/06/police-with-dogs-bash-masvingo-journalist-tear-off-clothes-grab-camera/\">Continue reading<span class=\"screen-reader-text\"> \"Police With Dogs Bash Masvingo Journalist, Tear Off Clothes, Grab Camera\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "🟥 “Chivayo-Style” Tombstones Face Demolition in Bulawayo – Council Cracks Down on Lavish Grave Monuments",
            "url": "https://www.zimeye.net/2025/09/06/%f0%9f%9f%a5-chivayo-style-tombstones-face-demolition-in-bulawayo-council-cracks-down-on-lavish-grave-monuments/",
            "content": "Wicknell Chivayo at his mums grave\n\nBulawayo  Sunday, 8 September 2025\n\nBy Dorrothy Moyo | ZimEye | Wearing a solemn expression and dressed in casual shorts and a black T-shirt, Wicknell Chivayo stands alone before a towering grave monument built for his late mother. The polished black stonework and roofed structure, adorned with the word MUM in bold yellow flowers, dwarfs surrounding graves and resembles a private mausoleum more than a public cemetery plot.\n\nBut in Bulawayo, such extravagant tombstone designs are now under threat of demolition.\n\n City Council Declares Clampdown\n\nBulawayo Town Clerk Christopher Dube has issued a stern warning: tombstones erected at new cemeteries in defiance of the 2018 city policy will be demolished, citing the Cemeteries Act and Bulawayo Cemeteries Regulations of 1967.\n\nThe policy is clear, said Dube in the latest Health, Housing and Education Committee report. Only headstones are permitted. Residents who have put up tombstones in violation of this directive will be issued with demolition orders.\n\nThis directive specifically targets new cemeteries such as Athlone West, where graveyards are becoming increasingly difficult to manage due to overgrowth and restricted maintenance access.\n\n Chivayos Grave Sparks Debate\n\nAlthough Chivayos mother is not buried in a Bulawayo cemetery, his flamboyant show of wealth at her grave  complete with imported granite, a shaded roof, and designer finish  has reignited national debate over economic disparity, cultural excess, and now municipal policy enforcement.\n\nThe image of Chivayos monument has gone viral, with critics arguing it symbolizes unchecked privilege, even in death, while thousands of Zimbabweans are buried in unmarked or poorly maintained graves.\n\n Why the Ban?\n\nThe city says the new policy is practical, not punitive:\n\n Regulations at a Glance\n\nFamilies wishing to install a headstone must:\n\nSix known cases of non-compliance have already been documented, with councillors pushing for stronger enforcement and community awareness through radio, funeral parlours, and ward meetings.\n\n Running Out of Space\n\nAs Bulawayos burial space continues to shrink, the council is also encouraging cremation as a long-term solution.\n\nWhile Wicknell Chivayos mausoleum-like grave may escape municipal reach due to its location, it now stands as a symbol of a growing class divide  even in how the dead are remembered. Meanwhile, the City of Bulawayo is drawing a line: graves are for mourning, not monuments of wealth.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Wicknell Chivayo at his mum’s grave Bulawayo – Sunday, 8 September 2025 By Dorrothy Moyo | ZimEye | Wearing a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/06/%f0%9f%9f%a5-chivayo-style-tombstones-face-demolition-in-bulawayo-council-cracks-down-on-lavish-grave-monuments/\">Continue reading<span class=\"screen-reader-text\"> \"🟥 “Chivayo-Style” Tombstones Face Demolition in Bulawayo – Council Cracks Down on Lavish Grave Monuments\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "Councillor Guilty of US$20 000 Bribery",
            "url": "https://www.zimeye.net/2025/09/06/councillor-guilty-of-us20-000-bribery/",
            "content": " Ward 26 Councillor Mpumelelo Moyo convicted of demanding US$20 000 bribe from Labenmon Investments.\n\n Bulawayo magistrate Richard Ramaboea says overwhelming evidence linked Moyo to the offence.\n\n Caught red-handed at Labenmon representative Tsitsi Nyathis house during a ZACC trap.\n\n Defence plea: lawyer argues Moyo is a first-time offender, breadwinner, and money was recovered.\n\n Proposed sentence: six months wholly suspended on condition of community service at Emganwini Clinic.\n\n Bulawayo Deputy Mayor Edwin Ndlovu acquitted after lack of evidence.\n\n Case centres on 5.6-hectare Cowdray Park land earmarked for a cement plant.\n\n Sentencing set for Monday.\n\nBulawayo  Ward 26 Councillor Mpumelelo Moyo has been convicted of soliciting a US$20 000 bribe from Labenmon Investments in exchange for facilitating the approval of land earmarked for a cement plant in Cowdray Park.\n\nBulawayo provincial magistrate Richard Ramaboea found Moyo guilty of bribery on Friday and remanded him to Monday for sentencing.\n\nIn his ruling, Mr Ramaboea said there was overwhelming evidence linking Moyo to the offence, pointing to testimony from Labenmon Investments representative Tsitsi Nyathi, which was corroborated by the investigating officer. The court heard that Moyo persistently called Ms Nyathi demanding the money before being caught red-handed at her house receiving the cash.\n\nDefence Plea\n\nMoyos lawyer, Prince Butshe of Butshe and Associates, pleaded for leniency, arguing that his client is a first-time offender, a breadwinner supporting his wife and two young children, and that the money in question was recovered during the trap.\n\nThe mitigating factors outweigh the aggravating factors. According to Section 260 of the Criminal Law Codification Act, entrapment is a mitigating factor. I therefore appeal for six months imprisonment, wholly suspended on condition that Moyo performs community service at Emganwini Clinic, Butshe submitted.\n\nHe further warned that Moyo is likely to lose his councillorship as a result of the conviction.\n\nDeputy Mayor Cleared\n\nMoyo was initially charged alongside Bulawayo Deputy Mayor Councillor Edwin Ndlovu, but Ndlovu was acquitted after the State failed to provide evidence directly linking him to the alleged offence.\n\nZACC Sting Operation\n\nAccording to the State, Moyowho chaired the Finance and Development Committeedemanded the bribe to fast-track approval of a 5.6-hectare piece of land in Cowdray Park. The Zimbabwe Anti-Corruption Commission (ZACC) arrested him shortly after he received the cash at Ms Nyathis residence.\n\nMoyo now awaits sentencing on Monday, in a case that underscores ZACCs ongoing crackdown on corruption in local government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "🔴 Ward 26 Councillor Mpumelelo Moyo convicted of demanding US$20 000 bribe from Labenmon Investments. 🔴 Bulawayo magistrate Richard Ramaboea … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/06/councillor-guilty-of-us20-000-bribery/\">Continue reading<span class=\"screen-reader-text\"> \"Councillor Guilty of US$20 000 Bribery\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "Mnangagwa Regime Stalls Compensation for Widow of Protester Killed by Soldiers",
            "url": "https://www.zimeye.net/2025/09/06/mnangagwa-regime-stalls-compensation-for-widow-of-protester-killed-by-soldiers/",
            "content": "By A Correspondent\n\nThe Mnangagwa government is once again showing its disregard for justice, as Defence Minister Oppah Muchinguri-Kashiri moves to avoid compensating the widow of a man killed by soldiers during the brutal August 1, 2018 post-election protests.\n\nIn April 2025, Justice Maxwell Takuva ordered Muchinguri-Kashiri to pay US$122,235 to Suspicious Ziyambi, widow of Ishmael Kumire, a Harare vendor shot dead by soldiers during demonstrations over delayed election results.\n\nThe ruling acknowledged the unlawful killing and included US$112,235 for loss of support and US$10,000 for trauma endured by Ziyambi and her children.\n\nDespite the clear judgment, Muchinguri-Kashiri has applied to have the ruling rescinded, citing technical issues with her lawyer from the Attorney-Generals Office and claiming she only became aware of the default judgment on 13 August 2025. She argued she should not be penalised for the sins of her legal representative.\n\nThe Defence Minister also dismissed the damages as excessive and unreasonable, seeking to refer the matter back to the High Court Registrar for a full hearingeffectively delaying justice for the widow and her family.\n\nHuman rights activists condemn the move as yet another example of the Mnangagwa administration shielding its officials from accountability. This is a government that kills its citizens and then refuses to own up, said a source familiar with the case.\n\nThe application by Muchinguri-Kashiri has not yet been scheduled for hearing, leaving the widow waiting for compensation that could help her rebuild her shattered life. Critics say the administrations actions highlight a pattern of impunity and contempt for the rule of law in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Mnangagwa government is once again showing its disregard for justice, as Defence Minister Oppah Muchinguri-Kashiri moves … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/06/mnangagwa-regime-stalls-compensation-for-widow-of-protester-killed-by-soldiers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Stalls Compensation for Widow of Protester Killed by Soldiers\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "Police Officer Remanded Over Alleged Rape of Colleague…",
            "url": "https://www.zimeye.net/2025/09/06/police-officer-remanded-over-alleged-rape-of-colleague/",
            "content": "By A Correspondent\n\nA police officer stationed at Fairbridge in Bulawayo has been hauled before the courts on allegations of raping a female colleague after choking her inside a toilet.\n\nThe accused, whose name has been withheld to protect the identity of the complainant, appeared before Bulawayo Regional Magistrate Mark Dzira facing a charge of rape. He was remanded in custody to 16 September pending further proceedings.\n\nAccording to the State, the complainant had been drinking with friends when she excused herself to use the toilet. While inside, the accused allegedly forced his way in, grabbed her by the neck, and ordered her to undress while demanding sex.\n\nProsecutors told the court that the officer went on to fondle the victim, before pushing her to the ground and raping her despite her resistance.\n\nThe matter was later reported, resulting in the accuseds arrest and subsequent court appearance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A police officer stationed at Fairbridge in Bulawayo has been hauled before the courts on allegations of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/06/police-officer-remanded-over-alleged-rape-of-colleague/\">Continue reading<span class=\"screen-reader-text\"> \"Police Officer Remanded Over Alleged Rape of Colleague…\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "Of Spies, And Fake Journalists | Budhi Givhi | Full Text",
            "url": "https://www.zimeye.net/2025/09/05/of-spies-and-fake-journalists-budhi-givhi-full-text/",
            "content": "OF SPIES, AND FAKE JOURNALISTS \n\n I have many faults.But I am not petty. And I am not an antagonist of anybody who is not deserving of ire.\n\nSo when you see Bhudhi Ghivhi having a go at someone, it is not hate  it is because they have revealed themselves to be a devious fiend. \n\nOF SPIES, AND FAKE JOURNALISTS   I have many faults.But I am not petty. And I am not an antagonist of anybody who is not deserving of ire.So when you see Bhudhi Ghivhi having a go at someone, it is not hate  it is because they have revealed themselves to be apic.twitter.com/PIcCGTXhuy\n\nAnd here , as you see with your own eyes, is your respected journalist  that you defend with frothing mouths. \n\nAnybody who knows anything about the authentic journalism profession knows that a real journalist NEVER EVER reveals their sources nor shares private communications publicly  let alone screen shots!!JEEZUS. \n\nIt doesnt matter what point youre trying to win  the MOMENT you share screen shots of private communications, as a journalist, your reputation is now shot to shreds!! NOBODY in their right mind can ever trust you again!\n\nBecause you have shown that if someone speaks to you in confidence, if you fall out or have a disagreement in the future, you will reveal the private conversations!\n\nWhat Hopewell has done here is send the message to the ENTIRE WORLD that if someone whistle blows or talks to him in confidence, or gives him secret information  they now KNOW that he will unmask them in public if the situation suits him! \n\nTheres no ethical journalist like that.\n\nIm not a fan of Mliswa and am thrilled with the drama  and that he is being exposed for his spying shenanigans. But in revealing Mliswa, Daddy has also revealed HIMSELF!\n\nThis guy is a journalist in NAME only. An insult to true journalism.\n\nHe is now working as an influence mercenary, and acts as such on a daily basis.\n\nI keep telling you that the Hopewell that you and I once admired is LONG gone. Wake up!\n\nThere is no journalist that reveals private communication screen shots on social media just to prove a mundane point.NEVER.\n\nI mean  the guy even had the arrogance to PIN this tweet of him exposing sources/private communications. In a sane environment, that would be the end of his journalism career!\n\nBut he doesnt care because journalism is just a COVER under which he hides his real work. Muchasvinura henyu\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "OF SPIES, AND FAKE JOURNALISTS… 🇿🇼 ➡️ I have many faults.But I am not petty. And I am not an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/of-spies-and-fake-journalists-budhi-givhi-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"Of Spies, And Fake Journalists | Budhi Givhi | Full Text\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "Mugabe’s Top Aide Bounces Back",
            "url": "https://www.zimeye.net/2025/09/05/mugabes-top-aide-bounces-back/",
            "content": "By A Correspondent  Misheck Sibanda, the long-time Chief Secretary to the President and Cabinet under the late Robert Mugabe, has returned to public office after being appointed chairperson of the National Railways of Zimbabwe (NRZ) board.\n\nThe appointment, effective September 1, was announced by Mutapa Investment Fund chief executive officer John Mangudya and officially confirmed during a media briefing in Bulawayo this week.\n\nSibanda takes over from Advocate Mike Madiro.\n\nThe move marks a dramatic comeback for a man who was once one of Mugabes most trusted aides but who exited the civil service in the aftermath of the November 2017 coup that ended Mugabes 37-year rule.\n\nFollowing Operation Restore Legacy, led by then-General Constantino Chiwenga, the military compelled Mugabe to resign, ushering in Emmerson Mnangagwa as President.\n\nThat political shift saw widespread purges within the state bureaucracy, with Sibanda and other Mugabe loyalists replaced as Mnangagwa consolidated power.\n\nSibanda himself was succeeded by Martin Rushwaya, who became the Chief Secretary to the Cabinet and the President.\n\nFor years, he maintained a low profile, quietly working on memoirs before being recalled to national duty. His return highlights how Mugabe-era officials, once sidelined, are being reintegrated into state institutions under Mnangagwas administration.\n\nAddressing the media, Sibanda said he was honoured to lead efforts to revive NRZ, a parastatal that has long been the backbone of Zimbabwes transport system but has been crippled by decades of neglect, corruption and mismanagement.\n\nOur President has long recognised that NRZ is not delivering what it should to the economy. He has directed that its resuscitation be accelerated, and I am committed to ensuring this institution once again becomes a driver of growth, he said.\n\nNRZs collapse mirrors the wider decay of Zimbabwes parastatal sector. Once engines of national development, most state-owned enterprises have been systematically looted by Zanu PF elites since the Mugabe era, serving as vehicles for patronage and personal enrichment rather than public service.\n\nFrom the Grain Marketing Board to Air Zimbabwe, parastatals have been riddled with scandals, debt and inefficiency. NRZ, in particular, has suffered from the diversion of resources, opaque procurement deals and failed recapitalisation efforts tied to politically connected cartels.\n\nAt its peak, NRZ moved over 18 million tonnes of cargo annually and employed more than 20,000 workers. By 2017, output had plummeted to just 3.4 million tonnes, forcing industries to rely on costly road transport.\n\nThe deterioration not only increased logistics costs but also damaged highways as bulk minerals and agricultural goods were moved by trucks.\n\nMnangagwa has repeatedly promised to revive NRZ, with successive deals announced with Indian, Russian and Chinese partners  most of which have collapsed amid allegations of corruption.\n\nThis week, during his state visit to China, Mnangagwa revived talks with China Railway International Group (CRIG) over a proposed US$600 million package to rehabilitate the network.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Misheck Sibanda, the long-time Chief Secretary to the President and Cabinet under the late Robert Mugabe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/mugabes-top-aide-bounces-back/\">Continue reading<span class=\"screen-reader-text\"> \"Mugabe’s Top Aide Bounces Back\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "Robbers Hit Bureau de Change, Grab US$18K",
            "url": "https://www.zimeye.net/2025/09/05/robbers-hit-bureau-de-change-grab-us18k/",
            "content": "By A Correspondent Armed robbers struck again in Bulawayo on Wednesday morning, storming a bureau de change in the citys central business district and escaping with more than US$18,000 and R151,000 after overpowering a security guard.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident, describing it as a highly coordinated operation that pointed to the possibility of an inside job.\n\nThe robbery took place at about 8AM at Nkolozi Investments, located on the first floor of the CIPF Building at the corner of Jason Moyo Street and 9th Avenue.\n\nThe three suspects walked into the complex pretending to be customers. They then attacked the guard, disarmed him, and demanded access to the safes and a remote key. They tampered with the CCTV system, erasing footage from that morning, before seizing employees cellphones and cash, said Comm Nyathi.\n\nHe said police were investigating leads and warned that the net was closing in on the suspects. We suspect this could be an inside job because of the precision with which the robbery was executed. However, I want to assure the public that it is only a matter of time before the culprits are apprehended. Investigations are underway.\n\nA witness said the robbers fled on foot, suggesting they may have had a getaway car parked nearby. It happened so fast that no one could react. We were all shocked and immobilised. It was terrifying, said the witness.\n\nCompany officials declined to comment, citing ongoing investigations.\n\nThe latest heist adds to a worrying surge in violent robberies that has gripped Bulawayo in recent months. Criminal gangs have increasingly targeted forex traders, businesses, and individuals handling large sums of money, often using military-style precision.\n\nJust last month, suspected robbers shot and injured a 33-year-old man believed to be a foreign currency dealer before robbing him of US$4,000 and R60,000.\n\nIn one of the most high-profile robberies in recent memory, gunmen staged a daring raid on Ecobank in Bulawayo in October last year, intercepting a security van transporting cash. The robbers fled with US$4 million, the countrys biggest cash heist in years, sparking national outrage and exposing the extent of organised criminal syndicates operating in the city.\n\nSecurity analysts say Bulawayos rising crime wave reflects broader socio-economic hardships, with desperate individuals teaming up with sophisticated syndicates  some with alleged links to rogue elements in the security services.\n\nPolice have since intensified crackdowns on armed robbery gangs, urging businesses to tighten security protocols, avoid moving large sums of money without adequate protection, and install tamper-proof surveillance systems.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Armed robbers struck again in Bulawayo on Wednesday morning, storming a bureau de change in the city’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/robbers-hit-bureau-de-change-grab-us18k/\">Continue reading<span class=\"screen-reader-text\"> \"Robbers Hit Bureau de Change, Grab US$18K\"</span></a></p>",
            "time": "08:35",
            "date": "07 Sep 2025"
        },
        {
            "title": "WATCH LIVE: Benin Versus Zimbabwe",
            "url": "https://www.zimeye.net/2025/09/05/watch-live-benin-versus-zimbabwe/",
            "content": "video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "08:35",
            "date": "07 Sep 2025"
        }
    ]
}