{
    "news": [
        {
            "title": "Lungu Family Using Corpse To Negotiate Dropping Charges?",
            "url": "https://www.zimeye.net/2025/06/11/lungu-family-using-corpse-to-negotiate-dropping-charges/",
            "content": "comments\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "comments",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "ED Block Nears Completion",
            "url": "https://www.zimeye.net/2025/06/11/ed-block-nears-completion/",
            "content": "By WestProp Holdings- In the heart of Millennium City, where architectural ambition meets Zimbabwean heritage, the under-construction ED Block stands as a beacon of progressive urban living.\n\nHandover of individual apartments is expected early next year.\n\nNamed in honor of His Excellency, President Emmerson Mnangagwa, this distinguished six-story residential masterpiece was ground-broken in November 2023, marking a significant chapter in Harares evolving skyline.\n\nIt became the first six-story residential building in the northern suburbs with indications that the next block will have 10 floors.\n\nSituated within a live, work, shop and play estate that houses the prestigiousRadisson serviced hotel apartments(also under construction) and the soon-to-be-built Mall of Zimbabwe, the building is not just a residential spaceit is a symbol of Zimbabwes commitment to modernity, sustainability, and cultural reverence.\n\nFrom its foundation, the vision for ED Block was clear: to create a landmark that integrates contemporary design with ecological responsibility while embracing Zimbabwes architectural heritage.\n\nThe apartment buildings faade is a captivating blend of sleek, geometric precision and cascading vertical gardens, breathing life into the built environment. These living walls are more than aesthetic flourishes; they function as natural air purifiers, temperature regulators, and urban sanctuariesechoing Zimbabwes rural homesteads, where courtyards foster tranquility and community. By incorporating biophilic design elements, the block stands as a pioneer of climate-responsive architecture in Zimbabwe, forging a deep connection between residents and nature.\n\nExpansive floor-to-ceiling windows frame panoramic views of Harares dynamic cityscape while ensuring abundant natural light. This strategic glazing reduces reliance on artificial lighting and cooling systems, reinforcing the buildings sustainability objectives. Cross-ventilation enhances indoor air circulation, making each apartment a model of energy-efficient living.\n\nInside, the apartments embody spatial ingenuity, where intelligent layouts maximize functionality without sacrificing elegance. Open-plan designs allow fluid adaptability to diverse lifestyles, ensuring comfort and efficiency. Each residence extends outward onto generous private balconiespersonal oases for relaxation, urban gardening, or communal gatherings, seamlessly blending urban vibrancy with Zimbabwes cultural ethos of shared living.\n\nThe architectural language of ED Block is refined minimalism, expressed through clean lines and locally sourced materials, including steel and glass. This thoughtful material selection creates continuity between Zimbabwes past and future, bridging ancestral craftsmanship with modern construction techniques.\n\nMore than a residential complex, ED Block is an architectural manifesto, embodying a future where city living is in balance with nature, culture, and innovation. Its dedication to sustainability, intelligent design, and cultural integration positions it as a leader in responsible urban developmentnot just in Harare, but across Zimbabwe and beyond.\n\nAs awards for architectural excellence and urban innovation are considered, ED Block emerges as a rightful contender, setting an unparalleled precedent for the next generation of Zimbabwean living. It is not merely a buildingit is a statement of leadership, a beacon of progress, and a testament to Harares bright future.\n\nSpeaking at the ground breaking ceremony in November 2023  WestProp chief executive Mr Ken Sharpe had this to say: Today marks a very important day in our milestone achievements. We are breaking ground for the construction ofMillennium Heights Block 4 luxury apartments, and we continue to move towards achieving our billion brick vision by 2050.\n\nLinks:\n\nRadisson serviced hotel apartments:https://www.westprop.com/developments/millenium-heights/radisson-serviced-apartments-harare-zimbabwe/\n\nMillennium Heights Block 4 luxury apartments:https://www.westprop.com/developments/millenium-heights/apartments-block-4/\n\nImage Links:https://www.westprop.com/developments/millenium-heights/apartments-block-4/\n\n-This Article was sponsored by WestProp Holdings\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By WestProp Holdings- In the heart of Millennium City, where architectural ambition meets Zimbabwean heritage, the under-construction ED Block stands … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/11/ed-block-nears-completion/\">Continue reading<span class=\"screen-reader-text\"> \"ED Block Nears Completion\"</span></a></p>",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Maguwu Exposes Massive Lithium Looting Scandal",
            "url": "https://www.zimeye.net/2025/06/11/maguwu-exposes-massive-lithium-looting-scandal/",
            "content": "By Business Reporter-The Farai Maguwu-led Natural Resources lobby grouping,Centre for Natural Resource Governance (CNRG) said the government isina massive lithium spree.\n\nMaguw said this is happening on President Emmerson Mnangagwas watch, warning that the country is exporting its future for a pittance while local communities are left in ruin.\n\nIn a statement, CNRG said up to3,000 tons of lithium ore are being extracted and exported dailyamounting to an estimated1.62 million tons in just the past 18 monthswith little to no benefit accruing to the country or its citizens.\n\nThe watchdogcriticisedthe governments newly announced 2027 ban on raw lithium exports as too little, too late, warning that by then, Zimbabwes most strategic resource would be depleted and sold off to foreign companiesmostly Chinesewith little value addition.\n\nThis timeline is too distant, said CNRG. At current extraction and export levels, the nation will have exported millions of tons of unprocessed lithium ore by then, enriching foreign capital while eroding our chances for sustainable economic development.\n\nZimbabwe, home to Africas largest lithium reserves and one of the worlds most strategic sourcesforthe mineral essential to electric vehicle and battery production, is now at risk of losing control over its future.\n\nCNRG points to a combination ofweak regulation, corruption, opaque deals, andporous bordersthat have enabled rampant smuggling into neighboring South Africa and Mozambique.\n\nWorse still, affected communities in lithium-rich areas such asGoromonzi, Buhera, Mutoko, and Bikitahave become what CNRG terms sacrifice zones, plagued by water shortages, forced displacements, environmental degradation, and social instability.\n\nWomen and children are particularly vulnerable, facing heightened risk of exploitation and economic insecurity.\n\nWhile President Mnangagwas government continues to trumpet foreign direct investment in mining as avictory for development, CNRG paints a much darker pictureone in whichelite networks,foreign multinationals, andpolitically connected cartelsare plundering national resources with impunity.\n\nThe continued extraction without robust beneficiation and a regulatory framework is contradictory to the African Mining Vision and Zimbabwesownbeneficiation policy, said CNRG, which called for animmediate moratorium on lithium exports, anaudit of current mining operations, andurgent reformsto the Mines and Minerals Act.\n\nChinese companies dominate the lithium sector in Zimbabwe, raising additional concerns over labor rights abuses, unfair compensation practices, and environmental irresponsibility.\n\nDespite widespread community resistance, most mining contracts are negotiated behind closed doors, often without consultation or environmental assessments.\n\nZimbabwe must assert control over its critical minerals, ensure just transitions for its communities, and align its natural resource governance with the aspirations of its citizensnot the short-term interests of foreign buyers and elite networks, the statement concludes.\n\nIf no decisive action is taken, Zimbabwe risks turning one of the worlds most promising lithium booms intoyetanother chapter of lost opportunity, exploitation, and environmental ruin.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter- The Farai Maguwu-led Natural Resources lobby grouping, Centre for Natural Resource Governance (CNRG) said the government is in a massive lithium … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/11/maguwu-exposes-massive-lithium-looting-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Maguwu Exposes Massive Lithium Looting Scandal\"</span></a></p>",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Samba Boys Seal World Cup Qualification",
            "url": "https://www.zimeye.net/2025/06/11/samba-boys-seal-world-cup-qualification/",
            "content": "Sports Correspondent\n\nBrazil have officially secured their place at the upcoming FIFA World Cup after a narrow but crucial 1-0 victory over Paraguay in the South American qualifiers.\n\nThe win sees the Samba Boys join arch-rivals Argentina and Ecuador as the latest teams from the CONMEBOL region to book their tickets to the global showpiece. Brazils qualification continues their impressive tradition of never missing a World Cup.\n\nIn other qualifying matches, Argentina were held to a 1-1 draw by Colombia, while Ecuador battled to a goalless stalemate against Peru. Uruguay boosted their chances with a convincing 2-0 win over Venezuela, and Bolivia registered a surprise 2-0 victory against Chile.\n\nWith only a few matches remaining, the race for the remaining qualification spots intensifies as South American powerhouses fight for a place on footballs biggest stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Brazil have officially secured their place at the upcoming FIFA World Cup after a narrow but crucial 1-0 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/11/samba-boys-seal-world-cup-qualification/\">Continue reading<span class=\"screen-reader-text\"> \"Samba Boys Seal World Cup Qualification\"</span></a></p>",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Works at the park progressing well",
            "url": "https://www.zimeye.net/2025/06/11/works-at-the-park-progressing-well/",
            "content": "Current status of the burial site construction of former late president Edgar Lungu at Embassy Park\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Current status of the burial site construction of former late president Edgar Lungu at Embassy Park",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Chivayo Bails Out Struggling Bulawayo Giants Bosso",
            "url": "https://www.zimeye.net/2025/06/11/chivayo-bails-out-struggling-bulawayo-giants-bosso/",
            "content": "Sports Correspondent\n\nBusinessman Wicknell Chivayo has pledged US$250,000 in cash to Highlanders Football Club to support the teams efforts to become more competitive.\n\nChivayo said the donation honours the memory of his late uncle, former Vice President John Landa Nkomo, and reflects his own deep passion for football.\n\nIn a statement, Chivayo announced:It is my greatest pleasure to avail sponsorship worth US$250,000 in cash to Highlanders FC, as my small token to assist the club in its various administrative requirements. This is just part of a broader sponsorship package of US$1 million that will run over the next year to help the club secure new talent and cover player sign-on fees in order to foster a more competitive 2025 Premier Soccer League.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Businessman Wicknell Chivayo has pledged US$250,000 in cash to Highlanders Football Club to support the team’s efforts to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/11/chivayo-bails-out-struggling-bulawayo-giants-bosso/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Bails Out Struggling Bulawayo Giants Bosso\"</span></a></p>",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "The Power of Artificial Insemination",
            "url": "https://www.zimeye.net/2025/06/11/the-power-of-artificial-insemination/",
            "content": "By Dr. Trywell Muzerengi\n\nArtificial insemination (AI) is revolutionising livestock production in Zimbabwe and around the world, allowing farmers to improve the quality of their herds without the need for a live bull.\n\nAt its core, AI involves introducing semencollected from genetically superior bullsinto a female animals reproductive tract to achieve conception. This technique offers a wide range of benefits that traditional breeding methods cannot match.\n\nOne of the biggest advantages of AI is the ability to access semen from top-tier bulls sourced globally. This allows farmers to enhance the genetic pool of their herds, boosting productivity, resilience, and overall animal quality.\n\nAnother benefit is controlled breeding. Through a process called synchronisation, female animals can be induced to go into heat at the same time. As a result, they will conceive and calve around the same period, allowing for better planning, streamlined management, and more predictable production cycles.\n\nAI also opens the door to sexed semena scientific breakthrough that enables farmers to choose the gender of the offspring. This is particularly useful for dairy farmers who often prefer female calves for milk production.\n\nAdditionally, AI significantly reduces the risk of spreading sexually transmitted diseases that can be passed through natural mating. By eliminating the need to transport bulls between farms, AI also cuts down on logistics costs and reduces the risk of animal stress and injuries.\n\nIn short, artificial insemination is safer, more efficient, and far more strategic than traditional methods of breeding. It is a modern solution that puts the farmer in controlboosting productivity, protecting animal health, and helping build a stronger and more sustainable livestock industry in Zimbabwe.\n\nemail:[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Artificial insemination (AI) is revolutionising livestock production in Zimbabwe and around the world, allowing farmers to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/11/the-power-of-artificial-insemination/\">Continue reading<span class=\"screen-reader-text\"> \"The Power of Artificial Insemination\"</span></a></p>",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Lungu repatriation postponed",
            "url": "https://www.zimeye.net/2025/06/11/lungu-repatriation-postponed/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "Mushoriwa Defies Tshabangu, Publicly Declares His Use Of CDF",
            "url": "https://www.zimeye.net/2025/06/11/mushoriwa-defies-tshabangu-publicly-declares-his-use-of-cdf/",
            "content": "By A Correspondent Citizens Coalition for Change (CCC) Member of Parliament for Dzivaresekwa,Edwin Mushoriwa,  released a detailed report outlining how he utilised the 2024 Constituency Development Fund (CDF), reinforcing his commitment to transparency and people-driven governance.\n\nThe CDF, allocated annually through the national budget under the Parliamentary vote, is nominally set at USD $50,000 per MP. Since the end of the Government of National Unity (GNU) in 2013, the fund has been disbursed in Zimbabwean dollars at the prevailing official bank rate.\n\nMushoriwa a Nelson Chamisa loyalist, has remained steadfast and refused to align with the controversial Sengezo Tshabangu faction, and  focuses on accountability and grassroots development.\n\nBelow is the full CDF utilisation report as presented to his constituency:\n\nFrom:Hon. Edwin MushoriwaMP  Dzivaresekwa Constituency\n\nSubject:2024 Constituency Development Fund (CDF) Utilisation Report\n\nIn line with Chapter 17 of the national constitution on Public Finance, and in accordance with subsidiary legislation that promotes accountability and transparency, I hereby present the Dzivaresekwa 2024 CDF utilisation report on behalf of the Dzivaresekwa Constituency Development Fund Committee.\n\nNo CDF was released in 2023 due to the general elections.\n\nIn 2024, Dzivaresekwa Constituency received its CDF allocation in mid-April 2025, amounting toZWL1,326,825, equivalent toUSD $50,000using the official bank rate of1:26.53.\n\nAs many of you know, about 70% of transactions in Zimbabwe are conducted in foreign currency, while only 30% are done in local currency. However, most service providers and businesses charge using the parallel market rate, significantly diminishing the CDFs value in real USD terms.\n\nAfter careful consideration of submitted proposals, the Dzivaresekwa CDF Committee resolved to prioritise projects inhealth,education, andinfrastructure development. Three key projects were undertaken:\n\nA 20-metre modern footbridge was built across the Dzivaresekwa River, linkingDzivaresekwa 3andDzivaresekwa Extension. This bridge provides safer and more convenient movement between the main settlement and Extension areas.\n\nThe bridge benefits schoolchildren from Dzivaresekwa Extension who attendNumber 4, Number 6 Primary Schools, and evenDzivaresekwa High 1. Residents commuting toMachipisa,Westgate, and other locations will also enjoy improved accessibility.\n\nBeyond transport, the bridge enhances social cohesion by facilitating easier family and community interactionsparticularly critical during the rainy season and times of sewage overflow.\n\nDzivaresekwa Extension Government Clinic, known for its affordable $1 consultations, lacked functional public toilets. Using CDF funds, we constructed modern, gender-sensitive ablution facilities. The new toilets are tiled, sewer-connected, and fitted with up-to-date sanitary hardware.\n\nResponding to a request by the School Development Committee, a12kW solar systemwas installed atGombo Primary School, powering the computer lab, administration block, borehole, and the headmasters residence.\n\nKey features include:\n\nThe system ensures uninterrupted learning and operations. In addition, we installed an8-camera CCTV security system, and we are now procuringinteractive smartboardsto further enhance the schools digital learning capacity.\n\nI would like to thank:\n\nAs we submit our 2024 financial acquittals and apply for the 2025 CDF, we now invite development project suggestions from all wards in Dzivaresekwa Constituency. Deadline for submission is20 June 2025.\n\nPlease send your proposals to:\n\nTogether Stronger,\n\nEdwin MushoriwaMP  Dzivaresekwa ConstituencyTel: +263 772 811 181\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– Citizens Coalition for Change (CCC) Member of Parliament for Dzivaresekwa, Edwin Mushoriwa, released a detailed report outlining how … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/11/mushoriwa-defies-tshabangu-publicly-declares-his-use-of-cdf/\">Continue reading<span class=\"screen-reader-text\"> \"Mushoriwa Defies Tshabangu, Publicly Declares His Use Of CDF\"</span></a></p>",
            "time": "20:40",
            "date": "12 Jun 2025"
        },
        {
            "title": "ZiG To Stay, Declares RBZ Boss John Mushayavanhu Despite Rising Inflation",
            "url": "https://www.zimeye.net/2025/06/11/zig-to-stay-declares-rbz-boss-john-mushayavanhu-despite-rising-inflation/",
            "content": "By A Correspondent\n\nReserve Bank of Zimbabwe (RBZ) Governor Dr. John Mushayavanhu has reaffirmed the governments commitment to the newly introduced Zimbabwe Gold (ZiG) currency, despite rising inflation figures that have sparked concern among citizens and businesses alike.\n\nIn a statement yesterday, Dr. Mushayavanhu defended the central banks approach and assured the public that authorities remain firmly in control of the economic situation.\n\nSaid Mushayavanhu: Our prudent monetary policy is designed to stabilise the prices of commodities and maintain the value of the currency.\n\nHis remarks come in response to fresh data showing an increase in annual inflationmeasured in ZiGfrom 85.7% in April to 92.1% in May. The spike has triggered fresh anxiety across the country, with many fearing a return to the hyperinflationary pressures of the past.\n\nA Reserve Bank of Zimbabwe official said on Tuesday:We are on top of the situation.The rise in inflation is being carefully monitored, and we are confident that it will not erode the purchasing power of consumers in the long run.\n\nThe RBZ official attributed the inflationary uptick to transitional effects following the introduction of ZiG, and reiterated that the currency reform remains a cornerstone of broader efforts to stabilise Zimbabwes economy.\n\nHe further noted that efforts are being made to maintain the stability of both the ZiG and the prices of essential goods.\n\nZimbabweans must understand that the ZiG is backed by real assets, including gold and foreign currency reserves.\n\nThis is not just a symbolic gestureit is a real foundation for long-term economic confidence.\n\nDespite the central banks reassurances, economic analysts and citizens continue to watch developments closely, especially as inflationary pressures show little sign of abating.\n\nFor now, the Reserve Banks message is clear: the ZiG is not going anywhere.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Reserve Bank of Zimbabwe (RBZ) Governor Dr. John Mushayavanhu has reaffirmed the government’s commitment to the newly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/11/zig-to-stay-declares-rbz-boss-john-mushayavanhu-despite-rising-inflation/\">Continue reading<span class=\"screen-reader-text\"> \"ZiG To Stay, Declares RBZ Boss John Mushayavanhu Despite Rising Inflation\"</span></a></p>",
            "time": "20:40",
            "date": "12 Jun 2025"
        }
    ]
}