{
    "news": [
        {
            "title": "Chiwenga Buries Four (4) In One Week",
            "url": "https://www.zimeye.net/2025/01/27/chiwenga-buries-four-4-in-one-week/",
            "content": "By Munacho Gwamanda-Acting President ConstantinoChiwenga has presided over an unusual and grim seriesof state burials in one week, raising eyebrows about the increasing number of high-profile deaths linked to the post-2017 coup power structure.\n\nLast Wednesday, Chiwenga supervised a triple burial at the National Heroes Acre, laying to rest John Bvundura, Chen Chimutengwende, and Retired Major General Solomon Siziba.\n\nToday, he returns to the revered site to bury yet anothernational hero,Justin Mupamhanga, who passed away last Wednesday.\n\nSince the 2017 coup that catapulted Mnangagwa to power,Chiwengasallies have been plagued by an unsettling series of deaths, leaving political analysts and the public questioning whether this pattern is coincidental or a reflection ofZimbabwesmurky political waters.\n\nNotably, the following figures have succumbed under mysterious or sudden circumstances:Perrance Shiri, the former Air Force Commander and Minister of Agriculture, a close military ally of Chiwenga during the coup, died reportedly of COVID-19, although rumours of foul play circulated widely.Sibusiso Moyo,ZimbabwesForeign Affairs Minister, known for announcing the coup in 2017, died of COVID-19 complications, sparking speculation about political motives.Joel Biggie Matiza, the Transport Minister and another staunch ally of Chiwengaalsosuccumbed during a COVID-19 surge, though the timing of these deaths raised eyebrows.General Amoth Chingombe A close collaborator of Chiwenga during the 1992 drought relief operations, his demise added to the growing list of fallen comrades.Douglas Nyikayaramba The retired Major General and a confidant ofChiwenga,also passed away under suspicious circumstances.\n\nMupamhangasdeath adds another layer to this narrative.\n\nA war veteran who joined the liberation struggle in 1975, hebecame a key figure inZimbabwesintelligence and economic strategy.\n\nAs Deputy Chief Secretary to the President and Cabinet, Mupamhangaplayed a pivotal rolein monitoring government programs, particularly during crises like the 1992 drought and the early 2000s food shortages.\n\nMupamhangasretirement in 2019, orchestrated by Mnangagwa, marked his quiet exit from public service after years of significant contributions toZimbabwesgovernance.\n\nWhile state funerals arecommonfor those declared national heroes, the frequency of these burials underChiwengaswatchand the mysterious patterns surrounding his inner circlepaint asomberpicture.\n\nQuestions linger about the extent of political rivalries and whether these deaths signal deeper fissures within the ruling Zanu PF.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Acting President Constantino Chiwenga has presided over an unusual and grim series of state burials in one week, raising eyebrows … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/chiwenga-buries-four-4-in-one-week/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Buries Four (4) In One Week\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Top Zanu PF Official  in Terrible Road Accident",
            "url": "https://www.zimeye.net/2025/01/27/top-zanu-pf-official-in-terrible-road-accident/",
            "content": "By A Correspondent\n\nTatenda Chinoda Dhege, a senior official in the office of Zanu PF National Party Chairperson Oppah Muchinguri-Kashiri, narrowly escaped death on Friday night after being involved in a horrific road accident. Dhege, who serves as the partys director at the headquarters in Harare, was driving a white Toyota Hilux Revo when the incident occurred.\n\nAccording to sources within Zanu PF, Dhege was returning home from the Buhera office when the accident took place. He failed to stop at the T-junction where the road intersects with the Murambinda-Chivhu Highway. He was supposed to turn right onto the highway towards Mashaka Village in Chief Nerutangas area, Buhera, but instead, he veered off the road and crashed into a tree, a Zanu PF insider explained.\n\nThe vehicle rolled multiple times and eventually landed on its roof. The source further speculated, It is suspected that the vehicles brakes failed, which may have contributed to the accident. Fortunately, Dhege was not injured in the crash, although his car sustained severe damage.\n\nNo official comment could be obtained from the police.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tatenda Chinoda Dhege, a senior official in the office of Zanu PF National Party Chairperson Oppah Muchinguri-Kashiri, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/top-zanu-pf-official-in-terrible-road-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zanu PF Official  in Terrible Road Accident\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "High Pass Rate For November 2024 College Students",
            "url": "https://www.zimeye.net/2025/01/27/high-pass-rate-for-november-2024-college-students/",
            "content": "By Munacho Gwamanda- The Higher Education Ministry has said it recorded a 67% pass rate in the October/November 2024 National Foundation Certificate (NFC) to Higher National Diploma (HND) examinations.\n\nThe Higher Education Examinations Council (HEXCO) conducts the college exams.\n\nThe results were announced last Friday, and HEXCO centres were advised to start collecting results from their respective regions on Wednesday, January 29, 2025.\n\nOn Friday, Professor Fanuel Tagwira, Permanent Secretary for Higher and Tertiary Education, Innovation, Science and Technology Development, said 67 per cent of students succeeded.\n\nIn the November/December 2023 exams, HEXCO recorded a 68 per cent pass rate, marking a major improvement from the 60 per cent pass rate achieved in 2022.Tagwira thanked all stakeholders involved in the examination process for contributing to the high pass rate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- The Higher Education Ministry has said it recorded a 67% pass rate in the October/November 2024 National … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/high-pass-rate-for-november-2024-college-students/\">Continue reading<span class=\"screen-reader-text\"> \"High Pass Rate For November 2024 College Students\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Retail Giant N Richards Shuts Two Harare Outlets",
            "url": "https://www.zimeye.net/2025/01/27/retail-giant-n-richards-shuts-two-harare-outlets/",
            "content": "By Business Reporter- One of thecountryslargest retailers, N Richards, has closed its Hatcliffe and Tynwald outlets, signalling deeper cracks in the formal retail sector as businesses buckle under economic strain.\n\nThe closures come on the heels of widespread challenges facing formal retailers.\n\nMajor chains, including OK Zimbabwe, are reportedly facing difficulties in restocking due to the ZIG crisis.\n\nThe Confederation of Zimbabwe Retailers (CZR) has also sounded the alarm on the viability of formal retail shops.\n\nThecountrysformal retail sector has struggled to compete with the unregulated informal market, which dominates by avoiding taxes, licensing fees, and compliance with labour laws.\n\nCZR attributes the closures to the dual currency system, forcing retailers to accept ZWL while operating in a dollarized supply chain.\n\nThe economic turbulence has not spared big names:\n\nIn a statement, CZR expressed grave concern over the closures, highlighting the severe consequences of an unforgiving economic environment:\n\nThe continued closure of formal retail and wholesale businesses underscores the crisis. The fiscal, monetary, regulatory, and statutory frameworks have created an uneven playing field. While formal businesses crumble, the informal sector thrives unchecked, eroding market share.\n\nCZR has called on President Emmerson Mnangagwa to address these challenges and stabilize the sector urgently.\n\nThe closures evoke memories of the 2008 hyperinflation crisis when businesses shut down en masse due to the collapse of the Zimbabwean dollar.\n\nWith skyrocketing operational costs and dwindling consumer purchasing power, Zimbabwe risks repeating history if urgent measuresare not takento protect the formal economy.\n\nNRichardsdecision to close two outlets adds to a growing list of casualties in thecountrysretail sector, reflecting the worsening state of the economy and raising questions about the future of formal businessesin the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter- One of the country’s largest retailers, N Richards, has closed its Hatcliffe and Tynwald outlets, signalling deeper cracks in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/retail-giant-n-richards-shuts-two-harare-outlets/\">Continue reading<span class=\"screen-reader-text\"> \"Retail Giant N Richards Shuts Two Harare Outlets \"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Seh Calaz Challenges Winky D to a Clash…",
            "url": "https://www.zimeye.net/2025/01/27/seh-calaz-challenges-winky-d-to-a-clash/",
            "content": "By A Correspondent\n\nSeh Calaz has publicly called for a clash with Winky D.\n\nIn a statement over the weekend, Seh Calaz wrote:Winky D DiBigman, good show mumusha maMambo yesterday . I challenge you to a clash anytime, anywhere. If youre afraid of a clash, we can do a show with different sets and let the audience decide. If you win, Ill know youre still Bigman, as you were before. The proceeds should go to charityhelping the less fortunate, including the blind, the disabled, street kids, and all those suffering.\n\nRemember back when Daddy D, Badman, and Sniper gave you your first clashes? You were just starting out, but now its your time. Lets face off on stage and let the people decide.\n\nWinky D has been avoiding diss tracks for years, but at least Mambo gave him a chance to respond quickly. Now lets throw another track into the speakers and see what happens!\n\nTo Mbare, the bands, and the people of Zimbabwethank you for showing the world that were not violent. Some tried to paint us as troublemakers, but Mbare proved that we are free and peaceful. And to those who have been critical, including those who have been handed cars by Sir Wicknell, its all rooted in jealousy and bad mind. If it were Mapfumo, I would understand, but Sir Wicknell? Keep doing your thing!\n\nAs for the complaints about being sabotaged or excluded from showslet me remind you. For 12 years, Ive been blocked from over 50 shows, and thats just the beginning of the story. Yet, we keep pushing through. You all talk about how we should behave, but who are you to decide whats good for us?\n\nThe SWAN show was proof that we are not trying to tear anyone down. If Winky D is on the poster, theyll remove me, and thats how toxic things have become. Its clear that there are forces at play that want to stop us from succeeding.\n\nBut the truth is, even the organizers of Swan Showwho came to introduce Fodya at Mbare, our home groundfelt threatened. They were afraid to face the reality of the situation, but thats the nature of business. People with money dont have the time to listen to their fans and supporters. Its a harsh world.\n\nThank you for reading, Bhangwela Famous Paragraph!!! Yes, youve read it all .\n\nFor all the real entertainment and Dancehall music lovers!!!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Seh Calaz has publicly called for a clash with Winky D. In a statement over the weekend, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/seh-calaz-challenges-winky-d-to-a-clash/\">Continue reading<span class=\"screen-reader-text\"> \"Seh Calaz Challenges Winky D to a Clash…\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Masvingo Rejects Tshabangu",
            "url": "https://www.zimeye.net/2025/01/27/masvingo-rejects-tshabangu/",
            "content": "By A Correspondent\n\nSengezo Tshabangu, the controversial Secretary of the Citizens Coalition for Change (CCC), controversially skipped his own rally in Masvingo on Saturday. Tshabangu, often seen as a figure with close ties to Zanu PF, failed to attend the event at Mucheke Hall in Masvingo Urban, reportedly due to a disappointing turnout.\n\nHis aides advised him against attending after assessing the situation, said a source familiar with the matter. This was supposed to be Tshabangus first provincial rally after he allegedly took over the CCC party with the help of Zanu PF.\n\nThe rally, which was meant to galvanize support in Masvingo, a region considered to be a stronghold of CCC leader Nelson Chamisa, was left in disarray after Tshabangus sudden change of plans. Masvingo is highly disappointed by Tshabangus failure to attend the provincial rally, a local observer commented. He knew that Masvingo is Chamisas stronghold but cancelled his visit at the last minute. I am angry.\n\nThe event, described as poorly organized, saw a mere 10 members of parliament and senators in attendance. Key figures included Chief Whip Nonhlanhla Mlotshwa, Chief Whip of the National Assembly Charles Moyo, Senators Linda Sibanda, Bvumo, Phulu, and Maxwell Mdluri. However, the absence of Masvingos councillors, mayors, MPs, senators, and provincial council members was a stark sign of discontent within the party.\n\nThe lack of support from prominent local officials and the absence of Tshabangu himself has sent a clear message of dissatisfaction among CCC members in the province.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Sengezo Tshabangu, the controversial Secretary of the Citizens Coalition for Change (CCC), controversially skipped his own rally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/masvingo-rejects-tshabangu/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Rejects Tshabangu\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Gas Explosion Claims Life of 14-Year-Old Form One Pupil",
            "url": "https://www.zimeye.net/2025/01/27/gas-explosion-claims-life-of-14-year-old-form-one-pupil/",
            "content": "By A Correspondent\n\nA devastating gas explosion in Rujeko, Masvingo, resulted in the tragic death of a 14-year-old Form 1 pupil.\n\nThe incident occurred last night, leaving a family in mourning.\n\nAccording to authorities, the explosion was caused by a cooking gas leak. The blast was so intense that it left a trail of destruction in its wake, said a police source.\n\nThe victims mother, a municipal officer, is currently receiving treatment in hospital. Shes fighting for her life, and were praying for her recovery, added the source.\n\nIn a critical condition, the victims aunt has been transferred to a hospital in Bulawayo for further treatment. Were shocked and saddened by this tragic loss of life, said a neighbour. Our thoughts and prayers are with the family during this difficult time.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating gas explosion in Rujeko, Masvingo, resulted in the tragic death of a 14-year-old Form 1 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/gas-explosion-claims-life-of-14-year-old-form-one-pupil/\">Continue reading<span class=\"screen-reader-text\"> \"Gas Explosion Claims Life of 14-Year-Old Form One Pupil\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Zanu PF Youth League Boss Attacks Church Leaders Over Mnangagwa Third Term Agenda",
            "url": "https://www.zimeye.net/2025/01/27/zanu-pf-youth-league-boss-attacks-church-leaders-over-mnangagwa-third-term-agenda/",
            "content": "By A Correspondent\n\nA stern warning has been issued by Taurai Kandishaya, a Zanu PF youth league official, to church leaders who spoke out against President Emmerson Mnangagwas bid for a third term in office. This comes after a group of church leaders released a joint statement urging President Mnangagwa to respect the countrys constitution and refrain from extending his rule beyond 2028.\n\nKandishayas response, posted on Facebook, cautioned church leaders not to interfere, stating that they must understand their boundaries. His message was widely interpreted as a direct threat to those opposing the Presidents third-term bid.\n\nThis warning has sparked significant controversy, with critics arguing that it reflects the increasing political pressure on religious organizations in Zimbabwe. The churchs involvement in politics has long been a sensitive issue, with many fearing government intimidation to silence opposition.\n\nAs the debate surrounding Mnangagwas future grows, Kandishayas statement signals escalating tensions between the ruling party and those holding it accountable to the constitution.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A stern warning has been issued by Taurai Kandishaya, a Zanu PF youth league official, to church … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/zanu-pf-youth-league-boss-attacks-church-leaders-over-mnangagwa-third-term-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Youth League Boss Attacks Church Leaders Over Mnangagwa Third Term Agenda\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Sad: Bus Crushes Motorcyclist, Passenger",
            "url": "https://www.zimeye.net/2025/01/27/sad-bus-crushes-motorcyclist-passenger/",
            "content": "By A Correspondent\n\nA fatal road accident occurred on January 24, 2025, on the Mapombo-Gozi Road in Murewa, Zimbabwe. According to the Zimbabwe Republic Police (ZRP), a Zebra Kiss bus carrying 27 passengers collided head-on with a motorcycle carrying two people.\n\nThe motorcyclist and passenger were thrown off the bike and tragically run over by the bus. Both victims were killed instantly. Their bodies were taken to All Souls Hospital mortuary for post-mortem examination.\n\nThe incident is a sobering reminder of the importance of road safety. Investigations into the accident are ongoing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A fatal road accident occurred on January 24, 2025, on the Mapombo-Gozi Road in Murewa, Zimbabwe. According … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/sad-bus-crushes-motorcyclist-passenger/\">Continue reading<span class=\"screen-reader-text\"> \"Sad: Bus Crushes Motorcyclist, Passenger\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        },
        {
            "title": "Tshabangu Bunks Own Rally in Masvingo",
            "url": "https://www.zimeye.net/2025/01/27/tshabangu-bunks-own-rally-in-masvingo/",
            "content": "By A Correspondent\n\nSengezo Tshabangu, the controversial Secretary of the Citizens Coalition for Change (CCC), controversially skipped his own rally in Masvingo on Saturday. Tshabangu, often seen as a figure with close ties to Zanu PF, failed to attend the event at Mucheke Hall in Masvingo Urban, reportedly due to a disappointing turnout.\n\nHis aides advised him against attending after assessing the situation, said a source familiar with the matter. This was supposed to be Tshabangus first provincial rally after he allegedly took over the CCC party with the help of Zanu PF.\n\nThe rally, which was meant to galvanize support in Masvingo, a region considered to be a stronghold of CCC leader Nelson Chamisa, was left in disarray after Tshabangus sudden change of plans. Masvingo is highly disappointed by Tshabangus failure to attend the provincial rally, a local observer commented. He knew that Masvingo is Chamisas stronghold but cancelled his visit at the last minute. I am angry.\n\nThe event, described as poorly organized, saw a mere 10 members of parliament and senators in attendance. Key figures included Chief Whip Nonhlanhla Mlotshwa, Chief Whip of the National Assembly Charles Moyo, Senators Linda Sibanda, Bvumo, Phulu, and Maxwell Mdluri. However, the absence of Masvingos councillors, mayors, MPs, senators, and provincial council members was a stark sign of discontent within the party.\n\nThe lack of support from prominent local officials and the absence of Tshabangu himself has sent a clear message of dissatisfaction among CCC members in the province.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Sengezo Tshabangu, the controversial Secretary of the Citizens Coalition for Change (CCC), controversially skipped his own rally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/27/tshabangu-bunks-own-rally-in-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Bunks Own Rally in Masvingo\"</span></a></p>",
            "time": "08:34",
            "date": "28 Jan 2025"
        }
    ]
}