{
    "news": [
        {
            "title": "Mnangagwa’s Decision To Extend ZRP Pensionable Service Sparks Debate",
            "url": "https://www.zimeye.net/2024/12/31/mnangagwas-decision-to-extend-zrp-pensionable-service-sparks-debate/",
            "content": "By A Correspondent\n\nIn a controversial decision, President Emmerson Mnangagwa announced on Monday that the pensionable service period for officers of the Zimbabwe Republic Police (ZRP) would be increased from 20 years to 30 years. This new policy will take effect from January 1, 2025.\n\nThe change was confirmed by Zanu PFs Operation Restore Legacy page, which shared the news with the public:\n\nGood news for Zimbabwe Republic Police  ZRP. President Emmerson Dambudzo Mnangagwa has increased pensionable service for police from 20 years to 30 years, starting on January 1, 2025.\n\nThis move has raised questions about its implications for the ZRP and the broader political landscape in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a controversial decision, President Emmerson Mnangagwa announced on Monday that the pensionable service period for officers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/mnangagwas-decision-to-extend-zrp-pensionable-service-sparks-debate/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Decision To Extend ZRP Pensionable Service Sparks Debate\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Loyal People Mnangagwa Has Betrayed",
            "url": "https://www.zimeye.net/2024/12/31/loyal-people-mnangagwa-has-betrayed/",
            "content": "By Mandla Dlamini | As Zimbabwe slowly rolls into the new year we take time to look at those who worked very hard for Zimbabwe in their different ways. It is sad to note tha these undung heroes have worked so hard for their country but they have not been rewarded. This shows us that ZANU PF will never recognise those who hard for it. It is a party which works people and reward those who do not work. In closing this year we look at few people who sacrificed their lives for Zimbabwe and ZANU PF and CCC buy were kicked right in the face.The behaviour of ZANU PF against those who work hard for it exposes Mnangagwas ungrateful character and his discrimination against those who are not from his province.\n\nThis is a lesson to all those who support blindly, some will be gaining and get rewarded while hardworking cadres are completely ignored. On behalf of progressive and hardworking Zimbabweans I would like to say Thank you for all the hard work you put in daily! Know that it is recognized and greatly appreciated by Zimbabwe even though ZANU PF led government will never appreciate or even to say thank you. Thank you for stepping in and saving the day in this difficult times where you have carried the Zimbabwean story. So glad we have you as a Zimbabwean upright men and women. Thanks for being so dedicated and hard-working!Putting your country on the map is an incremental part of your everyday life.A man who has fought so hard for Justice and defending the human rights and yet not recognised by his party the CCC this year is Mr Tawanda Dzvokora. Many people know him as Chief Svosve. Dzvokoras voice has become a pain in the ears of the ruling party. Dzvokora has highlighted the plight of Zimbabweans in any platform. He has singularly taken Mnangagwa to task. Dzvokora has continued to be the lone voice in the wilderness. Unfortunately no one has recognised him for the work he has done. He is our 2025 opposition fighter of the year. It is a pity that even his leader Chamisa jumped the ship and left Dzvokora sinking it.There are many Zimbabweans who have tried to point out the plight of Zimbabweans. Their efforts though not recognised by their country the world has been made aware of the events in Zimbabwe. There some like Advocate Masiye, Masotcha, and many in South Africa. We havesome strong criticsof Mnangagwas regime like Sherpard Yuda, Patson Muzuwa and many others. But we recognise Mr Dzvokora chief Svosve.While we look at the opposition we can not ignore those in ZANU PF who worked very hard for Zimbabwe and for ZANU PF but have not been recognised by their party.The man who worked tooth and nail in defence of his country,and received total abuse from many Zimbabweans abroad and at home is Dr Masimba Mavaza. Successful people in every field are often said to be blessed with talent or even just lucky. But Masimba Mavaza is fearless defender of ZANU PF. While everyone around him is voicing his concerns against Mnangagwa and his government Dr Masimba Mavaza stands for his party ZANU PF. While I must make it clear that I do not like ZANU PF and I am not happy with Mnangagwa Dr Masimba Mavaza will defend ZANU PF with all his power to an extent that you will end up believing him. Dr Mavaza worked harder than the average person can even imagine to defend ZANU PF and Mnangagwa.Mavaza argues with passion for his party. The commitment he shows for his party is beyond comprehension. Mavaza is known forwaking up earlyand working toward a goal while other people are still in bed, and staying later than everyone else too in defense of his country and party. He applied what is calledOld fashioned hard work. To those who are in doubt about what to think about Zimbabwe must know that Mavaza is an inspiration.Dr MASIMBA MAVAZA had prodigious physical gifts. But as his party ignores him it is hard work that made him a legend in debates and in writing. Dr Mavazas defining characteristic isnt his talent, but having the humility to know he had to work constantly to be the defender of his none caring party. Dr Mavaza is an example of how ZANU PF does not care for you no matter how you fight for it.\n\nDr Mavaza must be a frequent consumer of wake ip products to maintain his frenetic schedule. Many people in the Social Media have said Mavaza has graced social media to turn around the party. He writes two articles a day for several online papers. One would think that he is being paid by ZANU PF but no ZANU PF will never recognise you unless you are related to the senior guys.One social media fighter warned Mavaxa that he is being used by the ruthless ZANU PF. While we admire his passion for his country we take his commitment as a warning to all that You support ZANU PF at your risk. Dr Masimba Mavaza ends this year 2024 as our hard worker on ZANU PF side.It is equally important to state that Mavaza, is the most insulted abused and hated person in Zimbabwe and on Social media.He gets all the cyber bullying and yet his party looks the other side. You join ZANU PF at your own risk. Mavaza continues talking to overseas publications even later at night from home and engages in debates. He goes into the office on Sundays and reads emails from his thousands of followers.While Mnangagwa rewards his sons and cronies Dr Mavaza and those Varakashis toil and scratch wounds of poverty for no reward.The irony of all this is that the hard workers are not rewarded the corrupt ones get everything.I will say well done Dr Mavaza and all those who were behind the scenes.2025 has a lot in store. Come out and lead a crusade to have Zimbabwe a better country again.We acknowledge all the journalists who heralded the plight of Zimbabwe and all who are going to do the same in this coming year.\n\nHave a wonderful 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Mandla Dlamini | As Zimbabwe slowly rolls into the new year we take time to look at those who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/loyal-people-mnangagwa-has-betrayed/\">Continue reading<span class=\"screen-reader-text\"> \"Loyal People Mnangagwa Has Betrayed\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Is Trent Alexander-Arnold Moving to Real Madrid?",
            "url": "https://www.zimeye.net/2024/12/31/is-trent-alexander-arnold-moving-to-real-madrid/",
            "content": "Sports Correspondent\n\nWith Arne Slots Liverpool team emerging as strong favorites to secure the title by May, they may still require additional support to seal the deal. As the January transfer window approaches, Liverpool could be considering moves to strengthen their squad.\n\nHowever, major decisions loom over several key players in their roster. Below, we examine the latest rumors surrounding Liverpools potential transfers.\n\nAccording to AS, Trent Alexander-Arnolds transfer to Real Madrid is almost complete. The right-back is expected to join the Spanish giants at the end of his contract, although an official announcement will be delayed out of respect for Liverpool.\n\nIn other news, former Liverpool target Anthony Gordon has committed to winning a trophy with Newcastle before contemplating a move away from St James Park. Speaking to The Chronicle, he stated, Ive got a long contract here, and I intend to see that out.\n\nReports from Spain suggest that Alexander-Arnold is poised to wear Real Madrids white kit next season. The Spanish club has been eyeing the player as his contract with Liverpool nears its final six months. While there were initial discussions about a move in January following Dani Carvajals long-term injury, it now appears the terms of the deal have already been settled.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent With Arne Slot’s Liverpool team emerging as strong favorites to secure the title by May, they may still … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/is-trent-alexander-arnold-moving-to-real-madrid/\">Continue reading<span class=\"screen-reader-text\"> \"Is Trent Alexander-Arnold Moving to Real Madrid?\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "From Chimurenga to Contemporary Struggles: Examining Ian Smith and Emmerson Mnangagwa’s Leadership in Zimbabwe",
            "url": "https://www.zimeye.net/2024/12/31/from-chimurenga-to-contemporary-struggles-examining-ian-smith-and-emmerson-mnangagwas-leadership-in-zimbabwe/",
            "content": "The Generational Fight for Freedom: Social, Economic, and Political Challenges Across Eras\n\nStory by Prosper Tiringindi, a Human Rights Defender\n\nZimbabwes history has been shaped by two prominent leadersIan Smith and Emmerson Mnangagwawhose governance periods reflect glaring contradictions. While both leaders are credited with infrastructural development, their tenures are also marked by systemic human rights abuses, political oppression, and unaddressed socio-economic inequalities.\n\nIan Smiths Leadership: A Catalyst for Chimurenga\n\nIan Smith served as Prime Minister of Rhodesia (now Zimbabwe) from 1964 to 1979, leading a white minority government that unilaterally declared independence from Britain in 1965. His administration prioritized infrastructure development, creating modern road networks, industrial zones, and efficient urban services. However, these advancements primarily benefited the white minority, leaving the black majority in abject poverty.\n\nSocially, Smiths government enforced segregation through oppressive laws that marginalized black communities, limiting access to quality education, healthcare, and land ownership. Economically, policies favored the minority elite while relegating the black population to poorly paid, exploitative labor in agriculture and mining.\n\nPolitically, Smiths regime was notorious for brutal crackdowns on dissent. Freedoms of speech, assembly, and political organization were heavily suppressed. Opposition to the regime, especially from liberation movements like ZANLA and ZIPRA, was met with violence and detentions. Reflecting on this era, Smith infamously remarked, The more we killed, the happier we were.\n\nThe socio-economic and political injustices under Smith became the rallying point for the Chimurenga liberation war. Black Zimbabweans demanded land redistribution, political representation, and socio-economic equity. The wars success in 1980 heralded the end of white minority rule, yet its promises remain unfulfilled for many.\n\nEmmerson Mnangagwas Leadership: The Betrayal of Liberation Ideals\n\nIn 2017, Emmerson Mnangagwa ascended to power following Robert Mugabes resignation. Touted as a reformer, his presidency initially inspired hope. However, his administration has since faced allegations of corruption, economic mismanagement, and human rights abuses, echoing the authoritarian tendencies of his predecessors.\n\nSocially, Mnangagwas government has failed to address the enduring inequalities inherited from colonial rule. Healthcare and education systems are in decline, with ordinary citizens bearing the brunt of economic hardships. The promise of land redistribution has been marred by corruption, with political elites capturing the best agricultural land.\n\nEconomically, Mnangagwas tenure has been characterized by hyperinflation, currency instability, and high unemployment rates. Despite promises to attract investment, widespread corruption and mismanagement have deterred economic growth. Essential services like water, electricity, and sanitation remain inaccessible to many.\n\nPolitically, Mnangagwa has cracked down on opposition parties, activists, and journalists. Freedom of assembly and speech remains restricted, with protesters frequently arrested or subjected to violence. In March 2024, the United States sanctioned Mnangagwa under the Global Magnitsky program for corruption and human rights abuses.\n\nGenerational Demands: Then and Now\n\nThe demands of the Chimurenga generationland, freedom, and equityresonate with the struggles of todays youth. However, the current generation also grapples with additional challenges:\n\nUnemployment and Poverty: Zimbabwes youth face limited job opportunities, driving many into informal work or migration.\n\nCorruption: Public resources are siphoned off by political elites, denying citizens access to essential services.\n\nLack of Political Voice: State surveillance and repression stifle activism and political participation.\n\nDespite the differences in context, the fight remains the same: an equitable society where citizens enjoy social, economic, and political rights.\n\nAnalysis: Infrastructure Without Rights Is Futile\n\nBoth Ian Smith and Emmerson Mnangagwa presided over periods where infrastructure development was undermined by systemic oppression. Under Smith, infrastructure served a racial minority, fueling the liberation struggle. Under Mnangagwa, infrastructural promises are overshadowed by corruption and repression, leaving the majority in despair.\n\nAs Prosper Tiringindi, a human rights defender, asserts: Infrastructure development is meaningless if citizens are deprived of basic rights. A society cannot thrive under oppression, regardless of its physical advancements.\n\nThe generational fight for freedom in Zimbabwe is far from over, as the current leadership has yet to fulfill the promises of the liberation struggle. The call for justice, equity, and accountability echoes across decades, uniting past and present generations in their quest for a better future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Generational Fight for Freedom: Social, Economic, and Political Challenges Across Eras Story by Prosper Tiringindi, a Human Rights Defender … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/from-chimurenga-to-contemporary-struggles-examining-ian-smith-and-emmerson-mnangagwas-leadership-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"From Chimurenga to Contemporary Struggles: Examining Ian Smith and Emmerson Mnangagwa’s Leadership in Zimbabwe\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Kwekwe Hospital Grapples with Doctor Accommodation Crisis",
            "url": "https://www.zimeye.net/2024/12/31/kwekwe-hospital-grapples-with-doctor-accommodation-crisis/",
            "content": "By A Correspondent\n\nKwekwe Provincial Hospital is facing a severe shortage of accommodation for doctors, hindering the recruitment of critical medical staff.\n\nThe crisis began in 2022 when a fire ravaged the hospitals doctors quarters, which the government has yet to rebuild.\n\nDistrict Medical Officer, Dr. Nyasha Mwasunda, highlighted the urgency of the situation, stating that the lack of accommodation is a significant obstacle in attracting and retaining essential technical staff.\n\nThe district is currently experiencing a 16% shortage of critical personnel, including pharmacists, nurses, and doctors.\n\nThe shortage of accommodation has resulted in the hospital struggling to fill vacant positions, exacerbating the existing staffing shortages. Dr. Mwasunda emphasized the need for prompt action to address the accommodation crisis and ensure the hospital can provide quality healthcare services to the community.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Kwekwe Provincial Hospital is facing a severe shortage of accommodation for doctors, hindering the recruitment of critical … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/31/kwekwe-hospital-grapples-with-doctor-accommodation-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Kwekwe Hospital Grapples with Doctor Accommodation Crisis\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Mnangagwa Fears Coup, Spends Leave At State House",
            "url": "https://www.zimeye.net/2024/12/30/mnangagwa-fears-coup-spends-leave-at-state-house/",
            "content": "By PoliticalReporter-TheGovernment has announced that President EmmersonMnangagwa will begin his annual vacationon Tuesday, December 31, 2024, but will remain in the country.\n\nPresidential Spokesperson George Charambamade the announcementon Monday, fueling speculation that Mnangagwa is deeply concerned about a potential coup, especially from his ambitious deputy, Vice President Constantino Chiwenga.\n\nMnangagwa, who seized power from the late President Robert Mugabe in a 2017 military coup spearheaded by Chiwenga, has never taken leave outside Zimbabwe since assuming office.\n\nThis decision appears calculated, reflecting fears that he could face the same fate as Mugabe if he were to leave the country, given the ongoing power struggles within the ruling Zanu PF party.\n\nMnangagwa andChiwengasalliance has long been fraught with tension.\n\nFollowingMugabesousting, insiders reported an informal agreement that Mnangagwa would serve a single term before handingoverpower to Chiwenga.\n\nHowever,Mnangagwasactions suggest he is determined to hold onto power beyond his two constitutional terms, sidelining Chiwenga.\n\nThe former military commander and the face of the 2017 coup, Chiwenga, is viewed by many asa powerfulfigure who commands significant loyalty within the security sector.\n\nHis frustrations withMnangagwasbroken promises are now public, with reports of heated confrontations and factional battles within the party.\n\nAnnouncing thepresidentsstaycation, Charamba said:\n\nHis Excellency, the President, will spend his vacation locally and will remain accessible for responsibilities that require his direct involvement, both in his capacity as Head of State and as Chairman of the Southern African Development Community (SADC).\n\nDuringMnangagwasabsence from routine duties, Vice President Kembo Mohadi will act as Presidentfrom December 31, 2024, to January 19, 2025.Thereafter,Chiwenga will assume the role until Mnangagwa resumes duties in early February 2025.\n\nPolitical analysts interpret this arrangement as a balancing act to keep Chiwenga placated while ensuringMnangagwasgrip on power remains secure.\n\nBy staying in the country, Mnangagwa minimizes the risk of an organized coup or internal party rebellion.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-The Government has announced that President Emmerson Mnangagwa will begin his annual vacation on Tuesday, December 31, 2024, but will remain in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/mnangagwa-fears-coup-spends-leave-at-state-house/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Fears Coup, Spends Leave At State House\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "“VP Chiwenga’s Seat Empty And Dirty At Wutaunashe’s 2030 Mnangagwa Church Gig”",
            "url": "https://www.zimeye.net/2024/12/30/vp-chiwengas-seat-empty-and-dirty-at-wutaunashes-2030-mnangagwa-church-gig/",
            "content": "VIDEO LOADING BELOW\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW…",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Mnangagwa Extends Pensionable Service for ZRP Officers from 20 to 30 Years",
            "url": "https://www.zimeye.net/2024/12/30/mnangagwa-extends-pensionable-service-for-zrp-officers-from-20-to-30-years/",
            "content": "In a controversial decision, President Emmerson Mnangagwa announced on Monday that the pensionable service period for officers of the Zimbabwe Republic Police (ZRP) would be increased from 20 years to 30 years. This new policy will take effect from January 1, 2025.\n\nThe change was confirmed by Zanu PFs Operation Restore Legacy page, which shared the news with the public:\n\nGood news for Zimbabwe Republic Police  ZRP. President Emmerson Dambudzo Mnangagwa has increased pensionable service for police from 20 years to 30 years, starting on January 1, 2025.\n\nThis move has raised questions about its implications for the ZRP and the broader political landscape in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In a controversial decision, President Emmerson Mnangagwa announced on Monday that the pensionable service period for officers of the Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/mnangagwa-extends-pensionable-service-for-zrp-officers-from-20-to-30-years/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Extends Pensionable Service for ZRP Officers from 20 to 30 Years\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Another #Mazion4ED Official In Horror Crash",
            "url": "https://www.zimeye.net/2024/12/30/another-mazion4ed-official-in-horror-crash/",
            "content": "By James Gwati Another official, this time with the Mazionfor EDmovement has reportedlybeen involvedin a serious car accident en route to Bulawayo.\n\nThe Mazio4eD official had an accident on the same day the #Vapostori4Ed was also involvedin an accidentwhile mobilising people for President Mnangagwa in Bulawayo.\n\nSources close to the incident say the official (name with-held) was heading to preparations for the National Thanksgiving Day, a government-declared event championed by President Emmerson Mnangagwa.\n\nSocial media platforms are now flooded with images of the mangled vehicle, raising concerns about the officials condition.\n\nThe National Thanksgiving Day, which Mnangagwa introduced after his rise to power through a military coup in 2017, has become a strategic tool in his political arsenal.\n\nHeld annually in Bulawayo, the event is positioned as a day of intercession for national prosperity and blessings, emphasising the role of faith in Zimbabwes development.\n\nHowever, critics argue that the day serves as a veneer for Mnangagwas 2030 Agenda, a campaign to solidify his rule while sidelining political rivals, including Vice President Constantino Chiwenga.\n\nMnangagwa has leveraged religious platforms to bolster his legitimacy.\n\nKey allies like Reverend Andrew Wutawunashe, founder of the Faith for Nation Campaign, have played pivotal roles in this strategy.\n\nWutawunashe Sunday even composed a song praising Mnangagwa, declaring him the nations leader until 2030.\n\nSuch actsare seenas direct endorsements of Mnangagwas agenda, further entrenching his influence within the religious sector.\n\nEfforts to contact Madzibaba Moses Gwasarira, the national chairperson of Vapostori and Zion for ED, for comment were unsuccessful.\n\nGwasarira had attended the Sunday event, where Mnangagwas religious-political alliance wason full display.\n\nZimEye is working to confirm details of the accident with law enforcement authorities, but theincident has already sparked speculation about its timing, given the intensifying power struggles between Mnangagwa and Chiwenga.\n\nThe Spokesperson of Vapostori &Mazion for ED Madzibaba Obey Mapuranga had an accident on his way to Bulawayo for the advance mobilization of the Prayer Day, also Madzibaba Owen Velvet had an accident on his way back from Bulawayo due to heavy rains. The 2 Patriots came out alive.pic.twitter.com/ljw5sSpsd8\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati– Another official, this time with the Mazion for ED movement has reportedly been involved in a serious car accident en route … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/another-mazion4ed-official-in-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Another #Mazion4ED Official In Horror Crash\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "ZIFA Polls: Mliswa Blasts Tagwirei for Attempting To Hijack Football",
            "url": "https://www.zimeye.net/2024/12/30/zifa-polls-mliswa-blasts-tagwirei-for-attempting-hijack-football/",
            "content": "Sports Correspondent\n\nFormer Norton MP and ex-Democratic Movement for Zimbabwe (Dembare) fitness trainer, Temba Mliswa, has strongly criticized businessman Kuda Tagwirei for allegedly attempting to take control of Zimbabwean football. Mliswa, who was recently disqualified from the ZIFA presidential elections, claimed that powerful cartels are using the ZIFA elections as a platform to advance their own interests.\n\nMliswa stated, Its unfortunate that the ZIFA elections have become an arena for cartels to flex their power and influence, redirecting the course of Zimbabwean football for their own benefit.\n\nWhile acknowledging Tagwireis success as a businessman and his potential to be a great sponsor for local teams, Mliswa accused him of misusing his power to manipulate the football sector.\n\nKuda has been an astute businessman and could be a great sponsor, funding and supporting local teams, Mliswa continued. However, he has abused that power to try and influence the entire football sector, using proxies like Magwizi and his company, Sakunda.\n\nMliswa warned that this kind of influence sets a dangerous precedent that could harm the long-term development of Zimbabwean football. He pointed out that while Delta has been involved in local football for years, they have never tried to manipulate the sport for their own private interests or supported specific candidates for office.\n\nKuda Tagwirei is my mzukuru and I will always speak frankly with him, Mliswa added.\n\nThis approach is wrong. It would be more prudent and beneficial if he focused on sponsoring the sport. However, this sudden involvement in corporate social work appears to be aimed at supporting a specific candidate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Norton MP and ex-Democratic Movement for Zimbabwe (Dembare) fitness trainer, Temba Mliswa, has strongly criticized businessman Kuda … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/30/zifa-polls-mliswa-blasts-tagwirei-for-attempting-hijack-football/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Polls: Mliswa Blasts Tagwirei for Attempting To Hijack Football\"</span></a></p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        }
    ]
}