{
    "news": [
        {
            "title": "Dry Weekend for Harare as Water Crisis Deepens",
            "url": "https://www.zimeye.net/2025/06/21/dry-weekend-for-harare-as-water-crisis-deepens/",
            "content": "By Municipal Reporter-Residents of Harare are bracing for yet another dry weekend after the City Council announced a shutdown of water supplies across several suburbs due to a major pipe burst at the Warren Control water distribution centre.\n\nIn a statement issued on Wednesday, June 18, Acting Town Clerk Engineer Phakamile Mabhena Moyo said the system had been temporarily shut down to allow engineers to assess, clean, and repair the damaged pipeline. Two other burst pipes along the network will also be attended to during the same period.\n\nSuburbs set to be affected include Tynwald, Southerton, Eastlea, Hillside, Braeside, Milton Park, and even Parirenyatwa Hospital  one of the countrys largest referral health facilities. The Central Business District (CBD) is also expected to experience severe disruptions. However, some high-density suburbs in the western parts of the city  such as Glen View, Budiriro, Kuwadzana, and Mufakose  will remain unaffected.\n\nMabhena Moyo urged residents in affected areas to use water sparingly until repairs are completed.\n\nThis latest shutdown adds to Harares long-standing water woes, which have plagued the capital for decades. A toxic mix of ageing infrastructure, corruption in procurement, poor planning, and political interference has left millions of residents without reliable access to clean water. The citys water system, originally designed for a population of fewer than half a million people, now serves over 2.5 million  with little to no significant investment in infrastructure upgrades.\n\nIn recent years, tender scandals involving the procurement of water treatment chemicals and pipe maintenance contracts have further crippled the citys ability to provide consistent service. Residents often go for days  sometimes weeks  without running water, and when it does come, its frequently contaminated and unfit for drinking.\n\nWaterborne diseases such as typhoid and cholera have become endemic in some suburbs, with health experts warning that continued neglect of the water infrastructure poses a serious public health threat. Attempts by donor organisations to assist have been frustrated by political turf wars between the opposition-led council and central government agencies aligned to the ruling ZANU PF party.\n\nThis weekends shutdown is a reminder of the capitals fragile infrastructure and the urgent need for structural reforms and transparent, well-managed investment in the citys water systems. Until then, Harares residents remain trapped in a cycle of crisis management, filling buckets and tanks in anticipation of the next dry spell.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Municipal Reporter-Residents of Harare are bracing for yet another dry weekend after the City Council announced a shutdown of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/dry-weekend-for-harare-as-water-crisis-deepens/\">Continue reading<span class=\"screen-reader-text\"> \"Dry Weekend for Harare as Water Crisis Deepens\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Mnangagwa Admin in Looting Spree",
            "url": "https://www.zimeye.net/2025/06/21/mnangagwa-admin-in-looting-spree/",
            "content": "By A Correspondent-The  Emmerson Mnangagwa Mnangagwa administration is sinking in unprecedented looting spree, with high-level corruption now described as widespread and systemic by the governments own watchdog.\n\nConfidential government documents obtained by theZimbabwe Independentreveal a damning web of corruption implicating cabinet ministers, permanent secretaries, and senior bureaucrats who are siphoning millions from state-owned enterprises. The funds are being diverted to finance opulent lifestyles  luxury vehicles, overseas junkets, DSTV subscriptions, gym memberships, and even hotel bills  all under the guise of inter-ministerial collaboration.\n\nThe looting is bleeding parastatals already in financial distress and exacerbating the burden on taxpayers, many of whom are earning below the poverty line and facing increasing taxation. Alarmed by the scale of the abuse, the Office of the President and Cabinet (OPC) has issued an unusually blunt directive, warning that the illegal expenditures are undermining corporate governance, compromising service delivery, and placing unsustainable pressure on the fiscus.\n\nAccording to the OPCs Corporate Governance Unit (CGU), ministries now treat state enterprises as personal piggy banks, forcing them to bankroll unapproved activities well outside national budget frameworks.\n\nThe Corporate Governance Unit has observed that an increasing number of state enterprises and parastatals are facing challenges with regard to increasing requests for financial and material support from their line ministries, the June 17, 2025 circular reads.\n\nIn shocking detail, the memo outlines how public entities were strong-armed into financing foreign delegations, purchasing luxury vehicles for ministry officials, and paying for social programmes with no relation to their mandates. These included DSTV subscriptions, private club and gym memberships, stationery, car rentals, and allowances.\n\nThe directive invokes Section 23 of the Public Entities Corporate Governance (General) Regulations under Statutory Instrument 168 of 2018, which expressly prohibits the misuse of public funds and warns that culpable executives and board members will be held personally liable.\n\nWhile a similar caution was issued in 2019, analysts say this renewed crackdown signals deeper frustration within government over the entrenchment of corrupt practices and a growing appetite to enforce accountability  at least on paper. However, critics remain skeptical, citing the governments long-standing failure to prosecute high-profile looters.\n\nThese payments are often requested by line ministries notwithstanding that line ministries funding is provided through the Treasury national budget, the circular notes, adding that such actions are undermining good corporate governance and stewardship of public resources.\n\nThe CGU directive reminds executives that they are legally bound to resist unlawful orders and report them. But in a political culture where whistleblowers are punished and enforcers are complicit, the looting seems likely to persist.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Emmerson Mnangagwa Mnangagwa administration is sinking in unprecedented looting spree, with high-level corruption now described as “widespread … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/mnangagwa-admin-in-looting-spree/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Admin in Looting Spree\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Zanu PF Veteran Dies",
            "url": "https://www.zimeye.net/2025/06/21/zanu-pf-veteran-dies/",
            "content": "By A Correspondent-War veteran Luke Mushore, has died.\n\nMushore  passed away last week, and government has accorded him a national hero status.\n\nThe announcement was made by the Minister of Veterans of the Liberation Struggle Affairs, Honourable Monica Mavhunga, during a visit to the Mushore family homestead in Centenary on Friday afternoon.\n\nMushore, who was widely known by his Chimurenga nameDick Joboringo, was born in 1949 and was among the early cadres to join the armed liberation struggle in 1972.\n\nHis contribution to Zimbabwes independence has been described by party officials as unwavering and selfless.\n\nFurther details regarding his burial arrangements at the National Heroes Acre in Harare are expected to be announced soon.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-War veteran Luke Mushore, has died. Mushore passed away last week, and government has accorded him a national … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/zanu-pf-veteran-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Veteran Dies\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Zim Warriors Stars Link Up in USA",
            "url": "https://www.zimeye.net/2025/06/21/zim-warriors-stars-link-up-in-usa/",
            "content": "Sports Correspondent\n\nZimbabwean football stars Teenage Hadebe and Divine Lunga recently linked up in the United States, sharing a moment of national pride and brotherhood away from home.\n\nHadebe, a US-based defender who plies his trade in Major League Soccer, paid a visit to fellow Warrior Divine Lunga, who is currently in the U.S. with Mamelodi Sundowns for the ongoing FIFA Club World Cup.\n\nLunga, a reliable left-back for both Mamelodi Sundowns and the Zimbabwe national team, has been a key figure in club and country line-ups. The meet-up between the two Warriors stars was a show of solidarity and camaraderie as they continue to fly the Zimbabwean flag high on the international stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean football stars Teenage Hadebe and Divine Lunga recently linked up in the United States, sharing a moment … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/zim-warriors-stars-link-up-in-usa/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Warriors Stars Link Up in USA\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Lungu Family Slammed In SA: “You’re Not Only Taking Our Wives, Jobs, You Also Want Our Graves!”",
            "url": "https://www.zimeye.net/2025/06/21/lungu-family-slammed-in-sa-youre-not-only-taking-our-wives-jobs-you-also-want-our-graves/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Tragedy in Mberengwa: Mukorokoza Electrocuted in 97-Metre Shaft…",
            "url": "https://www.zimeye.net/2025/06/21/tragedy-in-mberengwa-mukorokoza-electrocuted-in-97-metre-shaft/",
            "content": "By A Correspondent\n\nA tragic accident claimed the life of an artisanal miner in Mberengwa on Monday, after he was electrocuted while descending into a 97-metre-deep mine shaft at Midway Syndicate Mine.\n\nThe incident occurred around 11:00 AM on June 9, 2025, and has since been confirmed by the Midlands Provincial Police.\n\nWe have a case of sudden death of an artisanal miner who died after being electrocuted in a mine shaft, said Midlands Police in a statement. The incident occurred on 9 June 2025 at Midway Syndicate Mine in Mberengwa at about 1100 hours.\n\nThe deceased has been identified as Washington Makora, a miner operating at the site. Circumstances surrounding the electrocution are still under investigation.\n\nAuthorities are urging mine operators and artisanal miners to exercise extreme caution and ensure proper safety measures are in place to avoid further loss of life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic accident claimed the life of an artisanal miner in Mberengwa on Monday, after he was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/tragedy-in-mberengwa-mukorokoza-electrocuted-in-97-metre-shaft/\">Continue reading<span class=\"screen-reader-text\"> \"Tragedy in Mberengwa: Mukorokoza Electrocuted in 97-Metre Shaft…\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Fake Goods Flood Zimbabwe, Exposing Cracks in Mnangagwa’s Administration",
            "url": "https://www.zimeye.net/2025/06/21/fake-goods-flood-zimbabwe-exposing-cracks-in-mnangagwas-administration/",
            "content": "By A Correspondent\n\nThe Confederation of Zimbabwe Industries (CZI) has sounded the alarm over the continued flood of counterfeit and substandard goods in the local market, raising serious questions about the effectiveness of government measures intended to control the quality of imports.\n\nSpeaking during a recent stakeholders workshop on the Consignment-Based Conformity Assessment (CBCA) programme, the CZI expressed deep concern that despite the programmes existence, the market is still being overwhelmed by fake and mispriced products.\n\nAs the private sector, we supported the introduction of CBCA to defend our markets from counterfeit goods, the CZI said. But unfortunately, the system is falling short  non-compliant products are still slipping through porous borders.\n\nThe CBCA, introduced in 2015, mandates that selected imported goods be inspected and certified in their country of origin to ensure they meet Zimbabwes safety and quality standards. Its core purpose is to protect consumers, promote fair competition, and reduce the importation of harmful or fake goods.\n\nHowever, the CZI highlighted that the burden of compliance is falling disproportionately on formal businesses. They noted that inspection delaysinitially meant to take between 3 to 5 dayscan now stretch to as long as three weeks, disrupting operations and escalating costs.\n\nThis system only targets formal importers, the CZI noted. Meanwhile, informal traders bypass it altogether, flooding the market with cheap, non-certified products, leaving compliant businesses struggling to compete.\n\nCZI also raised issues around the reluctance of suppliers, particularly from China and Europe, to provide the necessary paperwork for certification. This is reportedly forcing local firms to switch to costlier supply alternatives, further hiking production costs.\n\nInspection and compliance costs are ultimately passed on to the consumer, which inflates prices and leaves local industry at a disadvantage, the CZI added. This also opens the door to corruption.\n\nIn response, the Ministry of Industry and Commerce acknowledged the concerns, reaffirming that the CBCA programme remains a cornerstone of the countrys industrial policy under the Zimbabwe Industrial Reconstruction and Growth Plan.\n\nWere not here to impose policies, but to listen, the ministry said during the workshop. This is a crucial moment for us to work with all stakeholders to refine and improve the CBCA framework.\n\nThe ministry emphasized that recent amendments introduced through Statutory Instrument 35 of 2024 were aimed at enhancing the programmes efficiency and cost-effectiveness, following extensive consultations.\n\nWe are committed to continuously reviewing CBCAs implementation, guided by feedback from industry and regulatory bodies, the ministry added.\n\nIt also revealed that efforts are underway for the ministry to achieve ISO 9001 certification, signalling a commitment to aligning Zimbabwes quality assurance mechanisms with international standards.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Confederation of Zimbabwe Industries (CZI) has sounded the alarm over the continued flood of counterfeit and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/fake-goods-flood-zimbabwe-exposing-cracks-in-mnangagwas-administration/\">Continue reading<span class=\"screen-reader-text\"> \"Fake Goods Flood Zimbabwe, Exposing Cracks in Mnangagwa’s Administration\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Tragic Accident: Father Unknowingly Reverses Over and Kills Toddler in Bulawayo",
            "url": "https://www.zimeye.net/2025/06/21/tragic-accident-father-unknowingly-reverses-over-and-kills-toddler-in-bulawayo/",
            "content": "By A Correspondent\n\nA tragic incident unfolded in Kensington, Bulawayo, on the morning of June 20, 2025, when a father accidentally ran over and killed his 2-year-old daughter while reversing his vehicle.\n\nAccording to police reports, the 55-year-old man from Hendricourt, Kensington, was reversing his Toyota Hilux Double Cab at around 8:43 AM when the heartbreaking event occurred. As he began moving forward after reversing, the vehicles front left side struck the toddler, and the front wheel rolled over her.\n\nBulawayo police spokesperson, Inspector Nomalanga Msebele, confirmed the child sustained fatal head injuries and died instantly at the scene.\n\nInspector Msebele stated that the accident resulted from the drivers failure to maintain a proper lookout.\n\nAuthorities are urging motorists to exercise extreme caution, especially in residential areas where children may be present.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident unfolded in Kensington, Bulawayo, on the morning of June 20, 2025, when a father … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/tragic-accident-father-unknowingly-reverses-over-and-kills-toddler-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Tragic Accident: Father Unknowingly Reverses Over and Kills Toddler in Bulawayo\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Tasila Lungu’s Burial Next Move After Discovering She Doesn’t Have An SA Permit",
            "url": "https://www.zimeye.net/2025/06/21/tasila-lungus-burial-next-move-after-discovering-she-doesnt-have-an-sa-permit/",
            "content": "NEWS ANALYSIS | The Lungu Funeral Theatre\n\nTasila Lungus Crisis: The Collapse of a Carefully Scripted Farewell\n\nBy Dorrothy Moyo |  The death of former Zambian President Edgar Chagwa Lungu was expected to trigger a solemn, dignified period of national mourning. Instead, it has unfolded into a constitutional and diplomatic theatre  one that now centres around his daughter, Tasila Lungu, and a series of decisions that have left the public confused, the state sidelined, and the nation in disbelief.\n\nFrom the moment the late presidents body remained grounded in South Africa instead of returning to Lusaka, speculation began to mount. That speculation has now snowballed into full-blown crisis. Reports emerging from both Lusaka and Johannesburg confirm that Tasila Lungu lacks a legal burial permit to inter her father in South Africa, a stunning twist that raises serious questions about planning, motive, and the legality of her actions.\n\nWhat Exactly Is the Crisis?\n\nThe funeral of a former head of state is a matter of national dignity, not private discretion. Yet Tasila Lungu appears to have seized unilateral control over the process. Five key failures now define this standoff:\n\nWhats Behind Tasilas Strategy?\n\nThere are two possible interpretations of her endgame:\n\nBut this strategy may have backfired. In attempting to shield the late president from the state, Tasila has now effectively denied him the dignity of a legal, orderly, and honourable burial. The absence of permits and documentation, compounded by an international legal deadlock, has trapped Edgar Lungus remains in a bureaucratic limbo.\n\nPolitical Fallout\n\nThe spectacle has damaged more than just the Lungu familys public standing  it has eroded faith in Zambias institutional ability to separate personal grief from public duty. Tasila, once seen as a disciplined and promising political figure in her own right, now finds herself branded as impulsive and obstructive.\n\nIn the eyes of the state, and many observers, this isnt just a misstep  its a hijacking of national protocol.\n\nWhat Happens Next?\n\nSouth African law is clear: no one can bury a foreign national on its soil without a permit, cause of death confirmation, and diplomatic clearance. The Lungu family now faces three choices:\n\nConclusion\n\nWhat was meant to be a farewell befitting a former head of state has become a legal, moral, and political standoff. Tasila Lungus attempt to control the narrative has backfired badly  leaving Edgar Lungus legacy suspended in both life and law, as the warnings of Human Rights Watch Director Dewa Mavinga being recalled. The HRW Director warned that the Lungus would play shenanigans bent on human rights disregard towards the next election.\n\nWas this truly Plan B? Or a plan gone dangerously wrong?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "NEWS ANALYSIS | The Lungu Funeral Theatre Tasila Lungu’s Crisis: The Collapse of a Carefully Scripted Farewell By Dorrothy Moyo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/tasila-lungus-burial-next-move-after-discovering-she-doesnt-have-an-sa-permit/\">Continue reading<span class=\"screen-reader-text\"> \"Tasila Lungu’s Burial Next Move After Discovering She Doesn’t Have An SA Permit\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        },
        {
            "title": "Putin Backs Iran in Escalating Conflict With Israel",
            "url": "https://www.zimeye.net/2025/06/21/putin-backs-iran-in-escalating-conflict-with-israel/",
            "content": "By A Correspondent\n\nRussian President Vladimir Putin has thrown his weight behind Iran amid rising tensions and armed conflict with Israel, accusing the Israeli government of provoking the war and vowing that its actions wont reach their goals.\n\nSpeaking during a media briefing on Friday, Putin issued a strong statement of support for Iran, both diplomatically and strategically.\n\nWe support Iran and its struggle for legitimate interests, including the peaceful use of atomic energy, said Putin.\n\nThe Russian leader also sharply criticized those questioning Moscows loyalty to its allies, labeling them as agents of division.\n\nThose who say Russia is not a reliable partner are provocateurs, he declared.\n\nPutins remarks come as fighting between Israel and Iran intensifies, with global powers watching closely and concerns mounting over broader regional destabilization.\n\nBy backing Irans right to nuclear energy and condemning Israels actions, Putin has signaled Russias alignment with Tehran in what is quickly becoming a high-stakes geopolitical confrontation.\n\nJUST IN:  Russia says there is no evidence that Iran is seeking to acquire nuclear weapons.pic.twitter.com/0XP1auUrsk\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Russian President Vladimir Putin has thrown his weight behind Iran amid rising tensions and armed conflict with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/21/putin-backs-iran-in-escalating-conflict-with-israel/\">Continue reading<span class=\"screen-reader-text\"> \"Putin Backs Iran in Escalating Conflict With Israel\"</span></a></p>",
            "time": "20:37",
            "date": "22 Jun 2025"
        }
    ]
}