{
    "news": [
        {
            "title": "Warriors Climb Five Places in FIFA Rankings",
            "url": "https://www.zimeye.net/2025/04/05/warriors-climb-five-places-in-fifa-rankings/",
            "content": "Sports Correspondent\n\nThe Zimbabwe national football team, also known as the Warriors, has made significant gains in the latest FIFA Rankings, released on Thursday. After a busy international break, the team has climbed five places to reach number 116 globally, their highest position since September 2021.\n\nDuring the recent FIFA international break, the Warriors played two crucial matches against Benin and Nigeria in Group C of the 2026 World Cup Qualifiers. Although they didnt secure any wins, their draws against higher-ranked opponents earned them ten valuable points. The team drew 2-2 with Benin and 1-1 with Nigeria, showcasing their resilience and determination.\n\nThis impressive performance has not only boosted their global ranking but also propelled them to number 30 in Africa, a three-place rise. While Morocco remains the top-ranked team on the continent, the Warriors progress is a promising sign for Zimbabwean football.\n\nGlobally, Argentina continues to hold the top spot in the FIFA Rankings, but the Warriors climb is a notable achievement, especially considering their recent performances against stronger opponents.\n\nWith this momentum, the team is poised to make further gains in the rankings and potentially challenge for a spot in the World Cup.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe national football team, also known as the Warriors, has made significant gains in the latest FIFA … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/warriors-climb-five-places-in-fifa-rankings/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Climb Five Places in FIFA Rankings\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Mnangagwa In Health Scare",
            "url": "https://www.zimeye.net/2025/04/05/mnangagwa-in-health-scare/",
            "content": "By Munacho Gwamanda- President Emmerson Mnangagwa is facing a fresh politicalcrisis,amid revelations that he may have vascular dementia  a condition that, if confirmed, could trigger impeachment proceedings over his fitness to govern.\n\nThe claimswere madeby war veteran and former Zanu PF Central Committee member Blessed Geza, who alleges that Mnangagwas deteriorating mental health has rendered him unfit for office.\n\nGeza argues that under Zimbabwes Constitution,the President can be removedon the grounds of incapacity due to ill health.\n\nDuring the recent inauguration of Lieutenant General Anselem Sanyatwe as Commander of the Zimbabwe Defence Forces at State House, Mnangagwa reportedly failed torecognisehis long-time political ally and Minister of Local Government, July Moyo.\n\nAccording to sources present, the President asked, Who is this man? Where is he from, and what does he do? In a separate incident just days later, Mnangagwa reportedly expressed surprise that the countrys railway system was not operational  an issue that has been a public concern for years.\n\nGeza claims these episodes are symptomatic ofvascular dementia, a progressive cognitive disorder caused by reduced blood flow to the brain.\n\nThe condition affects memory, judgment, reasoning, language, and spatial awareness.\n\nSufferers may also experience confusion, irritability, depression, and problems with balance and coordination.\n\nAccording to Geza, a clique of looters within Mnangagwas inner circleis exploitinghis condition  allegedly manipulating him to sign documents and approve controversial decisions without full awareness of their implications.\n\nHe claims frequent and unusual visits to the Presidents official residenceby senior officialshave raised suspicions that the ailing leader is being used as a rubber stamp by powerful interests.\n\nGeza further revealed thata group of lawmakershasbegun informal discussions on launching impeachment proceedings against Mnangagwa, citing incapacity and dereliction of duty.\n\nIf successful, this would be the first time in Zimbabwes history that a sitting Presidentis removedon medical grounds.\n\nThe health revelations come at a time of renewed tensions within the ruling Zanu PF party, as long-simmering power struggles between Mnangagwa and his deputy,Vice President Constantino Chiwenga, resurface.\n\nThe two men have shared an uneasy alliance since the 2017 military coup that toppled long-time leader Robert Mugabe.\n\nAlthough Chiwenga was instrumental in Mnangagwas rise to power, their relationship has grown increasingly strained, with factional battles often playing out behind closed doors.\n\nChiwenga, who commands significant influence within the military and war veterans circles, has long been viewed as a potential successor  or rival  to Mnangagwa.\n\nHis ambition to lead has been an open secret in party corridors, and many see the current health scare as a political opportunity for him to consolidate his position.\n\nSources within Zanu PF say Mnangagwa hasin recent monthsmoved to sideline Chiwenga loyalists, while simultaneously promoting hisownallies in both the security sector and government ministries.\n\nMnangagwas health crisis also has regional implications.\n\nHe currently serves as Chairperson of theSouthern African Development Community (SADC) a position he assumed in August 2024.\n\nAny instability in Zimbabwes leadership could ripple across the region, especially given the countrys strategic location and historical political volatility.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- President Emmerson Mnangagwa is facing a fresh political crisis, amid revelations that he may have vascular dementia — a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/mnangagwa-in-health-scare/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa In Health Scare\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Be Mindful of Long Vehicles on Roundabouts",
            "url": "https://www.zimeye.net/2025/04/05/be-mindful-of-long-vehicles-on-roundabouts/",
            "content": "When navigating roundabouts or joining a road, its important to be mindful of long vehicles, such as trucks or buses, which may need to use more than one lane to make their turns. These vehicles require additional space and may take a different course than expected to safely maneuver through the area.\n\nTo ensure safety for both yourself and the driver of the long vehicle, stay well back and give them plenty of room. Remember, their size and turning radius mean they need extra space to complete the maneuver without obstruction. By keeping a safe distance and being patient, you help prevent accidents and ensure smoother traffic flow for everyone on the road.\n\nAlways be aware of the needs of larger vehicles, particularly in tight spaces like roundabouts or when merging onto busy roads. Safety and awareness are key to preventing collisions and promoting safer driving habits.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When navigating roundabouts or joining a road, it’s important to be mindful of long vehicles, such as trucks or buses, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/be-mindful-of-long-vehicles-on-roundabouts/\">Continue reading<span class=\"screen-reader-text\"> \"Be Mindful of Long Vehicles on Roundabouts\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Winky D’s Latest Hit Ruffles Zanu PF’s Feathers….",
            "url": "https://www.zimeye.net/2025/04/05/winky-ds-latest-hit-ruffles-zanu-pfs-feathers/",
            "content": "By A Correspondent\n\nZimbabwes greatest reggae dancehall singer, Winky D, has once again proven his mettle with the release of his latest song, Propaganda. The track is being hailed as one of the best reggae songs ever written by a Zimbabwean artist, with fans praising Winky Ds thought-provoking lyrics and infectious beats.\n\nWinky D is the voice of the people, said fan, Takudzwa Moyo. Hes not afraid to speak truth to power and sing about the struggles of Zimbabweans. Propaganda is a game-changer  its like hes holding a mirror to society and forcing us to confront our realities.\n\nThe song was produced by Dynamq, a renowned international reggae sound system selector and music producer from South Sudan. This collaboration has resulted in a track that is both authentic and innovative.\n\nIm blown away by Winky Ds lyrical genius, said fan, Rumbidzai Muzondo. Hes a true artist who wears his heart on his sleeve. Propaganda is a call to action, a reminder that we need to stand up for what we believe in and fight for our rights.\n\nWinky Ds music has always been a reflection of his surroundings and the struggles of his people. His Extended Play album, Pabho, is available to purchase or stream on various platforms, including Qobuz, Apple Music, and Amazon Music.\n\nWinky D is a shining star in the Zimbabwean music scene, said fan, Tawanda Zvandasara. Hes a beacon of hope for the youth, a reminder that our voices matter and that we can create change through our art.\n\nWith Propaganda, Winky D cements his position as one of Zimbabwes most influential musicians, using his platform to speak truth to power and inspire his fans to take action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s greatest reggae dancehall singer, Winky D, has once again proven his mettle with the release of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/winky-ds-latest-hit-ruffles-zanu-pfs-feathers/\">Continue reading<span class=\"screen-reader-text\"> \"Winky D’s Latest Hit Ruffles Zanu PF’s Feathers….\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Zanu PF Official In Trouble For Supporting “Geza Revolution”",
            "url": "https://www.zimeye.net/2025/04/05/zanu-pf-official-in-trouble-for-supporting-geza-revolution/",
            "content": "By A Correspondent\n\nZaka Ward 24 Zanu PF Councillor Zivanai Zvada is currently in police custody after being arrested on April 1, 2025, for allegedly inciting public disorder.\n\nThe arrest stems from a message he forwarded in a local WhatsApp group on March 31, which included the controversial slogan Mnangagwa must go.\n\nAccording to a source, Zvadas arrest is tied to his support for war veteran Blessed Geza, who has been vocal in challenging President Emmerson Mnangagwas attempts to undermine the constitution. The source revealed: He is being accused of taking Blessed Gezas side. Geza, who led protests on March 31 against Mnangagwas actions, has also been spearheading efforts to initiate impeachment proceedings against the President.\n\nThe arrest of Zvada comes at a time of growing political unrest in Zimbabwe, with many citizens and activists criticizing Mnangagwas leadership and calling for his removal. Gezas push to challenge Mnangagwas constitutional actions has garnered attention, and the protests have sparked significant debate on the state of governance in the country.\n\nZvadas situation reflects the increasingly tense political climate, with local government officials now finding themselves at odds with the ruling party over the growing discontent.\n\nHis arrest has sparked further discussions on freedom of expression and political dissent in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zaka Ward 24 Zanu PF Councillor Zivanai Zvada is currently in police custody after being arrested on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/zanu-pf-official-in-trouble-for-supporting-geza-revolution/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Official In Trouble For Supporting “Geza Revolution”\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Top Zim Academic Champions Postdoc Networking At South Africa’s Rhodes University",
            "url": "https://www.zimeye.net/2025/04/05/top-zim-academic-champions-postdoc-networking-at-south-africas-rhodes-university/",
            "content": "By Garikai Chaunza- A prominent Zimbabwean scholar is playing a key role in shaping the academic future of postdoctoral fellows at Rhodes University.\n\nProfessor Sybert Mutereko, Director of the Centre for Postgraduate Studies (CPGS) at Rhodes, recently led a successful Postdoctoral Networking Forum in partnership with theuniversitysGlobal Engagement Division.\n\nThe event, held on March 26, marked the conclusion of the 2025 Annual Postgraduate Orientation Programme and brought together early-career researchers from across disciplines to explore opportunities for academic growth and collaboration.\n\nIn his opening remarks, Prof Mutereko introduced thePostdoctoral Frameworkcurrently underdevelopmentand invitedfeedback to ensure it meets the needs of fellows.\n\nHe emphasized RhodesUniversityscommitment to nurturing postdocs through three pillars:\n\nRhodes University is your platform to grow, lead, and innovate,he said.Dontlimit yourself to publishing from your PhD. Think bigger. Apply for grants, start yourownresearch initiatives, and transition into academic leadership.\n\nRhodes University Vice-Chancellor,Professor Sizwe Mabizela, reaffirmed theinstitutionscommitment to postdocs, emphasizing their value to the research enterprise.\n\nWe are determined to ensure that youarenot treatedas cheaplabour,but rather as scholars in your own right,he said.Our goal is to help you build strong academic profiles andtransition into tenured roles with ease.\n\nProf Mabizela also promised increased institutional support, structured programs, mentorship, and funding opportunities, acknowledging the often invisible contributions of postdocs.\n\nAt Rhodes, we inspire imagination, awaken curiosity, and nurture creativity. Youhave a chance toshape this culture through your mentorship, collaboration, and scholarship,he said.\n\nPostdoctoral fellowDr. Sixolile Centane, from the Department of Inorganic-Analytical Chemistry, delivered a powerful address raising two pressing concerns: lack ofmentorship in publishingand limitedaccess to funding.\n\nPublishing is essential for career progression, especially for those aiming for lecturing positions,she said.But not all of us had access to academic writing support during our PhDs. We need structured guidance.\n\nShe also highlighted the need for sustainable research funding, travel grants, and support for attending international conferences.\n\nInternational fellows also flagged administrative hurdles such asvisa delaysand banking restrictions.\n\nIn response,Ms Orla Quinlan, Director of Global Engagement, assured participants that these matters werebeing addressedat the institutional level.\n\nThe forum concluded with the election of thePostdoctoral Representative Body, designed to give fellows a voice within the university structure:\n\nDr. Ouma,originally from Kenya, shared her journey of navigating life at Rhodes with little guidance.\n\nWhen I arrived, I felt unanchored  neither student nor staff. I had to figure it out by trial and error,she said.I want future postdocs to have a better, clearer support structure.\n\nTheCentre for Postgraduate Studieshosts thePostdoctoral Networking Forumannually to foster peer connections, encourage research collaboration, and introduce new fellows to available support systems.\n\nThe Centre also runs ongoing academic development programsaimed at empoweringpostgraduates and early-career researchers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Garikai Chaunza- A prominent Zimbabwean scholar is playing a key role in shaping the academic future of postdoctoral fellows … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/top-zim-academic-champions-postdoc-networking-at-south-africas-rhodes-university/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zim Academic Champions Postdoc Networking At South Africa’s Rhodes University \"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Mnangagwa’s Ex-Girlfiend Says His Dementia Is Getting Aggressive into Stage 2",
            "url": "https://www.zimeye.net/2025/04/05/mnangagwas-ex-girlfiend-says-his-dementia-is-getting-aggressive-into-stage-2/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Top Masvingo Zanu PF Official Dies",
            "url": "https://www.zimeye.net/2025/04/05/top-masvingo-zanu-pf-official-dies/",
            "content": "By A Correspondent\n\nA senior Zanu PF official in Masvingo has passed away under mysterious circumstances.\n\nIn a statement on Friday, Zanu PF Masvingo North Constituency MP Brian Mudhumi expressed his grief, saying:\n\nToday ( Friday ) I was at Zimuto Siding Center to pay my last respects to Cde Tandanda, our Ward 2 District Chairman.\n\nIt is a painful moment for our constituency, losing such a luminary and cadre of our great party, Zanu PF.\n\nHe continued, Two weeks ago, we were together, and he introduced me at Mazambara School, and now we are at his funeral Very painful indeed. Cde Tandandas party history dates back to Cde Stan Mudenges era, and up to the time of his untimely death, he had been a stalwart of our party. Tinoti Zororai murugare Cde, RIP Baba Vimbai Zimuto.\n\nTandandas death has left a significant void in the party, with many remembering him as a dedicated and long-standing member of Zanu PF, a party official said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A senior Zanu PF official in Masvingo has passed away under mysterious circumstances. In a statement on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/top-masvingo-zanu-pf-official-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Masvingo Zanu PF Official Dies\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Zanu PF Councillor Arrested Over Mnangagwa Must Go Whatsapp Messages",
            "url": "https://www.zimeye.net/2025/04/05/zanu-pf-councillor-arrested-over-mnangagwa-must-go-whatsapp-messages/",
            "content": "By A Correspondent\n\nZaka Ward 24 Zanu PF Councillor Zivanai Zvada is currently in police custody after being arrested on April 1, 2025, for allegedly inciting public disorder. The arrest stems from a message he forwarded in a local WhatsApp group on March 31, which included the controversial slogan Mnangagwa must go.\n\nAccording to a source, Zvadas arrest is tied to his support for war veteran Blessed Geza, who has been vocal in challenging President Emmerson Mnangagwas attempts to undermine the constitution. The source revealed: He is being accused of taking Blessed Gezas side. Geza, who led protests on March 31 against Mnangagwas actions, has also been spearheading efforts to initiate impeachment proceedings against the President.\n\nThe arrest of Zvada comes at a time of growing political unrest in Zimbabwe, with many citizens and activists criticizing Mnangagwas leadership and calling for his removal. Gezas push to challenge Mnangagwas constitutional actions has garnered attention, and the protests have sparked significant debate on the state of governance in the country.\n\nZvadas situation reflects the increasingly tense political climate, with local government officials now finding themselves at odds with the ruling party over the growing discontent.\n\nHis arrest has sparked further discussions on freedom of expression and political dissent in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zaka Ward 24 Zanu PF Councillor Zivanai Zvada is currently in police custody after being arrested on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/zanu-pf-councillor-arrested-over-mnangagwa-must-go-whatsapp-messages/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Councillor Arrested Over Mnangagwa Must Go Whatsapp Messages\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        },
        {
            "title": "Mutsvangwa Crosses Redline",
            "url": "https://www.zimeye.net/2025/04/05/mutsvangwa-crosses-redline/",
            "content": "By Munacho GwandaChristopher Mutsvangwahas crossed the redline after attacking the retired generals and directly ridiculing the recent demotion ofZimbabwe National Army (ZNA) Commander General Anselem Sanyatwe, suggesting hewas removedfor aligning with war veterans led byBlessedBombshellGeza, whohasbeen pushing forPresident EmmersonMnangagwasouster.\n\nMnangagwasabruptshake-up ofZimbabwessecurity leadership, includingSanyatwesremoval, comes amidescalating tensions within Zanu PF and fears of internal dissent ahead of theMarch 31 protestsorganized by disgruntled war veterans.\n\nWhile Mutsvangwa did not mention Sanyatwe by name, hemade veiled references toindividuals who allegedly sought touse the army for political ambitions.\n\nSpeaking at a press conference in Harare, Mutsvangwa laudedMnangagwasmove, stating that it was amasterstrokethat thwarted those who believed they wereanointed to lead and own the Zimbabwe National Army.\n\nSanyatwe, aclose ally of Vice President Constantino Chiwenga, was unceremoniously replaced byLieutenant General Emmanuel Matatuand reassigned asMinister of Sports, replacingInternational Olympic Committee president-elect Kirsty Coventry.\n\nHis demotionis widely seenas part ofMnangagwasbroader effort toweakenChiwengasinfluence within the military and neutralize potential threats to his leadership.\n\nSanyatwesdismissal is the latest episode in theongoing rivalry between Mnangagwa and Chiwenga, a factional battle that has shaped Zimbabwean politics since the2017 coupthat oustedRobert Mugabe.\n\nChiwenga, who played a pivotal role in installing Mnangagwa as president, has seen his influence graduallyeroded through strategic purges of his military allies.\n\nIn recent months, Mnangagwa hasreshuffled the top echelons of the security sector, ensuring that key positionsare filledwith loyalists.Thisincludes:\n\nThe moveis widely interpretedas an effort topre-empt any internal coup attemptsand to consolidateMnangagwasgrip on power ahead of2028,when speculation is rife that he may seek a controversialthird term.\n\nThe shake-up comes amid growing unrest within ZanuPFswar veterans faction, led by Geza, which has been vocal about corruption and worsening economic conditions.\n\nThe veterans had called formass protests on March 31, citing government mismanagement.\n\nMutsvangwa, himself a war veteran,dismissed the dissenters as power-hungry opportunistsand insisted that thenew security leadership has proven its loyalty to the President and the Constitution.\n\nHowever, analysts believe thatSanyatwesremovalis a direct blow toChiwenga, furtherweakening his prospects of succeeding Mnangagwa.\n\nThe two leaders have long been locked in a cold war over the2028 succession, withChiwengasfaction seeingMnangagwassecurity reforms as a deliberatemarginalization of military power in favor of civilian control.\n\nAs Mnangagwa tightens his hold onZimbabwessecurity forces, thebattle lines between him and Chiwenga continue to deepen, raising speculation about how long this fragile power balance will last.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwanda–Christopher Mutsvangwa has crossed the redline after attacking the retired generals and directly ridiculing the recent demotion of Zimbabwe National … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/05/mutsvangwa-crosses-redline/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Crosses Redline\"</span></a></p>",
            "time": "18:34",
            "date": "06 Apr 2025"
        }
    ]
}