{
    "news": [
        {
            "title": "Zimbabwe Could Have Bought Over 15 B2 Bombers With Funds Tagwirei’s Chopped in 13 Months After Bob Removal But Now It’s Stuck On 1960s AK Rifles",
            "url": "https://www.zimeye.net/2025/06/23/zimbabwe-could-have-bought-over-15-b2-bombers-with-funds-tagwireis-chopped-in-13-months-after-mugabe-removal/",
            "content": "Headline:\n\nZimbabwe Could Have Bought Over 15 B2 Bombers With Funds Lost to Tagwireis Empire After 2017 Coup\n\nBy Farai D Hove | Analysis |\n\nHarare  June 23, 2025\n\nZimbabwe could have purchased more than 15 state-of-the-art U.S.-manufactured B-2 Spirit stealth bombers with the USD32 billion that vanished through opaque deals involving controversial businessman Kudakwashe Tagwireis companies within a year after the November 2017 military coup that removed Robert Mugabe.\n\nAudio of Kuda Tagwirei explaining how he now possesses army powerhttps://t.co/Hn8KhXSFAxpic.twitter.com/d2j2wMTd7H\n\nThe revelation casts a stark light on the scale of looting that followed what was billed as a military-assisted transition but quickly turned into a looting spree under the new Emmerson Mnangagwa administration. Instead of stabilizing the economy, billions were siphoned off under murky transactions and command projects awarded to Tagwirei-linked firms.\n\nOperation Midnight Hammer: How the US utilized deception and attacked Iran under the cover of darkness.pic.twitter.com/VgN1Zc91xa\n\nMissing Billions: A Parliamentary Alarm\n\nIn February 2019, then Public Accounts Committee chairperson, opposition legislator Tendai Biti, raised the alarm during a televised session of Parliament, exposing what he described as the disappearance of unprecedented amounts of public funds.\n\nOn the 27th of December 2017, one month after the coup, USD2.7 billion suddenly came direct from the Ministry of Finance; where it went is not known. There is neither a voucher for it, nor a single bank statement to account for it, Biti stated.\n\nJust three months later, in March 2018, another USD3.2 billion was siphoned from state coffers in what Biti described as a financial black hole.\n\nThere is no voucher, no invoice, neither is there any paper trail. There is nothing you can put a finger to, he said.\n\nThese amounts, according to Biti and independent audits, formed part of a broader $32 billion hemorrhage from the fiscus by the end of 2018mostly channelled through companies and banks linked to Tagwirei, who had emerged as the de facto economic tsar post-coup.\n\nWhat $32 Billion Could Buy: A Military Comparison\n\nFor perspective, each B-2 bomber, built by Northrop Grumman, costs approximately USD2.1 billion including maintenance and support costs. With USD32 billion, Zimbabwe could have acquired at least 15 of the worlds most advanced bombersaircraft so powerful they are only possessed by the United States Air Force due to their unmatched stealth and strike capabilities.\n\nWhile no sane nation prioritizes such extravagant defense acquisitions in peacetime, the comparison underscores the astronomical scale of the plunder: money enough to revolutionize national infrastructure, fund education for generations, or industrialize the entire SADC regiongone in under 12 months.\n\nTagwireis Empire: No Accountability, No Trail\n\nThe bulk of the missing funds were funneled through opaque deals linked to Tagwireis Sakunda Holdings and associated shell companies. These included so-called Command Agriculture programs, fuel import subsidies, and currency arbitrage schemes enabled by Reserve Bank support.\n\nInvestigations by the Zimbabwe Anti-Corruption Commission (ZACC) and the Auditor General were repeatedly blocked, and to date, no single prosecution has been made over the transactions.\n\nTagwirei has denied any wrongdoing and has not been convicted of any crime. However, he remains on U.S. sanctions lists under the Global Magnitsky Act, cited for grand corruption, human rights abuses, and the undermining of Zimbabwes democratic institutions.\n\nA Nation Robbed in Broad Daylight\n\nEconomists say the plunder had lasting consequences: record inflation, widespread poverty, infrastructure collapse, and a currency in freefall. More importantly, it established a precedent for institutionalized impunity.\n\nWe saw what looked like a liberation celebration become a gold rush for those in power, said economist Godfrey Kanyenze. This was not just theftit was betrayal.\n\nThe figures presented by Biti remain unchallenged in Parliament, with successive finance ministers failing to table documentation accounting for the money.\n\nWhile some regimes misuse public funds, the Zimbabwe case has entered infamy for the speed and scale at which national wealth was liquidated.\n\nIn a single year, Zimbabwe lost the equivalent of 15 B-2 bombers, hundreds of hospitals, thousands of schools, and a decades worth of economic developmenta post-coup bonanza that history will remember not as liberation, but as legalized looting.\n\nFor more on the post-2017 public finance scandals and the collapse of state accountability, visit our investigative archive.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Headline: Zimbabwe Could Have Bought Over 15 B2 Bombers With Funds Lost to Tagwirei’s Empire After 2017 Coup By Farai … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/zimbabwe-could-have-bought-over-15-b2-bombers-with-funds-tagwireis-chopped-in-13-months-after-mugabe-removal/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Could Have Bought Over 15 B2 Bombers With Funds Tagwirei’s Chopped in 13 Months After Bob Removal But Now It’s Stuck On 1960s AK Rifles\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "Trump Says I Want To Thank Iran For Giving Us Early Warning",
            "url": "https://www.zimeye.net/2025/06/23/trump-says-i-want-to-thank-iran-for-giving-us-early-warning/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "Trump Says All Iran Sites Hit Were Totally Destroyed | Full Text",
            "url": "https://www.zimeye.net/2025/06/23/trump-says-all-iran-sites-hit-were-totally-destroyed-full-text/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "Qatar Closes Airspace After Iran Strikes US Airbase",
            "url": "https://www.zimeye.net/2025/06/23/qatar-closes-airspace-after-iran-strikes-us-airbase/",
            "content": "By Online Correspondent/ZimEye Qatar has closed its airspace and suspended all flights after Iran launched missile strikes on the US Al Udeid Air Base, the largest American military installation in the Middle East.\n\nThe move, announced on Monday, comes amid soaring tensions following the USs bombing of three suspected Iranian nuclear sites over the weekend using bunker buster bombs.\n\nIrans retaliatory strikes mark a significant escalation in the conflict involving Iran, the United States, and Israel.\n\nThe Qatari Defence Ministry said its air defence systems intercepted the incoming missiles and confirmed that there were no casualties at the base.\n\nResidents in Doha reported seeing missiles and interceptors streaking across the sky.\n\nQatars Al Udeid base was not the only target, Iranian state media confirmed simultaneous attacks on Ain al-Asad Air Base in western Iraq.\n\nIranian state television described the operation as a mighty and successful response to Americas aggression, accompanied by martial music and patriotic slogans.\n\nIranian President Masoud Pezeshkian, posting on X shortly before the attack, wrote: We neither initiated the war nor seek it. But we will not leave an invasion of great Iran unanswered. US President Donald Trump is reportedly in the White House Situation Room with his national security team, closely monitoring developments.\n\nThe strikes have caused widespread disruption to global air travel. Qatars Hamad International Airport, a major international hub, was forced to ground flights.\n\nOver 100 aircraft bound for Doha were forced to divert, with some rerouted mid-air.\n\nBritish Airways Flight 109, en route to Dubai, made a dramatic U-turn over Saudi Arabia and landed in Zurich after a nine-hour detour.\n\nMajor carriers including Singapore Airlines, Air France, Finnair, and British Airways have suspended flights to Doha and nearby Dubai.\n\nFinnair announced it would halt service to Doha through June 30 due to the situation in the region. Meanwhile, American Airlines, United, and Air Canada began reducing regional routes days earlier.\n\nThe ripple effects are global. Detours around closed airspace in Israel, Iran, and Iraq are increasing flight durations and fuel costs.\n\nAir France, for example, is taking up to an hour longer per flight as routes shift over Egypt and Saudi Arabia.\n\nQatar Airways confirmed it had temporarily suspended operations, stating: We are working closely with government stakeholders and the relevant authorities to support any passengers that have been impacted and will resume operations when the airspace reopens.\n\nThe airline, recently named the worlds best at the Skytrax Awards, is facing mounting pressure. CEO Badr Mohammed Al-Meer withdrew from the awards ceremony, citing operational responsibilities due to the geopolitical situation in the Middle East.\n\nAnalysts warn that further escalation, particularly if Iran follows through on threats to close the Strait of Hormuz, could disrupt global oil supplies and trigger a surge in prices.\n\nDiplomatic sources toldSky Newsthat the US and Gulf allies received advance warning of Irans missile launches.\n\nThe situation remains fluid and potentially explosive.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Online Correspondent/ZimEye – Qatar has closed its airspace and suspended all flights after Iran launched missile strikes on the US … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/qatar-closes-airspace-after-iran-strikes-us-airbase/\">Continue reading<span class=\"screen-reader-text\"> \"Qatar Closes Airspace After Iran Strikes US Airbase\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "Highlanders Fire Kelvin Kaindu Over Poor Results",
            "url": "https://www.zimeye.net/2025/06/23/highlanders-fire-kelvin-kaindu-over-poor-results/",
            "content": "By A Correspondent| Highlanders have sacked Kelvin Kaindu as their head coach for unsatisfactory  results.\n\nIn a statement, Highlanders said Try Ncube who was the first assistant to Kaindu will take charge of the team assisted by Agent Sawu.\n\nHighlanders play MWOS at Barbourfields stadium on Sunday in their next match.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Highlanders have sacked Kelvin Kaindu as their head coach for ‘unsatisfactory ‘ results. In a statement, Highlanders … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/highlanders-fire-kelvin-kaindu-over-poor-results/\">Continue reading<span class=\"screen-reader-text\"> \"Highlanders Fire Kelvin Kaindu Over Poor Results\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "JUST IN: Iran Attacks US Base in Qatar",
            "url": "https://www.zimeye.net/2025/06/23/just-in-iran-attacks-us-base-in-qatar/",
            "content": "Qatar Iran has launched missile strikes on the US Al Udeid Air Base in Qatar, prompting the Qatari government to immediately suspend all flights and close its airspace as a precaution.\n\nThe Al Udeid base, the largest American military installation in the Middle East, came under fire just days after the US reportedly dropped bunker buster bombs on three suspected Iranian nuclear sites over the weekend.\n\nIrans retaliatory strike marks a dangerous escalation in the ongoing tensions between Iran, the US, and Israel.\n\nIranian state television confirmed the attack, describing it as a mighty and successful response to Americas aggression, accompanied by martial music and patriotic slogans. In a separate strike, Iranian missiles also targeted the Ain al-Asad Air Base in western Iraq, according to Iraqi security officials.\n\nQatars defence ministry said its air defence systems successfully intercepted the incoming missiles, and there were no casualties reported at Al Udeid. Witnesses in Doha reported seeing missiles and interceptors streaking across the sky.\n\nA US government official confirmed that both the White House and the Pentagon are closely monitoring the situation. President Donald Trump is currently in the White House Situation Room with top security officials.\n\nIranian President Masoud Pezeshkian posted on social media shortly before the strikes, stating: We neither initiated the war nor seek it. But we will not leave an invasion of great Iran unanswered.\n\nDiplomatic sources toldSky Newsthat the US and some Gulf states were given advance warning of the missile launches.\n\nThe situation remains fluid.\n\nOnline/ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Qatar– Iran has launched missile strikes on the US Al Udeid Air Base in Qatar, prompting the Qatari government to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/just-in-iran-attacks-us-base-in-qatar/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Iran Attacks US Base in Qatar\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "Schoolboy Mauled by Marauding Dogs, Saved by Kombi Passengers in Harare Suburb",
            "url": "https://www.zimeye.net/2025/06/23/schoolboy-mauled-by-marauding-dogs-saved-by-kombi-passengers-in-harare-suburb/",
            "content": "By A Correspondent| Another brutal dog attack in Harares Ward 41 has sent shockwaves through the community, just weeks after a fatal incident in the same area. Councillor Kudzai Kadzombe issued an urgent alert to residents, confirming the latest victim  a young boy  was mauled by three domestic dogs while on his way to school.\n\nAccording to Cllr. Kadzombe, the attack occurred when two Boerboels and a Rottweiler escaped from a property after the owner failed to secure them properly while leaving for work.\n\nThe child sustained severe injuries to the throat, back, and abdomen. Fortunately, quick intervention from members of the public  including passengers from a nearby commuter omnibus (kombi)  saved his life.\n\nThe boy is currently hospitalized and receiving medical treatment.\n\nThis could have been another tragedy. We are grateful the boy survived, but this incident underlines the urgent need for responsible pet ownership, said Cllr. Kadzombe.\n\nShe emphasized that both this attack and the earlier fatal one involved owned dogs, not strays. In response, she has organized a joint operation with the council development control team and the Society for the Prevention of Cruelty to Animals (SPCA).\n\nBeginning next week, all dogs found roaming the streets of Ward 41 will be collected by authorities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Another brutal dog attack in Harare’s Ward 41 has sent shockwaves through the community, just weeks after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/schoolboy-mauled-by-marauding-dogs-saved-by-kombi-passengers-in-harare-suburb/\">Continue reading<span class=\"screen-reader-text\"> \"Schoolboy Mauled by Marauding Dogs, Saved by Kombi Passengers in Harare Suburb\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "ZRP Hunts Organizers of Alleged S÷x Party in Mutare",
            "url": "https://www.zimeye.net/2025/06/23/zrp-hunts-organisers-of-mutare-vuzu-party/",
            "content": "By A Correspondent| The Zimbabwe Republic Police (ZRP) has launched an investigation into a viral social media post advertising a controversial vuzu party allegedly planned for a private location in Mutare.\n\nAccording to the police, the post invites members of the publicparticularly youthsto participate in the gathering, which is being described as a sex party, with men reportedly required to pay USD 20 for entry.\n\nIn a statement released on Monday, the ZRP confirmed that it is actively probing the origins and organizers of the event.\n\nAuthorities expressed concern over the potential illegality of the gathering and its implications for public morals and safety.\n\nThe ZRP is investigating circumstances in which a viral social media post is inviting the public to participate in a vuzu or sex party in Mutare at a private location with men allegedly paying USD 20 to enter the premise, the statement read.\n\nThe ZRP warns the organizers that the law will take its course without fear or favour.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Zimbabwe Republic Police (ZRP) has launched an investigation into a viral social media post advertising a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/zrp-hunts-organisers-of-mutare-vuzu-party/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Hunts Organizers of Alleged S÷x Party in Mutare\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "High Flying MWOS Suffer First Defeat Of The Season",
            "url": "https://www.zimeye.net/2025/06/23/high-flying-mwos-suffer-first-defeat-of-the-season/",
            "content": "Sports Correspondent\n\nMWOS unbeaten run came to an end over the weekend as they suffered a 3-1 defeat to a determined Ngezi Platinum side, in what was a top-of-the-table clash.\n\nThe result saw Ngezi Platinum leapfrog MWOS to claim the top spot with 35 points  just one ahead of their opponents, who now sit second on the log.\n\nNgezi Platinum got off to a blistering start, with Obriel Chirinda finding the back of the net in just the second minute of the game. Although MWOS responded in the 22nd minute through Billy Vheremu, the equaliser did little to stem Ngezis momentum.\n\nAshwin Karengesha restored the home sides lead in the 55th minute, before Chirinda completed his brace in the 73rd minute to seal all three points for Ngezi.\n\nThe defeat marks MWOS first loss of the campaign, ending their impressive unbeaten streak and adding new intensity to the race for the championship.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent MWOS’ unbeaten run came to an end over the weekend as they suffered a 3-1 defeat to a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/high-flying-mwos-suffer-first-defeat-of-the-season/\">Continue reading<span class=\"screen-reader-text\"> \"High Flying MWOS Suffer First Defeat Of The Season\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        },
        {
            "title": "Pitbulls Owner to Know Fate Tuesday",
            "url": "https://www.zimeye.net/2025/06/23/pitbulls-owner-to-know-fate-tuesday/",
            "content": "By A Correspondent | A Harare man whose vicious pitbulls attacked and killed a passer-by in Bluffhill recently will know his fate this Tuesday, when Harare magistrate Marewanazvo Gofa is expected to hand down her bail ruling.\n\nThe ruling was initially expected on Monday, but the court indicated that the judgment was not yet ready.\n\nMike Mupinga is being charged with culpable homicide.\n\nMupinga is represented by his lawyer, Steven Chikotora, while the state is represented by Rufaro Chonzi.\n\nThe state alleges that Mupinga owns four vicious dogsthree pitbulls and a Rottweiler.\n\nIt is alleged that on May 31, he negligently left his dogs unmuzzled at his rented house in Bluffhill.\n\nThe house is secured by a low security wall.\n\nThe accuseds vicious dogs scaled over the short perimeter wall and met the now deceased Samuel Machara, who was walking along the nearby street.\n\nThe dogs bit the now deceased all over the body, said the prosecutor.\n\nMachara succumbed to deep wounds on his neck, hands, legs, and stomach.\n\nMupingas white pitbull was found with bloodstains when the police visited the scene.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A Harare man whose “vicious” pitbulls attacked and killed a passer-by in Bluffhill recently will know … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/23/pitbulls-owner-to-know-fate-tuesday/\">Continue reading<span class=\"screen-reader-text\"> \"Pitbulls Owner to Know Fate Tuesday\"</span></a></p>",
            "time": "09:35",
            "date": "24 Jun 2025"
        }
    ]
}