{
    "news": [
        {
            "title": "Why Does This Rhodesian Military Spy Resemble Emmerson Mnangagwa’s Face?",
            "url": "https://www.zimeye.net/2025/01/26/why-does-this-rhodesian-military-spy-resemble-emmerson-mnangagwas-face/",
            "content": "Emmerson Mnangagwas Dubious Liberation War Legacy and Allegations of Treachery.\n\nThe Mystery of Corporal Obert Ndlovu Mabaleka: Why Does This Man Resemble Emmerson Mnangagwa?\n\nWhy does Corporal Obert Ndlovu Mabaleka, a decorated Selous Scout operative during the Rhodesian Bush War, bear such an uncanny resemblance to Emmerson Mnangagwa? Why does his age align so closely with Mnangagwas? Could it be that their stories are intertwined in ways we are yet to fully uncover? And if so, what does this mean for our understanding of Zimbabwes liberation history?\n\nMabaleka was no ordinary soldier. As an infiltrator for the Rhodesian Selous Scouts, he disguised himself as a freedom fighter, infiltrated guerrilla camps, and led unsuspecting comrades into deadly ambushes. He was celebrated for his cunning, awarded the Bronze Cross of Rhodesia for gallantry, and operated in a world of shadows and deception. But what if the skills he perfecteddeceit, manipulation, and survivalmirror the traits of those who ultimately rise to power? Could this describe Mnangagwa himself?\n\nWhy has history seen infiltrators and manipulators ascend to leadership while true fighters are pushed aside? Could Mabaleka, had he survived (thats if he is even dead in the first place) have risen to the same heights as Mnangagwaperhaps even becoming president? And why do their timelines, roles, and methods seem eerily similar?\n\nThis story forces us to ask uncomfortable questions: Who were the real freedom fighters, and who merely played the part? Could the skills of a Selous Scout like Mabaleka reflect the very foundation upon which Zimbabwes leadership was built? The parallels between these two men demand answers, and the truth may change everything we thought we knew.\n\nIn the contested narrative of Zimbabwes liberation struggle, Emmerson Mnangagwa, the countrys president, has long portrayed himself as a revolutionary hero. However, allegations of betrayal, historical inconsistencies, and unanswered questions about his role in the struggle cast serious doubts on this image. Testimonies from former war veterans, political figures, and historical records challenge Mnangagwas narrative, raising questions about whether he was a genuine freedom fighter or an opportunist maneuvering for power.\n\nAllegations of Betrayal and Treachery\n\nFormer First Lady Grace Mugabe unleashed a startling claim in 2017, accusing Mnangagwa of plotting Robert Mugabes assassination shortly after the 1980 elections. Grace stated:This man, Emmerson Mnangagwa, tried to kill the president soon after the elections in March 1980. He told the president to go to Mozambique, saying whites wanted to kill him, while he had arranged for Mugabe to be killed.\n\nThis accusation mirrors similar allegations surrounding Mnangagwas alleged involvement in the suspicious death of his brother-in-law, Josiah Tongogara, a legendary commander of the Zimbabwe African National Liberation Army (ZANLA). Tongogara died in a mysterious car crash in December 1979. Many believe his death was orchestrated to remove a powerful rival for leadership.\n\nPolitical analyst Dr. Pedzisai Ruhanya observed:Tongogaras death conveniently cleared the path for Robert Mugabe to consolidate power, and Mnangagwa was deeply entrenched in that system. It raises questions about his role in eliminating key liberation figures.\n\nDespite these serious allegations, Mnangagwa has remained silent, fueling further suspicion.\n\nQuestioning Mnangagwas Liberation Credentials\n\nMnangagwa has long claimed to be a member of the famed Crocodile Gang, a group led by the late Cde William Ndangana that conducted sabotage missions in the 1960s. However, war veterans have dismissed these claims as fabricated.\n\nAt a 2019 press conference in Harare, Cde Karen Kazingizi, a liberation war veteran, directly questioned Mnangagwas liberation credentials:We want to know these comrades who go around cutting voters hands. Are they real comrades, or are they Mugabes people he took from Ian Smiths mercenaries? Emmerson Mnangagwa is one of them.\n\nShe added:After coming out of prison, Mnangagwa studied law instead of joining the war effort. He was recruited by Mugabe to replace those of us who fought in the trenches. How does that make him a liberation hero?\n\nHer comments reflect a broader frustration among genuine war veterans who feel their contributions have been overshadowed by politically motivated distortions of history.\n\nParallel Narratives: Obert Ndlovu Mabaleka and the Selous Scouts\n\nHistorical accounts from Rhodesian records present a chilling parallel to Mnangagwas ambiguous history. 644764 Corporal Obert Ndlovu Mabaleka, a decorated member of the Selous Scoutsa Rhodesian military unit specializing in pseudo-operationsexemplifies how Africans were recruited to infiltrate and sabotage liberation movements.\n\nMabalekas role as a pseudo-operator included infiltrating ZANLA camps and manipulating fighters into ambushes by Rhodesian forces. A Rhodesian military historian wrote:Mabalekas operations were highly effective. On one occasion, he convinced a group of 30 fighters to walk into a Rhodesian patrol, resulting in 10 enemy fatalities. His work blurred the lines between friend and foe, a hallmark of pseudo-operations.\n\nThis history raises unsettling questions: could Mnangagwa, whose age and timeline align with Mabalekas, have played a similar role? The silence surrounding his activities during critical years of the liberation struggle only deepens the mystery.\n\nGrace Mugabes Warning and Mnangagwas Evasion\n\nGrace Mugabes revelations extend beyond accusations of assassination plots. She also highlighted Mnangagwas alleged role in fostering a culture of political elimination:He worked with Mugabe to sideline real fighters after the war. Look at what happened to the Gamatox faction and other liberation leaders Mugabe purged.\n\nIndeed, Mnangagwas record during the Gukurahundi massacres of the 1980s, in which thousands of Ndebele civilians were killed, reveals a pattern of ruthless political maneuvering. As Minister of State Security at the time, Mnangagwa was accused of overseeing the Fifth Brigade, a North Korean-trained unit that carried out the atrocities.\n\nWar Veterans Demand Answers\n\nWar veterans have increasingly spoken out against Mnangagwas narrative. Cde Karen Kazingizi expressed the frustrations of many veterans:We fought in the trenches, but our contributions have been erased. Instead, we see individuals like Mnangagwa, who did not fight, claiming the glory. The youth deserve to know the truth.\n\nThe Truth Behind the Crocodile\n\nThe emerging contradictions in Mnangagwas narrative, coupled with testimonies from war veterans and Grace Mugabes explosive allegations, cast a long shadow over his liberation war legacy. His silence on these matters only amplifies doubts.\n\nZimbabweans deserve an honest reckoning with their history. Until Mnangagwa directly addresses these allegations, the question of whether he was a genuine freedom fighter or an opportunist working behind the scenes will continue to haunt his legacy. As Cde Kazingizi put it:The truth always finds a way to surface. It is time for Zimbabwe to confront its past.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Emmerson Mnangagwa’s Dubious Liberation War Legacy and Allegations of Treachery. The Mystery of Corporal Obert “Ndlovu” Mabaleka: Why Does This … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/why-does-this-rhodesian-military-spy-resemble-emmerson-mnangagwas-face/\">Continue reading<span class=\"screen-reader-text\"> \"Why Does This Rhodesian Military Spy Resemble Emmerson Mnangagwa’s Face?\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "Stuck In Hospital for 6 Years",
            "url": "https://www.zimeye.net/2025/01/26/stuck-in-hospital-for-6-years/",
            "content": "Heartbreaking Scene at Inyathi Mission Hospital: Mining Accident Victim Abandoned in Agony.\n\nBubi District, Matabeleland North Province  A shocking story of neglect and suffering has emerged from Inyathi Mission Hospital, where 36-year-old Mr. Fanuel Moyo, a mining accident survivor, has endured unimaginable pain and hardship for eight years.\n\nMr. Moyos left leg harbors a deep, rotting wound infested with live maggots that feed on his flesh, leaving blood-stained trails on his skin. This disturbing sight is a grim reminder of his prolonged suffering and lack of adequate medical care.\n\nSpeaking to the Sunday News on Wednesday, Mr. Moyo revealed the tragic series of events that led to his current condition.\n\nI am sitting out here in the sun because I feel very cold; I just took a bath, he said from his wheelchair, his voice heavy with sorrow.\n\nMining Accident That Changed His Life\n\nOn October 19, 2017, Mr. Moyo was severely injured in a mine collapse in the Dromoland area of Inyathi. Trapped from the waist down, he was pulled out using a rope tied around his chest, resulting in a spinal cord injury that left him paralyzed.\n\nAfter being treated at Inyathi Hospital, he was transferred to Mpilo Central Hospital in Bulawayo and later referred to Parirenyatwa Hospital in Harare. However, financial constraints cut his treatment short, forcing him to return to Mpilo and eventually his family home.\n\nHis mother, who suffered a stroke and was unable to care for him, could not provide the support he needed. With no suitable living conditions or caregiver available, he was readmitted to Inyathi Mission Hospital, where he has remained ever since.\n\nStruggles with Neglect and Pain\n\nMr. Moyos physical condition has deteriorated significantly over the years. Due to incontinence caused by his injury, he has sustained severe damage to his urethra and can no longer use urinary catheters. This has resulted in frequent leakage and infections, worsening his overall health.\n\nHis leg wound, described as deep and rotting, constantly produces maggots despite efforts by hospital staff to clean and treat it. He also suffers from multiple bedsores caused by prolonged periods of immobility.\n\nSome sores are healing, while others keep appearing because I am always sitting or lying down. I need medication to help with the healing, but I dont have money, he said.\n\nMr. Moyo revealed that his family has stopped visiting him, leaving him without financial support or food. The mine owner, Mr. Nhlanhla Makuyana, who initially provided assistance on the day of the accident, has since withdrawn his support.\n\nA Cry for Help\n\nInyathi Mission Hospital staff continue to do their best to care for Mr. Moyo, but limited resources have hindered their ability to provide adequate treatment.\n\nThis tragic story underscores the plight of disabled individuals in Zimbabwe, particularly those from impoverished backgrounds. It highlights the urgent need for improved healthcare services and social support systems for vulnerable patients like Mr. Moyo.\n\nFor now, Mr. Moyos suffering remains a stark reminder of the human cost of neglect and the urgent need for intervention to ensure he receives the care and dignity he deserves.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Heartbreaking Scene at Inyathi Mission Hospital: Mining Accident Victim Abandoned in Agony. Bubi District, Matabeleland North Province – A shocking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/stuck-in-hospital-for-6-years/\">Continue reading<span class=\"screen-reader-text\"> \"Stuck In Hospital for 6 Years\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "Zim Woman Brutally Murdered in Alberton Over a Canvas Dispute",
            "url": "https://www.zimeye.net/2025/01/26/zim-woman-brutally-murdered-in-alberton-over-a-canvas-dispute/",
            "content": "Zim Woman Brutally Murdered in Alberton Over a Canvas Dispute\n\nBreaking News: Zimbabwean Woman Brutally Murdered in Alberton Over a Canvas Dispute\n\nAlberton, South Africa  A 36-year-old Zimbabwean woman was savagely hacked to death with an axe by a South African man in the Emikhukhwini section of Alberton last week. The horrific attack occurred in front of her children while she had a baby strapped to her back.\n\nThe woman had reportedly approached the man to reclaim a canvas he had allegedly stolen from her shack to cover the roof of his own leaking shelter. The suspect, whose identity is known to the community, remains at large as law enforcement agencies have yet to apprehend him.\n\nThe Zimbabwe Community in South Africa (ZimCommunitySA), an organization that advocates for the rights of Zimbabwean nationals living in South Africa, has strongly condemned the brutal killing.\n\nZimCommunitySA condemns in the strongest terms the barbaric murder of this young mother, said the organizations spokesperson, Mr. Bongani Mkwananzi, in a statement. With her baby on her back and her children by her side, she was viciously attacked while simply trying to reclaim her property. This inhumane act highlights the ongoing vulnerability and systemic injustices faced by migrants in South Africa.\n\nMr. Mkwananzi criticized the apparent inaction by local authorities, stating that despite the suspect being known to the community, the police have not made any arrests, citing a lack of evidence.\n\nThis lack of decisive action emboldens criminals and sends a dangerous message that crimes against migrants are treated with less urgency, he added. The right to life, as guaranteed by South Africas Constitution, is universal and must be upheld for all individuals, regardless of nationality.\n\nThe spokesperson also pointed out that this tragic incident is not an isolated case but part of a broader pattern of violence, discrimination, and neglect faced by migrants. He emphasized the systemic failures in addressing such issues, which also impact migrants access to essential services, including healthcare.\n\nZimCommunitySA has called on community members to stand united against such acts of violence and demand accountability from both law enforcement and public institutions.\n\nWe urge South Africans to reflect on our shared humanity, said Mr. Mkwananzi. Migrants contribute significantly to the social and economic fabric of this country. Violence against any individual, regardless of their nationality, undermines the principles of justice and dignity.\n\nThe organization extended its deepest condolences to the family of the deceased and pledged its commitment to pursuing justice for the victim.\n\nMeanwhile, residents in the Emikhukhwini area have expressed fear and outrage over the incident, demanding immediate action from the police to ensure justice is served and to prevent further violence in their community.\n\nAs the search for the suspect continues, the case has sparked renewed calls for better protection of vulnerable migrant communities in South Africa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zim Woman Brutally Murdered in Alberton Over a Canvas Dispute Breaking News: Zimbabwean Woman Brutally Murdered in Alberton Over a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/zim-woman-brutally-murdered-in-alberton-over-a-canvas-dispute/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Woman Brutally Murdered in Alberton Over a Canvas Dispute\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "Police Officer In Court For Rape",
            "url": "https://www.zimeye.net/2025/01/26/police-officer-in-court-for-rape/",
            "content": "By A Correspondent\n\nA shocking case of alleged rape has rocked the Hwange district community, with a police officer stationed at Jambezi Police Station appearing in court to face charges.\n\nAccording to court documents, the incident occurred on the 18th of this month, when the 13-year-old victim was at a local shopping center with her cousin. The accused officer allegedly approached the girls, inquiring about their presence, before grabbing the victims hand and forcibly leading her behind the shops.\n\nThe officer then allegedly raped the young girl, warning her not to reveal the incident to anyone. However, the victim confided in her cousin, who promptly reported the incident to the police.\n\nAs a result, the accused officer was arrested and has since appeared in court. He has been remanded in custody until the 7th of next month.\n\nThe community is reeling in shock over the alleged incident, with many calling for swift justice to be served.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking case of alleged rape has rocked the Hwange district community, with a police officer stationed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/police-officer-in-court-for-rape/\">Continue reading<span class=\"screen-reader-text\"> \"Police Officer In Court For Rape\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "Top ANC Member Shot Dead…",
            "url": "https://www.zimeye.net/2025/01/26/top-anc-member-shot-dead/",
            "content": "By A Correspondent\n\nBREAKING NEWS: TOP ANC MEMBER SHOT AND KILLED FOR GOVERNMENT TENDERS\n\nA shocking murder has sent shockwaves through South Africas political landscape. Sduduzo Magwaza, a prominent ANC member and nominated chairperson of the party at Durban Ward 102 in Verulam, was brutally shot and killed at his flat in Cornubia on January 12, 2021.\n\nAccording to reports, Magwazas murder is linked to government tenders. Two men, who allegedly conspired to kill Magwaza to gain access to lucrative government contracts, have been arrested and are expected to appear in court soon. However, they have denied being in contact with each other in the days leading up to the murder.\n\nThe investigation into Magwazas murder is ongoing, but the motive behind the killing has raised concerns about the prevalence of corruption and violence in South Africas tender processes. The ANC has not yet released an official statement on Magwazas murder, but the incident is likely to have significant implications for the partys internal politics.\n\nAs the case unfolds, many are left wondering about the extent of corruption and violence in South Africas government tender processes. The murder of Sduduzo Magwaza serves as a stark reminder of the dangers of corruption and the need for greater transparency and accountability in government contracting.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent BREAKING NEWS: TOP ANC MEMBER SHOT AND KILLED FOR GOVERNMENT TENDERS A shocking murder has sent shockwaves … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/top-anc-member-shot-dead/\">Continue reading<span class=\"screen-reader-text\"> \"Top ANC Member Shot Dead…\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "Trade Union Boss’s Lavish Salary Sparks Outrage",
            "url": "https://www.zimeye.net/2025/01/26/trade-union-bosss-lavish-salary-sparks-outrage/",
            "content": "By A Correspondent\n\nA scandal is brewing in Zimbabwes trade union movement, with allegations emerging that Adoniah Mutero, the General Secretary of the United Food and Allied Workers Union, is earning a whopping $2,000 USD per month, while his members struggle to make ends meet. This lavish salary, which includes additional allowances for airtime, fuel, and entertainment, has sparked outrage among union members and staff.\n\nAccording to sources, Mutero has been using his leadership position to advance his personal interests, rather than serving the needs of his members. Workers claim that he, along with the national executive, have been awarding themselves excessively high salaries, far exceeding the countrys Poverty Datum Line.\n\nThe allegations dont stop there. Mutero is also accused of running a microfinance company, where membership funds are deposited, generating profits before being disbursed to workers personal accounts. Furthermore, workers claim that the union leadership is guilty of nepotism and failing to remit NSSA and PAYE contributions.\n\nThe unions staff has been vocal about their concerns, writing a letter to the Ministry of Labour last year highlighting the mismanagement of funds. While some improvements were noted, workers are still calling for a full investigation into the unions operations.\n\nAs the controversy unfolds, Muteros response has been dismissive, claiming that outside forces are influencing the allegations. However, the workers remain adamant that the union has lost its primary focus of representing their needs and interests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A scandal is brewing in Zimbabwe’s trade union movement, with allegations emerging that Adoniah Mutero, the General … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/trade-union-bosss-lavish-salary-sparks-outrage/\">Continue reading<span class=\"screen-reader-text\"> \"Trade Union Boss’s Lavish Salary Sparks Outrage\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "Watch: The Moment President Nelson Chamisa Arrived In Glen View to convey condolences to the Hakata family…",
            "url": "https://www.zimeye.net/2025/01/26/watch-the-moment-president-nelson-chamisa-arrived-in-glen-view-to-convey-condolences-to-the-hakata-family/",
            "content": "Watch: The Moment President Chamisa Arrived In Glen View to convey condolences to the Hakata family following the death of MP Grandmore Hakatapic.twitter.com/usgVC5Yh0a\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "Magwizi Lands Top ZIFA Post",
            "url": "https://www.zimeye.net/2025/01/26/magwizi-lands-top-zifa-post/",
            "content": "By A Correspondent\n\nIn a historic election held on Saturday in Harare, businessman Nqobile Magwizi emerged victorious, securing the presidency of the Zimbabwe Football Association (ZIFA). Magwizi triumphed over four other candidates, signaling a new chapter for the governance of football in the country.\n\nThe election, which was closely watched by both football enthusiasts and industry professionals, marks a significant moment in Zimbabwean football. With his business acumen and passion for the sport, Magwizi is poised to lead the charge in revitalizing the national game, which has faced numerous challenges in recent years, including financial instability, governance issues, and inconsistent performance on the field.\n\nMagwizis win has generated considerable excitement and hope among Zimbabwean football fans, many of whom believe that his leadership could usher in much-needed change. As a businessman, Magwizi brings a fresh perspective to ZIFA, with a focus on professionalizing the management of football, attracting sponsorships, and improving the overall infrastructure of the sport in Zimbabwe.\n\nI am committed to transforming Zimbabwean football, Magwizi said after his election. We have the talent, the passion, and the potential to make a mark on the international stage. My priority is to ensure that our football system is run transparently, efficiently, and with the interests of the players and fans at the forefront.\n\nOne of the key aspects of Magwizis vision is to strengthen grassroots football development. With an emphasis on creating sustainable systems from the bottom up, he hopes to provide young players with the tools they need to succeed. This includes improving coaching standards, offering better facilities, and ensuring that local talent is given the opportunity to shine.\n\nMagwizis presidency represents a fresh start for ZIFA, an organization that has been plagued by controversies and mismanagement in recent years. His approach is expected to focus on building trust among stakeholders, including players, coaches, officials, and fans, while tackling financial challenges head-on.\n\nThe election results were met with widespread support, and many have expressed optimism about the future direction of Zimbabwean football under his leadership. With Magwizi at the helm, ZIFA is expected to foster stronger relationships with international football bodies, such as FIFA and the Confederation of African Football (CAF), further enhancing Zimbabwes standing on the global football stage.\n\nAs Nqobile Magwizi takes the reins of ZIFA, there is hope that his leadership will help stabilize the sport and lead Zimbabwean football toward a brighter future. While challenges lie ahead, his vision for growth, professionalism, and youth development could lay the groundwork for a more successful and sustainable footballing environment in Zimbabwe.\n\nWith a clear mandate from the voters, Magwizis term as ZIFA president begins at a pivotal moment for the countrys football, and many are eager to see how his plans unfold in the coming months. If his election promises are anything to go by, Zimbabwean football could soon be poised for a major resurgence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a historic election held on Saturday in Harare, businessman Nqobile Magwizi emerged victorious, securing the presidency … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/magwizi-lands-top-zifa-post/\">Continue reading<span class=\"screen-reader-text\"> \"Magwizi Lands Top ZIFA Post\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "NEWLY ELECTED ZIFA BOARD MEMBERS",
            "url": "https://www.zimeye.net/2025/01/26/newly-elected-zifa-board-members/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has ushered in a new era with the election of its new board members on Saturday. The highly anticipated polls saw the following individuals emerge victorious:\n\nTafadzwa BenzaProfessor Thomas MarambanyikaKudzai KadzombeBrighton UshendibabaDavison MuchenaAlice Zeura\n\nThese newly elected board members are expected to play a pivotal role in shaping the future of Zimbabwean football. As they assume their positions, they will be tasked with addressing the various challenges facing the sport in the country, from grassroots development to international competitions.\n\nThe elections mark a significant milestone for ZIFA, and the new board members will be expected to work tirelessly to promote and develop football in Zimbabwe. With their combined expertise and passion for the sport, they are poised to drive positive change and elevate Zimbabwean football to new heights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has ushered in a new era with the election of its new board … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/newly-elected-zifa-board-members/\">Continue reading<span class=\"screen-reader-text\"> \"NEWLY ELECTED ZIFA BOARD MEMBERS\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        },
        {
            "title": "ZRP Cop Nabbed Over Rape",
            "url": "https://www.zimeye.net/2025/01/26/zrp-cop-nabbed-over-rape/",
            "content": "By A Correspondent\n\nA shocking case of alleged rape has rocked the Hwange district community, with a police officer stationed at Jambezi Police Station appearing in court to face charges.\n\nAccording to court documents, the incident occurred on the 18th of this month, when the 13-year-old victim was at a local shopping center with her cousin. The accused officer allegedly approached the girls, inquiring about their presence, before grabbing the victims hand and forcibly leading her behind the shops.\n\nThe officer then allegedly raped the young girl, warning her not to reveal the incident to anyone. However, the victim confided in her cousin, who promptly reported the incident to the police.\n\nAs a result, the accused officer was arrested and has since appeared in court. He has been remanded in custody until the 7th of next month.\n\nThe community is reeling in shock over the alleged incident, with many calling for swift justice to be served.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking case of alleged rape has rocked the Hwange district community, with a police officer stationed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/26/zrp-cop-nabbed-over-rape/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Cop Nabbed Over Rape\"</span></a></p>",
            "time": "09:26",
            "date": "26 Jan 2025"
        }
    ]
}