{
    "news": [
        {
            "title": "Auxillia Mnangagwa Is Mary the Mother Of Jesus, ZBC Source Says",
            "url": "https://www.zimeye.net/2024/12/23/auxillia-mnangagwa-is-mary-the-mother-of-jesus-zbc-source-says/",
            "content": "By A Correspondent | ZimEye | An unnamed Gweru elderly man says Auxillia Mnangagwa is Mary the mother of Jesus.\n\nI want to thank the giant lion Shumba for succeeding in marrying the Heart of Hearts-Mamoyo, who we can also title Mary who gave birth to Jesus, because she has demonstrated she has peoples lives at the heart, he says.\n\nWhat he says contradicts disclosures the First Lady herself has made during interviews with ZimEye, where she has claimed she has not subjected even her own elderly family members to violent military deployments, endangering them and the country at large by installing convicted armed robbers to strategic areas of national security.\n\nI was sat at the back row and I didnt even participate I was just listening, Auxillia tells ZimEye, while contradicting clear statements media and other video footage evidence of her descending onto her rural home-stead with over 80 soldiers and leading violent processions of taking over the Negomo chieftainship (2nd video below).\n\nAuxilia is also exposed in @AJIunitAl Jazeeras GoldMafia documentary that reveals the looting of billions of dollars in gold and US dollar reserves for the purpose election rigging and other corrupt enrichments across several African countries.\n\nThe man is one of a handful people who have received gifts from Auxillia Mnangagwa, according to the state broadcaster, ZBC.\n\nThe @ZBCNewsonline does not provide an inventory of the supplied goodies, and neither does it disclose the list of beneficiaries.\n\nAn unnamed Gweru elderly man says Auxillia Mnangagwa is Mary the mother of Jesus.I want to thank the giant lion Shumba for succeeding in marrying the Heart of Hearts-Mamoyo, who we can also title Mary who gave birth to Jesus, because she has demonstrated she has peoplespic.twitter.com/J3G5ScHG6f\n\nEmmerson Mnangagwa and his just awarded hospitality-degree-holder wife, Auxillia is since 2021 assembling their own army of armed robbers to ward off [Vice President] Constantino Chiwengas military, this investigation reveals.This is a developing security nexus showing thepic.twitter.com/H5i5mARY7j\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | An unnamed Gweru elderly man says Auxillia Mnangagwa is Mary the mother of Jesus. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/auxillia-mnangagwa-is-mary-the-mother-of-jesus-zbc-source-says/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa Is Mary the Mother Of Jesus, ZBC Source Says\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "The Rise of GONGOs in Africa: A Threat to Civil Society Independence",
            "url": "https://www.zimeye.net/2024/12/23/the-rise-of-gongos-in-africa-a-threat-to-civil-society-independence/",
            "content": "By Prosper Tiringindi\n\nIn my recent travels across East and West Africa, I delved into an issue that threatens the very essence of civil society across the continent: the rise of Government-Owned Non-Governmental Organizations (GONGOs). This phenomenon, though deeply entrenched in Southern Africa, is not confined to one region. It is an African problem, as governments increasingly seek to co-opt and control the work of non-profit organizations, undermining their independence and core mandate.\n\nWhile governments justify GONGOs as tools to streamline development or protect national interests, their true intent is often more sinister. GONGOs are being used to suppress dissent, erode the power of authentic civil society organizations, and push state propaganda disguised as humanitarian work.\n\nGONGOs: The African Experience\n\nIn Zimbabwe, the government has launched aggressive measures to control non-profit organizations under the guise of regulating their activities. The recently passed Private Voluntary Organizations (PVO) Bill is a classic example. It introduces stringent rules for NGOs, limits funding sources, and empowers the state to interfere in their governance. Genuine NGOs advocating for human rights, transparency, and accountability face intimidation, arrests, and raids, as witnessed in cases like Bikita Residents Association and Zimbabwe Young Sisters Empowerment.\n\nBut Zimbabwe is not alone in this struggle. During my visit to East Africa, I engaged with Maasai communities, a semi-nomadic ethnic group indigenous to Kenya and Tanzania. The Maasai have a rich cultural heritage and a deeply ingrained sense of autonomy. It was remarkable to hear their outright rejection of GONGOs, which they see as extensions of government control aimed at exploiting their lands and undermining their rights.\n\nThe Maasai expressed concerns that GONGOs were being used to displace them from their ancestral lands under the pretext of development and conservation. One elder I interviewed stated, We do not need the government to speak for us. We have lived with our own laws for generations, and we reject any organization that comes with the governments hand.\n\nThis sentiment echoes across Africa, where indigenous groups, community organizations, and genuine NGOs are pushing back against GONGOs. These state-controlled entities not only dilute the efforts of authentic non-profits but also redirect funding meant for grassroots development into the coffers of government-aligned groups.\n\nThe GONGO Problem in West Africa\n\nIn West Africa, the problem manifests differently but is no less troubling. Countries like Nigeria and Ghana have seen governments use GONGOs to counter criticism from human rights organizations and independent media. These GONGOs often present themselves as defenders of national pride, accusing legitimate NGOs of being agents of foreign influence.\n\nDuring my visit, I observed how GONGOs in West Africa are used as instruments of propaganda, mobilizing public opinion against international human rights standards and portraying genuine activists as enemies of progress. This deliberate erosion of trust in civil society weakens the very fabric of democratic governance.\n\nWhy GONGOs Are a Threat\n\nThe rise of GONGOs undermines the principles of transparency, accountability, and inclusivity that non-profits are meant to uphold. They:\n\nThe Maasai Model: A Beacon of Resistance\n\nThe Maasai peoples rejection of GONGOs offers a powerful lesson in resistance. Their steadfast commitment to their laws, culture, and autonomy highlights the importance of grassroots empowerment. The Maasais approach to governance is community-centered, with decisions made collectively rather than imposed by external entities.\n\nTheir resistance to GONGOs is a call to action for other African communities and civil society organizations. It underscores the need for solidarity in opposing state control and protecting the independence of non-profits.\n\nA Pan-African Call to Action\n\nAs I continue my work on this project, it is clear that the fight against GONGOs is not just a regional issue but a continental one. Governments across Africa must be held accountable for their attempts to control civil society. This requires:\n\nStrengthened Advocacy: Civil society organizations must collaborate across borders to expose and resist GONGOs.\n\nInternational Pressure: Donors and international bodies must ensure that their funding supports genuine non-profits, not state-controlled entities.\n\nGrassroots Mobilization: Communities like the Maasai must be empowered to defend their rights and autonomy against government interference.\n\nThe rise of GONGOs threatens to undo decades of progress made by civil society in Africa. But as the Maasai have shown, resistance is not only possible but necessary. Together, we can ensure that non-profits remain a force for good, independent from the grip of government control.\n\nProsper TiringindiHuman Rights Activist and Advocate for Civil Society Independence\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Prosper Tiringindi In my recent travels across East and West Africa, I delved into an issue that threatens the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/the-rise-of-gongos-in-africa-a-threat-to-civil-society-independence/\">Continue reading<span class=\"screen-reader-text\"> \"The Rise of GONGOs in Africa: A Threat to Civil Society Independence\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "War Vet Predicts Mnangagwa’s Imminent Fall",
            "url": "https://www.zimeye.net/2024/12/23/war-vet-predicts-mnangagwas-imminent-fall/",
            "content": "Showbiz Reporter- A renowned musician and war veteran, Clive Malunga, has predicted the political downfall of President Emmerson Mnangagwa.\n\nIn a viral video circulating on social media, the Jenaguru Arts Centre founder warns that Mnangagwa might not remain in power for another two years, citing rising discontent within the nation.\n\nMalunga, known for his candid views and contributions to Zimbabwean arts and liberation history, also criticised efforts to extend Mnangagwas rule beyond the constitutional limit of two terms, which ends in 2028.\n\nMnangagwa wont see 2030 or even 2026 because he isnt God, and he wasnt appointed by God to be President of Zimbabwe. Zimbabwe is boiling! declared Malunga.\n\nTati tingobuda pachena@nickmangwanaunotamba iwe uchamhanya hakopic.twitter.com/uk2QHXScxo\n\nMalungas remarks follow his history of sharp criticism against the government.\n\nLast year, he accused the ruling party of hijacking the revolution,taking particular aimat Mnangagwas close association with controversial preacher Passion Java during the 2023 election campaign.\n\nIn another viral clip, Malunga lamented, The revolution has gone to the dogs.\n\nThe government Sunday dismissed Malungas predictions.\n\nSpokesperson Nick Mangwana responded with a veiled jab on social media, mocking Malungas credibility and hinting at alleged links to a losing Zanu PF faction.\n\nMangwana posted on X:\n\nPUZZLE: We have had our fair share of washed-up musicians. Some have had their prime. While others never even had a prime. Some tried to revive their careers by joining a ruling party faction. They joined the wrong one which lost contestation for power and now given to intermittent rants. Who is it?\n\nReadthefullposthere.\n\nMalungas bold statements have rekindled public debate about the nations political future amid mounting economic and social challenges.\n\nKnown for his agitating stance, the former liberation fighter remains an influential figure whose wordscontinue toresonate with many Zimbabweans seeking accountability and change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Showbiz Reporter- A renowned musician and war veteran, Clive Malunga, has predicted the political downfall of President Emmerson Mnangagwa. In … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/war-vet-predicts-mnangagwas-imminent-fall/\">Continue reading<span class=\"screen-reader-text\"> \"War Vet Predicts Mnangagwa’s Imminent Fall\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Several Die In Triple Bubi Bus Crash",
            "url": "https://www.zimeye.net/2024/12/23/several-die-in-triple-bubi-bus-crash/",
            "content": "By Courts & Courts Reporter-Police have confirmed the death of over 10 people and the injury of several others in three separate road accidents.\n\nYesterday morning, two people died while two others were injured when three buses  Rimbi, Blue Circle and Tombs  were involved in a freak accident just before Bubi along the Harare-Masvingo-Beitbridge highway.\n\nA Rimbi Bus reportedly rammed onto the trailer of a stationary Tombs bus after its driver had lost control and hit a stationary Mbokodo bus, which then overturned, leaving two passengers seriously injured.\n\nThe pile up allegedly started after a Tombs bus developed a mechanical fault and pulled off the road after hitting a donkey around 4am.\n\nThe Mbokodo bus then stopped to rescue stranded passengers who were in the Tombs bus, and then came a Rimbi bus, which hit the Tombs bus trailer, forcing it to overturn.\n\nMasvingo provincial police spokesperson Inspector Kudakwashe Dhewa said bodies of the deceased were taken to Beitbridge District Hospital mortuary while the injured were taken to Beitbridge District Hospital.\n\nIt is not clear where all the three buses were going.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Courts & Courts Reporter-Police have confirmed the death of over 10 people and the injury of several others in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/several-die-in-triple-bubi-bus-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Several Die In Triple Bubi Bus Crash\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Shock As Kisimusi Kills Brother-in-law",
            "url": "https://www.zimeye.net/2024/12/23/shock-as-kisimusi-kills-brother-in-law/",
            "content": "A festive season celebration turned tragic in Gokwe, Zimbabwe, after a violent dispute ended in the fatal assault of a 30-year-old man. Bruce Kisimusi, 25, was apprehended by authorities on December 17, 2024, in connection with the murder of his brother-in-law, Mthembisi Sibanda.\n\nAs reported, the altercation occurred at Gababe Business Centre, where Kisimusi allegedly attacked Sibanda, striking him repeatedly on the head and face with an empty bottle and a brick. The victim succumbed to his injuries while receiving treatment at a local hospital in Gokwe.\n\nKisimusi will spend Christmas in jail as he awaits trial for the murder charge. The incident has sparked widespread shock and concern within the community, underscoring the dire consequences of violence and conflict.\n\nThe authorities have emphasized the importance of maintaining peace and stability, particularly during the holiday season. As the community comes to terms with this tragic event, many are calling for increased efforts to address the root causes of violence and promote a culture of non-violent conflict resolution.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A festive season celebration turned tragic in Gokwe, Zimbabwe, after a violent dispute ended in the fatal assault of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/shock-as-kisimusi-kills-brother-in-law/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Kisimusi Kills Brother-in-law\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Watch: Musician Declares Mnangagwa Is Not God",
            "url": "https://www.zimeye.net/2024/12/23/watch-musician-declares-mnangagwa-is-not-god/",
            "content": "GOD IS IN IT.pic.twitter.com/LbXjFdBcCj\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Veteran Musician Predicts Mnangagwa May Not Stay in Power Beyond 2026",
            "url": "https://www.zimeye.net/2024/12/23/veteran-musician-predicts-mnangagwa-may-not-stay-in-power-beyond-2026/",
            "content": "By A Correspondent\n\nVeteran musician and war hero Clive Malunga has added his voice to the ongoing debate about President Emmerson Mnangagwas political future, suggesting that Mnangagwa will not remain in office beyond 2026.\n\nMalunga, famed for his iconic song Nesango, which reflects on Zimbabwes liberation struggle, shared his views in a recent interview with Change Radio.\n\nHe dismissed the growing speculation about Mnangagwa potentially serving until 2030, stating, Only God knows a persons fate, not someone like Mnangagwa. He is not God. The 2030 narrative is baseless  who knows, he might not even last until 2026.\n\nA former participant in Zimbabwes liberation war, Malunga boldly stated that if Mnangagwa manages to stay in office past 2028, he would accept severe consequences. I will gladly face arrest and be taken to Chikurubi Maximum Prison if Mnangagwa remains in power beyond 2028, he said.\n\nMalungas comments further fuel the ongoing discussions about Mnangagwas leadership and the direction of Zimbabwes political future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran musician and war hero Clive Malunga has added his voice to the ongoing debate about President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/veteran-musician-predicts-mnangagwa-may-not-stay-in-power-beyond-2026/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran Musician Predicts Mnangagwa May Not Stay in Power Beyond 2026\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Clive Malunga Speaks Out Against Mnangagwa Third Term Mantra",
            "url": "https://www.zimeye.net/2024/12/23/clive-malunga-speaks-out-against-mnangagwa-third-term-mantra/",
            "content": "By A Correspondent\n\nVeteran musician and war hero Clive Malunga has weighed in on the ongoing debate about President Emmerson Mnangagwas political future, stating that the current leader will not remain in power beyond 2028.\n\nMalunga, best known for his hit song Nesango, which speaks about Zimbabwes liberation struggle, made his comments during a recent interview with Change Radio.\n\nHe dismissed the growing speculation about Mnangagwas potential for a 2030 term, saying, Only God the Almighty knows ones fate, not a fellow creature like Mnangagwa. Mr. Mnangagwa is not God. Stop the 2030 mantra, who knows, maybe he will not even go beyond 2028 in office.\n\nMalunga, a war veteran who participated in the liberation struggle in its later stages, boldly declared that if Mnangagwa manages to stay in power beyond 2028, he would be willing to face serious consequences. I vow to be taken to Chikurubi Maximum Prison if Mnangagwa remains in office beyond 2028, he declared.\n\nMalungas remarks add fuel to the ongoing discussions surrounding Mnangagwas leadership and the future of Zimbabwes political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran musician and war hero Clive Malunga has weighed in on the ongoing debate about President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/clive-malunga-speaks-out-against-mnangagwa-third-term-mantra/\">Continue reading<span class=\"screen-reader-text\"> \"Clive Malunga Speaks Out Against Mnangagwa Third Term Mantra\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mnangagwa Gets Bull Donation From Zanu PF Apologist",
            "url": "https://www.zimeye.net/2024/12/23/mnangagwa-gets-bull-donation-from-zanu-pf-apologist/",
            "content": "By A Correspondent\n\nIn an act of political tribute, Innocent Benza, the Zanu PF Member of Parliament for Mutasa Central, has gifted President Emmerson Mnangagwa a Boran bull following his attendance at a national youth event in the district earlier this week.\n\nMnangagwa was the guest of honor at the Manicaland Youth Forum and Africa Youth Day celebration, held at the Magamba Vocational Training Centre in Mutasa District. The event saw over 20,000 youths in attendance, marking it as a significant occasion.\n\nWashington Ziwiwi, the Mutasa District committee co-ordinator, confirmed the donation, highlighting Benzas gesture as a sign of appreciation. He stated, One of our MPs in our district, who is the secretary for legal affairs, Honourable Innocent Benza, has delivered a Boran bull breed to His Excellency President Emmerson Mnangagwa for officiating at an important youth programme in his district.\n\nZiwiwi explained that the gift was a token of gratitude, noting that the MP was thanking the president for gracing the historic event. The MP is thanking President Mnangagwa for being the guest of honour at the historic event, where over 20,000 youths attended, Ziwiwi added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In an act of political tribute, Innocent Benza, the Zanu PF Member of Parliament for Mutasa Central, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/mnangagwa-gets-bull-donation-from-zanu-pf-apologist/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Gets Bull Donation From Zanu PF Apologist\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        },
        {
            "title": "Angry Zanu PF Supporters Disrupt Party Meeting",
            "url": "https://www.zimeye.net/2024/12/22/angry-zanu-pf-supporters-disrupt-party-meeting/",
            "content": "By Political Reporter- Zanu PF party supporters in Bikita forced the partys Masvingo Provincial chairman, Ezra Chadzamira to adjourn a crucial party meeting after they protested over the sacking of their councillor on allegations of being anti-2030.\n\nThe areas ward 12 councillor, BrightonMushekwa, was issued with a prohibition order for not supporting the ED2030 agenda.\n\nThe meeting in Bikita, where the Zanu PF members were supposed to get free fertiliser, was called off after supporters demanded answers on why their councillor was issued with a prohibition order.\n\nThey said they can only accept the fertiliser distributed by their councillor.\n\nMushekwa, is among the over dozen party officials who have since appeared before the provincial disciplinary committee on allegations of opposing the 2030 agenda and supporting Chiwenga.\n\nChadzamira and his team from Masvingo at the meeting openly accused Mushekwa of getting money from Chiwenge to mobilise party supporters to turn against Mnangagwa.\n\nThe disrupted meeting was attended by district coordinating chairperson Taruona Chomunoda and provincial executive member Simon Muchafa, who rose to fame when his audio recording attacking Chiwenge and retired army general Engelbert Rugeje was leaked in October.\n\nChomunoda demanded questions in writing when contacted for comment.He did not respond to any of the questions.-Standard\n\nIn the audio, Muchafa is heard saying he would not support anyone who doesnt come from Masvingo to take over as president from Mnangagwa.\n\nDelight Mandebvu, the provincial youth chairman, Joulshua Chamisa Ward 23 chairman, Joshua Dhewa (Zanu PF shadow councillor ward 23) also attended the meeting held at Chikukutu turn off on Tuesday.The chairman was addressing people when a group of supporters demanded an explanation on the sacking of Mushekwa, a source who attended the meeting said.The supporters ordered that the fertiliser would not be distributed if their councillor was not there.They said they know the reason why their councillor was sacked and demanded that not even a single bag of fertilisers would be distributed by anyone else.The situation got worse when Chamunoda ordered the police to arrest the supporters, which saw the meeting being called off prematurely. Standard\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- Zanu PF party supporters in Bikita forced the party’s Masvingo Provincial chairman, Ezra Chadzamira to adjourn a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/angry-zanu-pf-supporters-disrupt-party-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Angry Zanu PF Supporters Disrupt Party Meeting\"</span></a></p>",
            "time": "09:29",
            "date": "23 Dec 2024"
        }
    ]
}