{
    "news": [
        {
            "title": "BREAKING: Army Of Cops Waiting To Arrest Walter Magaya At The Gates",
            "url": "https://www.zimeye.net/2025/11/11/breaking-army-of-cops-waiting-to-arrest-walter-magaya-at-the-gates/",
            "content": "By A Correspondent | Harare  Tuesday, 4 November 2025 | Barely hours after being granted US$3,000 bail by High Court Judge Justice Gibson Mandaza, self-proclaimed Prophet Walter Magaya is once again facing dramatic developments  this time, as over 15 armed police officers have positioned themselves at the Harare Magistrates Court gates, reportedly preparing to re-arrest him on fresh charges.\n\nZimEye correspondents on the ground report that armed CID officers and uniformed police are stationed both at the main exit gate and around Magayas convoy, effectively blocking his departure soon after the High Court ruling.\n\nHigh Court Bail Granted Earlier Today\n\nEarlier in the day, Justice Gibson Mandaza granted Magaya US$3,000 bail, ordering that he surrender his passport, report weekly to police, and not interfere with witnesses or complainants.\n\nThe ruling came after Magayas arrest on November 1, when he was detained by a Zimbabwe Republic Police (ZRP) crack team over multiple counts of rape and fraud.\n\nHis wife, Tendai Magaya, and two companies linked to him  Plannet Africa Pvt Ltd and Yadah Connect Pvt Ltd  are jointly charged in a 13-count fraud case involving thousands of dollars collected from church members for non-existent housing and farming projects.\n\nPolice Mobilise at Court Gates\n\nWitnesses at the Harare Magistrates Court say police reinforcements arrived shortly after 3PM, minutes before Magayas lawyers began processing his release papers.\n\nOfficers from both the Criminal Investigations Department (CID) and Support Unit are reportedly on site.\n\nOne senior officer told ZimEye off record that the fresh arrest is linked to separate pending investigations  believed to involve additional complainants who recently approached the police with new allegations.\n\nThere are further cases being compiled. This is not over, said a law enforcement source familiar with the operation.\n\nTense Atmosphere Outside Court\n\nAs of publication, Magaya remained inside the courthouse, flanked by his legal team, while his convoy of luxury vehicles was parked in the restricted zone under heavy police presence.\n\nSources described the atmosphere as tense and uncertain, with officers reportedly awaiting final instructions from senior commanders before executing the re-arrest.\n\nBackground: Fraud and Rape Charges\n\nThe latest move follows allegations outlined in official CID documents (CR 720/12/23), accusing Magaya of defrauding congregants through fake residential and farming schemes between 2016 and 2018.\n\nThe court papers detail how Magaya and his associates allegedly misrepresented ownership of land  including New Donnington Farm, owned by Dr Gideon Gono  and collected thousands of dollars from PHD members for stands that never materialised.\n\nHe is also facing separate rape allegations, currently being handled under closed court proceedings.\n\nZimEyes Earlier Warning Proven Correct\n\nZimEye last week cautioned members of the public against sharing personal data with unverified individuals claiming to be CID officers following circulation of a fake police notice.\n\nThe ongoing arrests and overlapping investigations appear to confirm the sensitive and expanding scope of the case, which ZimEye has been tracking since 2014.\n\nDeveloping Story\n\nAs of this report, Magayas legal team was in urgent discussions with police commanders to clarify the basis of the new detention.\n\nCourt officials have not yet issued an official statement, and ZimEye will continue to provide live updates from the scene as the situation unfolds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Harare – Tuesday, 4 November 2025 | Barely hours after being granted US$3,000 bail by High … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/breaking-army-of-cops-waiting-to-arrest-walter-magaya-at-the-gates/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Army Of Cops Waiting To Arrest Walter Magaya At The Gates\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Free Job Sikhala, Gift Ostallos Siziba Blasts Mnangagwa Regime Over Wiwa Arrest",
            "url": "https://www.zimeye.net/2025/11/11/free-job-sikhala-gift-ostallos-siziba-blasts-mnangagwa-regime-over-wiwa-arrest/",
            "content": "By Gift Ostallos Siziba  I was once arrested with Hon. Job Sikhala and all l can say is that he has endured more than most, all because of his undoubtable conviction to see a better Zimbabwe. For over three decades, he has walked in constant contact with danger, yet he continues to fight.\n\nHis life has been one of torment and torture, spent in the cruel hands of a brutal regime in Harare. Out of more than 90 false charges brought against him, he was acquitted in all, never compensated, never offered even a word of apology. Instead, they mocked and vilified him, turned him into cartoons and jokes told by regime troglodytes whose future he has sacrificed everything to defend.\n\nAfter spending more than a year in prison, he could have chosen the easier path, to retreat into private life. But that is not the life of a revolutionary. That is not the life of a fighter. You fight, no matter the cost!\n\nThey tormented him, his family, his spirit and when that was not enough, they pursued him even beyond our borders, into South Africa. Tonight, his future once again hangs in uncertainty.\n\nOf everything, Wiwa has been more than a comrade! We have laughed together. We have shared cells, buried comrades, canvassed for the movement, and celebrated small victories.\n\nWe can only look ahead with the conviction that one day, the people of Zimbabwe shall indeed be free!\n\nIn solidarity,\n\nFree Wiwa!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Gift Ostallos Siziba – I was once arrested with Hon. Job Sikhala and all l can say is that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/free-job-sikhala-gift-ostallos-siziba-blasts-mnangagwa-regime-over-wiwa-arrest/\">Continue reading<span class=\"screen-reader-text\"> \"Free Job Sikhala, Gift Ostallos Siziba Blasts Mnangagwa Regime Over Wiwa Arrest\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Chinomoma Forces Hapless Villagers To Align With Mnangagwa 2030 Agenda",
            "url": "https://www.zimeye.net/2025/11/11/chinomoma-forces-hapless-villagers-to-align-with-mnangagwa-2030-agenda/",
            "content": "Tinashe Sambiri  The ZANU PF Womens League Mashonaland West Village Development Coordinators (VDC) launch, held in Kazangarare, Hurungwe North Constituency on Monday, drew tens of thousands of villagersmany of whom appeared coerced into attending the event.\n\nThe launch was presided over by the ZANU PF National Secretary for Women Affairs, Mabel Chinomona, who commended the Mashonaland West Womens League, led by Constance Shamu, for mobilizing the local population in support of President Mnangagwas Vision 2030.\n\nChinomona praised the Presidents programs, saying, The VDC program, initiated by President Mnangagwa for the Womens League, aims to promote womens empowerment and enhance grassroots participation in community development in line with Vision 2030.\n\nObservers noted, however, that the launch appeared less a voluntary gathering and more an orchestrated exercise in political alignment, with villagers pressured to publicly support the ruling party.\n\nCritics argue that such programs, while branded as empowerment initiatives, are increasingly being used to consolidate loyalty to ZANU PF rather than genuinely benefit communities.\n\nChinomona added that the initiatives are meant to uplift women, stating, These initiatives are designed to uplift and empower all women, ensuring that no one is left behind in the countrys development journey. Yet some locals expressed skepticism, questioning whether the so-called empowerment programs translate into tangible support for ordinary citizens.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – The ZANU PF Women’s League Mashonaland West Village Development Coordinators (VDC) launch, held in Kazangarare, Hurungwe North … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/chinomoma-forces-hapless-villagers-to-align-with-mnangagwa-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Chinomoma Forces Hapless Villagers To Align With Mnangagwa 2030 Agenda\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Zanu PF Pays Tribute To Late Murakashi",
            "url": "https://www.zimeye.net/2025/11/11/zanu-pf-pays-tribute-to-late-murakashi/",
            "content": "Tinashe Sambiri  Zanu PFs Varakashi boss, Levison Chambati, on Tuesday paid tribute to the late Thabani Zororai, describing him as a dedicated patriot and comrade.\n\nFarewell, Our Brother-in-Arms, Cde Thabani Zororai, Chambati said. Yesterday, we lost not just a comrade, but a brother  Cde Thabani Zororai. A true patriot who stood firm in the digital trenches, defending our beloved Party ZANU PF and our President Cde Emmerson Dambudzo Mnangagwa with unmatched passion and loyalty.\n\nHe added, We fought side by side against cyber onslaughts, united by love for our country and the vision of a prosperous Zimbabwe under Vision 2030. Sadly, he has left us before seeing the fruits of the struggle he dedicated his energy and heart to.\n\nChambati further emphasized Thabanis impact beyond his political role. Cde Thabani was more than just a Murakashi  he was family. His commitment, courage, and unshakable belief in the revolution will continue to inspire us all.\n\nHe concluded with a poignant reflection: Hupenyu ndehwaMwari  ndivo mutori nemuchengeti. Rest in power, Cde Thabani. Your legacy lives on in the cause you served.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Zanu PF’s Varakashi boss, Levison Chambati, on Tuesday paid tribute to the late Thabani Zororai, describing him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/zanu-pf-pays-tribute-to-late-murakashi/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Pays Tribute To Late Murakashi\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Chivaura’s Goodwill Programmes Continue to Transform Mhondoro",
            "url": "https://www.zimeye.net/2025/11/11/chivauras-goodwill-programmes-continue-to-transform-mhondoro/",
            "content": "By A Correspondent  Community leader and philanthropist Honourable Vengai Chivaura has once again shown his dedication to uplifting rural communities, with his goodwill programmes making a tangible impact in Mhondoro.\n\nOn Saturday, 8 November 2025, Hon Chivaura spearheaded the distribution of maize seed in Ward 4, Ngezi RDC, Mhondoro Mubaira Constituency, drawing farmers eager for support ahead of the planting season.\n\nSpeaking at the event, Hon Chivaura emphasized his commitment to the people, saying: We represent community development and a genuine cause to help those around us.\n\nRecipients expressed gratitude for the initiative, highlighting how such programmes strengthen food security and assist vulnerable households. Community leaders also praised Hon Chivaura for maintaining strong engagement at the grassroots level.\n\nWith the rainy season approaching, the maize seed distribution has been welcomed as timely and essential, offering hope for better harvests and sustainable livelihoods.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Community leader and philanthropist Honourable Vengai Chivaura has once again shown his dedication to uplifting rural … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/chivauras-goodwill-programmes-continue-to-transform-mhondoro/\">Continue reading<span class=\"screen-reader-text\"> \"Chivaura’s Goodwill Programmes Continue to Transform Mhondoro\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "JUST IN: Prophet Magaya Freed",
            "url": "https://www.zimeye.net/2025/11/11/just-in-prophet-magaya-freed/",
            "content": "By Court Correspondent | Harare  Tuesday, 4 November 2025\n\nSELF-PROCLAIMED Prophet Walter Magaya, founder of the Prophetic Healing and Deliverance (PHD) Ministries, has been granted US$3,000 bail by High Court Judge Justice Gibson Mandaza, just three days after his arrest on rape and fraud charges.\n\nMagaya was arrested on November 1 by a Zimbabwe Republic Police crack team in connection with multiple reports of rape and large-scale housing fraud, allegations that have been under investigation since 2016 and first exposed through ZimEyes investigative reports.\n\nCourt Grants Bail\n\nJustice Mandaza ruled this afternoon that Magaya could be released on US$3,000 bail pending trial, under conditions that require him to surrender his passport, report once weekly to the police, and not interfere with witnesses or complainants.\n\nHis wife, Tendai Magaya, and two co-accused representing Plannet Africa Pvt Ltd and Yadah Connect Pvt Ltd, also appeared in related matters stemming from the same docket (CR 720/12/23), which lists 13 counts of fraud under Section 136 of the Criminal Law (Codification and Reform) Act, Chapter 9:23.\n\nZimEyes Early Warning to Victims Confirmed\n\nThe development follows ZimEyes recent public warning issued over the weekend, advising complainants not to submit their personal data to individuals posing as CID officers following the circulation of a fake police announcement on social media.\n\nThat alertpublished on ZimEyes official platformsstated that any police communication regarding Magayas case must come only through the official Zimbabwe Republic Police or the National Prosecuting Authority.\n\nThe so-called CID officer listed on a viral WhatsApp post was found to be unverified, refusing to provide a badge number or official identification, prompting ZimEye to classify the announcement as a scam.\n\nThe publication warned that the move could have been designed to harvest complainants private data ahead of possible legal manoeuvreswarnings that appear justified given todays court decision to grant bail.\n\nZimEye is the only news network thats persistently and consistently published Walter Magaya matters since 2014.\n\nBackground of the Case\n\nCourt documents reveal that between 2016 and 2018, Magaya and his companies allegedly misrepresented ownership of land in various parts of Zimbabwe, including New Donnington Farm, Chishawasha, Bulawayo, and Mutare, defrauding congregants of thousands of dollars through fake residential and farming projects.\n\nInvestigators say Dr Gideon Gonos New Donnington Farm was falsely presented to church members as property owned by Magaya and available for housing development.\n\nThe documents further state that no funds were recovered, despite payments exceeding US$50,000, R190,000, and ZWL1,000 collectively made by the complainants.\n\nBail Reaction and Ongoing Investigations\n\nWhile Magayas release has stirred mixed reactions, police sources confirmed that investigations remain ongoing, and the matter will proceed to trial once the State finalises the compilation of witness statements.\n\nZimEye understands that the fraud and rape dockets are being handled separately by the CID Commercial Crimes Division and the Victim Friendly Unit (VFU) under the supervision of senior prosecutors.\n\nNext Steps\n\nThe High Court ruling allows Magaya to resume his movements under strict conditions, while Magistrate Marehwanazvo Gofas remand court decisioninitially deferred pending the High Court outcomeis expected to align with todays ruling.\n\nZimEye will continue monitoring the developments and providing verified updates from official court proceedings and law enforcement sources.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Court Correspondent | Harare – Tuesday, 4 November 2025 SELF-PROCLAIMED Prophet Walter Magaya, founder of the Prophetic Healing and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/just-in-prophet-magaya-freed/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Prophet Magaya Freed\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Bootlicker-in-Chief: Tshabangu Publicly Endorses Mnangagwa Power Grab Bid …",
            "url": "https://www.zimeye.net/2025/11/11/bootlicker-in-chief-tshabangu-publicly-endorses-mnangagwa-power-grab-bid/",
            "content": "Tinashe Sambiri  Controversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has sparked outrage after publicly declaring full support for the extension of President Emmerson Mnangagwas term of office, a move widely condemned as blatant opportunism and political bootlicking.\n\nIn a statement that shocked many last week, Tshabangu said, I submit that the Parliament is aware of the legal processes regarding the extension of the Presidents term, which would also extend the life of the 10th Parliament. As long as its in the best interest of the citizenry, opposition, under my leadership in Parly, will support it.\n\nCritics argue that Tshabangus endorsement undermines the very principles of opposition politics, raising concerns that the CCC is compromising its integrity for political expediency. Observers condemned the move as a betrayal of the citizenry and the democratic mandate of the opposition.\n\nOne political analyst remarked, This is a shocking display of loyalty to the ruling party rather than the people. Supporting the extension of the Presidents term is a direct attack on democratic norms and the trust citizens place in opposition leaders.\n\nTshabangus sudden emergence from relative silence to champion a highly unpopular proposal has left many questioning his motives, with some accusing him of aligning with the ruling party for personal gain rather than genuine public interest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Controversial Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has sparked outrage after publicly declaring full … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/bootlicker-in-chief-tshabangu-publicly-endorses-mnangagwa-power-grab-bid/\">Continue reading<span class=\"screen-reader-text\"> \"Bootlicker-in-Chief: Tshabangu Publicly Endorses Mnangagwa Power Grab Bid …\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Zanu PF Murakashi Dies",
            "url": "https://www.zimeye.net/2025/11/11/zanu-pf-murakashi-dies/",
            "content": "Tinashe Sambiri  Zanu PFs Varakashi boss, Levison Chambati, on Tuesday paid tribute to the late Thabani Zororai, describing him as a dedicated patriot and comrade.\n\nFarewell, Our Brother-in-Arms, Cde Thabani Zororai, Chambati said. Yesterday, we lost not just a comrade, but a brother  Cde Thabani Zororai. A true patriot who stood firm in the digital trenches, defending our beloved Party ZANU PF and our President Cde Emmerson Dambudzo Mnangagwa with unmatched passion and loyalty.\n\nHe added, We fought side by side against cyber onslaughts, united by love for our country and the vision of a prosperous Zimbabwe under Vision 2030. Sadly, he has left us before seeing the fruits of the struggle he dedicated his energy and heart to.\n\nChambati further emphasized Thabanis impact beyond his political role. Cde Thabani was more than just a Murakashi  he was family. His commitment, courage, and unshakable belief in the revolution will continue to inspire us all.\n\nHe concluded with a poignant reflection: Hupenyu ndehwaMwari  ndivo mutori nemuchengeti. Rest in power, Cde Thabani. Your legacy lives on in the cause you served.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Zanu PF’s Varakashi boss, Levison Chambati, on Tuesday paid tribute to the late Thabani Zororai, describing him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/zanu-pf-murakashi-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Murakashi Dies\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Walter Magaya Granted US$3,000 Bail — ZimEye’s Earlier Warning to Victims Proven Correct",
            "url": "https://www.zimeye.net/2025/11/11/walter-magaya-granted-us3000-bail-zimeyes-earlier-warning-to-victims-proven-correct/",
            "content": "By Court Correspondent | Harare  Tuesday, 4 November 2025\n\nSELF-PROCLAIMED Prophet Walter Magaya, founder of the Prophetic Healing and Deliverance (PHD) Ministries, has been granted US$3,000 bail by High Court Judge Justice Gibson Mandaza, just three days after his arrest on rape and fraud charges.\n\nMagaya was arrested on November 1 by a Zimbabwe Republic Police crack team in connection with multiple reports of rape and large-scale housing fraud, allegations that have been under investigation since 2016 and first exposed through ZimEyes investigative reports.\n\nCourt Grants Bail\n\nJustice Mandaza ruled this afternoon that Magaya could be released on US$3,000 bail pending trial, under conditions that require him to surrender his passport, report once weekly to the police, and not interfere with witnesses or complainants.\n\nHis wife, Tendai Magaya, and two co-accused representing Plannet Africa Pvt Ltd and Yadah Connect Pvt Ltd, also appeared in related matters stemming from the same docket (CR 720/12/23), which lists 13 counts of fraud under Section 136 of the Criminal Law (Codification and Reform) Act, Chapter 9:23.\n\nZimEyes Early Warning to Victims Confirmed\n\nThe development follows ZimEyes recent public warning issued over the weekend, advising complainants not to submit their personal data to individuals posing as CID officers following the circulation of a fake police announcement on social media.\n\nThat alertpublished on ZimEyes official platformsstated that any police communication regarding Magayas case must come only through the official Zimbabwe Republic Police or the National Prosecuting Authority.\n\nThe so-called CID officer listed on a viral WhatsApp post was found to be unverified, refusing to provide a badge number or official identification, prompting ZimEye to classify the announcement as a scam.\n\nThe publication warned that the move could have been designed to harvest complainants private data ahead of possible legal manoeuvreswarnings that appear justified given todays court decision to grant bail.\n\nZimEye is the only news network thats persistently and consistently published Walter Magaya matters since 2014.\n\nBackground of the Case\n\nCourt documents reveal that between 2016 and 2018, Magaya and his companies allegedly misrepresented ownership of land in various parts of Zimbabwe, including New Donnington Farm, Chishawasha, Bulawayo, and Mutare, defrauding congregants of thousands of dollars through fake residential and farming projects.\n\nInvestigators say Dr Gideon Gonos New Donnington Farm was falsely presented to church members as property owned by Magaya and available for housing development.\n\nThe documents further state that no funds were recovered, despite payments exceeding US$50,000, R190,000, and ZWL1,000 collectively made by the complainants.\n\nBail Reaction and Ongoing Investigations\n\nWhile Magayas release has stirred mixed reactions, police sources confirmed that investigations remain ongoing, and the matter will proceed to trial once the State finalises the compilation of witness statements.\n\nZimEye understands that the fraud and rape dockets are being handled separately by the CID Commercial Crimes Division and the Victim Friendly Unit (VFU) under the supervision of senior prosecutors.\n\nNext Steps\n\nThe High Court ruling allows Magaya to resume his movements under strict conditions, while Magistrate Marehwanazvo Gofas remand court decisioninitially deferred pending the High Court outcomeis expected to align with todays ruling.\n\nZimEye will continue monitoring the developments and providing verified updates from official court proceedings and law enforcement sources.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Court Correspondent | Harare – Tuesday, 4 November 2025 SELF-PROCLAIMED Prophet Walter Magaya, founder of the Prophetic Healing and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/walter-magaya-granted-us3000-bail-zimeyes-earlier-warning-to-victims-proven-correct/\">Continue reading<span class=\"screen-reader-text\"> \"Walter Magaya Granted US$3,000 Bail — ZimEye’s Earlier Warning to Victims Proven Correct\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        },
        {
            "title": "Walter Magaya Granted Bail By High Court",
            "url": "https://www.zimeye.net/2025/11/11/walter-magaya-granted-bail-by-high-court/",
            "content": "Tinashe Sambiri  Self-proclaimed prophet Walter Magaya, facing serious charges of rape and fraud, has been granted US$3 000 bail by High Court judge Justice Gibson Mandaza in a decision that has already sparked criticism and concern.\n\nMagaya, arrested on November 1, walked out of custody despite the gravity of the allegations hanging over him. Many observers see the ruling as yet another example of leniency toward high-profile figures, raising questions about consistency and accountability within the justice system.\n\nJustice Mandaza ordered Magaya to surrender his passport, report twice weekly to the police, and hand over title deeds as surety  conditions some feel do little to reflect the severity of the charges he is facing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Self-proclaimed prophet Walter Magaya, facing serious charges of rape and fraud, has been granted US$3 000 bail … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/11/walter-magaya-granted-bail-by-high-court/\">Continue reading<span class=\"screen-reader-text\"> \"Walter Magaya Granted Bail By High Court\"</span></a></p>",
            "time": "18:36",
            "date": "11 Nov 2025"
        }
    ]
}