{
    "news": [
        {
            "title": "Ramaphosa: Lungu Should Be Buried In His Own Country | FULL TEXT",
            "url": "https://www.zimeye.net/2025/06/22/ramaphosa-lungu-should-be-buried-in-his-own-country-full-text/",
            "content": "It remains our considered view that the former President Lungu should be laid to rest in his own country of birth\n\nMr. Ronald Ozzy Lamola, Minister of International Relations and Cooperation of the Republic of South Africa.: Im here to convey a message on behalf of President Cyril Ramaphosa, the President of the Republic of South Africa, on behalf of the people of South Africa, a message of condolence on the passing of former president of Zambia, Dr Lungu who passed on in South Africa and also to convey our message of solidarity to the people of Zambia, to fact that we have got very good relations, Zambia and its people and we are also here to engage further to find a solution to the ongoing impasse or challenge with the Lungu family and the Zambian govt; And we continue to send back the message to the President of South Africa in an endeavour to find an amicable solution on this matter. It remains our considered view that the former President Lungu should be laid to rest in his own country of birth. But as we have engaged with, there is an impasse. And there are issues that still need to be addressed. And we are hopeful we are really that maybe one solution will be found on the matter. Thank you very much your Excellency.\n\nENDS\n\nWe were honoured to receive a courtesy call from Mr. Ronald Ozzy Lamola, Minister of International Relations and Cooperation of the Republic of South Africa.Minister Lamola conveyed heartfelt condolences from His Excellency President Cyril Ramaphosa and the people of South Africa on the passing of our 6th Republican President, Mr. Edgar Chagwa Lungu.We held a meaningful and respectful discussion regarding the burial of the late President, during which we reaffirmed our firm position that His Excellency Mr. Lungu should be laid to rest in his homeland, the Republic of Zambia.We extend our sincere gratitude to the President of South Africa for the care extended to our late President during his period of illness. We also express our apologies to the South African National Defence Force for the unexpected challenges surrounding the  repatriation of the late Presidents remains on Wednesday, 18th June 2025.\n\nHakainde Hichilema, President of the Republic of Zambia\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "It really is our persistent view that the former President Lungu should be laid to rest in his own country … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/ramaphosa-lungu-should-be-buried-in-his-own-country-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"Ramaphosa: Lungu Should Be Buried In His Own Country | FULL TEXT\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "Top Kwekwe Prophet Arrested for Murder",
            "url": "https://www.zimeye.net/2025/06/22/top-kwekwe-prophet-arrested-for-murder/",
            "content": "By Crime and Courts ReporterPolice in Kwekwe have arrested a prominent self-styled prophet and eight of her congregants in connection with the suspected ritual killing of a man during a spiritual ceremony.\n\nThe prophet,Charity Mafirowanda(46), was taken into custody along withTalent Khumalo(42),Bongani Paraffin(33),Admire Makota(23),Ronald Mandiedza(24),Margret Zireba(21),Lyton Ndlovu(19),Arnold Mashiri(23), andPauline Banda(33).\n\nThe group is accused of causing the death ofMicky Chuma(54) on June 18, 2025, during a cleansing ceremony held at a church shrine in Mbizo.\n\nAccording to police, the suspects allegedly administered a concoction to Chuma in a bid to exorcise what they believed were evil spirits. The ritual reportedly turned fatal, resulting in Chumas death.\n\nIn a bid to conceal the incident, the suspects are alleged to have transported Chumas body from the shrine to his home, where they placed it on a bed and covered it with blankets to make it appear as though he had died in his sleep.\n\nInvestigations are ongoing, and police say the accused will face murder charges. Authorities have warned the public against participating in dangerous unregulated spiritual practices that put lives at risk.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter –Police in Kwekwe have arrested a prominent self-styled prophet and eight of her congregants in connection … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/top-kwekwe-prophet-arrested-for-murder/\">Continue reading<span class=\"screen-reader-text\"> \"Top Kwekwe Prophet Arrested for Murder\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "ED Challenger Acquitted",
            "url": "https://www.zimeye.net/2025/06/22/ed-challenger-acquitted/",
            "content": "By A Correspondent| A Harare magistrate has withdrawn assault charges against former Zanu PF activist Sybeth Musengezi after the State failed to locate its key witness.\n\nMusengezi had been facing allegations of assaulting airtime vendor Norest Taruberekere, who allegedly disrupted a press conference he was addressing in central Harare on the state of the economy.\n\nAccording to accounts from the day, chaos erupted when two menreportedly vendorsstormed the Media Centre, where the briefing was taking place. Wearing green aprons and with their faces covered, the intruders tore down Musengezis banners and forced him to end the event prematurely.\n\nJournalists present at the scene witnessed the confrontation, which culminated in police forcibly removing Musengezi from the venue and placing him into a waiting truck.\n\nDuring court proceedings, prosecutor Takudzwa Jambawo informed magistrate Kudzai Mthombeni that the States case could not proceed due to the unavailability of the complainant, Taruberekere. With the key witness missing, the prosecution withdrew the charges.\n\nMusengezi was represented by human rights lawyer Doug Coltart.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A Harare magistrate has withdrawn assault charges against former Zanu PF activist Sybeth Musengezi after the State … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/ed-challenger-acquitted/\">Continue reading<span class=\"screen-reader-text\"> \"ED Challenger Acquitted\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "Mamelodi Sundowns Go Down Fighting",
            "url": "https://www.zimeye.net/2025/06/22/mamelodi-sundowns-go-down-fighting/",
            "content": "Sports Correspondent\n\nMamelodi Sundowns put on a spirited display in a thrilling seven-goal encounter against European giants Borussia Dortmund, ultimately falling 3-4 in a friendly match that kept fans on the edge of their seats until the final whistle.\n\nIt was a match that showcased the Brazilians grit, resilience, and attacking flair, even as they faced one of Europes most formidable sides. Goals from Lucas Ribeiro (11), Iqraam Rayners (62), and Lebo Mothiba (89) highlighted Sundowns intent and refusal to back down.\n\nDortmund responded with clinical precision, as Felix Nmecha (16) cancelled out Ribeiros early opener before Serhou Guirassy (34) and Jude Bellingham (45) gave the visitors a 3-1 lead heading into halftime. A freak own goal by Sundowns defender Khuliso Mudau (60) widened the gap, but Rayners strike just two minutes later reignited hope for the home side.\n\nMothibas late goal in the 89th minute gave Sundowns a chance to push for a dramatic equaliser, but Dortmund held firm in the dying minutes to seal the narrow win.\n\nDespite the loss, Sundowns walked away with their heads held high. The performance drew admiration from supporters, with many applauding the teams courage and attacking intent.\n\nA hard fought battle right to the final whistle! Not the result we were looking for but a performance to be proud of! One more game to play! the club posted after the match, reflecting both disappointment and pride.\n\nWith one more game left in their schedule, Sundowns will look to build on this momentum and continue proving their credentials on the international stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Mamelodi Sundowns put on a spirited display in a thrilling seven-goal encounter against European giants Borussia Dortmund, ultimately … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/mamelodi-sundowns-go-down-fighting/\">Continue reading<span class=\"screen-reader-text\"> \"Mamelodi Sundowns Go Down Fighting\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "Leaked Muchinguri Letter Over Army",
            "url": "https://www.zimeye.net/2025/06/22/leaked-muchinguri-letter-over-army/",
            "content": "The National Chairman of ZANU PFCde O.C.Z. Muchinguri22 June 2025\n\nDear Cde Muchinguri,\n\nRE: Unprocedural Co-option of Tagwirei into the Central Committee\n\nI am writing to express my deep concern regarding the recent co-option of Kudakwashe Tagwirei into the Central Committee of ZANU PF. Based on the partys constitution, it appears that this decision does not conform to the established rules and procedures.\n\nSpecifically, the constitution outlines clear guidelines for both membership and leadership positions. Tagwireis elevation to the Central Committee, despite being only a cell member, does not meet the required criteria. According to the constitution, waivers are typically granted to individuals who have previously held security positions in government or who are government employees.\n\nFailure to observe the partys own constitutionas well as the Constitution of Zimbabweundermines the principles of accountability, transparency, and fairness. It also raises concerns about the partys commitment to upholding its rules and the broader rule of law.\n\nI urge the leadership of ZANU PF to review this decision and ensure it aligns with the partys constitution. The people of Zimbabwe deserve leaders who are genuinely committed to the principles of democracy, accountability, and good governance.\n\nINSTITUTIONAL STRUCTURE:Cell member 1 year before elevation\n\nBranch structure 2 years before election\n\nDistrict structure 3 years before elevation\n\nDCC 4 yearsProvincial structure 5 years\n\nYours faithfully,Concerned Comrade\n\nCc: First Secretary of ZANU PF, Cde E.D. Mnangagwa Second Secretary of ZANU PF, Cde C.D.G.N. Chiwenga Second Secretary of ZANU PF, Cde K.C.D. Mohadi Secretary General, Cde O. Mpofu National Secretary for Commissariat, Cde Machacha Harare Province Chairman, Cde G. Masimirembwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The National Chairman of ZANU PFCde O.C.Z. Muchinguri22 June 2025 Dear Cde Muchinguri, RE: Unprocedural Co-option of Tagwirei into the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/leaked-muchinguri-letter-over-army/\">Continue reading<span class=\"screen-reader-text\"> \"Leaked Muchinguri Letter Over Army\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "America Unleashes Airstrikes On Iranian Nuclear Facilities",
            "url": "https://www.zimeye.net/2025/06/22/america-unleashes-airstrikes-on-iranian-nuclear-facilities/",
            "content": "By A Correspondent\n\nIn a dramatic escalation of Middle East tensions, President Donald Trump confirmed that the United States has launched targeted airstrikes on three Iranian nuclear facilities, marking a major turning point in U.S. military involvement in the region.\n\nTaking to Truth Social to announce the operation late Friday night, Trump declared:\n\nWe have completed our very successful attack on the three Nuclear sites in Iran, including Fordow, Natanz, and Esfahan. All planes are now outside of Iran air space.\n\nThe president further hailed the operation as a milestone moment, writing:\n\nThis is an HISTORIC MOMENT FOR THE UNITED STATES OF AMERICA, ISRAEL, AND THE WORLD. IRAN MUST NOW AGREE TO END THIS WAR. THANK YOU!\n\nTrump also amplified a message on social media declaring:\n\nFORDOW IS GONE, referring to Irans heavily fortified underground nuclear enrichment facility near the city of Qom.\n\nThe strike follows a week of high-level deliberations within the Trump administration over whether to formally join Israels ongoing military campaign against Tehran. The operation makes President Trump the first sitting U.S. leader since the 1979 Iranian Revolution to order direct airstrikes on Irans key nuclear infrastructure.\n\nSources familiar with the operation say the U.S. deployed B-2 Spirit stealth bombers, specifically chosen for their capability to carry the Massive Ordnance Penetratorwidely considered the only weapon capable of penetrating Irans deeply buried nuclear bunkers.\n\nEach B-2 bomber is capable of carrying two of the 30,000-pound bunker buster bombs, and analysts believe these were crucial in striking the hardened Fordow site, as well as facilities in Natanz and Esfahan.\n\nAs of now, Iran has not officially responded to the U.S. strike, but regional tensions are expected to spike significantly in the coming hours. The global community is bracing for the potential fallout as Washington now finds itself fully engaged in a volatile conflict with far-reaching implications.\n\nPresident Trump has not indicated whether further military action is imminent, but in his latest Truth Social update, he warned:\n\nIran has been warned. The U.S. will do what it must. Peace through strength!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a dramatic escalation of Middle East tensions, President Donald Trump confirmed that the United States has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/america-unleashes-airstrikes-on-iranian-nuclear-facilities/\">Continue reading<span class=\"screen-reader-text\"> \"America Unleashes Airstrikes On Iranian Nuclear Facilities\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "Mnangagwa Minister Threatens Schools Refusing to Accept ZiG as Fees Payment",
            "url": "https://www.zimeye.net/2025/06/22/mnangagwa-minister-threatens-schools-refusing-to-accept-zig-as-fees-payment/",
            "content": "By A Correspondent\n\nPrimary and Secondary Education Minister Torerai Moyo has issued a stern warning to schools that are refusing to accept the Zimbabwe Gold (ZiG) as a form of payment for school fees, declaring that such defiance will not be tolerated under the countrys official multi-currency system.\n\nSpeaking in Harare last week while addressing Junior Parliamentarians, Moyo urged the young leaders to expose schools engaging in this practice, promising immediate action.\n\nWhy are schools out there rejecting the ZiG currency as payment for fees? Moyo asked. Give us the names of such schools. We want to deal with them. We are in a multi-currency system, and ZiG is legal tender in this country.\n\nMoyo emphasised that no school has the authority to reject the local currency, adding that the government has made it clear that both ZiG and other approved currencies are to be accepted in all transactions.\n\nAny school refusing to accept ZiG is operating outside the law, he said. It is the responsibility of every institution, especially those in education, to uphold national policy.\n\nThe ZiG, introduced by the Reserve Bank of Zimbabwe in April 2024 to replace the Zimbabwean dollar (ZWL), is backed by the countrys gold and foreign currency reserves. Despite this, some schools and service providers have continued to demand payment exclusively in U.S. dollars, frustrating parents and guardians who receive income in local currency.\n\nMinister Moyo reaffirmed that the Ministry of Primary and Secondary Education will not hesitate to take disciplinary measures against any non-compliant school.\n\nWe will take action, he said. No one is above the law.\n\nHis remarks come amid growing public concern over the inconsistency in how currencies are being accepted across the education sector, with some parents accusing schools of discriminating against low-income families who cannot access U.S. dollars.\n\nMoyo concluded by urging the Junior Parliamentarians to play their part in holding institutions accountable:You are the voice of the studentshelp us make sure no learner is turned away simply because their parents paid in ZiG.\n\nWatch.\n\nHon. Torerai Moyo  calls on Junior Parliamentarians to report schools refusing to accept local currency#ZiGfee payments, assuring that such institutions would face consequences for their actions.#DayoftheAfricanChildpic.twitter.com/4ZrFFYTeT1\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Primary and Secondary Education Minister Torerai Moyo has issued a stern warning to schools that are refusing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/mnangagwa-minister-threatens-schools-refusing-to-accept-zig-as-fees-payment/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister Threatens Schools Refusing to Accept ZiG as Fees Payment\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "Minister Garwe Turns Up the Heat on Mayor Coltart “Amid Corruption Storm”",
            "url": "https://www.zimeye.net/2025/06/22/minister-garwe-turns-up-the-heat-on-mayor-coltart-amid-corruption-storm/",
            "content": "By A Correspondent\n\nMinister of Local Government and Public Works Daniel Garwe has intensified his spotlight on Bulawayo City Council, fuelling speculation that the real target of his latest moves is none other than the citys Mayor, David Coltart.\n\nThe Ministers recent remarks and actions appear less about governance reform and more about political posturing ahead of the next electoral cycle, observers say.\n\nSpeaking in reference to a looming Commission of Inquiry into Bulawayos local authority, Garwe declared: We have made the recommendation that we need to have a thorough investigation of all our urban local authorities because there is a lot of decay. While he did not mention Mayor Coltart by name, the repeated focus on Bulawayodespite broader national governance issueshas drawn attention.\n\nThe Ministrys spokesperson, Gabriel Masvora, confirmed that recommendations have already been made for the establishment of inquiries across all urban councils. However, the spotlight remains fixed on Bulawayo. The ministry simply recommends to the President and as stated by Hon. Garwe, recommendations have been made aimed at having thorough investigations targeting all urban local authorities, said Masvora.\n\nAccording to Masvora, Section 2(1) of the Commission of Inquiry Act (Chapter 10:07) gives the President the prerogative to appoint a Commission of Inquiry into the conduct of any officer in the Public Service.\n\nCritics, however, see the developments as a thinly veiled political offensive. Mayor Coltart, who has been vocal about national and local governance reforms, now finds himself at the centre of what some believe is an orchestrated effort to undermine his leadership.\n\nWhats happening here has all the signs of a politically motivated move. Corruption is not unique to Bulawayo, but Minister Garwe keeps circling the city like a hawk. Its hard not to see this as targeting Coltart, said a political analyst.\n\nThis narrative is further supported by subtle efforts to rally residents against the mayor. Residents associations have begun echoing government sentiments, and some believe this is part of a broader strategy to isolate and discredit the mayor.\n\nBulawayo United Residents Association (BURA) chairperson, Mr. Winos Dube, expressed dismay at past corruption cases within the council: As residents, we were disappointed and disheartened that the very people we had entrusted with the running of the citys affairs were the very people who were pulling it back.\n\nThe comment, though in response to earlier scandals involving Deputy Mayor Edwin Ndlovu and Finance Chairperson Mpumelelo Moyoboth implicated in a US$20,000 facilitation fee scandalis now being leveraged to build a case for deeper intervention in City Hall.\n\nMeanwhile, Mayor Coltart has remained largely silent in the face of the mounting scrutiny, though sources close to him suggest he sees the move as an attempt to distract from national governance failures.\n\nWith the President yet to announce whether a Commission of Inquiry will officially be set up for Bulawayo, all eyes remain on Garwes next stepsand the political implications they carry.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Minister of Local Government and Public Works Daniel Garwe has intensified his spotlight on Bulawayo City Council, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/minister-garwe-turns-up-the-heat-on-mayor-coltart-amid-corruption-storm/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Garwe Turns Up the Heat on Mayor Coltart “Amid Corruption Storm”\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "Hilarious ZimDaily Cartoon Of ZANU Youth League Flying To Iran To Fight In War",
            "url": "https://www.zimeye.net/2025/06/22/hilarious-zimdaily-cartoon-of-zanu-youth-league-flying-to-iran-to-fight-in-war/",
            "content": "By Trackman Ncube | In the chaotic aftermath of President Trumps shock-and-awe strike on Iran, an unlikely group of heroes emerged from the tarmac of Harare International Airport. Mai Welly, bulging her strong backside, DJ Fanta wielding his trusty club, led the charge as he rallied DJ Towers, the flamboyant machete-wielding DJ, and the spirited ZANU PF Youth League. The trio, depicted in a wild cartoon by Zimbabwe Daily, had hatched a hilarious plan to board an IranAir flight to Tehran and fight for Iran in this sudden global upheaval.\n\nAs the sun rose over Zimbabwe on June 22, 2025, the group gathered at the gate, their mismatched outfitsMai Welly in her tattered blanket, DJ Towers in his colorful scarf, and the Youth League in green uniformsdrawing laughs from onlookers. WW3 here we come! they shouted, mimicking the cartoons bold caption, as they stormed the plane with bags of snacks and makeshift weapons.\n\nInside, the IranAir crew blinked in confusion as Mai Welly declared, Were here to save Iran! DJ Towers spun records to boost morale, while the Youth League practiced their battle chants. Unaware of the strikes scale, they imagined themselves as Irans last line of defense, fueled by Trumps fiery tweets echoing through their phones.\n\nMid-flight, news of the bombing hit, and the cabin erupted in a mix of panic and pride. Mai Welly, undeterred, proposed a mid-air strategy session, sketching battle plans on a napkin. DJ Towers suggested a boom-boom beat drop to intimidate enemies, while the Youth League vowed to outshout any retaliation. Their absurdity peaked when they tried to parachute into Tehran with a tangled mess of scarves, only to land in a field, laughing hysterically.\n\nBack in Washington, Trumps address loomed, but for this ragtag crew, their historic moment was a comedic misadventureproving that even in war, a little Zimbabwean humor could lighten the load.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Trackman Ncube | In the chaotic aftermath of President Trump’s shock-and-awe strike on Iran, an unlikely group of heroes … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/hilarious-zimdaily-cartoon-of-zanu-youth-league-flying-to-iran-to-fight-in-war/\">Continue reading<span class=\"screen-reader-text\"> \"Hilarious ZimDaily Cartoon Of ZANU Youth League Flying To Iran To Fight In War\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        },
        {
            "title": "Mnangagwa Administration’s Incompetence Exposed As 70 Succumb To Diarrhoea",
            "url": "https://www.zimeye.net/2025/06/22/mnangagwa-administrations-incompetence-exposed-as-70-succumb-to-diarrhoea/",
            "content": "By A Correspondent\n\nA document obtained by ZimEye.com from the Ministry of Health and Child Care has confirmed that at least 70 people have died from diarrhoea-related illnesses across Zimbabwe since the beginning of 2025laying bare the deteriorating state of the countrys public health system under President Emmerson Mnangagwas administration.\n\nThe internal disease surveillance report, dated June 2025, paints a grim picture of widespread infections and preventable deaths, exposing systemic failures in sanitation, access to clean water, and critical drug availability.\n\nThe cumulative number of deaths due to common diarrhoea stands at 70, the report reads. The cases are widespread and have been reported across all provinces, with high incidence in communities lacking access to safe drinking water and adequate sanitation.\n\nThe report reveals that between January and early June, thousands of diarrhoeal cases were recorded, with the Ministry attributing the spike to poor water quality, unhygienic conditions, and a crumbling healthcare infrastructure.\n\nMajor contributing factors include consumption of contaminated water, poor hygiene practices, and limited access to health care services due to ongoing stockouts of essential medicines, the document states.\n\nThe report highlights that in several districts, clinics are unable to provide even basic medical responses. Some health centres are operating without oral rehydration salts, antibiotics, or intravenous fluidsleaving both children and elderly patients vulnerable to severe dehydration and death, the ministry warns.\n\nThe Ministry of Health and Child Care has recommended urgent nationwide interventions. These include the immediate restoration of water and sanitation infrastructure, reinforcement of hygiene promotion activities, and emergency medical supply distribution to affected areas, according to the report.\n\nDespite these recommendations, critics argue that the report serves as further proof of chronic government neglect and mismanagement. While the Ministry admits to the crisis, the report does not outline any decisive action already takenonly what should be done.\n\nAs the death toll continues to rise, the Ministrys own data now stands as a damning indictment of the Mnangagwa administrations inability to protect its citizens from one of the most basic and preventable public health threats in the 21st century.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A document obtained by ZimEye.com from the Ministry of Health and Child Care has confirmed that at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/22/mnangagwa-administrations-incompetence-exposed-as-70-succumb-to-diarrhoea/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Administration’s Incompetence Exposed As 70 Succumb To Diarrhoea\"</span></a></p>",
            "time": "18:47",
            "date": "23 Jun 2025"
        }
    ]
}