{
    "news": [
        {
            "title": "National Handling Services (NHS) Employees Among Eight Charged in Zimbabwe Airport Smuggling Scandal",
            "url": "https://www.zimeye.net/2025/04/03/national-handling-services-nhs-employees-among-eight-charged-in-zimbabwe-airport-smuggling-scandal/",
            "content": "By A Correspondent| Eight employees linked to Robert Mugabe International Airport, including two staff members from Zimbabwes National Handling Services (NHS), appeared in court this week over allegations of orchestrating the illegal transit of 23 Ethiopian nationals through Harare to Eswatini.\n\nThe accusedGloria Chikukwa (27) and Ashley Zhaimu (27) of NHS, alongside immigration officers Vincent Shoshore (45)Gondoza Sunday (39), Terrence Mangwende (43),Innocent Tawanda Hamandishe (54), and security officials *Elliot Nhapi and Moses Tawanda Mutambai (29)were remanded in custody by Harare magistrate Marewanazvo Gofa pending a bail hearing Thursday.\n\nThe National Handling Services (NHS), a key ground operations company at Zimbabwes major airports, faced scrutiny after its employees allegedly abused their positions to facilitate the smuggling scheme.\n\nAccording to prosecutors, Chikukwa and Zhaimuboth NHS workersreportedly escorted the Ethiopians through the airports restricted VIP route and concealed them overnight in the Vakacha Lounge, a premium facility reserved for dignitaries.\n\nThe Department of Immigration Control, led by Regional Immigration Officer Chakawuya Leslie, detailed how the group manipulated airport protocols.\n\nThe accused wedged doors open with paper to bypass security checks, enabling unauthorised movement, the court heard.\n\nThe operation unfolded over two days in March 2025. On March 15, five Ethiopians arrived on Ethiopian Airlines Flight ET 873 and were hidden by the accused. The following day, 19 more Ethiopians arrived on two additional flights (ET 873 and ET 34). Prosecutors allege NHS staff and immigration officials collaborated to falsify manifests, listing the Ethiopians as Russians, Turks, Indians, and Malawiansto evade detection.\n\nBy evening, all 23 individuals boarded Eswatini Airlines Flight RN401 to Manzini. The scheme unraveled when Eswatini authorities discovered the passengers lacked valid transit visas. Subsequent investigations exposed the falsified documents and implicated the Zimbabwean officials.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Eight employees linked to Robert Mugabe International Airport, including two staff members from Zimbabwe’s National Handling Services … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/national-handling-services-nhs-employees-among-eight-charged-in-zimbabwe-airport-smuggling-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"National Handling Services (NHS) Employees Among Eight Charged in Zimbabwe Airport Smuggling Scandal\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "ZIFA Launches ‘Warrior Pride’ Design Competition for National Team Kits",
            "url": "https://www.zimeye.net/2025/04/03/zifa-launches-warrior-pride-design-competition-for-national-team-kits/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has announced the launch of an exciting design competition called Warrior Pride, inviting designers to submit their creative concepts for the national football teams jerseys and related kit merchandise.\n\nZIFA revealed that the winning designer will be awarded a cash prize of $3,000, along with a fully sponsored trip to Morocco to attend the Africa Cup of Nations (AFCON) 2025 tournament. The competition aims to engage local talent in creating a fresh and inspiring look for the national team, showcasing the spirit of Zimbabwean football on the continental stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has announced the launch of an exciting design competition called ‘Warrior Pride’, inviting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/zifa-launches-warrior-pride-design-competition-for-national-team-kits/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Launches ‘Warrior Pride’ Design Competition for National Team Kits\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Emma Walker In UK COS Employment Sponsorship Scam",
            "url": "https://www.zimeye.net/2025/04/03/emma-walker-in-uk-sponsorship-scam/",
            "content": "UK Sponsorship Scheme Exposed as Candidates Left Waiting in Multi-Thousand Pound Scam\n\nBy A Correspondent  |  ZimEye | London, March 21, 2025  A damning expos has revealed shocking mismanagement and scam in a UK-based sponsorship scheme, leaving dozens of international job seekers stranded after paying thousands of pounds for Certificates of Sponsorship (COS) that were never delivered.\n\nAt the center of the controversy is Emma Walker, a registered NHS nurse and recruiter who has been implicated in a chaotic web of fake papers, contradictions, failed verifications, and financial irregularities. Meeting minutes from a critical discussion on February 25th reveal an alarming picture of negligence and disarray affecting over 50 candidates, many of whom have been waiting since mid-2024 for services that were promised within six months.\n\nA Program Mired in Contradictions\n\nWalker admitted during the meeting that two COS documents lacked certificate numbers and were provided via videos supposedly showing their issuance on a portal. However, under sustained questioning, she conceded that no checks were made with the Home Office to verify the authenticity of these documents.\n\nDespite claiming to have performed thorough checks, Walker repeatedly asked for basic verification information, including the Home Office contact details  exposing an absence of due diligence in a system where candidates pay thousands for UK work opportunities.\n\nMounting Red Flags\n\nThe program, originally marketed as a streamlined six-month pathway to employment, has now extended to nearly 10 months for many. More troubling, the justification for delays  such as a mandatory training requirement before COS issuance  was debunked by industry experts as not being a legal prerequisite for certificate allocation.\n\nIn another alarming contradiction, Walker offered refunds to affected agents while still insisting during the meeting that she was unaware of the documents being counterfeit  raising serious questions about prior knowledge and transparency.\n\nFinancial Exploitation\n\nEvidence reveals that candidates were charged up to 4,000 each, with Walkers organization allegedly pocketing 1,000 per individual while agents retained the remainder. However, no clear communication was made to the candidates about this split, contributing to widespread confusion and dissatisfaction.\n\nInternational candidates, including many from Africa and Asia, were promised one-month turnaround times for COS issuance. Yet some have now been waiting up to five months, with no concrete progress  fueling suspicions of systemic failure or worse, deliberate deception.\n\nIndustry Reaction\n\nThis is textbook negligence, said a veteran investigative journalist specializing in immigration scams. Basic verification steps were ignored. Instead, candidates were given excuses and left hanging for months, despite having paid large sums.\n\nZimEye also noted that Walkers reliance on unverifiable videos instead of using standard Home Office verification procedures shows a reckless disregard for best practices.\n\nRefund Promises Amid Fallout\n\nWalker has now promised refunds within seven days after intense pressure from ZimEye and affected parties. However, there is growing skepticism in the community. Many candidates fear that their hard-earned money will not be fully recovered, given the multiple intermediaries involved and Walkers shifting explanations.\n\nCommunity advocates have called on authorities to investigate the scheme, citing concerns that this could be part of a larger pattern of exploitation targeting vulnerable job seekers abroad.\n\nWhats Next?\n\nWhile Walker has agreed to return funds to her clients, there is still uncertainty surrounding the total number of candidates affected and whether full accountability will be enforced.\n\nAs this story develops, the spotlight now shifts to both UK regulators and the Home Office to address mounting calls for tighter oversight of sponsorship schemes and recruitment practices that prey on foreign workers desperate for employment.\n\nIf you or someone you know has been affected by this scheme or others like it, contact [news outlet contact] for confidential assistance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "UK Sponsorship Scheme Exposed as Candidates Left Waiting in Multi-Thousand Pound Scam By A Correspondent ● | ZimEye | London, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/emma-walker-in-uk-sponsorship-scam/\">Continue reading<span class=\"screen-reader-text\"> \"Emma Walker In UK COS Employment Sponsorship Scam\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Chipezeze Shines with Impressive Form in March",
            "url": "https://www.zimeye.net/2025/04/03/chipezeze-shines-with-impressive-form-in-march/",
            "content": "Sports Correspondent\n\nIn-form Magesi goalkeeper Elvis Chipezeze has been named the Betway Premiership Player of the Month for March, after a series of remarkable performances that helped solidify his place as one of the leagues top shot-stoppers.\n\nChipezezes incredible run of form saw him keep an impressive four clean sheets in five matches during the month.\n\nHis ability to deny opposing teams goals was instrumental in his sides success, with many observers praising his sharp reflexes, commanding presence in the box, and leadership at the back.\n\nThe goalkeepers consistency has not only boosted Magesis defensive record but has also been a key factor in their strong position in the league standings.\n\nChipezezes performances throughout March have certainly made a mark, earning him widespread recognition among fans and analysts alike.\n\nIm grateful for the recognition, but this is a team effort, said Chipezeze upon receiving the award. The defense has been solid, and the collective work from the entire squad makes it easier for me to perform. Ill continue to work hard and hope to keep contributing to the teams success.\n\nChipezezes clean sheet streak during March included several crucial saves in tight matches, where his ability to stay calm under pressure was pivotal. His performances reflect not only his individual skill but also his strong understanding of the game, positioning himself effectively and anticipating shots.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In-form Magesi goalkeeper Elvis Chipezeze has been named the Betway Premiership Player of the Month for March, after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/chipezeze-shines-with-impressive-form-in-march/\">Continue reading<span class=\"screen-reader-text\"> \"Chipezeze Shines with Impressive Form in March\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Taking Extra Caution Behind The Wheel …",
            "url": "https://www.zimeye.net/2025/04/03/taking-extra-caution-behind-the-wheel/",
            "content": "Distracted driving has become one of the most significant threats to road safety in recent years. It only takes a mere five seconds to look away from the road  whether its to read a text, search for a phone number, adjust your cars music or GPS, or pick up something thats fallen  but those five seconds can be deadly. In fact, that short moment of distraction can make the difference between a safe journey and a devastating crash.\n\nWhile it might seem harmless to glance at your phone or fiddle with the radio for a moment, the consequences can be catastrophic. A vehicle moving at just 55 miles per hour travels the length of a football field in five seconds  a dangerous amount of time when youre not focused on the road. Those precious seconds can lead to fatal accidents, leaving you, your passengers, and others on the road in harms way.\n\nEvery moment you spend driving is critical to the safety of everyone around you. It may feel like a small, insignificant distraction, but it can easily result in tragic outcomes. Consider the devastating impact an accident can have on your life and the lives of your loved ones. A crash could leave you struggling in a hospital bed, confined to a wheelchair, or worse, it could end your life. More importantly, it could leave your family in grief and financial turmoil, forever haunted by the absence of your presence.\n\nThink about the effort you put into providing for your family. Imagine how your loved ones would cope without you. Your children may have to drop out of school, and your spouse may struggle to make ends meet. These are the harsh realities of distracted driving that we often fail to acknowledge. A momentary lapse in concentration could change everything for your family, and the consequences are often far-reaching.\n\nThe message is clear: every second behind the wheel is crucial. Never let a moment of distraction cost you everything. Stay focused, drive safely, and keep the ones you love safe. Your family needs you  dont let a few seconds of distraction jeopardize their future.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Distracted driving has become one of the most significant threats to road safety in recent years. It only takes a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/taking-extra-caution-behind-the-wheel/\">Continue reading<span class=\"screen-reader-text\"> \"Taking Extra Caution Behind The Wheel …\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Geza Points Out Reasons For Mnangagwa Impeachment",
            "url": "https://www.zimeye.net/2025/04/03/geza-points-out-reasons-for-mnangagwa-impeachment/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza says there is no going back on the removal of Mr Emmerson Mnangagwa.\n\nIn a statement on Wednesday night, Geza spoke of Mnangagwas impeachment.\n\n We have to stand united. Mnangagwa is now incapacitated and therefore there are several reasons for impeaching him.\n\nVultures around him are now running the country, said Geza.\n\nFellow Zimbabweans, I amhere today.https://t.co/mX7qwRqUbz\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza says there is no going back on the removal of Mr Emmerson Mnangagwa. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/geza-points-out-reasons-for-mnangagwa-impeachment/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Points Out Reasons For Mnangagwa Impeachment\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Mnangagwa’s Blue-eyed Boy Threatens To “Expose Geza Handlers”",
            "url": "https://www.zimeye.net/2025/04/03/mnangagwas-blue-eyed-boy-threatens-to-expose-geza-handlers/",
            "content": "By A Correspondent\n\nAt a Zanu PF event in Glen View South on Wednesday, Daniel Garwe, a close ally of President Emmerson Mnangagwa, issued a strong warning to war veteran Blessed Geza, labeling him a bogus war veteran and a puppet.\n\nGarwe expressed his frustration, stating, Why are you hiding in South Africa? We will expose Gezas handlers very soon.\n\nWe know there are people who are sending him. Geza, Kasukuwere, and Nyokayemabhunu, we know what you are up to, but you will not succeed.\n\nHe further emphasized Zanu PFs resolve, adding, We are ready to defend Mnangagwa and that I can assure you. Garwes comments are part of a broader political tension as the party prepares for the upcoming by-election and ongoing internal power struggles.\n\nGeza has boldly challenged Mr. Emmerson Mnangagwas third-term agenda. He is spearheading calls for Mnangagwas resignation, citing concerns over corruption, the gross mismanagement of the economy, and rampant looting. His criticisms have made him a prominent figure in opposition circles, and his actions are seen as a direct challenge to Mnangagwas leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent At a Zanu PF event in Glen View South on Wednesday, Daniel Garwe, a close ally of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/mnangagwas-blue-eyed-boy-threatens-to-expose-geza-handlers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Blue-eyed Boy Threatens To “Expose Geza Handlers”\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Mnangagwa Party Bribes Glen View South Voters With Cash",
            "url": "https://www.zimeye.net/2025/04/03/mnangagwa-party-bribes-glen-view-south-voters-with-cash/",
            "content": "By A Correspondent\n\nMr. Emmerson Mnangagwas Zanu PF party is targeting victory in the upcoming April 12 by-election in Glen View South, employing what many view as a clear vote-buying strategy.\n\nOn Wednesday, Mr. Mnangagwas special advisor, Paul Tungwarara, announced a substantial cash offer of USD 200,000 to the constituency.\n\nZanu PF stated in a press release, Today ZANU PF National Political Commissar Munyaradzi Machacha is in Glen View South to drum up support for the Partys candidate Tsitsi Tawomhera. Machacha handed over a borehole at Glen View 3 shops that was drilled under the Presidential Borehole Drilling Scheme initiated by President Emmerson Dambudzo Mnangagwa.\n\nAccompanying Machacha during the visit were Harare Provincial Minister Tavengwa, Presidential Advisor Dr. Tungwarara, and several senior party officials from the Harare province. The statement continued, President Emmerson Dambudzo Mnangagwa, through his Special Advisor Paul Tungwarara, announced a USD 200,000 Presidential revolving fund earmarked for Glen View South Constituency.\n\nThis move is seen by critics as an attempt to sway voters with financial incentives and public infrastructure projects in the lead-up to the election.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mr. Emmerson Mnangagwa’s Zanu PF party is targeting victory in the upcoming April 12 by-election in Glen … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/mnangagwa-party-bribes-glen-view-south-voters-with-cash/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Party Bribes Glen View South Voters With Cash\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Geza : No Going Back On Mnangagwa Removal",
            "url": "https://www.zimeye.net/2025/04/03/geza-no-going-back-on-mnangagwa-removal/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza says there is no going back on the removal of Mr Emmerson Mnangagwa.\n\nIn a statement on Wednesday night, Geza spoke of Mnangagwas impeachment.\n\n We have to stand united. Mnangagwa is now incapacitated and therefore there are several reasons for impeaching him.\n\nVultures around him are now running the country, said Geza.\n\nFellow Zimbabweans, I amhere today.https://t.co/mX7qwRqUbz\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza says there is no going back on the removal of Mr Emmerson Mnangagwa. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/03/geza-no-going-back-on-mnangagwa-removal/\">Continue reading<span class=\"screen-reader-text\"> \"Geza : No Going Back On Mnangagwa Removal\"</span></a></p>",
            "time": "08:42",
            "date": "04 Apr 2025"
        },
        {
            "title": "Julie Makes Clear: DaddyHope Remains A Daddy’st, A Chigananda Not Journalist, Bullying People",
            "url": "https://www.zimeye.net/2025/04/03/julie-makes-clear-daddyhope-remains-a-daddyst-a-chigananda-not-journalist-bullying-people/",
            "content": "Julie tells Hopewell Chin'ono, Daddyism is not journalismpic.twitter.com/p9gYAYUOfK\n\nThis is Hopewell Chinono He has been fighting a hard battle to discredit Nelson Chamisa, and every other senior person with power he has allegedly scammed, since his teenage years, who include his former employer.Since his 1989 days, when he harassed his own headmaster,pic.twitter.com/bmvmVriYyv\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:42",
            "date": "04 Apr 2025"
        }
    ]
}