{
    "news": [
        {
            "title": "Mnangagwa Has Escaped State House Spotlight Using Tagwirei",
            "url": "https://www.zimeye.net/2025/06/26/mnangagwa-has-escaped-state-house-spotlight-using-tagwirei/",
            "content": "By Baba Jukwa | Through the green mashed up nation addresses of today, Emmerson Mnangagwa has successfully shifted all negative focus from himself to Kuda Tagwirei, a mere runner. This is what he (the Grace Mugabe accused liquidator) has been doing since the 1970s. He never does the dirty work, all that is done by small boys and runners beginning with the lads accused of finishing the liberation fighters in Mozambique (Dec 1979).\n\nZANU PF structures are now shaking in anger against one person, they believe wants to take over power, turning off their eyes from the person whos already taken the nation by the neck since 1977, and is only getting stronger.\n\n16 million people are caught up agitated by a boasting tenderpreneur, while Mnangagwa escapes untouched. Will Mnangagwa make it, and what will it take to catch him?\n\nThrough the green mashed up nation addresses of today, Emmerson Mnangagwa has successfully shifted all negative focus from himself to Kuda Tagwirei, a mere runner. This is what he (the Grace Mugabe accused liquidator) has been doing since the 1970s. He never does the dirty work,\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Baba Jukwa | Through the green mashed up nation addresses of today, Emmerson Mnangagwa has successfully shifted all negative … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/mnangagwa-has-escaped-state-house-spotlight-using-tagwirei/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Has Escaped State House Spotlight Using Tagwirei\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Proudly Zimbabwean: Gorimbo and Lunga Reunite in the U.S. to Support One Another",
            "url": "https://www.zimeye.net/2025/06/26/proudly-zimbabwean-gorimbo-and-lunga-reunite-in-the-u-s-to-support-one-another/",
            "content": "Sports Correspondent\n\nIn a powerful moment of Zimbabwean pride and solidarity, United States-based Mixed Martial Arts (MMA) fighter Themba Gorimbo met up with Warriors and Mamelodi Sundowns defender Divine Lunga in the U.S., where Lunga was representing his club at the FIFA Club World Cup.\n\nAlthough Mamelodi Sundowns have since been knocked out of the tournament, the spirit of camaraderie and national pride remained unshaken as the two athletes took time to reconnect and support each other. Gorimbo, who has become a household name for his inspiring journey from hardship to the UFC, made time to visit Lunga  a gesture that symbolized the unity and resilience of Zimbabwean talent on the global stage.\n\nThe two posed for a photo together, capturing a moment of mutual respect between two of Zimbabwes top sportsmen  one dominating in the octagon, the other on the pitch.\n\nGorimbo, known for his humility and deep patriotism, shared how meaningful it was to show up for a fellow Zimbabwean abroad. Supporting a fellow Zimbabwean always feels right, he reportedly said. Its bigger than sport  its about showing the world that Zimbabweans can rise in any arena.\n\nLunga, though disappointed by his clubs early exit from the tournament, expressed gratitude for Gorimbos encouragement. It means a lot to be supported by someone like Themba, Lunga said. Hes a true warrior, and to know hes following my journey motivates me even more.\n\nThe meetup has been celebrated by fans back home as a symbol of unity and shared ambition among Zimbabwean athletes. One user on social media summed it up best: This is the Zimbabwe we love to see  unity, success, and support.\n\nAs Gorimbo continues his ascent in the UFC and Lunga regroups with Mamelodi Sundowns, their brief but meaningful encounter serves as a reminder that even in moments of setback, the spirit of Zimbabwean excellence and brotherhood remains strong  crossing disciplines, borders, and challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a powerful moment of Zimbabwean pride and solidarity, United States-based Mixed Martial Arts (MMA) fighter Themba Gorimbo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/proudly-zimbabwean-gorimbo-and-lunga-reunite-in-the-u-s-to-support-one-another/\">Continue reading<span class=\"screen-reader-text\"> \"Proudly Zimbabwean: Gorimbo and Lunga Reunite in the U.S. to Support One Another\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Brendan Galloway Returns from Injury, Eyes Comeback Season with Plymouth Argyle",
            "url": "https://www.zimeye.net/2025/06/26/brendan-galloway-returns-from-injury-eyes-comeback-season-with-plymouth-argyle/",
            "content": "Sports Correspondent\n\nZimbabwe international defender Brendan Galloway has successfully returned to full fitness after a lengthy spell on the sidelines due to injury.\n\nGalloway suffered a leg injury in January 2025 during the closing stages of Plymouth Argyles 1-1 draw against Oxford United at Home Park. The setback required surgery and kept him out for the remainder of the season, dealing a major blow to both his club and international prospects.\n\nAs a result, the 28-year-old was also unavailable for Zimbabwes international friendlies against Burkina Faso and Niger in June, missing out on valuable national team action.\n\nHowever, in a welcome development for both club and country, Galloway was spotted participating in Plymouth Argyles first day of pre-season training on Friday. His presence on the pitch marks a significant milestone in his recovery and sets the stage for a potential return to competitive action ahead of the new season.\n\nDespite Argyles relegation from the English Championship to League One, Galloway is set to remain with the club as he enters the final year of his contract, which runs until June 2026.\n\nThe defenders return brings a boost to Argyles defensive options as they aim to bounce back to the Championship, while Zimbabwe fans will be hopeful that he reclaims his spot in the Warriors squad ahead of upcoming international fixtures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe international defender Brendan Galloway has successfully returned to full fitness after a lengthy spell on the sidelines … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/brendan-galloway-returns-from-injury-eyes-comeback-season-with-plymouth-argyle/\">Continue reading<span class=\"screen-reader-text\"> \"Brendan Galloway Returns from Injury, Eyes Comeback Season with Plymouth Argyle\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Grace Mugabe Turns 60",
            "url": "https://www.zimeye.net/2025/06/26/grace-mugabe-turns-60/",
            "content": "By A Correspondent\n\nFormer First Lady Grace Mugabe, once one of Zimbabwes most powerful and controversial figures, will turn 60 on July 23, marking a milestone in a life that has been anything but ordinary.\n\nPopularly known as Dr Amai or Dr Stop It during her political peak, Grace Mugabe played a central role in Zimbabwes turbulent political landscapeparticularly in the dramatic fall of her husband, the late former President Robert Mugabe, in 2017.\n\nA senior ZANU-PF source commented on the upcoming birthday, saying: The former First Lady, who used to be known as Gucci Graceduring her hey daysbecause of her high fashion sense, will soon be 60 on 23 July. Dr Amai Grace Mugabe, 59, is truly getting better with age.\n\nGrace Mugabes political rise was rapid and divisive. She was thrust into the heart of factional battles within ZANU-PF, first as an ally of Team Lacostethen led by Emmerson Mnangagwain a campaign to dislodge then-Vice President Joice Mujuru. Ironically, she later found herself at odds with the same group, culminating in the 2017 military intervention that ended her husbands decades-long rule.\n\nDespite retreating from the public eye following Mugabes ouster and death, Grace Mugabe remains a figure of interest in Zimbabwean politics and society. Her 60th birthday is expected to be marked quietly at the familys rural retreat in Zvimba.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former First Lady Grace Mugabe, once one of Zimbabwe’s most powerful and controversial figures, will turn 60 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/grace-mugabe-turns-60/\">Continue reading<span class=\"screen-reader-text\"> \"Grace Mugabe Turns 60\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Advocate Thabani Mpofu, Tagwirei Clash Over Sanyatwe’s Zanu PF Will Rule Forever “Sermon” On SDA Pulpit",
            "url": "https://www.zimeye.net/2025/06/26/advocate-thabani-mpofu-tagwirei-clash-over-sanyatwes-zanu-pf-will-rule-forever-sermon-on-sda-pulpit/",
            "content": "Tinashe Sambiri\n\nProminent constitutional lawyer Advocate Thabani Mpofu, who is closely associated with opposition leader Nelson Chamisa, has taken legal action against the Seventh-day Adventist (SDA) Church, accusing it of desecrating its pulpit by allowing senior ZANU PF figures to promote partisan political views during a church service.\n\nIn a strongly-worded letter addressed to the SDA leadership on Wednesday, Advocate Mpofuthrough Mtetwa and Nyambirai Legal Practitionersexpressed deep dismay at what he described as a perverse and degenerate act that has shaken his faith in the church.\n\nIt has become necessary for action to be taken against the SDA Church, said Mpofu. I thank the royal gladiator, Beatrice Mtetwa, for agreeing to go to war with me. It is necessary for us to say NO to degenerate madness and nonsense.\n\nThe letter outlines Advocate Mpofus outrage at events that took place on June 14, 2025, during an evangelical campaign dubbed Operation Macedonia in Nyanga. According to Mpofu, ZANU PF-linked businessman Kudakwashe Tagwirei invited Lieutenant General Anselem Sanyatwenow also a ZANU PF politicianto address congregants from the SDA pulpit without the prior consent of the churchs regional leaders.\n\nOnce on the pulpit, Sanyatwe is said to have made partisan political declarations, including the assertion that ZANU PF would govern Zimbabwe indefinitely, mockingly claiming its rule would only end when donkeys grow horns. He also dismissed previous objections to such statements as mere barking.\n\nOur client is a baptised member of the SDA Church and fellowships in an area under the East Zimbabwe Conference (EZC) and the Zimbabwe East Union Conference (ZEUC), the letter reads. It does not help matters that this unblushing blasphemy occurred during an evangelical campaign and would have served to reduce the SDA Church in the eyes of the converts to a fly-by-night outfit prepared to append itself to political fortune.\n\nAdvocate Mpofu further took aim at SDA leaders Pastor Musara (ZEUC President) and Pastor Timuri (EZC President), who were reportedly present during the incident but failed to intervene. The fact that Messrs Musara and Timuri did nothing to arrest the desecration, did not stand to correct it and have still not done anything to this very day can only mean that they make common cause with it, the letter stated.\n\nThe legal complaint references violations of several governing documents within the SDA Church, including the SID Working Policy, which strictly forbids using denominational platforms for personal or partisan gain. Specific reference was made to Section S 55 25, which prohibits associating the denomination with outside political or business interests.\n\nOur client contends that the misuse of the SDA pulpit on the holy Sabbath of the Lord is a violation and negation of the SID Working Policy, the ZEUC Constitution, the EZC Constitution, the SDA Church Manual, as well the Holy Scriptures to whose authority the church unerringly yields, the lawyers argued.\n\nQuoting from the SDA Church Manual, the letter emphasized that the pulpit must be reserved for the preaching of the truths of the Divine Word, not for the advancement of political views.\n\nIn closing, Mpofus lawyers warned that failure to address the issue not only undermines the spiritual integrity of the church but also risks reducing it to a political tool.\n\nThe only kingdom that has the durability suggested by Sanyatwe is that of Christ and, as it turns out, it is only for that kingdom that the SDA pulpit is consecrated, the letter concluded.\n\nAs of now, the SDA Church leadership has not issued a public response to the legal action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Prominent constitutional lawyer Advocate Thabani Mpofu, who is closely associated with opposition leader Nelson Chamisa, has taken legal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/advocate-thabani-mpofu-tagwirei-clash-over-sanyatwes-zanu-pf-will-rule-forever-sermon-on-sda-pulpit/\">Continue reading<span class=\"screen-reader-text\"> \"Advocate Thabani Mpofu, Tagwirei Clash Over Sanyatwe’s Zanu PF Will Rule Forever “Sermon” On SDA Pulpit\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "BREAKING: Lungu’s Party Clash On Camera After Trying To Bury Him Near Mandela’s Wife",
            "url": "https://www.zimeye.net/2025/06/26/breaking-lungus-party-clash-on-camera-after-trying-to-bury-him-near-mandelas-wife/",
            "content": "Given Lubinda assures public that opposition will be united upon returning to Zambia, following the embarrassing chaos witnessed today | Zambias main opposition party PF-Tonse leaders have clashed on camera in Johannesburg after trying to bury the late President Edgar Lungu near Nelson Mandelas wife, something the same leaders banned the countrys founding president Kenneth Kaunda from doing. Speaking is former Justice Minister Given Lubinda who stopped the Kaunda family from burying Kenneth next to his wife; ironically today hes trying to bury Lungu at the cemetery Winnie Mandela is resting. Sean Tembo was addressing the press when he was disrupted and the only camera man ordered to switch off the machine.Lubinda later came up and assured that all opposition will unite once back inZambia.WATCH THE VIDEO\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Given Lubinda assures public that opposition will be united upon returning to Zambia, following the embarrassing chaos witnessed today | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/breaking-lungus-party-clash-on-camera-after-trying-to-bury-him-near-mandelas-wife/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Lungu’s Party Clash On Camera After Trying To Bury Him Near Mandela’s Wife\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Tagwirei Dismisses Presidential Ambitions, Says Mnangagwa Will Rule Until 2030",
            "url": "https://www.zimeye.net/2025/06/26/tagwirei-dismisses-presidential-ambitions-says-mnangagwa-will-rule-until-2030/",
            "content": "By Tinashe Sambiri\n\nControversial businessman Kudakwashe Tagwirei has dismissed speculation that he harbours presidential ambitions, declaring that President Emmerson Mnangagwa will remain in power beyond 2028until at least 2030.\n\nSpeaking at a Land Tenure Programme hosted at the National University of Science and Technology (NUST) in Bulawayo on Wednesday, Tagwirei said there was no leadership vacuum in Zimbabwe that would warrant such speculation.\n\nThere is no vacancy for the presidency because President Emmerson Mnangagwa will rule until 2030, said Tagwirei. I am a businessmanwhy should I look for something that does not exist?\n\nTagwirei, who has often been linked to powerful political circles and accused of wielding outsized influence in government affairs, also made controversial remarks about economic participation.\n\nIf you are not a tenderpreneur, you are foolish, he said, using a term often associated with politically connected individuals who benefit from government contracts.\n\nHis comments come amid rising debate about succession within the ruling ZANU PF party and uncertainty over Zimbabwes post-2028 political landscape. President Mnangagwa, whose second term constitutionally ends in 2028, has yet to publicly state whether he will seek to extend his stay in office.\n\nAs of now, Tagwireis remarks have drawn sharp criticism from opposition figures and civil society groups, who view them as part of an emerging campaign to justify an unconstitutional extension of Mnangagwas rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Controversial businessman Kudakwashe Tagwirei has dismissed speculation that he harbours presidential ambitions, declaring that President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/tagwirei-dismisses-presidential-ambitions-says-mnangagwa-will-rule-until-2030/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Dismisses Presidential Ambitions, Says Mnangagwa Will Rule Until 2030\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Tagwirei Dismisses Presidential Ambitions, Says Mnangagwa Will Rule Until 2030",
            "url": "https://www.zimeye.net/2025/06/26/tagwirei-dismisses-presidential-ambitions-says-mnangagwa-will-rule-until-2030-2/",
            "content": "By Tinashe Sambiri\n\nControversial businessman Kudakwashe Tagwirei has dismissed speculation that he harbours presidential ambitions, declaring that President Emmerson Mnangagwa will remain in power beyond 2028until at least 2030.\n\nSpeaking at a Land Tenure Programme hosted at the National University of Science and Technology (NUST) in Bulawayo on Wednesday, Tagwirei said there was no leadership vacuum in Zimbabwe that would warrant such speculation.\n\nThere is no vacancy for the presidency because President Emmerson Mnangagwa will rule until 2030, said Tagwirei. I am a businessmanwhy should I look for something that does not exist?\n\nTagwirei, who has often been linked to powerful political circles and accused of wielding outsized influence in government affairs, also made controversial remarks about economic participation.\n\nIf you are not a tenderpreneur, you are foolish, he said, using a term often associated with politically connected individuals who benefit from government contracts.\n\nHis comments come amid rising debate about succession within the ruling ZANU PF party and uncertainty over Zimbabwes post-2028 political landscape. President Mnangagwa, whose second term constitutionally ends in 2028, has yet to publicly state whether he will seek to extend his stay in office.\n\nAs of now, Tagwireis remarks have drawn sharp criticism from opposition figures and civil society groups, who view them as part of an emerging campaign to justify an unconstitutional extension of Mnangagwas rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Controversial businessman Kudakwashe Tagwirei has dismissed speculation that he harbours presidential ambitions, declaring that President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/tagwirei-dismisses-presidential-ambitions-says-mnangagwa-will-rule-until-2030-2/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Dismisses Presidential Ambitions, Says Mnangagwa Will Rule Until 2030\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Jacob Zuma’s Daughter Runs Away from King Mswati: “It’s Been Months Without a Husband”",
            "url": "https://www.zimeye.net/2025/06/26/jacob-zumas-daughter-runs-away-from-king-mswati-its-been-months-without-a-husband/",
            "content": "By A Correspondent\n\nIn a shocking development that has captured regional attention, South African publication Limpopo Newspaper has reported that Nomcebo Zuma, daughter of former South African President Jacob Zuma, has left her royal husband, King Mswati III of Eswatini.\n\nNomcebo, just 22 years old, was one of the youngest wives of Africas last absolute monarch. Her abrupt departure from the royal palace has sent shockwaves through both the South African and Eswatini communities, with royal insiders reportedly scrambling to contain the fallout.\n\nAccording to Limpopo Newspaper, King Mswatis wife, Jacob Zumas daughter Nomcebo (22), leaves polygamous marriage saying its been months without a husband. The report suggests that Nomcebo felt neglected and disillusioned with the realities of royal life, which, despite its privileges, has been marked by long periods of emotional and physical isolation.\n\nShe told close friends that being married into royalty is not what she expected, a family source allegedly told the paper. She said its been months without a husband, and she felt more like a prisoner in a golden cage than a wife.\n\nKing Mswati, known for his extravagant lifestyle and controversial polygamous marriages, has faced criticism over the years for how he manages his royal household. With over a dozen wives, some former spouses have previously spoken out about the challenges of royal life, ranging from restrictive traditions to lack of personal freedom.\n\nWhat makes this incident particularly significant is the political and cultural weight it carries. The union between Nomcebo Zuma and King Mswati was seen by many as a symbol of alliance between two prominent southern African political legacies. Her departure, therefore, is not just a personal matterit reverberates through diplomatic and cultural channels as well.\n\nIn response to her sudden move, the Limpopo Newspaper reports that a royal delegation runs to NkandlaKwaZulu Natal to negotiate her return. Nkandla, Jacob Zumas controversial homestead, is now at the center of behind-the-scenes talks aimed at persuading Nomcebo to return to the palace.\n\nThus far, the Zuma family has not issued an official statement. However, sources close to the family suggest that Jacob Zuma has been deeply involved in the situation, reportedly expressing disappointment that his daughter was not given the care she deserves.\n\nWhile King Mswatis court has remained tight-lipped, speculation continues to mount about what this means for the stability of the royal household and future relations between the Zuma family and the Eswatini monarchy.\n\nWhether or not Nomcebo will return remains uncertain. But her brave decision to walk away from one of Africas most powerful thrones has reignited public debate about gender roles, freedom, and modernity within traditional royal structures.\n\nAs one South African social media user commented, She chose herself. And maybe, just maybe, thats more powerful than any crown.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent… In a shocking development that has captured regional attention, South African publication Limpopo Newspaper has reported that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/26/jacob-zumas-daughter-runs-away-from-king-mswati-its-been-months-without-a-husband/\">Continue reading<span class=\"screen-reader-text\"> \"Jacob Zuma’s Daughter Runs Away from King Mswati: “It’s Been Months Without a Husband”\"</span></a></p>",
            "time": "20:41",
            "date": "27 Jun 2025"
        },
        {
            "title": "Mass Protests In Kenya Against President Without Any Food, Nyokayemabhunu or Gambakwe Characters Collecting Money",
            "url": "https://www.zimeye.net/2025/06/26/mass-protests-in-kenya-against-president-without-any-food-nyokayemabhunu-or-gambakwe-characters-collecting-money/",
            "content": "Massive protests in Kenya against President William Ruto without any food, Nyokayemabhunu or Gambakwe characters collecting money from the poor\n\nMassive protests in Kenya against President William Ruto without any food, Nyokayemabhunu or Gambakwe characters collecting money from the poorpic.twitter.com/2kclinN0wU\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Massive protests in Kenya against President William Ruto without any food, Nyokayemabhunu or Gambakwe characters collecting money from the poor👇",
            "time": "20:41",
            "date": "27 Jun 2025"
        }
    ]
}