{
    "news": [
        {
            "title": "Missing Girl Alert, Man Arrested For Preying On Little Girls",
            "url": "https://www.zimeye.net/2024/12/12/missing-person-alert-man-arrested-for-preying-on-little-girls/",
            "content": "By Community News Reporter- Citizens have arrested a 45-year-old man for kidnapping and praying on underage girls.\n\nIn a post on social media by Hararians, one name is Solomon Tapera (45), has been arrested by locals and handed over to the police for kidnapping young girls.\n\nRead the post:\n\nWell done to ZRP & the private investigators who were hired to investigate this 13-year-old girl who disappeared for a week about a month ago. At one point, I thought I was all over and broke into tears. I felt so helpless that the baby girl wouldnt get justice. His name is Solomon Tapera, and he is aged 45. Lets follow the predator trend. There seems to be a gang in the Waterfalls area & possibly stretching wider into Harare, that is kidnapping young girls & abusing them by doing rituals. Just yesterday, another 14-year-old girl went missing. I am asking for assistance to help pay for a private investigator to locate the girl & have the perpetrators jailed. I cant keep hiring private investigators myself; we need to be a strong community & flush out these backward, evil, cruel men together.\n\nZimEye has yet to get an official comment from the police to confirm this incident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Community News Reporter- Citizens have arrested a 45-year-old man for kidnapping and praying on underage girls. In a post … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/missing-person-alert-man-arrested-for-preying-on-little-girls/\">Continue reading<span class=\"screen-reader-text\"> \"Missing Girl Alert, Man Arrested For Preying On Little Girls\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "30 Killed In Mozambique Post Elections Violence",
            "url": "https://www.zimeye.net/2024/12/12/30-killed-in-mozambique-post-elections-violence/",
            "content": "Maputo-The death toll from post-election violence in Mozambique has risen to at least 30, with 110 injured in the past week alone, as the nation grapples with one of its most volatile political crises in recent history.\n\nAmnesty Internationals Deputy Director for East and Southern Africa, Khanyo Farise, expressed deep concern over the escalating violence, calling for an immediate halt to what the organisation described as a bloody crackdown by the Frelimo-led government.\n\nEnough is enough. For more than 50 days, Mozambiques Frelimo-led government has refused to end its bloody crackdown on protesters, Farise said. Regardless of who won the election or their political views, everyone in Mozambique has the right to freedom of peaceful assembly. The authorities flagrant, continued, and escalating use of unnecessary and unlawful force against protesters must cease immediately.\n\nFarise further criticised the inaction of regional and international organisations, stating: The world must condemn this state violence and take action to end it. Amnesty International has repeatedly called on the international community, including the Southern African Development Community (SADC) and the African Union, to take action to end this nightmare. Yet both organisations remain all but silent on the government of Mozambiques ruthless assault on protesters. Instead of demanding an end to these growing human rights violations, SADC has only sent condolences to people who lost their lives and were injured while declaring the elections peaceful.\n\nThe rights group urged the African Commission on Human and Peoples Rights to launch a fact-finding mission to investigate ongoing human rights abuses.\n\nIt also called on the United Nations to address the crisis with the urgency it deserves and appealed to Mozambiques international donors and partners to take a firm stance against the governments actions.\n\nThe protests erupted following Mozambiques disputed general elections on October 9, which opposition parties alleged were marred by widespread irregularities and electoral fraud.\n\nThe ruling Frelimo party was declared victorious, extending its decades-long dominance, but opposition groups and civil society organisations have fiercely contested the results.\n\nIn the ensuing unrest, security forces have been accused of responding with excessive force.\n\nAccording to Amnesty International, at least 329 people have been shot by police, resulting in 110 fatalities, including children and bystanders.\n\nOver 3,500 individuals have reportedly been arbitrarily arrested, many of them opposition supporters or protesters exercising their right to peaceful assembly.\n\nThe violence has not been one-sided.\n\nIn retaliation to the governments actions, some protesters have resorted to attacking police officers, members of the ruling Frelimo party, and staff from electoral bodies.\n\nInstances of arson have also been reported, with protesters targeting police stations and Frelimo offices.\n\nThis recent wave of violence highlights deeper, long-standing issues in Mozambiques political landscape.\n\nFrelimos dominance since independence in 1975 has often been met with allegations of authoritarianism, electoral manipulation, and suppression of dissent.\n\nOpposition parties, particularly Renamo, have struggled to gain meaningful traction in a system they argue is heavily skewed in favour of the ruling party.\n\nThe October elections were expected to be a test of Mozambiques democratic progress.\n\nInstead, they have laid bare the fragility of its political system, with trust in the electoral process and state institutions eroding further.\n\nDespite the escalating violence, the international communitys response has been criticised as inadequate. SADCs declaration of the elections as peaceful has drawn ire from human rights groups, while the African Union has yet to take decisive action.\n\nWestern donor nations and international organisations have largely issued statements of concern without implementing concrete measures to address the crisis.\n\nAs Mozambiques crisis deepens, calls for accountability are growing louder.\n\nRights organisations and opposition leaders are demanding independent investigations into human rights abuses and greater international pressure on the Frelimo-led government to respect democratic principles and human rights.\n\nWhether Mozambiques leadership will heed these calls remains uncertain, but the need for a swift resolution is evident as the violence continues to claim lives and destabilise the nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Maputo-The death toll from post-election violence in Mozambique has risen to at least 30, with 110 injured in the past … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/30-killed-in-mozambique-post-elections-violence/\">Continue reading<span class=\"screen-reader-text\"> \"30 Killed In Mozambique Post Elections Violence\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Mnangagwa’s Christmas Donation Overshadowed by  Corruption, Human Rights Violations",
            "url": "https://www.zimeye.net/2024/12/12/mnangagwas-christmas-donation-overshadowed-by-corruption-human-rights-violations/",
            "content": "By A Correspondent\n\nIn a gesture aimed at spreading holiday cheer, President Emmerson Mnangagwa has assumed the role of Santa Claus this December, donating over two tonnes of rice to 20 care homes in Bulawayo. The donation, delivered on Tuesday, was presented by the Minister of State for Provincial Affairs and Devolution, Honourable Judith Ncube, who handed over the goods on behalf of the President. Among the recipients were care homes such as Luveve School of Training, Percy Iboston, St. Francis, and Sandra Jones, with each institution receiving 100 kilograms of rice to support the elderly and children under their care.\n\nThe beneficiaries expressed gratitude, acknowledging the timely assistance as essential for ensuring a joyful Christmas for those most vulnerable in society. One representative from a care home remarked, The timely donation will go a long way in ensuring the elderly have a great Christmas.\n\nWhile the donation was welcomed by its recipients, it is difficult to ignore the broader context within which this gesture takes placeone riddled with accusations of corruption, human rights violations, and political violence. Despite the festive spirit of the donation, the backdrop of Mnangagwas presidency is marked by a series of controversies that paint a far more complex picture.\n\nCorruption Allegations\n\nPresident Mnangagwas administration has faced numerous allegations of corruption that have eroded public trust. Critics claim that while the government continues to preach about national development and charitable efforts, it is often mired in financial mismanagement and the enrichment of the political elite. Allegations of embezzlement, fraudulent deals, and a lack of accountability in the handling of public funds remain persistent.\n\nThe donation of rice, while seemingly benevolent, raises questions about whether such acts of charity are being used as a smokescreen for a regime often accused of enriching itself at the expense of the nation. The optics of this gesture, coming from a government tainted by corruption, cannot be separated from the wider context of public dissatisfaction with the ruling partys priorities.\n\nHuman Rights Violations and Political Repression\n\nBeyond financial misconduct, Mnangagwas government has been repeatedly accused of human rights abuses, particularly in its crackdown on dissent and opposition groups. The 2018 post-election violence and subsequent human rights violations have left a scar on the nations conscience, with international observers and human rights organizations condemning the actions of state security forces under his leadership.\n\nThe governments history of violently suppressing opposition protests and incarcerating political dissidents paints a stark contrast to the compassionate image it attempts to project with such donations. For many Zimbabweans, the rice given to the care homes is not enough to overshadow the human rights abuses and political repression that continue to shape their everyday lives.\n\nViolence and State Oppression\n\nPolitical violence remains a troubling feature of the Mnangagwa administration, particularly against those perceived as opponents to the ruling ZANU-PF party. Reports of intimidation, arbitrary arrests, and violence against peaceful protesters continue to emerge, casting a long shadow over any attempts at showcasing goodwill.\n\nThe timing of Mnangagwas donation, just weeks before the festive season, also raises concerns about the political motives behind such gestures. Critics argue that this act of charity is less about genuine compassion and more about securing political favor, especially in light of the ongoing economic challenges and discontent within the population.\n\nA Controversial Christmas Gift\n\nWhile the donation of rice to care homes might be viewed by some as an admirable act of generosity, it remains overshadowed by the broader issues of governance that continue to plague Mnangagwas administration. Corruption, human rights violations, and political violence are not easily forgotten, especially when they persist despite claims of reform and development.\n\nFor many, the early Christmas present from the President is not a cure for the deeper ailments afflicting Zimbabwe. Until the issues of corruption and political violence are addressed with real, meaningful change, such charitable acts will remain tainted by the dissonance between the governments words and actions.\n\nIn the end, the rice may feed a few, but it is unlikely to heal the divisions and deep-rooted grievances that continue to define Zimbabwes political landscape under Mnangagwas rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a gesture aimed at spreading holiday cheer, President Emmerson Mnangagwa has assumed the role of Santa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/mnangagwas-christmas-donation-overshadowed-by-corruption-human-rights-violations/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Christmas Donation Overshadowed by  Corruption, Human Rights Violations\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Botswana to Regularize Undocumented Zimbabweans",
            "url": "https://www.zimeye.net/2024/12/12/botswana-to-regularize-undocumented-zimbabweans/",
            "content": "Gaborone, Botswana  December 12, 2024\n\nIn a groundbreaking announcement, Botswanas President Duma Boko has revealed plans to regularize the stay of undocumented Zimbabweans living in the country, citing Zimbabwes skilled human resources as a valuable asset. This move is expected to benefit thousands of Zimbabweans, with an estimated 150,000 already residing in Botswana.\n\nZimbabwes Ambassador to Botswana, Henry Mukonoweshuro, welcomed the announcement, highlighting the potential benefits for both nations. Speaking in an interview yesterday, Mukonoweshuro said, We welcome the pronouncements by the new President Advocate Duma Boko. His idea to document and regularize Zimbabweans is a positive trajectory. Its better to have regularized individuals who can be traced, trusted, and allowed to seek formal employment.\n\nThe Ambassador noted that Zimbabweans in Botswana are well-trained, skilled, and committed, making them a valuable addition to the workforce. He compared the move to South Africas 2009 special dispensation for Zimbabweans and expressed optimism about implementing a similar framework in Botswana.\n\nMukonoweshuro confirmed plans to meet with Botswanas Minister of Immigration and Human Rights to discuss the rollout of the initiative. I am yet to meet the new Minister and Permanent Secretary to actualize the Presidents pronouncement, he said.\n\nThe Zimbabwean Embassy in Gaborone is already playing a critical role in supporting its citizens in Botswana. The consular office serves up to 150 Zimbabweans daily, providing services such as passport renewals, permit documentation, and birth certificate applications. The Embassy is also compiling a database of Zimbabweans living in Botswana to streamline the regularization process.\n\nZimbabweans living in Botswana have expressed satisfaction with the consular services offered by the Embassy. Dr. Brighton Hurombo, a lecturer at the University of Botswana, commended the quality of services. I am very happy with the assistance provided here. Today, I was able to resolve my drivers license issues, allowing me to travel to Harare for the holidays without any problems, he said.\n\nThe announcement by President Boko marks a significant step in strengthening relations between Botswana and Zimbabwe while ensuring the inclusion and recognition of Zimbabweans in Botswanas social and economic framework. Further updates on the documentation process and its implementation are expected in the coming weeks.\n\nThis initiative is expected to foster trust, provide job opportunities, and harness the skilled labor of Zimbabweans for Botswanas benefit.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Gaborone, Botswana – December 12, 2024 In a groundbreaking announcement, Botswana’s President Duma Boko has revealed plans to regularize the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/botswana-to-regularize-undocumented-zimbabweans/\">Continue reading<span class=\"screen-reader-text\"> \"Botswana to Regularize Undocumented Zimbabweans\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Gems Bury Eswatini",
            "url": "https://www.zimeye.net/2024/12/12/gems-bury-eswatini/",
            "content": "The Zimbabwe netball team, the Gems, maintained their strong performance at the 2024 Africa Nations Cup, defeating Eswatini 78-27 in their second Pool B match in Swakopmund, Namibia.\n\nNews brief\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Zimbabwe netball team, the Gems, maintained their strong performance at the 2024 Africa Nations Cup, defeating Eswatini 78-27 in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/gems-bury-eswatini/\">Continue reading<span class=\"screen-reader-text\"> \"Gems Bury Eswatini\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Climate Change Threatens Livelihoods In Hwange",
            "url": "https://www.zimeye.net/2024/12/12/climate-change-threatens-livelihoods-in-hwange/",
            "content": "By A Correspondent\n\nExtreme temperatures fueled by climate change have ravaged Kalope Dam, a vital water source in Hwange, leaving it nearly dry and plunging the community into distress. The severe drought, exacerbated by El Nio, has pushed the Lukosi Irrigation Scheme to the brink, jeopardizing the livelihoods of thousands.\n\nThe dire situation is compounded by the relentless heat, which continues to drain the dams last drops, further exacerbating the communitys woes. Villagers are racing against time, anxiously awaiting the next rains to replenish the dam and salvage their crops.\n\nWere in a precarious position, said a local resident. Water from Kalope Dam sustains our irrigation. Without rains, our crops wont survive. Our cattle are getting stuck in the mud, and the situation is dire for both livestock and crops.\n\nAs the community holds its breath, hoping for a reversal of fortunes, the consequences of climate change remain stark. Kalope Dams depletion serves as a stark reminder of the devastating impact of extreme temperatures on local ecosystems and livelihoods.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Extreme temperatures fueled by climate change have ravaged Kalope Dam, a vital water source in Hwange, leaving … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/climate-change-threatens-livelihoods-in-hwange/\">Continue reading<span class=\"screen-reader-text\"> \"Climate Change Threatens Livelihoods In Hwange\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Armed Robbers Torch Bus, Kill Conductor in Brazen Heist",
            "url": "https://www.zimeye.net/2024/12/12/armed-robbers-torch-bus-kill-conductor-in-brazen-heist/",
            "content": "By A Correspondent\n\nA devastating armed robbery occurred at the New Town Cross Border Buses Rank, leaving a trail of destruction and loss of life.\n\nA Devine Stars Logistics bus was targeted by ruthless thieves, who brutally murdered the conductor and set the vehicle ablaze after stealing from coach operators.\n\nTragically, one Zimbabwean national is suspected to have lost their life in the horrific incident.\n\nThe perpetrators, whose identities are yet to be confirmed, poured petrol on the bus before igniting it, leaving it completely destroyed.\n\nThe senseless act of violence has sent shockwaves through the community, with authorities urging anyone with information to come forward and assist in bringing the perpetrators to justice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating armed robbery occurred at the New Town Cross Border Buses Rank, leaving a trail of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/armed-robbers-torch-bus-kill-conductor-in-brazen-heist/\">Continue reading<span class=\"screen-reader-text\"> \"Armed Robbers Torch Bus, Kill Conductor in Brazen Heist\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Mozambican Opposition Leader Announces Own Swearing-in Date",
            "url": "https://www.zimeye.net/2024/12/12/mozambican-opposition-leader-announces-own-swearing-in-date/",
            "content": "By A Correspondent\n\nVenncio Mondlane, an opposition candidate in Mozambique, has declared that he will swear himself in as the countrys fifth elected president on January 15, 2025. He has called on Mozambicans to prepare for the day.\n\nThis announcement comes just 34 days before President Nyusis term officially ends. However, the ruling partys candidate, Daniel Chapo, has been declared the winner of the presidential election. The opposition, claiming election fraud, has vowed to challenge the results in court.\n\nAccording to the national election commission, Chapo won with 70.67% of the vote, while Mondlane, an independent candidate, secured 20.32%. Ossufo Momade, representing the opposition party Renamo, came third with 5.81%.\n\nThe October 9 election results mark the continuation of Frelimos rule, the governing party that has held power since Mozambiques independence from Portugal in 1975. Frelimo previously fought a 15-year civil war against Renamo, which later became the main opposition and contested in this election.\n\nThe opposition has rejected the outcome and filed a complaint with the Constitutional Council, seeking a ruling on the election results.\n\nThe Constitutional Council, which is the highest authority on constitutional and electoral law in Mozambique, has instructed the National Elections Commission (CNE) to address discrepancies in the vote counts across the presidential, parliamentary, and provincial assembly elections. When the CNE announced preliminary results on October 24, it acknowledged the discrepancies but stated it did not have sufficient time to investigate them thoroughly before the results deadline.\n\nThe Constitutional Council has three weeks to complete its investigation, and a final decision is still awaited.\n\nMeanwhile, the Council of State convened earlier today at 10 a.m. to discuss the political situation amid ongoing post-election protests. Mozambicans are now awaiting the outcome of these deliberations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Venâncio Mondlane, an opposition candidate in Mozambique, has declared that he will swear himself in as the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/mozambican-opposition-leader-announces-own-swearing-in-date/\">Continue reading<span class=\"screen-reader-text\"> \"Mozambican Opposition Leader Announces Own Swearing-in Date\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Matutu Shortlisted For ZACC Post",
            "url": "https://www.zimeye.net/2024/12/12/matutu-shortlisted-for-zacc-post/",
            "content": "By A Correspondent\n\nTongai Matutu, former Movement for Democratic Change Masvingo Provincial secretary, and Justice Mayor Wadyajena, Gokwe-Nembudziya legislator, have been shortlisted for public interviews for commissioner at the Zimbabwe Anti-Corruption Commission (ZACC). Zarelah Makali, former Member of Parliament for Epworth, is also among the shortlisted candidates.\n\nThe selection process for ZACC commissioners involves rigorous vetting, including public interviews, to ensure appointees possess integrity and relevant administrative experience . The Constitution stipulates that ZACC members must be chosen for their integrity and knowledge of administration.\n\nShortlisting Process\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tongai Matutu, former Movement for Democratic Change Masvingo Provincial secretary, and Justice Mayor Wadyajena, Gokwe-Nembudziya legislator, have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/matutu-shortlisted-for-zacc-post/\">Continue reading<span class=\"screen-reader-text\"> \"Matutu Shortlisted For ZACC Post\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        },
        {
            "title": "Mnangagwa Bribes The Elderly With Rice",
            "url": "https://www.zimeye.net/2024/12/12/mnangagwa-bribes-the-elderly-with-rice/",
            "content": "By A Correspondent\n\nIn a gesture aimed at spreading holiday cheer, President Emmerson Mnangagwa has assumed the role of Santa Claus this December, donating over two tonnes of rice to 20 care homes in Bulawayo.\n\nThe donation, delivered on Tuesday, was presented by the Minister of State for Provincial Affairs and Devolution, Honourable Judith Ncube, who handed over the goods on behalf of the President. Among the recipients were care homes such as Luveve School of Training, Percy Iboston, St. Francis, and Sandra Jones, with each institution receiving 100 kilograms of rice to support the elderly and children under their care.\n\nThe beneficiaries expressed gratitude, acknowledging the timely assistance as essential for ensuring a joyful Christmas for those most vulnerable in society. One representative from a care home remarked, The timely donation will go a long way in ensuring the elderly have a great Christmas.\n\nWhile the donation was welcomed by its recipients, it is difficult to ignore the broader context within which this gesture takes placeone riddled with accusations of corruption, human rights violations, and political violence. Despite the festive spirit of the donation, the backdrop of Mnangagwas presidency is marked by a series of controversies that paint a far more complex picture.\n\nCorruption Allegations\n\nPresident Mnangagwas administration has faced numerous allegations of corruption that have eroded public trust. Critics claim that while the government continues to preach about national development and charitable efforts, it is often mired in financial mismanagement and the enrichment of the political elite. Allegations of embezzlement, fraudulent deals, and a lack of accountability in the handling of public funds remain persistent.\n\nThe donation of rice, while seemingly benevolent, raises questions about whether such acts of charity are being used as a smokescreen for a regime often accused of enriching itself at the expense of the nation. The optics of this gesture, coming from a government tainted by corruption, cannot be separated from the wider context of public dissatisfaction with the ruling partys priorities.\n\nHuman Rights Violations and Political Repression\n\nBeyond financial misconduct, Mnangagwas government has been repeatedly accused of human rights abuses, particularly in its crackdown on dissent and opposition groups. The 2018 post-election violence and subsequent human rights violations have left a scar on the nations conscience, with international observers and human rights organizations condemning the actions of state security forces under his leadership.\n\nThe governments history of violently suppressing opposition protests and incarcerating political dissidents paints a stark contrast to the compassionate image it attempts to project with such donations. For many Zimbabweans, the rice given to the care homes is not enough to overshadow the human rights abuses and political repression that continue to shape their everyday lives.\n\nViolence and State Oppression\n\nPolitical violence remains a troubling feature of the Mnangagwa administration, particularly against those perceived as opponents to the ruling ZANU-PF party. Reports of intimidation, arbitrary arrests, and violence against peaceful protesters continue to emerge, casting a long shadow over any attempts at showcasing goodwill.\n\nThe timing of Mnangagwas donation, just weeks before the festive season, also raises concerns about the political motives behind such gestures. Critics argue that this act of charity is less about genuine compassion and more about securing political favor, especially in light of the ongoing economic challenges and discontent within the population.\n\nA Controversial Christmas Gift\n\nWhile the donation of rice to care homes might be viewed by some as an admirable act of generosity, it remains overshadowed by the broader issues of governance that continue to plague Mnangagwas administration. Corruption, human rights violations, and political violence are not easily forgotten, especially when they persist despite claims of reform and development.\n\nFor many, the early Christmas present from the President is not a cure for the deeper ailments afflicting Zimbabwe. Until the issues of corruption and political violence are addressed with real, meaningful change, such charitable acts will remain tainted by the dissonance between the governments words and actions.\n\nIn the end, the rice may feed a few, but it is unlikely to heal the divisions and deep-rooted grievances that continue to define Zimbabwes political landscape under Mnangagwas rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a gesture aimed at spreading holiday cheer, President Emmerson Mnangagwa has assumed the role of Santa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/12/mnangagwa-bribes-the-elderly-with-rice/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Bribes The Elderly With Rice\"</span></a></p>",
            "time": "2024-12-12 08:42:20"
        }
    ]
}