{
    "news": [
        {
            "title": "Prophet Andrew Wutaunashe Abandoned by Botswana Crowds After Demanding A Brand-New Car From Tswana Churches",
            "url": "https://www.zimeye.net/2025/04/28/prophet-andrew-wutaunashe-abandoned-by-botswana-crowds-after-demanding-a-brand-new-car-from-tswana-churches/",
            "content": "By A Correspondent | ZimEye | Francistown, Botswana  Barely 5 months after demanding that Botswana citizens must buy him a brand new car, Prophet Andrew Wutaunashe, who is Zimbabwes President Emmerson Mnangagwas kingmaker, has revealed he has been deserted by large crowds of followers in Botswana  a stunning fallout following a scandal over his demands for a brand-new car from his congregation last Christmas.\n\nWutaunashe made the announcement during an emotional sermon on Sunday, April 27, 2025- in Francistown, admitting that not only had ordinary church members left him, but also Archbishop Kuleletse, the leading bishop of his Botswana church, had formally cut ties.\n\nIn a lengthy and prayer-laden address, Wutaunashe tried to console his remaining flock:\n\nBarely 3 years after telling@JustinWelby@churchofenglandthat his UK trip is because he is troubled for the poor, Emmerson Mnangagwas giant-bellied prophet, Andrew Wutaunashe, 5 days ago, demands a car from poor Botswana church members (pictured). The preacher advised byhttps://t.co/uDQbeJ6Q95pic.twitter.com/UXfqzFzfCh\n\nArchbishop Kuleletse felt that he should leave us, Wutaunashe said. I personally thought that he shouldnt, but he said that he felt that is what God wants him to do but we might just pray for him; keep on loving him.\n\nThe dramatic collapse in support follows a major expos by the ZimEye news network, which revealed how Wutaunashe had demanded a brand-new vehicle from his poor Botswana congregation  to be delivered within four months  at a time when he was also condemning Western nations for supposedly lacking compassion for the needy.\n\nIn his Christmas sermon last December, Wutaunashe had declared his expectation:\n\nI know all the bishops love me so at Easter camp next year, the bishops will give me a car I wont tell them what type, otherwise they will be in shock.\n\nThe ZimEye expos triggered widespread anger, particularly among Botswana citizens, who felt betrayed by a leader they once trusted. Members accused him of exploiting their loyalty while living lavishly at their expense.\n\nA Church in CrisisIn his Sunday sermon, Wutaunashe tried to frame the mass desertions as part of a divine process:\n\nDont worry about sons who go away; they will always come back even Jesus went away from his Father but came back.\n\nDespite the hopeful rhetoric, the departure of Archbishop Kuleletse is seen as a massive blow to Wutaunashes operations in Botswana, a country that was once a stronghold for his regional influence.\n\nThe preacher, visibly shaken, launched into a prayer asking for blessings on Kuleletses new path and encouraged his remaining followers to rebuild the Francistown church to a greater later glory.\n\nWutaunashe also took the opportunity to pray for the Zimbabwean government, notably for Emmerson Mnangagwa, urging divine intervention to bring to completion what he called Mnangagwas work of peace and progress.\n\nMeanwhile:Latest revelations suggest that at the time of writing another compounding scandal involving a still to be named son of a bishop who was at the time ofthe desertion having an affair with the wife of another senior church leader.\n\nLooking AheadAs Wutaunashe struggles to rebuild in Francistown, questions remain about his broader credibility across Southern Africa, especially amid rising scrutiny of self-styled prophets and their financial dealings. Whether he can recover from this scandal remains to be seen.\n\nFULL TRANSCRIPT:\n\nI keep promising myself that I will find myself to Francistown just to comfort myself and to comfort you that Archbishop Kuleletse felt that he should leave us, I personally thought that he shouldnt but he said that he felt that is what God wants him to do, so that he can start another work or something, but we might just pray for him; keep on loving him; and me my Prayer I was thinking of it this morning that you shouldnt worry about sons who go away they will always come back because you see Jesus even Jesus went away from his father but he came back; say hallelujah; I know you are not Father so you wont know, so I will always be longing that I will see Bishop Kuleletse; but anyway God has allowed it so let the wheel be done so you must go on and build a great church in Francis town. I heard someone say this is the home of Christ Africa who was saying that? Was it you? You must go and build it again so I have taken it seriously. Amen, he better build it. You better build it because if you dont, somebody else will do it.. you hear someone say this is the home of Chris at AFRICA in the village in Zimbabwe, but lets pray. Lets start by just raising our hands. Lets pray for Archie Bishop. And lets pray that God will guide his footsteps. Father we thank you for your servant who led his sheep for so many years Father you know where he stands right now we put him in your hands Lord that heavenly father your purposes will be achieved through his life in the name of the Lord Jesus Christ that it will be well with him that his footsteps will be guided by you thank you heavenly father Above all you gave us is not just people, but its the vision; let the vision fulfil in this place as you gave us longer ago bless us oh God today as we come before you; we now thank you for the nation of Botswana and we give you things for Kings, for our president in this nation Heavenly Father; for the whole cabinet and leaders; and we pray that you may put your hand of guidance in the way they lead heavenly father by bringing a peaceable life; and progress and the prosperity of Botswana; in the name of the Lord Jesus; remember in your special way the travails of Zimbabwe; we pray in the name of Jesus that you may also fulfil Philippians one verse six the work you began through Emmerson Mnangagwa by helping to bring to completion two piece undisturbed in the nation your plan and your progress will prevail in the nation, but today as we come before you remember every nation in which heavenly father you have been able to put the footprint of this church bless those nations or father heavenly father as we cry unto you remember also my father at the convention my father which is taking place in UK from this Friday onwards in the city of Leeds we pray that you may visit us even in greater ways of Father in the name of the Lord Jesus but today touch everyone and bless us heavenly father in the revelation of your word and let there be hope; and there be a new confidence in every life Satan I bind you and I discard you your Demons and spirits that take away revelation we cast you away in the name of Jesus we command the veil to be lifted and I say in the name of Jesus they shall be yes a revelation blessing and upwards movement for everyone who hears this word and father I now pray in particular for this church oh God here in Francistown, put my feet here as your apostle in the name of the Lord Jesus Christ by this presence today you may give this Church and new beginning in the name of the Lord Jesus Christ may the glory of the latter house of the Francistown citywide family of God Church will be greater than that of the former and in this place there will be peace in the name of the Lord Jesus Christ. I bless these people that they will stand to build this work and that they will not despise the day of small things but that they will be faithful and that oh God this will be a great house beautiful for you my father thank you Father in Jesus name lets clap our hands unto the Lord. And say Amen; Turn to your neighbour and smile and shake their hand and give a big Francistown smile and say welcome to the Francistown  citywide family of God Church, tell them this is the church we are building to a greater later glory; shout hallelujah, praise God: lets be seated in Gods presence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Francistown, Botswana – Barely 5 months after demanding that Botswana citizens must buy him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/prophet-andrew-wutaunashe-abandoned-by-botswana-crowds-after-demanding-a-brand-new-car-from-tswana-churches/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Andrew Wutaunashe Abandoned by Botswana Crowds After Demanding A Brand-New Car From Tswana Churches\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Another Top General Who Helped Mnangagwa Oust Mugabe Dies — Mystery Deepens Around Zimbabwe’s Military Purges",
            "url": "https://www.zimeye.net/2025/04/28/another-top-general-who-helped-mnangagwa-oust-mugabe-dies-mystery-deepens-around-zimbabwes-military-purges/",
            "content": "Harare, Zimbabwe  April 28, 2025\n\nBy Farai D Hove | ZimEye | In another blow to Zimbabwes military establishment, Air Vice Marshal (Retired) Winnie Cabby Mandeya, a celebrated liberation war veteran and senior officer of the Air Force of Zimbabwe (AFZ), has died under circumstances that, while officially described as natural, fuel growing suspicions of a systematic purge of generals once instrumental in the 2017 ouster of Robert Mugabe.\n\nMandeya, aged 64, passed away early Monday morning at St Annes Hospital in Harare. Confirming her death, Air Marshal Jacob John Nzvede said Mandeya was a determined cadre who had served the Air Force with dedication and loyalty since 1984, after an illustrious record during Zimbabwes liberation struggle.\n\nA funeral parade is set to be held at Manyame Air Force Base on Tuesday, while mourners have gathered at her Borrowdale home, 766 Hogerty Hill, Harare.\n\nMandeyas death adds to a growing and troubling list: over 30 senior generals have died since the 2017 military-assisted transition that saw Emmerson Mnangagwa ascend to power. Analysts and insiders alike warn that these deaths are unlikely to be coincidental.\n\nThe Generals Are Falling  And Not by Chance\n\nSince the dramatic events of November 2017, when tanks rolled into Harare and the long-serving Mugabe was ousted, Zimbabwes political landscape has been dominated by the military elite who engineered the change. Yet, the architects of that transition are now falling one by one.\n\nAmong the notable deaths:\n\nThe sheer number of fatalities among key military figures raises the specter of an internal power struggle as ZANU PFs battle for succession intensifies.\n\nThe Mgagao Shadow and ZANU PFs Chronic Succession Crisis\n\nZANU PFs leadership has long been shaped by the military, dating back to the 1975 Mgagao Declaration where liberation war commanders first asserted their political influence. Post-independence, every major leadership transition  including Mugabes fall  bore the fingerprints of the military.\n\nToday, as the question of Mnangagwas successor looms large, and with factionalism rife inside the ruling party, the militarys grip on political outcomes is once again being tested. However, the deaths of veterans like Mandeya suggest that the old guard is being systematically dismantled  either through natural attrition, covert assassinations, or a mix of both.\n\nA Shadowy New Force?\n\nIntelligence sources hint at the emergence of a clandestine group within the military and political apparatus, determined to reshape Zimbabwes leadership landscape. According to one military insider, The struggle now is no longer just political  its existential. No one trusts anyone. Those who were kingmakers in 2017 have become liabilities.\n\nThis shadow network allegedly aims to sideline or eliminate any figure perceived as disloyal or ambitious enough to challenge the emerging new order. The pattern is chillingly familiar: marginalization, surveillance, unexplained illnesses, fatal accidents.\n\nZimbabwe Holds Its Breath\n\nAs the nation mourns yet another decorated military hero, Zimbabweans are left grappling with an unsettling reality: the fight for power has entered a deadly phase. With the 2028 elections approaching and Mnangagwas succession plans unclear, the stakes have never been higher.\n\nIn a land where history is soaked with the blood of liberation fighters and power struggles, the latest chapter in Zimbabwes political saga is being written in shadows, whispers, and sudden funerals.\n\nThe death of Air Vice Marshal (Retired) Winnie Mandeya is not just a personal tragedy  it is another piece in a dangerous and evolving puzzle, one whose endgame remains dangerously uncertain.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, Zimbabwe — April 28, 2025 By Farai D Hove | ZimEye | In another blow to Zimbabwe’s military establishment, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/another-top-general-who-helped-mnangagwa-oust-mugabe-dies-mystery-deepens-around-zimbabwes-military-purges/\">Continue reading<span class=\"screen-reader-text\"> \"Another Top General Who Helped Mnangagwa Oust Mugabe Dies — Mystery Deepens Around Zimbabwe’s Military Purges\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Former AirForce Boss Dies",
            "url": "https://www.zimeye.net/2025/04/28/former-airforce-boss-dies/",
            "content": "By Munacho Gwamanda- AIR Vice Marshal (Retired) Winnie Mandeya has died.\n\nThe senior officer of the Air Force of Zimbabwe (AFZ) was 64.\n\nAir Vice Marshal Retired Mandeya died early Monday morning at St Annes Hospital in Harare.\n\nConfirming the sad news, Commander Air Force of Zimbabwe, Air Marshal Jacob John Nzvede, said the late Air Vice Marshal Retired Mandeya served the AFZ with dedication and loyalty since 1984.\n\nThe Air Force of Zimbabwe family is saddened by the passing on of Air Vice Marshal Winnie Cabby Mandeya (Retired) on April 28 2025. She was a determined cadre who served the Air Force of Zimbabwe since 1984 and a liberation war heroine, he said.The late AVM Winnie Cabby Mandeya (Retired) joined the liberation struggle on September 29, 1975 and successfully completed basic military training at Nachingweya, Tanzania and was deployed in Gaza Province where she operated until 1978 when she was selected for a nursing course. At independence, she joined the Presidents Department where she actively participated in the commission of inquiry into missing persons in 1981 and later transferred to the Air Force of Zimbabwe on July 1, 1984,\n\nBorn on the 14th of July in 1960, in Rusape, Air Vice Marshal Retired Mandeyas journey was marked by groundbreaking achievements.\n\nShe was among the cadres who survived the Chimoio attack.\n\nIn 2022, President Emmerson Mnangagwa promoted her to Air Vice Marshal, a rank equivalent to Major General in the Zimbabwe National Army, recognising her dedication and trailblazing service.\n\nMeanwhile, a funeral parade for Air Vice Marshal (Retired) Mandeya will be held at Manyame Air Force Base this Tuesday.Mourners are gathered at 766 Hogerty Hill in Borrowdale, Harare.\n\n-ZBC\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- AIR Vice Marshal (Retired) Winnie Mandeya has died. The senior officer of the Air Force of Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/former-airforce-boss-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Former AirForce Boss Dies\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Prices Go Up As ZiG Continues To Lose Value",
            "url": "https://www.zimeye.net/2025/04/28/prices-go-up-as-zig-continues-to-lose-value/",
            "content": "By Business Reporter-Zimbabwes local currency, the Zimbabwe Gold (ZiG), returned to positive monthly inflation in April 2025, with the Zimbabwe National Statistics Agency (ZimStat) reporting a 0.6% increase, up from -0.1% in March.\n\nThe latest figures mark a 0.7 percentage point rise, ending a brief spell of deflation andsignallinggrowing pressure on the new currency, which was introduced in April 2024.\n\nAccording to ZimStat, prices measured by the all-items ZiG Consumer Price Index (CPI) rose on average by 0.6% between March and April 2025.\n\nThe ZiG CPI now stands at 185.68, up from 184.50 in March, and sharply higher than the base of 100.00 a year ago.\n\nThe year-on-year inflation rate for ZiG-denominated prices in April wasrecorded at85.7%, reflecting the first official annual inflation measurement since the currencys launch.\n\nThe high figure is largely attributed to price surges following theOctober 2024 devaluation of the local currency, reinforcing concerns over ZiGs waning purchasing power.\n\nIn contrast, US dollar inflation remained relatively stable. ZimStat reported a USD month-on-month inflation rate of 0.2% in April, up slightly from 0.1% in March.\n\nThe USD CPI rose modestly from 121.87 to 122.12 during the same period, with food prices largely unchanged and non-food items rising by 0.3%.\n\nOn an annual basis, theUSD inflation rate stood at 14.4%, highlighting the stark difference between prices measured in ZiG and those in the more stable US dollar.\n\nZimStat also published the Weighted Consumer Price Index (CPI), which captures price changes acrossbothZiG and USD transactions.\n\nIn April 2025, the weighted month-on-month inflation rate was 0.3%, compared to 0.0% in March, with theweighted CPIinchingup to 126.18 from 125.84.The weighted annual inflation rate stood at 26.2%.\n\nMeanwhile, the cost of living continues to rise.\n\nThe Food Poverty Line (FPL)the minimum monthly amount required to meet basic food energy needswas ZWG 862.06 per person in April, while the Total Consumption Poverty Line (TCPL), which covers both food and essential non-food items, rose to ZWG 1,263.41 per person.\n\nThe uptick in inflation and the weakening of ZiG have reignited fears of a return to economic instability, with analysts warningthat confidence in the local currency remains fragile as price pressures mount.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-Zimbabwe’s local currency, the Zimbabwe Gold (ZiG), returned to positive monthly inflation in April 2025, with the Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/prices-go-up-as-zig-continues-to-lose-value/\">Continue reading<span class=\"screen-reader-text\"> \"Prices Go Up As ZiG Continues To Lose Value\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Mwonzora In US$22K Rental Fraud Storm",
            "url": "https://www.zimeye.net/2025/04/28/mwonzora-in-us22k-rental-fraud-storm/",
            "content": "By Courts and Crime Reporter- The Douglas Mwonzora-led Movement for Democratic Change (MDC) has been dragged to court over a US$22,000 rental fraud scandal, reigniting memories of Mwonzoras past brush with the law in 2014.\n\nSenior party officials Chengetai Guta and Tapiwa Mashakada appeared before Harare magistrate Lisa Mutendereki, answering to allegations of duping a local company, Denmark Training Services, into paying US$22,000 for a property they neither owned nor controlled.\n\nAccording to the State, in September 2023, Denmark Training Services approached the MDC offices seeking to lease Stand 18168 Belvedere.\n\nMashakada allegedly confirmed ownership and negotiated the deal after securing supposed permission from the party President, Mwonzora.\n\nA lease agreement was signed, and US$22,000 was paid.\n\nHowever, the complainant mistakenly occupied land belonging to Croco Holdings.\n\nWhen attempting to start developments, they were confronted by Croco staff and ordered off the premises.\n\nUpon confronting Guta and Mwonzora, the complainant was redirected to the correct stand, only to discover it was already occupied.\n\nEfforts to reclaim the property in May 2024 were rebuffed when Guta allegedly blocked entry and verballycancelledthe lease.\n\nInvestigations revealed the MDCs original lease with the City of Harare had already beencancelledin August 2023, a month before the deal was made.\n\nCity authorities confirmed the property legally belonged to the council, and the MDC had no right to transact.\n\nThis fresh scandal drags up memories of Mwonzoras 2014 courtcase,when he was acquitted of two counts of theft of trust property dating back to 2006.\n\nThen, Harare magistrate Adonia Masawi ruled that Mwonzora had no case to answer after failing to reimburse money following an aborted house sale involving Nestl Zimbabwe employee Everson Dandadzi.\n\nGuta and Mashakada were remanded out of custody.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Courts and Crime Reporter- The Douglas Mwonzora-led Movement for Democratic Change (MDC) has been dragged to court over a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/mwonzora-in-us22k-rental-fraud-storm/\">Continue reading<span class=\"screen-reader-text\"> \"Mwonzora In US$22K Rental Fraud Storm \"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Is Carlo Leaving Real Madrid?",
            "url": "https://www.zimeye.net/2025/04/28/is-carlo-leaving-real-madrid/",
            "content": "Sports Correspondent\n\nCarlo Ancelotti is set to meet with Real Madrid president Florentino Prez in the coming days to discuss the possibility of leaving the club, a source has informed ESPN.\n\nAlthough Ancelottis contract with Madrid runs until 2026, rumors surrounding his future have persisted throughout the season.\n\nLast week, ESPN reported that discussions had resumed between the Brazilian Football Confederation and Ancelottis representatives regarding the potential takeover of the Brazil national team.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Carlo Ancelotti is set to meet with Real Madrid president Florentino Pérez in the coming days to discuss … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/is-carlo-leaving-real-madrid/\">Continue reading<span class=\"screen-reader-text\"> \"Is Carlo Leaving Real Madrid?\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "DeMbare In Frustrating Draw",
            "url": "https://www.zimeye.net/2025/04/28/dembare-in-frustrating-draw-2/",
            "content": "Sports Correspondent\n\nDynamos FC, the once-dominant force in Zimbabwean football, found themselves in familiar territory on Sunday as they were held to yet another frustrating goalless draw against Kwekwe United at Rufaro Stadium.\n\nThe result continues a disheartening trend for the Harare giants, who have struggled to find consistency this season, much to the frustration of their passionate fanbase.\n\nDespite a solid effort, Dynamos were unable to break down the resolute Kwekwe United defense, and the match ended in a goalless stalemate. The result leaves the team with more questions than answers as they continue their pursuit of league glory, with the pressure mounting on coach Lloyd MaBlanyo Chigowe.\n\nSpeaking after the match, Chigowe acknowledged the discontent among fans, recognizing the high expectations that come with managing a club of Dynamos stature. Even if you look at Scotland, they are not happy with draws. So, you must expect that when results are not coming, the fans will not be fond. Theyll not be happy, and I understand that pretty well because they want a win, nothing less, nothing more, Chigowe said in a frank post-match interview.\n\nThe coachs comments reflect the reality that Dynamos fans demand nothing short of victory, and anything less is seen as a failure. With the team continuing to drop points, there is growing concern about their title hopes, as the season progresses.\n\nThe lack of a clinical edge in front of goal has been a recurring issue for Dynamos this season, and Sundays match highlighted their inability to capitalize on their possession. Despite controlling large spells of the game, they were unable to produce that crucial moment of brilliance that could have secured them the three points.\n\nAs the season advances, it remains to be seen how Chigowe and his players will respond to the mounting pressure. The challenge of turning draws into wins has never been more urgent for Dynamos, with their supporters growing increasingly restless in their pursuit of a much-needed championship.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos FC, the once-dominant force in Zimbabwean football, found themselves in familiar territory on Sunday as they were … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/dembare-in-frustrating-draw-2/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare In Frustrating Draw\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Conditions For Growing Mbanje In Zimbabwe…",
            "url": "https://www.zimeye.net/2025/04/28/conditions-for-growing-mbanje-in-zimbabwe/",
            "content": "By A Correspondent\n\nZimbabwes government has introduced tough regulations and high financial barriers for those seeking to cultivate cannabiscommonly known as mbanjefor medicinal or scientific purposes.\n\nDespite the countrys legalization of cannabis production for approved medical use, the substance remains classified as a dangerous drug under the Dangerous Drugs Act.\n\nUnlicensed possession or use can lead to severe penalties, including prison sentences of up to 10 years and substantial fines.\n\nAll cannabis-related activities remain heavily restricted outside the licensed medical framework, a senior official from the Ministry of Health said.\n\nThose looking to enter the cannabis cultivation sector must first obtain a government-issued license.\n\nAccording to the updated requirements, applicantseither individuals or companiesmust submit a detailed site plan demonstrating compliance with regulatory standards.\n\nA cultivation license is only granted after a rigorous vetting process, the official explained. We assess land suitability, security infrastructure, and the applicants capacity to operate within the legal framework.\n\nThe initial licensing fee is pegged at approximately $40,000, with an additional $15,000 annual renewal fee. Research licenses carry a $5,000 fee, while renewals cost $20,000 for standard operations and $2,500 for research projects.\n\nThe costs are prohibitive for the average Zimbabwean, said an agricultural consultant. Its clear that these fees were designed with large-scale, possibly foreign, investors in mind. We risk excluding locals from participating in this emerging industry.\n\nCritics argue that while regulation is necessary, the financial burden may hinder indigenous participation, undermining one of the core intentions behind legalizing medicinal cannabisto create economic opportunities for Zimbabweans.\n\nInstead of empowering local farmers, were setting them up to fail, the consultant added. Lowering the financial barriers could unlock a multi-million-dollar industry and provide livelihoods to thousands.\n\nThe government, however, maintains that the strict measures are intended to ensure security, quality control, and alignment with international drug laws.\n\nZimbabwe must position itself as a credible player in the global medicinal cannabis market, said the Ministry spokesperson. That begins with robust oversight.\n\nAs debate continues over the accessibility of cannabis licensing, entrepreneurs, policymakers, and civil society are calling for a review of the framework to create a more inclusive and balanced system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s government has introduced tough regulations and high financial barriers for those seeking to cultivate cannabis—commonly known … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/conditions-for-growing-mbanje-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Conditions For Growing Mbanje In Zimbabwe…\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Mwonzora Taken To Court Over US$22k Rentals Fraud",
            "url": "https://www.zimeye.net/2025/04/28/mwonzora-taken-to-court-over-us22k-rentals-fraud/",
            "content": "By A Correspondent\n\nThe Douglas Mwonzora led Movement for Democratic Change party has been taken to court over US$22,000 rentals fraud.\n\nParty representatives Chengetai Guta and Tapiwa Mashakada, appeared before Magistrate Lisa Mutendereki who remanded them out of custody.\n\nBail was not an issue since they were coming from home.\n\nAccording to the State, in September 2023, the complainant, Denmark Training Services, approached MDC offices in Harare intending to lease a commercial stand, number 18168 Belvedere, after hearing that it belonged to the party.\n\nIt is alleged that the complainant spoke with Mashakada at the MDC offices, who confirmed that the stand was indeed owned by the party, prompting the complainants interest in becoming a tenant.\n\nThe complainant was told to wait for an answer since the third accused (Mashakada) wanted to be given permission to lease the stand from the second accused (Mwonzora).\n\nHowever, the third accused was given the permission by the second accused to lease the stand, and a lease agreement was written between the parties after the complainant paid money to the tune of US$22,000 and was given some receipts.\n\nAfter paying the required amount, the complainant moved on to occupy the stand but mistakenly occupied the wrong stand that is, he occupied the stand belonging to Croco Holdings.\n\nWhen the complainant was starting to develop the stand, he was approached by Croco Holdings personnel and was informed that the stand belonged to them, not MDC, and was instructed to stop developing the stand, the State alleges.\n\nThe court was informed that the complainant notified the accused about this issue and had a meeting with Guta and Mwonzora. It was after this meeting that he realized he had gone to the wrong stand number.\n\nFurther allegations state that when the complainant later attempted to go to the correct stand for development, he discovered it was already occupied by another individual.\n\nThe complainant informed the accused about the situation and was told to occupy the stand on May 1, 2024, after removing the person who had taken up residence there, which was contrary to their agreement that stated the lease would begin on October 1, 2023.\n\nThe accused collected money from the complainant knowing full well that there was another tenant at the stand and that they had no lease with the City of Harare.\n\nOn May 1, 2024, the complainant went to the stand intending to start development, only to find that it was still occupied.\n\nUpon trying to remove the current occupant, Guta ordered him not to enter the premises. He was verbally informed that they had cancelled the lease agreement and directed to seek reimbursement for his payment, prompting the complainant to file a police report, read court papers.\n\nInvestigations revealed that the lease between the City of Harare and the MDC was cancelled on August 20, 2023; therefore, by the time the accused entered into an agreement with the complainant, their lease agreement had long been terminated.\n\nThe response from the City of Harare, attached to the request regarding the status of the leased stand, stated that the land belongs to the council, and no other party has the legal right to deal or transact with the property.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Douglas Mwonzora led Movement for Democratic Change party has been taken to court over US$22,000 rentals … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/mwonzora-taken-to-court-over-us22k-rentals-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Mwonzora Taken To Court Over US$22k Rentals Fraud\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        },
        {
            "title": "Zanu PF Hijacks ZITF, Sells Party Membership Cards At Trade Fair",
            "url": "https://www.zimeye.net/2025/04/28/zanu-pf-hijacks-zitf-sells-party-membership-cards-at-trade-fair/",
            "content": "By A Correspondent\n\nThe 2025 edition of the Zimbabwe International Trade Fair (ZITF), a platform once celebrated for promoting business, investment, and innovation, has come under heavy criticism after it was overshadowed by the ruling Zanu PF partys aggressive membership recruitment campaign.\n\nThe 65th edition of the trade fair, traditionally a major event for showcasing local and international commerce, was instead turned into a political rally, with Zanu PFs presence heavily dominating the venue.\n\nIn a statement released on Sunday, the ruling party boasted about a significant increase in new membership subscriptions, claiming that the trade fair had become a hotspot for digitalized party registration.\n\nZANU PF witnessed an increase in new membership and uptake of membership cards at the recent 65th Edition of ZITF held in Bulawayo, the statement read. Subscriptions by new members boomed at the Party stands where registration of new membership was digitalised.\n\nAccording to Zanu PF, the partys people-centred policies were the driving force behind this surge in new recruits, which they claimed signaled public support for the ruling regime.\n\nThe people-centred policies of the ruling party ZANU PF are attracting many new members to flock and join the Party, the statement continued, further emphasizing how the partys influence had spread even within the confines of an event meant to foster business opportunities rather than political allegiance.\n\nHowever, critics have been quick to denounce the ruling partys tactics, arguing that the ZITF, a platform established to promote economic development and international trade, has been reduced to a tool for political propaganda and membership drives.\n\nThis is no longer a trade fair; its been hijacked by Zanu PF for their own political gain, said Samuel Chirwa, an economist and independent analyst. What was once a showcase of Zimbabwes potential to the international business community is now a platform for party politics. Its a complete misuse of a national event.\n\nThe politicization of the ZITF was particularly evident in the heavy presence of Zanu PF banners, slogans, and even party membership drives placed alongside business exhibits. Attendees who had traveled to the trade fair to explore business opportunities were instead met with party literature, and the focus seemed less on economic development and more on solidifying political support for the ruling regime.\n\nIts disheartening to see a once-promising event turned into a Zanu PF campaign rally. The ZITF is meant to be about Zimbabwes economic growth, not about pushing for party membership, said another visitor, who wished to remain anonymous. This blatant politicization undermines the credibility of the fair and its future as a genuine business event.\n\nFor many, the move is seen as part of a larger trend of politicizing national institutions and events to consolidate power. Its a worrying sign when even a trade fair cannot remain free from the partys influence, said a political analyst based in Harare. This kind of behavior signals a disregard for the democratic principles that should govern national platforms.\n\nAs Zanu PF continues to consolidate its power through political tactics like these, many are left questioning the future integrity of national platforms like the ZITF. While the ruling party may claim to be driving the countrys economic development, critics argue that such actions only deepen political division and stifle meaningful, inclusive growth.\n\nThe 2025 ZITF, now remembered as a showcase of political overreach, leaves many wondering if Zimbabwes premier trade exhibition can ever return to its original purpose, or if it will remain another stage for Zanu PF to push its political agenda at the expense of economic progress.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The 2025 edition of the Zimbabwe International Trade Fair (ZITF), a platform once celebrated for promoting business, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/28/zanu-pf-hijacks-zitf-sells-party-membership-cards-at-trade-fair/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hijacks ZITF, Sells Party Membership Cards At Trade Fair\"</span></a></p>",
            "time": "21:07",
            "date": "29 Apr 2025"
        }
    ]
}