{
    "news": [
        {
            "title": "Mnangagwa Quickly Changes Constitution While Chiwenga Held Up Killing His Own Wife",
            "url": "https://www.zimeye.net/2025/01/15/mnangagwa-quickly-changes-constitution-while-chiwenga-held-up-killing-his-own-wife/",
            "content": "Investigative Report: Power Consolidation Amidst Internal Turmoil in Zimbabwe\n\nBy A Correspondent | ZimEye | Analysis |Harare, Zimbabwe  Recent developments in Zimbabwe reveal a troubling trajectory as President Emmerson Mnangagwa appears to be tightening his grip on power through constitutional amendments, while Vice President Constantino Chiwenga remains entangled in personal battles, including a high-profile feud with his estranged wife.\n\nConstitutional Changes to Extend Presidential Rule.\n\nAn article published inThe Heralddated January 15, 2025, highlights a proposed constitutional amendment aimed at extending Mnangagwas presidential term beyond the limits set by the constitution. This amendment could potentially allow him to remain in power well into the 2030s, sparking concerns over democratic backsliding.\n\nThe timing of these amendments is significant, as they coincide with a public narrative of Mnangagwa bridging divides between the ruling ZANU-PF and the opposition. However, critics argue that these moves reflect a calculated strategy to solidify control, bypassing any meaningful opposition. By shifting focus to constitutional reform, Mnangagwa is systematically dismantling checks and balances while maintaining the veneer of inclusivity and dialogue.\n\nChiwengas Fall: From Military General to Political Pet\n\nMeanwhile, Vice President Chiwengas trajectory reveals a dramatic decline in stature and influence. Once celebrated as the military general who orchestrated the 2017 coup that brought Mnangagwa to power, Chiwenga now finds himself reduced to what some observers describe as a precabe farm pet. This term, charged with symbolic weight, reflects the sharp contrast between his past as a military strongman and his current diminished role under Mnangagwas leadership.\n\nwho had elected him to lead them from the Mgagao Declaration, he had chopped them all off, all of them the Gamatox and other factions without number. He kicked all of them out accusing them of betraying the struggle.\n\nThis stark reduction is seen as deliberate, orchestrated by Mnangagwa to neutralize Chiwenga as a political threat. Chiwengas focus on personal and legal battles, including his estranged wifes high-profile court cases, has further eroded his political influence. Moreover, this development confirms the enduring effectiveness of intelligence operations over military might in consolidating power.\n\nMnangagwa, often accused of being a master strategist, has long been shadowed by reports alleging his ties to Rhodesian Intelligence since his entry into ZANU-PF structures in 1977. His failure to address these allegations raises further questions about his ability to manipulate individuals and systems with surgical precision. For many, this is evidence that warfareno matter how decisivestands no chance against an organized and covert intelligence operation.\n\nA Strategic Neutralization\n\nThe evolution of Chiwengas role highlights Mnangagwas adeptness at consolidating power while marginalizing potential rivals. The 2018 bomb attack, which Chiwenga survived, marked the beginning of his political decline. Combined with his current distractions and diminished influence, this suggests that Mnangagwa has systematically stripped Chiwenga of his once-formidable power base.\n\nObservers note that this is no coincidence. By redirecting public attention to constitutional amendments and internal conflicts within ZANU-PF, Mnangagwa has insulated himself from criticism while steadily dismantling potential threats to his rule. Chiwengas symbolic transformation from a general to a subdued political figure epitomizes Mnangagwas calculated moves to secure unchallenged control.\n\nConclusion: An Autocratic Future?\n\nThe juxtaposition of Mnangagwas strategic maneuvers and Chiwengas reduced role raises serious concerns about Zimbabwes future. Mnangagwas consolidation of power, underpinned by alleged intelligence connections and strategic manipulation, risks eroding democratic norms and entrenching authoritarianism.\n\nAs Mnangagwa strengthens his grip, Chiwengas decline serves as a cautionary tale of how even the most formidable leaders can be neutralized by intelligence operations. This development confirms that Zimbabwes political elite is less driven by national stability and more consumed by personal ambition and strategic maneuvering.\n\nThe question now is whether Mnangagwas actions will ultimately solidify his legacy or destabilize the nation, as the once-powerful Chiwenga becomes another casualty of Zimbabwes turbulent political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Investigative Report: Power Consolidation Amidst Internal Turmoil in Zimbabwe By A Correspondent | ZimEye | Analysis | Harare, Zimbabwe – … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/mnangagwa-quickly-changes-constitution-while-chiwenga-held-up-killing-his-own-wife/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Quickly Changes Constitution While Chiwenga Held Up Killing His Own Wife\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "NERA Calls Mnangagwa To Order Over Plans To Postpone Polls",
            "url": "https://www.zimeye.net/2025/01/15/nera-calls-mnangagwa-to-order-over-plans-to-postpone-polls/",
            "content": "By A Correspondent| The National Elections Reform Agenda (NERA) has strongly condemned recent discussions suggesting a delay in the 2028 general elections, warning that such proposals would be a direct assault on Zimbabwes democratic principles.\n\nIn a statement, NERA convener Irene Muyenziwa, labeled the suggestion to extend the election timeline to 2030 as a blatant affront to democracy and governance in the country.\n\nSuch considerations are not only a blatant affront to our democratic principles, but also a direct challenge to the essence of governance in Zimbabwe, Muyenziwa said, adding that the notion disregards the voice of the people and undermines the very foundation of democracy.\n\nMuyenziwa highlighted that Zimbabwes focus should be on implementing meaningful electoral reforms that guarantee free, fair, and peaceful elections, not on delaying the democratic process.\n\nMuyenziwas remarks come at a time when certain factions within the ruling party and opposition groups have expressed support for postponing the upcoming elections.\n\nWhile President Emmerson Mnangagwa has publicly pledged to respect the Constitution and refrain from extending his tenure beyond 2028, Muyenziwa warned that proposals to extend the election timeline could set a dangerous precedent, undermining public confidence in the electoral system.\n\nAs the current Chair of the Southern African Development Community (SADC), Zimbabwe holds a position of significant influence. Delaying elections would not only undermine public confidence in our electoral process but also cast serious doubts on our commitment to accountability and governance, she said.\n\nMuyenziwa urged all political stakeholders, civil society organizations, and the public to focus on the urgent need for electoral reforms.\n\nShe called for reforms that enhance citizen participation, promote voter education, and advocate for legal and policy changes that align with democratic principles.\n\nThe time for genuine political will and comprehensive electoral reforms is now.\n\nWe must prioritize the enhancement of citizenparticipation, promotion of voter education, and advocacy for legal and policy reforms that align with democratic principles, she said\n\nNERA, a coalition of political parties, civil society organizations, and other stakeholders, remains firm in its commitment to advancing democratic governance in Zimbabwe.\n\nMuyenziwa insists that the future of the nation lies in upholding citizens rights to choose their leaders through credible elections, rather than through the postponement of their voices.\n\nWe cannot allow fear or political maneuvering to dictate our democratic destiny. We call upon all stakeholders to reject any proposals that seek to delay our elections and to unite in the pursuit of an electoral system that is transparent, inclusive, and accountable, Muyenziwa said.\n\nShe reiterated NERAs call for a renewed focus on electoral integrity, urging all Zimbabweans to ensure that democracy remains a living reality for every citizen, not just an ideal on paper.\n\nThe future of our nation depends on the choices we make today, Muyenziwa said\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The National Elections Reform Agenda (NERA) has strongly condemned recent discussions suggesting a delay in the 2028 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/nera-calls-mnangagwa-to-order-over-plans-to-postpone-polls/\">Continue reading<span class=\"screen-reader-text\"> \"NERA Calls Mnangagwa To Order Over Plans To Postpone Polls\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "SHORT STORY: Chiwenga Reduced From A Pre-Coup To A Precabe Farm General Who Tortures Own Wife On Lies",
            "url": "https://www.zimeye.net/2025/01/15/short-story-chiwenga-reduced-from-a-pre-coup-to-a-precabe-farm-general-who-tortures-own-wife-on-lies/",
            "content": "How Emmerson Mnangagwa has reduced Chiwenga from a Pre-coup to a Precabe farm general who tortures his own wife as his own health worsens\n\nOnce a lion in the fields of power,The spear of the coup in the dark midnight hour,Chiwenga stood, firm and bold,A soldier of destiny, his story untold.\n\nIn 2017, the tides began to shift,A coup crowned the generals gift.The green and gold draped his chest,But the throne had secrets to test.\n\n2018 brought fire and pain,A bomb attack left a permanent stain.His own wife, the wounds did show,The cost of power began to grow.\n\nIn 2019, he flew to Chinas shore,To mend a body that could fight no more.But the scars of ambition and silent strife,Chiseled away at his once-mighty life.\n\nBy 2025, the stage was set,For a Precabe General, his fate beset.A puppet now, in fields of despair,Torturing love while gasping for air.\n\nUnder Mnangagwas iron reign,The lion turned into a shadow of pain.From a kingmaker to a fallen star,The cost of loyalty had gone too far.\n\nHealth worsened, dignity lost,A pawn in a game at a fatal cost.This is the story of a man undone,By the very power he sought to become.- Comment\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "How Emmerson Mnangagwa has reduced Chiwenga from a Pre-coup to a Precabe farm general who tortures his own wife as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/short-story-chiwenga-reduced-from-a-pre-coup-to-a-precabe-farm-general-who-tortures-own-wife-on-lies/\">Continue reading<span class=\"screen-reader-text\"> \"SHORT STORY: Chiwenga Reduced From A Pre-Coup To A Precabe Farm General Who Tortures Own Wife On Lies\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Boy(2) Drowns",
            "url": "https://www.zimeye.net/2025/01/15/boy2-drowns/",
            "content": "By A Correspondent\n\nA devastating incident occurred in Waterfalls, Harare, on January 12, 2025, when a two-year-old male infant tragically drowned in an open pit meant for a septic tank.\n\nAccording to the police, the toddler was playing at a neighbors house when he accidentally fell into the pit.\n\nThe body of the victim was retrieved and taken to Sally Mugabe Hospital for a post-mortem examination. The incident has left the community in shock, highlighting the importance of ensuring the safety of children in residential areas.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating incident occurred in Waterfalls, Harare, on January 12, 2025, when a two-year-old male infant tragically … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/boy2-drowns/\">Continue reading<span class=\"screen-reader-text\"> \"Boy(2) Drowns\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "RBZ Announces Plan To Print More ZiG Notes",
            "url": "https://www.zimeye.net/2025/01/15/rbz-announces-plan-to-print-more-zig-notes/",
            "content": "By A Correspondent\n\nThe Reserve Bank of Zimbabwe (RBZ) is considering the introduction of higher denomination ZiG notes to facilitate smoother cash transactions amid ongoing economic challenges.\n\nRBZ Governor John Mushayavanhu explained to The Sunday Mail that the new notes would be gradually introduced to align with projected economic activity, ensuring market stability. He stated, Plans to introduce higher denominations are underway, and the amount to be introduced will be optimal and consistent with the envisaged economic activity.\n\nIn the future, the RBZ aims to gradually increase the proportion of cash relative to total deposits to 5 percent, a target similar to that of other countries with comparable economic structures. The Reserve Bank expects to progressively increase the proportion of cash to total deposits to 5 percent, which is close to countries with similar economic structures in the region, Mushayavanhu added.\n\nThe RBZ emphasized its commitment to maintaining the value of the ZiG currency, preserving its role as both a transactional and store-of-value medium, while supporting the countrys de-dollarization efforts. The Reserve Bank is committed to maintaining the value of the ZiG and implementing measures that will preserve its transactional and store-of-value functions and support the de-dollarisation journey, Mushayavanhu noted.\n\nTo ensure the stability of the local currency, the RBZ will gradually increase the amount of ZiG in circulation to levels that align with anticipated broad money growth and economic activity. Additionally, the central bank will ensure that the increase in local currency is fully backed by foreign reserves, including gold, other precious metals, and nostro balances. The RBZ will ensure that the increase in local currency is fully covered by foreign reserves (gold, other precious metals, and nostro balances), at all times, and in line with the foreign reserves accumulation strategy, the Governor explained.\n\nWhile the RBZ maintains that the ZiG has stabilized, trading at just over ZiG26 per US$1 on Monday, January 13, the street rate remains significantly higher, hovering around ZiG40 per US$1.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Reserve Bank of Zimbabwe (RBZ) is considering the introduction of higher denomination ZiG notes to facilitate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/rbz-announces-plan-to-print-more-zig-notes/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Announces Plan To Print More ZiG Notes\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Is Mnangagwa’s Support for Odinga’s AUC Chairmanship Bid Genuine?",
            "url": "https://www.zimeye.net/2025/01/15/is-mnangagwas-support-for-odingas-auc-chairmanship-bid-genuine/",
            "content": "By A Correspondent\n\nOn Monday, former Kenyan Prime Minister Raila Odinga arrived in Harare for a meeting with Zimbabwes Emmerson Mnangagwa, aiming to garner support for his candidacy for the African Union Commission (AUC) Chairmanship.\n\nWhile the outcome of Mnangagwas support remains uncertain, Odinga expressed his gratitude and shared his vision for Africa during his visit.\n\nIn a statement, Odinga said, We landed in Harare, Zimbabwe today to a warm reception courtesy of H.E President Emmerson Mnangagwa @edmnangagwa. Its been a pleasure sharing with the president my vision for Africa and discussing my candidature for the AUC Chairmanship.\n\nMeanwhile, Zanu PF also released a statement highlighting the nature of the visit, stating:\n\nRt. Hon Raila Odinga, the Candidate for the AUC Chairmanship, was warmly welcomed in Harare, Zimbabwe today by @presidentmnangagwa. He shared his comprehensive vision and mission for Africa, seeking the support and blessings of Harare as he campaigns for the prestigious position.\n\nOdingas bid has received backing from several leaders, including Kenyan President William Ruto. Ruto expressed confidence in Odingas leadership, stating, Mr Odingas candidature for the African Union Commission chairperson continues to receive tremendous support owing to his proven track record as a pan-Africanist.\n\nRuto further added, We are very confident that the successful bid of Hon Raila is going to see the fortunes of our continent change for the better going into the future, highlighting Odingas potential to promote peace, resolve conflicts, and drive the success of the African Continental Free Trade Area Agreement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent On Monday, former Kenyan Prime Minister Raila Odinga arrived in Harare for a meeting with Zimbabwe’s Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/is-mnangagwas-support-for-odingas-auc-chairmanship-bid-genuine/\">Continue reading<span class=\"screen-reader-text\"> \"Is Mnangagwa’s Support for Odinga’s AUC Chairmanship Bid Genuine?\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Is VP Chiwenga’s Health Okay?",
            "url": "https://www.zimeye.net/2025/01/15/is-vp-chiwengas-health-okay/",
            "content": "The infographic chronicles key moments in the life of a political figure Constantino Chiwenga from 2017 to 2025. It starts with the aftermath of a coup in 2017, followed by a bomb attack in 2018, treatment in China in 2019, and an anticipated scenario in 2025 involving a significant political development that extends leadership beyond 2030. The images suggest a physical transformation over time, that is now the subject of discussion in the community.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The infographic chronicles key moments in the life of a political figure Constantino Chiwenga from 2017 to 2025. It starts … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/is-vp-chiwengas-health-okay/\">Continue reading<span class=\"screen-reader-text\"> \"Is VP Chiwenga’s Health Okay?\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Mnangagwa Administration Sued Over Unsafe Flyovers",
            "url": "https://www.zimeye.net/2025/01/15/mnangagwa-administration-sued-over-unsafe-flyovers/",
            "content": "By A Correspondent\n\nA High Court judge, Justice Never Katiyo, is set to hear an urgent application on Tuesday, January 14, filed by the Zimbabwe Lawyers for Human Rights (ZLHR) on behalf of the Harare Residents Trust (HRT).\n\nThe case seeks to address the governments failure to repair unsafe flyovers that pose a serious risk to residents of Harare.\n\nThe residents filed the application at the Harare High Court on February 15, 2024, requesting an order to compel the Minister of Transport and Infrastructural Development, Felix Mhona, to address the defects on three of the citys flyovers. The flyovers in question are located along Simon Mazorodze Road, Lytton Road, and Fidel Castro Road.\n\nThese defects were highlighted in a report dated July 27, 2012, which identified a range of issues that require urgent repair.\n\nHRT is calling on the High Court to order Minister Mhona to fix the defects within 90 days of the courts ruling, ensuring that the flyovers are safe for road users. The trust is also seeking a declaration that the ministers failure to address the defects violates the residents constitutional rights to a safe environment, as guaranteed under Section 73(1)(a) of the Constitution, which protects citizens from harm to their health and well-being.\n\nIn the application, HRT, through its legal representative Tonderai Bhatasara of ZLHR, and Loreen Mupesa, a Harare resident who frequently uses the flyovers, argue that the minister, as the official responsible for road maintenance and rehabilitation, is obligated to ensure public safety by maintaining safe roads.\n\nLoreen Mupesa expressed frustration, stating, The failure to address these issues puts our lives in danger. We cannot continue to wait while these defects remain unchecked. HRT, alongside Mupesa, criticized Minister Mhona for his failure to act, arguing that the neglected flyovers have become increasingly unsafe with each passing day.\n\nThe defects were first identified by officials from the Ministry of Transport and Infrastructural Development and the City of Harare during a joint inspection, which led to the July 27, 2012, report. The report detailed numerous serious defects, including spalling concrete on the bottom flanges of beams, severe corrosion of reinforcement steel, visible cracks along the centerline deck, severely damaged expansion joints, excessive vibration of the superstructure, poor drainage, water leakage at expansion joints, and longitudinal cracks.\n\nDespite the fact that the Ministry of Transport acknowledged these defects in 2021 and pledged to rectify them, no repairs have been made. While the Ministry acknowledged the issues years ago, nothing has been done to fix them. The situation is getting worse, HRT stated in their application.\n\nThe residents and HRT are now seeking the intervention of the High Court to compel Minister Mhona to prioritize the repairs and eliminate the danger posed by the flyovers to motorists and pedestrians alike.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A High Court judge, Justice Never Katiyo, is set to hear an urgent application on Tuesday, January … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/mnangagwa-administration-sued-over-unsafe-flyovers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Administration Sued Over Unsafe Flyovers\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Walker Seeks Manchester City Exit",
            "url": "https://www.zimeye.net/2025/01/15/walker-seeks-manchester-city-exit/",
            "content": "Sports Correspondent\n\nManchester City manager Pep Guardiola has revealed that veteran defender Kyle Walker has requested to leave the club this month. Walker, 34, has 18 months remaining on his contract, but has expressed a desire to explore opportunities abroad as his career winds down.\n\nWalker has fallen out of favor in recent weeks, with Rico Lewis now preferred in the right-back position. He was notably absent from Citys squad for their 8-0 FA Cup win over Salford City.\n\nGuardiola confirmed Walkers request, stating: Kyle is not here because two days ago he asked to explore the option to play abroad I prefer to play other players whose mind is here. The manager also hinted that Walkers departure could be imminent, saying: Maybe I am wrong, but I am pretty convinced that you should keep no-one who doesnt want to be here.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Manchester City manager Pep Guardiola has revealed that veteran defender Kyle Walker has requested to leave the club … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/walker-seeks-manchester-city-exit/\">Continue reading<span class=\"screen-reader-text\"> \"Walker Seeks Manchester City Exit\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        },
        {
            "title": "Shandirwa Leaves DeMbare",
            "url": "https://www.zimeye.net/2025/01/15/shandirwa-leaves-dembare/",
            "content": "Sports Correspondent\n\nDynamos Football Club has announced the departure of two key players, Issa Sadiki and Tanaka Shandirwa, who have returned to their parent club, Yadah FC, following the expiration of their loan contracts.\n\nIn a statement, Dynamos confirmed the duos departure, wishing them well in their future endeavors. We can confirm that midfielder Tanaka Shandirwa and winger Issah Sadiki have returned to their parent club Yadah FC after the end of their loan spell with the Glamour Boys, the statement read.\n\nShandirwas return to Yadah FC comes amidst controversy surrounding his pre-contract signing with CAPS United in November.\n\nCAPS United had hoped to secure the players services on a free transfer in 2025, but Yadah FC disputed the pre-contract, claiming Shandirwa still had a valid contract with them.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos Football Club has announced the departure of two key players, Issa Sadiki and Tanaka Shandirwa, who have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/15/shandirwa-leaves-dembare/\">Continue reading<span class=\"screen-reader-text\"> \"Shandirwa Leaves DeMbare\"</span></a></p>",
            "time": "21:26",
            "date": "15 Jan 2025"
        }
    ]
}