{
    "news": [
        {
            "title": "Coup Fears Surge As Army Tanks Continue ‘Drills’",
            "url": "https://www.zimeye.net/2025/02/20/coup-fears-surge/",
            "content": "ByMunachoGwanda-TheZimbabwe National Army has responded to rising speculation following the presence of military tanks on the streets of Harare.\n\nDeputy Army spokesperson Lieutenant Colonel Tichafa Mungofa told VOAsStudio 7that the military was conducting routine drills.\n\nIts a normal exercise that the Army usually undertakes, and this is one of them. This is an ongoing exercise, and I think it will end tomorrow (Thursday), he said.\n\nHowever, more than 20 military tanks were spotted in Harares Borrowdale area, fueling fears of a possible coup, particularly amid deepening divisions within the ruling party.\n\nThe sudden and unusual movement of military hardware mirrors events leading up to the 2017 coup when soldiers first appeared in the streets before tanks were deployed to strategic locations, including Parliament and police stations, to disarm the police force, which had become Mugabes de facto paramilitary wing.\n\nThat coup, orchestrated by the Zimbabwe Defence Forces (ZDF) under then-General Constantino Chiwenga, was backed by key military figures such as the late Air Marshal Perrence Shiri and retired General Sibusiso Moyo.\n\nThe militarys intervention followed Mugabes decision to fire Mnangagwa as Vice President,a move seen as clearingthe way for his wife, Grace Mugabe, to seize power.\n\nMugabes ouster paved the way for Mnangagwa to assume the presidency, but growing unease within the ruling party has reignited fears of another military takeover.\n\nPresidential spokesperson George Charamba, posting under his pseudonymdhonzamusoro007on social media, insisted that the military tank movement was part of routine drills.\n\nDespite official dismissals, speculation persists that Vice President Chiwenga may have deployed the tanks to intimidate Mnangagwa amid their intensifying power struggle.\n\nChiwenga, who was in Mutare attending the funeral of Sekuru Leonard Mwatambandini Kashirithe father-in-law of Zanu PF National Chairperson and Minister ofDefence,Oppah Muchinguri-Kashirihas not publicly commented on the developments.\n\nAdding to the uncertainty, war veteran and Zanu PF Central Committee member Blessing Geza recently warned that war veterans would take drastic steps to remove Mnangagwa.\n\nHis remarks have intensified speculation that a military faction loyal to Chiwenga could be preparing to act.\n\nReports suggest that senior military officials and war veterans have held secret meetings to strategizeways to blockMnangagwas attempts to extend his rule beyond his current term under the controversial #ED2030 agenda.\n\nSources indicate that the rift between Mnangagwa and Chiwenga has reached a breaking point, with Chiwengas allies accusing Mnangagwa of reneging on a 2017 coup agreement that allegedly promised him the presidency after Mnangagwas first term.\n\nUnlike Mugabe in 2017, Mnangagwa has spent years consolidating power.\n\nHe has appointed loyalists to key military positions, purged Chiwenga allies, and neutralized potential rivals within Zanu PF.\n\nMany figures from the 2017 coup, including Perrence Shiri and Paradzai Zimondi, have died under suspicious circumstances, raising speculation that Mnangagwa orchestrated their eliminations to weaken Chiwengas support base.\n\nDespite thesemaneuvers, Chiwenga remains a formidable force within the security sector.\n\nReports suggest that a faction of the military and war veterans still consider him Zimbabwes rightful leader.\n\nA recent high-level meeting in Mashonaland Central, a province known for political upheavals, reportedly discussed growing discontent within the military and the possibility of drastic action against Mnangagwa.\n\nOne insider remarked: You hear what credible war veterans like Blessing Geza are saying.\n\nHe is not hallucinating; he is communicating a message from the script, and you must listen carefully.\n\nWhile Mnangagwa has fortified his grip on security and intelligence agencies, Zimbabwes political landscape remains unpredictable.\n\nIf discontent within the military reaches a tipping point, even a well-entrenched president can be overthrown.\n\nWith tensions between Mnangagwa and Chiwenga escalating and war veterans openly voicing their grievances, Zimbabwe may be on the verge of yet another military-led political upheaval.\n\nWhether the military presence is a precursor to a coup or merely routine drills, the coming weeks will be decisive in shaping Zimbabwes future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwanda-The Zimbabwe National Army has responded to rising speculation following the presence of military tanks on the streets of Harare. Deputy … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/coup-fears-surge/\">Continue reading<span class=\"screen-reader-text\"> \"Coup Fears Surge As Army Tanks Continue ‘Drills’\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Blessed Geza: Tatosvika Apa!, Musatamba NeSimba Revanhu, Don’t Play With People Power",
            "url": "https://www.zimeye.net/2025/02/20/blessed-geza-tatosvika-apa-musatamba-nesimba-revanhu-dont-play-with-people-power/",
            "content": "Blessed Geza makes it clear: we have arrived, usatambe nesimba revanhu- dont play with the power of the people | the feature message is packaged in this snippet compiled by@schikanzawho writes, One my roles like in the making of the Goldmafia Docu, is to listen to sources,pic.twitter.com/KyrreNum3r\n\nBlessed Geza makes it clear: we have arrived, usatambe nesimba revanhu- dont play with the power of the people | the feature message is packaged in this snippet compiled by @schikanza who writes, One my roles like in the making of the Goldmafia Docu, is to listen to sources, understand their cause, their language and interpret their song. This is how the Geza story is quickly told.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Blessed Geza makes it clear: we have arrived, usatambe nesimba revanhu- don’t play with the power of the people | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/blessed-geza-tatosvika-apa-musatamba-nesimba-revanhu-dont-play-with-people-power/\">Continue reading<span class=\"screen-reader-text\"> \"Blessed Geza: Tatosvika Apa!, Musatamba NeSimba Revanhu, Don’t Play With People Power\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "National Disability Policy Faces Scrutiny As Citizens Call For Accessible Buildings",
            "url": "https://www.zimeye.net/2025/02/20/national-disability-policy-faces-scrutiny-as-citizens-call-for-accessible-buildings/",
            "content": "By A Correspondent\n\nPersons with disabilities in Zimbabwe are advocating for increased inclusivity in the design and construction of public spaces, citing significant obstacles in accessing buildings due to a lack of essential accessibility features.\n\nIn Harare, navigating the city can be a challenging experience for individuals with disabilities, as many buildings fail to accommodate their needs, limiting their ability to move freely and independently.\n\nSeveral individuals shared their personal experiences with ZBC News, stressing the urgent need for better accessibility in public infrastructure. One individual noted, Some of the buildings are not accessible. There still is a need to do more. We need facilities to put up ramps for us, brailles, and side handles for assistance. Moving about the CBD is quite challenging at the moment. You just end up having to get used to these places, otherwise they are not accessible.\n\nAdditionally, challenges extend beyond just basic building access. Sometimes we want to buy our daily necessities from shops in the CBD, but the stores are not accessible. We are facing similar difficulties in entertainment and sports industries. We cannot access the facilities there. We need the government to assist us, another person with disabilities explained.\n\nSupporting this call for change is Mrs. Joyce Matara, acting executive director of the National Association of Societies for the Care of the Handicapped. She advocates for more accessibility in building design, sharing that the organization has begun an initiative to inspect buildings for accessibility. We assist and point out what is lacking. We came up with guidelines and checklists, and we are currently doing this for free in Harare. There is a need for people to understand that accessibility goes beyond ramps and lifts. Buildings must be properly designed to ensure they are usable. Most buildings today are not accessible for persons with disabilities, yet they are a part of our society, Matara said.\n\nThe call for disability-friendly buildings aligns with the National Disability Policy of 2021, which mandates that all public facilities and buildings be accessible to persons with disabilities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Persons with disabilities in Zimbabwe are advocating for increased inclusivity in the design and construction of public … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/national-disability-policy-faces-scrutiny-as-citizens-call-for-accessible-buildings/\">Continue reading<span class=\"screen-reader-text\"> \"National Disability Policy Faces Scrutiny As Citizens Call For Accessible Buildings\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Warriors Can Reach New Heights – Mhofu",
            "url": "https://www.zimeye.net/2025/02/20/warriors-can-reach-new-heights-mhofu/",
            "content": "Sports Correspondent\n\nFormer Zimbabwe national team coach, Sunday Chidzambwa, also known as Mhofu, is optimistic about the Warriors chances in the upcoming Africa Cup of Nations. He believes the current young and talented squad has the potential to go beyond the group phase for the first time.\n\nThis is our sixth time qualifying, and Im confident we can make history, Mhofu said. Being the underdogs will work to our advantage, and were in a better position to upset Bafana Bafana.\n\nMhofu warned that Zimbabwe should not be underestimated by their opponents, including Egypt and Angola. Football is stubborn, and anyone who looks down on us does so at their own risk, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Zimbabwe national team coach, Sunday Chidzambwa, also known as Mhofu, is optimistic about the Warriors’ chances in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/warriors-can-reach-new-heights-mhofu/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Can Reach New Heights – Mhofu\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "David Coltart Challenges Trump’s “Dictator” Label on Zelensky",
            "url": "https://www.zimeye.net/2025/02/20/david-coltart-challenges-trumps-dictator-label-on-zelensky/",
            "content": "By A Correspondent | ZimEye | Bulawayo mayor and human rights lawyer David Coltart has weighed in on former U.S. President Donald J. Trumps controversial statement regarding Ukrainian President Volodymyr Zelensky, in which Trump labeled Zelensky a dictator due to Ukraines lack of elections since Russias invasion.\n\nIn a pointed response, Coltart drew a historical parallel with World War II, highlighting that while the United Kingdom held elections during the war, it did not conduct a general election. The last general election before the war was in 1935, and the next only occurred in July 1945, following the wars end. During the conflict, Britain was governed by a wartime coalition government led by Winston Churchill, comprising the Conservative, Labour, and Liberal parties. The general election due in 1940 was postponed under the Emergency Powers (Defence) Act.\n\nNo one would ever have called Churchill a dictator simply because he didnt hold an election during World War 2, Coltart emphasized, countering Trumps assertion.\n\nHe noted that while the USA held elections during World War II, it was never under the direct threat of invasion, unlike Ukraine, which faces the harsh reality of 20% of its UN-recognized territory under Russian control and routine rocket and drone attacks.\n\nIt is, in my opinion, unreasonable to expect Ukraine to hold a general election during the war, Coltart stated. How a country can hold free and fair elections in this context is beyond me.\n\nTrumps original statement, shared widely on social media, criticized the Biden administration for spending $350 billion on Ukraines war effort, suggesting Zelensky mismanaged funds and alleging he played President Joe Biden like a fiddle. He further implied that only his leadership could negotiate an end to the war with Russia.\n\nColtarts response is gaining traction, with many observers noting the historical precedent and the complexities of holding elections in wartime. The debate underscores the broader geopolitical tensions and the scrutiny over international support for Ukraine amid its ongoing conflict with Russia.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Bulawayo mayor and human rights lawyer David Coltart has weighed in on former U.S. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/david-coltart-challenges-trumps-dictator-label-on-zelensky/\">Continue reading<span class=\"screen-reader-text\"> \"David Coltart Challenges Trump’s “Dictator” Label on Zelensky\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Schoolchildren Lured into Drug Initiation Parties: Police Uncover Sinister Plot",
            "url": "https://www.zimeye.net/2025/02/20/schoolchildren-lured-into-drug-initiation-parties-police-uncover-sinister-plot/",
            "content": "Police Raids in Bulawayo Uncover Drug Ring Involving Minors and Adults\n\nBulawayo, Zimbabwe  Separate crackdowns by the Criminal Investigations Department (CID) and the Vehicle Theft Squad (VTS) in Bulawayos western suburbs and the city centre have led to the arrest of several suspects, including minors, in connection with dangerous drugs and substances.\n\nThe raids, conducted in Entumbane, Njube, and the central business district, resulted in the seizure of a significant amount of Broncleer cough syrup, marijuana, and crystal meth. Shockingly, those arrested included a 12-year-old Grade Seven girl, a 14-year-old Form Two boy, and an 18-year-old Form Three female, highlighting the growing crisis of drug abuse among schoolchildren.\n\nDisturbing Details Emerge\n\nOne of the arrested individuals, a security guard and a resident of Entumbane, was allegedly hosting drug initiation parties for children as young as 12 years old. During the raids, police discovered schoolchildren, school dropouts, and adults engaging in illegal activities at his residence.\n\nAmong the suspects is Elliot Ndlovu (24), who had reportedly intimidated Entumbane residents by claiming he was untouchable by the police. Bulawayo provincial acting police spokesperson, Assistant Inspector Nomalanga Msebele, dismissed Ndlovus claims, stating, There is no one above the law.\n\nArrested Suspects and Seized Drugs\n\nThe police paraded the arrested suspects and confiscated drugs at the Bulawayo Central Police Station. The arrested suspects include:Ashley Richardson (22) from NjubeThomas Phiri (19) from EntumbaneRonald Ncube (24) from EmganwiniNtuntuko Masuku (20) of EntumbaneMichael Ncube (34), address unknownNikita Mhlanga (36), accused of hosting vuzu parties and selling drugs to schoolchildren\n\nSeveral juveniles, including a 17-year-old school dropout and a 17-year-old Form Three student, were also detained but later released into the custody of their parents or guardians.\n\nOngoing Investigations\n\nThe crackdown followed a tip-off from vigilant community members and police intelligence. Authorities believe that most drug peddlers in Bulawayo are aged between 19 and 25 years.\n\nLast Friday, police arrested four more suspected drug dealers, including Aubrey Muchenje, Sylvester Moyo, Elton Ndlovu, and Owen Muchenje, after a community tip-off. The arrests led to the recovery of 40 bottles of Broncleer cough syrup, 1 kilogram of marijuana, and sachets of crystal meth.\n\nCourt Appearance Scheduled\n\nThe suspects, including the alleged drug dealer Nikita Mhlanga, are expected to appear in court on Thursday. Police have assured the public of their commitment to eradicating drug abuse and called for continued community cooperation.\n\nCommunity Commended\n\nAssistant Inspector Msebele praised the Entumbane and Njube residents for their courage in reporting illegal activities despite threats and intimidation from drug dealers. She emphasized, As police, we want to assure the public that information supplied to us will be acted upon in confidence.\n\nThe raids mark a significant step in Bulawayos fight against drug trafficking and substance abuse, with authorities pledging to maintain pressure on drug networks and ensure the safety of the citys young population.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Police Raids in Bulawayo Uncover Drug Ring Involving Minors and Adults Bulawayo, Zimbabwe — Separate crackdowns by the Criminal Investigations … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/schoolchildren-lured-into-drug-initiation-parties-police-uncover-sinister-plot/\">Continue reading<span class=\"screen-reader-text\"> \"Schoolchildren Lured into Drug Initiation Parties: Police Uncover Sinister Plot\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Harare Blows US$1.4 Million On Non-Existent Property",
            "url": "https://www.zimeye.net/2025/02/20/harare-blows-us1-4-million-on-non-existent-property/",
            "content": "In a shocking revelation, a forensic audit dated August 11, 2023, has uncovered significant financial mismanagement within the Harare Municipal Medical Aid Society (HMMAS). The audit report indicates that HMMAS purchased a US$1.4 million property but never took possession of it. Instead, the property was later sold under unclear circumstances, and the municipality did not recover its funds.\n\nThe audit exposed multiple anomalies, including overpricing and double payment of a property in Ruwa, resulting in a further US$1.2 million loss. Additionally, properties were acquired without obtaining title deeds, complicating efforts to trace these assets.\n\nThe report highlights alarming financial discrepancies, including a former CEO personally collecting subscription payments worth US$246,500, which were never recorded by the cashier. The audit also revealed questionable conveyancing fees of US$300,000far exceeding standard ratesduring the property transactions.\n\nThe property in question was initially purchased from Everleigh Services Private Limited through AfrAsia Bank in 2015. Despite the full payment, HMMAS never took ownership, and the property was subsequently sold to Cheetah Express Logistics Private Limited in 2018, resulting in a total loss of US$1.7 million.\n\nFurther irregularities include a staggering overpayment of US$550,000 for equipment valued at just US$100,000 during the purchase of Fortress Hospital. The audit exposes significant financial prejudice and raises serious concerns about accountability and governance within HMMAS.\n\nThe unfolding scandal has prompted calls for a thorough investigation to hold those responsible accountable and recover the lost funds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In a shocking revelation, a forensic audit dated August 11, 2023, has uncovered significant financial mismanagement within the Harare Municipal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/harare-blows-us1-4-million-on-non-existent-property/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Blows US$1.4 Million On Non-Existent Property\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Man Rapes Mentally Challenged Daughter",
            "url": "https://www.zimeye.net/2025/02/20/man-rapes-mentally-challenged-daughter/",
            "content": "By A Correspondent\n\nA 61-year-old self-employed man from Upper Rangemore, Bulawayo, has been sentenced to 20 years in prison by the Bulawayo Magistrates Court for the rape of his mentally incapacitated stepdaughter.\n\nThe sentence was handed down after the accused was found guilty of the crime which took place on November 21, 2024.\n\nAccording to the details presented in court, the accused unlawfully had sexual intercourse with his 24-year-old stepdaughter, who is legally incapable of giving consent due to her mental condition.\n\nThe incident occurred at the family home at approximately 3:00 PM.\n\nThe court heard that the accused, who is the stepfather of the complainant, assaulted her while she was asleep.\n\nHe covered her mouth and nose to restrain her, before proceeding with the assault.\n\nThe victim, unable to resist due to her mental condition, later disclosed the incident to a family member, leading to investigations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 61-year-old self-employed man from Upper Rangemore, Bulawayo, has been sentenced to 20 years in prison by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/man-rapes-mentally-challenged-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Man Rapes Mentally Challenged Daughter\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mine Workers Petition Chinese Ambassador Over Abuse Of Local Employees",
            "url": "https://www.zimeye.net/2025/02/20/mine-workers-petition-chinese-ambassador-over-abuse-of-local-employees/",
            "content": "The Chinese Ambassador\n\nYour excellencyWe are a trade union, National Mine Workers Union of Zimbabwe which represents workers in the mining sector.\n\nWe are writing this petition letter after taking into consideration the increasing number of workers abuse and blatant disregard of labour laws by all Chinese nationals on Zimbabwe mining workers who are our constituency we represent.\n\nThe research we have done as a trade union has revealed that some Chinese management in the mining sector are exposing local workers to slavery working conditions.\n\nBelow is the list of companies which we found to be engaging in unfair labour practices across the country.1 Rundu Mine Chegutu2 Dinson Mine Manhidze Mashonaland East3 Dinson Mine Mutare4 Dinson Mine Hwange5 Young Africa Shurugwi6 Leview Mine Penhalonga7 Lang Chang Odzi8 KMC Harare9 Best trade Muzondiwa Zvishavane10Best Trade Marishonga Shurugwi11 Goldmore Nyathi Bulawayo12 Ching She kwekwe13 Ndarama ching14 DGL nyathi Bulawayo15 Sino Ferry Shurugwi16Ladville Shurugwi17 Chengete ching Boterengwa Shurugwi18 Best Copy Lalapanzi19 Zimbabwe coking coal Company20 Ming Chang Makaha21 Ming Chang Kwekwe22 Ming Chang Mashava\n\nWe have instances where workers in the sector are being under paid, working under inhuman conditions, the Chinese employers in most instances not giving employees the requisite protective material, thereby compromising their health and safety- a yardstick to Zimbabwes Labour law.\n\nWhat irks us most as a trade union is that there have been reports across the mining sector where workers are beaten, dehumanised, threatened and even killed upon asking for their wages dues.They also dont allow workers to join unions which is violation of international labour standards.This has been reported in the local media.\n\nWe are therefore requesting your esteemed office to investigate violation of Zimbabwe laws by these Chinese officials in the mining sector and take appropriate measures.We believe that this will promote industrial harmony and economic growth in the country.\n\nWe are dismayed that if the trend of abuse of local employees in the mining sector continues we will be left with no other option except to picket at your embassy we are patriotic sons and daughters of Zimbabwe and we will not tolerate things likely to destabilise our nation and cause instability in the country and have economic repercussions in the mining sector,which is one of the backbone of the countrys economy. We believe workers are the backbone of this nation if they cant breathe well be left with no option except to defend our zones of autonomy as employees and as a union.\n\nWe will be very grateful if you take note of our concerns.\n\nYours Sincerely\n\nKurebwa Javangwe Nhomboka\n\nNational Mine Workers Union of ZimbabwePresident\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Chinese Ambassador Your excellencyWe are a trade union, National Mine Workers Union of Zimbabwe which represents workers in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/mine-workers-petition-chinese-ambassador-over-abuse-of-local-employees/\">Continue reading<span class=\"screen-reader-text\"> \"Mine Workers Petition Chinese Ambassador Over Abuse Of Local Employees\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Married Teacher Dies At Lover’s House",
            "url": "https://www.zimeye.net/2025/02/20/married-teacher-dies-at-lovers-house/",
            "content": "By A Correspondent\n\nA 50-year-old married teacher, Nyasha Gambe, from Mutimwi Secondary School in Zaka, died at his alleged girlfriends house, it has emerged.\n\nAccording to police in Zaka, Gambe had contacted his girlfriend, Laina Chimutsa (34), around 10:30 PM, stating his intention to spend the night.He called saying he wanted to stay over.\n\nThe lover reportedly told police :He started feeling weak and lost control of himself. I was so scared.\n\nChimutsa immediately contacted Gambes younger brother, who rushed to the scene and helped transport him to Ndanga District Hospital.\n\nUnfortunately, Gambe was pronounced dead on arrival.\n\nThe cause of death is still unclear, and police are investigating the circumstances surrounding the incident.\n\nA source close to the matter attributed Gambes death to neglecting his medication for high blood pressure and diabetes, exacerbated by excessive alcohol consumption on the day of the incident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 50-year-old married teacher, Nyasha Gambe, from Mutimwi Secondary School in Zaka, died at his alleged girlfriend’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/20/married-teacher-dies-at-lovers-house/\">Continue reading<span class=\"screen-reader-text\"> \"Married Teacher Dies At Lover’s House\"</span></a></p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        }
    ]
}