{
    "news": [
        {
            "title": "Leaked Video Of Kaycee Predicting Own Death With Mystery Woman",
            "url": "https://www.zimeye.net/2025/06/13/leaked-video-of-kaycee-predicting-own-death-with-mystery-woman/",
            "content": "videos loading below.\n\nWoman: LAUGH LAUGH-aaya! Haufe Iwe. Ndimi muchafa  here?; Iwe hausati waakufa!\n\nKaycee(Kudzaishe Chipadza): INAUDIBLE.\n\nWoman: handina fuel!\n\nKayce: Aaah. You dont have fuel. Mpho: Handina fuel.\n\nKaycee:  I will put fuel to go and come back.\n\nMpho:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "videos loading below…. Woman: LAUGH LAUGH-aaya! Haufe Iwe. Ndimi muchafa here?; Iwe hausati waakufa! Kaycee(Kudzaishe Chipadza): INAUDIBLE. Woman: handina fuel! … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/leaked-video-of-kaycee-predicting-own-death-with-mystery-woman/\">Continue reading<span class=\"screen-reader-text\"> \"Leaked Video Of Kaycee Predicting Own Death With Mystery Woman\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "Former ZBC Engineer Dies",
            "url": "https://www.zimeye.net/2025/06/13/former-zbc-engineer-dies/",
            "content": "By A Correspondent-Former Zimbabwe Broadcasting Corporation (ZBC) engineer,Golden Pfungwa Kapungu, has died.\n\nKapungu passed away on9 June 2025, at the age of  73.\n\nKapungu, a respected veteran of the broadcasting industry, was remembered by former colleagues and media practitioners, who took to social media on Friday to mourn his passing.\n\nMessages of condolence described him as a dedicated professional and a humble mentor who contributed immensely to the development of Zimbabwes national broadcasting infrastructure.\n\nBorn on24 November 1951, Kapungu served during a transformative period for the national broadcaster, helping usher in the technological shifts that shaped radio and television operations at ZBC.\n\nWhile the cause of his death was not immediately disclosed, tributes continue to pour in from those who worked alongside him.\n\nA memorial programme titledOrder of Serviceis scheduled for1213 June 2025, according to a notice shared with family and friends.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Former Zimbabwe Broadcasting Corporation (ZBC) engineer, Golden Pfungwa Kapungu, has died. Kapungu passed away on 9 June 2025, at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/former-zbc-engineer-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Former ZBC Engineer Dies\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "Lungu Family Dangles Corpse To Negotiate Dropping Police Charges",
            "url": "https://www.zimeye.net/2025/06/13/tricky-demands-stalls-lungu-repatriation-negotiations/",
            "content": "Tricky Demands Stall Lungu Repatriation Negotiations\n\nBy A Correspondent- Tricky demands have stalled negotiations between the Zambian government and the family of the late former President Edgar Chagwa Lungu over the repatriation of his body.\n\nFriday, Vice President Constantino Chiwenga travelled to Lusaka to mourn with the Government of Zambia.\n\nZambia played a pivotal role in the liberation of Zimbabwe through its support of ZAPU and ZPRA forces.\n\nA number of Zimbabweans lost their lives on Zambian soil during the liberation struggle. During the era of Southern and Northern Rhodesia, many Zambians worked in what is now Zimbabwe.\n\nSince independence, trade between the two countries has flourished.The late Edgar Lungu was very close to the late President Robert Mugabe and the current President Emmerson Dambudzo Mnangagwa, who assigned VP Chiwenga to pay a courtesy visit in honour of Lungu.\n\nSources have revealed that Tasila Lungu and her family are allegedly withholding the body of the former president until the government agrees to drop all criminal charges against them.\n\nLungus party spokesman Emmanuel Mwamba avoided answering questions regarding the money laundering cases during a phone interview with ZimEyes Simba Chikanza, dismissing them as partisan issues in Zimbabwe.\n\nThe Lungu family is reportedly demanding the dropping of all charges and the restoration of property ownership papers.\n\nAn officer stationed at one of the properties told ZimEye that they are confident the family will be cleared soon.\n\nThe matter is still in the courts, and they are fighting, said the official, who asked not to be named for their safety.\n\nHowever, the Zambian government has firmly stated that the executive cannot interfere with judicial processes, resulting in a deadlock.\n\nSources close to the tense negotiations say that one of the conditions being pushed by the Lungu familybefore agreeing to the repatriation of the former presidents remains for a state funeralis a blanket amnesty on all ongoing court cases involving family members.\n\nAt the forefront of the Lungu camp is Chawama Member of Parliament Tasila Lungu, accompanied by lawyers Jonas Zimba and family spokesperson Makebi Zulu.\n\nRepresenting the government in the sensitive negotiations are former Vice President Enoch Kavindele, former Secretary to the Cabinet Leslie Mbula, and current Secretary to the Cabinet Patrick Kangwa.\n\nThe standoff comes amid mounting legal troubles engulfing nearly every member of the former presidents immediate family.\n\nTasila, the political face of the family, is under investigation for alleged acquisition of properties suspected to be proceeds of crime.\n\nHer mother, former First Lady Esther Lungu, and siblings Chiyeso and Daliso Lungu, have also come under scrutiny for alleged possession of unlawfully acquired property.\n\nChiyeso, a lawyer, lost two properties, including a lucrative plot in State Lodge, after the EFCC declared them proceeds of crime.\n\nHer claim that the assets were gifts from her parents was rejected by the courts.\n\nEsther Lungus name appears in multiple forfeiture proceedings, including a case where she faces charges of stealing three motor vehicles, unlawful possession of US$400,000, and illicit acquisition of land.\n\nOn 31 May 2024, she was arrested and briefly detained on money laundering charges related to 15 flats before being released on bond.\n\nMeanwhile, Dalitso Lungu, the former presidents son, is facing possible forfeiture of over 80 vehicles, 16 properties, and an entire companyassets estimated to be worth K31 million. The EFCCs case against him is awaiting judgment.\n\nFollowing President Lungus death in a South African hospital last week, the Zambian government declared a seven-day national mourning period and anticipated that his body would arrive midweek for a state funeral and burial at the presidential burial site.\n\nHowever, the family disrupted these plans.\n\nAt a memorial service in Pretoria on Tuesday, family spokesperson Makebi Zulu shocked mourners by announcing that the body would not arrive as planned and that a new date would be announced later.\n\nZulu said the family found it difficult to engage with the State on arrangements for mourning the former president. He added that the family had arranged private repatriation of the remains in accordance with what they say were Lungus final wishesincluding that President Hakainde Hichilema should not be involved in any part of the funeral proceedings.\n\nHe accused the government of shifting its position during negotiations and undermining the familys right to oversee the funeral.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tricky Demands Stall Lungu Repatriation Negotiations By A Correspondent- Tricky demands have stalled negotiations between the Zambian government and the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/tricky-demands-stalls-lungu-repatriation-negotiations/\">Continue reading<span class=\"screen-reader-text\"> \"Lungu Family Dangles Corpse To Negotiate Dropping Police Charges\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "Tsenengamu Reveals He Was Duping People Supporting Geza When He’s Bouncing Back to Mnangagwa",
            "url": "https://www.zimeye.net/2025/06/13/tsenengamu-reveals-he-was-duping-people-supporting-geza-when-hes-bouncing-back-to-mnangagwa/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "Charamba Mocking VP Chiwenga? Cryptic Tweet Sparks Speculation Amid Frosty Regional Relations",
            "url": "https://www.zimeye.net/2025/06/13/charamba-mocking-chiwenga-cryptic-tweet-sparks-speculation-amid-frosty-regional-relations/",
            "content": "By A Correspondnt-Presidential spokesperson George Charamba has sparked a political storm with a cryptic tweet that appears to mock Vice President Constantino Chiwenga, amid rising tensions within Zimbabwes ruling elite and frosty relations with neighbouring Zambia.\n\nCharamba, who tweets under the handle@Jamwanda2, posted a photo of Vice President Chiwenga warmly shaking hands with Zambian President Hakainde Hichilema. The caption read:SOME DAY THE HISTORY SHALL BE WRITTEN. FOR NOW, PICTURES!!!!!\n\nWhile the post may appear innocuous to the casual observer, political analysts and social media users quickly noted its deeper political undertonesespecially considering Charambas recent history of publicly attacking Hichilema and other regional opposition leaders.\n\nIn previous tweets, Charamba labelled Hichilema, South African opposition leader Mmusi Maimane, and Zimbabwes former opposition leader Nelson Chamisa as Zvivatengesi  a Shona word for traitors or sell-outs. He accused them of being Western puppets pushing regime change agendas against Southern African liberation movements.\n\nNow, with Chiwenga seen fraternizing with one of Charambas most vilified traitors, questions are being raised about whether Charambas tweet is a subtle jab at the Vice President.\n\nCharamba is using sarcasm to expose what he sees as hypocrisy or a betrayal of the Zanu PF nationalist stance, said a Harare-based political analyst. Remember, Hichilema has been cast by the Zimbabwean state media as hostile to the Harare administration. For Chiwenga to be pictured so comfortably with him is politically loaded.\n\nThe meeting between Chiwenga and Hichilema is reported to have taken place during an official regional engagement, but the body language capturedfriendly smiles and a firm handshakeadds to the speculation that it was more than just diplomatic protocol.\n\nCharambas tweet comes at a time when the Vice President is rumoured to be consolidating power ahead of the Zanu PF elective congress, with some insiders alleging a widening rift between President Emmerson Mnangagwa and his deputy. This tweet could be interpreted as a warning shot or even an attempt to embarrass Chiwenga in the eyes of party hardliners.\n\nAdding fuel to the fire is Charambas well-known penchant for cryptic messaging. As a seasoned propagandist and former Permanent Secretary in the Ministry of Information, Charamba rarely tweets without purpose. His posts often blend sarcasm, coded messages, and historical allusions designed to signal deeper political currents within the state.\n\nAlthough no official explanation has been given for the tweet, the timing and tone are tellingespecially given the ongoing tensions between Harare and Lusaka, where Zimbabwe has accused Hichilemas government of harbouring opposition activists and meddling in Zimbabwean affairs. Zambia denies these allegations.\n\nFor now, observers are left to read between the lines. As Charamba himself posted:For now, pictures.But in Zimbabwes charged political climate, a pictureespecially one tweeted by the Presidents mouthpiececan speak volumes.\n\nSOME DAY THE HISTORY SHALL BE WRITTEN. FOR NOW, PICTURES!!!!!pic.twitter.com/ZzYvKqUAhF\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondnt-Presidential spokesperson George Charamba has sparked a political storm with a cryptic tweet that appears to mock Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/charamba-mocking-chiwenga-cryptic-tweet-sparks-speculation-amid-frosty-regional-relations/\">Continue reading<span class=\"screen-reader-text\"> \"Charamba Mocking VP Chiwenga? Cryptic Tweet Sparks Speculation Amid Frosty Regional Relations\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "DeMbare Pull Out Of CAF Confederation Cup",
            "url": "https://www.zimeye.net/2025/06/13/dembare-pull-out-of-caf-confederation-cup/",
            "content": "Zimbabwean football powerhouse Dynamos FC, affectionately known as DeMbare, has announced its withdrawal from the 2025 CAF Confederation Cup, citing lack of readiness for continental competition.\n\nIn a statement released on Friday, June 13, 2025, the Harare-based giants expressed regret over the decision but emphasized the importance of strategic planning and development over participation for its own sake.\n\nAfter thorough evaluation, it has been determined that the club is not yet fully prepared to compete at continental level this year, the club said. While it has been a painstaking decision, we believe it is in the best interest of the team and everyone associated with Dynamos to focus on strengthening its readiness for future competitions.\n\nThe announcement underscores a shift in focus for Dynamos FC, once a dominant force in Zimbabwean and African football. Once regular participants in CAF tournaments, the club has struggled in recent years to replicate its past successes. Critics have pointed to inconsistent performances, financial constraints, and managerial instability as factors contributing to the teams decline on the regional scene.\n\nDespite the setback, the club remains optimistic about the future. We remain committed to our long-term development goals and appreciate your continued support as we work towards enhancing our clubs competitiveness on both the local and continental stage, the statement continued.\n\nSupporters and stakeholders have been urged to stand by the team during this period of rebuilding, with club officials promising a stronger comeback in the years to come.\n\nWe look forward to future opportunities to represent our country with honour and pride and we pledge to return to the continental stage even stronger, concluded the statement.\n\nDynamos withdrawal leaves a gap in Zimbabwes continental representation for the upcoming CAF Confederation Cup, but also signals a broader conversation around club preparedness and the investment required to compete at the highest level.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabwean football powerhouse Dynamos FC, affectionately known as DeMbare, has announced its withdrawal from the 2025 CAF Confederation Cup, citing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/dembare-pull-out-of-caf-confederation-cup/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Pull Out Of CAF Confederation Cup\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "Matabeleland Chiefs meet  over Gukurahundi Genocide",
            "url": "https://www.zimeye.net/2025/06/13/matabeleland-chiefs-meet-over-gukurahundi-genocide/",
            "content": "Chief Mtshana Khumalo\n\nAll Traditional Leader from Matabeleland North and South with two rapporteurs are checking in today at the Rainbow Hotel for a Gukurahundi Genocide Outreach program.According to Sources, the one day meeting is scheduled to be held on Saturday 14 to finalize plans of the Gukurahundi outreach program that was supposed ro start on Monday but the government postponed the program due to budgetary challenges.Chiefs are going to review feedback of the awareness meetings that took place under their jurisdiction in the past three weeks.The Chiefs re supposed to meet, approve and guide the roll out of the program and train their rapporteurs on how to capture and document testimonies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chief Mtshana Khumalo All Traditional Leader from Matabeleland North and South with two rapporteurs are checking in today at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/matabeleland-chiefs-meet-over-gukurahundi-genocide/\">Continue reading<span class=\"screen-reader-text\"> \"Matabeleland Chiefs meet  over Gukurahundi Genocide\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "Madam Boss Drops Heathrow Pose In Los Angeles",
            "url": "https://www.zimeye.net/2025/06/13/madam-boss-drops-heathrow-pose-in-los-angeles/",
            "content": "By Showbiz Reporter | The sociallite Madam Boss dropped a Heathrow snarl while in Los Angeles, on Friday afternoon.\n\nTyra Chikocho is concluding her visit to the US during her campaign against online bullying.\n\nShe wrote:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter | The sociallite Madam Boss dropped a “Heathrow snarl” while in Los Angeles, on Friday afternoon. Tyra … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/madam-boss-drops-heathrow-pose-in-los-angeles/\">Continue reading<span class=\"screen-reader-text\"> \"Madam Boss Drops Heathrow Pose In Los Angeles\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "Official: Kevin De Bruyne Joins Napoli on Free Transfer",
            "url": "https://www.zimeye.net/2025/06/13/official-kevin-de-bruyne-joins-napoli-on-free-transfer/",
            "content": "Sports Correspondent\n\nNapoli have officially announced the stunning signing of Belgian midfield maestro Kevin De Bruyne on a free transfer.\n\nThe 33-year-old departs Manchester City after a glittering career that saw him win multiple Premier League titles, FA Cups, and a UEFA Champions League trophy. De Bruyne, widely regarded as one of the finest midfielders of his generation, brings world-class experience and creativity to the Serie A side.\n\nHis move to Napoli marks the end of a nine-year spell at City and is being hailed as one of the most high-profile free transfers in recent football history.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Napoli have officially announced the stunning signing of Belgian midfield maestro Kevin De Bruyne on a free transfer. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/official-kevin-de-bruyne-joins-napoli-on-free-transfer/\">Continue reading<span class=\"screen-reader-text\"> \"Official: Kevin De Bruyne Joins Napoli on Free Transfer\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        },
        {
            "title": "New political party formed in Zimbabwe",
            "url": "https://www.zimeye.net/2025/06/13/new-political-party-formed-in-zimbabwe/",
            "content": "A new political party, Original ZAPU has been formed and is scheduled to be officially launched tomorrow in Bulawayo at the Small City Hall.\n\nThe interim President of Original ZAPU. Mathew Sibanda revealed this during Dumiso Dabengwa Memorial Service in Ntabazinduna.\n\nWe are now registered with the Zimbabwe Electoral Commission and we are working hard towards reviving  ZAPU following the handing over of the party to an individual who has failed to build the party, said Sibanda.\n\nStylish Magida said that they are working hard to restore the gains of independence and revive the economy.\n\nZimbabwes glory is slowly diminishing in the hands of a single person who is oppressing citizens and appointing his children to higher gvt positions,  said Magida.\n\nNkululeko Ndlovu, a villager in Ntabazindu Said that they no longer feel like Zimbabweans.\n\nl stay here in Ntabazinduna but the government has neglected us. Ndlovu said\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A new political party, Original ZAPU has been formed and is scheduled to be officially launched tomorrow in Bulawayo at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/13/new-political-party-formed-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"New political party formed in Zimbabwe\"</span></a></p>",
            "time": "21:46",
            "date": "14 Jun 2025"
        }
    ]
}