{
    "news": [
        {
            "title": "BREAKING: Confronted By Marry, Kawondera Refuses Face-To-Face With Mubaiwa After Using Ollah To Accuse Her Of Not Knowing Ginimbi, Plus Cutting Shingi Off",
            "url": "https://www.zimeye.net/2025/07/12/breaking-confronted-by-marry-kawondera-refuses-face-to-face-with-mubaiwa-after-using-ollah-to-accuse-her-of-not-knowing-ginimbi-plus-cutting-shingi-off/",
            "content": "By Simba Chikanza | The retired footballer, Shingi Kawondera has responded to a challenge by his ex wife Marry Mubaiwa to debate allegations he recently uttered against her character through a podcast.\n\nIn video footage streamed during the week, Kawondera accused the mother of his child, of cutting off his wealth, and of aiding in (alleged Genius Kadungure engineered) forgery he says robbed him of his company, Pioneer Gas. He also said Marry and the late sociallite Kadungure (popularly known as Ginimbi) did not know each other till the day he (Kawondera) introduced them to each other.\n\nBREAKING  KAWONDERA AVOIDS MARRY MUBAIWA FACE TO FACE INTERVIEWhttps://t.co/sZZPX3mHKX\n\nBefore, ndisati ndadaro, vaisazivanaVakatozotanga kuzivana through inini, he said in Shona.\n\nResponding to questions by ZimEye, Mubaiwa expresses shock over things Kawondera has alleged. (The full Mubaiwa interview follows.)\n\nShe loses control of speech in laughter at everything Kawondera has uttered just as she also dismisses the claim that she did not know her cousin or son, Ginimbi.\n\nHow could I not have known Genius?\nHis mother is my dads sister. So what is he saying? We werent strangers from a bottle store.\n\n\nGenius and I were family;, she says.\n\nIn the interview (coming up on ZimEye-full text at the bottom of the article) she also challenges him to a one to one public debate saying he must provide evidence of things he has uttered.\n\nShe also says the couple never owned any boutique at Eastlea as claimed by Kawondera. What they owned which was her own company naned after her sister, was a travel agency back then.\n\nShe says allegations that she aided in robbing his company as claimed by Kawondera require full disclosure not a podcast-monologue, and if he truly lost money, he should also make a legal claim against Ginimbis estate like others have done.\n\nOne of the claimants to Kadungures estate is businessman Mutumwa Mawere who has no known relationship with Mubaiwa.\n\nShe denies ever doing the things he says she did, suggesting also that she did not even know him (Kawondera) during their early days with Ginimbi.\n\nResponding to the public challenge, Kawondera has so far backed down stating as follows:\n\nInterview transcript between Marry Mubaiwa and Simba Chikanza.\n\nMarry: Kupenga chairwoman ukwu!\n\nSimba Chikanza:\n\nWhat did you take?\n\nMarry: What Im saying, Marry Shingi married someone else or he married other women\n\nDo you want me to record this?\n\nMarry Mubaiwa:\n\nThats up to you.\n\nSimba: Because I need to capture your thoughts.\n\nSimba:\n\nOkay, so Shingi married?\n\nMarry: He married someone else, or he married other women after me, or before mewhatever. Or he was in relationships with other women before he was with me. Now hes going on public radio to talk about his life, about the things hes done in his life\n\nWhy is he only talking about me?\n\nWhy am I the only woman or wife hes talking about? He was married before. He was married after. Why is he not talking about those wives or girlfriends or whatever? Is he looking for attention? For relevance?\n\nWhen they were doing whatever they were doing with Genius, I had nothing to do with it. Completely nothing.\n\nSimba:\n\nAnd he mentioned in that interviewyou heard it toothat he sent money from Cyprus and started a company. He said it was La Shell, a boutique shop. Was that your company?\n\nMarry:\n\nYes, I had a company called La Shell, but it was not a boutique. It was a travel agency.\n\nEverybody knows La Shell was a travel and tour company. So what is he talking about? Has he got any idea?\n\nSimba:\n\nSo it wasnt his company?\n\nMarry:\n\nHe needs to wake up from this dream. That company was mine, and it was in honor of my late sister Michellewe called her Shell. So I called it La Shell.\n\nI met Shingi after my sister died.\n\nSimba:\n\nWhich year was that?\n\nMarry:\n\nYou mean when I met Shingi?\n\nI think 2006. My sister died in 2004.\n\nSimba:\n\nAnd you stayed together for how many years?\n\nMarry:\n\nWe were together until maybe 2011because I married the general towards the end of 2011.\n\nSimba:\n\nHe also says you didnt know Genius.\n\nMarry:\n\nHow could I not have known Genius?\n\nHis mother is my dads sister. So what is he saying? We werent strangers from a bottle store.\n\nGenius and I were family.\n\nWhat Shingi should have said is maybe Genius and I werent that close. But dont say I didnt know him.\n\nSimba:\n\nSo its incorrect for him to say he introduced you to Genius?\n\nMarry:\n\nTotally false. Genius and I were lifetime relatives.\n\nSimba:\n\nNow, hes also said you cut off his football career.\n\nMarry:\n\nHow did I do that?\n\nI wasnt caring, but I didnt block his career. What does cut me off mean? Divorce? Taking his stuff?\n\nSimba (playing audio):\n\nYes, along the way it can be true because I built my life with Marry. Thats the truth. I was about to end my football career. Everything we had, we made it. Thats the truth. She just cut me off.\n\nMarry:\n\nWhat does he mean I was about to earn my football career?\n\nDoes he mean end? Like to finish?\n\nSimba:\n\nYes, he said end, as in E-N-D.\n\nMarry:\n\nOkay. But againhow did I end his career? I wasnt involved in his football decisions. If he came back from Cyprus and couldnt find me, what has that got to do with ending his football?\n\nSimba:\n\nLets go to the business issue. He claims Genius forged his signature to take over Pioneer Gas. He suggests you assisted Genius.\n\nMarry:\n\nLets clarify something. I knew Genius was doing gas, but I had no interest in his business. I did not interfere in Geniuss business. I had my own life.\n\nIf they were doing business, I have no idea. But if he had grievances, he couldve come to Genius.\n\nGeniuss funeral was very public. Not private.\n\nHe couldve come to the family. Geniuss father is alive. His sister Nelia is there. He could have said, I invested. I want my money or my stake.\n\nSimba:\n\nCould he still do that today?\n\nMarry:\n\nI dont know. Depends on who hes fightingme or Genius? Because Genius was around long after Shingi and I separated.\n\nIf he had a real issue, he could have approached Genius while he was alive.\n\nSimba:\n\nSo his accusation isnt just against Genius, but also the Registrar of Companies?\n\nMarry:\n\nExactly.\n\nHes accusing the Registrar of fraudbecause all company changes are signed off by them.\n\nSo is he saying the Registrar changed documentation illegally?\n\nIf his signature was forgedwheres the evidence? Where are the original papers? If he has that proof, he should go to court.\n\nSome of Geniuss properties still exist. He can go to whoever is managing that and make a claim.\n\nSimba:\n\nNowhe also mentioned false girls. But he only names you. Are you the only one he could be referring to?\n\nMarry:\n\nIm definitely not one of the girls hes talking about. I was a woman. A wife. I dont fall into that false girls category.\n\nHes probably talking about someone else.\n\nSimba:\n\nAnd he did praise you, saying you raised your daughter well and didnt deprive him. That was positive.\n\nMarry:\n\nYes, he acknowledged that. I appreciate that.\n\nSimba:\n\nSo, what do you propose if I challenge him to a one-on-one with you?\n\nMarry:\n\nI dont have a problem.\n\nSimba:\n\nBecause the allegations hes madetheyre spreading. People are forming opinions.\n\nMarry:\n\nLet him come. Ill face him.\n\n.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Simba Chikanza | The retired footballer, Shingi Kawondera has responded to a challenge by his ex wife Marry Mubaiwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/breaking-confronted-by-marry-kawondera-refuses-face-to-face-with-mubaiwa-after-using-ollah-to-accuse-her-of-not-knowing-ginimbi-plus-cutting-shingi-off/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Confronted By Marry, Kawondera Refuses Face-To-Face With Mubaiwa After Using Ollah To Accuse Her Of Not Knowing Ginimbi, Plus Cutting Shingi Off\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Colonel Makova Declared Liberation Hero",
            "url": "https://www.zimeye.net/2025/07/12/colonel-makova-declared-liberation-hero/",
            "content": "ByA Correspondent-Retired Zimbabwe National Army (ZNA) spokesperson, Colonel Cladious Makova, has been declared a liberation hero following his death last Sunday in Chiredzi, where he had been receiving medical care.\n\nMakovas body was taken to 4 Brigade on Friday for a send-off parade, before he was laid to rest on Saturday afternoon at his farm in Mkwasine, Chiredzi.\n\nBest remembered for his tenure as the ZNAs public relations chief in the 1990s, Colonel Makova played a pivotal role in transforming the armys image froma forceplagued by accusations of indiscipline to onestrivingto align with national values and professionalism.\n\nAt a time when the armys public standing had reached a low pointmarked by widespread reports of harassment, looting, and repeated fatal road accidents involving military vehiclesMakova became the face of a more media-friendly and accountable ZNA.\n\nHe was widely regarded as one of the most effective public relations officers the army ever produced. Calm, articulate, and strategic, he brought credibility and visibility to an institution often shrouded in secrecy and fear.\n\nHowever, his appointment came during a period of deepening internal instability within the military, when a string of mysterious deaths of senior army officers raised alarm.\n\nThese deathsoften described as accidents, especially road crashessparked widespread speculation of a silent purge within the ranks of the Zimbabwe Defence Forces.\n\nThough no official confirmation ever tied these deaths to internal factional battles, observers noted a pattern: many of the deceased were decorated war veterans, senior commanders, or officers thought to be aligned with military hardliners resistant to the growing influence of then Defence Minister Emmerson Mnangagwa.\n\nThese incidents preceded the 2011 death of General Solomon Mujuru, himself a liberation war icon and perceived opponent of Mnangagwas ascendancy.\n\nIt was in this environment of suspicion and shifting allegiances that Makova emerged as the public face of the army.\n\nWhile he was never publicly linked to the factional fights, some viewed his elevation as part of a broader strategy to rebrand and consolidate the armys image in line with emerging power centres.\n\nDespite the murky political currents of the time, Makovas legacy remains intact.\n\nHe is celebrated for stabilising the armys relationship with the public and the media, and for professionalising the ZNAs communication strategy during a volatile chapter in Zimbabwes post-independence history.\n\nHis liberation hero status is a recognition of both his wartime contributions and his peacetime serviceparticularly in an institution that has often operated at the heart of Zimbabwes contested state power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Retired Zimbabwe National Army (ZNA) spokesperson, Colonel Cladious Makova, has been declared a liberation hero following his death last … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/colonel-makova-declared-liberation-hero/\">Continue reading<span class=\"screen-reader-text\"> \"Colonel Makova Declared Liberation Hero \"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Zimbabweans Munetsi, Chirewa Named in Wolves Squad for Portugal Pre-Season Camp",
            "url": "https://www.zimeye.net/2025/07/12/zimbabweans-munetsi-chirewa-named-in-wolves-squad-for-portugal-pre-season-camp/",
            "content": "Sports Correspondent\n\nWolverhampton Wanderers have included Zimbabwean internationals Tawanda Chirewa and Marshall Munetsi in their 29-man squad for a pre-season training camp in Portugal.\n\nChirewa, who recently returned to Wolves after a loan spell at Huddersfield Town, joins the senior squad for the tour.\n\nBefore his temporary move, the young midfielder featured mainly for the clubs development side and was occasionally named on the senior team bench.\n\nWhile his inclusion is seen as a promising step, it remains uncertain whether new head coach Vtor Pereira sees Chirewa as part of his long-term plans for the upcoming Premier League season.\n\nMunetsi, on the other hand, is expected to play a central role once again. The 27-year-old impressed in his debut season at Molineux, earning praise for his work rate, versatility, and leadership in midfield.\n\nThe Portugal camp is expected to feature a series of friendlies and tactical drills as Wolves prepare for the 2025/26 season under Pereiras guidance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Wolverhampton Wanderers have included Zimbabwean internationals Tawanda Chirewa and Marshall Munetsi in their 29-man squad for a pre-season … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/zimbabweans-munetsi-chirewa-named-in-wolves-squad-for-portugal-pre-season-camp/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabweans Munetsi, Chirewa Named in Wolves Squad for Portugal Pre-Season Camp\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Alarm As Health Ministry Records 435 Dog Bites In One Week",
            "url": "https://www.zimeye.net/2025/07/12/alarm-as-health-ministry-records-435-dog-bites-in-one-week/",
            "content": "By A Correspondent\n\nHARARE  The Ministry of Health and Child Care has raised fresh public health concerns after recording an alarming 435 dog bite cases across Zimbabwe in a single week, according to its latest Weekly Disease Surveillance Report for the period ending 29 June 2025.\n\nThe report breaks down the figures, showing that 107 of the bite victims were attacked by dogs known to be vaccinated, 83 by unvaccinated dogs, while a staggering 245 were bitten by dogs with unknown vaccination statusposing serious concerns about rabies transmission.\n\nMasvingo Province recorded the highest number of dog bite cases with 84, followed by Midlands with 64.\n\nThe new data pushes the cumulative total of dog bite cases for the year to 15,315, although no related fatalities have been reported.\n\nHealth officials warn that while deaths have so far been avoided, the growing numbers suggest a breakdown in animal control systems, as well as gaps in community awareness and pet vaccination compliance.\n\nIn addition to dog attacks, the Ministry also flagged continued concerns over snake bites. A total of 21 snake bite cases were recorded during the same week, bringing the year-to-date total to 2,979. Nine of those cases have resulted in fatalities.\n\nThe report also confirmed three new anthrax infections in Midlands Provincetwo from Gokwe South District and one from Gokwe North. These bring the cumulative total to 68 cases so far in 2025, with no deaths reported.\n\nThe Ministry has urged communities to remain vigilant, encouraging responsible pet ownership, prompt medical attention after animal bites, and adherence to public health guidelines.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – The Ministry of Health and Child Care has raised fresh public health concerns after recording … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/alarm-as-health-ministry-records-435-dog-bites-in-one-week/\">Continue reading<span class=\"screen-reader-text\"> \"Alarm As Health Ministry Records 435 Dog Bites In One Week\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Video: Jealousy Mawarire Humiliates Mnangagwa, Tagwirei…",
            "url": "https://www.zimeye.net/2025/07/12/video-jealousy-mawarire-humiliates-mnangagwa-tagwirei/",
            "content": "Political analyst Jealousy Mawarire, in an interview with Newzroom Afrika, criticized President Mnangagwas 2030 agenda, citing poor leadership, policy failures, and corruptionparticularly involving figures like Kudakwashe Tagwireias key drivers of Zimbabwes prolonged political and economic decline.\n\nWATCH | Zimbabwean political analyst Jealousy Mawarire was interviewed on Newzroom Afrika, where he discussed President Emmerson Mnangagwa's 2030 agenda, government policies, land tenure issues, and corruption.He highlighted how poor leadership, policy failures, and corruptionpic.twitter.com/JjW3Sutk9l\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Political analyst Jealousy Mawarire, in an interview with Newzroom Afrika, criticized President Mnangagwa’s 2030 agenda, citing poor leadership, policy failures, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/video-jealousy-mawarire-humiliates-mnangagwa-tagwirei/\">Continue reading<span class=\"screen-reader-text\"> \"Video: Jealousy Mawarire Humiliates Mnangagwa, Tagwirei…\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Zanu PF Women’s League Declares Mnangagwa To Stay In Office Beyond 2028",
            "url": "https://www.zimeye.net/2025/07/12/zanu-pf-womens-league-declares-mnangagwa-to-stay-in-office-beyond-2028/",
            "content": "By A Correspondent\n\nHARARE  Political tension is mounting following a controversial declaration by the ZANU PF Womens League that President Emmerson Mnangagwa should remain in office beyond 2028  a move that critics say openly undermines Zimbabwes constitutional term limits and signals a dangerous drift toward authoritarianism.\n\nThe declaration, made during the Womens League National Assembly on Friday, was announced by the leagues Secretary for Administration, Senator Monica Mutsvangwa, who confirmed that all provincial chairladies were rallying behind the resolution first made in Bulawayo.\n\nAll chairladies are moving with the resolution made in Bulawayo for the President to stay in office beyond 2028, Mutsvangwa stated, in a speech that has drawn sharp criticism from opposition figures and civic groups.\n\nThe Zimbabwean Constitution clearly states that a president can serve a maximum of two five-year terms. Mnangagwa, who is currently in his second and final term, is due to step down in 2028  but the Womens League appears eager to reverse that through political pressure and loyalty pledges.\n\nWe are not only pledging our political loyalty but leading in mobilisation, Mutsvangwa added. Our women are taking the lead in cell verification and voter mobilisation efforts. We want to modernise the party and make it attractive to young people.\n\nCritics, however, say the Leagues position is not only anti-democratic but out of touch with the real struggles Zimbabwean women face  including economic hardship, healthcare inequality, and gender-based violence.\n\nInstead of fighting for womens rights and economic empowerment, they are fighting to extend the term of a man whose leadership has left women worse off, said human rights advocate Thandeka Moyo. This is not leadership  its political servitude.\n\nMutsvangwa also heaped praise on Womens League Secretary Mabel Chinomona, portraying her as a national representative of all women, even those outside ZANU PF.\n\nThe Secretary for Womens Affairs, Cde Mabel Chinomona, understands the needs of all women in Zimbabwe, even outside ZANU PF. She is hardworking despite the many responsibilities she has, said Mutsvangwa.\n\nBut opposition voices say such claims are misleading and politically manipulative.\n\nTo suggest ZANU PF speaks for all women in Zimbabwe is not only dishonest, its dangerous, said CCC parliamentarian and gender activist Hon. Susan Matsunga. They are hijacking the voice of women to defend power  not to defend women.\n\nAs calls for a third term grow louder within ruling party structures, legal experts warn that any move to alter presidential term limits would require a constitutional amendment  a move likely to trigger national backlash and further destabilise Zimbabwes fragile democracy.\n\nLets be clear: any attempt to extend Mnangagwas term is unconstitutional, said constitutional lawyer Brian Dube. If they push forward with this agenda, they risk plunging the country into a constitutional crisis.\n\nWhile the Womens League presents itself as a pillar of grassroots mobilisation, critics argue that it has become a tool for consolidating patriarchal power at the expense of genuine womens advocacy.\n\nAs the 2028 deadline approaches, all eyes will be on whether this endorsement translates into legislative action  and how Zimbabwes institutions, civil society, and citizens respond.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Political tension is mounting following a controversial declaration by the ZANU PF Women’s League that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/zanu-pf-womens-league-declares-mnangagwa-to-stay-in-office-beyond-2028/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Women’s League Declares Mnangagwa To Stay In Office Beyond 2028\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Flames As Fuel Tanker Collides Head-On with Lobels Truck",
            "url": "https://www.zimeye.net/2025/07/12/mashava-fuel-tanker-inferno-sparks-outrage-over-public-safety-neglect/",
            "content": "BREAKING NEWS | Mashava Fuel Tanker Inferno Sparks Outrage Over Public Safety Neglect\n\nBy Farai D Hove | ZimEye | Mashava, Zimbabwe  A horrifying scene unfolded along the highway in Mashava earlier today when a fuel tanker collided head-on with a Lobels bread delivery truck, erupting into a towering inferno that sent plumes of black smoke high into the sky.\n\nIn images captured from the aftermath of the accident, dozens of peoplesome including childrencan be seen dangerously close to the burning wreckage, with flames visibly engulfing one of the vehicles. The fuel tanker reportedly burst into flames moments after impact, making the situation even more perilous.\n\nDespite the clear and imminent danger, crowds are seen congregating just metres away from the blaze, with many appearing to be filming or observing the scene rather than evacuating to a safe distance.\n\nWhat the Images Show: Thick, black smoke billowing into the sky, likely from burning petroleum products. A crowd of peoplemany barefoot or in casual clothinggathering within the danger zone, along both the roadside and embankments. Children are visible in the frame, some approaching the fire instead of retreating.\n\nDangers of Standing Near a Burning Fuel Tanker:1. Explosion Risk: Fuel tankers contain highly flammable materials that can cause secondary explosions.2. Toxic Fumes: Inhalation of the smoke from petroleum fires can lead to serious respiratory issues, poisoning, or long-term health effects.3. Flying Debris: Exploding components like tyres, fuel caps, or fragments of the tank itself can act as deadly projectiles.4. Rapid Fire Spread: Fire can quickly spread to dry vegetation or nearby vehicles, trapping bystanders.5. Structural Collapse: Trucks and tankers can collapse inward, sending flames outward unpredictably.\n\nSafety Procedure in Such Circumstances:\n\nAuthorities and safety experts stress the following steps should be followed: Evacuate the area immediatelyat least 300 metres away from the fire. Avoid inhaling smokecover your mouth with cloth if you must pass near the scene. Do not take photos or videosthis delays your evacuation and attracts others to danger. Alert emergency services immediately if they are not yet on the scene. Prevent others from approachingespecially children or untrained civilians. Allow only trained responders to manage the scene.\n\nThis tragic incident in Mashava may be reminder of the critical need for public education on disaster response and fuel-related emergencies. While it remains unclear how many casualties or injuries were sustained in this incident, the presence of civilians so close to a burning fuel tanker raises major concerns about safety awareness and emergency crowd control in Zimbabwe.\n\nAuthorities are being urged to investigate both the cause of the accident and the lack of immediate cordon protocols to prevent possible further loss of life.\n\nDeveloping story\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BREAKING NEWS | Mashava Fuel Tanker Inferno Sparks Outrage Over Public Safety Neglect By Farai D Hove | ZimEye | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/mashava-fuel-tanker-inferno-sparks-outrage-over-public-safety-neglect/\">Continue reading<span class=\"screen-reader-text\"> \"Flames As Fuel Tanker Collides Head-On with Lobels Truck\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Masvingo Police Refuse To Open Docket For Rowdy Zanu PF Hooligans Who Disrupted Job Sikhala Book Launch",
            "url": "https://www.zimeye.net/2025/07/12/masvingo-police-refuse-to-open-docket-for-rowdy-zanu-pf-hooligans-who-disrupted-job-sikhala-book-launch/",
            "content": "By A Correspondent\n\nMASVINGO The violent disruption of a book launch in Masvingo on Friday night has reignited public outrage over what many see as a disturbing pattern of police inaction when crimes are committed by individuals linked to the ruling Zanu PF party.\n\nThe launch ofFootprints in the Chains, a biography chronicling the life of opposition figure Job Sikhala, turned chaotic when a mob of intoxicated Zanu PF supporters stormed the Charles Austin Theatre and attacked guests, including respected journalist Matthew Takaona and academic Dr. Takavafira Zhou.\n\nThe perpetratorssome of whom are well-known in Masvingo political circlesopenly chanted party slogans and caused mayhem with little fear of consequences.\n\nPolice are yet to issue a formal statement or make a single arrestdespite video evidence and numerous eyewitness accounts identifying the assailants.\n\nThis is the norm now, said one attendee who asked not to be named.If you wear a Zanu PF t-shirt, you can beat people in broad daylight and nothing will happen to you.\n\nThe event, meant to be a peaceful celebration of literary freedom and political reflection, has instead become another flashpoint in Zimbabwes long-standing debate over selective law enforcement.\n\nRights groups and civic leaders say the Masvingo incident is not isolated but part of a broader trend in which politically aligned violence goes unpunished, fueling a culture of impunity.\n\nWhy are they untouchable? asked a civic activist in Masvingo.We have names. We have videos. We have victims. What more do the police need?\n\nPolice have reportedly refused to open a docket for the rowdy Zanu PF supporters, despite multiple complaints filed by victims and witnesses.\n\nAnalysts warn that the failure to arrest and prosecute politically connected individuals is undermining public trust in law enforcement and creating a climate of fear ahead of potential electoral contests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO – The violent disruption of a book launch in Masvingo on Friday night has reignited public … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/masvingo-police-refuse-to-open-docket-for-rowdy-zanu-pf-hooligans-who-disrupted-job-sikhala-book-launch/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Police Refuse To Open Docket For Rowdy Zanu PF Hooligans Who Disrupted Job Sikhala Book Launch\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "JUST IN: Several Feared Dead as Fuel Tanker Explodes",
            "url": "https://www.zimeye.net/2025/07/12/just-in-several-feared-dead-as-fuel-tanker-explodes/",
            "content": "By A Correspondent-Several people are feared dead following a fuel tanker explosion in Mashava, Masvingo Province.\n\nMasvingo Provincial Police Spokesperson, Inspector Kudakwashe Dhewa, confirmed the incident but said details remain sketchy as police officers are still on the ground gathering information.\n\nWe can confirm there has been an explosion involving a fuel tanker in Mashava. Our officers are at the scene. We will provide full details once investigations are complete, said Inspector Dhewa.\n\nHappening now: A fuel tanker has caught fire in Mashava. Masvingo Provincial Police Spokesperson Inspector Kudakwashe Dhewa confirmed the incident, saying police officers are currently at the scene.More details to followpic.twitter.com/WnEY8eIuPF\n\nMore to follow\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Several people are feared dead following a fuel tanker explosion in Mashava, Masvingo Province. Masvingo Provincial Police Spokesperson, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/just-in-several-feared-dead-as-fuel-tanker-explodes/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Several Feared Dead as Fuel Tanker Explodes\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        },
        {
            "title": "Botswana Scoops Best African Tourist Destination Award – Again",
            "url": "https://www.zimeye.net/2025/07/12/botswana-scoops-best-african-tourist-destination-award-again/",
            "content": "By A Correspondent-Botswana has once again been crowned Africas best safari destination, winning the prestigious title for the fourth consecutive time, according to the latest rankings by SafariBookings.com.\n\nUnder the promising and forward-looking leadership of President Duma Boko, the southern African nation continues to shine on the global tourism map.\n\nThe accolade follows a rigorous survey that analysed more than 3,100 reviews submitted by African travel experts and international safari-goers.\n\nBotswanas consistent top-ranking reaffirms its position as a premier destination for nature-based tourism, blending ecological sustainability with breathtaking natural experiences.\n\nThe country is home to some of Africas most iconic and pristine wilderness areas.\n\nCentral to its tourism appeal is theOkavango Delta, a UNESCO World Heritage Site and one of the largest inland deltas in the world.\n\nThis extraordinary ecosystem supports a staggering diversity of wildlife and offers visitors an immersive safari experience  from mokoro (dugout canoe) rides through the papyrus-lined channels to walking safaris led by skilled local guides.\n\nEqually captivating is the vastKalahari Desert, where golden sand plains stretch endlessly and black-maned lions roam freely.\n\nOther celebrated destinations includeChobe National Park, famed for its massive elephant population, and theMoremi Game Reserve, widely regarded as one of Africas finest wildlife havens.\n\nBotswana has pioneered alow-impact, high-value modelof tourism that prioritizes conservation over mass tourism.\n\nUnlike many other safari destinations overwhelmed by crowds, Botswana maintains strict limits on visitor numbers and promotes eco-friendly luxury lodges that fund conservation and community development efforts.\n\nThis model has earned the country accolades not only for its visitor experience but also for its commitment to preserving its natural heritage.\n\nBeyond tourism, Botswanas robust economy  anchored by one of the worlds most successfuldiamond industries has played a pivotal role in supporting infrastructure development, environmental protection, and social services.\n\nSince gaining independence in 1966, Botswana has transformed from one of the worlds poorest countries into a middle-income economy, thanks in large part to prudent management of its diamond wealth through a long-standing partnership with De Beers.\n\nTourism and mining now work hand-in-hand as twin pillars of the economy, with the government actively reinvesting diamond revenues into national development, including the growth of eco-tourism and wildlife conservation.\n\nTrailing closely behind Botswana in the SafariBookings.com rankings wereTanzaniaandKenya, both globally respected safari destinations in their own right. However, Botswanas unmatched blend of luxury, authenticity, and conservation ethics continues to set it apart.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Botswana has once again been crowned Africa’s best safari destination, winning the prestigious title for the fourth consecutive … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/12/botswana-scoops-best-african-tourist-destination-award-again/\">Continue reading<span class=\"screen-reader-text\"> \"Botswana Scoops Best African Tourist Destination Award – Again\"</span></a></p>",
            "time": "18:39",
            "date": "13 Jul 2025"
        }
    ]
}