{
    "news": [
        {
            "title": "Prophet Magaya Turns Harare Remand Prison Into ‘PHD Ministry’",
            "url": "https://www.zimeye.net/2025/11/09/prophet-magaya-turns-harare-remand-prison-into-phd-ministry/",
            "content": "By A Correspondent  In a desperate attempt to regain public sympathy, the controversial Prophetic Healing and Deliverance (PHD) Ministries founder, Walter Magaya, is reportedly trying to reinvent himself as a prison messiah  praying for inmates and paying bail for those who cannot afford it.\n\nSources at Harare Remand Prison said that Magaya, currently facing multiple counts of rape and fraud, has been assisting fellow inmates with money for bail and legal fees. One prisoner, recently released, praised him as a humble man of God.\n\nI got bail money from the prophet. He has assisted many people with money and even lawyers. That man is a humble servant of God, said one of the beneficiaries.\n\nAnother inmate added:\n\nI was in remand for over five months on allegations of armed robbery. I made several attempts to get bail but failed. The prophet helped me.\n\nWhile Magayas prison charity has earned him momentary praise among inmates, observers and victims advocates say it is a calculated public relations stunt aimed at shifting attention from the serious criminal allegations he faces.\n\nThe Zimbabwe Republic Police (ZRP) this weekend intensified its investigation into Magayas alleged crimes, releasing verified contact numbers for victims and witnesses to report cases of rape, fraud, and assault linked to the embattled preacher.\n\nIn an official statement, the police confirmed receiving several calls from people all over the world seeking clarification on how to report cases against Magaya.\n\nThe Zimbabwe Republic Police has availed cellphone number 0776 830 226, National Complaints number (0242) 703 631, and WhatsApp number 0712 800 197 for anyone to freely report and allow the ZRP to conduct investigations, the statement said.\n\nZRP also urged victims and witnesses based in countries such as South Africa, the United Kingdom, Namibia, Botswana, Mozambique, Malawi, and Zambia to file reports through the same contact channels. South Africa-based victims are advised to make notarised statements at local police stations and forward them through the Zimbabwean Embassy for transmission to Harare.\n\nThe police further warned that any attempt to intimidate witnesses or obstruct justice would result in immediate arrest under Section 184 of theCriminal Law (Codification and Reform) Act[Chapter 9:23].\n\nThe Zimbabwe Republic Police warns individuals and syndicates trying to interfere with investigations or threaten witnesses that they risk being arrested for defeating or obstructing the course of justice, the statement added.\n\nThis latest development comes amid years of allegations against Magaya, dating back to 2014, involving sexual exploitation, psychological manipulation, and fraudulent investment schemes disguised as religious ventures.\n\nZimEyehas been investigating Magaya for nearly a decade, publishing exclusive exposs, leaked audios, and witness testimonies that unveiled a recurring pattern of deceit and abuse.\n\nOne leaked recording revealed Magayas late mentor, Nigerian televangelist TB Joshua, warning him of the fall of the anointed if he continued ignoring accountability.ZimEyealso exposed Magayas false 2018 claim of discovering a cure for HIV and cancer  a claim that triggered outrage and was later withdrawn under government pressure.\n\nFurther investigations revealed how Magaya misrepresented ownership of properties, including former Reserve Bank Governor Gideon Gonos New Donnington Farm, to lure congregants into bogus land and agricultural investment projects.\n\nMagaya is currently in remand facing five counts of rape and 13 counts of fraud. His wife, Tendai Magaya, who faces related fraud allegations, was released on US$500 bail. Court documents show that Magaya and his team allegedly defrauded congregants of more than US$40,000 between 2016 and 2018 through fake land projects in Norton, Mutare, Bulawayo, Kwekwe, and Chishawasha.\n\nInvestors were enticed through pamphlets quoting Genesis 13:9 A vast land is out there and available to you claiming that PHD Ministries had legally acquired the land, which later turned out to be false. Two of Magayas aides were also arrested for resisting arrest and obstructing justice during the raid at his Prospect prayer mountain.\n\nDuring his court appearance, Harare regional magistrate Marewanazvo Gofa denied bail, citing the seriousness of the rape charges, which fall under Third Schedule offences. The courtroom was packed with hundreds of emotional congregants singing and praying for his release, forcing the magistrate to order that rape bail proceedings be heldin camerato protect victim identities.\n\nSenior officials within the Ministry of Home Affairs toldZimEyethat Magayas case represents a turning point in how authorities handle powerful religious figures accused of serious crimes.\n\nFor the first time, the ZRP has publicly provided verified contact lines for victims, signalling a move toward transparency and stronger protection for survivors of religious abuse.\n\nStill, analysts say Magayas recent philanthropy in prison appears to be part of a familiar pattern  a man seeking to polish his image in the public eye even as the walls of justice close in.\n\nOFFICIAL ZRP CONTACTS: Cell: 0776 830 226 National Complaints: (0242) 703 631 WhatsApp: 0712 800 197\n\nZimEye.com  Investigating Without Fear or Favour\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – In a twist development, the controversial Prophetic Healing and Deliverance (PHD) Ministries founder, Walter Magaya, is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/prophet-magaya-turns-harare-remand-prison-into-phd-ministry/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Magaya Turns Harare Remand Prison Into ‘PHD Ministry’\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Goods Train Crashes in Bulawayo",
            "url": "https://www.zimeye.net/2025/11/09/goods-train-crashes-in-bulawayo/",
            "content": "By Business Reporter A goods train carrying 450,000 litres of diesel from Mozambique was involved in an accident at Mpopoma Station in Bulawayo early Saturday morning, in what officials have described as a runaway incident.\n\nBulawayo Chief Fire Officer, Mhlangano Moyo, confirmed the mishap, explaining that the locomotive had been parked after running out of fuel. However, the brakes reportedly failed during the night, causing the train to roll downhill and collide with a stationary locomotive at the Mpopoma Diesel Shed.\n\nThe train ran out of fuel and was left parked overnight. Unfortunately, it gained momentum after the brakes lost power and went straight into another parked locomotive, resulting in the accident, said Moyo.\n\nHe added that emergency crews were at the scene to prevent a potential fire disaster by draining the remaining fuel from the tankers and separating the damaged locomotives.\n\nWe are decanting the fuel and pushing the locomotives apart. The process is ongoing and will take some time. The locomotive was pulling about 450,000 litres of diesel, Moyo added.\n\nNo injuries were reported, though investigations are underway to establish the full cause of the incident.\n\nThe accident has once again highlighted the deteriorating state of Zimbabwes rail infrastructure, which has suffered years of neglect, underfunding, and vandalism. The National Railways of Zimbabwe (NRZ), once a key player in the regions freight network, now operates with a severely depleted fleet and outdated equipment.\n\nNRZs rail network spans about 2,760 kilometres, but less than 10 percent of its locomotives and wagons are currently serviceable, according to industry estimates. Many trains rely on ageing engines and braking systems dating back to the 1960s and 1970s, making them vulnerable to mechanical failures such as the one reported in Bulawayo.\n\nFreight volumes have plummeted from over 18 million tonnes in the late 1990s to under 3 million tonnes in recent years, largely due to obsolete infrastructure and competition from the road transport sector. A combination of vandalism of signaling equipment, theft of copper cables, and lack of investment in modern safety systems has left the network unsafe and inefficient.\n\nIn 2023, the government announced a series of rehabilitation partnerships with private investors to modernize NRZ operations, including efforts to refurbish wagons and rehabilitate critical routes linking the country to Mozambique and South Africa. However, progress has been slow, and incidents like the Mpopoma crash expose the continuing safety risks facing rail workers and cargo alike.\n\nRail experts have warned that without immediate investment in maintenance, modern signaling systems, and reliable braking technology, more runaway incidents could occurparticularly on steep gradients where trains are parked for long hours without adequate power or mechanical safety checks.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter– A goods train carrying 450,000 litres of diesel from Mozambique was involved in an accident at Mpopoma … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/goods-train-crashes-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Goods Train Crashes in Bulawayo\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Zim Man Missing In Pretoria",
            "url": "https://www.zimeye.net/2025/11/09/zim-man-missing-in-pretoria/",
            "content": "Hello. We are looking for our relative Tatenda Masirivha, who was arrested by Home Affairs officers in Centurion late September.\n\nThe last communication we had with him was around 7 p.m. of that day, when he told us that he was about to appear in court. Since then, we have not received any updates about his whereabouts.\n\nWe went to Pretoria Central, where officials told us that he had been transferred to different jails. We also checked at Lindela and later in Mpumalanga, but we could not find him. We no longer know where he is.\n\nIf anyone has seen him or has information about his location, please contact us on +27 63 047 1390.\n\nWe have attached his picture. Thank you.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Hello. We are looking for our relative Tatenda Masirivha, who was arrested by Home Affairs officers in Centurion late September. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/zim-man-missing-in-pretoria/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Man Missing In Pretoria\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Missing Child Alert",
            "url": "https://www.zimeye.net/2025/11/09/missing-child-alert-2/",
            "content": "The ZRP is appealing for information which may lead to the location of Leslie Kamuzungu (11). The minor went missing on 6th November 2025 inGlaudina area, Harare. He was wearing a black jacket and grey short. Anyone with information on the whereabouts of Leslie Kamuzungu should feel free to report at any nearest police station or contact:\n\nNational Complaints Desk: 0242 703631\n\nHarare operations: 0242 748836\n\nZRP WhatsApp: 0712 800 197\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The ZRP is appealing for information which may lead to the location of Leslie Kamuzungu (11). The minor went missing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/missing-child-alert-2/\">Continue reading<span class=\"screen-reader-text\"> \"Missing Child Alert\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Abednego Ncube Dies",
            "url": "https://www.zimeye.net/2025/11/09/abednego-ncube-dies/",
            "content": "Bulawayo Mourns Visionary Businessman Abednego Ncube\n\nBy A Correspondent | ZimEye | Bulawayo mourns the loss of a true visionary  businessman, educationist, and community builder Abednego Ncube, who passed away this week. The city is in grief as it remembers one of its most influential figures, a man whose legacy is deeply woven into the economic and social fabric of Bulawayo and Zimbabwe at large.\n\nAbednego Ncubes story is one of determination, innovation, and service. Born and raised in Bulawayo, he began his education at Zamanyoni Primary School before proceeding to St. Bernards High School. From an early age, Ncube displayed an exceptional drive for excellence and a natural sense of leadership  traits that would later define his career and contribution to his community.\n\nHis entrepreneurial journey was driven by a powerful vision: to empower indigenous Zimbabweans through business ownership. He co-owned Bulawayo Discount Furnitures, one of the citys pioneering black-owned retail enterprises that set a benchmark for success and resilience in the post-independence era, writes broadcaster, Ezra Sibanda.\n\nNever content with past achievements, Ncube broke new ground in the transport industry with Frix Taxis, a licensed taxi company that opened doors for black entrepreneurs in a sector that had long been restricted. His leadership, courage, and determination inspired many others to follow in his footsteps, transforming Bulawayos business landscape.\n\nHe later founded Abbies International (Pvt) Ltd, which evolved into Dial-a-Vision Electronics (Pvt) Ltd, a highly successful business that dominated the citys electronics and furniture markets. His innovative spirit led him to establish a digital marketing company that secured a major contract with Skyz Metro FM, demonstrating his ability to embrace new technologies and adapt to changing times.\n\nBeyond business, Abednego Ncube was a passionate advocate for education and youth empowerment. As Director of Foundation Colleges and Schools, which included Premier High School and Eastview High School, he dedicated himself to nurturing future leaders and providing access to quality education. He firmly believed that true empowerment begins with knowledge  and through his schools, countless young Zimbabweans gained opportunities that changed their lives and communities.\n\nNcubes passing marks the end of an era for Bulawayos business community, but his legacy will live on through the many lives he transformed and the enterprises he built. His name will forever be associated with progress, empowerment, and the belief in the citys potential.\n\nHis family, friends, and the city he loved are preparing a fitting farewell. A public service and send-off will be held on Sunday, 9 November 2025, at 7:30 a.m. at Number 1A Debeer Road, Paddonhurst, followed by interment at Lady Stanley Cemetery.\n\nBulawayo celebrates not only a successful businessman but a patriot, mentor, and visionary whose lifes work uplifted generations.\n\nRest in peace, Abednego Ncube  your legacy of empowerment and progress will continue to shine.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Bulawayo Mourns Visionary Businessman Abednego Ncube By A Correspondent | ZimEye | Bulawayo mourns the loss of a true visionary … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/abednego-ncube-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Abednego Ncube Dies\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Mayor Jacob Mafume you Lied to the Nation About Mount Pleasant Sports Club",
            "url": "https://www.zimeye.net/2025/11/09/mayor-jacob-mafume-you-lied-to-the-nation-about-mount-pleasant-sports-club/",
            "content": "Dear Mayor Jacob Mafume,\n\nI am writing to express my concern regarding the ongoing construction taking place at Mount Pleasant Sports Club. Five years ago, you personally assured me that the property had not been sold and that the land was protected from any form of private development (see attached facebook exchange).\n\nHowever, recent activity on the ground clearly shows construction work in progress. My question is, what has changed since our previous conversation? As a resident and a citizen who values transparency and public accountability, I believe the people of Mount Pleasant and Harare deserve a clear and honest explanation regarding the current status of this land.\n\nIf the property has been leased, sold or reallocated, I kindly request that your office provide details on:\n\nOur recreational and community spaces are vital to the well-being of Harares citizens, and it is important that any changes to their use are handled with openness and integrity.\n\nI look forward to your email clarification on this matter.\n\nKind regards,\n\nEngineer Jacob Kudzayi Mutisi\n\n+263772278161[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dear Mayor Jacob Mafume, I am writing to express my concern regarding the ongoing construction taking place at Mount Pleasant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/mayor-jacob-mafume-you-lied-to-the-nation-about-mount-pleasant-sports-club/\">Continue reading<span class=\"screen-reader-text\"> \"Mayor Jacob Mafume you Lied to the Nation About Mount Pleasant Sports Club\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Varakashi4ED Boss Up for Fraud",
            "url": "https://www.zimeye.net/2025/11/09/varakashi4ed-boss-up-for-fraud/",
            "content": "By A Correspondent The leader of the pro-Mnangagwa social media group,Varakashi4ED,Wellington Mutisi, is wanted by police for allegedly defrauding several people through the sale of non-existent residential stands.\n\nMutisi, who heads President Emmerson Mnangagwas online propaganda campaign and was ZANU PFs aspiring councillor for Ward 9 in Bikita in 2023, is accused of selling a fake stand worthUS$6,150toAuxillia Tadzingwa, an accountant at Runde Rural District Council.\n\nAccording to Tadzingwa, who is being represented by lawyerJohn Makiseniof Masango Attorneys-At-Law, Mutisi sold her a580-square-metre standin Victoria Ranch, Masvingo, in May 2014 through his company,Noahs Areka Housing Development.\n\nTadzingwa said she only discovered the alleged fraud after paying aUS$213 consortium feeto Masvingo Rural District Council (RDC). When she went to inspect the property, she found that another person was already constructing on the same stand.\n\nWhen I asked the council why they had accepted my consortium payment when the land belonged to someone else, they referred me back to Mutisi, said Tadzingwa.\n\nMutisi reportedly demanded a furtherUS$1,500in allocation fees to find her another property. When Tadzingwa refused and asked for a refund, he allegedly agreed to repay her in three instalments but only returnedUS$100.\n\nOnJanuary 25, 2023, Mutisi wrote to Tadzingwas lawyer pledging to settle the balance in monthly instalments. However, according to Makiseni, Mutisi has not made any further payments and efforts to recover the funds have been fruitless.\n\nMasvingo Mirror has seen a letter written by Mutisi to Tadzingwas lawyer acknowledging the debt and blaming financial challenges:\n\nWe advised her that the business is low these days and that the company has no funds to refund her the full amount at once but will give her in instalments. In December we managed to pay her the sum of US$100, looking forward to paying the remaining balance in the shortest time possible, reads part of the letter.\n\nMeanwhile, police are also pursuing Mutisi over a separate case in which he allegedly defraudedLiliosa Jakaza, a widow from Bikita, ofUS$1,700. He reportedly promised to secure nursing places for Jakazas relatives atSilveira Mission Hospitalthrough the office ofMasvingo Provincial Affairs Minister Ezra Chadzamira.\n\nOne of Mutisis alleged accomplices,Thomas Wasosa(36), was arrested last week and is currently on remand. Police investigations are ongoing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The leader of the pro-Mnangagwa social media group, Varakashi4ED, Wellington Mutisi, is wanted by police for allegedly defrauding several … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/varakashi4ed-boss-up-for-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi4ED Boss Up for Fraud\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Chalton Hwende Demands US$150,000 for Each MP",
            "url": "https://www.zimeye.net/2025/11/09/chalton-hwende-demands-us150000-for-each-mp/",
            "content": "Hwende Sparks Outrage After Demanding US$150,000 Housing Loans for MPs\n\nBy Dorrothy Moyo | BULAWAYO  Opposition legislator Chalton Hwende has ignited public outrage after demanding that Members of Parliament receive US$150,000 housing loans from the national budget, a proposal many citizens and commentators have condemned as tone-deaf amid Zimbabwes worsening economic crisis.\n\nSpeaking during the ongoing pre-budget seminar in Bulawayo, the Kuwadzana MP lamented the governments failure to provide adequate housing support for lawmakers and argued that inflation had eroded the value of previous loans.\n\nWe received housing loans worth US$40,000, but because of inflation and compared to what those in the Executive received, we also want you to budget a minimum of US$150,000 as a loan that will ensure an MP gets a house, Hwende said.\n\nHwende, who also called for salary increments for parliamentarians, justified his demand by claiming that MPs had been given residential stands but lacked funds to develop them.\n\nHowever, his remarks have drawn sharp criticism across social media.\n\nPolitical analyst Dr. Chipo Dendere blasted Hwendes proposal, describing it as pathetic and shameful.\n\nEven for Hon. Hwende this is pathetic. Demanding $150,000 from Parliament? After all these years in politics and running businesses, he needs taxpayers to buy him a house? Did they pay back the previous loans? A loan is supposed to be paid back. Pathetic behavior. Zvinyonyadzisa, Dr. Dendere posted on X (formerly Twitter).\n\nThe backlash reflects growing frustration with Zimbabwes political elite, who are seen as prioritising personal benefits while public services such as health, education, and infrastructure crumble.\n\nAnalysts say Hwendes remarks could deepen distrust between legislators and citizens, many of whom are struggling to afford basic necessities amid soaring inflation and stagnant wages.\n\nCritics argue that instead of lobbying for personal perks, MPs should focus on policies to relieve poverty, stabilise the economy, and improve governance accountability.\n\nMeanwhile, there has been no official response from Parliament or the Ministry of Finance on whether such a loan provision will be included in the forthcoming 2026 National Budget.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Hwende Sparks Outrage After Demanding US$150,000 Housing Loans for MPs By Dorrothy Moyo | BULAWAYO — Opposition legislator Chalton Hwende … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/chalton-hwende-demands-us150000-for-each-mp/\">Continue reading<span class=\"screen-reader-text\"> \"Chalton Hwende Demands US$150,000 for Each MP\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Hichilema’s Calm Response",
            "url": "https://www.zimeye.net/2025/11/09/hichilemas-calm-response/",
            "content": "Analyst Warns: Do Not Mistake His Calmness for Weakness\n\nBy Farai D Hove | 9 November 2025 | Lusaka\n\nA powerful opinion by governance analyst G. Siambelele has sharply criticised Zambias security establishment following yesterdays violent attack on President Hakainde Hichilema in Chingola, describing the incident as a loud alarm to our national security system.\n\nThe President narrowly escaped harm after his motorcade came under attack from stone-throwing mobs who set ablaze a police vehicle and destroyed property at Chiwempala Market and Chikola Secondary School grounds. The Zambia Police Service has confirmed that two suspects  Abraham Chilumbu (24) and Abraham Sichone (21)  are in custody following the riots that left a police Toyota Land Cruiser, tents, and vehicles reduced to ashes.\n\nIf those stones thrown at President Hakainde Hichilema had been bullets, Zambia today would be telling a tragic story, Siambelele warned in a strongly worded analysis titled A Call Not to Mistake His Calmness for Weakness.\n\n SECURITY FAILURE EXPOSED\n\nSiambelele said the images of President Hichilema reacting faster than his own security detail exposed deep cracks within Zambias intelligence and coordination structures.\n\nThe President  our Commander-in-Chief  should never be placed in harms way. This was not just a mistake; it was a serious failure that demands accountability and immediate corrective action, he wrote.\n\nThe statement echoes growing public frustration over what appears to be poor advance intelligence and inadequate crowd-control protocols during presidential visits. Security analysts are calling for an internal review of both the Protective Unit and Copperbelt Police Command, warning that lapses of this magnitude could embolden violent actors.\n\n CALMNESS IS NOT WEAKNESS\n\nDespite the chaos, Siambelele praised President Hichilema for his restraint.\n\nHe could have ordered a strong reaction from security, and blood could have been shed. But he chose peace. That single decision spoke volumes about the kind of leader he is, he said.\n\nSiambeleles commentary positions Hichilemas calm response as a mark of moral strength, warning those who interpret it as softness:\n\nIt takes greater strength to remain composed when provoked, and true leadership is shown in how one handles power under pressure.\n\n DAMAGE AND AFTERMATH\n\nAccording to a Zambia Police statement released by spokesperson Rae Hamoonga, the mobs violence resulted in extensive property damage  including the burning of a Presidential Holding Tent, portable toilets, and vehicles belonging to both government and private entities.\n\nSuperintendent Lloyd Kanondo, who drove the destroyed police vehicle, fired ten warning shots in a failed attempt to disperse the rioters before the crowd overturned and torched the Land Cruiser.\n\nPolice have since restored calm and intensified patrols across Chingola. The total value of destroyed government and private property is yet to be determined.\n\n CALL FOR ACCOUNTABILITY\n\nSiambeleles analysis has ignited debate across Zambias political and security circles. Many commentators agree that the incident demands a top-level security audit, possibly extending to State House intelligence coordination and provincial command structures.\n\nHeads must roll where negligence is evident because the safety of the President is the safety of Zambia itself, Siambelele declared.\n\nThe Chingola attack stands as one of the gravest breaches of presidential security in Zambias recent history. While calm has been restored, Siambeleles message resonates with a national warning: President Hichilemas restraint should not be mistaken for weakness  it must instead awaken a new era of vigilance, accountability, and unity.\n\n ZimEye News | Investigations Desk\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Analyst Warns: “Do Not Mistake His Calmness for Weakness” By Farai D Hove | 9 November 2025 | Lusaka An … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/09/hichilemas-calm-response/\">Continue reading<span class=\"screen-reader-text\"> \"Hichilema’s Calm Response\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        },
        {
            "title": "Four Zimbabwean Coaches Earn CAF C Licences in South Africa",
            "url": "https://www.zimeye.net/2025/11/08/four-zimbabwean-coaches-earn-caf-c-licences-in-south-africa/",
            "content": "By Sports Correspondent\n\nFour Zimbabwean coaches have successfully completed their CAF C coaching courses in South Africa, marking a major step in their professional development.\n\nThe newly certified coaches are Malvern Dumbura, who serves as the strikers coach for Scottland FC, former Tenax defender Misheck Shonga, ex-Mutare City Rovers player Ackim Gwaendepi, and former Maritzburg United forward Terrence Mandaza.\n\nTheir achievement adds to Zimbabwes growing pool of qualified coaches, as the country continues to develop football expertise both locally and abroad.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Four Zimbabwean coaches have successfully completed their CAF C coaching courses in South Africa, marking a major … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/08/four-zimbabwean-coaches-earn-caf-c-licences-in-south-africa/\">Continue reading<span class=\"screen-reader-text\"> \"Four Zimbabwean Coaches Earn CAF C Licences in South Africa\"</span></a></p>",
            "time": "20:40",
            "date": "09 Nov 2025"
        }
    ]
}