{
    "news": [
        {
            "title": "Just In: Government Bans Mabhero, Street Vending With Immediate Effect",
            "url": "https://www.zimeye.net/2025/08/04/just-in-government-bans-mabhero-street-vending-with-immediate-effect/",
            "content": "HARARE  The Zimbabwean government has announced an immediate ban on the importation and sale of second-hand clothing, popularly known asmabhero, along with a crackdown on street vending and night-time trading in cities and towns.\n\nLocal Government and Public Works Minister Daniel Garwe made the announcement on Monday, August 4, during a meeting with Harare City Councillors at Town House.\n\nI want to make it clear that government has banned the importation and selling of second-hand clothing, said Garwe. As a result, all street vending and night vending activities are now prohibited with immediate effect.\n\nHe emphasized that local authorities must move swiftly to enforce the directive, stating, The City of Harare is directed to work closely with law enforcement agencies to ensure there is no further vending on the streets or at night. The time to act is now  not tomorrow.\n\nThe announcement marks the latest attempt by the government to restrict the influx of used clothes into the country. A similar ban was implemented in 2015 but was lifted two years later in 2017 following strong resistance from informal traders and the general public. That reversal came with the introduction of import duties instead.\n\nHowever, enforcing the new ban may prove to be a major challenge. Zimbabwes informal economy remains dominant, with recent ZimStat figures indicating that 76 percent of the economy operates outside formal structures. Additionally, 88 percent of the countrys workforce is informally employed  many relying on vending and second-hand clothing sales for survival.\n\nDespite the strict-sounding directive, Garwe insisted that enforcement should not involve harassment of vendors. There is absolutely no need to be aggressive. Authorities should not use force or heavy-handed tactics, he said.\n\nThe ban threatens to disrupt the livelihoods of thousands of urban Zimbabweans who depend on vending, particularly the sale of affordable second-hand clothes, to make ends meet in the face of high unemployment and economic instability.\n\nThe second-hand clothing trade, known for offering low-cost alternatives to expensive retail clothing, has become a staple of urban markets. Many Zimbabweans flock to these stalls, where items such as jeans, jackets, and shoes can be bought for just a few dollars.\n\nStreet vending has also become a common sight in most cities, with pavements and bus termini transformed into informal marketplaces. Meanwhile, night-time vending has surged in popularity, as traders take advantage of reduced council patrols to operate under the cover of darkness  often with fewer disturbances from authorities.\n\nWhether this latest move will succeed where previous efforts have failed remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "HARARE – The Zimbabwean government has announced an immediate ban on the importation and sale of second-hand clothing, popularly known … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/just-in-government-bans-mabhero-street-vending-with-immediate-effect/\">Continue reading<span class=\"screen-reader-text\"> \"Just In: Government Bans Mabhero, Street Vending With Immediate Effect\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Thomas Partey Set to Join Villarreal After Arsenal Exit",
            "url": "https://www.zimeye.net/2025/08/04/thomas-partey-set-to-join-villarreal-after-arsenal-exit/",
            "content": "Sports Correspondent\n\nFormer Arsenal midfielder Thomas Partey is on the verge of completing a move to Spanish side Villarreal, according to reports.\n\nPartey, 32, has already undergone a medical and is expected to sign a two-year contract that will keep him at the club until 2027.\n\nThe Ghanaian international became a free agent after his contract with Arsenal expired at the end of June. His desire to continue competing in the UEFA Champions League is believed to have played a key role in his decision to join Villarreal.\n\nThe move marks a return to La Liga for Partey, who previously starred for Atltico Madrid before joining Arsenal in 2020.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Arsenal midfielder Thomas Partey is on the verge of completing a move to Spanish side Villarreal, according … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/thomas-partey-set-to-join-villarreal-after-arsenal-exit/\">Continue reading<span class=\"screen-reader-text\"> \"Thomas Partey Set to Join Villarreal After Arsenal Exit\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Chelsea FC Secures Young Talent with Jorrel Hato Signing",
            "url": "https://www.zimeye.net/2025/08/04/chelsea-fc-secures-young-talent-with-jorrel-hato-signing/",
            "content": "Sports Correspondent\n\nChelsea FC has made a significant addition to its defensive lineup with the official signing of 19-year-old Dutch defender Jorrel Hato from Ajax. The transfer, valued at approximately $49 million USD (37 million), marks a notable investment in young talent for the Blues.\n\nHato has committed to Chelsea FC with a long-term contract that will keep him at the club until 2032. This extended deal reflects the clubs confidence in the young defenders potential and their vision for building a strong squad for the future.\n\nJorrel Hatos move to Chelsea FC is seen as a strategic acquisition, bringing fresh talent and potential to the teams defensive ranks. At just 19 years old, Hato has already demonstrated his capabilities at Ajax, and Chelsea FC is likely hoping that he will continue to grow and develop into a key player for the club.\n\nWith his signing now official, Hato will likely look to integrate himself into Chelsea FCs squad and make an immediate impact. The Blues fans will be eager to see how he adapts to the teams playing style and contributes to their defensive solidity in the coming seasons.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Chelsea FC has made a significant addition to its defensive lineup with the official signing of 19-year-old Dutch … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/chelsea-fc-secures-young-talent-with-jorrel-hato-signing/\">Continue reading<span class=\"screen-reader-text\"> \"Chelsea FC Secures Young Talent with Jorrel Hato Signing\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Understanding Ringworm in Cattle: A Guide to Causes, Risks, and Treatment",
            "url": "https://www.zimeye.net/2025/08/04/understanding-ringworm-in-cattle-a-guide-to-causes-risks-and-treatment/",
            "content": "By Dr. Trywell Muzerengi\n\nRingworm in cattle  medically referred to as Dermatophytosis  is a contagious fungal skin infection caused by dermatophytes, and not actual worms, despite its misleading name. It primarily affects young calves, especially during the cold winter months when cattle are housed in crowded, poorly ventilated environments.\n\n Causative Agent\n\nThe main culprit in cattle is the fungus Trichophyton verrucosum, which specifically targets bovines.\n\n Transmission\n\nRingworm is highly contagious and can spread through:\n\nDirect contact with infected animals\n\nContaminated objects, including brushes, halters, and fences\n\nEnvironmental spores, which can survive for months\n\nPoor barn conditions, especially overcrowding and lack of ventilation\n\n Clinical Signs\n\nFarmers should look out for:\n\nCircular, greyish-white crusty lesions\n\nPatchy hair loss (alopecia), especially on the head, ears, neck, shoulders, and back\n\nScaly or raised skin that may be mildly itchy\n\nMore severe infections in young, malnourished, or immunosuppressed cattle\n\n Zoonotic Risk\n\nRingworm can also infect humans, particularly farm workers and children, causing red, itchy, ring-shaped rashes on the skin. This highlights the importance of early detection and proper hygiene.\n\n Diagnosis\n\nThough often diagnosed based on appearance, confirmation methods include:\n\nSkin scraping and microscopy (KOH preparation to see fungal hyphae)\n\nFungal culture\n\nWoods lamp test (note: not reliable for T. verrucosum)\n\n Treatment Options\n\nWhile Dermatophytosis often self-cures, treatment is recommended to prevent spread:\n\nIdeal for mild or localized cases:\n\nLime sulfur (1:16) or Enilconazole (1:100) rinse\n\nTwice-a-week applications\n\nOther options: Miconazole, Iodine, or Chlorhexidine washes\n\nRemove crusts with a brush and discard the brush and burn the infective material, advises veterinary guidelines.\n\nFor severe or outbreak scenarios:\n\nGriseofulvin (restricted in food animals in some regions)\n\nIvermectin (some antifungal effect but not first-line)\n\nClean and disinfect barns, feeding troughs, and grooming tools\n\nUse antifungal disinfectants such as bleach (1:10 solution)  though some vets caution that bleach can be irritating and hazardous to humans\n\n Recovery & Immunity\n\nLesions can take weeks to fully heal\n\nImmunity generally develops after infection, making reinfection rare in older animals\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Ringworm in cattle — medically referred to as Dermatophytosis — is a contagious fungal skin infection … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/understanding-ringworm-in-cattle-a-guide-to-causes-risks-and-treatment/\">Continue reading<span class=\"screen-reader-text\"> \"Understanding Ringworm in Cattle: A Guide to Causes, Risks, and Treatment\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Case Of Injured Nurse Exposes Deep Rot in Zimbabwe’s Health System",
            "url": "https://www.zimeye.net/2025/08/04/case-of-injured-nurse-exposes-deep-rot-in-zimbabwes-health-system/",
            "content": "By A Correspondent\n\nThe painful story of Progress Muzuva  a nurse injured in the line of duty in 2018  has become more than just a personal tragedy. It now serves as a glaring indictment of Zimbabwes broken healthcare administration and its failure to protect those who risk their lives on the frontlines.\n\nAfter six years of silence, the Ministry of Health and Child Care issued a statement on August 3 in response to growing public pressure and social media outrage. But instead of offering a clear resolution or tangible support, the Ministry offered a familiar cocktail of platitudes, bureaucratic jargon, and legal deflection.\n\nThe Ministry extends its sincere sympathy to Ms. Muzuva and her family, it said. However, it is important to note that resolution of such matters is not a one-day event.\n\nThat tone-deaf comment, observers say, captures everything wrong with how the government treats its healthcare workers  more paperwork than action, more sympathy than solutions.\n\nMs. Muzuva, whose injuries were sustained while performing her duties as a public servant, has been left to beg for help from the same public she once served. With no compensation, no proper medical attention, and no justice, she has now turned to online fundraising to cover urgent healthcare costs.\n\nThe Ministry claims the case is under active review by its legal team to determine whether all applicable legal and human resources guidelines were properly followed. But health experts and advocacy groups see the move as too little, too late.\n\nWhy does it take public shaming and media outrage for the Ministry to wake up? asked one nurse union representative. This shouldve been handled in 2018, not 2025.\n\nThe Ministrys statement went on to promise a broader review of how occupational injuries are handled and pledged to work with stakeholders like the Health Services Commission. Yet critics argue this sudden concern is performative and reactionary.\n\nIf Muzuva hadnt gone public, would they even be talking about this? said a former hospital administrator. The system is not just slow  its indifferent.\n\nThe Ministry insisted that no one injured in the line of duty should feel abandoned, but for Progress Muzuva and many other healthcare workers, abandonment is exactly what theyve experienced.\n\nBeyond Muzuvas case, the spotlight now turns to broader issues of compensation, accountability, and the chronic underfunding of Zimbabwes public health infrastructure. As long as frontline workers are treated as expendable, confidence in the Ministry will remain dangerously low.\n\nThe government may have released a statement  but what the nation needs is reform, not rhetoric.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The painful story of Progress Muzuva — a nurse injured in the line of duty in 2018 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/case-of-injured-nurse-exposes-deep-rot-in-zimbabwes-health-system/\">Continue reading<span class=\"screen-reader-text\"> \"Case Of Injured Nurse Exposes Deep Rot in Zimbabwe’s Health System\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Nurse Injured On Duty in 2018 Still Waiting For Assistance As Health Ministry Moves at Snail’s Pace…",
            "url": "https://www.zimeye.net/2025/08/04/nurse-injured-on-duty-in-2018-still-waiting-for-assistance-as-health-ministry-moves-at-snails-pace/",
            "content": "By A Correspondent\n\nThe Ministry of Health and Child Care has finally broken its silence over the tragic case of Progress Muzuva  a nurse who sustained severe injuries while on duty back in 2018  but its statement offers little beyond vague assurances and bureaucratic excuses.\n\nIn a press release dated August 3, the Ministry acknowledged public outrage and recent media attention, saying it had noted with concern the reports circulating about Ms. Muzuvas deteriorating health and desperate appeal for assistance.\n\nDespite extending what it called sincere sympathy, the Ministry has offered no concrete support to the former nurse who continues to suffer while waiting for the system to act.\n\nThis case has not been ignored by the current administration, the Ministry claimed. However, it is important to note that resolution of such matters is not a one-day event.\n\nYet for six long years, Ms. Muzuva has remained without medical support, compensation, or justice. Critics argue that what the Ministry calls procedures actively underway is little more than administrative foot-dragging.\n\nThe Ministry explained that the case had been referred to legal advisors to assess whether all applicable legal and human resources guidelines were properly followed, but admitted that it is only now beginning this review  nearly half a decade after the injury occurred.\n\nIn its statement, the Ministry said:To that end, the matter was referred to the Ministrys legal advisors to assess whether all applicable legal and human resources guidelines were properly followed during her handling, including her leave, retirement, and any associated benefits.\n\nObservers say the move comes too late. While the Ministry speaks of working with urgency, Progress Muzuva is left crowd-funding for life-saving treatment.\n\nActivists and health workers say this is not an isolated case, but part of a broader pattern of negligence and abandonment of frontliners. The Ministrys own admission that it is initiating a broader review of internal systems to improve how injury cases are handled only reinforces the fact that existing systems have failed.\n\nWe assure the public and our health workers that the Ministry remains firmly committed to upholding the welfare of all who serve in our healthcare system, the statement added. No one injured in the line of duty should feel abandoned.\n\nBut Ms. Muzuva, and many others like her, already do.\n\nAs public frustration grows, citizens are demanding more than just statements and sympathy. They want accountability, compensation, and above all, action. The question remains  how many more health workers must suffer before the system they serve starts serving them?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Ministry of Health and Child Care has finally broken its silence over the tragic case of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/nurse-injured-on-duty-in-2018-still-waiting-for-assistance-as-health-ministry-moves-at-snails-pace/\">Continue reading<span class=\"screen-reader-text\"> \"Nurse Injured On Duty in 2018 Still Waiting For Assistance As Health Ministry Moves at Snail’s Pace…\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Apostle Chiwenga Changes Own Poison Story While Altering Divorce Story To Say He Didn’t Divorce Yet He Divorced",
            "url": "https://www.zimeye.net/2025/08/04/apostle-chiwenga-changes-own-poison-story-while-altering-divorce-story-to-say-he-didnt-divorce-yet-he-divorced/",
            "content": ".\n\nHarare  3 August 2025 |  Do Not Stone David: Apostle Chiwenga Reveals 96-Hour Marriage, Poisoning Allegations, and Looming Scandal in Explosive Confession By Dorrothy Moyo | ZimEye | In an emotionally charged confession before his congregation, Apostle Talent Chiwenga broke his silence on the collapse of his marriage to Nyasha Vanessa Werengastating he lived with her as husband and wife for only 96 hours.\n\nHe made these revelations while changing his divorce story to say he did not at all divorce, and that he did not chase his wife, and yet announcing that he truly chased his new wife away.\n\nChiwenga on Sunday urged his followers not to stone David, referencing the biblical story of King David nearly being attacked by his own men, and pleaded with them not to turn against him in anger. He warned of embarrassing videos and audios allegedly recorded without his consent that are set to be released in what he described as a campaign to damage his reputation.\n\nThe man who titles self Apostle accused Verenga of attempting to poison him, drawing parallels with a previous incident in which he says he was also poisoned. However, in a striking contradiction, Chiwenga gave 2006 as the date of the original poisoningan account that differs from his previously stated 2016 timeline. Chiwenga explained that despite fulfilling all cultural marriage rites in December 2023, he was forced to return his wife to her family just four days after publicly introducing her at the Revelation Gathering in May 2024, citing irreparable irregularities in her personal life and character.\n\nHe insisted the separation does not constitute a divorce but a traditional annulment, warning his congregation to brace for coordinated efforts to tarnish his name. This is not a divorce. I never lived with her long enough to call it that, Chiwenga said. Even if I was given 10 chances to stay with her, I would still send her back 10 times.\n\nAddressing his congregation for the first time on the matter, Chiwenga spoke of betrayal, security fears, and cultural expectations, revealing that the woman once introduced as his wife was returned to her family just four days after her public unveiling at a church event. The Apostle described disturbing findings, including secret recordings and suspected poisoning attempts, insisting the separation was not a divorce but a traditional rejection based on irreparable character flaws.\n\n Spiritual Foundation and Moral Integrity The foundation of God stands sure  introduction rooted in Scripture. Urges believers to depart from iniquity and maintain godly conduct. Refuses to retaliate or slander Nyasha publicly, insisting she is not his enemy.\n\n Clarification on Relationship Termination Confirms Nyasha Vanessa Verenga was sent back home, not chased or abused. Asserts the separation is not a divorce, but a cultural return due to irreparable character flaws. Emphasizes no cohabitation or consummation occurred that would qualify as a formal marriage under cultural norms.\n\n Reasons for Return and Incompatibility States he discovered serious irregularities in her character and personal behavior. Accuses her of secretly recording private conversations and interactions. Says recordings were sent to unidentified individuals, raising concerns of privacy and safety.\n\n Health, Security, and Psychological Impact Discloses past suspected poisoning, prompting medical checks and life adjustments. Ordered Nyasha to stop cooking for him due to fear of being harmed. Mentions internal bleeding and near-death experience as ongoing health threats.\n\n Attempts at Resolution with Werenga Family Made efforts to reconcile by involving her family members. Flew relatives in regularly to address issues, which proved costly and ineffective. Concluded that Werenga family lacked capacity to correct the issues.\n\n Privacy, Media Pressure, and Preemptive Disclosure Thanks church for not speculating amid public rumours. Warns members to prepare for damaging interviews and leaked materials. Says he spoke out to defend his name before misinformation spreads.\n\n Faith Leadership and Accountability Reminds followers to remain grounded in faith and not swayed by lies. Claims nothing he said is untrue, unknown to her family, or unadmitted by her. Stresses the importance of leading by example and not being reactive.\n\n Encouragement to Congregants Encourages discernment and loyalty, likening his situation to Davids biblical trials. Warns against becoming soft targets to the enemy or household of wickedness. Urges members to continue praying for him and remain steadfast in faith.\n\n Final Position and Emotional Closure Firmly declares he does not regret sending her back, but regrets marrying her. Admits personal pain but frames it as part of leadership and spiritual testing. Closes with congregant voices of support: We dont leave for this everything happened for good.\n\nThe following is the verbatim transcript of Apostle Talent Chiwengas confession from Sunday, 3 August 2025, as he announced that his latest marriage collapsed after 4 days.\n\nApostle Talent Chiwenga  Full Confession (Part 2)\n\nDelivered Sunday, 3 August 2025\n\nThing is, may God help you to be discerning so that you dont take up stones against your leader like the soldiers of David tried to do when they were attacked by the enemy. The enemy is not David. The enemy are the Amalekites. May God continue to guide you.\n\nDo not allow someone to tell you something about someone that you know and believe it. Nobody can come to me and tell me how wicked Pastor Erengwi is. I know Pastor Erengwi. Ive worked with her. Even when she has made a terrible mistake, I know its an honest mistake. She wouldnt have done it with an evil intention.\n\nThe second thing I want to say is that lets get stronger as princes of the kingdom Let us learn how to use this word. Dont be a soft target, especially to those of the household of wickedness.\n\nThirdly, you need to go to your praying for the men of God, because there are certain battles that I fight that you dont know about. I fight them all the time.\n\nWe were not last attacked in 2020 in July. The devil stopped attacking us using accidents. They now changed their tactic. All right?\n\nIt is against this background that I want you to take also this announcement carefully. It is against this background to tell you sad news.\n\nOn 4 May 2024, it was a Saturday last year. We had a Revelation Gathering that was starting, I think, on the 3rd. It ended on the 5th, which was a Sunday. We dedicated the afternoon of May the 4th, 2024 to introduce a woman that was meant to be my wife. The name of this woman is Nyasha Vanessa Werenga. We introduced her to you after having completed all the necessary cultural requirements of marrying a wifesomething that we are proud about.\n\nIt is very sad for you to know now that on the 8th of the same month, 8 May, Wednesday, 8 May 2024, I had to send back Mrs. Nyasha Vanessa Werenga to her fathers house, having discovered that she was fraught with irreparable irregularities in her personal life and character. Thats something I could not live with.\n\nSome of the things I discovered on that very day on the 4th of May. But it was too late for me to do anything to change the course of that day. I was also doing some evaluations: How much damage has she caused already? And how safe are we? Am I healthy? Have I not been poisoned? Such questions like that had to be asked.\n\nMs. Nyasha Vanessa Werenga was married on the 16th of December, 2023. Thats when we paid. She came to my house on the 26th of December, 2023.\n\nAround 13 February, we had sent her back again. That was the first time we sent her back. When we introduced her to you, she had just come back from her fathers house. She stayed there for more than a month.\n\nI reached out as culture requires to parents, complained about the serious personality irregularities that were around. The back and forth conversations could not resolve any of those issues.\n\nSo since the 8th of May 2024, I have not had a wife. She went back; I sent her back.\n\nBetween the 8th of May and the 7th of August, we continued conversations between the Chiwenga family and the Werenga family, hoping to see if they had the capacity to address some of those issues. It wasnt successful, and that is when we finally made a communication to them that there is no marriage between me and her.\n\nNow, there is a lot of speculations that were going around. I want to thank you for respecting my privacy. You did not speculate. Those who are speculating are not our people. They are onlookers, journalists, those who are looking for something to use to attack me with.\n\nWe ignored those speculations because we dont communicate prematurely. Theres nothing to rush to. Theres nothing to rush about.\n\nMarriage is a very important institution to God. We value it. We preach about it every day. It was an experiment. Marrying was done properly and procedurally with good intention.\n\nBut our culture is a rule and practice that when a woman is married and she is returned to a fathers house within 12 months of her getting married because of serious irregularitieseither on her body or in her characterthat is not a divorce. Its a returning of a woman who could not meet the requirements of a marriage.\n\nA divorce happens when a womanin our culturea divorce happens when a man and a woman have lived together for at least a year, or if they had a child between them in that year. Nothing of that sort applies between me and her. So it is not a divorce because I never stayed with her.\n\nI returned her to her fathers house because she fails to meet, by every standard, the minimum requirements of a properly raised woman to hold the capacity of a wife of an ordinary man, let alone a man of God with such a huge responsibility that I have.\n\nThroughout these months and throughout the engagements we have had with the family, Ive gone through a lot of challenges myselfchallenges that I cannot share with you because I dont want to take this platform to attack the person Im talking about. Men do not gossip about women in their absence. Its not built in us to do so.\n\nA few things I can share with you that Im not ashamed to share with you about that form the basis of this position that we took so many months agomore than a year now. It begins with the recording of family life.\n\nWe found out that she was in custody of different forms of recordings, from audio recordings to video recordings and pictures, which she was sending to unknown people whom we could not establish who they are.\n\nI cant stand here before you and lie to make myself look like a good man. Discussing my personal life is the last thing I wanted to do to you. But Im saying now.\n\nI have footages of things that she was recording without my knowledge, including recordings of conversations with my children without my knowledge. Even though we seized the files that we found in the custody, we are sure that those files are in different directions because they were sent. We could see that they were being sent to a number that was deleted or that was hidden.\n\nSo one of the reasons why I am sharing this with youit is so that you may be ready to get yourself nauseated with those files that she collected without my knowledge.\n\nI cannot talk about other things that have to do with how a man and his wife are to live in the house that make up the bulk of the reasons why I had to send her back.\n\nI want you to know that even if I was going to be given 10 chances to stay with her again, with this behavior that I saw in those few monthsless than three monthsI could still send her back 10 times.\n\nI do not regret sending her back to her family. I regret having married from the beginning. And Ill talk briefly about that.\n\nNow, it is important for you to realize that when you get married, or when you marry a woman, you bring her to your house. She sleeps by your side. She prepares meals for you.\n\nAn ordinary man who is unsuspecting feels free to expose himself as the most vulnerable place a man can be. Think about what harm that person could do if he or she is recording you and sending those files to people that you have never met.\n\nAnd you speak to her many times and she continues to promise that she was just doing it for fun. She wont do it again. What would you do?\n\nThe first thing you must do is to find out how much harm she has done.\n\nI had to go to Asia to get a thorough medical checkup, having suspected of poisoning.\n\nI want you to know that for the remainder of the months that she was with meor the days she was with meI had already ordered that she does not prepare meals for me. She was just staying, but she was no longer preparing food for me, because of the fear that I might get myself laced again.\n\nThe member was poisoned in 2006. It required us to adjust our life. It required us to change where we stayed. It required us to reorganize the school for our children. It required us to change a lot of security installations. And that costed also money.\n\nYou cant just change where you stay. If you have a property, what do you do with your house? You cant just wake up and say, Im changing where to stay. You cant.\n\nIt requires you to raise money to fix these issues. And this capital-intensive adjustment program is the reason why it took me a year to come to you and to tell you that that is what has happened.\n\nNow, there are two things I want to add to this before I explain what went wrong with this woman.\n\nThe first issue is that I dont live alone. At no point do you find it when youre alone in the house. The work that I do requires that I live with at least 10 people at my house at any given time.\n\nSo the behavior of Mrs. Nyasha Vanessa Werenga is not a secret that I alone can share with you.\n\nIm happy that though it was a very painful situation, I was patient enough to reach out to a family and they gave me an aunt, a father, a sister, who visited many times with herbecause she was no longer in my custody all the timeto discuss these issues and see if we could find help.\n\nSomething that was very expensive, because I had to fly more than two people every other week in the process of trying to discuss, to reconcile the situation on the ground with the ideal situation of what is expected of a marriage.\n\nIts also painful to invest a lot of money buying air tickets to organize that people travel from one country to another to meet with you over a situation that you now know.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "…. Harare – 3 August 2025 | 📰 “Do Not Stone David”: Apostle Chiwenga Reveals 96-Hour Marriage, Poisoning Allegations, and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/apostle-chiwenga-changes-own-poison-story-while-altering-divorce-story-to-say-he-didnt-divorce-yet-he-divorced/\">Continue reading<span class=\"screen-reader-text\"> \"Apostle Chiwenga Changes Own Poison Story While Altering Divorce Story To Say He Didn’t Divorce Yet He Divorced\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Picture: Citizens’ Leader Advocate Chamisa Enters Zanu PF Territory — Mberengwa Visit Ignites Hope",
            "url": "https://www.zimeye.net/2025/08/04/picture-citizens-leader-advocate-chamisa-enters-zanu-pf-territory-mberengwa-visit-ignites-hope/",
            "content": "By Tinashe Sambiri\n\nIn a surprising political move, former Citizens Coalition for Change (CCC) leader Advocate Nelson Chamisa has made a rare appearance in Mberengwa  widely regarded as a Zanu PF stronghold  drawing mixed reactions from political observers and citizens alike.\n\nChamisa posted a photograph of himself in the rural Midlands district on Facebook on Sunday, accompanied by a subtle but loaded caption.\n\nMBERENGWA is a fascinating place I love the feedback Im getting. Never give up Blessed Sunday to you! he wrote.\n\nThough brief, the message and image sparked debate online, with supporters praising his courage and critics questioning his intentions.\n\nMberengwa has long been a political fortress for the ruling party, making Chamisas presence there more than just symbolic. His visit is being interpreted by analysts as part of a broader rural outreach strategy aimed at challenging Zanu PF on its home turf.\n\nIts bold. Chamisa is sending a message that no area is off limits, said a political analyst based in Gweru. But its also a gamble. Hes stepping into deeply politicised territory.\n\nOthers have accused him of posturing without a clear political vehicle, given the internal chaos and collapse of the CCC.\n\nStill, to his followers, Chamisas quiet entry into enemy ground represents defiance, hope, and a potential shift in the nations political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri In a surprising political move, former Citizens Coalition for Change (CCC) leader Advocate Nelson Chamisa has made … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/picture-citizens-leader-advocate-chamisa-enters-zanu-pf-territory-mberengwa-visit-ignites-hope/\">Continue reading<span class=\"screen-reader-text\"> \"Picture: Citizens’ Leader Advocate Chamisa Enters Zanu PF Territory — Mberengwa Visit Ignites Hope\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Chadzamira Invades Vapositori Conference …",
            "url": "https://www.zimeye.net/2025/08/04/chadzamira-invades-vapositori-conference/",
            "content": "By A Correspondent\n\nIn what critics are calling a blatant politicisation of the pulpit, Minister of State for Provincial Affairs and Devolution in Masvingo, Ezra Chadzamira, invaded a religious gathering over the weekend in Masvingo, using the platform to push the ruling partys political narrative.\n\nAddressing congregants at the Johane the Fifth of Africa International Church provincial conference, led by Archbishop Andby Makururu, Chadzamira praised the churchs strong following and encouraged its members to align with government initiatives fronted by President Emmerson Mnangagwa.\n\nOur government has got a very strong relationship with the church, especially our indigenous churches. We recognise the church for its strong following and moral influence, hence we call members to be part of the development trajectory being led by our President, Emmerson Mnangagwa, said Chadzamira.\n\nObservers, however, have criticised the move, accusing the government of hijacking religious platforms for political gain. With Zimbabwes socio-economic woes worsening, some see such events as attempts to exploit faith communities to maintain political control, particularly in rural strongholds.\n\nChadzamira also promoted government programmes in agriculture, tourism, and mining, calling on the church to participate. We are implementing various programmes in communities Be part of those programmes to improve your livelihoods, he said. He further urged churches to help in the fight against drug and substance abuse.\n\nArchbishop Makururu responded positively, saying, As a church, we value the relationship we have with the government Our church is not only a spiritual refuge but also a source of livelihood for many.\n\nBut critics argue the church is being co-opted. When ministers show up at church events not to worship but to preach party politics, it becomes clear that the church is being used, said a local observer.\n\nSome clergy members have warned that such partnerships dilute the prophetic voice of the church. Once the church becomes an echo chamber for politicians, it loses its moral authority, one pastor remarked.\n\nWhile the government insists that its relationship with religious groups is mutually beneficial, the growing use of the pulpit for political messaging  as seen in Masvingo  raises serious concerns about the independence and integrity of faith institutions.\n\nA government official at Benjamin Burombo Building in Masvingo defended the ministers visit to the church saying:\n\nMinister Chadzamira was simply engaging the community on crucial programmes.\n\nThere is nothing wrong with encouraging churches to take part in national programmes. This is part of the governments inclusive approach to governance. The church is a key partner in development, and we value that collaboration.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In what critics are calling a blatant politicisation of the pulpit, Minister of State for Provincial Affairs … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/chadzamira-invades-vapositori-conference/\">Continue reading<span class=\"screen-reader-text\"> \"Chadzamira Invades Vapositori Conference …\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        },
        {
            "title": "Chinamasa Shrugs Off Dissent, Endorses Tagwirei for Central Committee",
            "url": "https://www.zimeye.net/2025/08/04/chinamasa-shrugs-off-dissent-endorses-tagwirei-for-central-committee/",
            "content": "By A Correspondent\n\nZANU PF Secretary for Legal Affairs Patrick Chinamasa has confirmed that the co-option of Harare province member Dr. Kudakwashe Tagwirei into the ruling partys Central Committee will be formally adopted at the next Central Committee meeting, settling weeks of speculation and controversy.\n\nChinamasa announced this following the 385th Ordinary Session of the Politburo, where several co-options were tabled and approved, with Tagwireis inclusion pending final adoption.\n\nAt its 385th Ordinary Session of the Politburo, the following co-options were tabled by the National Political Commissar and were approved: Mash West, Cdes Polite Kambamura, Christine Gwati and Joseph Serima; Mat North, Cde Collen Ndebele, he said.\n\nThis means that at the next ZANU PF Central Committee meeting, the National Political Commissar will table for noting and adoption five co-options into the Central Committee, namely Cdes Kudakwashe Tagwirei, Polite Kambamura, Christine Gwati, Joseph Serima and Collen Ndebele.\n\nHERES CHINAMASAS FULL STATEMENT:\n\nThe Zanupf Department of Legal Affairs is relieved and takes note that the furore/controversy/confusion/wrangle/much ado about nothing/social media hype/misinformation/disinformation that surrounded Harare Provincial Coordinating Committee (PCC) cooption of Cde Kudakwashe Tagwirei into the Zanupf Central Committee is now over and irreversibly settled.\n\nFrom the outset, it was difficult to understand the source of the problem.\n\nOur Harare PCC convened on Monday, 31 March 2025, and voted to recommend the cooption of Cde Tagwirei into the Central Committee. The Province addressed the letter of recommendation to the Zanupf Secretary General, Cde Dr. Obert Moses Mpofu. The letter was copied to the Departments of the Commissariat and Legal Affairs, amongst others.\n\nThe National Political Commissar, Cde Munyaradzi Machacha, tabled the recommendation at the 384th Ordinary Session of the Politburo, held at Zanupf Headquarters on Wednesday, 2nd July 2025, and the cooption of Cde Tagwirei into the Zanupf Central Committee was approved, pending reporting to the Central Committee for adoption. There was no objection in the Politburo meeting to the recommendation by Harare Provincial Coordinating Committee.\n\nWhen the 385th Ordinary Session of the Politburo sat on Wednesday, 30th July 2025, at the Zanupf Headquarters, and with Vice President and Second Secretary, General (Rtd) Dr. C.G.D.N. Chiwenga chairing, the Politburo confirmed its Minutes of the 384th Meeting (prepared by the Secretary General, Dr. Mpofu) with minor amendments. Confirmed without amendment on page 22 of the Politburo Minutes was Item 7.1.7, headed:\n\nCo-option by Harare Province which read: The NPC indicated that prior to the issuance of the aforementioned co-option correspondences on co-options, some Provinces, including Harare, had already completed the process. In this regard, Cde Kudakwashe Tagwirei was co-opted by Harare Province and is now a Central Committee Member.\n\nAlso to be noted and confirmed by the Politburo, without amendment, on Wednesday, 30th July 2025, is Politburo Minutes Item 7.1.6 (also on page 22 of the Minutes), titled: Circular on Co-Options which read as follows: It was stated that in the light of the Central Committee vacancies mentioned above, the Department of Legal Affairs had drafted co-options guidelines, outlined in a circular dated 30th June 2025, signed by the Secretary of Legal Affairs, Cde P.A. Chinamasa. This circular superseded the previous circular dated 5th June 2025, signed by the Secretary General, Cde Dr. O.M. Mpofu, which sought to address a similar issue.\n\nSo the controversy surrounding Cde Tagwireis cooption into the Central Committee surprises me and took me completely off guard. Given Cde Tagwireis commitment to Zanupf and his track record in the service of the Party, the somewhat negative publicity and narrative surrounding his cooption into the Central Committee is undeserved.\n\nI have been a member of the Zanupf Central Committee continuously and without break since December 1987, and a member of the Zanupf Politburo since the year 2000 to date, and I can state unequivocally that throughout this long period of nearly 38 years as Central Committee or as Politburo, we have never had to debate, let alone discuss, PCC recommendations of cooptions into the Central Committee. We always treated such recommendations as fait accompli.\n\nThe cooption of Cde Tagwirei is the first ever to be the subject of discussion and social media commentaries. The only explanation why the Tagwirei cooption has attracted such controversy may be because there are people out there who, for reasons best known to themselves, have an axe to grindend of statement\n\nTagwirei, the controversial businessman, is seen as Mr Emmerson Mnangagwas preferred heir apparent. This has reportedly sparked tension between Vice President Constantino Chiwenga and Tagwirei as the two battle for full control of party affairs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Secretary for Legal Affairs Patrick Chinamasa has confirmed that the co-option of Harare province member … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/04/chinamasa-shrugs-off-dissent-endorses-tagwirei-for-central-committee/\">Continue reading<span class=\"screen-reader-text\"> \"Chinamasa Shrugs Off Dissent, Endorses Tagwirei for Central Committee\"</span></a></p>",
            "time": "06:58",
            "date": "05 Aug 2025"
        }
    ]
}