{
    "news": [
        {
            "title": "Details Emerge On The Death Of Veteran ZBC Reporter",
            "url": "https://www.zimeye.net/2025/01/31/details-emerge-on-the-death-of-veteran-zbc-reporter/",
            "content": "By Munacho Gwamanda- The family of the late Veteran journalist and former ZBC reporter Zvikomborero Sibanda has announced the cause of her death.\n\nZvikomborerosbrother, Stephen Sibanda, said she died of fibroid-related complications.\n\nThe former ZBC reporter died in Bulawayo on Thursday morning atthe age of46.\n\nStephen said she returned to Zimbabwe in November last year as she battled health issues caused by fibroids, adding that at onetimeshe had to undergo surgery in her battle with fibroids.\n\nAffectionately known asZvikoorKomboby colleagues, Sibanda was part of a dynamic group of young journalists who joined ZBC Montrose in 19992000.\n\nPrior tothis, she hadcompleted her internship atZimpapersBulawayo branch.\n\nAt Montrose, she worked alongside seasoned journalists such as Tapfuma Machakaire, Mary Mthabali, Sibusisiwe Ndlovu, and later Sifiso Sibanda, now the acting station managerat Montrose.\n\nSibandaseducational journey began at Nkulumane Primary School in Bulawayo.\n\nShe then attended Usher Girls High and Hermann Gmeiner High Schools before pursuing a Diploma in Mass Communication at Harare Polytechnic.\n\nAfter leaving ZBC in the mid-2000s, she transitioned into corporate communications, working at the National Oil Company of Zimbabwe.\n\nShe later relocated to South Africa, where she got married.\n\nMournersare gatheredat Block 75/2300 Mpopoma, Bulawayo, and funeral arrangements are yet to be announced.\n\nShe is survived by her husband.\n\nOne of her former colleagues shared a heartfelt tribute on social media:\n\nRest in Peace, Zviko. She was a fearless reporter who never hesitated to take on any assignment. Always receptive to guidance and criticism, she carried herself with a sociable spirit that endeared her to colleagues. She worked seamlessly with senior reporters like Prisca Utete and Selina Chitsiga and had no difficulty collaborating with the all-male camera crew. Zviko joined ZBC during a period of transformation and endured some of its toughest challenges. When she was suddenly elevated to Executive Producer, News, and instructed to present the 8 PM bulletin without prior experience, it was an unfair test of resilience. Despite the ordeal, she moved forward, later transitioning into public relations before relocating to South Africa. Rest in peace, Zviko.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- The family of the late Veteran journalist and former ZBC reporter Zvikomborero Sibanda has announced the cause … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/details-emerge-on-the-death-of-veteran-zbc-reporter/\">Continue reading<span class=\"screen-reader-text\"> \"Details Emerge On The Death Of Veteran ZBC Reporter\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Former ZBC Reporter Dies",
            "url": "https://www.zimeye.net/2025/01/31/former-zbc-reporter-dies/",
            "content": "By Munacho Gwamanda- Veteran journalist and former ZBC reporter Zvikomborero Sibanda has died.\n\nShe was 46.\n\nHer former colleagues at ZBC announced her passing, stating that she died at her family home in Bulawayo on Thursday morning.\n\nAffectionately known asZvikoorKomboby colleagues, Sibanda was part of a dynamic group of young journalists who joined ZBC Montrose in 19992000.\n\nPrior tothis, she hadcompleted her internship atZimpapersBulawayo branch.\n\nAt Montrose, she worked alongside seasoned journalists such as Tapfuma Machakaire, Mary Mthabali, Sibusisiwe Ndlovu, and later Sifiso Sibanda, now the acting station managerat Montrose.\n\nSibandaseducational journey began at Nkulumane Primary School in Bulawayo.\n\nShe then attended Usher Girls High and Hermann Gmeiner High Schools before pursuing a Diploma in Mass Communication at Harare Polytechnic.\n\nAfter leaving ZBC in the mid-2000s, she transitioned into corporate communications, working at the National Oil Company of Zimbabwe.\n\nShe later relocated to South Africa, where she got married.\n\nMournersare gatheredat Block 75/2300 Mpopoma, Bulawayo, and funeral arrangements are yet to be announced.\n\nShe is survived by her husband.\n\nOne of her former colleagues shared a heartfelt tribute on social media:\n\nRest in Peace, Zviko. She was a fearless reporter who never hesitated to take on any assignment. Always receptive to guidance and criticism, she carried herself with a sociable spirit that endeared her to colleagues. She worked seamlessly with senior reporters like Prisca Utete and Selina Chitsiga and had no difficulty collaborating with the all-male camera crew. Zviko joined ZBC during a period of transformation and endured some of its toughest challenges. When she was suddenly elevated to Executive Producer, News, and instructed to present the 8 PM bulletin without prior experience, it was an unfair test of resilience. Despite the ordeal, she moved forward, later transitioning into public relations before relocating to South Africa. Rest in peace, Zviko.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Veteran journalist and former ZBC reporter Zvikomborero Sibanda has died. She was 46. Her former colleagues at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/former-zbc-reporter-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Former ZBC Reporter Dies\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Limpopo Health Department Wary Of Rising Malaria Cases",
            "url": "https://www.zimeye.net/2025/01/31/limpopo-health-department-wary-of-rising-malaria-cases/",
            "content": "The Limpopo Department of Health has reported 557 confirmed malaria cases and three deaths in the 2024/25 year, highlighting the persistent threat of the disease in the province. Although the number of cases has decreased from previous years, health officials are working tirelessly to reduce these numbers, emphasizing that every malaria-related death is a tragedy.\n\nThe recent rains have created ideal breeding grounds for mosquitoes, increasing the risk of malaria transmission. The Department has stressed the need for vigilance, particularly after rainfall periods, and is focusing on preventing further deaths and cases of malaria.\n\nTo combat the disease, the Department is continuing its highly effective indoor residual spraying program, which has seen over 1.16 million homes sprayed in the past year. The public is urged to take immediate action to prevent malaria by:\n\n *Using Insect Repellent*: Applying insect repellent to exposed skin and clothing to prevent mosquito bites.\n\n *Wearing Protective Clothing*: Wearing long-sleeved shirts, long pants, and socks to cover skin.\n\n *Sleeping Under Mosquito Nets*: Using mosquito nets, especially in high-risk areas, to prevent mosquito bites while sleeping.\n\n *Taking Prophylactic Medication*: Travelers to malaria-endemic regions are advised to take prophylactic medication to reduce the risk of contracting the disease.\n\nBy taking these precautions and remaining vigilant, the public can help reduce the risk of malaria transmission and prevent further deaths.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Limpopo Department of Health has reported 557 confirmed malaria cases and three deaths in the 2024/25 year, highlighting the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/limpopo-health-department-wary-of-rising-malaria-cases/\">Continue reading<span class=\"screen-reader-text\"> \"Limpopo Health Department Wary Of Rising Malaria Cases\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Will Pasuwa Guide Flames To Success?",
            "url": "https://www.zimeye.net/2025/01/31/will-pasuwa-guide-flames-to-success/",
            "content": "Sports Correspondent\n\nKalisto Pasuwa, the former Dynamos and Warriors coach, has officially been appointed as the permanent head coach of the Malawi national football team.\n\nPasuwa, who previously enjoyed a successful tenure with Nyasa Big Bullets, was recommended for the role by the Football Association of Malawis Technical Sub-Committee.\n\nHaving secured five consecutive league titles with Nyasa Big Bullets, Pasuwa briefly served as the interim coach of the Flames. His most recent success includes guiding Malawi to a 1-1 draw against Burundi and a commanding 3-0 victory over Burkina Faso in the 2025 Africa Cup of Nations qualifiersthe latter marking Malawis first win in the qualifiers.\n\nWith his new permanent role, Pasuwa will have the freedom to choose his own backroom staff. It is anticipated that Michael Ngore, his former colleague at Nyasa Big Bullets, will likely join his coaching team.\n\nPasuwas appointment ushers in a new era for the Flames, following the departure of former coach Patrick Mabedi in October last year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kalisto Pasuwa, the former Dynamos and Warriors coach, has officially been appointed as the permanent head coach of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/will-pasuwa-guide-flames-to-success/\">Continue reading<span class=\"screen-reader-text\"> \"Will Pasuwa Guide Flames To Success?\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Zanu PF Parades More Defectors, But Will This Fix the Economy?",
            "url": "https://www.zimeye.net/2025/01/31/zanu-pf-parades-more-defectors-but-will-this-fix-the-economy/",
            "content": "By A Correspondent\n\nZanu PFs national political commissar, Munyaradzi Machacha, took to the stage on Wednesday to boast about the growing popularity of the ruling party.\n\nDuring the event, Machacha showcased a series of former opposition figures who had defected to Zanu PF, presenting their shift as a sign of the partys expanding influence.\n\nAmong the high-profile defectors was Jane Chifamba, the former MDC Senator for Marondera, who is now aligning herself with Zanu PF. Machacha highlighted Chifambas defection as a significant gain for the ruling party, alongside other notable figures making the shift.\n\nZanu PF is for everyone. We invite everybody to join Zanu PF. We wish to acknowledge the role Blessing Chebundo is playing in the recruitment process. Zanu PF ihomwe inokwana munhu wese, Machacha declared, emphasizing the partys inclusivity and welcoming approach to former political adversaries.\n\nHowever, while the defections are being celebrated within the party, the question remains: Will these political shifts have any tangible impact on Zimbabwes struggling economy? As the country continues to face high inflation, unemployment, and widespread poverty, many are left wondering if the changes in political allegiance can offer real solutions to these long-standing economic challenges.\n\nThe coming months will reveal whether this surge in defections will translate into effective governance or if it will remain a symbolic move in the partys strategy to strengthen its political base.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF’s national political commissar, Munyaradzi Machacha, took to the stage on Wednesday to boast about the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/zanu-pf-parades-more-defectors-but-will-this-fix-the-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Parades More Defectors, But Will This Fix the Economy?\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Zanu PF Commissar Challenges Everybody To Join Ruling Party …",
            "url": "https://www.zimeye.net/2025/01/31/zanu-pf-commissar-challenges-everybody-to-join-ruling-party/",
            "content": "By A Correspondent\n\nZanu PFs national political commissar, Munyaradzi Machacha, took to the stage on Wednesday to boast about the growing popularity of the ruling party.\n\nDuring the event, Machacha showcased a series of former opposition figures who had defected to Zanu PF, presenting their shift as a sign of the partys expanding influence.\n\nAmong the high-profile defectors was Jane Chifamba, the former MDC Senator for Marondera, who is now aligning herself with Zanu PF. Machacha highlighted Chifambas defection as a significant gain for the ruling party, alongside other notable figures making the shift.\n\nZanu PF is for everyone. We invite everybody to join Zanu PF. We wish to acknowledge the role Blessing Chebundo is playing in the recruitment process. Zanu PF ihomwe inokwana munhu wese, Machacha declared, emphasizing the partys inclusivity and welcoming approach to former political adversaries.\n\nHowever, while the defections are being celebrated within the party, the question remains: Will these political shifts have any tangible impact on Zimbabwes struggling economy? As the country continues to face high inflation, unemployment, and widespread poverty, many are left wondering if the changes in political allegiance can offer real solutions to these long-standing economic challenges.\n\nThe coming months will reveal whether this surge in defections will translate into effective governance or if it will remain a symbolic move in the partys strategy to strengthen its political base.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF’s national political commissar, Munyaradzi Machacha, took to the stage on Wednesday to boast about the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/zanu-pf-commissar-challenges-everybody-to-join-ruling-party/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Commissar Challenges Everybody To Join Ruling Party …\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Chief Chilonga Challenges Government to Provide Boats Amid Rising Drowning Incidents in Chiredzi",
            "url": "https://www.zimeye.net/2025/01/31/chief-chilonga-challenges-government-to-provide-boats-amid-rising-drowning-incidents-in-chiredzi/",
            "content": "By A Correspondent\n\nChief Chilonga of Chiredzi has called on the government to provide engine-powered boats to assist villagers in crossing the increasingly perilous Runde River, as annual drowning incidents continue to rise due to the flooding of Chilonga Bridge during the rainy season.\n\nThe chief, born John Beni, made the heartfelt plea during a community sensitization meeting held on Tuesday at the Chiredzi Rural District Council (RDC) boardroom. He highlighted the severe risks posed by the flooded bridge, which serves as a critical link between Chiredzi South and Chiredzi Town.\n\nEvery rainy season, Chilonga Bridge becomes impassable, and many lives are lost as people attempt to cross the river, often using makeshift boats, said Chief Chilonga.\n\nIt would be much safer if we had engine-powered boats to assist people in crossing. This could prevent more tragic drownings and save lives.\n\nThe chiefs remarks were echoed by local leaders, including Chiredzi Central MP Ropafadzo Makumire, Chiredzi East MP Siyaki Mundungehama, Chiredzi West MP Darlington Chiwa, and Chiredzi South MP Joel Sithole.\n\nAlso present were Chiredzi RDC Chairman Aspect Mashingaidze, CEO Ailes Baloyi, and several other councilors and stakeholders.\n\nThe rising number of drownings has become a major concern for the community. Many villagers are forced to risk their lives crossing the swollen river when the bridge is flooded, as they have no other way to reach the town or access essential services.\n\nIn response to the concerns raised, Chief Chilonga urged that the construction of a more reliable crossing point, such as a new bridge, be prioritized in the upcoming government infrastructure plans. The construction of Chilonga Bridge is already part of the Chiredzi RDCs draft master plan, but Chief Chilonga believes that immediate relief in the form of boats could help alleviate the ongoing danger faced by local residents.\n\nWe cannot afford to wait for a new bridge to be built before addressing the lives at risk, said Chilonga.\n\nThe government must act now and provide the resources to ensure that our people can cross the river safely.\n\nThe issue of flooding and the lack of safe transportation options across the Runde River is expected to be a major point of discussion at future community meetings, as locals and officials seek to find lasting solutions to the growing problem.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chief Chilonga of Chiredzi has called on the government to provide engine-powered boats to assist villagers in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/chief-chilonga-challenges-government-to-provide-boats-amid-rising-drowning-incidents-in-chiredzi/\">Continue reading<span class=\"screen-reader-text\"> \"Chief Chilonga Challenges Government to Provide Boats Amid Rising Drowning Incidents in Chiredzi\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Ramaphosa Is A Liar, Declares Kagame",
            "url": "https://www.zimeye.net/2025/01/31/ramaphosa-is-a-liar-declares-kagame/",
            "content": "By A Correspondent\n\nRwandas President Paul Kagame has accused South Africas President Cyril Ramaphosa of dishonesty regarding their conversations about the conflict in the Democratic Republic of Congo (DRC).\n\nKagame claims that Ramaphosas public statements about their discussions have been distorted and filled with lies.\n\nI held two conversations this week with President Ramaphosa on the situation in Eastern DRC, including earlier today.\n\nWhat has been said about these conversations in the media by South African officials and President Ramaphosa himself contains a lot of distortion, deliberate attacks, and even lies, Kagame stated.\n\nKagame clarified several points, including that the Rwanda Defence Force is a professional army, not a militia. The Rwanda Defence Force is an army, not a militia, he emphasized.\n\nHe also criticized the Southern African Development Community (SADC) Mission in the DRC (SAMIDRC), stating that it is not a peacekeeping force, but rather a belligerent force authorized to engage in combat operations. SAMIDRC is not a peacekeeping force, and it has no place in this situation. It was authorized by SADC as a belligerent force engaging in offensive combat operations to help the DRC Government fight against its own people, working alongside genocidal armed groups like FDLR which target Rwanda, while also threatening to take the war to Rwanda itself.\n\nKagame also denied that Ramaphosa had given him any warnings, saying, President Ramaphosa has never given a warning of any kind, unless it was delivered in his local language which I do not understand.\n\nFurthermore, Kagame revealed that Ramaphosa confirmed to him that the M23 rebels did not kill the South African soldiers, but rather the FARDC (Armed Forces of the Democratic Republic of the Congo). President Ramaphosa confirmed to me that M23 did not kill the soldiers from South Africa, FARDC did, Kagame said.\n\nKagame emphasized that South Africa is not in a position to be a peacemaker or mediator in the conflict, stating, If South Africa wants to contribute to peaceful solutions, that is well and good, but South Africa is in no position to take on the role of a peacemaker or mediator. And if South Africa prefers confrontation, Rwanda will deal with the matter in that context any day.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Rwanda’s President Paul Kagame has accused South Africa’s President Cyril Ramaphosa of dishonesty regarding their conversations about … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/ramaphosa-is-a-liar-declares-kagame/\">Continue reading<span class=\"screen-reader-text\"> \"Ramaphosa Is A Liar, Declares Kagame\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Malaria Claims Three Lives in Limpopo",
            "url": "https://www.zimeye.net/2025/01/31/malaria-claims-three-lives-in-limpopo/",
            "content": "By A Correspondent\n\nThe Limpopo Department of Health has reported 557 confirmed malaria cases and three deaths in the 2024/25 year, highlighting the persistent threat of the disease in the province. Although the number of cases has decreased from previous years, health officials are working tirelessly to reduce these numbers, emphasizing that every malaria-related death is a tragedy.\n\nThe recent rains have created ideal breeding grounds for mosquitoes, increasing the risk of malaria transmission. The Department has stressed the need for vigilance, particularly after rainfall periods, and is focusing on preventing further deaths and cases of malaria.\n\nTo combat the disease, the Department is continuing its highly effective indoor residual spraying program, which has seen over 1.16 million homes sprayed in the past year. The public is urged to take immediate action to prevent malaria by:\n\nBy taking these precautions and remaining vigilant, the public can help reduce the risk of malaria transmission and prevent further deaths.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Limpopo Department of Health has reported 557 confirmed malaria cases and three deaths in the 2024/25 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/malaria-claims-three-lives-in-limpopo/\">Continue reading<span class=\"screen-reader-text\"> \"Malaria Claims Three Lives in Limpopo\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        },
        {
            "title": "Pasuwa Appointed Permanent Head Coach Of Malawi National Team",
            "url": "https://www.zimeye.net/2025/01/31/pasuwa-appointed-permanent-head-coach-of-malawi-national-team/",
            "content": "Sports Correspondent\n\nKalisto Pasuwa, the former Dynamos and Warriors coach, has officially been appointed as the permanent head coach of the Malawi national football team.\n\nPasuwa, who previously enjoyed a successful tenure with Nyasa Big Bullets, was recommended for the role by the Football Association of Malawis Technical Sub-Committee.\n\nHaving secured five consecutive league titles with Nyasa Big Bullets, Pasuwa briefly served as the interim coach of the Flames. His most recent success includes guiding Malawi to a 1-1 draw against Burundi and a commanding 3-0 victory over Burkina Faso in the 2025 Africa Cup of Nations qualifiersthe latter marking Malawis first win in the qualifiers.\n\nWith his new permanent role, Pasuwa will have the freedom to choose his own backroom staff. It is anticipated that Michael Ngore, his former colleague at Nyasa Big Bullets, will likely join his coaching team.\n\nPasuwas appointment ushers in a new era for the Flames, following the departure of former coach Patrick Mabedi in October last year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kalisto Pasuwa, the former Dynamos and Warriors coach, has officially been appointed as the permanent head coach of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/pasuwa-appointed-permanent-head-coach-of-malawi-national-team/\">Continue reading<span class=\"screen-reader-text\"> \"Pasuwa Appointed Permanent Head Coach Of Malawi National Team\"</span></a></p>",
            "time": "06:31",
            "date": "01 Feb 2025"
        }
    ]
}