{
    "news": [
        {
            "title": "How Nadia Was Kidnapped In Abigail Mupambi’s Words",
            "url": "https://www.zimeye.net/2025/03/11/how-nadia-was-kidnapped-in-abigail-mupambis-words/",
            "content": "Brief speech by Abigail Mupambi on Monday | ZimEye | We left town at around five. I was driving, with Nadia and other colleagues, whom I dropped off in town. I was the one who dropped Nadia at her gate. I was also the one speaking with her as she entered the house because she was sharing that there was no electricity. You know how general conversations go.\n\nAbout 15 minutes later, Nadia tried to reach out to me, but I did not pick up. I proceeded to my place. Later on, a colleague called me, asking, Are you safe? I was confused, wondering what kind of question that was. They had received a hint about Nadiain a crying mode.\n\nAt around 10 PM, I checked only the text messages, and by half past 7 PM, we started sensing that something could be wrong. We tried to call multiple numbers, even those of her sisters who stayed with her, but none were going through.\n\nBy 5 AM the next morning, I was at Nadias place. Thats when I learned from her kids that their mother had arrived home the previous day at around 6:30 PM. Upon arrival, she had a conversation with them. They told her that people had come earlier in the afternoon, looking for her. One of the kids had not gone to school due to feeling unwell, and the visitors had been asking questions: What time does your mom come back? Where does she work? Other particulars about her.\n\nImmediately after this conversation, towards 7 PM, Nadia left to lock the gate. That was the last time she was seen. From that very evening until yesterday, when she was found dumped in a field, she had been missing. This was very unusual.\n\nWe later learned that on that same Wednesday, while we were at court, a CID officer was spotted at a certain place around noon. As procedures were ongoing, there were reports of a CID visit to Nadias house. The officer later confirmed the visit but denied any involvement in her disappearance.\n\nNadias mysterious disappearance led to a national outcry. It is unheard of that an individual can simply go missingespecially on the very same day they were in court, negotiating in the afternoon, only to disappear by nightfall.\n\nThis incident reminds us of the critical role of the rule of law in our country. We strongly feel that personal security is being tampered with. The will of individuals is being manipulated by those in positions of power. Some individuals, wearing the jackets of political parties, are using their influence to suppress the weaker members of society.\n\nWhy has there been such an outcry around Matiza and Marapira? I came across a statement from Director Marapira, who, with all due respect, said, Please dont involve me. I was shocked. I think no one is accusing Director Marapira directly, but he is indeed a key player in this matter.\n\nFrom the very beginning, he facilitated the arrival of an individual whom we still believe to be a thugsomeone who has caused us great pain. We strongly believe that this individual is hiding behind political connections, which he is even abusing.\n\nTwo days ago, during the search for Nadia, we were shocked to learn that, for the first time, Matiza showed up at the Green River project. He had never visited before. Yet, during Nadias disappearance, he appeared at the project, taking pictures and posting them on social media in a celebratory manner. That behavior is not only uncalled for but primitive.\n\nThis is the true character of Matiza, and it must be exposed. As the women of Zimbabwe, we refuse to accept this. We are prepared to go all the way to defend the position of women, the principle of proper economic empowerment, and the transition to real economic development.\n\nOur President is working hard every day to lead the nation toward economic transformation. Yet, there are individuals who want to hide behind political parties to manipulate the system. Let me offer free advice to political leaders: these individuals are undermining the resolutions of their own parties.\n\nI personally attended the ZANU-PF resolutions in Zambia last year. Nowhere did I see a resolution that permits: The abduction of people, The seizure of other peoples businesses, The suppression of justice.\n\nSo why is an individual trying to politicize what is clearly an economic disputeone that stems from a business transaction? There is no ZANU-PF resolution that endorses such criminal behavior.\n\nAs such, we call upon the leadership of ZANU-PF and other political parties to take a stand. This issue is not unique to one party; it has been happening across the board. We urge political leaders to help root out such individuals and let them face justice. No one should be allowed to hide behind a party jacket.\n\nZANU-PF is one thing. Matiza is another. Marapira is another. I am an individual.\n\nWe were disappointed to see certain groups defending actions they dont even understand. Green River is a project that started years ago. It does not belong to Matiza. It does not belong to an individual who sneaked in through the back door.\n\nIf he genuinely contributed, we are always open to discussing his role in a proper manner. But we will not allow individuals to take advantage of the system to undermine justice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Brief speech by Abigail Mupambi on Monday | ZimEye | We left town at around five. I was driving, with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/how-nadia-was-kidnapped-in-abigail-mupambis-words/\">Continue reading<span class=\"screen-reader-text\"> \"How Nadia Was Kidnapped In Abigail Mupambi’s Words\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Zimbabwean Players Face Setbacks",
            "url": "https://www.zimeye.net/2025/03/11/zimbabwean-players-face-setbacks/",
            "content": "Sports Correspondent\n\nMarshall Munetsi marked a milestone in the English Premier League by scoring his first-ever goal for Wolverhampton Wanderers in their 1-1 draw against Everton on Saturday. Munetsi, who started the match and played until halftime, equalized in the 40th minute after Everton had taken an early lead. His goal made history as it was the first time in 14 years that a Zimbabwean player scored in the Premier League. The last local player to do so was former Warriors captain Benjani Mwaruwari, who scored for Blackburn Rovers in January 2011.\n\nIn the English Championship, Cardiff Citys Andy Rinomhota and Luton Towns Marvelous Nakamba were both sidelined due to injuries, joining Plymouth Argyles Brendan Galloway on the injury list.\n\nMeanwhile, Tawanda Chirewa started for Huddersfield in their 1-0 defeat to Bristol City in the English League One, playing 57 minutes before being substituted. Readings Tivonge Rushesha made a late appearance in their 1-1 draw with Crawley Town, while Tendayi Darikwa featured for Lincoln City in their 1-0 loss to Birmingham.\n\nIn Belgiums Pro League, Bill Antonio was an unused substitute as KV Mechelen defeated Charleroi 1-0, and Munashe Garananga also remained on the bench for Copenhagen FCs 1-1 draw with Snderjyske.\n\nLooking ahead, Jordan Zemura will be in action on Monday night as Udinese faces Lazio in Serie A.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Marshall Munetsi marked a milestone in the English Premier League by scoring his first-ever goal for Wolverhampton Wanderers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/zimbabwean-players-face-setbacks/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Players Face Setbacks\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Benin Coach Gernot Rohr Names 25-Man Squad for 2026 FIFA World Cup Qualifiers",
            "url": "https://www.zimeye.net/2025/03/11/benin-coach-gernot-rohr-names-25-man-squad-for-2026-fifa-world-cup-qualifiers/",
            "content": "Sports Correspondent\n\nBenin national team coach Gernot Rohr has unveiled a 25-man squad ahead of their 2026 FIFA World Cup Qualifiers in Group C. The team will face Zimbabwe in Durbans Moses Mabhida Stadium on March 21, before hosting South Africa in Abidjan, Ivory Coast on March 25.\n\nThe squad features young talent such as Candas Fiogb, an Italian-based striker who plays for Atalantas under-20 team. However, French-based players Aiyegun Tosin and Cdric Hountondji will miss the games due to injuries, and Olivier Verdon has been excluded for disciplinary reasons.\n\nOut of the 25 players named, only two are based in Benin, while the remaining players represent clubs from 17 different countries.\n\nHere is the full squad:\n\nGoalkeepers:\n\nSaturnin Allagb (Botev Vratsa, Bulgaria)\n\nMarcel Dandjinou (JDR Stars, South Africa)\n\nSerges Obassa (Remo Stars, Nigeria)\n\nDefenders:\n\nMoise Adilehou (Laval, France)\n\nBrandon Agounon (Chteauroux, France)\n\nRodrigue Fassinou (Coton Sport Benin)\n\nDavid Kiki (Steaua Bucharest, Romania)\n\nRachid Moumini (Ayma)\n\nTamimou Ouorou (Hatta, United Arab Emirates)\n\nYohan Roche (Petrolul 52, Romania)\n\nRabiou Sankamao (Wydad Fs, Morocco)\n\nMohamed Tijani (Yverdon Sport, Switzerland)\n\nMidfielders:\n\nMatto Ahlinvi (Arsenal Tula, Russia)\n\nMariano Ahouangbo (Soliman, Tunisia)\n\nGislain Ahoudo (Gabs, Tunisia)\n\nSamadou Attidjikou (Al Masry, Egypt)\n\nSessi dAlmeida (Apollon Limassol, Cyprus)\n\nDodo Dokou (Smouha, Egypt)\n\nImourane Hassane (Grasshoppers Zurich, Switzerland)\n\nForwards:\n\nJodel Dossou (Victoria Rosport, Luxembourg)\n\nCandas Fiogb (Atalanta, Italy)\n\nAndras Hountondji (Standard Lige, Belgium)\n\nSteve Mouni (FC Augsburg, Germany)\n\nJunior Olaitan (Grenoble, France)\n\nSteve-Waren Traor (Haka, Finland)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Benin national team coach Gernot Rohr has unveiled a 25-man squad ahead of their 2026 FIFA World Cup … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/benin-coach-gernot-rohr-names-25-man-squad-for-2026-fifa-world-cup-qualifiers/\">Continue reading<span class=\"screen-reader-text\"> \"Benin Coach Gernot Rohr Names 25-Man Squad for 2026 FIFA World Cup Qualifiers\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Chiwenga Under Siege",
            "url": "https://www.zimeye.net/2025/03/11/chiwenga-under-siege-3/",
            "content": "By Munacho Gwamanda-Vice, President Constantino Chiwenga is under increasing pressure as President Emmerson Mnangagwa moves to consolidate his grip on power by purging key allies of the former military commander from Zanu PF.\n\nLast week, the ruling party expelled eight members, including outspoken war veteran Blessed Geza, who has publicly challenged Mnangagwa to step down.\n\nAmong the high-profile casualties of the purge are Harare province political commissar Kudakwashe Damson, Zanu PF Gutu East MP Benjamin Ganyiwa, and former Harare South MP Godfrey Gomwe.\n\nThe internal purge signals an escalation of long-running tensions between Mnangagwa and Chiwenga, which date back to the 2017 military coup that ousted long-time ruler Robert Mugabe.\n\nAt the time, Chiwenga, then the commander of the Zimbabwe Defence Forces, played a pivotal role in installing Mnangagwa as president, with the expectation that he would be a key power broker.\n\nHowever, relations between the two men have since soured, with Chiwengas ambitions to succeed Mnangagwa clashing with the presidents determination to extend his rule beyond 2028.\n\nGeza, a known Chiwenga ally, has emerged as one of the most vocal critics of Mnangagwas leadership, openly calling for his resignation.\n\nHis expulsion from Zanu PF underscores Mnangagwas strategy of silencing dissent within party ranks, particularly among those aligned with the former military faction that brought him to power.\n\nZanu PF Manicaland political commissar Albert Nyakuedzwa warned that the recent expulsions were just the beginning, revealing that more party members were set to face the axe.\n\nAddressing a gathering at a Zanu PF Makoni district coordinating committee meeting in Rusape on Sunday, Nyakuedzwa insisted that internal party discipline was paramount.\n\nOther provinces have written recommendations to the national disciplinary committee on the people who should be fired from the party, and you saw some have already been dismissed, he said.\n\nNyakuedzwa also announced a controversial move to tighten surveillance over party members online activities, stating that all Zanu PF-affiliated social media groups must be registered with the party.\n\nWe do not need people who attack our leaders. We have seen members using social media to insult our leadership. As Manicaland province, we have decided that all party groups should be officially registered so that we know who to approach if there are more incidents of indiscipline, he added.\n\nThe latest crackdown comes as Mnangagwa pushes ahead with his contentious 2030 agenda, a party resolution aimed at extending his presidency beyond the constitutional two-term limit.\n\nWhile Mnangagwas camp insists the agenda is not up for debate, it has faced quiet resistance from some within Zanu PF, particularly from Chiwengas allies, who view it as a direct threat to their political ambitions.\n\nAddressing the same gathering, newly appointed Makoni district coordinating committee (DCC) chairperson Kudzai Chipangawho rose to prominence for organizing the infamous One Million Man March in support of Mugabe before his oustercalled for unity in the party, warning against internal divisions.We do not want divisions in the party. Those who are fanning divisions, you are warned, he declared.\n\nThe latest purges add another layer to the long-running power struggle between Mnangagwa and Chiwenga. After the 2017 coup, Chiwenga was widely expected to succeed Mnangagwa, but the president has methodically sidelined his deputy, reshuffling military and intelligence structures to dilute Chiwengas influence.\n\nIn 2020, Mnangagwa orchestrated a major shake-up in the military and security apparatus, replacing key figures seen as loyal to Chiwenga.\n\nTensions between the two escalated further during the 2023 elections, when factions aligned to Chiwenga reportedly opposed Mnangagwas re-election bid behind the scenes.\n\nDespite presenting a united front publicly, insiders say the two camps have been locked in a cold war over the future leadership of Zanu PF.\n\nWith the latest purges, Mnangagwa appears determined to neutralise any lingering threats to his grip on power, setting the stage for an intensifying battle over Zimbabwes political future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Vice, President Constantino Chiwenga is under increasing pressure as President Emmerson Mnangagwa moves to consolidate his grip on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/chiwenga-under-siege-3/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Under Siege\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Safety Of Passengers A Priority",
            "url": "https://www.zimeye.net/2025/03/11/safety-of-passengers-a-priority/",
            "content": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a common practice, this situation poses serious risks to passengers and needs to be addressed by authorities.\n\nOne of the main dangers of overcrowded buses is the excessive weight that is placed on the vehicle.\n\nWhen a bus is overloaded, it becomes harder for the driver to maintain control, especially when navigating sharp turns or sudden stops. In the event the driver is forced to apply the emergency brake, passengers who are standing are at risk of falling and sustaining injuries due to the lack of support.\n\nMoreover, standing passengers are more vulnerable to accidents in the event of sudden maneuvers.\n\nThey lack the security of a seat belt or a steady handrail, making them more likely to be thrown off balance and potentially hurt in an accident. The possibility of injury only increases when buses are traveling at high speeds or during congested traffic conditions.\n\nThe safety of passengers should always be a priority, and overloading buses compromises this fundamental principle. Passengers deserve a safe and secure journey, and it is crucial for bus operators and regulatory authorities to enforce strict guidelines on vehicle capacity to prevent overloading.\n\nTo mitigate these risks, authorities should consider increasing inspections of public transportation systems and impose fines for overloading violations. Moreover, bus companies must adhere to regulated passenger limits and ensure that all safety protocols are followed to protect the well-being of those traveling.\n\nIn conclusion, the practice of overloading buses is not only illegal but extremely dangerous. It is essential for both passengers and authorities to recognize the risks involved and work together to prioritize safety in public transport.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/safety-of-passengers-a-priority/\">Continue reading<span class=\"screen-reader-text\"> \"Safety Of Passengers A Priority\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Top Masvingo Education Ministry Official In Hot Water For Corruption, False Travel Claims",
            "url": "https://www.zimeye.net/2025/03/11/top-masvingo-education-ministry-official-in-hot-water-for-corruption-false-travel-claims/",
            "content": "By A Correspondent\n\nLiniah Chinoda, the Provincial Finance Director for the Ministry of Primary and Secondary Education, has been taken to court for allegedly claiming $600 in travel and subsistence allowances for a trip she never made.\n\nThe funds in question were part of the Better Schools Programme Fund, which is comprised of contributions from schools across the district through the Better Schools Programme Zimbabwe (BSPZ).\n\nChinoda, who is responsible for overseeing the effective use of the Ministrys financial resources within the province, allegedly submitted incomplete information on her travel and subsistence claims form.\n\nThis action is contrary to her duties, which include ensuring that accounting policies are followed and financial records are accurate and complete.\n\nThe court heard that Chinoda conspired with Evershine Ndongwe, the District Schools Inspector for Chivi, to force Chivi district accountant Tapiwa Mapindani to include her claim in the funds being withdrawn for participants of the Chivi Accounts Verification exercise.Mapindani was allegedly suspended for resisting the payment.\n\nChinoda appeared before Magistrate Elizabeth Hanzi on Friday, facing charges of abuse of duty.\n\nShe was remanded out of custody until March 19 and is represented by Yolander Chandata of H Tafa and Associates.\n\nThe investigation, conducted by the Zimbabwe Anti-Corruption Commission (ZACC), revealed that Chinoda was attending activities in Bikita, Gutu, and Zaka at the time of the exercise she claimed payment for, which was held in Chivi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Liniah Chinoda, the Provincial Finance Director for the Ministry of Primary and Secondary Education, has been taken … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/top-masvingo-education-ministry-official-in-hot-water-for-corruption-false-travel-claims/\">Continue reading<span class=\"screen-reader-text\"> \"Top Masvingo Education Ministry Official In Hot Water For Corruption, False Travel Claims\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "How Mnangagwa Stole Morgan Tsvangirai’s Concept Of Victory Celebration Rallies",
            "url": "https://www.zimeye.net/2025/03/11/how-mnangagwa-stole-morgan-tsvangirais-concept-of-victory-celebration-rallies/",
            "content": "By Tinashe Sambiri\n\nThe concept of victory celebration rallies, a powerful tool for political mobilization, was first introduced by the late Morgan Richard Tsvangirai, the founding leader of the Movement for Democratic Change (MDC).\n\nTsvangirai used these rallies to celebrate electoral successes and galvanize supporters, making them a significant feature of his partys campaigns.\n\nHowever, in a surprising twist, the Zanu PF party, under the leadership of President Emmerson Mnangagwa, has since appropriated this concept. Zanu PF has begun holding its own victory celebration rallies, mimicking the style that was once unique to the MDC.\n\nOn Saturday, Zanu PF Masvingo Provincial Chairperson Robson Mavhenyengwa took the opportunity to claim that the concept of victory rallies was in fact the brainchild of President Mnangagwa. We are unrolling celebration rallies across the country. Here in Masvingo, we have lined up a number of victory celebration rallies.\n\nThis is part of our efforts to salute our esteemed voters, Mavhenyengwa stated, drawing attention to the partys new strategy.\n\nThis appropriation of Tsvangirais idea has raised eyebrows, with critics pointing out that it is an attempt by Mnangagwa to co-opt a successful political tactic for his own purposes.\n\nWhile Mnangagwas Zanu PF has embraced the rallies, the move has been seen as a way to secure loyalty and further entrench the presidents influence over the party, especially as tensions within Zanu PF continue to simmer.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri The concept of victory celebration rallies, a powerful tool for political mobilization, was first introduced by the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/how-mnangagwa-stole-morgan-tsvangirais-concept-of-victory-celebration-rallies/\">Continue reading<span class=\"screen-reader-text\"> \"How Mnangagwa Stole Morgan Tsvangirai’s Concept Of Victory Celebration Rallies\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Detective Cassandra Hove Death: Family Demands Answers",
            "url": "https://www.zimeye.net/2025/03/11/detective-cassandra-hove-death-family-demands-answers/",
            "content": "By A Correspondent\n\nThe sudden and tragic death of Detective Constable Cassandra Hove has left her family searching for answers, with suspicions rising that she was not accidentally shot by a fellow officer, as initially suggested, but was deliberately targeted.\n\nFamily members are accusing the police in Bulawayo of withholding crucial information regarding the circumstances surrounding Hoves death.\n\nWhile police have confirmed that Hove was not killed by robbers, they have stated that she was shot by one of her colleagues during the incident.\n\nThe family is now demanding a full explanation of whether the shooting was a tragic accident or a deliberate act.\n\nRelatives of Cassandra have expressed frustration with the official narrative provided by the police and have vowed to keep pushing for justice until those responsible are held accountable.\n\nSpeaking on behalf of the family, Ryan Gambinga stated that they were devastated and disturbed by the tragic events surrounding Hoves death.\n\nCassandra was fatally shot last Thursday during a police operation aimed at apprehending a robber. It has since been revealed that the fatal shot came from one of her own colleagues.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The sudden and tragic death of Detective Constable Cassandra Hove has left her family searching for answers, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/detective-cassandra-hove-death-family-demands-answers/\">Continue reading<span class=\"screen-reader-text\"> \"Detective Cassandra Hove Death: Family Demands Answers\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Mnangagwa Uses Cash To Buy Loyalty From Party Members",
            "url": "https://www.zimeye.net/2025/03/11/mnangagwa-uses-cash-to-buy-loyalty-from-party-members/",
            "content": "By A Correspondent\n\nZanu PF leader, Mr. Emmerson Mnangagwa, is reportedly using financial incentives to secure loyalty from party members, as tensions rise surrounding his 2030 agenda.\n\nThe Presidential Fund has now been extended to all party wings, including the Youth and Womens wings, with both set to benefit from this financial initiative.\n\nThis development was disclosed by Special Presidential Advisor, Dr. Paul Tungwarara, during the launch of the Masvingo Province Presidential War Veteran Fund, the War Veteran borehole scheme, and the War Veteran Housing Scheme in Masvingo West Constituency over the weekend.\n\nWe are extending the Presidential Fund to all wings. This is a gesture of sincerity from the President, Dr. Tungwarara said, highlighting that the funds are aimed at supporting the various factions within the party.\n\nCritics, however, view the move as an effort by Mnangagwa to solidify his grip on power by buying loyalty from within his party as simmering tensions continue to brew within Zanu PF. The move comes amid concerns over Mnangagwas plans for the 2030 agenda and the growing division within the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF leader, Mr. Emmerson Mnangagwa, is reportedly using financial incentives to secure loyalty from party members, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/mnangagwa-uses-cash-to-buy-loyalty-from-party-members/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Uses Cash To Buy Loyalty From Party Members\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        },
        {
            "title": "Zanu PF Parades Candidate For Glen View South By-Election Amid Controversy, Rigging",
            "url": "https://www.zimeye.net/2025/03/11/zanu-pf-parades-candidate-for-glen-view-south-by-election-amid-controversy-rigging/",
            "content": "By A Correspondent\n\nZanu PF has officially announced Tsitsi Tawomhera as their candidate for the upcoming Glen View South Constituency by-election, a move that has already sparked a wave of controversy and speculation surrounding the partys tactics.\n\nTawomhera, who was introduced to the public on Monday, is being hailed by some political observers as a young and energetic candidate. However, others have raised concerns, suggesting that her candidacy is part of Zanu PFs strategy to polish its image, which has been tainted in recent years by allegations of electoral malpractice.\n\nCongratulations to Tsitsi Tawomhera on your well-deserved victory in the Glenview South Constituency primary election, Zanu PF said in a statement on Monday, celebrating her selection.\n\nThe statement emphasized the partys commitment to ensuring that Tawomhera would continue the work of the late Grandmore Hakata, the former CCC MP for the constituency who passed away, necessitating the by-election.\n\nHowever, there is already significant controversy surrounding the selection process, with critics alleging that the primary elections were marred by irregularities and possible rigging. Some argue that Zanu PFs decision to back Tawomhera is not about the candidates merit but a calculated attempt to strengthen the partys foothold in the region, which has traditionally been a stronghold for opposition parties.\n\nWhile the ruling party has made its position clear, the opposition has yet to announce its candidate for the by-election. This delay has left many speculating about the political dynamics in the area, as Zanu PF aims to make inroads into the constituency, which has historically leaned toward the opposition.\n\nThe upcoming by-election to replace the late Grandmore Hakata is expected to be a closely watched contest, with all eyes on how the political landscape in Glen View South will shift in the coming weeks.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF has officially announced Tsitsi Tawomhera as their candidate for the upcoming Glen View South Constituency … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/11/zanu-pf-parades-candidate-for-glen-view-south-by-election-amid-controversy-rigging/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Parades Candidate For Glen View South By-Election Amid Controversy, Rigging\"</span></a></p>",
            "time": "09:46",
            "date": "12 Mar 2025"
        }
    ]
}