{
    "news": [
        {
            "title": "Police Pounce On Kambwa Manufacturers",
            "url": "https://www.zimeye.net/2025/07/17/police-pounce-on-kambwa-manufacturers/",
            "content": "By A Correspondent\n\nHARARE  Police have arrested more than 30 individuals linked to the illicit production of Kambwa spirits at Mambo Manufacturing Company in Harare. Those apprehended include company directors, managers, and workers who now face charges related to the illegal manufacture of alcoholic beverages in defiance of national health laws.\n\nAccording to the Zimbabwe Republic Police (ZRP), the operation uncovered a large-scale disregard for safety and health standards. Authorities seized substances valued at approximately US$165,000 during the raid.\n\nThe ZRP arrested over 30 suspects who include directors, managers, and employees at Mambo Manufacturing Company in Harare, where they were manufacturing spirits without observing health regulations and the law, disregarding the health and safety of Zimbabweans, police said in a statement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Police have arrested more than 30 individuals linked to the illicit production of “Kambwa” spirits … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/police-pounce-on-kambwa-manufacturers/\">Continue reading<span class=\"screen-reader-text\"> \"Police Pounce On Kambwa Manufacturers\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "🔴 Tatenda Nyamapfeka UK-Based Immigration Job Scammer Exposed After Failing to Refund £31,000 for Fake COS Documents",
            "url": "https://www.zimeye.net/2025/07/17/%f0%9f%94%b4-tatenda-nyamapfeka-uk-based-immigration-job-scammer-exposed-after-failing-to-refund-31000-for-fake-cos-documents/",
            "content": "London  17 July 2025By A Correspondent | ZimEye | A Zimbabwean national based in the United Kingdom, Tatenda Nyamapfeka, also known as Johnson, has been exposed for orchestrating a high-value immigration scam involving the sale of non-existent Certificate of Sponsorship (COS) documents.\n\nAccording to a formal agreement signed on 10 October 2024, Nyamapfeka received 31,000 from a victim for what were claimed to be valid UK COS documents to support skilled worker visa applications. However, the documents were found to be invalid, leaving the client out of pocket and with no pathway to legal employment in the UK.\n\nTatenda Nyamapfeka\n\n The Fraud and Failed Repayments\n\nDespite acknowledging receipt of the money and signing a repayment agreement in the presence of his wife, Cindy Nyamapfeka, and a mediator, Nyamapfeka has failed to honour the agreed repayment plan.\n\nKey points of the agreement included: Initial repayment of 5,000 by 7 November 2024 A monthly payment plan to cover the remaining 26,000, with figures to be agreed upon by 13 October 2024 Witness oversight by Cindy Nyamapfeka\n\nAs of today, only 2,500 has been repaid, and no monthly payment plan was ever communicated. This has prompted calls for law enforcement agencies and immigration fraud investigators to act swiftly.\n\n Victim Speaks Out\n\nThe victim, who believed the COS would secure them a legitimate job in the UK, said:\n\nThis has not only cost me financially, but emotionally and mentally. I was desperate to regularize my status and support my family. Now Im left stranded and deeply betrayed.\n\n Community Urges Action\n\nObservers familiar with the case expressed concern over the growing number of similar scams in the UK diaspora community:\n\nThis case highlights how trust is being weaponized to exploit migrants. These scammers are destroying lives with impunity. Its time for community leaders and UK authorities to treat these incidents as serious criminal offences.\n\n Legal and Criminal Consequences\n\nLegal analysts say the case could trigger: A private prosecution for fraud and breach of contract Civil recovery action for the remaining 28,500 Investigation by the UK Home Office and police into immigration-related fraud\n\nNyamapfekas continued silence and failure to repay as agreed has now placed him in potential legal jeopardy, with signed documents and recorded calls confirming liability.\n\nIf you or someone you know has been defrauded under similar COS schemes, report immediately to Action Fraud UK or consult an immigration solicitor.\n\nStory developing\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "London – 17 July 2025 By A Correspondent | ZimEye | A Zimbabwean national based in the United Kingdom, Tatenda … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/%f0%9f%94%b4-tatenda-nyamapfeka-uk-based-immigration-job-scammer-exposed-after-failing-to-refund-31000-for-fake-cos-documents/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 Tatenda Nyamapfeka UK-Based Immigration Job Scammer Exposed After Failing to Refund £31,000 for Fake COS Documents\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "OK Zimbabwe Auctions Stores as Economy Crumbles",
            "url": "https://www.zimeye.net/2025/07/17/ok-zimbabwe-auctions-stores-as-economy-crumbles/",
            "content": "By Business Reporter-One of the countrys largest retail chains, OK Zimbabwe is auctioning off four supermarkets and other key properties in a desperate attempt to stay afloat amid Zimbabwes deepening economic collapse driven by the failure of the Zimbabwe Gold (ZiG) currency.\n\nThe shocking move was announced Thursday at an Extraordinary General Meeting (EGM) held in Harare, where shareholders endorsed a sweeping rescue package that includes raising US$20 million through a rights offer and disposing of immovable assets to raise an additional US$10.4 million.\n\nGroup chairman Herbert Nkala revealed that the affected properties include flagship outlets such as OK Mbuya Nehanda in Harare, OK Gweru, OK Glen View, and OK Malvern in Waterfalls. Other assets on the auction block include a warehouse in Workington, a commercial stand in Borrowdale, and another along the Harare-Masvingo Highway in Southlea Park.\n\nThe drastic measures come as the retail sector buckles under Zimbabwes hyperinflationary environment and chronic currency instability. The ZiG, introduced with much fanfare by the Reserve Bank in April 2024 to replace the Zimbabwe dollar, has already lost significant value, decimating consumer purchasing power and choking off capital for businesses reliant on local liquidity.\n\nThe economy is in freefall, and the ZiG has failed to inspire the confidence it was meant to restore. Companies are struggling to restock, pay suppliers, and even service basic debt, said an analyst with a leading financial services firm.\n\nNkala said the rescue planunderwritten by key shareholders such as the National Social Security Authority (NSSA), Datvest Nominees, and Old Mutual Life Assurance Companywill be used to restock shelves, repay overdue creditors, modernise stores, and implement new technologies.\n\nThe US$20 million renounceable rights offer will see the issuance of 1.83 billion new shares at a subscription price of US$0.0109 each, payable in hard currency. Shareholders will receive 1.37 new shares for every 1 share held as of July 21, 2025.\n\nIn a bid to steady the ship, the board has also been reconfigured, and former executives have been temporarily brought back to provide leadership while a new executive team is appointed to drive the recovery strategy.\n\nAccording to a circular issued ahead of the EGM, the asset disposal and recapitalisation efforts are part of a broader, long-term turnaround plan to rebuild supply chain trust, improve operational efficiency, and prevent further erosion of shareholder value.\n\nThe crisis at OK Zimbabwe reflects the wider economic devastation in Zimbabwes retail sector, where companies are closing branches, cutting staff, and scaling down operations due to a toxic mix of inflation, shrinking demand, and policy instability. As the government continues to blame sanctions and economic saboteurs, ordinary citizens and struggling businesses are left paying the price.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-One of the country’s largest retail chains, OK Zimbabwe is auctioning off four supermarkets and other key properties … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/ok-zimbabwe-auctions-stores-as-economy-crumbles/\">Continue reading<span class=\"screen-reader-text\"> \"OK Zimbabwe Auctions Stores as Economy Crumbles\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "Broadcasting Authority Threatens Crackdown on Social Media Dissent…",
            "url": "https://www.zimeye.net/2025/07/17/broadcasting-authority-threatens-crackdown-on-social-media-dissent/",
            "content": "By A Correspondent\n\nHARARE In a move widely seen as yet another assault on free expression, the Broadcasting Authority of Zimbabwe (BAZ) has issued a chilling warning targeting digital content creators and online platforms. Critics say its nothing more than a renewed attempt to muzzle dissent and tighten state control over public discourse.\n\nDisguised in bureaucratic jargon about national values and responsible broadcasting, BAZs latest statement condemned what it called the rising trend of internet-based broadcasting allegedly violating national regulations. It cited vague concerns over unverified, harmful or offensive materialterms so broad they could be used to target virtually any criticism of the government.\n\nThese incidents represent a blatant disregard for the guidelines provided in the nations broadcasting laws, the statement readsthough it notably fails to offer a single example of what constitutes such violations, raising suspicions about the real intent behind this sudden concern.\n\nRather than defending ethics or media integrity, BAZs message reads like a threat. It explicitly warns that it will continue to monitor both traditional and digital media and will not hesitate to decisively enforce existing laws. For many Zimbabweans, this rings alarm bellsits a familiar tactic in a country where freedom of speech has long been under siege.\n\nAs traditional media continues to suffer from censorship and political interference, digital platforms like YouTube, Facebook, and X (formerly Twitter) have become lifelines for alternative voices. The regimes growing discomfort with these platforms signals a fear of losing control over the national narrative.\n\nBAZs heavy-handed warning appears less about upholding standards and more about intimidating those who dare to speak truth to power. Its a classic case of using vague legislation and broad interpretation to justify censorship.\n\nMeanwhile, the real issuespress freedom, media reform, and political accountabilityare ignored. Zimbabwes broadcasting laws remain archaic and overtly repressive, designed for an era of state monopoly over information. Instead of adapting to the realities of digital expression, BAZ seems intent on dragging the country backward.\n\nBy urging content creators to familiarise themselves with the Code of Conduct, BAZ reveals its true aim: silencing dissent and shielding the political elite from public scrutiny.\n\nUntil Zimbabwe confronts its outdated and authoritarian approach to media regulation, moves like these will continue to be seen not as protectionsbut as threats dressed in the language of law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – In a move widely seen as yet another assault on free expression, the Broadcasting Authority … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/broadcasting-authority-threatens-crackdown-on-social-media-dissent/\">Continue reading<span class=\"screen-reader-text\"> \"Broadcasting Authority Threatens Crackdown on Social Media Dissent…\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "We Died Waiting! Sithule Tshuma’s Victims’ Outry",
            "url": "https://www.zimeye.net/2025/07/17/we-died-waiting-sithule-tshumas-victims-outry/",
            "content": "We planted seeds in Zimbabwe, Bulawayo, KwaMthwakazi, with excitement and hopeful trembling hands,\n\nGuided by dreams stitched together across continents\n\nAustralias hope, South Africas heart,The sweats of Zambia,The prayers of mothers in Canada,The whispers of sisters in the UK,The grit of aunties in America.We dreamed of harvests, not hunger.\n\nWe envisioned a farm produce marketBristling with colourmangos glistening, cabbages stacked like emerald crowns,Children skipping past stalls heavy with abundance.We saw butcheries humming with life, bakeries warm with rising dough.We imagined oil drums filled with promise,Trucks roaring toward prosperity across the African continent,A bank of hope,And a buspainted with our flagcarrying our dreams into dawn.\n\nWe believed in building,In unity,In sisterhood stronger than blood.\n\nBut Sithule TshumaWith Karen Kumalo, Bridget Dube, Nompilo Moyo,And Zibusiso Charles Ncube cloaked in shadowsDid not build.They hollowed our dreams with greed.They danced in the dust of our devastation.\n\nThe farms vanished before harvest.The markets doors rusted shut before they ever opened.The butcheries never smelled of meat.The bakeries were tombs.The oil dried to silence.The trucks were never driven.And the bus became a shrine to deceit.\n\nWe, more than 500 women,Now carry only grief,And receipts that prove nothing but betrayal.They wear our stolen sacrificesDesigner threads stitched from our tears,Holiday selfies framed by the graves of our trust.\n\nAnd Sithule,Cruel and brazen,Mocks our brokenness in Facebook captions,Turns our pain into punchlines,As though our lives were just her stepping stones.\n\nBut we mourn in silence no longer.\n\nSome of your victims Sithule have goneTheir hearts ruptured from betrayal,Their homes darkened by the weight of debt.They died believing they were building something true.Their children now whisper to photos,Asking why the future never came.\n\nWe did not give so that you could take.We did not dream so that you could destroy.\n\nYou stole more than moneyYou stole stories,You ripped mothers from hope,And carved wounds that time cannot soothe.\n\nBut we are not done.We are not silenced.We rise, loud and raw,Voices trembling with fury and resolve.\n\nOne dayTruth will call your names.Justice will come collecting,And legacyour true legacywill be restored.Because we are the storm now.And you will hear us.\n\nTo the victims who died waiting for restitutionyour graves speak louder than her laughter.Justice has ears. And it is hears\n\nBy NP a heartbroken victim\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "We planted seeds in Zimbabwe, Bulawayo, KwaMthwakazi, with excitement and hopeful trembling hands, Guided by dreams stitched together across continents— … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/we-died-waiting-sithule-tshumas-victims-outry/\">Continue reading<span class=\"screen-reader-text\"> \"We Died Waiting! Sithule Tshuma’s Victims’ Outry\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "LIVE: News Review-Chamisa Punishes ED With Exit-Destruction | Man With 3 Identity Cards Changes Own Wealth Story",
            "url": "https://www.zimeye.net/2025/07/17/live-news-review-chamisa-punishes-ed-with-exit-destruction-man-with-3-identity-cards-changes-own-wealth-story/",
            "content": "video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below…",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "Government ‘Raids’ Private Hospitals as Public Health System Collapses",
            "url": "https://www.zimeye.net/2025/07/17/government-raids-private-hospitals-as-public-health-system-collapses/",
            "content": "By Health Correspondent-The government, under fire for its failure to deliver basic health services in public hospitals, is now turning its attention to the private healthcare sector  proposing sweeping reforms that critics say amount to a veiled crackdown.\n\nThrough the Medical Services Amendment Bill, government seeks to regulate how much private hospitals can charge, and compel them to admit and stabilise patients in life-threatening conditions for at least 48 hours  even if those patients cannot pay upfront.\n\nJustice, Minister Ziyambi Ziyambi tabled the controversial proposals in Parliament this week, describing them as a necessary alignment of healthcare delivery with Section 76 of the Constitution, which guarantees every citizen the right to basic and emergency medical care.\n\nThe Bill will give the Minister of Health sweeping powers to cap fees and limit increases at private hospitals  effectively placing them under state control. Any attempt to exceed these limits, or raise charges beyond government-sanctioned thresholds, would require written approval from the Minister.\n\nThis Bill, Mr Speaker Sir, is a testament to our commitment to ensuring that every citizen and permanent resident has access to essential health services, said Ziyambi.\n\nBut critics argue that the move is less about protecting patients and more about shifting the burden of a collapsing public healthcare system onto private players. Zimbabwes state hospitals have been decimated by decades of underfunding, corruption, drug shortages, and the flight of skilled professionals. Most facilities lack even the most basic medical supplies.\n\nNow, rather than fixing that broken system, government is effectively forcing the private sector to carry the weight  without addressing the root causes of the crisis.\n\nClause 9 of the Bill proposes that no private hospital may impose fees above a prescribed amount, or increase them by more than a set percentage, unless explicitly authorised by the Minister. This includes removing an existing legal safeguard that exempted previously existing fees from regulation  meaning all fees will now fall under government control.\n\nThis change ensures greater oversight and control over the cost of private healthcare, aiming to protect patients from exorbitant charges, Ziyambi said.\n\nAnother key provision would compel private institutions to provide emergency care to patients in life-threatening situations, regardless of their ability to pay. These patients must be stabilised for no less than 48 hours before they can be discharged or referred.\n\nThe government, through the Health Ministry, may enter into cost-recovery agreements with private institutions for such services  though no clear mechanisms have been outlined for how or when this compensation would be provided.\n\nPerhaps, Mr Speaker, one of the most impactful provisions is the new Section 12(a), which prohibits private health institutions from refusing emergency medical treatment, aligning with Section 76(3) of the Constitution, said Ziyambi.\n\nThe Bill also proposes targeted health interventions for vulnerable groups, including children, people with chronic illnesses, persons with disabilities, and war veterans. It provides for the establishment of a National Consultative Health Forum to enhance citizen participation in health policy-making.\n\nWhile government claims the reforms are progressive and grounded in constitutional values of human dignity, many observers see them as a desperate attempt to compensate for the collapse of public healthcare  by offloading responsibility onto private institutions, without first addressing state mismanagement, systemic rot, and crumbling infrastructure.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Health Correspondent-The government, under fire for its failure to deliver basic health services in public hospitals, is now turning … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/government-raids-private-hospitals-as-public-health-system-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"Government ‘Raids’ Private Hospitals as Public Health System Collapses\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "War Veterans Win Court Battle Against Businessman Billy Rautenbach Over Farm Land Dispute",
            "url": "https://www.zimeye.net/2025/07/17/war-veterans-win-court-battle-against-businessman-billy-rautenbach-over-farm-land-dispute/",
            "content": "War Veterans Win Court Battle Against Businessman Billy Rautenbach Over Farm Land Dispute\n\nHarare  17 July 2025\n\nBy A Correspondent | ZimEye | In a landmark ruling, the High Court has ruled in favour of a group of war veterans in their long-standing legal battle against businessman Billy Rautenbach, effectively setting aside the governments decision to withdraw their farm offer letters.\n\nPresiding Judge Justice Regus Dembure found that the government, through the responsible minister, had failed to properly oppose the application brought by the veterans, rendering the matter legally unopposed.\n\nJustice Dembure said the opposition submitted on behalf of the government was invalid because the affidavit was deposed by a permanent secretary (PS) who had no lawful authority to speak on the ministers behalf. Crucially, the court ruled that the minister, who holds the statutory power to make or withdraw such land offers, had not filed any affidavit in response to the case.\n\nI wish to point out that the law in relation to authority to act is already settled, said Justice Dembure in his ruling delivered ex tempore. Where the authority of a deponent is put in issue, there must be evidence of that authority before the court. A mere claim is not sufficient. One must produce a board resolution or formal proof of delegation.\n\nHe added that the affidavit presented was fatally invalid and amounted to inadmissible hearsay. The minister is the one who makes the decision and he must justify his actions. He cannot delegate his statutory powersonly administrative powers, said the judge. The PS has no such authority and cannot testify on behalf of the minister.\n\nJustice Dembure ruled that because no proper opposition had been presented, the applicants matter would proceed unopposed. He further criticised the ministers failure to consider the veterans long occupation of the land and the considerable improvements they had made over time.\n\nThe applicants had been on the farm for a long time and had made significant developments. The minister ignored this and failed to show that he applied his mind to the background of the case, Dembure noted.\n\nIn particular, the court observed that one of the applicants had entered into a joint venture with the government itself, an arrangement which was still active at the time of the withdrawaldemonstrating the irrationality and insensitivity of the decision.\n\nAccordingly, the court ruled:\n\nThis ruling represents a significant victory for the applicants, confirming the principle that ministerial decisions must be justified and lawfully defended, especially when they impact livelihoods and long-term investments.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "… War Veterans Win Court Battle Against Businessman Billy Rautenbach Over Farm Land Dispute Harare – 17 July 2025 By … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/war-veterans-win-court-battle-against-businessman-billy-rautenbach-over-farm-land-dispute/\">Continue reading<span class=\"screen-reader-text\"> \"War Veterans Win Court Battle Against Businessman Billy Rautenbach Over Farm Land Dispute\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "Hopewell Chin’ono Publishes New Contradictory Money Story: My Property Wealth Actually Came From Goats Worth USD100,000 Each",
            "url": "https://www.zimeye.net/2025/07/17/hopewell-chinono-publishes-new-contradictory-money-story-my-property-wealth-actually-came-from-goats-worth-usd100000-each/",
            "content": "By Investigative Correspondent | ZimEye | The controversial journalist, Hopewell Chinono has published a contradictory wealth story, this time saying his property wealth came from goats that were worth USD100,000 each.\n\nChinono, who is the worlds only journalist possessing three identity cards bearing three totally different names on them, has in the last 6 years been announcing that people should not debate with him till the day they purchase their first home.  He has also been saying contrary to multiple allegations (including an investigation by his former employer Geoff Nyarota on the AMH newspaper website in 2021), his wealth did not at all come from foreign proceeds of crime and his first Chisipite home was bought from non-foreign money, but a local bank, CABS Zimbabwe mortgage. He would add saying this was because the Zim economy in 2001, was good.\n\nIn April 2023, following questions raised by Al Jazeera Media Network GoldMafia documentary founder, Simba Chikanza, he published a new claim to say his first home was truly  purchased from UK money in the form of a 50,000 sportscar 1996 loan, of a vehicle he quickly sold upon being illegally shipped to Zimbabwe. He emphasized that the 50,000 value realised from the sale is what created his property wealth.\n\nAt a time when he is still to disclose the identity of the British lender, Chinono has publicised a totally contradictory claim, this time to suggest that the money actually came from Boer goats which are worth up to 100,000.\n\nDuring interviews with his former employer Nyarota, Chinono failed to answer key questions one of them which was over the date when he started his boer goat farming.\n\nWhen pressed further by Chikanza in an online podcast, Chinono has said he could afford the 120,000 value(50,000) loan because he was working in the media in 1996 since I have worked for private media all my life. But he contradicts this claim by saying he worked as a cleaner when he arrived in UK in 1994.\n\nHe goes further to suggest that the UK embassy in Harare conducted a police clearance on his sportscar loan and also on his three identity cards with different names.\n\nThe UK embassy has twice denied ever issuing a police clearance on anyone at any time stressing that it has no such capabilities. (Watch video).\n\nhttps://x.com/zimeye/status/1923440727910121827?s=46\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigative Correspondent | ZimEye | The controversial journalist, Hopewell Chin’ono has published a contradictory wealth story, this time saying … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/hopewell-chinono-publishes-new-contradictory-money-story-my-property-wealth-actually-came-from-goats-worth-usd100000-each/\">Continue reading<span class=\"screen-reader-text\"> \"Hopewell Chin’ono Publishes New Contradictory Money Story: My Property Wealth Actually Came From Goats Worth USD100,000 Each\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        },
        {
            "title": "Telone Snatch DeMbare Rising Star",
            "url": "https://www.zimeye.net/2025/07/17/telone-snatch-dembare-rising-star/",
            "content": "Sports Correspondent\n\nGWERU  Premier Soccer League outfit TelOne FC have completed the signing of promising forward Elton Chikona from Dynamos, in a move that is set to boost the clubs attacking options ahead of the second half of the season.\n\nThe 20-year-old rising star joins the WiFi Boys after finally securing his clearance from the Harare giants, bringing an end to a lengthy transfer saga that had held up his move.\n\nChikona is set to reunite with coach Herbert Maruwa, under whom he flourished during their time together at Dynamos. The reunion is expected to reignite the players form and add pace and flair to TelOnes frontline as they aim for a strong finish in the Castle Lager Premier Soccer League campaign.\n\nWe are excited to have Elton on board. He is a talented youngster with a lot of potential and we believe he will add a different dimension to our attack, said a TelOne official.\n\nChikona had shown glimpses of brilliance at Dynamos but struggled for regular game time. The move to Gweru presents him with a fresh opportunity to shine and prove himself under a familiar coach.\n\nTelOne are currently mounting a serious title challenge and the acquisition of Chikona is seen as a statement of intent from the club.\n\nHes young, hungry and knows whats expected of him. We are confident he will adapt quickly and make an impact, the official added.\n\nThe striker is expected to be available for selection as soon as match fitness is confirmed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent… GWERU – Premier Soccer League outfit TelOne FC have completed the signing of promising forward Elton Chikona from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/17/telone-snatch-dembare-rising-star/\">Continue reading<span class=\"screen-reader-text\"> \"Telone Snatch DeMbare Rising Star\"</span></a></p>",
            "time": "18:12",
            "date": "18 Jul 2025"
        }
    ]
}