{
    "news": [
        {
            "title": "Scott Sakupwanya Had Potential To Play For Liverpool – Brenna Msiska",
            "url": "https://www.zimeye.net/2025/12/04/scott-sakupwanya-had-potential-to-play-for-liverpool-brenna-msiska/",
            "content": "Sports Correspondent  Caps United legend Brenna Msiska has sparked amusement after claiming that Scottland FC owner Scott Sakupwanya once had the talent to play for major English clubsclaims many have dismissed as too far-fetched and overly flattering toward the controversial businessman, who maintains close ties to President Emmerson Mnangagwa.\n\nSpeaking during Scottland FCs victory parade on Wednesday, Msiskaaffectionately known as Baba Gariwas asked whether Sakupwanya had ever seriously played football. He responded with bold praise.\n\nSakupwanya was a good goalkeeper and, had he pursued the career, he could have played for Liverpool or Chelsea, Msiska claimed.\n\nHe added that although Sakupwanya did not follow a professional football path, what he is doing now is very respectable, referring to his ownership of Scottland FC. Even though he didnt follow a playing career, what he is doing now (owning a club) is highly commendable.\n\nScottland FC held a triumphant parade across Harare to celebrate clinching the 2025 Castle Lager Premier Soccer League title. The team, also known as Mabviravira, made history by winning the championship in their debut top-flight season, shattering a forty-year record.\n\nScott Sakupwanya\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – Caps United legend Brenna Msiska has sparked amusement after claiming that Scottland FC owner Scott Sakupwanya once … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/scott-sakupwanya-had-potential-to-play-for-liverpool-brenna-msiska/\">Continue reading<span class=\"screen-reader-text\"> \"Scott Sakupwanya Had Potential To Play For Liverpool – Brenna Msiska\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Shock As Man Rapes Mother-in-law …",
            "url": "https://www.zimeye.net/2025/12/04/shock-as-man-rapes-mother-in-law/",
            "content": "By A Correspondent  A 37-year-old man from Mandaza Village in Mhondoro has been sentenced to 15 years in prison after being found guilty of raping and assaulting his 56-year-old mother-in-law.\n\nWalter Maponga appeared before Harare regional magistrate Ms Jessie Kufa, who convicted him on charges of both rape and assault. In her ruling, Magistrate Kufa stated that the State had successfully established a prima facie case against Maponga.\n\nAccording to the prosecution, led by Mr Blessed Songozo, the incident occurred on September 17 at Makoni Village under Chief Nyamweda. The mother-in-law was in her bedroom with her 94-year-old mother when Maponga allegedly forced his way into the room.\n\nUpon entering, he reportedly assaulted her, accusing her of taking his wife. During the attack, the mother-in-law fell onto her back, and Maponga sat on top of her before raping her.\n\nThe victim was eventually rescued by local residents, Messrs Godfrey Makoni and Cleopas Nziramasanga, who apprehended Maponga at the scene.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A 37-year-old man from Mandaza Village in Mhondoro has been sentenced to 15 years in prison … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/shock-as-man-rapes-mother-in-law/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Man Rapes Mother-in-law …\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Terry Builds Own Nkandla Resort In Zimbabwe In Simplicity",
            "url": "https://www.zimeye.net/2025/12/04/zim-lad-builds-own-nkandla-resort-in-zimbabwe/",
            "content": "Terry isnt working in Europe: hes stuck here at his mums rural home where hes steadily assembled a hotel resort in less than 5 years from launch. He now runs a hotel and restaurant business in the bushes, built from believing in himself and in simplicity. He doesnt followpic.twitter.com/7a20jOWJmm\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Video: Sikhala Speaks On Rampant Violation Of Human Rights By Mnangagwa Regime",
            "url": "https://www.zimeye.net/2025/12/04/video-sikhala-speaks-on-rampant-violation-of-human-rights-by-mnangagwa-regime/",
            "content": "By A Correspondent  Opposition leader and former Member of Parliament, Job Sikhala, delivered a powerful and emotional address to the European Union Parliament on Wednesday, detailing the widespread human rights abuses he has endured under President Emmerson Mnangagwas ZANU PF government.\n\nBreaking down during his speech, Sikhalas testimony left many in the chamber visibly moved.\n\nMy persecution by the Harare regime is well documented. I have been arrested 70 times, he told lawmakers. I have been subjected to torture, harassment, and the ZANU PF regime has also attempted to eliminate me several times.\n\nHe went on to condemn the Mnangagwa administration for its crackdown on political opponents. The regime has gone wayward in a bid to restrict and restrain political actors seen as enemies of the system, he said.\n\nSikhala also sounded the alarm over the persistent violations of human rights in Zimbabwe, accusing the government of refusing to relinquish power.\n\nThe situation in Zimbabwe is dire, he warned the European Union Parliament, calling for urgent international attention and intervention.\n\nOpposition politician, Job Sikhala broke into tears during his address to the European Union Parliament today as he narrated the torture he went through in the hands of the Zanu PF Government in 2003. EU Parliament chairman remarked the motions that torched the house as Sikhalapic.twitter.com/EqxLEEMVLK\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Opposition leader and former Member of Parliament, Job Sikhala, delivered a powerful and emotional address to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/video-sikhala-speaks-on-rampant-violation-of-human-rights-by-mnangagwa-regime/\">Continue reading<span class=\"screen-reader-text\"> \"Video: Sikhala Speaks On Rampant Violation Of Human Rights By Mnangagwa Regime\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Rural Schoolchildren Grapple With Deteriorating Learning Standards As Mnangagwa Regime Pompously Announces Plan To Distribute Laptops",
            "url": "https://www.zimeye.net/2025/12/04/rural-schoolchildren-grapple-with-deteriorating-learning-standards-as-mnangagwa-regime-pompously-announces-plan-to-distribute-laptops/",
            "content": "By Tinashe Sambiri  Mutsa Murombedzi, Member of Parliament (Proportional Representation) for Mashonaland West, has raised serious concerns over the declining learning standards for schoolchildren in rural Mhondoro.\n\nSpeaking on Thursday, Murombedzi highlighted the lack of essential learning materials, describing the situation as pathetic.\n\nThese learners in rural Mhondoro are having to do without textbooks for the new Heritage Based Curriculum, the very tools that make education meaningful, he said. We are asking learners to build a future with empty hands. The Constitution guarantees every child the right to education. Attendance alone does not fulfill the right to education. Rights are hollow when stripped of quality. The issue of textbooks must be addressed urgently.\n\nMurombedzis comments come as the government, under President Emmerson Mnangagwa, announced an ambitious initiative to distribute laptops and tablets to learners nationwide. While the program aims to modernize education, critics like Murombedzi argue that basic resources such as textbooks remain critical and must not be overlooked in the push for digital learning.\n\nHon Mutsa Murombedzi\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri – Mutsa Murombedzi, Member of Parliament (Proportional Representation) for Mashonaland West, has raised serious concerns over the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/rural-schoolchildren-grapple-with-deteriorating-learning-standards-as-mnangagwa-regime-pompously-announces-plan-to-distribute-laptops/\">Continue reading<span class=\"screen-reader-text\"> \"Rural Schoolchildren Grapple With Deteriorating Learning Standards As Mnangagwa Regime Pompously Announces Plan To Distribute Laptops\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Zanu PF Is An Unstoppable Force, Boasts Mnangagwa",
            "url": "https://www.zimeye.net/2025/12/04/zanu-pf-is-an-unstoppable-force-boasts-mnangagwa/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwa on Wednesday urged Zimbabweans to remain vigilant against alleged threats to peace and unity, in what critics say is a thinly veiled call to suppress dissent and silence opposition.\n\nAddressing the 389th Ordinary Session of the Politburo at Zanu PFs headquarters in Harare, Mnangagwa painted a picture of a nation under siege, warning that counter-revolutionaries and pretenders, in whatever format, will never succeed and must continue to be exposed and defeated.\n\nI further challenge the nation to continue to be vigilant, guarding against machinations or attacks on our peace, national unity and stability, he said, portraying any criticism of his government as a threat to the country.\n\nHe went on to glorify Zanu PF as an untouchable force. Zanu PF musangano unoyera. As we approach the festive season and the new year, ngatirambei takasvinura, takangwarira muvengi. Ngatichengetedzei musangano wedu weZanu PF, masikati neusiku, tisatsauke mugwara redu, Mnangagwa said, calling for unwavering loyalty from party members.\n\nCritics argue that his calls for unity are little more than an attempt to quash dissent. In carrying out these grassroots feedback engagement programmes, let us always unite the party and consolidate our revolutionary ideals. Let us never put ourselves or individual members above the party, he added, emphasizing the subordination of individual voices to the ruling party.\n\nMnangagwa also took credit for the years successes, insisting that Zanu PFs unity allowed the party and government to prevail over many challenges while consolidating power at both grassroots and national levels. It is pleasing that our party structures throughout the provinces remain accountable to the grassroots membership base. Musangano wakasimba kuma cells and villages, he said, glossing over widespread reports of coercion, intimidation, and manipulation of local structures.\n\nObservers warn that Mnangagwas rhetoric, framed as a celebration of revolutionary ideals, continues to entrench Zanu PFs dominance while silencing critics and undermining genuine democratic engagement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa on Wednesday urged Zimbabweans to remain “vigilant” against alleged threats to peace and unity, in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/zanu-pf-is-an-unstoppable-force-boasts-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Is An Unstoppable Force, Boasts Mnangagwa\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Zimbabwe Is Hell On Earth, Job Sikhala Tells European Union Parliament",
            "url": "https://www.zimeye.net/2025/12/04/zimbabwe-is-hell-on-earth-job-sikhala-tells-european-union-parliament/",
            "content": "By A Correspondent  Zimbabwean opposition leader and former Member of Parliament, Job Sikhala, on Wednesday addressed the European Union Parliament, recounting his experiences of human rights abuses at the hands of the ZANU PF regime of President Emmerson Mnangagwa.\n\nBreaking down during his address, Sikhalas emotional testimony moved the entire house.\n\nMy persecution by the Harare regime is well documented. I have been arrested 70 times, he told lawmakers. I have been subjected to torture, harassment, and the ZANU PF regime has also attempted to eliminate me several times.\n\nSikhala further criticized the Mnangagwa administration for suppressing political opposition. The regime has gone wayward in a bid to restrict and restrain political actors seen as enemies of the system, he said.\n\nHe warned of the persistent violations of human rights in Zimbabwe and accused the government of being unwilling to cede power.\n\nThe situation in Zimbabwe is dire, Sikhala told the European Union Parliament, emphasizing the urgent need for international attention and intervention.\n\nOpposition politician, Job Sikhala broke into tears during his address to the European Union Parliament today as he narrated the torture he went through in the hands of the Zanu PF Government in 2003. EU Parliament chairman remarked the motions that torched the house as Sikhalapic.twitter.com/EqxLEEMVLK\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwean opposition leader and former Member of Parliament, Job Sikhala, on Wednesday addressed the European Union … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/zimbabwe-is-hell-on-earth-job-sikhala-tells-european-union-parliament/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Is Hell On Earth, Job Sikhala Tells European Union Parliament\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "JUST IN: Madzibaba Ishmael Convicted",
            "url": "https://www.zimeye.net/2025/12/04/just-in-madzibaba-ishmael-convicted/",
            "content": "By Crime and Courts Reporter Johane Masowe apostolic sect leaderMadzibaba Ishmael Chokurongerwa (56)has been found guilty of raping and impregnating an underage congregant.\n\nThe conviction was delivered on Thursday by  Harare magistrate Estere Chivasa after a full trial, although he was acquitted on two other related charges.\n\nHis sentence is yet to be announced.\n\nThe case drew national attention after police discovered251 childrenand16 unregistered gravesat his Budiriro shrine last year. During the trial,DNA tests confirmedthat Chokurongerwa fathered the minors child, a key piece of evidence that secured the rape conviction.\n\nUnder Zimbabwean law, rape of a minor can attract amandatory 60-year prison sentence, depending on the circumstances. The court is expected to hand down a sentence once final submissions are concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Johane Masowe apostolic sect leader Madzibaba Ishmael Chokurongerwa (56) has been found guilty of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/just-in-madzibaba-ishmael-convicted/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Madzibaba Ishmael Convicted\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Diaspora Remittances Give Broke Mnangagwa Regime A Lifeline",
            "url": "https://www.zimeye.net/2025/12/04/diaspora-remittances-give-broke-mnangagwa-regime-a-lifeline/",
            "content": "Tinashe Sambiri President Emmerson Mnangagwa on Wednesday hailed what he called the remarkable success of the National Development Strategy 1 (NDS1), but for millions of Zimbabweans grappling with skyrocketing prices, chronic unemployment, and failing public services, his claims are far removed from reality. While the government boasts of economic growth and national milestones, ordinary citizens continue to struggle to make ends meet, highlighting a stark gap between official rhetoric and lived experience.\n\nAddressing the 389th Politburo session in Harare  the final ZANU PF Party meeting of 2025  Mnangagwa praised national unity as a key driver of progress, insisting it had enabled significant milestones across the economy and society. He also hailed the completion of NDS1 and the launch of NDS2 as people-driven achievements. Yet for most Zimbabweans, there is little evidence of these so-called successes in their daily lives.\n\nMnangagwa paid tribute to Archbishop Paul Mwazha of the African Apostolic Church, recently declared a National Hero, describing him as a pillar of unity and spiritual guidance. While the gesture commands respect, it does nothing to address the dire economic conditions most citizens endure.\n\nThe President boasted that the 22nd National Peoples Conference had strengthened Party unity and shaped the 2026 National Budget. He called for Party mobilisation and communication strategies aligned with NDS2 to drive economic growth and improve citizens quality of life. Critics argue, however, that the governments priorities remain inward-looking and disconnected from the hardships confronting ordinary Zimbabweans.\n\nMnangagwa claimed economic growth had been driven by agriculture, mining, manufacturing, tourism, infrastructure, and diaspora remittances. The latter has become particularly critical to the regime, which relies heavily on funds sent by Zimbabweans abroad  even as the state continues to brand many diaspora members as unpatriotic. This contradiction underscores the governments dependence on citizens it simultaneously vilifies.\n\nThe President also praised engagements with regional neighbours such as Zambia and Mozambique under Bi-National Commissions, calling them instruments of cooperation, integration, and prosperity. He warned against counter revolutionaries, a term frequently deployed to suppress dissenting voices.\n\nWhile Mnangagwa celebrates NDS1 as a triumph, the reality for most Zimbabweans remains starkly different. Citizens still confront economic hardship, erratic public services, and dwindling opportunities. The governments self-congratulatory rhetoric, particularly its reliance on diaspora remittances to prop up the economy, highlights a leadership more focused on appearances and party unity than addressing the urgent needs of its people.\n\nFor millions navigating daily struggles, the Mnangagwa regimes triumphs exist only on paper, while the nations lifeblood  including crucial support from the diaspora  is treated as both indispensable and a source of suspicion.\n\nEmmerson Mnangagwa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– President Emmerson Mnangagwa on Wednesday hailed what he called the “remarkable success” of the National Development Strategy 1 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/diaspora-remittances-give-broke-mnangagwa-regime-a-lifeline/\">Continue reading<span class=\"screen-reader-text\"> \"Diaspora Remittances Give Broke Mnangagwa Regime A Lifeline\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        },
        {
            "title": "Action Democratic Movement Demands Urgent Government Action Over Destruction Of Mazowe River By Chinese Miners",
            "url": "https://www.zimeye.net/2025/12/04/action-democratic-movement-demands-urgent-government-action-over-destruction-of-mazowe-river-by-chinese-miners/",
            "content": "By A Correspondent  The Action Democratic Movement (ADM) has sounded the alarm over the escalating environmental degradation along the Mazowe River, accusing Chinese-linked miners of causing extensive damage while Government authorities fail to intervene.\n\nCommunities in Mapunga, near the Mazowe River, say the once-reliable water source has now become a mud-filled channel due to what they describe as unregulated, destructive mining activities.\n\nVillagers told ADM representatives that the river is heavily silted, with one resident saying, Mazowe River is now filled with mud. We cant use this water for domestic purposes, and even our livestock are suffering because the river is no longer safe for drinking.\n\nAccording to locals, the miners operations have devastated riverbanks, caused uncontrolled digging and polluted water used by households and animals. Villagers have repeatedly appealed for intervention, but accuse the authorities of turning a blind eye to the crisis.\n\nIn a statement on Thursday, ADM said the Government must take immediate corrective action. The Government cannot sit back while our rivers are being destroyed. We challenge the authorities to act now and stop these unregulated activities by Chinese miners before Mazowe River is completely lost, read part of the statement.\n\nADM described the situation as a reflection of poor environmental governance and disregard for the welfare of rural communities. People in Mazowe depend on this river. When it is destroyed, their whole way of life is threatened, the movement said.\n\nThe organisation is calling for a full investigation, the suspension of illegal operations and the restoration of the river ecosystem before more irreversible damage occurs.\n\nADM says it will continue pressuring the Government until meaningful action is taken to protect Zimbabwes natural resources and the communities that rely on them.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Action Democratic Movement (ADM) has sounded the alarm over the escalating environmental degradation along the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/12/04/action-democratic-movement-demands-urgent-government-action-over-destruction-of-mazowe-river-by-chinese-miners/\">Continue reading<span class=\"screen-reader-text\"> \"Action Democratic Movement Demands Urgent Government Action Over Destruction Of Mazowe River By Chinese Miners\"</span></a></p>",
            "time": "09:12",
            "date": "05 Dec 2025"
        }
    ]
}