{
    "news": [
        {
            "title": "ZANU PF MPs Slam Tungwarara’s Company Over Shoddy Village Business Units",
            "url": "https://www.zimeye.net/2025/09/10/zanu-pf-mps-slam-tungwararas-company-over-shoddy-village-business-units/",
            "content": "By A Correspondent| The Parliamentary Portfolio Committee on Agriculture has condemned Prevail International, a company owned by President Emmerson Mnangagwas advisor to the United Arab Emirates, Paul Tempter Tungwarara, for failing to deliver on its mandate despite receiving large sums of government funds.\n\nThe company, contracted under the Presidential Borehole Drilling Scheme and Village Business Units (VBUs), is accused of window-dressing projects across the country, leaving many communities without access to promised water and development facilities.\n\nDuring verification visits in Chivi District, Masvingo Province last week, Members of Parliament expressed outrage over what they described as shoddy work at more than 600 VBUs nationwide.\n\nIn Rushinga Constituency we have the same problem with Prevail International. All the sites are not working  not a single drop of water has come out since they drilled over a year ago. When you try to reach out to them, they dont cooperate, yet government has poured a lot of money into these non-functional VBUs, said Rushinga MP Tendai Nyabani.\n\nNyabani further stressed the committees oversight role: As Parliament, we must account for how government funds are being used. Yet youre only showing us sites commissioned by the President and the First Lady  those are functional, while the rest remain idle.\n\nMarambapfungwe legislator Tichaona Karumazondo echoed similar concerns.\n\nIn my constituency, the VBUs are also not working. Each time we call them, they promise to come in a week but never show up. Its been a year now, he said.\n\nGokwe MP Stephen Ngwenya turned his criticism towards the Zimbabwe National Water Authority (ZINWA).\n\nIs ZINWA monitoring these projects, or are they just sitting in their offices while taxpayers money is wasted? They are supposed to be overseeing these projects, he charged.\n\nA ZINWA representative defended the authority, saying: We follow up on these projects through the provincial irrigation engineers.\n\nHowever, a Chivi councilor welcomed the committees intervention, revealing that villagers had been forced to pay for water connections and other amenities despite the projects having been fully funded by government.\n\nDocuments seen by ZimEye show that out of 42 VBUs established in Rushinga District, only three are operational.\n\nPrevail International was contracted to drill approximately 10,000 boreholes countrywide under the Presidential Rural Development Programme, launched in 2021 to benefit 1.8 million households.\n\nTungwarara could not be reached for a comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Parliamentary Portfolio Committee on Agriculture has condemned Prevail International, a company owned by President Emmerson Mnangagwa’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/zanu-pf-mps-slam-tungwararas-company-over-shoddy-village-business-units/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF MPs Slam Tungwarara’s Company Over Shoddy Village Business Units\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Zimdancehall Musician Extorted in Cape Town",
            "url": "https://www.zimeye.net/2025/09/10/zimdancehall-musician-extorted-in-cape-town/",
            "content": "By Showbiz Reporter Popular Zimdancehall artist Hwinza had a harrowing experience in Cape Town this past weekend, where he was billed to perform at two venues, only to fall victim to a well-known extortion mafia that has terrorised foreign promoters and artists in South Africas entertainment industry.\n\nAccording to eyewitnesses, Hwinza and his promoter, Royce, arrived at Cape Town International Airport from Johannesburg but were immediately ambushed by men travelling in two vehicles. The group forcibly dragged Royce into their car and tried to seize Hwinza as well. The musician and his manager narrowly escaped, slipping away to an undisclosed location.\n\nThe assailants are said to be part of a notorious syndicate operating under the guise of a security team linked to the so-called Cape Town Promoters Association. This group is infamous for targeting Zimbabwean and other foreign artists staging shows in the city and surrounding areas. Their modus operandi involves demanding protection fees  essentially extortion payments  before allowing events to proceed without disruption.\n\nIn this case, Royce had reportedly been ordered to pay a fee before even landing in Cape Town. When he failed to comply, the gang escalated matters. While being held hostage, Royce was forced to withdraw R3,000 at the airport. However, the gang demanded R20,000, a sum far beyond his reach since the shows had been organised weeks in advance using his own resources.\n\nWhen the payment fell short, the criminals drove Royce to the first venue in Strand, where they demanded additional money from venue operators, collecting around R5,500. They later proceeded to the Cape Town CBD venue where Hwinza was scheduled to perform, seizing gate takings and selling entry tags for their own benefit. On stage, visibly distressed, Hwinza broke down before his fans, explaining the ordeal he was facing (see video in comments).\n\nDuring the standoff, Hwinzas manager was also assaulted, accused of hiding the artist from the extortionists. By early Monday morning, the shaken team managed to regroup, and both Hwinza and Royce eventually fled Cape Town, catching a flight out of the city.\n\nThe ordeal reflects a wider crisis of extortion mafias in South Africa. Over the past decade, Cape Town in particular has witnessed the rise of syndicates infiltrating various industries, from construction and transport to entertainment. These groups often operate with impunity, demanding fees from anyone seeking to run events or projects in their territory. In the entertainment sector, foreign artists from Zimbabwe, Nigeria, and the DRC have frequently been targeted, with gangs threatening violence, disrupting shows, or seizing proceeds unless payments are made.\n\nMembers of the Cape Town Promoters Association are divided on the issue. While some organisers condemned the gangs actions, warning that the extortion is strangling an industry already struggling to compete, others defended the practice, framing it as a form of protection and territorial control. One insider bluntly stated:No promoter should just come from nowhere and use our space without paying and following protocols.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Popular Zimdancehall artist Hwinza had a harrowing experience in Cape Town this past weekend, where he was … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/zimdancehall-musician-extorted-in-cape-town/\">Continue reading<span class=\"screen-reader-text\"> \"Zimdancehall Musician Extorted in Cape Town\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Top Zanu PF Officials Arrested for US$70K Fraud",
            "url": "https://www.zimeye.net/2025/09/10/top-zanu-pf-officials-arrested-for-us70k-fraud/",
            "content": "By A Correspondent Two senior Harare provincial Zanu PF officials have reportedly been arrested for fraud in a scandal that once again exposes the deep rot of corruption within Zimbabwes ruling party.\n\nSpencer Mabheka, a provincial member, and Lilian Chitanga, the Zone 3 District Coordinating Committee Womens League secretary, were taken into custody by the CID Police Anti-Corruption Unit (PACU) on fraud charges after allegedly selling three residential stands valued at US$70,000 each. The duo reportedly spent the night in police cells at Mabelreign Police Station.\n\nThe case took a dramatic twist when Zanu PF Harare Province chairman Goodwills Masimirembwa allegedly attempted to intimidate the officer-in-charge handling the matter. His efforts failed after it emerged that one of the victims of the scam was a senior army officer. Police have not yet issued an official statement on the arrests.\n\nThese developments highlight the entrenched culture of corruption and impunity within Zanu PF. Over the years, the ruling party has been repeatedly associated with abuse of office, looting of public resources, and the protection of corrupt elites. From the Willowgate scandal of the late 1980s, where senior government ministers illegally profiteered from vehicle imports, to the Marange diamond looting that saw billions of dollars vanish without trace, Zanu PF leaders have rarely been held accountable.\n\nInstead, many implicated officials are often shielded by political connections or redeployed to other senior posts. Masimirembwa himself is no stranger to controversy; he previously faced allegations of demanding bribes from diamond investors when he chaired the Zimbabwe Mining Development Corporation, yet he was later rewarded with a senior party position.\n\nThe arrests of Mabheka and Chitanga could signal more than just a crackdown on petty corruption. Analysts suggest they may be linked to the intensifying factional battles within Zanu PF, where corruption cases are selectively pursued as weapons in internal power struggles rather than genuine attempts to uphold the rule of law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Two senior Harare provincial Zanu PF officials have reportedly been arrested for fraud in a scandal that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/top-zanu-pf-officials-arrested-for-us70k-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zanu PF Officials Arrested for US$70K Fraud\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Holy 10 Asks For GoFund Donations And Reason Why People Are Delaying Giving Him Anything",
            "url": "https://www.zimeye.net/2025/09/10/holy-10-asks-for-gofund-donations-and-reason-why-people-are-delaying-giving-him-anything/",
            "content": "By Farai D Hove | ZimEye | A GoFund Me campaign set up by the singer Holy Ten under his real name, was published with a US geo location, ZimEye reports. Mukudze Chitsama rose to controversy at the weekend when he began accusing President Emmerson Mnangagwas two prominent sons, Sean and Collins saying they want to take over a house they gifted him. Several videos he live-streamed were deleted within minutes, and ever since then he has been allegedly tweeting out more allegations.\n\nHe said he is unlike the war veteran Blessed Geza, he is returning to Zimbabwe and will confront anyone who tries to harm him.\n\nNone of the accused have responded to the damning allegations.\n\nWeve lost EVERYTHING except our lives. Every donation, no matter how small, makes a real difference for us right now.\n\nNdaremerwa [I am in trouble], publishes the person running Holy Tens X account.\n\nAt 7am Wednesday, the Gofundme campaign was at zero, suggesting the community requires more information and or at least one moderated explanation before they can sympathise with Chitsama with their pockets\n\nMore to follow\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | A GoFund Me campaign set up by the singer Holy Ten under his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/holy-10-asks-for-gofund-donations-and-reason-why-people-are-delaying-giving-him-anything/\">Continue reading<span class=\"screen-reader-text\"> \"Holy 10 Asks For GoFund Donations And Reason Why People Are Delaying Giving Him Anything\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Dr Makoni Survives $1 Million Corruption Extortion Trap",
            "url": "https://www.zimeye.net/2025/09/10/dr-makoni-survives-1-million-corruption-extortion-trap/",
            "content": "By A Correspondent Dr Simba Makoni, former finance minister and veteran politician, narrowly dodged a US$1 million scam in which two men posed as Zimbabwe Anti-Corruption Commission (ZACC) officials and tried to extort him.\n\nFelix Rimaunga and Brian Nyazamba, the masterminds behind the elaborate scheme, were sentenced to eight years in jail by Harare regional magistrate Taurai Manuwere, with parts of the sentence suspended on condition of restitution and good behavior.\n\nThe duo had targeted high-profile figures, including former Harare mayor Elias Mudzuri, NetOne CEO Raphael Mushanawani, Douglas Chiimba of Africawide Zimbabwe, Dr Makoni, and medical doctor Dr Guzha. Victims were falsely told they were under investigation for corruption, murder, or sexual assault and pressured to pay bribes to close their dockets.\n\nDr Makoni was specifically told he was being investigated for allegedly flouting Exchange Control Regulations. The convicts demanded Z$1 million into a bank account in the name of Talent Murape  a person who does not exist.\n\nRimaunga and Nyazamba operated alongside Fortune Torima and Jacob Kuzinya, who remain at large. Investigators revealed that Nyazamba profiled the victims, while Rimaunga and Torima coordinated the creation of fake documents and bank accounts to lend credibility to the scheme.\n\nMudzuri was also targeted with a US$2,000 demand under the pretext of a murder case. Mushanawani was asked to pay 10 percent of recovered company assets from a rogue cashier, while Chiimba and Dr Guzha faced similar bogus claims.\n\nThis is a sophisticated criminal enterprise aimed at intimidating and defrauding high-profile Zimbabweans, said Harare regional prosecutor-in-charge, Gossy Mudambu.\n\nThe court emphasized the severity of impersonating anti-corruption officials and targeting prominent figures for financial gain, warning that such crimes undermine public trust in legitimate institutions.\n\nDr Makoni, who has long been a vocal advocate for integrity in public office, said the case highlights the need for vigilance against scams that exploit Zimbabweans trust in law enforcement.\n\nRimaunga and Nyazamba were convicted after a full trial, with two-and-a-half years suspended on condition of restitution to complainants and four years suspended if they refrain from similar crimes for five years. One-and-a-half years of their sentence are effective.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Dr Simba Makoni, former finance minister and veteran politician, narrowly dodged a US$1 million scam in which … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/dr-makoni-survives-1-million-corruption-extortion-trap/\">Continue reading<span class=\"screen-reader-text\"> \"Dr Makoni Survives $1 Million Corruption Extortion Trap\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Holy 10’s Actions Carry Weight, Says ZANU PF",
            "url": "https://www.zimeye.net/2025/09/10/holy-10s-actions-carry-weight-says-zanu-pf/",
            "content": "Musicians Holy 10s actions carry weight, writes a ZANU PF commentator Gracias Sibanda.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Musicians Holy 10’s actions carry weight, writes a ZANU PF commentator Gracias Sibanda.",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "New Factional Fights In Zanu PF",
            "url": "https://www.zimeye.net/2025/09/10/new-factional-fights-in-zanu-pf/",
            "content": "By A Correspondent  President Emmerson Mnangagwa has publicly confirmed that Zanu PF is deeply divided along factional lines, describing ongoing tensions within the ruling party as a serious internal challenge.\n\nSpeaking during the launch of the Zanu PF Womens League Empowerment Fund in Harare, Mnangagwa challenged members to resist divisions and urged the partys women to remain united amidst ongoing succession battles.\n\nThe exposure, denunciation, and rejection of those who try to fragment the womens league and divide the party is paramount, he said. Finally, I commend you all and our partners for the unity of purpose in our party work and the implementation of programmes and projects.\n\nThe ruling party is currently split over calls by some of Mnangagwas supporters to extend his term in office beyond the constitutional two-term limit. Mnangagwa, whose term ends in 2028, has resisted these calls, insisting that he will step down and allow the party and Zimbabweans to choose a new leader.\n\nZanu PFs current internal strife is not new. The party has a long history of factional battles, often intertwined with succession disputes and control over party structures.\n\nAnalysts say these factional battles have historically revolved around succession, control of party resources, and influence over key state institutions, often undermining the partys public image and cohesion.\n\nDuring the launch of the Womens League Empowerment Fund, Mnangagwa described the programme as a beacon of hope aimed at accelerating high-impact development projects across Zimbabwe.\n\nThe Presidential Womens Empowerment Fund is designed to be a powerful engine for economic growth, social inclusion, and transformation to ensure development that leaves no one and no place behind, he said.\n\nMnangagwa emphasised that the programme was intended for all women of Zimbabwe, calling on the league to adopt an inclusive approach in selecting beneficiaries.\n\nWhen women have economic power and sustainable sources of livelihoods, families are sustained, while communities are developed, step by step, brick by brick, he said. Women are natural builders and agents of transformation. Under the leadership of the womens league, they can work towards a brighter and more prosperous future for generations to come.\n\nThe Zanu PF first secretary added that empowerment efforts would go beyond financial support, including equipping women with skills and knowledge to drive change at the household and community levels.\n\nBy empowering women, the party and government, under my leadership, are investing in their personal growth and development for the well-being and prosperity of communities and the nation at large, Mnangagwa said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — President Emmerson Mnangagwa has publicly confirmed that Zanu PF is deeply divided along factional lines, describing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/new-factional-fights-in-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"New Factional Fights In Zanu PF\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Public Outcry Over ZANU PF’s “Meaningless” Women Empowerment Fund…",
            "url": "https://www.zimeye.net/2025/09/10/public-outcry-over-zanu-pfs-meaningless-women-empowerment-fund/",
            "content": "By A Correspondent\n\nThe ZANU PF Womens Leagues recent empowerment projects, touted as a step towards total emancipation of women, have been met with skepticism and criticism. The launch of the ZANU PF Womens League Presidential Empowerment Fund, with each province receiving a paltry $300,000, has been hailed by the party as a major milestone. However, critics argue that this move is nothing more than a publicity stunt, designed to garner votes and maintain the partys grip on power.\n\nOppah Muchinguri-Kashiri, the partys National Chairperson, claimed that the fund would help drive the country forward, stating, Since the struggle for independence, women have played key roles in moving the journey forward and to this day, women continue marching towards development and this fund will help drive the country forward. However, many Zimbabweans are questioning the effectiveness of this initiative, given the partys track record of failed empowerment programs.\n\nMabel Chinomona, Secretary for Womens Affairs in the Politburo, added that the league believes women play a key role in transforming lives and communities and need to be supported in its various ventures. Yet, the allocated amount of $300,000 per province seems woefully inadequate to make a meaningful impact.\n\nPresidential Investment Advisor Dr. Paul Tungwararas assertion that empowerment should unite people from across the country rings hollow, given the partys history of exclusionary policies and favoritism. Everyone should be empowered under the inclusive development trajectory of the party, and this is the message by the President that we should keep pushing everywhere and every day, he said. However, many Zimbabweans are skeptical about the partys commitment to genuine empowerment.\n\nThe partys focus on empowerment is also seen as a thinly veiled attempt to further its own interests. With President Mnangagwas stated goal of achieving an upper-middle-income society by 2030, the party is desperate to showcase its commitment to development. However, critics argue that this initiative is nothing more than a Band-Aid solution, designed to placate women and secure their votes.\n\nAs Muchinguri-Kashiri took the opportunity to reiterate the governments position on the drug and substance abuse menace, many Zimbabweans couldnt help but feel that the partys priorities are misplaced. The real issue is not the lack of empowerment programs, but the lack of transparency, accountability, and genuine commitment to the welfare of Zimbabweans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ZANU PF Women’s League’s recent empowerment projects, touted as a step towards total emancipation of women, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/public-outcry-over-zanu-pfs-meaningless-women-empowerment-fund/\">Continue reading<span class=\"screen-reader-text\"> \"Public Outcry Over ZANU PF’s “Meaningless” Women Empowerment Fund…\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Brother Turns Monster: Man Brutally Assaults Sister, Escapes Jail",
            "url": "https://www.zimeye.net/2025/09/10/brother-turns-monster-man-brutally-assaults-sister-escapes-jail/",
            "content": "By A Correspondent\n\nA 20-year-old man from Hwange has been convicted for viciously assaulting his own sister, following a violent domestic incident that shocked the community.\n\nAccording to court records, the attack occurred on August 30, 2025, at around 7 PM. The victim was carrying out her household chores when the offender stormed in and began hurling insults, accusing her of immoral behavior.\n\nThe situation quickly escalated as he grabbed a switch and struck her repeatedly on the back, causing her to collapse. He then used both open hands and clenched fists to beat her across the body before stomping on her neck with booted feet.\n\nThe brutal assault only ended when a neighbor intervened and restrained the attacker, saving the victim from further harm.\n\nThe Hwange Magistrates Court sentenced the offender to 12 months in prison. However, eight months were suspended, while the remaining four months were set aside on the condition that he completes 280 hours of community service.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 20-year-old man from Hwange has been convicted for viciously assaulting his own sister, following a violent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/10/brother-turns-monster-man-brutally-assaults-sister-escapes-jail/\">Continue reading<span class=\"screen-reader-text\"> \"Brother Turns Monster: Man Brutally Assaults Sister, Escapes Jail\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        },
        {
            "title": "Simba Makoni Escapes US$1 Million Corruption Extortion Trap",
            "url": "https://www.zimeye.net/2025/09/09/simba-makoni-escapes-us1-million-corruption-extortion-trap/",
            "content": "By A Correspondent  Former finance minister and veteran politician, Dr Simba Makoni, narrowly dodged a US$1 million scam in which two men posed as Zimbabwe Anti-Corruption Commission (ZACC) officials and tried to extort him.\n\nFelix Rimaunga and Brian Nyazamba, the masterminds behind the elaborate scheme, were sentenced to eight years in jail by Harare regional magistrate Taurai Manuwere, with parts of the sentence suspended on condition of restitution and good behavior.\n\nThe duo had targeted high-profile figures, including former Harare mayor Elias Mudzuri, NetOne CEO Raphael Mushanawani, Douglas Chiimba of Africawide Zimbabwe, Dr Makoni, and medical doctor Dr Guzha. Victims were falsely told they were under investigation for corruption, murder, or sexual assault and pressured to pay bribes to close their dockets.\n\nDr Makoni was specifically told he was being investigated for allegedly flouting Exchange Control Regulations. The convicts demanded Z$1 million into a bank account in the name of Talent Murape  a person who does not exist.\n\nRimaunga and Nyazamba operated alongside Fortune Torima and Jacob Kuzinya, who remain at large. Investigators revealed that Nyazamba profiled the victims, while Rimaunga and Torima coordinated the creation of fake documents and bank accounts to lend credibility to the scheme.\n\nMudzuri was also targeted with a US$2,000 demand under the pretext of a murder case. Mushanawani was asked to pay 10 percent of recovered company assets from a rogue cashier, while Chiimba and Dr Guzha faced similar bogus claims.\n\nThis is a sophisticated criminal enterprise aimed at intimidating and defrauding high-profile Zimbabweans, said Harare regional prosecutor-in-charge, Gossy Mudambu.\n\nThe court emphasized the severity of impersonating anti-corruption officials and targeting prominent figures for financial gain, warning that such crimes undermine public trust in legitimate institutions.\n\nDr Makoni, who has long been a vocal advocate for integrity in public office, said the case highlights the need for vigilance against scams that exploit Zimbabweans trust in law enforcement.\n\nRimaunga and Nyazamba were convicted after a full trial, with two-and-a-half years suspended on condition of restitution to complainants and four years suspended if they refrain from similar crimes for five years. One-and-a-half years of their sentence are effective.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Former finance minister and veteran politician, Dr Simba Makoni, narrowly dodged a US$1 million scam in which … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/09/simba-makoni-escapes-us1-million-corruption-extortion-trap/\">Continue reading<span class=\"screen-reader-text\"> \"Simba Makoni Escapes US$1 Million Corruption Extortion Trap\"</span></a></p>",
            "time": "18:09",
            "date": "10 Sep 2025"
        }
    ]
}