{
    "news": [
        {
            "title": "Opposition MPs Fall Into Crocodile Trap ?",
            "url": "https://www.zimeye.net/2025/01/13/opposition-mps-fall-into-crocodile-trap/",
            "content": "By A Correspondent\n\nIn a strategic move, President Emmerson Mnangagwa has successfully lured opposition MPs to his farm in Gweru, leaving many to wonder if this is a clever ploy to capture the opposition.\n\nThe visit was aimed to showcase the farming prowess of the First Family at Precabe farm in Kwekwe , according to State media.\n\nMnangagwa seized the opportunity to drive home his message of self-sufficiency, emphasizing the importance of Zimbabwe feeding itself using its own resources.\n\nHe encouraged farmers to strive for excellence, learn from others, and adopt modern farming techniques. The Presidents words were likely music to the ears of the visiting legislators, who were hosted by Mnangagwa and the First Lady, Dr. Auxilia Mnangagwa.\n\nHowever, not everyone is convinced of Mnangagwas intentions. Some have labeled the move as a typical crocodile style tactic, aimed at luring the opposition into a false sense of security . Others have questioned the timing and motives behind the visit, suggesting that it may be a clever ploy to undermine the oppositions efforts.\n\nDespite these concerns, Mnangagwas move has undoubtedly eclipsed the opposition, at least for the time being. The fact that opposition MPs were willing to visit the Presidents farm, despite initial reservations from some quarters, speaks volumes about Mnangagwas strategic prowess.\n\nAs the drama unfolds, one thing is clear: Mnangagwa has once again demonstrated his ability to outmaneuver his opponents. Whether this move will ultimately pay off remains to be seen, but for now, its clear that Mnangagwa has captured the attention of the opposition, and perhaps even won them over.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a strategic move, President Emmerson Mnangagwa has successfully lured opposition MPs to his farm in Gweru, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/13/opposition-mps-fall-into-crocodile-trap/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition MPs Fall Into Crocodile Trap ?\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "Mnangagwa’s Term Extension Plan Sparks Outrage",
            "url": "https://www.zimeye.net/2025/01/13/mnangagwas-term-extension-plan-sparks-outrage/",
            "content": "By A Correspondent\n\nBulawayo Mayor David Coltart has strongly criticized President Emmerson Mnangagwas proposal to extend his term beyond 2028, labeling the move as unconstitutional and undemocratic. Coltart emphasized that the electorate voted for their representatives in 2023 for a fixed 5-year term, with no expectation of an extension .\n\nAccording to Coltart, there is no mandate for any political party or politician to extend their term arbitrarily. He stressed that such a move would be a clear violation of the principles of representative democracy.\n\nThis criticism comes after government spokesperson Nick Mangwana claimed that the opposition party, CCC, was in agreement with the ruling Zanu PF partys resolution to postpone the next harmonized elections from 2028 to 2030.\n\nColtarts stance on this issue is not surprising, given his history of advocating for democracy and human rights in Zimbabwe. As a former Education minister and a prominent figure in the opposition, Coltart has consistently spoken out against authoritarianism and the erosion of democratic values .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Bulawayo Mayor David Coltart has strongly criticized President Emmerson Mnangagwa’s proposal to extend his term beyond 2028, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/13/mnangagwas-term-extension-plan-sparks-outrage/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Term Extension Plan Sparks Outrage\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "CCC Rivals in Disarray as  Infighting Escalates",
            "url": "https://www.zimeye.net/2025/01/13/ccc-rivals-in-disarray-as-infighting-escalates/",
            "content": "By A Correspondent\n\nThe Citizens Coalition for Change (CCC) is facing an intense internal power struggle, with Welshman Ncubes faction claiming legitimacy and authority to make binding decisions. This move has sparked disputes with two other factions: one led by Tshabangu, the interim secretary-general, and another loyal to former party leader Nelson Chamisa, led by Jameson Timba, the Chief Administrator.\n\nThe Ncube-led faction has made a bold move by suspending Tshabangu, just hours after the High Court ruled that Tshabangu had no authority to make changes in Parliament. This ruling was based on Tshabangus alleged violation of a previous High Court order, which barred him from making recalls pending the resolution of ongoing cases .\n\nTimba has accused Ncube of exploiting the partys ongoing legal battles against Tshabangu, arguing that Ncubes reliance on cases initiated by his faction proves they are the only legitimate authority for CCC MPs and councillors. However, Ncubes spokesperson, Willias Madzimure, has dismissed Timbas claims, asserting that Ncubes faction is the genuine CCC.\n\nMadzimure emphasized that Nelson Chamisa resigned as president of the CCC party over twelve months ago and was replaced by acting president Welshman Ncube, whose position has been confirmed by the latest High Court ruling. The High Court decision has ultimately confirmed that there is only one CCC, led by acting president Professor Welshman Ncube.\n\nThis internal conflict has exposed deep divisions within the CCC, leaving many to wonder if the party can recover from this infighting. As the situation unfolds, its clear that Mnangagwas opposition rivals are in disarray, which may ultimately work in his favor.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Citizens’ Coalition for Change (CCC) is facing an intense internal power struggle, with Welshman Ncube’s faction … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/13/ccc-rivals-in-disarray-as-infighting-escalates/\">Continue reading<span class=\"screen-reader-text\"> \"CCC Rivals in Disarray as  Infighting Escalates\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "Mnangagwa Captures Opposition as He Lures MPs to His Farm",
            "url": "https://www.zimeye.net/2025/01/13/mnangagwa-captures-opposition-as-he-lures-mps-to-his-farm/",
            "content": "By A Correspondent\n\nIn a strategic move, President Emmerson Mnangagwa has successfully lured opposition MPs to his farm in Gweru, leaving many to wonder if this is a clever ploy to capture the opposition.\n\nThe visit was requested by the legislators themselves, aimed to showcase the farming prowess of the First Family at Precabe farm in Kwekwe, according to State media.\n\nMnangagwa seized the opportunity to drive home his message of self-sufficiency, emphasizing the importance of Zimbabwe feeding itself using its own resources.\n\nHe encouraged farmers to strive for excellence, learn from others, and adopt modern farming techniques. The Presidents words were likely music to the ears of the visiting legislators, who were hosted by Mnangagwa and the First Lady, Dr. Auxilia Mnangagwa.\n\nHowever, not everyone is convinced of Mnangagwas intentions. Some have labeled the move as a typical crocodile style tactic, aimed at luring the opposition into a false sense of security .\n\nOthers have questioned the timing and motives behind the visit, suggesting that it may be a clever ploy to undermine the oppositions efforts.\n\nDespite these concerns, Mnangagwas move has undoubtedly eclipsed the opposition, at least for the time being.\n\nThe fact that opposition MPs were willing to visit the Presidents farm, despite initial reservations from some quarters, speaks volumes about Mnangagwas strategic prowess.\n\nAs the drama unfolds, one thing is clear: Mnangagwa has once again demonstrated his ability to outmaneuver his opponents. Whether this move will ultimately pay off remains to be seen, but for now, its clear that Mnangagwa has captured the attention of the opposition, and perhaps even won them over.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a strategic move, President Emmerson Mnangagwa has successfully lured opposition MPs to his farm in Gweru, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/13/mnangagwa-captures-opposition-as-he-lures-mps-to-his-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Captures Opposition as He Lures MPs to His Farm\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "Safety Tips For Driving Around Trucks…",
            "url": "https://www.zimeye.net/2025/01/13/safety-tips-for-driving-around-trucks-2/",
            "content": "Big rigs and other large vehicles have much larger blind-spot areas than traditional passenger vehicles:\n\nAlways avoid driving in a trucks blind spot. Move ahead of the truck or slow down so the driver can see you in the side mirrors.\n\nCommercial trucks have larger mirrors than passenger vehicles which can be affected by bright headlights. When you drive behind a truck, dim your lights to a standard low-beam setting as you approach to avoid blinding the driver through his or her mirrors.\n\nIt is always wise to pass another vehicle safely. However, careful passing is even more important near a commercial truck, because the large, heavy vehicle cannot stop as quickly as a passenger vehicle. Truck drivers need time to react and adjust their speed and brake accordingly.\n\nWhen passing a large truck, always approach from the left side, because it is easier for the driver to see you. Keep a consistent speed while passing and always signal clearly and in advance. Before you merge back into the lane in front of the truck, make sure you can see it in your rearview mirror to ensure a safe distance.\n\nWhen a truck passes you, slow down to allow plenty of space in front of you for the driver to maneuver safely and efficiently.\n\nWhen you change lanes or turn near a commercial truck, activate your signal earlier to give the driver more time to respond to your intended maneuver and slow down if needed.\n\nWhen merging, avoid moving into the lane in front of a large truck if upcoming traffic could slow down or stop abruptly. Trucks take longer to slow down, and a sudden lane change may not give the driver enough time to avoid crashing into your bumper.\n\nAlways keep a driving distance of at least four seconds between your vehicle and a commercial truck. If you are tailgating a big rig, the driver cannot see you. If you cannot stop in time or are rear-ended while traveling closely behind a large truck, your car may be pushed underneath the trailer  a type of collision that tends to be catastrophic.\n\nKeeping a safe distance will also give you more time to react to tire blowouts and rollovers caused by high winds. If you are in stopped traffic behind a truck, leave space between your vehicle and the truck, in case the truck begins to roll backward.\n\nSemi-trailer trucks take more room than passenger cars to make turns, and the cab and trailer both follow a different path. A truck may need to swing left to gain room for a right turn or may start a turn from the middle lane of traffic.\n\nDo not attempt to pass a truck that has a turn signal on, and do not drive between the truck and the curb. When at a stop at an intersection, make sure your vehicle is safely behind the line because trucks need that space to make turns.\n\nBe patient when sharing the road with semi-trailer trucks. Truck drivers have strict operating rules to follow and often use regulating devices, such as a speed limiter which restricts vehicle speed. Honking, aggressive driving, or maneuvering through traffic will not encourage a commercial driver to speed up. Instead, it could put you in danger of causing an accident.\n\nNot only is wearing your seat belt the law in California, but it can also keep you safer should you be involved in an accident. Always buckle kids in the back seat, in approved car seats if applicable.\n\nDistracted drivers put everyone in danger. Avoid using GPS systems, cell phones, and other devices while driving. Do not eat, adjust the radio or perform other actions that will take your eyes and concentration off the road.\n\nBy staying focused on driving, you will be better able to estimate the speed of trucks around you as they merge, turn, or change lanes, allowing you to respond appropriately.\n\nDriving while drowsy and fatigued is dangerous. If you are tired, get off the road and rest. When on long trips, allow time for rest breaks or have another driver who can relieve you when you become tired.\n\nAlcohol and drugs impair your reaction time and judgment  a deadly combination when driving. Even over-the-counter or prescription medications can cause side effects that make driving dangerous. Never drive under the influence of these substances.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Big rigs and other large vehicles have much larger blind-spot areas than traditional passenger vehicles: Always avoid driving in a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/13/safety-tips-for-driving-around-trucks-2/\">Continue reading<span class=\"screen-reader-text\"> \"Safety Tips For Driving Around Trucks…\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "Khupe Has Returned to Mnangagwa’s Precabe Farm, Same Way Fadzayi Mahere Has Bounced Back to ED",
            "url": "https://www.zimeye.net/2025/01/12/khupe-has-returned-to-mnangagwas-precabe-farm-same-way-fadzayi-mahere-has-bounced-back-to-ed/",
            "content": "Thokozani Khupe today returned to Emmerson Mnangagwas Precabe farm, the same way Fadzayi Mahere has bounced back to Luke Malabas corrupt courts to win empty defamation cases against EDs advisors, just so to outshine Nelson Chamisa whos never won a single political case in court.\n\nThokozani Khupe today returned to Emmerson Mnangagwas Precabe farm, the same way Fadzayi Mahere has bounced back to Luke Malabas corrupt courts to win empty defamation cases against EDs advisors, just so to outshine Nelson Chamisa whos never won a single political case inpic.twitter.com/QK8NZ4TIJg\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Thokozani Khupe today returned to Emmerson Mnangagwa’s Precabe farm, the same way Fadzayi Mahere has bounced back to Luke Malaba’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/12/khupe-has-returned-to-mnangagwas-precabe-farm-same-way-fadzayi-mahere-has-bounced-back-to-ed/\">Continue reading<span class=\"screen-reader-text\"> \"Khupe Has Returned to Mnangagwa’s Precabe Farm, Same Way Fadzayi Mahere Has Bounced Back to ED\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "List Of CCC MPs At Mnangagwa Farm Meeting",
            "url": "https://www.zimeye.net/2025/01/12/list-of-ccc-mps-at-mnangagwa-farm-meeting/",
            "content": "By Munacho Gwamanda-Bulawayo Mayor David Coltart has released a controversial list of Citizens Coalition for Change (CCC) Members of Parliament allegedly present at President Emmerson Mnangagwas Kwekwe farm meeting on Sunday.\n\nColtart, however, included a disclaimer, acknowledging uncertainty about whether the 15 named MPs had indeed attended the event.\n\nHe challenged those listed to clarify their involvement if they did not participate in the meeting, where Sengezo Tshabangu, the recently ousted CCC secretary-general, publicly endorsed Mnangagwas continued rule.\n\nZimEye is in the process of verifying this list, as we also do not have images of the listed MPs captured at the Mnangagwa farm meeting.\n\nTshabangu was given a platform at the Zanu PF gathering, where he declared his support for Mnangagwa remaining in power indefinitely, provided it reflected the will of the people.\n\nThe embattled politicians remarks have further cemented his image as a Zanu PF ally, drawing sharp criticism from CCC supporters.\n\nDespite being dismissed from the CCC last week, Tshabangu introduced himself at the event as the leader of the opposition, a claim that has added fuel to the political turmoil engulfing the opposition party.\n\nTshabangus dismissal came after the High Court reversed his controversial reshuffle of parliamentary roles, which was widely seen as an attempt to sideline allies of CCC founder Nelson Chamisa.\n\nWelshman Ncube, a leader of one of the CCC factions, later suspended Tshabangu pending a disciplinary hearing.\n\nThese developments are the latest in a series of internal conflicts that have plagued the CCC.\n\nThe partys divisions have been escalating since last year when Nelson Chamisa cited sabotage and infiltration as reasons for stepping away from leadership.\n\nTshabangu has been accused of playing a key role in undermining Chamisas leadership by alienating his allies and deepening the fractures within the party.\n\nThe fallout from Tshabangus participation in the Zanu PF event, coupled with his endorsement of Mnangagwas Vision 2030 agenda, underscores the fragile state of the CCC and its challenges in presenting a united front against Zanu PF dominance.\n\nI am told that these 15 MPs attended the Zanu PF meeting in Kwe Kwe today.I have no idea whether this list is correct and do not assert that it is.Accordingly I invite those listed to deny the allegation. Likewise if there are names of CCC MPs not listed here who attendedpic.twitter.com/HAxEUKq9S2\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Bulawayo Mayor David Coltart has released a controversial list of Citizens Coalition for Change (CCC) Members of Parliament … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/12/list-of-ccc-mps-at-mnangagwa-farm-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"List Of CCC MPs At Mnangagwa Farm Meeting\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "Twine Phiri Vows to Revive Zimbabwean Football",
            "url": "https://www.zimeye.net/2025/01/12/twine-phiri-vows-to-revive-zimbabwean-football/",
            "content": "Sports Correspondent\n\nFormer Caps United boss, Twine Phiri, has officially announced his candidacy for the Zimbabwe Football Association (ZIFA) presidency, set to hold elections later this month. Phiri, who has long been an influential figure in Zimbabwean football, believes he is the right person to lead the association and help revive the countrys footballing fortunes.\n\nIn a statement released on Saturday, Phiri confirmed that he would be launching his manifesto in Bulawayo at the Holiday Inn on the 20th of January. I am in the beautiful city of Bulawayo, where I will officially launch my manifesto for the 2025 ZIFA Elections at Holiday Inn Bulawayo. The launch will start at 2 PM, Phiri said.\n\nThe event, which is expected to attract significant media attention, will outline Phiris vision for the future of Zimbabwean football. The former football club chairman is calling on the media and other stakeholders to join him in working towards a new era for the sport in the country.\n\nI would like to invite all media houses to attend this event. Lets work together to revive Zimbabwean football! Choruwa Seven, Phiri added, emphasizing his commitment to bringing change to the national game.\n\nWith a focus on leadership and passion for the sport, Phiri is rallying supporters to back his bid with the hashtag #VoteTwinePhiri, calling on football lovers to unite behind his vision for a brighter future. Lets Rise & Shine Zimbabwean Football! Phiri said, urging everyone involved in the sport to join him in his mission to transform football in Zimbabwe.\n\nAs the countdown to the ZIFA elections continues, it remains to be seen whether Phiris experience, leadership, and passion will resonate with the voting members. But one thing is clear  he is determined to lead Zimbabwean football into a new chapter.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Caps United boss, Twine Phiri, has officially announced his candidacy for the Zimbabwe Football Association (ZIFA) presidency, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/12/twine-phiri-vows-to-revive-zimbabwean-football/\">Continue reading<span class=\"screen-reader-text\"> \"Twine Phiri Vows to Revive Zimbabwean Football\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "BREAKING NEWS: Tshabangu Endorses #ED2030 Agenda",
            "url": "https://www.zimeye.net/2025/01/12/breaking-news-tshabangu-endorses-ed2030-agenda/",
            "content": "By Munancho Gwamanda-Sengezo Tshabangu, the embattled and recently ousted secretary general of the Citizens Coalition for Change (CCC), has publicly endorsed President Emmerson Mnangagwas continued rule.\n\nThe endorsement came on Sunday during Tshabangus visit to Mnangagwas farm in Kwekwe, where he was accompanied by a handful of CCC lawmakers aligned with his faction.\n\nTshabangu was given a platform to address the Zanu PF gathering, where he declared his support for Mnangagwa remaining in power indefinitely if it aligned with the will of the people.\n\nTshabangus appearance and remarks at the event have further cemented his reputation as a Zanu PF ally, drawing sharp criticism from CCC supporters.\n\nDespite being dismissed from the opposition party last week, Tshabangu introduced himself at the event as the leader of the opposition, a bold claim that has intensified political tensions.\n\nHis dismissal followed a High Court ruling that reversed his controversial reshuffle of parliamentary roles, a move widely interpreted as an attempt to sideline Nelson Chamisa loyalists.\n\nHis former ally, Welshman Ncube, who claims to be the leader of a CCC faction, subsequently suspended Tshabangu pending a disciplinary hearing.\n\nThe CCCs internal divisions have been escalating since last year, when Chamisa announced his departure from the party, citing infiltration and sabotage.\n\nTshabangu has been accused of playing a central role in undermining Chamisas leadership by alienating his allies and deepening party fractures.\n\nThis latest developmentTshabangus participation in a Zanu PF gathering and his endorsement of Mnangagwas Vision 2030 agendahighlights the ongoing instability within the CCC.\n\nIt raises serious questions about the partys unity and its ability to present a credible challenge to Zanu PFs dominance in Zimbabwean politics.\n\nThis is it, National Dialogue done & dusted. GNU is loading. Already Tshabangu who represented the opposition CCC has already endorsed it. Although there is a case at suprime court where he is contesting his suspension from CCC Mind u, Ministerial reshuffle is still pending#2030pic.twitter.com/ABoIXrfQbX\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munancho Gwamanda-Sengezo Tshabangu, the embattled and recently ousted secretary general of the Citizens Coalition for Change (CCC), has publicly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/12/breaking-news-tshabangu-endorses-ed2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING NEWS: Tshabangu Endorses #ED2030 Agenda\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        },
        {
            "title": "JUST IN……Tshabangu Spotted At Mnangagwa Farm",
            "url": "https://www.zimeye.net/2025/01/12/just-intshabangu-spotted-mnangagawa-farm/",
            "content": "By Munacho Gwamanda- The fired and controversial CCC interim secretary general, Sengezo Tshabangu,  has stirred controversy once again by attending a meeting at President Emmerson Mnangagwas farm in Kwekwe.\n\nTshabangu, accompanied by a small group of CCC lawmakers aligned with him, was given a platform to address the Zanu PF gathering on Sunday.\n\nDuring his speech, Tshabangu openly endorsed Mnangagwas continued rule, stating he supported the president staying in power indefinitely if that was the will of the people.\n\nThis move further solidifies Tshabangus reputation as a Zanu PF ally.\n\nDespite his recent dismissal from the CCC Tshabangu introduced himself as the leader of the opposition at the event, which heavily promoted Mnangagwas Vision 2030 agenda.\n\nLast week, Welshman Ncube, leader of one CCC faction, suspended Tshabangu pending a disciplinary hearing.\n\nThe suspension followed a High Court ruling that reversed Tshabangus contentious reshuffle of parliamentary roles, a decision widely seen as targeting Chamisa loyalists.\n\nThe fractures in the CCC deepened last year when Chamisa himself announced his departure from the party, citing internal sabotage and infiltration.\n\nTshabangus manoeuvres to sideline his former allies intensified the turmoil, with his actions culminating in his removal from the party.\n\nThis latest incident, involving Tshabangus participation at a Zanu PF event, underscores the deep divisions and instability within the CCC, raising serious questions about the partys future and its ability to challenge Zanu PFs dominance.\n\nBreaking News:Leader of the Opposition Senator Sengezo Tshabangu made a bold statement, suggesting that if improving President Mnangagwa's stay in power would make the people of Zimbabwe happy, then Let it beTshabangu has endorsed the slogan \"2030 VaMnangagwa Vanengepic.twitter.com/Z47QD4Bx6K\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- The fired and controversial CCC interim secretary general, Sengezo Tshabangu, has stirred controversy once again by attending … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/12/just-intshabangu-spotted-mnangagawa-farm/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN……Tshabangu Spotted At Mnangagwa Farm\"</span></a></p>",
            "time": "06:39",
            "date": "13 Jan 2025"
        }
    ]
}