{
    "news": [
        {
            "title": "Kapfupi Sobers Up, Finally Collects Chivayo Aqua",
            "url": "https://www.zimeye.net/2025/06/09/kapfupi-sobers-up-finally-collects-chivayo-aqua/",
            "content": "By Showbiz Reporter-Celebrated comedian and musician Freddy Kapfupi Manjalima has finally taken delivery of a brand-new Toyota Aqua from flamboyant and controversial businessman Wicknell Chivayo, a week after being turned away from the dealership for showing up intoxicated.\n\nKapfupi, a fan-favorite known for his streetwise comedy and catchy musical skits, arrived at the Harare dealership on Sunday, June 9, flanked by his wife and looking noticeably sober.\n\nThis marked a personal triumph for the entertainer, who confessed he had spent the entire week without touching alcohol after a public humiliation the previous Sunday when dealer Madzibaba Chipaga refused to hand over the car due to his drunken state.\n\nI havent touched a drop of alcohol since last week, Kapfupi wrote on Facebook in a deeply emotional post addressed to Chivayo. The bad in one thing brings out the good in another, and in this, you taught me, and I learned.\n\nHe added, in a mix of Shona and English:Blessings from Godspirits do not give three times, but the Apostle gives five times indeed!a playful nod to Chivayos self-proclaimed role as a spiritual philanthropist.\n\nThe Kapfupi episode is the latest in a long string of high-profile vehicle donations by Chivayo, whose acts of generosity have sparked fierce debate in Zimbabwean society. A self-styled businessman with a controversial past and alleged ties to shady government contracts, Chivayo has made headlines over the past year for doling out dozens of imported vehicles to musicians, socialites, and clergymenoften broadcasting the handovers on social media with great fanfare.\n\nCritics argue that Chivayos donations are less about uplifting artists and more about laundering his public image and courting political favour, especially given his known proximity to Zimbabwes ruling elite. Many of his beneficiaries, including sungura artists, gospel singers, and TikTok personalities, have publicly thanked him with glowing praise, sometimes bordering on political endorsements.\n\nYet, questions continue to swirl around the source of Chivayos wealth. His name has featured in court cases, audit reports, and corruption expossincluding a multi-million dollar power project that never materialized despite huge payments from the government. Nonetheless, Chivayo remains untouchable, enjoying close ties to powerful figures and using social media to project an image of divine generosity.\n\nKapfupis experience added a sobering twist to Chivayos car donation saga. Unlike other recipients who collected their vehicles in clean handovers, the comedians first attempt was met with embarrassment as he stumbled into the dealership visibly drunk.\n\nIn a rare moment of public accountability, the dealershiprun by religious figure Madzibaba Chipagarefused to hand over the keys. The incident went viral, sparking both ridicule and sympathy. For Kapfupi, however, it proved to be a turning point.\n\nHis triumphant return, hand-in-hand with his wife and with a clear mind, seemed to carry more weight than just collecting a carit was a moment of personal redemption. Sir Wicknell, you are truly a guiding light for the foolish, Kapfupi said, expressing heartfelt gratitude and vowing never to touch alcohol again.\n\nWhile Kapfupis story ends on a high note, the broader narrative surrounding Chivayos largesse remains unresolved. Is he a misunderstood philanthropist or a calculating power broker exploiting vulnerable celebrities for political mileage?\n\nAs more artists line up for vehicles and social media continues to buzz with each new handover, one thing is clear: Wicknell Chivayo has mastered the art of spectacle. Whether its sincere giving or strategic self-promotion, Zimbabwe continues to watchcar by car, post by post.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-Celebrated comedian and musician Freddy “Kapfupi” Manjalima has finally taken delivery of a brand-new Toyota Aqua from flamboyant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/kapfupi-sobers-up-finally-collects-chivayo-aqua/\">Continue reading<span class=\"screen-reader-text\"> \"Kapfupi Sobers Up, Finally Collects Chivayo Aqua\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "OK Zimbabwe Hit Hard",
            "url": "https://www.zimeye.net/2025/06/09/ok-zimbabwe-hit-hard/",
            "content": "By Business Reporter-OK Zimbabwe, the countrys largest retail chain by branch network, is battling to raise US$30 million in fresh capital as it reels from a crippling liquidity crunch exacerbated by the recent introduction of the Zimbabwe Gold (ZiG) currency and a deteriorating macroeconomic environment.\n\nThe company has issued a further cautionary statement to shareholders and the investing public, disclosing that discussions around the proposed capital raise are at an advanced stage and nearing finalisation. The planned equity injection aims to restore working capital, settle mounting supplier debts, and finance strategic refurbishments and digital upgrades across its nationwide store network.\n\nDiscussions regarding the proposed US$30 million capital raise are now at an advanced stage and nearing finalisation, said company secretary Mrs. Margaret Munyuru. A circular incorporating notice of an extraordinary general meeting (EGM) will be published once final terms are agreed.\n\nThe capital raise follows a January 2025 statement in which the company announced the closure of five underperforming stores in Harare and Bulawayo. The affected branches include Robson Manyika, Glen Norah, Kuwadzana Express, and Mbare in Harare, as well as Chitungwiza Town Centre. The shutdowns resulted in the retrenchment of hundreds of employees, with the company offering a severance package of one months salary per year of service, three months notice pay, and settlement of accrued leave days.\n\nWhile management cited the challenging trading environment for the closures, analysts say the problems run deeper. By the end of 2024, OK Zimbabwe was facing a liquidity crisis, with key suppliers halting deliveries over unpaid invoices totaling around US$17 million and ZiG537 million in local obligations. This led to widespread stock-outs, a sharp decline in customer footfall, and plummeting sales  all of which compounded the retailers financial troubles.\n\nThe recent transition to the ZiG currency  introduced in April 2024 to replace the rapidly depreciating Zimbabwean dollar  has added further pressure on businesses.\n\nThough intended to stabilize the local economy, ZiGs limited availability and volatility have disrupted pricing, payments, and supplier relations, especially for large retailers like OK Zimbabwe that rely on both local and imported stock.\n\nRetailers now face the dual challenge of accessing scarce US dollars for imports and navigating fluctuating exchange rates when converting ZiG to hard currency.\n\nIn addition to currency volatility, analysts have questioned OK Zimbabwes financial strategy. The company continued to declare dividends even as its cash flow deteriorated. In March 2022, it paid a US dollar dividend of 0.13 cents per share (approximately US$1.7 million), followed by a 0.15 cent dividend in March 2023. Just five months later, the company took out a US$5 million loan at a 7.5 percent interest rate  a move that drew criticism for prioritising shareholder returns over operational stability.\n\nWhile attractive to investors, these dividend payouts appear to have weakened OKs ability to maintain sufficient working capital, said a banking sector analyst. The 2023 loan was a stopgap. This new capital raise must address the structural causes of the shortfall.\n\nAccording to Munyuru, the bulk of the capital raise will go toward clearing supplier debts and replenishing stock. A portion will also fund the refurbishment of high-traffic outlets and the upgrade of digital supply chain platforms aimed at improving inventory management and minimising stock-outs.\n\nThe board has engaged a consortium of local and international investors to underwrite the deal. Once terms are finalised, shareholders will receive a circular detailing the equity issuance and any changes to the companys Memorandum and Articles of Association. The transaction will require shareholder approval at the forthcoming EGM.\n\nRestored supplier confidence could enable OK Zimbabwe to replenish its shelves and recapture lost market share, added Maeresera. Meanwhile, the planned refurbishments and digital enhancements could improve the customer experience and help the retailer compete more effectively in an increasingly tough environment.\n\nUntil the capital raise is concluded, Munyuru said the company will continue updating shareholders in accordance with regulatory requirements as material developments occur.\n\nAs Zimbabwes economy teeters on the edge of another crisis, OK Zimbabwes fate may foreshadow the challenges facing the wider retail sector  where the intersection of currency instability, low consumer spending, and policy uncertainty has left many businesses fighting for survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-OK Zimbabwe, the country’s largest retail chain by branch network, is battling to raise US$30 million in fresh … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/ok-zimbabwe-hit-hard/\">Continue reading<span class=\"screen-reader-text\"> \"OK Zimbabwe Hit Hard\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "FIFA Orders Nyasa Big Bullets to Compensate Ronald Chitiyo or Face Transfer Ban",
            "url": "https://www.zimeye.net/2025/06/09/fifa-orders-nyasa-big-bullets-to-compensate-ronald-chitiyo-or-face-transfer-ban/",
            "content": "Sports Correspondent\n\nWorld football governing body FIFA has given Malawian club Nyasa Big Bullets a 45-day ultimatum to pay Zimbabwean midfielder Ronald Rooney Chitiyo US$15,200 in compensation for breach of contract.\n\nThe directive follows a contractual dispute after Bullets prematurely terminated Chitiyos deal just one year into a three-year agreement. The midfielder was subsequently forced to return to Zimbabwe, where he signed with Premier Soccer League side GreenFuel.\n\nAccording to FIFAs ruling, failure by Nyasa Big Bullets to settle the compensation within the stipulated time frame will result in a transfer ban being imposed on the club. The sanction would block Bullets from registering new players, potentially disrupting their recruitment plans.\n\nThe case highlights the growing scrutiny of player treatment and contract enforcement in African football. Chitiyo, a former CAPS United star known for his flair and creativity, had joined Bullets with high expectations, but his stint was abruptly cut short without clear justification.\n\nNow, with FIFA stepping in, the spotlight is on Bullets to comply and avoid further disciplinary action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent World football governing body FIFA has given Malawian club Nyasa Big Bullets a 45-day ultimatum to pay Zimbabwean … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/fifa-orders-nyasa-big-bullets-to-compensate-ronald-chitiyo-or-face-transfer-ban/\">Continue reading<span class=\"screen-reader-text\"> \"FIFA Orders Nyasa Big Bullets to Compensate Ronald Chitiyo or Face Transfer Ban\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "Munetsi Urges Wolves to Revise Transfer Strategy After Cunha Exit",
            "url": "https://www.zimeye.net/2025/06/09/munetsi-urges-wolves-to-revise-transfer-strategy-after-cunha-exit/",
            "content": "Sports Correspondent\n\nMarshall Munetsi has issued a strong warning to Wolverhampton Wanderers about their transfer strategy following the high-profile departure of Matheus Cunha to Manchester United.\n\nCunha was snapped up by United for 62.5 million after they activated the Brazilian forwards release clause.\n\nSpeaking to Sportsboom, as reported by the Express and Star, Munetsi emphasized the urgent need for reinforcements ahead of the new season.\n\nWe need depth, no question, Munetsi said. Losing players like Cunha will be tough; he brings creativity and energy. But Wolves cant rely on one or two players.\n\nHe added, The system has to evolve, and everyone has to raise their game. Recruitment will be key. But more than that, our mindset has to shift  from survival to competing.\n\nMunetsi arrived at Molineux in the January transfer window as one of head coach Vitor Pereiras initial signings. The Zimbabwean midfielder has already made a positive impression, scoring twice in 14 appearances and playing a vital role in helping Wolves retain their Premier League status.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Marshall Munetsi has issued a strong warning to Wolverhampton Wanderers about their transfer strategy following the high-profile departure … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/munetsi-urges-wolves-to-revise-transfer-strategy-after-cunha-exit/\">Continue reading<span class=\"screen-reader-text\"> \"Munetsi Urges Wolves to Revise Transfer Strategy After Cunha Exit\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "Zimbabwean Farmers Tap into Global Genetics with AI…",
            "url": "https://www.zimeye.net/2025/06/09/zimbabwean-farmers-tap-into-global-genetics-with-ai/",
            "content": "By Dr. Trywell Muzerengi\n\nArtificial insemination (AI) is revolutionising livestock production in Zimbabwe and around the world, allowing farmers to improve the quality of their herds without the need for a live bull.\n\nAt its core, AI involves introducing semencollected from genetically superior bullsinto a female animals reproductive tract to achieve conception. This technique offers a wide range of benefits that traditional breeding methods cannot match.\n\nOne of the biggest advantages of AI is the ability to access semen from top-tier bulls sourced globally. This allows farmers to enhance the genetic pool of their herds, boosting productivity, resilience, and overall animal quality.\n\nAnother benefit is controlled breeding. Through a process called synchronisation, female animals can be induced to go into heat at the same time. As a result, they will conceive and calve around the same period, allowing for better planning, streamlined management, and more predictable production cycles.\n\nAI also opens the door to sexed semena scientific breakthrough that enables farmers to choose the gender of the offspring. This is particularly useful for dairy farmers who often prefer female calves for milk production.\n\nAdditionally, AI significantly reduces the risk of spreading sexually transmitted diseases that can be passed through natural mating. By eliminating the need to transport bulls between farms, AI also cuts down on logistics costs and reduces the risk of animal stress and injuries.\n\nIn short, artificial insemination is safer, more efficient, and far more strategic than traditional methods of breeding. It is a modern solution that puts the farmer in controlboosting productivity, protecting animal health, and helping build a stronger and more sustainable livestock industry in Zimbabwe.\n\nemail:[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Artificial insemination (AI) is revolutionising livestock production in Zimbabwe and around the world, allowing farmers to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/zimbabwean-farmers-tap-into-global-genetics-with-ai/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Farmers Tap into Global Genetics with AI…\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "All State Universities Lecturers To Strike Tomorrow",
            "url": "https://www.zimeye.net/2025/06/09/all-state-universities-to-strike-tomorrow/",
            "content": "Obvious Vengeyi,@AUT_UZspokesperson says state universities lecturers will meet tomorrow and are likely to join the wage strike. Striking Lecturers have not been paid for last month as a way of trying to force them to return to teachinghttps://t.co/EADHdXMpV6\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "ZRP Cop Kills Suspect For Refusing To Pay Bribe …",
            "url": "https://www.zimeye.net/2025/06/09/zrp-cop-kills-suspect-for-refusing-to-pay-bribe/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has launched a nationwide manhunt for Constable Prince Ndavambi, who is accused of fatally assaulting a suspect, Blessed Believe Juruvenge, while in police custody. The ZRP has confirmed that a murder docket has been opened and that Ndavambi is the main suspect in the case.\n\nZRP spokesperson Commissioner Paul Nyathi addressed the media on Saturday, 8 June, dispelling what he called misleading facts and information surrounding the case and the forces response to the incident.\n\nFor the record, the late Blessed Believe Juruvenges relatives and neighbours came to Police General Headquarters and met the ZRP Command on the day their relative was reported to have passed on, said Nyathi. The Police Command quickly directed that a murder docket be opened and that the suspect, Constable Prince Ndavambi, be arrested. This is the correct and official position which the late Juruvenges relatives are fully aware of.\n\nConstable Ndavambi allegedly vanished just as police prepared to arrest him. His disappearance has prompted the ZRP to appeal to the public for any leads that could assist in locating him.\n\nEfforts to arrest him are underway for the law to take its course without fear or favour, Nyathi added. The Commissioner-General of Police, Stephen Mutamba, has made it clear that the law is the law and that no one will sweep this disturbing case under the carpet.\n\nAccording to ZRP, two official post-mortem examinations have already been conductedone by Dr. Guillen and another by Dr. Jabangwe. However, the Juruvenge family remains within their rights to seek an independent post-mortem.\n\nThe exact charge to be faced by Prince Ndavambi will be determined by the courts based on the police inquiry and full post-mortem results, Nyathi explained.\n\nThe incident traces back to May 25, 2025, when Juruvenge, a 30-year-old Damafalls tuckshop owner, reportedly got into a dispute with a customer, Mwazha, who had tried to use a counterfeit US$50 note. After an alleged physical altercation, Mwazha offered to pay US$100 in compensation but later went to the police and accused Juruvenge of assault.\n\nOn May 27, Ndavambiaccompanied by Mwazhaarrested Juruvenge and his sister, Melisa Manyepa, at their home. It is alleged that Ndavambi assaulted Manyepa behind a cabin, striking her on the knees with a wooden stick, before turning the same weapon on Juruvenge.\n\nMedia reports allege that the officer was trying to extort a US$100 bribe when he brutally beat Juruvenge, resulting in his death shortly after the arrest.\n\nIn response to the growing media attention, Nyathi urged journalists to report responsibly. We appeal to the media to avoid misrepresenting the facts of the case. Let the due process of law take its course.\n\nMembers of the public with information on the whereabouts of Constable Ndavambi are urged to contact the nearest police station immediately.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has launched a nationwide manhunt for Constable Prince Ndavambi, who is accused … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/zrp-cop-kills-suspect-for-refusing-to-pay-bribe/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Cop Kills Suspect For Refusing To Pay Bribe …\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "Grass-Cutting Or Political Crime? Veteran Journalist Recounts CIO Ordeal",
            "url": "https://www.zimeye.net/2025/06/09/grass-cutting-or-political-crime-veteran-journalist-recounts-cio-ordeal/",
            "content": "By Matthew Takaona\n\nIt is 11am, Tuesday 3 June, 2025.\n\nA red Honda Fit notorious for political violence in Gutu District screeches to a halt and stops in the middle of the highway cowboy style.\n\nClad in a blue suit, eyes rolling like a chameleon, the driver jumps out leaving doors open as he advances menacingly towards me. Four other men emerge from the little car and make an oxbow formation as if I had any intentions to run away.\n\nOne would be pardoned for thinking that the gang was moving in on a wanted, dangerous armed criminal.\n\nI was only a parent clearing grass and shrubs along a road used by kids on their way to school.\n\nAlmost at the same time, ZANU PF Councillor for Ward 35 Gutu and a former Gutu RDC CEO, Benson Kurauone Dandiras white Nissan twin cab pulls to a halt from the opposite direction and parks in the middle of the road in front of the Honda Fit.\n\nFrom it jumps a group of party hangers-on who looked like they were ready to pounce on someone and turn him into mincemeat. There is a desperate show of invincibility as hapless villagers only armed with sickles and slashers that they were using to clear the road look on.\n\nA green CIO Ford Ranger twin cab had earlier passed through the road in a ZANU PF convoy to a campaign rally in Gutu East. The unregistered vehicle carried equipment for the rally including speakers.\n\nThe question that lingers is; is this the Central Intelligence that we need? Is this the role of the Central Intelligence in a normal functional state? Is this what the once revered, almost mystique Central Intelligence Organisation (CIO) has become; an embedded, rag-tag outfit that openly, brazenly and without a drop of shame moves around with ZANU PF leaders and hooligans, coercing, threatening and beating up innocent civilians?\n\nA State intelligence whose operatives go around harassing people on behalf of friends, connections and politicians? What does the State benefit from operatives who are characterised by communities as bullies and terror agents?\n\nImagine a countrys secret service leaving office to go and arrest villagers cutting grass by the roadside?\n\nThis is the situation in Gutu District and the Zimbabwe Human Rights Commission captured something akin to this in a report published last year.\n\nCentral Intelligence is by nature and rule secretive but not in Gutu where operatives are visible in bars, townships, at political gatherings, political activities and familiar to everybody.\n\nThey are some sort of notorious celebrities. Dr Fulton Mangwaya, the CIO Director General must be ashamed to lead such an unprofessional outfit which takes instructions from all and sundry as long as they are ZANU PF and they have money and power.\n\nThe long-term effect of allowing this free spirit to men and women in the CIO is chilling; the consequences are dire and difficult to reverse.\n\nA State intelligence organisation in that form and shape is a loose cannon, dangerous and available to the highest bidder. The bottom line is that it is a militia.\n\nZimbabwe has walked the road before; 2008 is a gory and dark hour in the history of our country.\n\nThe violence that people went through makes sacrifices of the liberation struggle and independence pointless.\n\nWhat do you think you are doing? barked the CIO operative who I realised is nicknamed Stavo.\n\nWe are cutting overgrown grass to make the road safe for school kids, I replied trying hard to suppress my swelling anger at the abuse that I was being subjected to.\n\nHe grabbed my phone and tried to wrestle it away but I kept my hands tight on it until he gave up.\n\nHe then snatched away Tendai Jaybens (one of the parents) phone that had US$300 under its cover.\n\nThe money was stolen, she did not get it when the phone was handed back to her five hours later.\n\nGutu residents said this precisely is Stavos character. A village bully! You have been arrested, he further said.\n\nI asked him to identify himself otherwise I would not co-operate. He said I was being arrested by Feret, adding that he would explain the meaning of Feret later.\n\nI still insisted on an ID until he instructed one Police Officer called O Sibanda to produce his ID. I was told that this Sibanda is notorious for accompanying this gang wherever it goes to harass and violate people.\n\nI later learned from a lawyer that Feret is a system used by the ruling party to abuse real or perceived opponents.\n\nFeret which consists of a member each from every State security department; CID, CIO, Army, Prisons and Police is used for arresting enemies.\n\nHowever, arresting powers rest with the Police; its not the duty of secret service. In my case, I was arrested by a CIO agent who led the whole process.\n\nSo much about law and order in our country! It was Stavo who questioned me, forced me into his car and took me to Gutu Police Station without any arresting powers.\n\nNone of the things that he did is legal. Sibanda who instead should have led the process was no actor.\n\nIf this is not lawlessness and violation of peoples rights then what is? Stavo forced me to leave my car unlocked and unguarded.\n\nHe speeded towards the Gutu Police Camp and at one time we all yelled as he almost rammed into an oncoming vehicle.\n\nI sat for five hours at the Police Station guarded by three members of the gang.\n\nDandira had told me that I was being arrested for cutting grass on the roadside without his approval as a councillor.\n\nFor all those five hours no one really advised me of the specific crime I had committed. There was no warned and cautioned statement.\n\nThat is blatant violation of a suspects rights by men and women who think they are above the law. Initially, they told me that I had cut grass without permission.\n\nWhen they realised that there was no such law, the Officer-in-charge and another senior Cop said I was not a resident of the ward and therefore I was not supposed to cut that grass.\n\nBut I am a resident of Gutu. They later tried to link the case to an unlawful political gathering hoping that parents who were slashing grass were bussed from elsewhere.\n\nIt emerged that all were residents of the area and the case fell flat. They tried to accuse me of endangering the parents by slashing grass by the roadside but they again abandoned that line.\n\nRealising that there was no crime committed, they then invited EMA to see if the Authority could raise a case against me.\n\nAfter a lengthy meeting, EMA noted that what I did was correct, if at all it is the Government that is on the wrong side of the law by not clearing the road.\n\nWithout the involvement of the CIO and with Zanu PF officials not directing operations of a State organ, a frivolous case like this one would never have been raised, wasting a whole day, fuel and human resources running after the wind.\n\nThis is what happens when State security organs become captured and allow themselves to become thuggish. A bigger danger awaits Zimbabwe.\n\nCurrently Government is facing millions of dollars worth of lawsuits for wrongful arrests.\n\nA responsible and efficient Government would not allow such a waste of resources but who cares about the economy or the people in our Government?\n\nSecurity agents involved in wrongful arrests against advice must be sued in their personal capacities.\n\nMeanwhile US$300 disappeared into the hands of a State security agent.\n\n*Matthew Takaona is a veteran Zimbabwean journalist and Masvingo Mirror consultant\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Matthew Takaona It is 11am, Tuesday 3 June, 2025. A red Honda Fit notorious for political violence in Gutu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/grass-cutting-or-political-crime-veteran-journalist-recounts-cio-ordeal/\">Continue reading<span class=\"screen-reader-text\"> \"Grass-Cutting Or Political Crime? Veteran Journalist Recounts CIO Ordeal\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "Mnangagwa Is Pure Honey, ZANU PF Bombs Insiza Voters With Rhetoric",
            "url": "https://www.zimeye.net/2025/06/09/mnangagwa-is-pure-honey-zanu-pf-bombs-insiza-voters-with-rhetoric/",
            "content": "By A Correspondent\n\nINSIZA NORTH  ZANU PFs campaign trail hit full stride this past Saturday in Shanganis Sweet Home area, where the party officially launched its bid for the Insiza North by-election with a rally heavy on praise for President Emmerson Mnangagwa and his governments development efforts.\n\nThe ruling partys top brass unleashed a barrage of lofty declarations, portraying President Mnangagwa as the embodiment of progress and prosperitypure honey, in the words of some supporters. Campaigning for the partys candidate, Cde Delani Moyo, ZANU PF leaders used the stage to trumpet a range of developmental projects and to draw a direct line between them and the Presidents so-called Second Republic.\n\nIf you look at the calibre of our candidate, you see that we are serious about development, said ZANU PF Matabeleland South Provincial Chairperson, Cde Mangaliso Ndlovu. Cde Delani is a committed ZANU PF cadre, and is following the policies of the President that seek to have inclusive development. The work that is already being done by Cde Delani is a clear demonstration that he will do a lot to transform this community.\n\nFrom boreholes to base stations, the speakers catalogued what they claimed to be tangible results of ZANU PFs governance: 14 boreholes drilled, roads rehabilitated, a mobile network base station installed, and schools equipped with ICT tools.\n\nThe rally, attended by hundreds including many youths, was also used to project electoral dominance and to frame the by-election as a foregone conclusion.\n\nInsiza North has a future, said Politburo member Cde Richard Ndlovu. The turnout here shows that we are assured of victory. We are confident that you will deliver the seat to ZANU PF because it is rightfully ours.\n\nNational Political Commissar Cde Munyaradzi Machacha went further, portraying the vote as not just for a local MP, but as a referendum on Mnangagwas leadership.\n\nIn your constituency you are seeing boreholes being drilled, roads being graded Before the end of the week we should have eight solarised boreholes, said Machacha. These are the works of ZANU PF, the works of President Mnangagwa. So when you are voting for Delani, you are voting for ZANU PF, you are voting for a party that brings development to the citizenry.\n\nHe continued: President Mnangagwas vision is to see to it that there will be no place left behind. In a week, you are going to have network in this area.\n\nThe campaign event, rich in patriotic fanfare and political hyperbole, was more than a call to voteit was a full-throated appeal to loyalty. And if the rhetoric is anything to go by, ZANU PF is betting on the idea that development promises, wrapped in praise for Mnangagwa, will be enough to sweeten the vote in Insiza North.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent INSIZA NORTH – ZANU PF’s campaign trail hit full stride this past Saturday in Shangani’s Sweet Home … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/mnangagwa-is-pure-honey-zanu-pf-bombs-insiza-voters-with-rhetoric/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Is Pure Honey, ZANU PF Bombs Insiza Voters With Rhetoric\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        },
        {
            "title": "CIO Agents Steal USD 300 From Gutu Parent During Scuffle Over Grass-Cutting",
            "url": "https://www.zimeye.net/2025/06/09/cio-agents-steal-usd-300-from-gutu-parent-during-scuffle-over-grass-cutting/",
            "content": "By A Correspondent\n\nMembers of the Central Intelligence Organization (CIO) allegedly stole US$300 from a parent in Gutu during a confrontation over a roadside grass-cutting exercise near Mushayavanhu High School last week.\n\nThe ZANU PF leadership in Gutu reportedly directed State security agents to arrest veteran journalist and Masvingo Mirror consultant Matthew Takaona, accusing him of mobilizing local parents to clear overgrown grass along a road used by schoolchildren.\n\nSources said the government agents carried out the arrest violently, harassing both Takaona and several parents involved in the clean-up.\n\nDuring the scuffle, one of the agents reportedly seized a mobile phone from parent Tendai Jayben. A parent who witnessed the incident said:\n\nOne of the agents took Tendai Jaybens phone, which had US$300 hidden under the cover. When the phone was returned five hours later, the money was missing.\n\nLocal residents identified the agent as Stavo, describing him as a well-known village bully.\n\nTakaona recounted his own arrest:\n\nI asked him to identify himself, otherwise I would not cooperate. He said I was being arrested by Feret, adding that he would explain the meaning of Feret later.\n\nThe term Feret reportedly refers to a multi-agency task team composed of members from the CIO, CID, police, army, and prison services, often deployed to target perceived political opponents.\n\nNo official comment could be obtained from the Zimbabwe Republic Police on the matter.\n\nHowever, a police source in Gutu said:  Our hands are tied, the case is sensitive. \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Members of the Central Intelligence Organization (CIO) allegedly stole US$300 from a parent in Gutu during a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/09/cio-agents-steal-usd-300-from-gutu-parent-during-scuffle-over-grass-cutting/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Agents Steal USD 300 From Gutu Parent During Scuffle Over Grass-Cutting\"</span></a></p>",
            "time": "06:42",
            "date": "10 Jun 2025"
        }
    ]
}