{
    "news": [
        {
            "title": "Adams Shines as Mamelodi Sundowns Thrash SuperSport United in Tshwane Derby",
            "url": "https://www.zimeye.net/2025/02/07/adams-shines-as-mamelodi-sundowns-thrash-supersport-united-in-tshwane-derby/",
            "content": "Sports Correspondent\n\nMamelodi Sundowns dominated their Tshwane derby rivals, SuperSport United, securing a comfortable 3-0 victory in a Betway Premiership clash at the Lucas Moripe Stadium on Wednesday evening.\n\nThe win, thanks to goals from Jayden Adams and a brace from Tashreeq Matthews, kept the Brazilians six points clear at the top of the table, maintaining their advantage over second-placed Orlando Pirates, who also won their match against Sekhukhune United. Sundowns now head into a crucial league encounter with Pirates this weekend.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Mamelodi Sundowns dominated their Tshwane derby rivals, SuperSport United, securing a comfortable 3-0 victory in a Betway Premiership … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/07/adams-shines-as-mamelodi-sundowns-thrash-supersport-united-in-tshwane-derby/\">Continue reading<span class=\"screen-reader-text\"> \"Adams Shines as Mamelodi Sundowns Thrash SuperSport United in Tshwane Derby\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "We Are Solid, Claims Ziyambi",
            "url": "https://www.zimeye.net/2025/02/07/we-are-solid-claims-ziyambi/",
            "content": "By A Correspondent\n\nThe ZANU PF Mashonaland West Provincial Coordinating Committee met in Chinhoyi on Wednesday, where it was announced that war veteran Blessed Geza had been expelled from the party. The decision was made following accusations of indiscipline and going against the partys constitution.\n\nZANU PF Politburo member Ziyambi Ziyambi addressed the media following the meeting, claiming that the leadership within the party remains solid and united. He further emphasized the commitment of the presidium, which includes President Emmerson Mnangagwa, Vice Presidents Kembo Mohadi and General (Retired) Constantino Chiwenga. Ziyambi rejected claims of internal conflict, asserting that the trio has never been involved in any form of discord.\n\nThe leadership is solid, Ziyambi said. President Mnangagwa and his two Vice Presidents are united beyond measure. There has never been a day when they engaged in any form of conflict or tension.\n\nZiyambi also took aim at those he described as rogue elements, such as Geza, who, according to him, sought to represent their personal opinions as the official stance of the party leadership. He warned that any member who violates the partys constitution would face disciplinary action.\n\nSome people are trying to push their personal agendas under the guise of the leadership, but we will act against anyone who deliberately breaks our constitution, he said.\n\nZANU PF Mashonaland West Provincial Chairperson Mary Mliswa Chikoka reiterated the decision to expel Geza, emphasizing that the action was in line with the partys stance on discipline and loyalty. Mliswa Chikoka explained that the party had no choice but to expel Geza after his actions contradicted the values and expectations outlined in the partys constitution.\n\nOur constitution is very clear on issues of indiscipline and loyalty, she said. Geza violated this, and the meeting has resolved to expel him. We are also calling for the stripping of his Central Committee position, as his actions go against what the party expects from its leaders.\n\nZANU PFs Deputy Political Commissar Webster Shamu also spoke on the importance of adhering to the partys constitution, noting that the decision to expel Geza was not taken lightly.\n\nWe are a party of principle and ideology, and we must follow our constitution. It is never the partys intention to expel members, but gross violations cannot be ignored, Shamu explained.\n\nThe expulsion of Geza comes after he publicly criticized President Mnangagwa and condemned the resolutions passed at the ZANU PF Annual National Peoples Conference in Bulawayo last year. The partys leadership has worked to present a united front, with a clear message to members that any attempts to undermine the partys structure or principles will not be tolerated.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ZANU PF Mashonaland West Provincial Coordinating Committee met in Chinhoyi on Wednesday, where it was announced … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/07/we-are-solid-claims-ziyambi/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Solid, Claims Ziyambi\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "N’anga In Trouble For Killing Baby",
            "url": "https://www.zimeye.net/2025/02/07/nanga-in-trouble-for-killing-baby/",
            "content": "By A Correspondent\n\nIn a shocking incident, a 3-month-old baby boy underwent a life-threatening procedure at the hands of a traditional healer in Chiredzi.\n\nThe healer, Gogo Mashila, attempted to correct a congenital condition affecting the childs tongue.\n\nAccording to police in Chiredzi, the procedure went horribly wrong, resulting in severe bleeding that ultimately led to the babys death.\n\nThe mother, Shylett Runhare, had sought the healers help, but the outcome was devastating.\n\nThe incident has raised concerns about the safety and efficacy of traditional healing practices, particularly when it comes to vulnerable patients like infants. Authorities are investigating the matter, and the community is left to mourn the loss of a young life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a shocking incident, a 3-month-old baby boy underwent a life-threatening procedure at the hands of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/07/nanga-in-trouble-for-killing-baby/\">Continue reading<span class=\"screen-reader-text\"> \"N’anga In Trouble For Killing Baby\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Masvingo Community In Crisis As New Start Centre Closes",
            "url": "https://www.zimeye.net/2025/02/07/masvingo-community-in-crisis-as-new-start-centre-closes/",
            "content": "By A Correspondent\n\nIn a concerning turn of events, the New Start Centre has temporarily closed its office in Masvingo, leaving many concerned about the future of the vital services they offer. The closure is reportedly linked to the temporary suspension of US funding for Africa, a development that has sent shockwaves through the community.\n\nIn an official public notice released on Wednesday, the New Start Centre confirmed the closure.\n\nThe announcement has left many individuals who rely on the centres services uncertain about their next steps, particularly those who are due for antiretroviral treatment (ART) or pre-exposure prophylaxis (PrEP) refills.\n\nThese treatments are vital for individuals living with HIV, and the disruption has raised alarms over the potential health consequences.\n\nA New Start Centre employee, who spoke on condition of anonymity, expressed frustration at the situation, saying, Its not looking good, our clients are stranded. We have to wait and see, our hands are tied.\n\nThe closure comes at a time when global health initiatives are facing increasing financial constraints, particularly due to the temporary withdrawal of US funding for African health programs.\n\nThis funding, which supports a variety of health services across the continent, has been crucial in providing care and treatment for people living with HIV and AIDS.\n\nThe closure of the Masvingo office raises concerns about the broader impact on the regions public health efforts, with many people now left to seek alternative care from local health facilities. However, there is uncertainty about whether these facilities are equipped to handle the increased demand.\n\nWhile the New Start Centre has assured the public that assistance can be sought from nearby health facilities, the employees statement reveals the frustration and confusion felt by both staff and clients during this difficult time.\n\nFor now, the future of the Masvingo office remains unclear, and many are left hoping for a swift resolution to ensure that those in need of critical health services do not fall through the cracks.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a concerning turn of events, the New Start Centre has temporarily closed its office in Masvingo, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/07/masvingo-community-in-crisis-as-new-start-centre-closes/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Community In Crisis As New Start Centre Closes\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Malawi Withdraws Troops From Volatile Congo",
            "url": "https://www.zimeye.net/2025/02/07/malawi-withdraws-troops-from-volatile-congo/",
            "content": "By A Correspondent\n\nMalawis President Lazarus Chakwera has directed the Malawi Defence Force (MDF) to begin preparations for the withdrawal of its troops from the eastern Democratic Republic of Congo (DRC) following the recent deaths of three soldiers in combat.\n\nThe Malawian troops are part of the Southern African Development Community (SADC) Mission in the DRC (SAMIDRC), a regional initiative established to assist the country in combating armed insurgents. The mission was extended by SADC towards the end of 2024.\n\nIn a statement released on Wednesday, February 5, the Government of Malawi confirmed the plans to withdraw its troops from the DRC. The statement read:\n\nPresident Chakwera has ordered the MDF (Malawi Defense Force) commander to begin preparations for the withdrawal of Malawian troops to honour the declaration of a ceasefire by the warring parties there and to pave the way for their planned negotiations towards a lasting peace.\n\nMalawis Information Minister, Moses Kunkuyu, told the BBC Newsday programme that the planned withdrawal was made in good faith. He added that a meeting of southern African leaders held last week in Tanzania, alongside the Africa Energy Summit, resulted in a resolution calling for a ceasefire from all parties involved in the conflict. This decision was made to create space for peaceful negotiations. Kunkuyu explained:\n\nIt is pursuant to that agreement that the president of Malawi has seen it fit to contribute to the peace-building effort by withdrawing troops from the region so that there is that peaceful negotiation.\n\nThough the withdrawal date has not been specified, Kunkuyu indicated that only the operational aspects remained to be finalized.\n\nHe also mentioned that the decision had been communicated to both the president of the DRC and the Southern African bloc.\n\nThe Malawian president has been under pressure to pull out the countrys forces following the deaths of peacekeepers. Similarly, South Africa has faced calls for troop withdrawal, but President Cyril Ramaphosa has pledged to keep South African troops in the DRC, as they are part of the SAMIDRC mission, which has set operational timelines and an end date.\n\nMalawi, Tanzania, and South Africa have all lost soldiers in the ongoing conflict in the DRC, particularly during clashes with the M23 rebel group in the eastern region.\n\nIn related developments, a rebel alliance, including M23 fighters, declared a ceasefire on Tuesday for humanitarian reasons.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Malawi’s President Lazarus Chakwera has directed the Malawi Defence Force (MDF) to begin preparations for the withdrawal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/07/malawi-withdraws-troops-from-volatile-congo/\">Continue reading<span class=\"screen-reader-text\"> \"Malawi Withdraws Troops From Volatile Congo\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Zim Rising Star Joins Fulham",
            "url": "https://www.zimeye.net/2025/02/07/zim-rising-star-joins-fulham/",
            "content": "By A Correspondent\n\nFulham Football Club has completed the signing of 17-year-old midfielder Seth Chingwaro from Manchester City Academy. The transfer fee is reportedly around 750,000.\n\nChingwaro, who was born in the UK to Zimbabwean parents, spent six years at Manchester City, progressing through the youth ranks. He made four appearances in the Under-18s Premier League North this season.\n\nFulham expressed their delight at signing Chingwaro, describing him as a versatile midfielder capable of playing in multiple roles.\n\nIm really looking forward to the opportunities here and pushing on to hopefully make the First Team in the future, Chingwaro said. Im a creative player. I like to play in pockets, get on the ball and dribble with it.\n\nChingwaro is represented by Jay-Zs Roc Nation Sports agency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Fulham Football Club has completed the signing of 17-year-old midfielder Seth Chingwaro from Manchester City Academy. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/07/zim-rising-star-joins-fulham/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Rising Star Joins Fulham\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Zanu PF Claims Party Leadership Is Intact",
            "url": "https://www.zimeye.net/2025/02/07/zanu-pf-claims-party-leadership-is-intact/",
            "content": "By A Correspondent\n\nThe ZANU PF Mashonaland West Provincial Coordinating Committee met in Chinhoyi on Wednesday, where it was announced that war veteran Blessed Geza had been expelled from the party. The decision was made following accusations of indiscipline and going against the partys constitution.\n\nZANU PF Politburo member Ziyambi Ziyambi addressed the media following the meeting, claiming that the leadership within the party remains solid and united. He further emphasized the commitment of the presidium, which includes President Emmerson Mnangagwa, Vice Presidents Kembo Mohadi and General (Retired) Constantino Chiwenga. Ziyambi rejected claims of internal conflict, asserting that the trio has never been involved in any form of discord.\n\nThe leadership is solid, Ziyambi said. President Mnangagwa and his two Vice Presidents are united beyond measure. There has never been a day when they engaged in any form of conflict or tension.\n\nZiyambi also took aim at those he described as rogue elements, such as Geza, who, according to him, sought to represent their personal opinions as the official stance of the party leadership. He warned that any member who violates the partys constitution would face disciplinary action.\n\nSome people are trying to push their personal agendas under the guise of the leadership, but we will act against anyone who deliberately breaks our constitution, he said.\n\nZANU PF Mashonaland West Provincial Chairperson Mary Mliswa Chikoka reiterated the decision to expel Geza, emphasizing that the action was in line with the partys stance on discipline and loyalty. Mliswa Chikoka explained that the party had no choice but to expel Geza after his actions contradicted the values and expectations outlined in the partys constitution.\n\nOur constitution is very clear on issues of indiscipline and loyalty, she said. Geza violated this, and the meeting has resolved to expel him. We are also calling for the stripping of his Central Committee position, as his actions go against what the party expects from its leaders.\n\nZANU PFs Deputy Political Commissar Webster Shamu also spoke on the importance of adhering to the partys constitution, noting that the decision to expel Geza was not taken lightly.\n\nWe are a party of principle and ideology, and we must follow our constitution. It is never the partys intention to expel members, but gross violations cannot be ignored, Shamu explained.\n\nThe expulsion of Geza comes after he publicly criticized President Mnangagwa and condemned the resolutions passed at the ZANU PF Annual National Peoples Conference in Bulawayo last year. The partys leadership has worked to present a united front, with a clear message to members that any attempts to undermine the partys structure or principles will not be tolerated.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ZANU PF Mashonaland West Provincial Coordinating Committee met in Chinhoyi on Wednesday, where it was announced … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/07/zanu-pf-claims-party-leadership-is-intact/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Claims Party Leadership Is Intact\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Has Wicknell Splashed $150,000 Packages To Make MPs Destroy Geza’s Program?",
            "url": "https://www.zimeye.net/2025/02/06/has-wicknell-splashed-150000-packages-to-make-mps-destroy-gezas-program/",
            "content": "Zimbabwean MPs Allegedly Offered $150,000 Packages Amid Political Maneuvering\n\nHarare, Zimbabwe  February 6, 2025 | ZimEye | A leaked message circulating on social media has sparked widespread debate over alleged financial incentives offered to Zimbabwean Members of Parliament (MPs). The message claims that MPs have been given $150,000, new vehicles, free import duty for cars, serviced residential stands, and increased salaries as part of a broader political strategy leading up to 2030.\n\nThe message further suggests that these perks were designed to secure loyalty, particularly among opposition MPs, hinting at a move to consolidate political power ahead of the next major elections.\n\nAdditionally, the message references prominent businessman Wicknell Chivayo, alleging that he is involved in distributing financial incentives to politicians. The phrase politicians wanofa ne cash (politicians are drowning in money) underscores the perception of a cash-fueled political landscape.\n\nWhile these claims remain unverified, they have sparked public outcry, with concerns about corruption, governance ethics, and political co-optation. As Zimbabwe continues to grapple with economic challenges, revelations of such large sums of money being channeled towards MPs could fuel further debate on government priorities.\n\nAwaiting Official Response\n\nThere has been no official government response to these allegations yet. However, if confirmed, this development could have far-reaching implications for Zimbabwes political dynamics leading up to 2030.\n\nStay tuned as we continue to follow this developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Zimbabwean MPs Allegedly Offered $150,000 Packages Amid Political Maneuvering Harare, Zimbabwe – February 6, 2025 | ZimEye | A leaked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/has-wicknell-splashed-150000-packages-to-make-mps-destroy-gezas-program/\">Continue reading<span class=\"screen-reader-text\"> \"Has Wicknell Splashed $150,000 Packages To Make MPs Destroy Geza’s Program?\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Another Airforce Plane Crashes",
            "url": "https://www.zimeye.net/2025/02/06/another-airforce-plane-crashes/",
            "content": "By Munacho Gwamanda- The Zimbabwe Defence Forces (ZDF) has confirmed the tragic death of Air Lieutenant Nesbert Tambudza, a promising young pilot from the Air Force of Zimbabwe, after the Karakorum-8 (K-8) jet trainer aircraft he was piloting crashed near Guinea Fowl, just outside Gweru, on Thursday.\n\nThe fatal accident occurred during a solo training exercise focused on consolidation general handling navigation.\n\nThe crash took place about five kilometers east of Guinea Fowl, where the aircraft was extensively damaged upon impact.\n\nFortunately, there were no civilian casualties or damage to property reported at the crash site.\n\nThe loss of Air Lieutenant Tambudza has left the military community and the nation in mourning.\n\nGeneral Philip Valerio Sibanda, Commander of the Zimbabwe Defence Forces, expressed his condolences: The news of the death of Air Lieutenant Tambudza has been received with heavy hearts. On behalf of the officers, men, and women of the Zimbabwe Defence Forces, I extend heartfelt condolences to his family, friends, and colleagues. This is a devastating loss not only to his loved ones but to the entire Air Force and nation, said the General.\n\nAt the time of his passing, Tambudza was in the final stages of his jet flying conversion training at Number 2 Squadron, Josiah Tungamirai Air Force Base in Gweru.\n\nHe was learning to operate the K-8, a Chinese-made jet known for its maneuverability and role in training Air Force pilots in advanced combat skills.\n\nTambudza was seen as an exceptionally talented and dedicated officer, with great potential for the future.\n\nHe was a young and talented pilot with immense potential, said General Sibanda. His dedication, skill, and promise made him a standout officer in the Air Force of Zimbabwe. We mourn his passing and honor his contribution to our forces.\n\nIn response to the incident, the Air Force of Zimbabwe has convened a Board of Inquiry to investigate the cause of the crash.\n\nThe death of Air Lieutenant Tambudza is the latest in a series of incidents involving Zimbabwes Air Force planes, a history marked by crashes that have raised serious concerns about the safety of the countrys military aviation.\n\nOne of the most notable and concerning patterns in Zimbabwes Air Force aviation history involves several crashes of aircraft used by high-ranking government officials, including President Emmerson Mnangagwa.\n\nThese incidents have further amplified worries about the safety protocols and the aging fleet of aircraft operated by the Air Force.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- The Zimbabwe Defence Forces (ZDF) has confirmed the tragic death of Air Lieutenant Nesbert Tambudza, a promising … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/another-airforce-plane-crashes/\">Continue reading<span class=\"screen-reader-text\"> \"Another Airforce Plane Crashes\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Airforce Pilot Killed In Plane Crash",
            "url": "https://www.zimeye.net/2025/02/06/airforce-pilot-killed-in-plane-crash/",
            "content": "By Munacho Gwamanda- An Air Force of Zimbabwe pilot, Air Lieutenant Nesbert Tambudza has died in a plane crash.\n\nThe Zimbabwe Defence Forces (ZDF) said Air Lieutenant Tambudza died this afternoon after the Karakorum-8 (K-8) jet trainer aircraft that he was flying crashed in the Guinea Fowl area in Gweru.\n\nIn a statement, ZDF said the accident happened when the pilot was on a solo consolidation general handling navigation training.\n\nMore to Follow..\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- An Air Force of Zimbabwe pilot, Air Lieutenant Nesbert Tambudza has died in a plane crash. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/06/airforce-pilot-killed-in-plane-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Airforce Pilot Killed In Plane Crash\"</span></a></p>",
            "time": "06:36",
            "date": "08 Feb 2025"
        }
    ]
}