{
    "news": [
        {
            "title": "Disappointing DeMbare Drop Points Again",
            "url": "https://www.zimeye.net/2025/03/16/disappointing-dembare-drop-points-again/",
            "content": "Sports Correspondent\n\nDynamos Football Clubs struggle to secure a win in the Castle Lager Premier Soccer League continued as they were held to a 1-1 draw against TelOne in their latest encounter.\n\nThis result marked the third consecutive draw for DeMbare, leaving their fans frustrated and questioning the teams ability to capitalize on key moments.\n\nIn what was another challenging outing for the Harare giants, Dynamos seemed to lack the cutting edge required to break down a resolute TelOne side.\n\nDespite dominating possession for large periods, DeMbare was unable to find a winner after they were pegged back by a well-executed equalizer from TelOne.\n\nThe match also highlighted DeMbares inability to convert chances into vital points, a trend that has characterized their start to the season. With each draw, the pressure mounts on the team to find their rhythm and push for higher positions in the standings.\n\nMeanwhile, rookie side MWOS continues to impress, cementing their place at the top of the league table with a 2-0 victory over Yadah. Their impressive form in the early stages of the season has seen them rise to the summit, overtaking more established teams and proving their credentials as serious contenders in the Castle Lager Premier Soccer League.\n\nOther results from the weekends fixtures saw GreenFuel and Highlanders share the spoils in a thrilling 2-2 draw, while Chicken Inn were held to a 1-1 draw by FC Platinum. Simba Bhora emerged victorious with a 1-0 win over Herentals College, while Kwekwe United secured a narrow 1-0 victory over Bikita Minerals.\n\nAs the season progresses, Dynamos will need to reflect on their form and find a way to convert draws into wins if they are to challenge for the top honors. The search for consistency remains crucial for the Harare club, as they seek to shake off this disappointing run of results.\n\nThe league table, for now, sees MWOS at the top, while DeMbare will have to regroup and work harder to climb up from their mid-table position.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos Football Club’s struggle to secure a win in the Castle Lager Premier Soccer League continued as they … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/disappointing-dembare-drop-points-again/\">Continue reading<span class=\"screen-reader-text\"> \"Disappointing DeMbare Drop Points Again\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Importance Of Patience On The Road",
            "url": "https://www.zimeye.net/2025/03/16/importance-of-patience-on-the-road/",
            "content": "In our fast-paced world, impatience often seeps into our daily lives, including how we behave behind the wheel.\n\nBut the road is not a place for rash decisions or hasty actionsits a place where patience can literally save your life.\n\nIf you refuse to exercise patience while riding or driving, you might find yourself in a far worse situation: as a patient in a hospital bed, a casualty in a morgue, or another statistic in a graveyard.\n\nThe roads are filled with vital signs and markings that serve a critical purpose. Road signs, signals, and lane markings arent just there for decorationthey are messages designed to guide and protect you. When you choose to ignore them, whether by speeding, overtaking dangerously, or neglecting to follow traffic rules, you put yourself and others at risk.\n\nPatience on the road means taking the time to properly assess your surroundings, respecting speed limits, yielding when necessary, and abiding by the rules set forth to ensure everyones safety. These guidelines are not meant to slow you down or ruin your day; they are meant to preserve your life. A single moment of impatience could lead to an irreversible consequence.\n\nFor example, ignoring a red light or failing to yield could lead to a tragic collision, leaving not only you but also others involved suffering the consequences. If youre driving too fast for road conditions or overtaking on blind corners, you might be tempting fate. That sudden moment of impatience can result in an accident that could change your life foreveror end it prematurely.\n\nThe road messages are clear. The speed limits are there to keep you safe. The warning signs are there to prepare you for potential hazards ahead. The lane markings are there to help you stay in your lane and avoid dangerous intersections. Respecting these messages is an act of self-preservation. Ignoring them could place you in a hospital bed, or worse, a morgue.\n\nSo, the next time you find yourself behind the wheel, take a deep breath and remind yourself of the consequences of impatience. Your life is worth more than reaching your destination a few minutes earlier. Be patient. Respect the road, its messages, and the safety of those around you. It could mean the difference between life and death.\n\nDrive safe. Be patient. Save lives.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "In our fast-paced world, impatience often seeps into our daily lives, including how we behave behind the wheel. But the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/importance-of-patience-on-the-road/\">Continue reading<span class=\"screen-reader-text\"> \"Importance Of Patience On The Road\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "WiFi Poacher Kills Chiredzi Farm Worker",
            "url": "https://www.zimeye.net/2025/03/16/wifi-poacher-kills-chiredzi-farm-worker/",
            "content": "By A Correspondent\n\nA fatal confrontation occurred on a Chiredzi farm when a 19-year-old farm worker, Ask Ndhlovu, was struck on the forehead with a stone by a man accused of poaching the farms Wi-Fi.\n\nThe assailant, 22-year-old Moment Mavasa, has been arrested and charged with Ndhlovus murder.\n\nAccording to Inspector Kudakwashe Dhewa, Zimbabwe Republic Police spokesperson for Masvingo Province, the incident took place at Farm 3 in Hippo Valley.\n\nOn the day of the attack, Ndhlovu and his colleague, Peter Mutapati, encountered Mavasa and his accomplice, Tafadzwa Mafuta, who were attempting to access the farms Wi-Fi without permission.\n\nWhen asked to leave, the situation escalated, resulting in the tragic death of Ndhlovu.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A fatal confrontation occurred on a Chiredzi farm when a 19-year-old farm worker, Ask Ndhlovu, was struck … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/wifi-poacher-kills-chiredzi-farm-worker/\">Continue reading<span class=\"screen-reader-text\"> \"WiFi Poacher Kills Chiredzi Farm Worker\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Richard Tsvangirai Blasts Mnangagwa Regime For Reducing Elected Councillors to Mere Spectators",
            "url": "https://www.zimeye.net/2025/03/16/richard-tsvangirai-blasts-mnangagwa-regime-for-reducing-elected-councillors-to-mere-spectators/",
            "content": "By A Correspondent\n\nIn a scathing statement released on Saturday, Norton Member of Parliament, Honourable Richard Tsvangirai, condemned the actions of the Mnangagwa regime for what he describes as a systematic erosion of the role of elected councillors in Zimbabwe.\n\nTsvangirai criticized the government for undermining the authority of local representatives, saying, The role of Councillors as policymakers has been systematically stripped away. Decisions are now made by the Minister, while elected Councillors are reduced to rubber-stamping instead of representing the people.\n\nHe went on to express his dismay over the current state of local governance, emphasizing that those chosen by the residents to lead are now spectators, while those with no understanding of local realities dictate policies.\n\nAccording to Tsvangirai, this shift in power is not only frustrating for elected officials but also a betrayal of the democratic principles Zimbabwe should stand for.\n\nThose with no understanding of local realities dictate policies, Tsvangirai added, further highlighting the disconnect between those in power and the communities they govern.\n\nHis remarks raised questions about the transparency and accountability of current governance structures at the local level, suggesting that councillors may be struggling to remain active participants in decisions that directly affect their constituencies.\n\nTsvangirais comments come at a time when questions about corruption within local government have been raised.\n\nCritics have long argued that some councillors are not doing enough to address local issues, possibly due to the growing influence of central government decisions. These concerns about corruption and accountability in local politics remain a hot-button issue for many Zimbabweans.\n\nThis is not democracy! Tsvangirai declared emphatically. His call for a return to genuine local governance, where elected councillors have the power to make decisions on behalf of their communities, echoes the frustrations of many citizens who feel their voices are being sidelined in the current political climate.\n\nThe statement by Tsvangirai is likely to spark further debate on the role of elected officials in Zimbabwes local government structures and whether they are genuinely serving the interests of their communities or simply becoming instruments of a centralized, authoritarian regime.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a scathing statement released on Saturday, Norton Member of Parliament, Honourable Richard Tsvangirai, condemned the actions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/richard-tsvangirai-blasts-mnangagwa-regime-for-reducing-elected-councillors-to-mere-spectators/\">Continue reading<span class=\"screen-reader-text\"> \"Richard Tsvangirai Blasts Mnangagwa Regime For Reducing Elected Councillors to Mere Spectators\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Chiwenga Is Dull, Incompetent: Mutsvangwa In Leaked Audio",
            "url": "https://www.zimeye.net/2025/03/16/chiwenga-is-dull-incompetent-mutsvangwa-in-leaked-audio/",
            "content": "By A Correspondent\n\nA secret recording has recently surfaced, revealing ZANU PF spokesperson Christopher Mutsvangwa making harsh criticisms of Vice President Constantino Chiwenga.\n\nThe leaked audio, which has since sparked controversy, features Mutsvangwa attacking Chiwengas capabilities and leadership qualities.\n\nIn the recording, Mutsvangwa is heard describing Chiwenga as harsh, unelectable, and lacking formal education.\n\nHe further mocked Chiwengas pronunciation, a moment that appears to highlight his disdain for the Vice Presidents communication skills.\n\nHe is dull and incompetent, Mutsvangwa says in the recording, which has caused a stir within the ruling party.\n\nHes unelectable. You cant expect someone who cannot even pronounce words correctly to lead.\n\nMutsvangwas comments suggest deep dissatisfaction within the partys ranks regarding Chiwengas leadership style and public persona. His remarks raise questions about the internal dynamics within ZANU PF, and whether divisions within the party are becoming increasingly apparent.\n\nWhile Chiwenga has been a prominent figure in Zimbabwean politics, Mutsvangwas criticism presents an unexpected challenge, especially as it comes from within the partys own circle. As the audio continues to make waves, it remains to be seen how these comments will affect the political landscape and ZANU PFs internal unity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A secret recording has recently surfaced, revealing ZANU PF spokesperson Christopher Mutsvangwa making harsh criticisms of Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/chiwenga-is-dull-incompetent-mutsvangwa-in-leaked-audio/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Is Dull, Incompetent: Mutsvangwa In Leaked Audio\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Zanu PF Infighting Escalates As Mutsvangwa Labels Chiwenga Cruel, Heartless",
            "url": "https://www.zimeye.net/2025/03/16/zanu-pf-infighting-escalates-as-mutsvangwa-labels-chiwenga-cruel-heartless/",
            "content": "By A Correspondent\n\nA secret recording has recently surfaced, revealing ZANU PF spokesperson Christopher Mutsvangwa making harsh criticisms of Vice President Constantino Chiwenga.\n\nThe leaked audio, which has since sparked controversy, features Mutsvangwa attacking Chiwengas capabilities and leadership qualities.\n\nIn the recording, Mutsvangwa is heard describing Chiwenga as harsh, unelectable, and lacking formal education.\n\nHe further mocked Chiwengas pronunciation, a moment that appears to highlight his disdain for the Vice Presidents communication skills.\n\nHe is dull and incompetent, Mutsvangwa says in the recording, which has caused a stir within the ruling party.\n\nHes unelectable. You cant expect someone who cannot even pronounce words correctly to lead.\n\nMutsvangwas comments suggest deep dissatisfaction within the partys ranks regarding Chiwengas leadership style and public persona. His remarks raise questions about the internal dynamics within ZANU PF, and whether divisions within the party are becoming increasingly apparent.\n\nWhile Chiwenga has been a prominent figure in Zimbabwean politics, Mutsvangwas criticism presents an unexpected challenge, especially as it comes from within the partys own circle. As the audio continues to make waves, it remains to be seen how these comments will affect the political landscape and ZANU PFs internal unity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A secret recording has recently surfaced, revealing ZANU PF spokesperson Christopher Mutsvangwa making harsh criticisms of Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/zanu-pf-infighting-escalates-as-mutsvangwa-labels-chiwenga-cruel-heartless/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Infighting Escalates As Mutsvangwa Labels Chiwenga Cruel, Heartless\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Richard Hachiro Gets Surprise Call-Up to Replace Injured Nakamba",
            "url": "https://www.zimeye.net/2025/03/16/richard-hachiro-gets-surprise-call-up-to-replace-injured-nakamba/",
            "content": "By A Correspondent\n\nIn a surprise move, Richard Hachiro of Ngezi Platinum Stars has been drafted into the Warriors squad to replace injured captain Marvelous Nakamba.\n\nNakamba, who has been a stalwart for the team, suffered a recurrence of a nagging calf injury over the weekend, forcing him to withdraw from the squad.\n\nHachiro, who has been in impressive form for Ngezi Platinum Stars, has been handed a chance to don the national team jersey and prove himself on the big stage. The call-up is a testament to his hard work and dedication, and he will be eager to seize the opportunity and make a name for himself.\n\nNakambas injury is a blow to the team, but Hachiros inclusion is a welcome boost. The Warriors will be looking to Hachiro to bring his energy and skills to the table as they prepare for their upcoming matches.\n\nWith Hachiro on board, the Warriors will be hoping to maintain their momentum and continue their push for success. The teams technical staff will be working closely with Hachiro to ensure a seamless transition and to get him up to speed with the teams strategies and tactics.\n\nAs the Warriors embark on this new chapter, fans will be eagerly watching to see how Hachiro performs and whether he can help the team achieve their goals. One thing is certain, however  Hachiros call-up is a thrilling development for Zimbabwean football, and his inclusion in the squad is a testament to the depth of talent in the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a surprise move, Richard Hachiro of Ngezi Platinum Stars has been drafted into the Warriors squad … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/richard-hachiro-gets-surprise-call-up-to-replace-injured-nakamba/\">Continue reading<span class=\"screen-reader-text\"> \"Richard Hachiro Gets Surprise Call-Up to Replace Injured Nakamba\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Chiwenga Can’t Lead Because He Can’t Pronounce Words Properly: Mutsvangwa",
            "url": "https://www.zimeye.net/2025/03/16/chiwenga-cant-lead-because-he-cant-pronounce-words-properly-mutsvangwa/",
            "content": "By A Correspondent\n\nA secret recording has recently emerged, capturing ZANU PF spokesperson Christopher Mutsvangwa launching sharp criticisms at Vice President Constantino Chiwenga. The leaked audio, which has since stirred controversy, features Mutsvangwa questioning Chiwengas leadership abilities and overall qualifications.\n\nIn the recording, Mutsvangwa refers to Chiwenga as harsh, unelectable, and lacking formal education. He also takes aim at Chiwengas communication skills, mocking his pronunciation and accent.\n\nHe is dull and incompetent, Mutsvangwa states in the audio, adding, Hes unelectable. You cant expect someone who cannot even pronounce words correctly to lead.\n\nMutsvangwas scathing remarks indicate a growing dissatisfaction within ZANU PF regarding Chiwengas leadership approach. The criticisms shed light on the internal divisions within the party and raise concerns about Chiwengas standing among his own colleagues.\n\nDespite Chiwengas prominence in Zimbabwean politics, Mutsvangwas comments present an unexpected challenge to the Vice Presidents leadership credentials. With the recording now circulating widely, it remains uncertain how these revelations will affect the political climate within ZANU PF and its unity moving forward.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A secret recording has recently emerged, capturing ZANU PF spokesperson Christopher Mutsvangwa launching sharp criticisms at Vice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/chiwenga-cant-lead-because-he-cant-pronounce-words-properly-mutsvangwa/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Can’t Lead Because He Can’t Pronounce Words Properly: Mutsvangwa\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Mnangagwa Intensifies Crackdown on Social Media Activists",
            "url": "https://www.zimeye.net/2025/03/16/mnangagwa-intensifies-crackdown-on-social-media-activists/",
            "content": "By ParliamentaryReporterTheEmmerson Mnangagwa-led administration is escalating its crackdown on social media, targeting individuals and groups that use digital platforms to challenge government narratives and expose corruption.\n\nUnder the guise of curbing misinformation, preventing anonymous accounts, and maintaining national stability, Information, Publicity, and Broadcasting Services Minister Jenfan Muswere has announced plans to introduce new regulations to police online activity.\n\nSpeaking at aMinisters Meet the Mediaevent last week, Muswere said social media had become adouble-edged sword,allowing for engagement while also being misused by activists and critics to undermine government interests. He described unregulated digital spaces as a breeding ground forghost accountsspreading falsehoods against the state.\n\nSocial media is not properly governed, and this has led to a situation where people are chasing shadows  shadows that have no meaning; shadows run by ghost accounts operated by individuals seeking todemonisetheir own country,he said.\n\nMuswere also accused former journalists ofturning intoactivists-for-hire,using social media to push political agendas without verification. He insisted that new laws would hold social media users accountable and ensure that digital platforms are used responsibly.\n\nPart of our responsibility as a ministry is to ensure that social media is governed effectively,Muswere stated.We are preparing new legislation to regulate these platforms and hold users accountable.\n\nSince coming to power in 2017 following a military coup against Robert Mugabe, Mnangagwa has portrayed himself as a reformist. However, his administration hasbeen markedby increasing authoritarianism, crackdowns on opposition voices, and suppression of independent media.\n\nHis government has frequently targeted activists, journalists, and opposition politicians under the pretext of maintaining national security. Laws such as the Cyber and Data Protection Act (2021) have alreadybeen usedto silence critics, with individuals arrested and charged for social media posts deemed critical of the state.\n\nZimbabwean authorities have a history ofcriminalizingdissent, employing repressive tactics such as abductions, arbitrary arrests, and the use of the judiciary to intimidate opposition figures. The ruling ZANU-PF party has consistently framed independent journalism and digital activism as tools ofregime change,a label used to justify harassment and surveillance of government critics.\n\nMuswereemphasizedthat Zimbabwe already has a governance structure that guarantees access to what the state deemsaccurate information.He urged journalists to rely on official government sources, reinforcing theadministrationsefforts to control narratives and restrict alternative viewpoints.\n\nThe media has a critical role in nation-building, in terms of identifying any issues, negative or positive, that impact on our Vision 2030,he said.We urge journalists to be ethical, verify facts, and seek information from official government platforms.\n\nCritics argue that these remarks are part of a broader effort to erode press freedom and consolidate state control over information dissemination. Zimbabwe ranks poorly on global press freedom indices, with government-aligned media dominating the landscape while independent journalists face threats and persecution.\n\nThe move to regulate social media aligns Zimbabwe with global trends, as many countries have introduced laws to govern digital spaces and prevent cybercrime. However, in Zimbabwe, these measures are widely seen as a tool for political control rather than genuine cybersecurity efforts.\n\nSouthAfricasCybercrimes Act regulates social media use to prevent cyber-related offences, while the UnitedKingdomsComputer Misuse Act (1990) addresses digital threats.The United States has multiple laws, including the Digital Millennium Copyright Act and Communications Decency Act, to govern online spaces.\n\nDespite these comparisons,Zimbabwesapproachis viewedas more repressive, given its history of stifling opposition voices. Thecountrys2021 Data Protection Act was initially framed as a cybersecurity measure but has been used to justify the surveillance and targeting of critics. With the latest push for stricter social media regulations,Mnangagwasadministrationcontinues to tightenits grip on digital spaces, reinforcing an already shrinking civic space.\n\nThe proposed law signals yet another step toward deepening digital authoritarianism in Zimbabwe, where the government sees social media as a battleground for political control rather than an avenue for free expression and engagement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Parliamentary Reporter–The Emmerson Mnangagwa-led administration is escalating its crackdown on social media, targeting individuals and groups that use digital platforms to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/mnangagwa-intensifies-crackdown-on-social-media-activists/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Intensifies Crackdown on Social Media Activists\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        },
        {
            "title": "Chiwenga Under Siege",
            "url": "https://www.zimeye.net/2025/03/16/chiwenga-under-siege-4/",
            "content": "By Munacho Gwamanda-Zanu PF is moving to delete Vice President Constantino Chiwengas political career as it formally tables a proposal in Parliament to extend President Emmerson Mnangagwas rule beyond his constitutional mandate.\n\nSpeaking at an inter-district meeting in Mazowe, Mashonaland Central Province, Zanu PFs Chitepo School of Ideology principal, Munyaradzi Machacha, confirmed that the partys resolution to keep Mnangagwa in power was being actively implemented through government channels.\n\nHe dismissed claims that the proposal sought to grant Mnangagwa a third term, clarifying that it aimed to extend his current leadership until 2030 to ensure stability and continuity.To facilitate the implementation of Resolution Number 1, a committee has been established, comprising provincial chairpersons from all 10 provinces, provincial political commissars, and representatives from all party wings, Machacha explained. This committee will work closely with the legal department to craft strategies, while Parliament explores ways to bring this resolution to life.\n\nAs tensions escalate between Mnangagwa and his deputy, Constantino Chiwenga, Zanu PF National Chairperson Oppah Muchinguri has stepped in to mediate the growing factional rift.\n\nThe two leaders are embroiled in a fierce battle for control of the party beyond 2028.\n\nInitially, Mnangagwa and Chiwenga had a verbal agreement that the vice president would succeed Mnangagwa after his second term.\n\nHowever, Mnangagwa has since backtracked, instead maneuvering to extend his grip on power, a move that has triggered internal divisions.\n\nMnangagwas loyalists have been pushing for constitutional amendments to enable him to remain in office, portraying him as an indispensable leader whose rule should continue.\n\nThis has led to heightened discord within the ruling party.\n\nAt a special State of the Party indaba held at the Zanu PF headquarters in Harare on Thursday, Muchinguri acknowledged the damaging impact of the leadership wrangles on party cohesion.It is shameful for any leader to engage in primitive and barbaric political bickering that divides the party, she said. Such behavior only benefits opposition forces.\n\nShe commended the partys Information and Publicity Department for implementing a robust social media policy to curb factionalism and urged members to focus on promoting the partys achievements rather than engaging in internal disputes.\n\nMuchinguri reaffirmed that Mnangagwa, as Zanu PFs First Secretary, remains the face of the party. She warned that any member found denigrating him would face disciplinary action.Our President and the entire Presidium must be protected by shunning factionalism, which is a creation of self-serving individuals. This behavior poses a national security risk, she stated.\n\nThe indaba was attended by Politburo members, Central Committee members, Ministers of State for Provincial Affairs and Devolution, provincial chairpersons, and other senior party officials.\n\nMuchinguri emphasized the importance of discipline, warning against unresolved primary election disputes and the misuse of disciplinary processes for personal gain.Some members are using government resources to campaign in constituencies where there are duly elected MPs. This behavior will not be tolerated, she said, adding that a circular would be issued to address these issues.\n\nShe also stressed the need to empower women and war veterans through economic initiatives, citing Mnangagwas Presidential Solar, Borehole, and Loan Schemes as key development efforts.\n\nMuchinguris intervention highlights the severity of the ongoing power struggle between Mnangagwa and Chiwenga.\n\nThe rift, which has been simmering since the 2017 coup that brought Mnangagwa to power, has now reached a critical juncture.\n\nChiwenga, who played a pivotal role in the military takeover that ousted Robert Mugabe, is determined to assert his claim to the presidency.\n\nMeanwhile, Mnangagwas manoeuvres to retain power have intensified, threatening to destabilize Zanu PF ahead of the 2028 elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Zanu PF is moving to delete Vice President Constantino Chiwenga’s political career as it formally tables a proposal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/16/chiwenga-under-siege-4/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Under Siege\"</span></a></p>",
            "time": "21:06",
            "date": "16 Mar 2025"
        }
    ]
}