{
    "news": [
        {
            "title": "Warriors Arrive in Saudi Arabia Ahead of Algeria Clash",
            "url": "https://www.zimeye.net/2025/11/10/warriors-arrive-in-saudi-arabia-ahead-of-algeria-clash/",
            "content": "Sports Correspondent  The Zimbabwe senior mens national football team, popularly known as The Warriors, has arrived in the Kingdom of Saudi Arabia ahead of their international friendly match against Algeria.\n\nHead Coach Marian Mario Marinica is leading a squad that blends local-based talents with a strong South African contingent. Midfielder Jonah Fabisch has already joined camp, while the remaining European-based players are expected to arrive later today. Their arrival will allow the technical team to work with a full complement of players during the first training session.\n\nCoach Mario said the team intends to use the friendly as a valuable opportunity to assess progress and strengthen team chemistry. This match is an important test as we continue to shape our identity and prepare for AFCON 2025, he said.\n\nThe Warriors are scheduled to hold their first training session today at 1600hrs (KSA time), as preparations for the upcoming fixtures intensify.\n\nThe team will play Algeria on November 13, 2025, before facing Qatar on November 17, 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent – The Zimbabwe senior men’s national football team, popularly known as The Warriors, has arrived in the Kingdom … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/warriors-arrive-in-saudi-arabia-ahead-of-algeria-clash/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Arrive in Saudi Arabia Ahead of Algeria Clash\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Lightning Kills Chakari Juvenile",
            "url": "https://www.zimeye.net/2025/11/10/lightning-kills-chakari-juvenile/",
            "content": "Tinashe Sambiri  A tragic accident in Chakari, Mashonaland West, has left one juvenile dead and another injured after being struck by lightning while playing in the rain.\n\nZimbabwe Republic Police spokesperson, Inspector Ian Kohwera, confirmed the incident to state media, stating that it occurred at the Grantley Mine compound in the gold mining settlement.\n\nTwo juveniles aged 11 and 9 from the same family were struck by lightning while playing outside in the rain, he said.\n\nThe younger victim, aged nine, later regained consciousness and managed to seek help from their parents. A formal police report was filed at ZRP Chakari, and the body of the deceased juvenile was taken to Kadoma General Hospital mortuary.\n\nInsp. Kohwera used the incident to remind the public of the dangers posed by lightning during the rainy season.\n\nThe public is advised to take precautionary measures during this rainfall season to avoid loss of life due to lightning or drowning, he said.\n\nAuthorities continue to urge communities, especially in mining and rural areas, to be vigilant and avoid open spaces during thunderstorms to prevent further tragedies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – A tragic accident in Chakari, Mashonaland West, has left one juvenile dead and another injured after being … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/lightning-kills-chakari-juvenile/\">Continue reading<span class=\"screen-reader-text\"> \"Lightning Kills Chakari Juvenile\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Watch: Chinese Nationals Publicly Chant Pamberi neZanu PF Slogan",
            "url": "https://www.zimeye.net/2025/11/10/watch-chinese-nationals-publicly-chant-pamberi-nezanu-pf-slogan/",
            "content": "Tinashe Sambiri  Zanu PF online activist Cleopas Mukungunugwa over the weekend posted on X highlighting the ruling partys support from some Chinese nationals, despite ongoing concerns over environmental degradation and alleged abuse of workers rights by Chinese-operated mines in Zimbabwe.\n\nMukungunugwa wrote on X:\n\nThe Chinese community in Zimbabwe is here to stay, endorsing President E.D. Mnangagwa to remain in office until 2030. Hanzi 2030 VaMnangagwa Vanenge Vachitonga!!\n\nIwe wosvora?\n\nThe post has sparked debate online, with critics pointing to the irony of celebrating political loyalty amid reports of environmental harm and labor rights violations associated with Chinese mining operations. Supporters, however, claim it demonstrates the countrys international backing for President Mnangagwa and the ruling party.\n\nThe video, which shows a Chinese national publicly chanting the Pamberi neZanu PF slogan, has been shared widely on social media, further fueling discussions about foreign influence and political endorsements in Zimbabwe.\n\nThe Chinese community in Zimbabwe is here to stay, endorsing President E.D. Mnangagwa to remain in office until 2030. hanzi 2030 VaMnangagwa Vanenge Vachitonga!!Iwe wosvora?pic.twitter.com/2PWHAYP036\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Zanu PF online activist Cleopas Mukungunugwa over the weekend posted on X highlighting the ruling party’s support … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/watch-chinese-nationals-publicly-chant-pamberi-nezanu-pf-slogan/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Chinese Nationals Publicly Chant Pamberi neZanu PF Slogan\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Losing Zanu PF Candidates Bribe Villagers With Mealie Meal",
            "url": "https://www.zimeye.net/2025/11/10/losing-zanu-pf-candidates-bribe-villagers-with-mealie-meal/",
            "content": "By A Correspondent  Zanu PF Shadow MPs at the weekend handed over food hampers  including bags of mealie meal  to a fellow Shadow MP for distribution in Ward 4, Gwanda North.\n\nThe move, insiders say, is meant to demonstrate loyalty to President Emmerson Dambudzo Mnangagwas directive that unsuccessful 2023 candidates must continue engaging communities.\n\nAccording to a Zanu PF source, the gesture was framed as supporting service delivery, but raised concerns about the intention behind the donations.\n\nThe party wants the Shadow MPs to stay visible in their constituencies, the source said. But some people are saying these food hampers are being used to buy loyalty.\n\nThe source added that the donations were not random but targeted.\n\nThey gave mealie meal and other groceries to be distributed in Ward 4, the insider claimed. This is meant to ensure the structures remain strong despite the losses in 2023.\n\nAnother community member questioned the timing of the handouts.\n\nWhy now? the resident asked. People need development, not mealie meal when election seasons come closer.\n\nThe development comes as critics continue to accuse Zanu PF of using food aid as a political tool, especially in rural areas. However, party members insist they are merely following President Mnangagwas directive.\n\nThe President told Shadow MPs to keep serving the people, the source said. This is what they are doing.\n\nWhile the political motivations remain a subject of debate, the food donations were reportedly received by local structures in Ward 4 and are set to be distributed in the coming days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF Shadow MPs at the weekend handed over food hampers — including bags of mealie … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/losing-zanu-pf-candidates-bribe-villagers-with-mealie-meal/\">Continue reading<span class=\"screen-reader-text\"> \"Losing Zanu PF Candidates Bribe Villagers With Mealie Meal\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Kuda Tagwirei Vows To Bury Opposition In Harare",
            "url": "https://www.zimeye.net/2025/11/10/kuda-tagwirei-vows-to-bury-opposition-in-harare/",
            "content": "By A Correspondent  Controversial businessman and Zanu PF figure Kuda Tagwirei has once again raised eyebrows after making bold pledges at the partys Harare Province meeting over the weekend, fueling concerns about growing authoritarian ambitions.\n\nObservers say Tagwirei, widely seen as President Emmerson Mnangagwas blue-eyed boy, is using his wealth and influence to consolidate power within the ruling party, raising fears about the marginalization of opposition voices in the capital.\n\nZanu PF online activist Cleopas Mukungunugwa lauded Tagwireis rise in a statement, describing him as a principal in the partys leadership matrix. Mukungunugwa added that one of Tagwireis non-negotiable priorities is to ensure that Harare becomes a Zanu PF stronghold.\n\nThe time for mere talk is over. Politics is done, its not just discussed, Mukungunugwa said. The deliberative whispers of the past have given way to the decisive action of the present, and in this new era, Cde Tagwirei is now solidly in the Zanu PF leadership matrix.\n\nCritics, however, warn that the rhetoric amounts to a thinly veiled threat to opposition parties and independent political activity in Harare. This is a billionaire using his wealth to manipulate politics and suppress dissent, said political analyst Tendai Moyo. Its not about delivering servicesits about creating a political monopoly in the capital.\n\nTagwirei and his supporters insist the pledges, which include promises to restore municipal services such as electricity, water, and garbage collection, are genuine efforts to improve governance. Mukungunugwa said, This means the lights will stay on. The water will flow. The piles of uncollected garbage will vanish from the streets. It means creating an environment where commerce thrives not by accident, but by design.\n\nYet residents of Harare remain sceptical. Weve heard promises before, but the city remains in chaos, said one local business owner. This is not about service delivery; its about intimidation and political control.\n\nAs Tagwirei cements his position within Zanu PFs central structures, critics fear that Harare could see increased political pressure, marginalizing opposition parties and reducing civic space. The capital is being turned into a laboratory for power consolidation, Moyo added. If unchecked, this could stifle democracy in one of Zimbabwes most important urban centers.\n\nThe unfolding developments suggest that Zanu PF, backed by influential figures like Tagwirei, is focused not only on service delivery but also on reshaping the political landscape of Harare to ensure dominance in upcoming elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Controversial businessman and Zanu PF figure Kuda Tagwirei has once again raised eyebrows after making bold … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/kuda-tagwirei-vows-to-bury-opposition-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Kuda Tagwirei Vows To Bury Opposition In Harare\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Watch: Chinese Nationals Declare 2030 Mnangagwa Will Be In Office",
            "url": "https://www.zimeye.net/2025/11/10/watch-chinese-nationals-declare-2030-mnangagwa-will-be-in-office/",
            "content": "Tinashe Sambiri  Zanu PF online activist Cleopas Mukungunugwa over the weekend posted on X highlighting the ruling partys support from some Chinese nationals, despite ongoing concerns over environmental degradation and alleged abuse of workers rights by Chinese-operated mines in Zimbabwe.\n\nMukungunugwa wrote on X:\n\nThe Chinese community in Zimbabwe is here to stay, endorsing President E.D. Mnangagwa to remain in office until 2030. Hanzi 2030 VaMnangagwa Vanenge Vachitonga!!\n\nIwe wosvora?\n\nThe post has sparked debate online, with critics pointing to the irony of celebrating political loyalty amid reports of environmental harm and labor rights violations associated with Chinese mining operations. Supporters, however, claim it demonstrates the countrys international backing for President Mnangagwa and the ruling party.\n\nThe video, which shows a Chinese national publicly chanting the Pamberi neZanu PF slogan, has been shared widely on social media, further fueling discussions about foreign influence and political endorsements in Zimbabwe.\n\nThe Chinese community in Zimbabwe is here to stay, endorsing President E.D. Mnangagwa to remain in office until 2030. hanzi 2030 VaMnangagwa Vanenge Vachitonga!!Iwe wosvora?pic.twitter.com/2PWHAYP036\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Zanu PF online activist Cleopas Mukungunugwa over the weekend posted on X highlighting the ruling party’s support … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/watch-chinese-nationals-declare-2030-mnangagwa-will-be-in-office/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Chinese Nationals Declare 2030 Mnangagwa Will Be In Office\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Suspicious Payment To Duplicate Person Remains Unaddressed a Week Later In Matabeleland National Bereavement Fund Scam Allegations",
            "url": "https://www.zimeye.net/2025/11/10/suspicious-payment-to-duplicate-person-remains-unaddressed-a-week-later-in-matabeleland-national-bereavement-fund-scam-allegations/",
            "content": "By ZimEye Investigations | London | 10 November 2025\n\nA full week after evidence surfaced showing a duplicate payment to the same individual under multiple bereavement notices, the owner of the Matabeleland National Bereavement Fund (MNBF) has remained silent  refusing to explain why funds from grieving families continue to be routed to a recurring name and bank account.\n\nThis suspicious payment pattern, first exposed by ZimEye Investigations, forms part of a growing scandal surrounding MNBF  a UK-based association accused of swindling widows and exploiting the grief of Zimbabwean diaspora families.\n\n Duplicate Payments  The Unanswered Red Flag\n\nRecords reviewed by ZimEye show that one recipient, identified only as Mary-A D, appeared in three separate bereavement notices, each directing contributions to the same Halifax Bank account (sort code 11-06-, account 010).\n\nDespite multiple public questions and follow-ups sent to MNBFs administrators  including chairperson Mqondobazi Nduna Magonya and coordinator Mr Dlodlo  no clarification or refund has been issued.\n\nA week later, the duplicate payment remains unaddressed, fuelling suspicions that MNBF may be recycling names and bank details to siphon funds from unsuspecting contributors.\n\n Fake Lecturer at the Helm\n\nThe scandal deepened when ZimEye verified that Mqondobazi Nduna Magonya, the man behind MNBF, falsely claims to be a lecturer at Anglia Ruskin University.Officials at the university confirmed there is no record of him on their staff register or at any of their partner institutions.This discovery casts further doubt on the legitimacy of MNBFs operations and its leaderships credibility.\n\n Widows Left Without Support\n\nOne of the funds members, Widow C, whose husband Titus died on 2 September 2025, remains unpaid despite meeting all requirements.I joined in good faith and contributed to other deaths, she told ZimEye.But when my husband passed, they said I was ineligible because of doctored dates.\n\nEvidence obtained by ZimEye shows she joined on 21 January 2025, yet MNBF claims her membership began on 5 January  a falsified record used to deny her payout.\n\n Evidence of Record Tampering and Mismanagement\n\nMNBF insiders have revealed shocking internal practices: Membership dates altered by administrators without member consent. Bereaved families bank details shared via WhatsApp, not verified by any institution. Contributions sent to personal bank accounts, bypassing UK charity regulations.\n\nA former MNBF treasurer described the operation as an unregulated cash game run under the guise of community support.Once the money is sent, theres no audit, no oversight  its gone, they said.\n\n Violations of UK Law\n\nUnder the UK Charities Act 2011 and Financial Conduct Authority (FCA) rules, any organisation collecting public funds for welfare or mutual aid purposes must: Maintain transparent financial records, Have registered trustees, and File for oversight if annual turnover exceeds 5,000.\n\nMNBF has failed to meet all three conditions, yet continues to circulate payment appeals across diaspora WhatsApp groups.\n\n ZimEyes Ongoing Investigation\n\nZimEye calls on UK authorities  including the Charity Commission, FCA, and Metropolitan Police Economic Crime Unit  to open a full audit into MNBFs activities, freeze implicated accounts, and interview its management.\n\nMeanwhile, the suspicious duplicate payment remains unexplained  a silent testament to the growing rot in a fund once marketed as a compassionate lifeline for Zimbabwean families in mourning.\n\n Editors Call to Action\n\nHave you paid into MNBF or been denied assistance?If you are a UK-based Zimbabwean affected by the Matabeleland National Bereavement Fund, contact the ZimEye Investigations Desk confidentially at[emailprotected].\n\nTheyve turned grief into a business, one victim said.You help others bury their loved ones, but when your time comes  youre abandoned.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By ZimEye Investigations | London | 10 November 2025 A full week after evidence surfaced showing a duplicate payment to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/suspicious-payment-to-duplicate-person-remains-unaddressed-a-week-later-in-matabeleland-national-bereavement-fund-scam-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Suspicious Payment To Duplicate Person Remains Unaddressed a Week Later In Matabeleland National Bereavement Fund Scam Allegations\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Tagwirei Declares Maximum Support For Extension Of Mnangagwa Term Of Office",
            "url": "https://www.zimeye.net/2025/11/10/tagwirei-declares-maximum-support-for-extension-of-mnangagwa-term-of-office/",
            "content": "By A Correspondent  Businessman and Central Committee member Dr. Kuda Tagwirei has publicly endorsed President Emmerson Mnangagwas controversial push for a term extension, raising concerns about Zanu PFs disregard for democratic norms.\n\nSpeaking at a Zanu PF Harare Province meeting over the weekend, Tagwirei openly aligned himself with the partys attempts to cling to power.\n\nI am your servant, I do what you instruct me to do. 2030 President Mnangagwa will be in office we are fully behind Baba Mnangagwas good works, Tagwirei said, in what critics describe as a brazen display of political subservience.\n\nObservers have warned that such public endorsements by influential figures like Tagwirei fuel authoritarian tendencies and threaten the democratic process. This is not about serving the people, it is about consolidating power and ignoring the will of the electorate, said political analyst Tendai Moyo.\n\nThe 2030 VaMnangagwa vanenge vachitonga slogan, now backed by Tagwirei, has been criticized as a disturbing sign that the party is preparing to extend Mnangagwas rule indefinitely, sidelining proper succession planning and accountability.\n\nResidents in Harare expressed concern over the messaging. It is frightening that they are already talking about 2030 as if elections dont matter, said one local. This is about keeping the same people in power while ordinary Zimbabweans continue to suffer.\n\nPolitical commentators argue that such endorsements highlight the symbiotic relationship between businessmen and political elites, where wealth is used to secure influence rather than genuine development. Tagwireis support is more about self-interest than national progress, Moyo added.\n\nAs Zanu PF pushes for term extensions, critics warn that the party is eroding democratic institutions and normalizing a culture where loyalty to the ruling elite is valued above the needs of the people.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Businessman and Central Committee member Dr. Kuda Tagwirei has publicly endorsed President Emmerson Mnangagwa’s controversial push … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/tagwirei-declares-maximum-support-for-extension-of-mnangagwa-term-of-office/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Declares Maximum Support For Extension Of Mnangagwa Term Of Office\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "Chebundo Fails to Mobilise 5,000 Defectors for Mnangagwa",
            "url": "https://www.zimeye.net/2025/11/10/chebundo-fails-to-mobilise-5000-defectors-for-mnangagwa/",
            "content": "By A Correspondent  Former MDC Kwekwe legislator Blessing Chebundo has failed to mobilise delegates for the much-publicised 5,000 Meet-the-Returnees interface, where President Emmerson Mnangagwa was expected to address thousands of former opposition members who have defected to ZANU PF.\n\nThe high-profile event, initially scheduled for Wednesday at the Harare International Conference Centre (HICC), was postponed at the last minute, with organisers citing a scheduling conflict in the Presidents diary.\n\nThe postponement was confirmed by Chebundo, who now serves as ZANU PFs Director for Returnees  a position he has held since defecting from the opposition in 2021.\n\nThe Presidential Interface meeting with returnees has been postponed to a later date, depending on the Presidents calendar. It was supposed to be on Wednesday, November 12, but the President has another important engagement, said Chebundo.\n\nHe added that the event logistics had been finalised:\n\nWe expected to receive 5,000 focal persons, whom you call returnees. These are representatives from different regions and professional sectors. We cant bring all 250,000-plus returnees to one place. We also expected 300 invited guests at the meeting. Everything is ready, and we hope to meet the President once he is available.\n\nThe so-called returnees are largely drawn from the Movement for Democratic Change (MDC) and its offshoots  including the MDC-T, MDC-Alliance, and Citizens Coalition for Change (CCC)  who defected to ZANU PF over the years, often citing internal opposition conflicts, disillusionment with leadership, or promises of political rehabilitation.\n\nAmong the most prominent MDC figures to join ZANU PF are:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former MDC Kwekwe legislator Blessing Chebundo has failed to mobilise delegates for the much-publicised “5,000 Meet-the-Returnees” … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/chebundo-fails-to-mobilise-5000-defectors-for-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Chebundo Fails to Mobilise 5,000 Defectors for Mnangagwa\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        },
        {
            "title": "ED’s 5,000 Meet-the-Returnees Flops",
            "url": "https://www.zimeye.net/2025/11/10/eds-5000-meet-the-returnees-flops/",
            "content": "By A Correspondent The much-anticipated Meet-the-Returnees interface, where President Emmerson Mnangagwa was expected to address thousands of former opposition members who have defected to ZANU PF, has been postponed.\n\nThe event, initially scheduled for Wednesday at the Harare International Conference Centre (HICC), was expected to attract more than 5,000 delegates and 300 invited guests. However, it was called off at the last minute due to what party officials described as a scheduling conflict in the Presidents calendar.\n\nThe postponement was confirmed by the ZANU PF Director for Returnees, former MDC legislatorBlessing Chebundo, who himself defected to ZANU PF in 2021.\n\nThe Presidential Interface meeting with returnees has been postponed to a later date, depending on the Presidents calendar. It was supposed to be on Wednesday, November 12, but the President has another important engagement, said Chebundo.\n\nHe added that preparations for the event were complete. We expected to receive 5,000 focal persons, whom you call returnees. These are representatives from various sectors and regionswe cant bring all 250,000-plus returnees to one place. We also expected 300 invited guests at the meeting. Everything is already in place for the event, and we hope to meet the President soon once his schedule allows, he said.\n\nThe returnees group is made up of former opposition membersmostly from theMovement for Democratic Change (MDC)and its splinter formationswho have over the years defected to ZANU PF, citing disillusionment with opposition politics.\n\nAmong the most prominent figures to have crossed the floor are:\n\nThe ZANU PF Returnees Programme, launched in 2021, has been part of the ruling partys broader campaign to project a message of inclusivity and reconciliation ahead of elections. However, critics view it as a political strategy to weaken the opposition and consolidate control through co-optation.\n\nDespite heavy mobilisation, the postponement of the 5,000-delegate meeting is seen as a setback for the initiative, which has been heavily publicised in state media.\n\nSource: The Herald\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The much-anticipated “Meet-the-Returnees” interface, where President Emmerson Mnangagwa was expected to address thousands of former opposition members … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/10/eds-5000-meet-the-returnees-flops/\">Continue reading<span class=\"screen-reader-text\"> \"ED’s 5,000 Meet-the-Returnees Flops\"</span></a></p>",
            "time": "18:10",
            "date": "10 Nov 2025"
        }
    ]
}