{
    "news": [
        {
            "title": "Another Grade 7 Exam Mishap",
            "url": "https://www.zimeye.net/2025/10/06/another-grade-7-exam-mishap/",
            "content": "By A Correspondent  Confusion rocked Gudyanga Primary School in Chimanimani District last Friday when Grade 7 pupils were mistakenly handed the wrong examination paper.\n\nInstead of sitting for their scheduled Agriculture, Science and Technology paper, the pupils received thePhysical Education and Artspaper  which they were meant to write the following Monday.\n\nThe blunder, which occurred on September 29, 2025, caused brief chaos in the examination room as invigilators and learners realised the error. According to sources who spoke toThe Masvingo Mirror, the paper had already been distributed to candidates, and they were moments away from writing when it was hastily withdrawn.\n\nAlthough the Zimbabwe Schools Examination Council (ZIMSEC) has in recent years tried to tighten its systems to prevent exam irregularities, mix-ups, leakages, and administrative blunders continue to haunt the institution  often leading to court cases and costly re-sits.\n\nZIMSEC public relations manager, Nicky Dhlamini, confirmed the incident but denied that the pupils had actually written or seen the contents of the paper.\n\nWe did receive information that the Monday paper was opened on Friday. It is important to note that the paper was not issued to candidates at all. ZIMSEC officials were alerted and they went to the school. The PED and the DSI also went there. The opened paper was retrieved and there was no prejudice to the exam, said Dhlamini.\n\nChimanimani District Schools Inspector (DSI) Elsie Muyocha referred questions to Provincial Education Director (PED) Richard Gabaza, who could not be reached for comment.\n\nThe incident has reignited debate about the integrity of ZIMSECs examination management systems, especially in rural schools where administrative errors often go unnoticed until they spark national attention.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Confusion rocked Gudyanga Primary School in Chimanimani District last Friday when Grade 7 pupils were mistakenly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/another-grade-7-exam-mishap/\">Continue reading<span class=\"screen-reader-text\"> \"Another Grade 7 Exam Mishap\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "Leaked Audio Of ZAOGA Married Church Elder Caught In The Act Grooming A Teenager For Intimacy",
            "url": "https://www.zimeye.net/2025/10/06/leaked-audio-of-zaoga-married-church-elder-caught-in-the-act-grooming-a-teenager-for-intimacy/",
            "content": "video loading below.\n\nA ZAOGA @FIFMIchurch elder has been caught after grooming a teenage child for intimacy. The male is heard in a viral audio speaking with the 16 year old and luring her. This is shortly before he is confronted by the mother. While the church is still to issue a comment, the institution has a long history of covering up evidence of child abuse for more than 20 years, and its founder Ezekiel Guti (who claimed he was sent by God) concealed evidence of his brother, Nelson, who was later convicted of child sex abuse in 2004. The latter is still serving as a bishop in the church although he is a convicted felon.\n\nA ZAOGA@FIFMIchurch elder has been caught after grooming a teenage child for intimacy. The male is heard in a viral audio speaking with the 16 year old and luring her. This is shortly before he is confronted by the mother. While the church is still to issue a comment, thepic.twitter.com/rGEGiUT3al\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below. A ZAOGA @FIFMIchurch elder has been caught after grooming a teenage child for intimacy. The male is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/leaked-audio-of-zaoga-married-church-elder-caught-in-the-act-grooming-a-teenager-for-intimacy/\">Continue reading<span class=\"screen-reader-text\"> \"Leaked Audio Of ZAOGA Married Church Elder Caught In The Act Grooming A Teenager For Intimacy\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "Chief Chimombe Demands Double Levies for Tombstone and Police Toilets | TellZim",
            "url": "https://www.zimeye.net/2025/10/06/chief-chimombe-demands-double-levies-for-tombstone-and-police-toilets/",
            "content": "By Dorrothy Moyo | Gutu  Villagers under Chief Chimombe in Gutu District say they are being squeezed dry by what they describe as unending and unfair monetary demands from their traditional leadership, this time, for the late chiefs tombstone unveiling and the construction of toilets at Bhasera Police Camp.\n\nAccording to a TellZimNews investigation, each household in Chief Chimombes jurisdiction has been instructed to pay US$5 and a six-pack of Chibuku Super beer\n\nGutu Chief forces villagers to fund late chiefs memorial, police toilets\n\nfor the memorial ceremony, in addition to US$12 per village for what the chiefs aide calls voluntary contributions towards the projects.\n\nChief Chimombe himself was unavailable for comment, but his messenger Rodger Marozhe confirmed the requests, insisting participation was not compulsory.\n\nChief Chimombe is not forcing anyone to contribute. He only asked those who are able to assist with the Manyaradzo (memorial ceremony) for his late father. Some of the money will also go towards building toilets at Bhasera Police Station, Marozhe said.\n\nHowever, disgruntled villagers told TellZim that refusal to comply is often met with silent punishment  exclusion from community support or delays in accessing official documents.\n\nWhen the chiefs office asks for money, its never really optional. Those who dont contribute risk being sidelined when they need assistance with documents or disputes, said one villager who requested anonymity.\n\nSeveral village heads said the continuous levies are causing friction within communities already battered by poverty and high living costs.\n\nWe are being drained from all directions. Villagers can barely afford food, yet we are told to raise money for a tombstone and police toilets. People are angry and beginning to turn against us, lamented one local leader.\n\nSources within the area allege that Chief Chimombe has a controversial history  having previously been removed by his late father over accusations of misusing community funds. The chief reportedly collected similar contributions years ago for a community court project that was never completed.\n\nMasvingos Permanent Secretary in the Minister of States Office, Dr. Addmore Pazvakavambwa, told TellZim he would verify the facts before commenting.\n\nI will get in touch with relevant authorities to establish the facts. We cannot say it is wrong or right before understanding what is happening on the ground. It could be a cultural practice in that area, he said.\n\nGutu District Development Coordinator Chiedza Tafirei was unreachable for comment.\n\nFor now, the rural community remains trapped between custom and coercion  forced to choose between loyalty to tradition and survival amid a crippling economic climate.\n\nSource: TellZim News (Masvingo)Additional Reporting: ZimEye Investigations Desk\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Gutu – Villagers under Chief Chimombe in Gutu District say they are being squeezed dry by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/chief-chimombe-demands-double-levies-for-tombstone-and-police-toilets/\">Continue reading<span class=\"screen-reader-text\"> \"Chief Chimombe Demands Double Levies for Tombstone and Police Toilets | TellZim\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "Grade 7s Write Wrong Exam",
            "url": "https://www.zimeye.net/2025/10/06/grade-7s-write-wrong-exam/",
            "content": "By A Correspondent Confusion rocked Gudyanga Primary School in Chimanimani District last Friday when Grade 7 pupils were mistakenly handed the wrong examination paper.\n\nInstead of sitting for their scheduled Agriculture, Science and Technology paper, the pupils received thePhysical Education and Artspaper  which they were meant to write the following Monday.\n\nThe blunder, which occurred on September 29, 2025, caused brief chaos in the examination room as invigilators and learners realised the error. According to sources who spoke toThe Masvingo Mirror, the paper had already been distributed to candidates, and they were moments away from writing when it was hastily withdrawn.\n\nAlthough the Zimbabwe Schools Examination Council (ZIMSEC) has in recent years tried to tighten its systems to prevent exam irregularities, mix-ups, leakages, and administrative blunders continue to haunt the institution  often leading to court cases and costly re-sits.\n\nZIMSEC public relations manager, Nicky Dhlamini, confirmed the incident but denied that the pupils had actually written or seen the contents of the paper.\n\nWe did receive information that the Monday paper was opened on Friday. It is important to note that the paper was not issued to candidates at all. ZIMSEC officials were alerted and they went to the school. The PED and the DSI also went there. The opened paper was retrieved and there was no prejudice to the exam, said Dhlamini.\n\nChimanimani District Schools Inspector (DSI) Elsie Muyocha referred questions to Provincial Education Director (PED) Richard Gabaza, who could not be reached for comment.\n\nThe incident has reignited debate about the integrity of ZIMSECs examination management systems, especially in rural schools where administrative errors often go unnoticed until they spark national attention.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Confusion rocked Gudyanga Primary School in Chimanimani District last Friday when Grade 7 pupils were mistakenly handed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/grade-7s-write-wrong-exam/\">Continue reading<span class=\"screen-reader-text\"> \"Grade 7s Write Wrong Exam\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "Mliswa Exposes Army Boss",
            "url": "https://www.zimeye.net/2025/10/06/mliswa-exposes-army-bossily/",
            "content": "By A Correspondent  Outspoken former legislator Temba Mliswa last week launched yet another explosive claim, this time alleging that fuel mogul and ZANU PF Central Committee member Kudakwashe Tagwirei has captured Zimbabwes military and is being prepared to succeed President Emmerson Mnangagwa.\n\nThe claims surfaced in a leaked audio of a private conversation between Mliswa and businessman Agrippa Bopela Masiyakurima, released on Thursday.\n\nThe leak comes just days after Mliswas rural home in Shurugwi was torched by unknown assailants in what police confirmed as a suspected arson attack. Mliswa described it as an assassination attempt linked to his persistent calls for accountability in government.\n\nIn the recording, Mliswa alleges that Mnangagwa has secured the loyalty of the armed forces through Tagwireis financial muscle. He claims that the hundreds of vehicles delivered to the Zimbabwe Defence Forces (ZDF) last week were not government-funded, as Mnangagwa announced, but were supplied by Tagwirei.\n\nMnangagwa will leave someone he trusts to look after his interests, and thats Kuda, Mliswa is heard saying.\n\nThere is no coup that will ever happen in Zimbabwe. Just check, military bosses were given 100 cars. Those are Kudas cars.\n\nMliswa further alleges that ZDF Commander General Philip Valerio Sibanda salutes Tagwirei when he passes by. He claims at least 500 vehicles will be distributed not only to top brass but also to colonels, captains, and majors  a strategy he described as good politics since mid-ranking officers are the backbone of the military.\n\nMliswa also revealed that he has been touring the country distributing bicycles donated by Tagwirei to village heads.\n\nMasiyakurima said he recorded the conversation after rejecting what he described as Mliswas offer to join a campaign backing Tagwirei. He alleged that Mliswa dangled promises of cash, vehicles, and business support in exchange for loyalty.\n\nWhen I realised the money was coming with conditions, I refused. My morals and principles would not allow me to be a sell-out, Masiyakurima said.\n\nI just wanted to show Zimbabweans that Temba goes to the highest bidder. He has been recruited by Tagwirei to do smear campaigns against VP Chiwenga.\n\nIn response, Mliswa accused Masiyakurima of betrayal. Writing on X, he said Masiyakurima had violated the sanctity of a private discussion:\n\nAs for you Bopela, I considered you a brother and friend and tried to help. We ate and took children to school together. Unfortunately, you had other ideas to please who I dont know. Next time, leak the whole conversation, not what you think are favourable portions.\n\nThe fallout adds fuel to tensions already swirling around Vice President Constantino Chiwengas bitter standoff with controversial businessman Wicknell Chivayo.\n\nMliswa has accused Chiwenga of using anti-corruption rhetoric selectively, claiming it stems from Chivayos alleged failure to fully bankroll Chiwengas 2022 wedding to Colonel Miniyothabo Baloyi. According to Mliswa, Chivayo lavished millions in cash, cars, and properties on the wedding but fell short by US$150,000  sparking Chiwengas vendetta.\n\nHe has also criticised Chiwenga for openly challenging Mnangagwa in Politburo meetings, warning that such disputes risk destabilising the party.\n\nMliswas latest claims follow weeks of political turbulence. Earlier, his vehicle was vandalised in what he linked to his attacks on Chiwenga. The arson attack on his Shurugwi homestead marked a sharp escalation.\n\nPolice confirmed the incident on Friday, saying investigations were underway:\n\nThe ZRP confirms that investigations are currently underway in connection with the malicious damage to property incident at Temba Mliswas homestead in Shurugwi on 02/10/25. More details will be released in due course.\n\nMliswa, a former ZANU PF Mashonaland West chairman, has a long history of clashes with party elites. Expelled in 2014 for allegedly undermining leadership, he reinvented himself as an independent legislator but remained deeply involved in factional politics.\n\nDespite repeated setbacks, Mliswa has carved a reputation as a political maverick who exposes corruption and power struggles inside ZANU PF. Following the Shurugwi attack, he reportedly left for Johannesburg, South Africa, raising speculation over whether he is seeking refuge or preparing for another round of political confrontation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Outspoken former legislator Temba Mliswa last week launched yet another explosive claim, this time alleging that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/mliswa-exposes-army-bossily/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Exposes Army Boss\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "Tanzanian Army Captain Calls for Military Intervention to Avert Election Chaos, Violence",
            "url": "https://www.zimeye.net/2025/10/06/tanzanian-army-captain-calls-for-military-intervention-to-avert-election-chaos-violence/",
            "content": "the video live stream\n\nThe officer, identified online as Captain John Charles Tesha, a weapons instructor at the Military Aviation School (SAK) in the TPDFs Air Wing (according to local news reports), appeared in full military uniform during the broadcast, invoking the legacy of Tanzanias founding father, the late President Julius Nyerere. Failure to stand against oppression would allow thugs to govern the nation, Tesha declared, echoing Nyereres historical warnings about the perils of unchecked tyranny. He positioned the military as the nations last bastion of trust, calling on it to investigate rampant corruption, probe the suspicious 2021 death of former President John Pombe Magufuli, and side unequivocally with the people against what he described as a corrosive deep state.\n\nThe video, which rapidly went viral on social media platforms, has amplified simmering tensions in Tanzania, where opposition leaders face arrests, abductions, and bans on rallies. Teshas remarks come just days after heightened scrutiny of electoral irregularities and human rights abuses, including the forced displacement of Maasai communities in Ngorongoro and Loliondo.\n\nCaptain Tesha, promoted to his rank on July 25, 2022, began his livestream by acknowledging the grave risks of breaching military protocol, including potential court-martial. I fear God alone, he stated, expressing gratitude for his health and life amid what he portrayed as a nation on the brink of collapse. His address, a raw outpouring of frustration, consolidated years of grievances into a clarion call for reform.\n\nAt its core, Tesha decried the systematic suppression of dissent under President Samia Suluhu Hassans administration. He lambasted the ruling Chama Cha Mapinduzi (CCM) party for monopolizing power, fabricating charges against opposition figures from the main rival party CHADEMA, and engineering electoral fraud through institutions like the National Electoral Commission (NEC) and National Identification Authority (NIDA). This election is a trap, Tesha warned, alleging voter suppression, falsified results, and intimidation tactics designed to perpetuate CCM dominance.\n\nTesha reserved some of his sharpest barbs for an alleged deep state  a shadowy cabal of elites, including former President Jakaya Kikwete and businessman Rostam Aziz  accused of infiltrating the military, judiciary, police, and media to plunder national resources. He detailed a litany of corruption scandals from Kikwetes 20052015 tenure, such as the TZS 133 billion foreign payments scandal, the Richmond energy deal fraud, Tegeta Escrow misappropriations, and dubious contracts involving mines, Air Tanzania, and the Bagamoyo Port project. Under President Suluhu, he claimed, this network continues to hawk off ports, mines, coal, and gold concessions, burdening citizens with excessive taxes while small businesses suffocate.\n\nThe death of President Magufuli, officially attributed to a heart condition but long shrouded in conspiracy theories, loomed large in Teshas narrative. Citing anonymous sources like journalist Humphrey Polepole, he alleged foul play orchestrated by CCM insiders, including Kikwete, and demanded an immediate probe to uncover the truth.\n\nHuman rights violations formed another pillar of his critique: abductions and killings of critics, the shuttering of Christian churches, assaults on religious leaders like Father Kitima, and the militarized intimidation of civilians through armed patrols. The government ignores the peoples voice, violating our Constitutions guarantee of free expression, Tesha said, urging the TPDF to shield citizens from further bloodshed.\n\nIn a bold proposal, Tesha advocated for the army to suspend the electoral process, arrest key figures like Kikwete, Aziz, President Suluhus son Abdul, politician Angela Kizigha, and security director Mombo, and convene a national dialogue with elders, judges like Joseph Warioba, and civil society. The military must intervene temporarily to avert violence and restore order, he implored, cautioning that inaction would invite thugs to rule unchecked. Yet, he stressed the peril of partisan entanglements, warning that eroding public trust in the TPDF could doom the nation.\n\nThe TPDF responded hours after the videos circulation with a terse statement from Acting Director of Information and Public Relations, Colonel Bernard Masala Mlunga. While stopping short of confirming Teshas status as an active officer, the communique painted him among individuals  possibly including dismissed personnel with histories of misconduct or activism  seeking to drag the military into partisan fray.\n\nThe Tanzania Peoples Defence Force (TPDF) informs the general public that some individuals have emerged who use social media to put out content that pushes to draw the military into political matters, Colonel Mlunga said. Furthermore, some of these statements are being made by people in military-related environments, those associating themselves with the army. Those who were dismissed from service due to bad behaviour and misconduct, as well as due to engaging in politics and activism.\n\nThe statement reaffirmed the TPDFs constitutional mandate: It continues to carry out its duties as provided by the constitution faithfully, obediently, and courageously in accordance with our oath. No arrests or disciplinary actions against Tesha were announced, leaving his fate  and the videos authenticity  in limbo.\n\nThis rebuke echoes broader calls to insulate security forces from politics, including recent remarks from Judge Joseph Warioba urging the militarys exclusion from electoral machinations.\n\nTeshas intervention underscores a profound trust deficit in Tanzanias institutions. A 2020 National Governance and Corruption Survey, polling 3,163 respondents, crowned the TPDF as the countrys most trusted body, with 60.9% viewing its officials as highly integrous. By contrast, the police topped corruption rankings at 45.6%, trailed by primary courts (19.9%) and the health sector (17.9%).\n\nYet, Teshas words risk fracturing that esteem. Online, reactions split sharply: supporters hail him as a patriot echoing Nyereres anti-oppression ethos, while critics decry him as a rogue agitator destabilizing an already fragile democracy. CHADEMA officials have yet to comment, but the partys recent crackdown  including leader Tundu Lissus exile and arrests of deputies  lends credence to Teshas alarms.\n\nFormer president Kikwete did not respond for comment.\n\nAs Tanzania hurtles toward elections amid abductions and protests, Teshas livestream might be a stark reminder of the stakes. Will the military heed his call, or will it double down on neutrality? For now, the TPDFs warning hangs heavy, but the videos echoes  and the captains bold uniform  ensure the debate rages on.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dar es Salaam, Tanzania – October 6, 2025 – By A Correspondent | In a dramatic livestream that has ignited … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/tanzanian-army-captain-calls-for-military-intervention-to-avert-election-chaos-violence/\">Continue reading<span class=\"screen-reader-text\"> \"Tanzanian Army Captain Calls for Military Intervention to Avert Election Chaos, Violence\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "The Sakunda Republic: Inside Mnangagwa’s Cartel State and the Coming Implosion of ZANU-PF",
            "url": "https://www.zimeye.net/2025/10/06/the-sakunda-republic-inside-mnangagwas-cartel-state-and-the-coming-implosion-of-zanu-pf/",
            "content": "By Reason Wafawarova\n\nA Captured Republic:\n\nOnce upon a revolution, Zimbabwe fought for sovereignty. Today, it has sovereignty only in name. Beneath the flag flutters another state  The Sakunda Republic  a shadow government run not by elected officials but by oil barons, gold smugglers, and Instagram philanthropists.\n\nWhat we call ZANU-PF is no longer a political party. It is a subsidiary of Sakunda Holdings, financed by stolen oil revenue and governed through WhatsApp audios, fake doctorates, and presidential bribes dressed up as schemes. The President is its trustee, the oligarch its treasurer, and the people its collateral.\n\nEmmerson Mnangagwa promised a Second Republic in 2017. What he delivered instead was a rented country  mortgaged to cartels and managed by billionaires who moonlight as benefactors. What Mugabe began as the abuse of liberation, Mnangagwa has perfected as the auctioning of it.\n\nHow ZANU-PF Became a Sakunda Subsidiary:\n\nAt the centre of this transformation stands Kudakwashe Tagwirei, Mnangagwas economic alter ego.\n\nOnce a fuel supplier, Tagwirei is now the de facto Minister of Everything  the man who hijacked NOCZIM, renamed it Sakunda, and built a private oil empire from public infrastructure.\n\nThe secret 45-percent ZANU-PF shareholding in Sakunda  originally a Mugabe-era war chest  has become the private ATM of the Presidents family and their financiers. Instead of dividends funding the party, billions have flowed into private Dubai mansions and campaign slush funds.\n\nTo distribute the spoils, Mnangagwas regime has created a grotesque cast:\n\nWicknell Chivayo, the regimes Father Christmas, weaponising philanthropy;\n\nScott Sakupwanya, the golden mascot, laundering loot through football and spectacle;\n\nDelish Nguwaya, the self-anointed garbage alchemist of Pomona, turning waste into wealth and corruption into an award.\n\nTogether they form Mnangagwas parallel politburo  the unelected but well-financed ruling council of the Sakunda Republic.\n\nA Politburo or a Shareholders AGM?\n\nTwo weeks ago, a routine politburo meeting turned into a shareholder revolt. Vice President Constantino Chiwenga arrived not as deputy but as whistleblower, armed with a dossier accusing Tagwirei of looting US$3.2 billion in party funds.\n\nHe charged that the supposed ZANU-PF stake in Sakunda had never yielded a cent for the party. Instead, the money financed Mnangagwas personal loyalty network  with Chivayo distributing cars, Sakupwanya funding football, and Nguwaya pretending to build power plants.\n\nIn that meeting, the revolutions most feared general became the partys first forensic auditor. The trustees of the Sakunda fund  Mnangagwa, Kembo Mohadi, and Patrick Chinamasa  suddenly looked like men cornered by their own arithmetic.\n\nWhen Chiwenga demanded the arrest of Tagwirei and his benefactors, a silence thicker than diesel filled the room. For a moment, it was clear: the party had been captured by its own financiers.\n\nThe Billionaire Babysitters:\n\nWhat this scandal exposed is not just corruption, but a new model of presidential insurance. Mnangagwas survival depends on a bodyguard of billionaires  men who shield him from both internal coups and public scrutiny.\n\nBefore every foreign trip, the President must make a calculation no liberation hero ever imagined: If I leave my benefactors behind, will they be arrested by Chiwenga? If he takes them along, he appears absurd; if he leaves them, he risks a coup.\n\nThis is why Mnangagwa skipped the UN General Assembly this year  not because he lacked speechwriters, but because he lacked trust. The Sakunda Republic cannot afford to be left unsupervised for a week.\n\nLawfare and the Fear Economy:\n\nTo contain the fallout, Mnangagwa reshuffled the partys fossils  not to rejuvenate it, but to tighten control.\n\nObert Mpofu, who had dared to sympathise with Chiwengas outrage, was banished from the powerful Secretary-General post to the museum shelf of ICT  a cruel joke for a man who still types with one finger.\n\nIn his place came Jacob Mudenda, rejected by voters but beloved by the President for his mastery of lawfare  the art of turning the law into a weapon. The Finance docket went to Patrick Chinamasa, another failed lawyer turned political accountant, and Legal Affairs to Ziyambi Ziyambi, who failed at law, failed at elections, and found redemption only in repression.\n\nIt is a trinity of legal ghosts  men unelectable, unaccountable, and indispensable to a President who governs through courtrooms rather than ballots.\n\nThe Dynasty Project: From Mugabeism to Mnangagwaism:\n\nIf Mugabes tragedy was over-staying, Mnangagwas is over-selling.\n\nHe sells loyalty as empowerment, poverty as policy, and patronage as reform. His so-called Presidential Schemes  goats, boreholes, bicycles, and cars  are not public policy but political narcotics, keeping citizens high on dependency.\n\nEvery scheme has a looting conduit. The Presidential Borehole Scheme is a billion-dollar tender fraud wrapped in charity. The Goat Scheme is a phantom empowerment drive that delivered no goats but plenty of invoices. The Defence Forces Car Scheme and Teacher Allowance Scheme are vehicles of cash recycling from Treasury to Tagwireis front companies.\n\nThis is not governance. It is feudalism with an electronic wallet.\n\nBehind it all lies the true project: Dynasty 2050  the dream of handing power from Mnangagwa to his financiers, and eventually to his sons, Sean or Emmerson Jr. It is a family trust deed disguised as Vision 2030.\n\nEnter the Court Jester: Temba Mliswa\n\nEvery dynasty needs a jester, and Mnangagwa found his in Temba Mliswa  the loudest beggar in a country of quiet victims.\n\nFor a tidy fee rumoured at US$300,000, Mliswa has been deployed as a mercenary megaphone, his mission to spin Chiwengas corruption allegations into circus chatter. From a five-star hotel in Johannesburg, he tweets like a drunk Pablo Escobar  a man caught with six sachets of dagga yet claiming to know who stole six billion.\n\nHis task is simple: drown the scandal in noise. Paint Chiwenga as co-thief, portray Tagwirei as visionary, and declare the dynasty inevitable. It is the politics of smoke and mirrors  a propaganda strategy outsourced to a man allergic to dignity.\n\nLiberation Revisited: From Nhari to Sakunda:\n\nTo understand how low the liberation movement has sunk, one must revisit its own history of rebellion.\n\nIn 1974, the Nhari Rebellion questioned the luxurious lifestyles of commanders during the liberation war. The rebels were branded traitors and executed bush-style.\n\nIn 1977, the Vashandi Rebellion  the same young cadres who authored the heroic Mgagao Declaration that installed Mugabe as leader  were denounced as villains and jailed in Mozambique. Only Samora Machel and Simon Muzenda prevented their execution, after Josiah Tongogaras team had prepared the firing squad.\n\nThe message was clear: in ZANU, accountability was a capital offence.\n\nFifty years later, the same party that once executed its idealists now decorates its thieves. Where the Nhari rebels died for questioning excess, Tagwirei thrives for perfecting it. Where Vashandi dreamed of socialist justice, Sakunda built capitalist tyranny.\n\nThus, the liberation struggle has been reversed  its revolutionaries now villains, and its looters national heroes.\n\nThe Human Face of Party Capture:\n\nBehind the billions looted by Sakundas cartels lie human corpses of policy failure.\n\nRural communities still wait for boreholes while US$1.2 billion was siphoned in advance for dry holes and ribbon-cutting.\n\nCancer patients die without chemotherapy while half a billion vanished into tenders for machines that never arrived.Villagers were promised goats under a US$40 million Goat Scheme; not one bleated.\n\nMeanwhile, party loyalists cruise in donated SUVs, musicians sing praises for cars bought with public money, and football fans cheer teams bankrolled by gold-smuggling cartels.\n\nIt is not just the party that has been captured  it is the entire populace, sedated with spectacle, debt, and despair.\n\nThe Coming Implosion:\n\nZANU-PF is now a political Ponzi scheme. The dividends of corruption no longer trickle down, and the beneficiaries are beginning to turn on each other.\n\nChiwengas outburst marks the first visible fracture in the cartel pyramid. His grievance is not ideological; it is existential. The military wing feels cut out of the loot it once controlled. The civilians  Tagwireis billionaires  have monopolised the spoils.\n\nThis is how revolutions eat themselves: when the thieves run out of loot to share.\n\nThe reshuffle that followed was not a show of strength but of fear. The Presidents absence from international summits, his obsession with reshuffles and lawfare, his endless patronage schemes  all point to a man governing under siege.\n\nThe dynasty project has already entered the terminal phase known to political scientists as elite implosion  when the patron can no longer pay the clients, and the clients begin to plot their own futures.\n\nThe Sakunda Republic: A Satirical Census\n\n(Boxed Sidebar  for layout)\n\nOffice Incumbent Function\n\nPresident: Kudakwashe Tagwirei: Supplies fuel, funds elections, owns the state.\n\nVice President: Wicknell Chivayo: Distributes cars, buys musicians, spreads joy\n\nMinister of Sport & Distraction: Scott Sakupwanya: Launders gold through football.\n\nMinister of Sanitation & Spin: Delish Nguwaya: Turns garbage to gold (literally).\n\nMinister of Information: George Charamba: Explains the unexplainable.\n\nMinister Without Dignity: Temba Mliswa: Tweets for food.\n\nPeople of Zimbabwe: 16 Million: Captive shareholders with no dividends.\n\nConclusion: Legacy or Loot?\n\nEvery nation is defined by its enduring policies.\n\nMugabe, for all his tyranny, left the Mass Education Policy and Health for All.\n\nMandela left reconciliation.\n\nThomas Sankara left integrity, resurrected today by Ibrahim Traor in Burkina Faso.\n\nMnangagwa will leave neither schools nor clinics  only beneficiaries. His legacy is the goat that never arrived, the borehole that never worked, the dynasty that never stabilised.\n\nZimbabwe today is governed not by law, ideology, or even fear  but by cartel mathematics:\n\nSakunda funds loyalty. Loyalty funds dynasty. Dynasty funds paranoia.\n\nThe liberation war was fought for independence.Today, independence is mortgaged to Dubai bankers and oil cartels.\n\nMnangagwa may yet skip another UN meeting, but he cannot skip history. And history will not remember him as the liberator who saved Zimbabwe from Mugabe. It will remember him as the trustee who rented ZANU-PF to Sakunda, sold the revolution for SUVs, and tried to turn a nation into a family dynasty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Reason Wafawarova A Captured Republic: Once upon a revolution, Zimbabwe fought for sovereignty. Today, it has sovereignty only in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/the-sakunda-republic-inside-mnangagwas-cartel-state-and-the-coming-implosion-of-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"The Sakunda Republic: Inside Mnangagwa’s Cartel State and the Coming Implosion of ZANU-PF\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "Opposition Party Urges Citizens to Rise Against Corruption",
            "url": "https://www.zimeye.net/2025/10/06/opposition-party-urges-citizens-to-rise-against-corruption/",
            "content": "By A Correspondent\n\nThe newly formed opposition movement, Freedom Fighter for Change (FFC), has urged Zimbabweans to stand up and take action against corruption, accusing powerful individuals of plundering the nations wealth.\n\nIn a statement issued on Saturday titled Defend Our Inheritance, the group called on citizens to unite and protect what rightfully belongs to them.\n\nThugs are stealing from us  our cars, phones, healthcare, industries, education, electricity, and minerals. We cant stand idly by, the statement read.\n\nThe opposition movement said it was time for every Zimbabwean to rise up in defense of the countrys future. We rise up! We defend our inheritance in one accord! Join the movement and lets reclaim our future, FFC declared.\n\nAs preparations continue for the official launch of the party, FFC said its mission was to restore accountability and ensure that the nations resources benefit all citizens.\n\nThe time is now! As we prepare for the launch of our party, we call on all citizens to stand with us, the group urged.\n\nUsing slogans such as #WeMove and #FFC, the party is mobilising supporters through its WhatsApp platforms, encouraging citizens to join the movement and defend our inheritance.\n\nTogether, we can make a difference, the statement concluded, reflecting growing calls for change amid rising frustration over corruption and economic hardship in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The newly formed opposition movement, Freedom Fighter for Change (FFC), has urged Zimbabweans to stand up and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/opposition-party-urges-citizens-to-rise-against-corruption/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition Party Urges Citizens to Rise Against Corruption\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "ZRP Denies Involvement In Accident That Killed Kombi Driver",
            "url": "https://www.zimeye.net/2025/10/06/zrp-denies-involvement-in-accident-that-killed-kombi-driver/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police has denied any role in the death of a kombi driver following a crash in Harare on Friday, 3 October.\n\nImages of the damaged kombi spread on social media, with some suggesting the driver had crashed while trying to evade a police motorbike.\n\nOn Saturday, national police spokesperson Commissioner Paul Nyathi refuted the claims, calling them completely false and urged the public to avoid sharing unverified information. Comm. Nyathi said:\n\nThe ZRP wishes to clarify the circumstances surrounding a tragic road accident involving a Toyota Hiace kombi and an Isuzu D-Max along Tongogara Avenue, near Blakiston Street, Harare, on 03/10/2025, in which the kombi driver tragically lost their life.\n\nThere was no high-speed pursuit or confrontation between the kombi operator and any police officers on duty.\n\nThe ZRP Command has reviewed all available video recordings from the scene and from the cameras of deployed officers, and no such incident involving police engagement occurred.\n\nWe caution all Zimbabweans against circulating false stories or misinformation on social media.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police has denied any role in the death of a kombi driver following a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/zrp-denies-involvement-in-accident-that-killed-kombi-driver/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Denies Involvement In Accident That Killed Kombi Driver\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        },
        {
            "title": "Tocky Vibes Bunks His Own Album Launch",
            "url": "https://www.zimeye.net/2025/10/06/tocky-vibes-his-own-album-launch/",
            "content": "Tocky Vibes is still to comment over why he was nowhere to be seen at his own album launch in Harare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tocky Vibes is still to comment over why he was nowhere to be seen at his own album launch in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/06/tocky-vibes-his-own-album-launch/\">Continue reading<span class=\"screen-reader-text\"> \"Tocky Vibes Bunks His Own Album Launch\"</span></a></p>",
            "time": "18:42",
            "date": "06 Oct 2025"
        }
    ]
}