{
    "news": [
        {
            "title": "Elon Musk Calls for Trump’s Impeachment Amid Explosive Epstein Allegations",
            "url": "https://www.zimeye.net/2025/06/05/elon-musk-calls-for-trumps-impeachment-amid-explosive-epstein-allegations/",
            "content": "https://x.com/zimeye/status/1930896094679965829?s=46\n\nBy A Correspondent | ZimEye | Billionaire entrepreneur Elon Musk has ignited a political firestorm by publicly calling for the impeachment of U.S. President Donald Trump, amid escalating tensions between the two high-profile figures.\n\nDo you think Trumpwill give Afrikaners asylum again after his fall-out with@elonmusk?\n\nThe tech mogul took to X (formerly Twitter) to make a series of explosive statements, directly accusing Trump of being implicated in the Jeffrey Epstein files. According to Musk, this is the real reason why the documents have not been fully released to the public.\n\nTime to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT! Musk posted on X. He followed up with, Mark this post for the future. The truth will come out.\n\nThese statements came shortly after reports surfaced that President Trump allegedly threatened to cancel Elon Musks U.S. government contracts, escalating what had previously been a simmering feud into a full-blown public and political confrontation.\n\nIn a highlighted repost from political commentator Ian Miles Cheong, Musk responded with a blunt Yes when Cheong posed the question of who would win in a clash between the President and the billionaire. The thread went even further, with Cheong suggesting Trump should be impeached and replaced by Senator JD Vance  a sentiment Musk did not oppose.\n\nMusks comments are gaining massive traction online, with millions of views and tens of thousands of interactions within hours. If verified, the claim about Trump being named in the Epstein documents could have profound implications for the presidency and ongoing investigations into Epsteins extensive web of influence.\n\nAt the time of reporting, neither the White House nor Donald Trump has issued an official response to Musks accusations.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Washington, D.C. — June 5, 2025 By A Correspondent | ZimEye | Billionaire entrepreneur Elon Musk has ignited a political … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/elon-musk-calls-for-trumps-impeachment-amid-explosive-epstein-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Elon Musk Calls for Trump’s Impeachment Amid Explosive Epstein Allegations\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "Mnangagwa Suffers Huge Blow",
            "url": "https://www.zimeye.net/2025/06/05/mnangagwa-suffers-huge-blow/",
            "content": "South AfricaPresident Emmerson Mnangagwa could be the biggest loser following the deathin South Africaof Zambias former President Edgar Chagwa Lungu.\n\nLungu, a close ally of Mnangagwas ruling Zanu PF party and a prominent figure in the network of former liberation movements in Southern Africa, early Thursday, at the age of 68.\n\nHis party, the Patriotic Front (PF), confirmed a statement released late Thursday saying Lungu had been receiving specialized treatment in South Africa for an undisclosed illness. The party mourned the passing of a manitdescribed as a statesman, patriotandservant of the people.\n\nLungu served as Zambias sixth president from 2015 to 2021, after assuming office following the death of Michael Sata.\n\nHe presided over a turbulent period marked by rising debt, an economic downturn, and growing authoritarian tendencies, including a crackdown on dissent and independent media.\n\nDespite these challenges, he remainedareveredfigureamong fellow regional leaders, especially those within the former liberation movements.\n\nHis close relationship with Zimbabwes President Emmerson Mnangagwa and the broader Zanu PF elite was no secret.\n\nHe often expressed admiration for Zimbabwes revolutionary resilienceand maintainedwarm ties with the Southern African Development Community (SADC)s regional bloc of former liberation movements  including South Africas ANC, Mozambiques Frelimo, and Namibias Swapo.\n\nDuring his presidency, Lunguwas a consistent voice in support ofMnangagwa, both during and after the 2017 coup that ousted long-time Zimbabwean ruler Robert Mugabe.\n\nLungu was one of the first leaders to endorse Mnangagwas legitimacy and was seen as a regional bulwark against Western criticism of Zanu PFs human rights abuses and disputed electoral processes.\n\nButLungus own rule was marred by accusations of authoritarianism.\n\nHe oversaw the arrest of opposition figures, the militarization of state institutions, and controversial constitutional amendments aimed at extending his grip on power.\n\nHis 2021 re-election bid was marked by growing public dissatisfaction, culminating in a decisive loss to opposition leader Hakainde Hichilema.\n\nOn the eve of the 2021 election results announcement, Lungu infamously shut down the internet  a move widely condemned by rights groups.\n\nHis final public call as president, was on 13 August 2021,  in a conversation withZimEyewhich urged him to avoid plunging the country into post-election violence.\n\nAfter conceding defeat, Lungu briefly stepped back from politics but re-emerged in late 2023 with subtle hints of a political comeback  sparking tensions within the PF and fears of renewed political instability.\n\nThough controversial at home, Lungu continued to enjoy a degree of respect among former liberation movement leaders.\n\nHis passing is felt deeply within that political fraternity, particularly in Harare, where Mnangagwa regarded him asbotha comrade and regional ally.\n\nLungu is survived by his wife Esther and their children. Details of his funeral arrangements are yet to be announced.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa— President Emmerson Mnangagwa could be the biggest loser following the death in South Africa of Zambia’s former President Edgar Chagwa Lungu. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/mnangagwa-suffers-huge-blow/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Suffers Huge Blow\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "Help Save Chinyanga From Being Killed By Mnangagwa",
            "url": "https://www.zimeye.net/2025/06/05/help-save-chinyanga-from-being-killed-by-mnangagwa/",
            "content": "By A Correspondent-Hi, my name is Andrinah and I am fundraising forwilliamchinyanga.\n\nThis is an urgent appeal for help to pay for legal assistance to save William from deportation to Zimbabwe, where he is certain to face brutal persecution and even death.\n\nWilliam has been an activist and advocate for human rights for over 30 years and became a refugee in the UK after fleeing Zimbabwe in 2002. He is a science lecturer and teacher with refugee status and leave to remain in the UK.\n\nHe is a prominent political opponent of the rulingZANU-PF regime, drawing attention to human rights abuses and corruption within the Zimbabwean government.He is a family man of good character and has lived and workedin the UK peacefully.\n\nHis daughter suffers from a mental health illness that requires 24-hour support, and the stress of Williams legal battle has taken a severe toll on his family for over four years.\n\nEarlier this week, Chinyanga, a Zimbabwean national based in the United Kingdom, wrote a letter raising alarm that he is not safe if deported from the UK.\n\nHe was convicted on false charges of inciting terrorism after his solicitor, Madeleine Corrwho was slammed by a judge for riding two horsesblocked his key witnesses and followed the opinion of name-change scammer Hopewell Chinono. Chinono also compromised the career of Williams cousin, Hon. Job Sikhala.\n\nBelow is his address to Zimbabweans and the world, issued on03 June 2025:\n\nFull Text:\n\nDear Zimbabweans,\n\nMy life is in danger. Please help me.\n\nI have been denied release from prisonon the grounds thatI am still a danger to ZANU-PF.\n\n(i) The reason I appealed against the conviction: In the background, I lost my appeal because the prison security and police withheld my appeal documentsincluding witness statementsthat had beenrequested by the appeal judge.Without these, the judge made a decision.\n\nIt was my democratic right to appeal; it is not a crime. The system wanted to blackmail me into admitting I am a terrorist, which I am not.\n\n(ii) The prison enrolled me in a programming course about extremism called ERG, in the form of HII, which I completed 90%. I fell into depression during the process when the police and prison security confiscated my letters to the lawyer and the Home Officeletters that explained why I should not be deported.\n\n(To me, deportation means execution by the ZANU-PF government.)\n\nBecause of this, the plan by the police and prison security worked, and now they say I will not be released because I did not complete HII. (Despite the fact thatI was actively participating until the same people disrupted me, giving them a reason to justify keeping me in prison.)\n\nACTION REQUESTED:\n\ni)I want you tofind a criminal lawyer to sue the prison security on my behalf.\n\nii)I want you toapproach the Prime Minister as a delegation to stop my deportation and challenge the illegal imprisonment I am being subjected to.\n\nNote:ZANU-PF isoperatingin the background with the UK government on lithium and diamond deals.Mnangagwa now has free access to Britain, despite the human rights abuses he has committed in Zimbabwe.\n\nChinyanga\n\nhttps://www.gofundme.com/f/stop-illegal-deportation-of-william-chinyanga-to-zimbabwe\n\nhttps://www.gofundme.com/f/stop-illegal-deportation-of-william-chinyanga-to-zimbabwe\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Hi, my name is Andrinah and I am fundraising for william chinyanga. This is an urgent appeal for help to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/help-save-chinyanga-from-being-killed-by-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Help Save Chinyanga From Being Killed By Mnangagwa\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "18 Year Old Domboshava Teen in Hot Soup for stealing from VP Chiwenga’s Wife",
            "url": "https://www.zimeye.net/2025/06/05/18-year-old-domboshava-teen-in-hot-soup-for-stealing-from-vp-chiwengas-wife/",
            "content": "By A Correspondent | ZimEye| An 18-year-old man from Domboshawa has been convicted for stealing cellphones valued at US$15,000 from the shop owned by Vice President Constantino Chiwengas wife, Miniyothabo, located in Borrowdale.\n\nSucces Mukaro was found guilty of unlawful entry by Harare magistrate Ethel Chichera after admitting to the charges.\n\nHe is expected to receive his sentencing this Friday.\n\nThe theft took place on May 31, around 3:00 PM. At the time, Ossie Shone, a supervisor at Miniyothabos shop, had just finished his shift and departed without securing the premises properly, taking the keys with him.\n\nThat same afternoon, Mukaro broke through the front glass display, creating a hole large enough for him to enter the shop. Once inside, he stole cellphones worth US$16,915 before making his escape.\n\nOn June 3, 2023, police detectives received a tip-off regarding stolen cellphones being sold at Ximex Mall. They were able to recover some of the stolen phones from an individual named Blesses Luciano, who revealed that he had purchased the devices from Isaac Craig Chaza on June 1.\n\nDetectives successfully retrieved additional stolen cellphones from Chaza by posing as potential buyers. Chaza and an accomplice, Steve Makangira, then led the detectives to Mukaro, who was arrested alongside his brother Jason Moyo. Mukaro was found in possession of more stolen cellphones.\n\nFurther investigations at Mukaros residence in Domboshawa yielded more stolen property, and his fingerprints were found to match those collected at the crime scene.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye| An 18-year-old man from Domboshawa has been convicted for stealing cellphones valued at US$15,000 from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/18-year-old-domboshava-teen-in-hot-soup-for-stealing-from-vp-chiwengas-wife/\">Continue reading<span class=\"screen-reader-text\"> \"18 Year Old Domboshava Teen in Hot Soup for stealing from VP Chiwenga’s Wife\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "HH mourns ECL",
            "url": "https://www.zimeye.net/2025/06/05/hh-mourns-ecl/",
            "content": "IT IS WITH DEEP SORROW AND A HEAVY HEART THAT WE HAVE BEEN INFORMED BY HIS FAMILY, OF THE PASSING ON, OF THE SIXTH PRESIDENT OF THE REPUBLIC OF ZAMBIA, HIS EXCELLENCY MR. EDGAR CHAGWA LUNGU.\n\nWE THEREFORE WISH TO OFFICIALLY INFORM THE NATION OF THIS SAD DEVELOPMENT AND EXTEND OUR HEARTFELT CONDOLENCES TO HIS WIDOW, THE SIXTH FIRST LADY, MADAM ESTHER LUNGU, THE ENTIRE LUNGU FAMILY, THE PATRIOTIC FRONT PARTY, AND THE PEOPLE OF ZAMBIA.\n\nAS ZAMBIANS, AFRICANS, AND MORE SO AS CHRISTIANS, THIS MOMENT CALLS FOR SOLEMNITY, UNITY, LOVE AND COMPASSION.\n\nAT SUCH TIMES WE MUST MOURN TOGETHER AS ONE PEOPLE, ABOVE POLITICAL AFFILIATION OR PERSONAL CONVICTION, AS WE HONOUR THE LIFE OF A MAN WHO ONCE HELD THE HIGHEST OFFICE IN OUR LAND.\n\nIN THE SPIRIT OF PATRIOTISM AND NATIONAL SOLIDARITY, WE URGE ALL CITIZENS TO OFFER SUPPORT AND RESPECT TO THE BEREAVED FAMILY, AND TO UPHOLD THE VALUES OF PEACE, DIGNITY, AND TOGETHERNESS THAT DEFINE US AS ZAMBIANS.\n\nORIGINAL SIGNED,\n\nHAKAINDE HICHILEMAPRESIDENT OF THE REPUBLIC OF ZAMBIA\n\nThe late former Zambian President Edgar Chagwa Lungu\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "IT IS WITH DEEP SORROW AND A HEAVY HEART THAT WE HAVE BEEN INFORMED BY HIS FAMILY, OF THE PASSING … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/hh-mourns-ecl/\">Continue reading<span class=\"screen-reader-text\"> \"HH mourns ECL\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "Mafume Donates Fuel to Warriors Fans Ahead of COSAFA Clash with South Africa",
            "url": "https://www.zimeye.net/2025/06/05/mafume-donates-fuel-to-warriors-fans-ahead-of-cosafa-clash-with-south-africa/",
            "content": "Sports Correspondent\n\nHarare, Zimbabwe  City of Harare Mayor Jacob Mafume has extended support to Zimbabwean football supporters by donating fuel to fans planning to travel to Bloemfontein, South Africa, for the ongoing COSAFA Championship, which runs until 15 June.\n\nThe gesture was confirmed during a meeting held at Town House on Tuesday between Mayor Mafume and the leadership of the Zimbabwe Supporters Association. The delegation was led by organising secretary Chris Romario Musekiwa, alongside Vice President Adomsi Makosi and members Richard CheMhofela Sande, Fungai Sokostina Gumbu, Nyarai Munetsi, and Austin Charumbira.\n\nThe discussions centred around the broader development of football in Harare, focusing on improving infrastructure and encouraging grassroots participation across communities.\n\nIn addition to the fuel donation, Mafume pledged further support by offering to assist with accommodation expenses for the travelling fans, pending the acquisition of sponsorship partnerships.\n\nThe fans are currently making final arrangements and are in search of a suitable coach to transport them across the border. Their journey is aimed at backing the Warriors in a key COSAFA fixture against host nation South Africa, scheduled for this Saturday at 3 p.m.\n\nThis important clash follows Zimbabwes goalless draw against Mauritius in their tournament opener on Wednesday. The fans presence in Bloemfontein is expected to boost morale as the Warriors aim for a strong showing in the regional competition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Harare, Zimbabwe – City of Harare Mayor Jacob Mafume has extended support to Zimbabwean football supporters by donating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/mafume-donates-fuel-to-warriors-fans-ahead-of-cosafa-clash-with-south-africa/\">Continue reading<span class=\"screen-reader-text\"> \"Mafume Donates Fuel to Warriors Fans Ahead of COSAFA Clash with South Africa\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "Chelsea Seal £30M Signing of Liam Delap from Ipswich Town",
            "url": "https://www.zimeye.net/2025/06/05/chelsea-seal-30m-signing-of-liam-delap-from-ipswich-town/",
            "content": "Sports CorrespondentLondon, June 4, 2025  Chelsea Football Club have officially announced the signing of young striker Liam Delap from Ipswich Town in a deal worth 30 million. The promising 22-year-old forward has penned a six-year contract that will keep him at Stamford Bridge until June 2031.\n\nDelap, who impressed with a standout season at Ipswich, becomes Chelseas first major signing of the summer transfer window. He will wear the iconic number 9 shirt, a jersey historically associated with some of the clubs most notable strikers.\n\nChelseas interest in Delap intensified following his consistent goal-scoring performances and physical presence in the Championship. The Blues believe the England U21 international has the potential to thrive at the highest level and bolster their attacking options under manager Enzo Maresca.\n\nClub sources have praised Delaps work ethic, technical ability, and hunger to prove himself on the Premier League stage. His arrival is expected to add depth and competition up front as Chelsea aim to return to top-four contention next season.\n\nDelap will join pre-season training in July and is expected to be part of Chelseas summer tour squad. Fans will be eager to see whether the new number 9 can finally break the long-running striker curse at Stamford Bridge and become a reliable goal scorer for the West London giants.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent London, June 4, 2025 – Chelsea Football Club have officially announced the signing of young striker Liam Delap … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/chelsea-seal-30m-signing-of-liam-delap-from-ipswich-town/\">Continue reading<span class=\"screen-reader-text\"> \"Chelsea Seal £30M Signing of Liam Delap from Ipswich Town\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "RBZ Claims ZiG to Gain Value, Inflation to Drop Below 30% by December",
            "url": "https://www.zimeye.net/2025/06/05/rbz-claims-zig-to-gain-value-inflation-to-drop-below-30-by-december/",
            "content": "By A Correspondent\n\nThe Reserve Bank of Zimbabwe (RBZ) has projected that annual ZiG inflation will decline to below 30% by December 2025, despite current year-on-year figures showing a sharp rise. The central bank remains confident that tight monetary policies and economic reforms will stabilize prices and strengthen the local currency.\n\nIn a press statement issued on 4 June 2025, the RBZ attributed the current spike in annual inflationwhich rose to 92.1% in May, up from 85.7% in Aprilto what it described as a once-off base effect resulting from a price shock that occurred between September and October 2024, when month-on-month inflation soared from 5.8% to 37.2%.\n\nThe sharp rise in year-on-year ZiG inflation to 92.1% in May 2025 is due to a once-off base effect caused by a SeptemberOctober 2024 price shock, the RBZ said in its statement.\n\nDespite this alarming annual figure, the RBZ highlighted that month-on-month inflation has remained below 1% for the past three months, indicating relative price stability.\n\nLow month-on-month inflation continues, signaling minimal recent inflationary pressure, the central bank noted.\n\nLooking ahead, the RBZ said it expects inflation to stabilize from October and fall below 30% by December 2025, with a broader goal of achieving single-digit inflation in the long term.\n\nZiG inflation is projected to stabilize from October 2025 and fall below 30% by year-end, the statement read.\n\nThe central bank also urged economic stakeholders to focus more on month-on-month inflation data, which it said offers a more accurate picture of current economic conditions, rather than annual inflation, which remains distorted due to the transition from the Zimbabwe dollar (ZW$) to the ZiG currency in 20232024.\n\nWe urge economic agents to monitor month-on-month inflation instead of annual figures, which are distorted by historical statistical gaps, the RBZ emphasized.\n\nIn support of this outlook, the RBZ pledged to maintain a tight monetary policy stance, saying it will continue to prioritize inflation control, exchange rate stability, and overall economic growth.\n\nThe Bank remains committed to preserving purchasing power and value stability. The current rise in annual inflation will not affect real consumer value due to its historical nature, it said.\n\nThis latest statement comes amid public concern over the value of the ZiG, which has faced scrutiny since its introduction last year. However, the RBZ insists that current indicators show a strengthening trend and that the economy is moving toward stabilization.\n\nWith inflation management remaining a key focus, the next few months will be crucial for the RBZ to prove that its projections holdand that Zimbabwes newest currency can earn the confidence of the public.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Reserve Bank of Zimbabwe (RBZ) has projected that annual ZiG inflation will decline to below 30% … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/rbz-claims-zig-to-gain-value-inflation-to-drop-below-30-by-december/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Claims ZiG to Gain Value, Inflation to Drop Below 30% by December\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "Top Zimbabwean Gospel Musician Dies",
            "url": "https://www.zimeye.net/2025/06/05/top-zimbabwean-gospel-musician-dies/",
            "content": "By A Correspondent\n\nRenowned Bulawayo-based gospel artist Pastor Barak, born Siphethangani Sibanda, passed away on Wednesday, leaving the local music community in mourning.\n\nThe cause of his death has not yet been confirmed.\n\nPastor Barak made a lasting impact on the gospel music scene with popular tracks such as Wavuma, Bayashada, and Qina, which topped local gospel charts and earned him a devoted following.\n\nMourners are currently gathered at his family home, located at 91 Percy Avenue in Hillside, Bulawayo, to pay their respects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Renowned Bulawayo-based gospel artist Pastor Barak, born Siphethangani Sibanda, passed away on Wednesday, leaving the local music … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/top-zimbabwean-gospel-musician-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zimbabwean Gospel Musician Dies\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        },
        {
            "title": "How Mnangagwa Has Reduced University Graduates to Beggars: Young Lady Appeals for Financial Help from Chivayo",
            "url": "https://www.zimeye.net/2025/06/05/how-mnangagwa-has-reduced-university-graduates-to-beggars-young-lady-appeals-for-financial-help-from-chivayo/",
            "content": "By A CorrespondentA young Zimbabwean woman, Ratidzai Mlambo, has taken to social media to appeal for financial help from controversial businessman and ZANU PF official, Wicknell Chivayo, in a heartfelt message that has sparked conversation about the dire economic conditions facing educated youth in Zimbabwe.\n\nIn her public Facebook plea posted on Monday, Ratidzai paints a grim picture of her struggle to survive despite having a university degree. She attributes her situation to a failed system that has left graduates like herself resorting to street vending and begging to pursue their dreams.\n\nRatidzai, who sells jewellery on the streets of Mutare, shared her aspirations of expanding her business and someday sourcing products from China, just as many other Zimbabwean entrepreneurs do.\n\nShe humbly requested assistance with capital, shelter, and transport, while stressing that she is not a celebrity or public figurejust an ordinary citizen trying to make a living.\n\nBelow is her full unedited letter to Chivayo:\n\nMakadii munhu waMwari Sir Wicknell vakachenesa chitendero cheMapostori, Madzibaba Chivayo. Ini zita ndinoitwa Ratidzai Mlambo (Mai Malandu).Ndino kumbirawo tsitsi dzenyu. Ndiri kutsvagawo rubatsiro rwemari yekuwandudza business rangu reJewelry, pekugara, nemota yekushandisa kuita business.\n\nI am a young lady ndoita zvekutengesa tengesa jewelry mu street maMutare ndichingofamba. So my passion or my dream is kunohodhawo kuChina sezvindinoona vamwe vachiita, and then I open a vibrant wholesale and retail shop in Mutare.\n\nNdakazvitanga 2010 zvekutengesa jewelry ndichiri kuUZ ndichiita degree rangu. So ndinoshuwirawo kuenda mberi. Zvemba nemota zvinenge zvave kwamuri henyu, asi chero chamungade kundibatsirawo nacho  handina chandinosarudza kuti ingava marii yamunoda kundibatsirawo nayo chero zvinenge zvareva mweya kwamuri. Ndingoriwo munhuwo zvake handisi kana celebrity renyika.\n\nNdinotarisirawo mhinduro yenyu nyoro Baba vangu, sekupihwa kwamuchangoitwawo nengirozi dzenyu. Mazvita \n\nRatidzais plea has resonated with many Zimbabweans who see her story as symbolic of the struggles of a generation of graduates forced to hustle informally despite their qualifications. It comes amid rising public criticism of the governments failure to create jobs or meaningful opportunities for the youth, even as the economy continues to decline under President Emmerson Mnangagwas leadership.\n\nHer appeal adds to growing calls for structural reform and renewed investment in education, job creation, and youth empowermentissues that remain largely unmet in Zimbabwes current socio-political climate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A young Zimbabwean woman, Ratidzai Mlambo, has taken to social media to appeal for financial help from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/05/how-mnangagwa-has-reduced-university-graduates-to-beggars-young-lady-appeals-for-financial-help-from-chivayo/\">Continue reading<span class=\"screen-reader-text\"> \"How Mnangagwa Has Reduced University Graduates to Beggars: Young Lady Appeals for Financial Help from Chivayo\"</span></a></p>",
            "time": "18:46",
            "date": "06 Jun 2025"
        }
    ]
}