{
    "news": [
        {
            "title": "Ken Sharpe: Building Dreams, Shaping Zimbabwe’s Urban Destiny",
            "url": "https://www.zimeye.net/2025/10/13/ken-sharpe-building-dreams-shaping-zimbabwes-urban-destiny/",
            "content": "By A CorrespondentIn the heart of Southern Africa, where opportunity meets resilience, one man is redefining the skyline  and the spirit  of Harare.\n\nKen Sharpe, CEO and founder ofWestProp Holdings, is not just constructing buildings; he is crafting a vision of modern living rooted in innovation, sustainability, and national pride. Yet, Sharpe remains humble, insisting the real heroes are his WestProp team  the drivers and movers of our shared vision, as he puts it.\n\nSince foundingWestPropin 2007, Sharpes mission has been clear: to give Zimbabweans world-class spaces to live, work, shop, and play. What began as a property development company has evolved into aplacemaking powerhouse, redefining what it means to live in an African city.\n\nFlagship developments such asPomona City,The Hills Luxury Golf Estate,Pokugara, andMillennium Heightsare more than residential projects  they arewalkable smart citiesthat integrate lifestyle, commerce, and community.\n\nSharpes bold One Billion Bricks by 2050 initiative is more than a slogan; its a national vision. With aUS$5 billion development pipelineand a vertically integrated supply chain includingBrick FusionandTrustprop, WestProp is driving industrial growth, creating thousands of jobs, and expanding housing access. Its a model of economic renewal  built, quite literally, brick by brick.\n\nSharpes philosophy is simple yet transformative:quality of life should be a standard, not a privilege. His developments embrace global best practices in architecture, sustainability, and urban planning  from solar energy and water recycling to central gas systems and high-speed internet  making WestProps communities both inclusive and future-ready.\n\nBeyond luxury, Sharpe buildsfor legacy. His projects balance aspiration with accessibility through tiered housing options and flexible financing models, including 10-year mortgages. This approach empowers families, entrepreneurs, and diaspora investors alike to participate in Zimbabwes urban revival.\n\nHis collaboration with theCity of Hararedemonstrates his commitment to public-private synergy. Through these partnerships, land value is unlocked, approvals streamlined, and transformative projects delivered. Sharpes success underscores thattrust, transparency, and shared visionare the foundations of resilient cities  not only in Zimbabwe but across Africa.\n\nWith theUS$100 million Mall of Zimbabweand theUS$380 million Golf Estateunderway, Sharpe is positioning Zimbabwe as a regional hub fortourism, lifestyle, and business. These landmark projects declare to the world:Zimbabwe is open, ambitious, and ready to lead.\n\nKen Sharpe is more than a chief executive  he is astoryteller, strategist, and stewardof Zimbabwes urban future. His work is a powerful testament to how real estate can drive growth, foster community, and elevate national identity.\n\nIn a continent brimming with potential, Ken Sharpe stands tall  a visionary whose billion bricks are building not just cities, buthope for generations to come.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — In the heart of Southern Africa, where opportunity meets resilience, one man is redefining the skyline — … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/ken-sharpe-building-dreams-shaping-zimbabwes-urban-destiny/\">Continue reading<span class=\"screen-reader-text\"> \"Ken Sharpe: Building Dreams, Shaping Zimbabwe’s Urban Destiny\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "Details Emerge on Zim-Bound SA Cross-Border Horror Crash",
            "url": "https://www.zimeye.net/2025/10/13/details-emerge-on-zim-bound-sa-cross-border-horror-crash/",
            "content": "By A Correspondent Authorities in Zimbabwe are yet to issue an official statement following the tragicbus accident that claimed at least 40 liveson theN1 highway near Makhado, in South Africas Limpopo Province, early Monday morning.\n\nThe ill-fated bus, which wastravelling from Gqeberha (formerly Port Elizabeth) to Harare, reportedly veered off the road before overturning nearIngwe Lodge, just outside Makhado, late Sunday evening.\n\nEmergency services and rescue teams rushed to the scene, where recovery operations continued into the early hours of Monday. Limpopo Provincial Transport Department spokespersonMatome Taueatsoalaconfirmed the crash, saying the exact cause of the tragedy was still under investigation.\n\nWe can confirm that a major accident involving a cross-border bus has occurred on the N1 near Ingwe Lodge, outside Makhado, on the way to Musina. The details of the accident are yet to be released, and MECViolet Mathyehas gone to the scene, said Taueatsoala.\n\nHe added that theN1 highwayhad beenclosed in both directions, with traffic being diverted to alternative routes.\n\nIf youre travelling from Makhado to Musina, please use theWitvlag turn-off; and if youre coming from Musina to Makhado, take theWilliespoort turn-off, he said.\n\nThe bus was believed to becarrying mainly Zimbabwean nationalsreturning home ahead of the holiday season.\n\nSouth African police, working closely withZimbabwean consular officials, have since launched efforts to identify the victims and assist survivors.\n\nTheLimpopo provincial governmenthas expressed condolences to the bereaved families, describing the incident as one of theworst cross-border road disastersin recent months.\n\nDetails regarding the exact number of survivors remain unclear, but preliminary investigations point tospeeding or mechanical failureas possible causes of the accident.\n\nZimbabwes Ministry of Foreign Affairs and International Trade was yet to comment by the time of going to print.\n\n(Source: eNCA and SABC)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Authorities in Zimbabwe are yet to issue an official statement following the tragic bus accident that claimed at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/details-emerge-on-zim-bound-sa-cross-border-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Details Emerge on Zim-Bound SA Cross-Border Horror Crash\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "40 Zimbabweans Feared Dead in South Africa Cross-Border Bus Crash",
            "url": "https://www.zimeye.net/2025/10/13/40-zimbabweans-feared-dead-in-south-africa-cross-border-bus-crash/",
            "content": "By A Correspondent At least40 Zimbabweans are feared deadand dozens more injured following a horrific bus crash on theN1 highway near Makhado, in South Africas Limpopo Province.\n\nThe bus, which was travelling fromGqeberha (formerly Port Elizabeth)toHarare, reportedly veered off the road before overturning nearIngwe Lodge, just outside Makhado, late Sunday evening.\n\nEmergency services rushed to the scene, where rescue operations were still underway by early Monday morning. Provincial Transport Department spokespersonMatome Taueatsoalaconfirmed the tragedy, saying the exact cause of the crash was still under investigation.\n\nWe can confirm that a major accident involving a cross-border bus has occurred on the N1 near Ingwe Lodge, outside Makhado, on the way to Musina. The details of the accident are yet to be released, and MECViolet Mathyehas gone to the scene, said Taueatsoala.\n\nHe added that theN1 highwayhad beenclosed in both directions, with traffic being diverted to alternative routes.\n\nIf youre travelling from Makhado to Musina, please use theWitvlag turn-off; and if youre coming from Musina to Makhado, take theWilliespoort turn-off, Taueatsoala said.\n\nThe bus was believed to be carrying mainlyZimbabwean nationalsreturning home ahead of the holiday season.\n\nPolice and road traffic authorities are working with Zimbabwean consular officials to identify the victims and assist survivors.\n\nTheLimpopo provincial governmenthas expressed condolences to the bereaved families, describing the crash as one of theworst cross-border road disastersin recent months.\n\nDetails surrounding the number of survivors and the cause of the accident remain sketchy, but authorities say preliminary investigations suggestspeeding or mechanical failurecould have been contributing factors.\n\n(Source: eNCA and SABC)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — At least 40 Zimbabweans are feared dead and dozens more injured following a horrific bus crash on the N1 highway … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/40-zimbabweans-feared-dead-in-south-africa-cross-border-bus-crash/\">Continue reading<span class=\"screen-reader-text\"> \"40 Zimbabweans Feared Dead in South Africa Cross-Border Bus Crash\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "Top Cop Revolts Against ED",
            "url": "https://www.zimeye.net/2025/10/13/top-cop-revolts-against-ed/",
            "content": "By A Correspondent In a rare act of defiance, a former Zimbabwe Republic Police (ZRP) officer,Togara Fambi, has broken ranks with the establishment to form a new political party, theNational Progressive Democrats (NPD) declaring open resistance to PresidentEmmerson Mnangagwasrule andZANU PFs decades-long politicisation of the security sector.\n\nThe NPD was launched on Wednesday in Harare under the theme,Building a Capable Democratic Developmental State to Empower Citizens and Improve Living Standards.\n\nFambi, who retired from the police force inJuly 2025, said his decision to step into politics came after his dismissal for criticizing the governments priorities. He had condemned the state forsending humanitarian aid to Mozambiquewhile millions of Zimbabweans continued to suffer from poverty, hunger, and joblessness. Shortly after making the remarks, Fambi was expelled fromChikato Police Campin Masvingo.\n\nThe NPD is not an offshoot or continuation of any existing political party, Fambi said at the launch. It is born from the peoples consensus that the current ZANU PF system is corrupt, corrosive, and oppressive. We have lived for too long under a regime that mistakes fear for loyalty.\n\nHe also slammed Zimbabwes partnerships withChinese mining companies, accusing them of plundering the nations mineral wealth and destroying communities. If we do not act wisely at the ballot, the Sino-Zim relations will continue to erode our minerals and devastate our environment. Unsustainable mineral extraction and exploitation of our people by Chinese firms continues unchecked. The effects will be felt for generations unless we stand up now and end this madness, he said.\n\nFambi said his new party envisions aZimbabwe free from the grip of a militarised elite, built instead on transparency, fairness, and people-centred governance.\n\nFambis political rebellion comes against the backdrop ofZANU PFs entrenched control over Zimbabwes security establishment, a relationship that has shaped the countrys political landscape since independence in 1980.\n\nUnderRobert Mugabe, the ruling party systematicallyblurred the line between state security and party politics, with the police, army, and intelligence services openly participating in political campaigns, intimidation, and election manipulation. TheJoint Operations Command (JOC) a security coordination body bringing together the heads of the army, police, and intelligence  became thede facto political enginethat safeguarded ZANU PFs rule.\n\nDuring the2000s, especially after the formation of theMovement for Democratic Change (MDC), the security sector played a direct role insuppressing dissent, using violence, arbitrary arrests, and propaganda to weaken opposition movements. Senior officers, including police commanders and army generals, publicly declared that they wouldnever salute anyone without liberation war credentials,effectively disqualifying opposition leaders from ever gaining legitimate power.\n\nWhen Mnangagwa took power in2017through amilitary-assisted transition, the security forces once again played kingmaker  this time turning their guns on Mugabe to install one of their own. Since then, Mnangagwas government hasrewarded military and police elites with top government and diplomatic positions, deepening their political entanglement with ZANU PF.\n\nAnalysts argue that this militarisation of governance hasundermined professionalism within the security servicesand left officers like Fambi disillusioned. His public defiance therefore signals growing internal frustration among rank-and-file members who feel used as instruments of political repression rather than protectors of national integrity.\n\nThe formation of theNational Progressive Democratsthus represents more than just another political party  it symbolizes arare rupture within Zimbabwes security establishmentand could test ZANU PFs ability to maintain loyalty among forces long treated as its political insurance.\n\nAs Fambi put it: We served our country with loyalty, but loyalty should never mean silence in the face of injustice. It is time to reclaim our nation from fear.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — In a rare act of defiance, a former Zimbabwe Republic Police (ZRP) officer, Togara Fambi, has broken ranks … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/top-cop-revolts-against-ed/\">Continue reading<span class=\"screen-reader-text\"> \"Top Cop Revolts Against ED\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "Mwonzora Faces Arrest",
            "url": "https://www.zimeye.net/2025/10/13/mwonzora-faces-arrest/",
            "content": "By A Correspondent-MDC-T president Douglas Mwonzora is facing legal trouble after a Harare magistrate issued a warrant of arrest against him for allegedly failing to pay child maintenance for five months.\n\nThe court had ordered Mwonzora in February 2024 to pay US$500 per month for the upkeep of his 10-year-old son with Getrude Chuma, along with school fees. However, he reportedly defaulted between March and July, accumulating arrears of US$2,500. The amount has since risen to US$3,500 after he allegedly missed payments for August and September.\n\nAlthough the warrant was issued almost two months ago, police have not yet executed it, and inquiries to Harare Central Police for clarification have been unsuccessful.\n\nMwonzora, quoted byMasvingo Mirror, said he was unaware of the development. I havent received the warrant of arrest you are talking about. I dont deserve any warrant. This is a sniff campaign, he said.\n\nChuma is said to be unhappy with the continued failure by police to act on the warrant, which has not been served on Mwonzora despite several attempts.\n\nPolice sources confirmed that the case, registered under number M389, remains active, though no arrest has been made to date.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-MDC-T president Douglas Mwonzora is facing legal trouble after a Harare magistrate issued a warrant of arrest against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/mwonzora-faces-arrest/\">Continue reading<span class=\"screen-reader-text\"> \"Mwonzora Faces Arrest\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "New Passport Offices To Open In London",
            "url": "https://www.zimeye.net/2025/10/13/new-passport-offices-to-open-in-london/",
            "content": "By A Correspondent The Zimbabwean government has announced plans to open new e-passport offices inLondonandBotswanabefore the end of the year, in a move aimed at improving access to travel documents for citizens at home and abroad.\n\nThe expansion is part of government efforts to establishstate-of-the-art e-passport enrolment centreslocally and across borders, providing greater convenience to Zimbabweans in the diaspora.\n\nSince the introduction of the electronic passport in January 2022, the Registrar-Generals Office has issuedover 1.6 million e-passportsboth within Zimbabwe and in the region  a development officials say underscores significant progress in modernising the countrys documentation system.\n\nRegistrar-GeneralMr. Henry MachiritoldThe Heraldthat 17 offices had been opened across the country, whileJohannesburgremains the only foreign location currently offering e-passport services.\n\nThe Government started issuing e-passports in January 2022, and as of October 10 this year, 1,687,899 e-passports have been issued, said Mr. Machiri.\n\nLocally, passports are issued in Harare, Bulawayo, Marondera, Murehwa, Chitungwiza, Chinhoyi, Chipinge, Mazowe, Mwenezi, Gwanda, Beitbridge, Lupane, Hwange, Gweru, Gokwe, Zvishavane and Mutare  which began operations on September 25, 2025. Outside Zimbabwe, we currently have Johannesburg only.\n\nHe added that preparations were underway to open new centres inHwedza,London, andBotswanabefore year-end  countries with some of the highest numbers of Zimbabweans living abroad.\n\nThe initiative aligns with the governments ongoing diplomatic infrastructure projects. During a post-Cabinet briefing in August, Information MinisterDr. Jenfan Muswereconfirmed that Zimbabwe is constructing new diplomatic missions inthe United Kingdom, Nigeria, and Mozambique, with the new mission house in London set to include an e-passport office.\n\nThe construction of the Zimbabwe-Abuja Chancery, Official Residence and Staff Apartments has reached 65 percent of completion, Dr. Muswere said.The renovation of the Zimbabwe-Pretoria Staff House is 60 percent complete, while the renovation of the Zimbabwe-Cape Town Chancery is at 50 percent. The construction of the Zimbabwe-London Official Residence and electrical works at the Beira Chancery are ongoing.\n\nPresenting the2025 National Budget, Finance and Economic Development MinisterProfessor Mthuli Ncubesaid Government had allocatedZiG $4 billionto support the countrys image-building, engagement, and re-engagement agenda. This includes the establishment of an additional mission office inNew York, USA.\n\nThe governments expansion drive also responds to long-standing recommendations by theZimbabwe Human Rights Commission (ZHRC). In its 2020 report,National Inquiry on Access to Documentation in Zimbabwe,the ZHRC urged the state to develop anational policy on access to documentationanddecentralise the Registrar-Generals Office servicesto improve efficiency and inclusivity.\n\nThe report also called for regular, well-funded mobile registration exercises and alignment of internal documentation procedures with devolution principles underSection 264 of the Constitutionto enhance accessibility, particularly for marginalized communities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The Zimbabwean government has announced plans to open new e-passport offices in London and Botswana before the end of the year, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/new-passport-offices-to-open-in-london/\">Continue reading<span class=\"screen-reader-text\"> \"New Passport Offices To Open In London\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "While Mutsvangwa Defends Regime’s Continuity, Mliswa Plays Up As its Moral Reformer | Sibangilizwe Moyo",
            "url": "https://www.zimeye.net/2025/10/13/while-mutsvangwa-defends-regimes-continuity-mliswa-plays-up-as-its-moral-reformer-sibangilizwe-moyo/",
            "content": " TEMBA MLISWA: THE SABHUKU AT ZANU-PFS GATE  NEW ANALYSIS BY DR SIBANGILIZWE MOYO\n\nBy A Correspondent\n\nIn a thought-provoking analysis titled Temba Mliswa: The Sabhuku at ZANU-PFs Gate Amid Succession Turmoil, political analyst Dr Sibangilizwe Moyo dissects the restless presence of former Norton legislator Temba Mliswa within Zimbabwes turbulent political ecosystem  painting him as the symbolic Sabhuku, a self-appointed custodian standing at the threshold of ZANU-PFs inner sanctum.\n\nDr Moyo argues that Mliswas political behaviour  half critic, half loyalist  mirrors the village headman archetype who chastises his community not to rebel, but to restore his own moral authority within it.\n\nIn the shifting terrain of ZANU-PFs internal dynamics, writes Dr Moyo, a new silhouette has appeared  not the ghostly figure of a rural headman, but a man of bold pronouncements and restless ambition.\n\n A Return to the Fold  or a Bid for Power?\n\nDr Moyo suggests that despite his repeated claims of independence, Mliswa has never escaped ZANU-PFs gravitational field. His vocabulary remains firmly rooted in liberation-era rhetoric  discipline, loyalty, and patriotism  suggesting that he still identifies with the movements ideological DNA.\n\nHis criticisms, Moyo observes, are not aimed at dismantling the house, but at inheriting a room within it.\n\nThe analysis posits that Mliswas recent commentaries on corruption and governance may, in fact, be auditions for a renewed role in ZANU-PFs post-Mnangagwa configuration  a political recalibration disguised as reformist outrage.\n\n The Unappointed Spokesman\n\nIn one of his sharpest insights, Dr Moyo compares Mliswas current visibility to that of Christopher Mutsvangwa, the partys official spokesperson. Mutsvangwa, known for his fiery loyalty, has long embodied the establishments voice  but Dr Moyo questions whether his dominance is now under challenge.\n\nHe notes that Mliswa has begun to speak with the authority of a de facto spokesman  not by appointment, but by assertion.\n\nThis parallel, Moyo argues, reveals a subtle power play: while Mutsvangwa defends the regimes continuity, Mliswa presents himself as its moral reformer  both fighting for relevance in a party where visibility equals survival.\n\n Succession Shadows and Strategic Positioning\n\nDr Moyo situates Mliswas manoeuvres within the broader succession anxiety consuming ZANU-PF. As President Mnangagwa consolidates power, the question of what happens next hovers ominously. In this silence, opportunists like Mliswa emerge  balancing critique and conformity to remain politically bankable.\n\nMliswa is neither inside nor fully outside, Moyo writes. His utility lies in his ability to straddle the boundary between reform and loyalty  a liminal figure rehearsing for re-entry.\n\n The Art of Ambiguity\n\nThe analysis describes Mliswas method as one of strategic ambiguity  condemning corruption like a reformist while affirming patriotism like a loyalist. This dual posture, Dr Moyo notes, allows him to remain relevant to all factions and dangerous to none.\n\nIs this not the essence of the Sabhuku, he asks, the figure who commands both fear and respect, who polices boundaries while bending rules to his advantage?\n\n The Theatre of Power\n\nDr Moyo contextualises Mliswas public outbursts and constant media engagement as performances of political endurance  a survival mechanism in a country where invisibility equals extinction.\n\nEvery tweet, press statement, or televised rant, he argues, is a coded message to ZANU-PFs strategists: a reminder that Mliswa remains a useful messenger, capable of mobilising the restless middle ground while still speaking the partys dialect.\n\n Mutsvangwa, Mnangagwa, and the Shadow Game\n\nMoyos essay also revisits the relationship between Mliswa, Mutsvangwa, and Mnangagwa  casting them as players in a subtle succession rehearsal.\n\nMliswas posture, he suggests, is not an attack on Mutsvangwa, but a demonstration that he could play that role  perhaps with more finesse.\n\nMnangagwa, in this reading, presides over the spectacle like a chess master  letting his subordinates spar rhetorically as he tests their endurance and loyalty for the post-2028 political chapter.\n\n Loyalty, Dissent, and the ZANU-PF Paradox\n\nDr Moyo highlights a recurring pattern in ZANU-PFs history: dissenters are rarely expelled forever. The partys strength, he writes, has always lain in its capacity to absorb dissent and reconstitute it as loyalty.\n\nCould Mliswas current positioning, therefore, be another act of strategic repentance  a way to signal readiness for reabsorption into the system he critiques?\n\nOr has ZANU-PFs ideological cohesion dissolved so completely that figures like Mliswa are now performing for a party that no longer knows what it believes in?\n\n Renewal or Repetition?\n\nUltimately, Dr Moyo questions whether Mliswas resurgence represents a genuine generational renewal or merely another rotation in Zimbabwes endless theatre of power.\n\nEach new phase brings its own Sabhuku  the figure who promises reform but perpetuates continuity under a new guise.\n\nThe analysis closes with a haunting question:\n\nCan any political system survive when every critic secretly longs for a seat at the table they denounce?\n\nIn Summary:Dr Sibangilizwe Moyos essay positions Temba Mliswa as both a mirror and a symptom of ZANU-PFs enduring political culture  where rebellion often masks ambition, and loyalty remains the ultimate currency.\n\nAs the ruling party edges toward an uncertain succession, the Sabhuku at the gate may yet find his way back inside.\n\nAuthor Note:Dr Sibangilizwe Moyo writes on Church and Governance, politics, legal and social issues.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "📰 TEMBA MLISWA: THE SABHUKU AT ZANU-PF’S GATE — NEW ANALYSIS BY DR SIBANGILIZWE MOYO By A Correspondent In a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/while-mutsvangwa-defends-regimes-continuity-mliswa-plays-up-as-its-moral-reformer-sibangilizwe-moyo/\">Continue reading<span class=\"screen-reader-text\"> \"While Mutsvangwa Defends Regime’s Continuity, Mliswa Plays Up As its Moral Reformer | Sibangilizwe Moyo\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "Former Police Officer’s Party Seeks to Break ZANU PF’s Grip on Power",
            "url": "https://www.zimeye.net/2025/10/13/former-police-officers-party-seeks-to-break-zanu-pfs-grip-on-power/",
            "content": "By A Correspondent\n\nFormer Zimbabwe Republic Police officer Togara Fambi has stepped into politics with the launch of his new party, the National Progressive Democrats (NPD), which he says will directly challenge ZANU PFs long-standing hold on power.\n\nThe NPD was launched on Wednesday in Harare under the theme, Building a capable democratic developmental state to empower citizens and improve living standards.\n\nFambi, who retired from the police force in July 2025, said his departure followed his public criticism of the government for sending humanitarian aid to Mozambique while many Zimbabweans continue to face extreme poverty. He was reportedly expelled from Chikato Police Camp in Masvingo soon after making the remarks.\n\nSpeaking at the launch, Fambi said the NPD was formed out of the peoples frustration with decades of misrule. The NPD is not an offshoot or continuation of any existing political party. It is born from the peoples consensus that the current ZANU PF system is corrupt, corrosive, and oppressive, he said.\n\nHe went on to criticize Zimbabwes partnerships with Chinese mining companies, saying they have contributed to environmental destruction and the looting of national resources. If we do not act wisely at the ballot, the Sino-Zim relations will continue to erode our minerals and devastate our environment. Unsustainable mineral extraction, exploitation of our people, and resource expropriation by Chinese firms continues unchecked. The effects will be felt for generations unless we stand up now and put an end to this madness, Fambi said.\n\nHe added that the NPD envisions a Zimbabwe free from the grip of the present dictatorial elite and committed to building a fair, accountable, and inclusive government.\n\nThe launch of the NPD marks the entry of a new political force determined to disrupt the status quo and give Zimbabweans an alternative voice ahead of the next elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Zimbabwe Republic Police officer Togara Fambi has stepped into politics with the launch of his new … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/former-police-officers-party-seeks-to-break-zanu-pfs-grip-on-power/\">Continue reading<span class=\"screen-reader-text\"> \"Former Police Officer’s Party Seeks to Break ZANU PF’s Grip on Power\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "Mwonzora in Hot Soup Over Maintenance Row",
            "url": "https://www.zimeye.net/2025/10/13/mwonzora-in-hot-soup-over-maintenance-row/",
            "content": "By A Correspondent\n\nMDC-T president Douglas Mwonzora is facing legal trouble after a Harare magistrate issued a warrant of arrest against him for allegedly failing to pay child maintenance for five months.\n\nThe court had ordered Mwonzora in February 2024 to pay US$500 per month for the upkeep of his 10-year-old son with Getrude Chuma, along with school fees. However, he reportedly defaulted between March and July, accumulating arrears of US$2,500. The amount has since risen to US$3,500 after he allegedly missed payments for August and September.\n\nAlthough the warrant was issued almost two months ago, police have not yet executed it, and inquiries to Harare Central Police for clarification have been unsuccessful.\n\nMwonzora, quoted byMasvingo Mirror, said he was unaware of the development. I havent received the warrant of arrest you are talking about. I dont deserve any warrant. This is a sniff campaign, he said.\n\nChuma is said to be unhappy with the continued failure by police to act on the warrant, which has not been served on Mwonzora despite several attempts.\n\nPolice sources confirmed that the case, registered under number M389, remains active, though no arrest has been made to date.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MDC-T president Douglas Mwonzora is facing legal trouble after a Harare magistrate issued a warrant of arrest … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/13/mwonzora-in-hot-soup-over-maintenance-row/\">Continue reading<span class=\"screen-reader-text\"> \"Mwonzora in Hot Soup Over Maintenance Row\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        },
        {
            "title": "Bus Accident as DNC Bus Plunges Down Cliff Near De Doorns — Driver Confirmed Dead",
            "url": "https://www.zimeye.net/2025/10/12/bus-accident-as-dnc-bus-plunges-down-cliff-near-de-doorns-driver-confirmed-dead/",
            "content": "By A Correspondent | A DNC cross-border bus travelling from Bloemfontein has plunged down a steep embankment near De Doorns, leaving a scene of devastation and grief along the mountainous stretch of road.\n\nPreliminary eyewitness footage shows the bus lying upside down in a deep ravine, with wreckage scattered across the dry terrain as survivors and bystanders scramble to render aid.\n\nAccording to early social media reports, the driver has been confirmed dead at the scene. The extent of injuries among passengers remains unclear, though rescue operations are ongoing.\n\nOne passenger, commenting on Facebook, wrote:\n\nZvazvakaoma nhai Mwari, tine parcel yatakatumira ne bus iri kubva Bloemfontein.\n\nAnother lamented:\n\nPakuti rinomhanyawo sei iro DNC mmm, Mwari pindirai.\n\nThe accident reportedly occurred along a notoriously dangerous curve in De Doorns, where several previous crashes have been recorded due to sharp turns and high speeds.\n\nWitnesses described scenes of chaos as locals rushed to help the injured while others filmed the aftermath. The overturned bus, bearing DNC markings, appeared to have lost control before tumbling down the escarpment.\n\nDistraught relatives have flooded social media seeking updates on their loved ones and parcels sent aboard the ill-fated bus.\n\nEmergency responders and police are yet to issue an official statement, but unverified reports indicate multiple casualties.\n\nAs the festive season approaches, Zimbabweans and South Africans alike are urging long-distance transport operators to tighten speed controls and vehicle maintenance amid a worrying rise in cross-border bus accidents.\n\n Developing Story  ZimEye will update as official rescue and casualty details emerge.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A DNC cross-border bus travelling from Bloemfontein has plunged down a steep embankment near De Doorns, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/12/bus-accident-as-dnc-bus-plunges-down-cliff-near-de-doorns-driver-confirmed-dead/\">Continue reading<span class=\"screen-reader-text\"> \"Bus Accident as DNC Bus Plunges Down Cliff Near De Doorns — Driver Confirmed Dead\"</span></a></p>",
            "time": "18:01",
            "date": "13 Oct 2025"
        }
    ]
}