{
    "news": [
        {
            "title": "Kapfupi In Terrible Accident",
            "url": "https://www.zimeye.net/2024/12/23/kapfupi-in-terrible-accident/",
            "content": "By A Correspondent\n\nPopular comedian and musician Freddy Manjalima, widely known by his stage name Kapfupi, has been involved in a serious road accident.\n\nThe news of the crash has left fans and the entertainment community deeply concerned about his well-being.\n\nThe information about the incident was shared by Kapfupis close friend, renowned DJ Shugeta, who took to his official Facebook page to express his thoughts and prayers for the popular figure. Prayers and thoughts to my brother Kapfupi asangana netsaona.\n\nAhana kunyanyokuvara hake asi musoro nechest ndozvirikumusimbira panguva ino. Get well soon Chibaba, DJ Shugeta posted on Monday.\n\nTranslated, this message reads: Prayers and thoughts to my brother Kapfupi, he has been involved in an accident. He hasnt suffered major injuries, but his head and chest are the areas of concern at the moment. Get well soon, Chibaba.\n\nSources close to the situation revealed that Kapfupi was driving a vehicle that had been provided to him by the controversial Zanu PF businessman Wicknell Chivayo. The crash has raised questions, particularly about the circumstances surrounding the accident, but details remain limited at this stage.\n\nFans and fellow artists alike have expressed their support for Kapfupi, sending him well-wishes for a swift recovery. As more information emerges, the public eagerly awaits updates on his condition.\n\nKapfupi, known for his vibrant presence in the music and comedy scenes, has become a beloved figure in Zimbabwes entertainment industry. His fans are hoping that this unfortunate incident does not hinder his career or spirit.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Popular comedian and musician Freddy Manjalima, widely known by his stage name Kapfupi, has been involved in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/kapfupi-in-terrible-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Kapfupi In Terrible Accident\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Magaya Kicked Out Of ZIFA Presidential Race",
            "url": "https://www.zimeye.net/2024/12/23/magaya-kicked-out-of-zifa-presidential-race/",
            "content": "By Sports Reporter-Self-proclaimed prophet, Walter Magaya has been disqualified from contesting the ZIFA presidential elections, along with CAPS United owner Farai Jere and former Norton MP Themba Mliswa.\n\nZIFAs Ethics Committee announced the disqualifications on Tuesday, citing Article 85(9) of the ZIFA Statutes, 2024, which outlines eligibility criteria for candidates.\n\nHowever, the football governing body did not disclose specific reasons for their ineligibility.\n\nMagayas attempt to enter the football administration has been controversial, given his history of scandals in both business and religious circles.\n\nCritics questioned his suitability for the role, pointing to past allegations of financial impropriety, unfulfilled promises in his ventures, and dubious spiritual claims.\n\nHis disqualification adds to a growing list of setbacks for the preacher-turned-entrepreneur.\n\nZIFA released the names of candidates who successfully met the eligibility requirements.\n\nAmong the presidential hopefuls are Marshall Gore, Philemon Machana, and Nqobile Magwizi. Vice-presidential candidates include Mavis Gumbo, Kennedy Ndebele, and Omega Sibanda.\n\nThis election marks a critical juncture for ZIFA as the association aims to rebuild its tarnished image and restore credibility in Zimbabwean football governance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter-Self-proclaimed prophet, Walter Magaya has been disqualified from contesting the ZIFA presidential elections, along with CAPS United owner … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/magaya-kicked-out-of-zifa-presidential-race/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Kicked Out Of ZIFA Presidential Race\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mondlane Calls for 5-Day Shutdown, After Mnangagwa’s Chapo Declared Winner with 65%",
            "url": "https://www.zimeye.net/2024/12/23/mondlane-calls-for-5-day-shutdown-after-mnangagwas-chapo-declared-winner-with-65/",
            "content": "Maputo, Mozambique  Monday, December 23, 2024\n\nOpposition presidential candidate Venncio Mondlane has issued a bold call for a nationwide five-day shutdown from Monday to Friday, urging Mozambicans to reflect on the countrys future. In a live broadcast on his Facebook page, Mondlane made a passionate appeal to citizens, framing the moment as critical in the fight against what he described as a corrupt and oppressive regime.\n\nA Unique Opportunity for Mozambique\n\nThis is not a week for work, declared Mondlane during the broadcast. From today until Friday, let us take this time for deep reflection on the future of our country. Its time to open our eyes. This is a unique opportunity.\n\nMondlane called for citizens to consider the path Mozambique has taken, highlighting concerns over governance, economic stability, and human rights.\n\nEconomic Criticism and Financial Concerns\n\nThe opposition leader also questioned recent government actions, particularly the payment of retroactive salaries to public servants and members of the armed forces. After this, where will your salaries come from? Think wisely and intelligently. Lets not be nave, he said, raising doubts about the countrys financial sustainability.\n\nSharp Criticism of Governance and Corruption\n\nMondlane did not mince words in his condemnation of the current administration, accusing it of fostering a culture of corruption, poor governance, and human rights violations.\n\nLet us see if from the mouth of Lcia Ribeiro [President of the Constitutional Council] will come grenades, explosives, AKM bullets, or tear gas. They will decide if this country continues on the path of dictatorship, assassinations, death squads, corruption, scams, thefts, kidnappings, and abductions, he said. Will we continue to live on crumbs? We are drowning in misery, poor governance, and corruption.\n\nElection Results and Public Discontent\n\nMondlanes remarks come on the heels of the Constitutional Councils announcement declaring Daniel Chapo as the winner of the presidential election with 65% of the vote. The opposition has disputed the results, citing irregularities and discrepancies in the electoral process. Civil society organizations and observers have also voiced concerns, further intensifying public discontent.\n\nNation on Edge\n\nThe call for a shutdown has raised fears of unrest as Mozambique grapples with the aftermath of a contentious election. Mondlanes inflammatory rhetoric and direct criticism of the government are likely to galvanize his supporters but may also deepen divisions within the country.\n\nLooking Ahead\n\nAs the five-day shutdown begins, Mozambique faces an uncertain and potentially volatile week. Citizens, opposition parties, and the government await further developments, including the Constitutional Councils responses to lingering complaints and appeals.\n\nThe nation now stands at a crossroads, with many questioning whether the current leadership can address the mounting challenges or whether it will face intensified resistance from the opposition and the public.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Maputo, Mozambique — Monday, December 23, 2024 Opposition presidential candidate Venâncio Mondlane has issued a bold call for a nationwide … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/mondlane-calls-for-5-day-shutdown-after-mnangagwas-chapo-declared-winner-with-65/\">Continue reading<span class=\"screen-reader-text\"> \"Mondlane Calls for 5-Day Shutdown, After Mnangagwa’s Chapo Declared Winner with 65%\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mozambique’s Constitutional Council Declares Daniel Chapo Winner of Controversial Election",
            "url": "https://www.zimeye.net/2024/12/23/mozambiques-constitutional-council-declares-daniel-chapo-winner-of-controversial-election/",
            "content": "By A Correspondent\n\nDaniel Chapo has been officially declared the winner of Mozambiques contentious October elections and will serve as the countrys next president. The Constitutional Council confirmed Chapos victory, stating he secured 65.17% of the vote, a revised figure down from the initial 70% announced immediately after the election.\n\nSubsequently, on 20 Nov 2024, 1 resource from the Podemos party entered the CNE, invoking the annulment of presidential elections results in the diaspora in the Republic of Zimbabwe for alleged irregularities, the request in question was rejected due to impunity and lack of priorpic.twitter.com/S9LT8rN8sL\n\nThe Council also reported that the main opposition leader, Venncio Mondlane, received 24.19% of the vote. Mondlane, in response to the expected announcement, had called for a five-day protest shutdown just before the ruling was made.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Daniel Chapo has been officially declared the winner of Mozambique’s contentious October elections and will serve as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/mozambiques-constitutional-council-declares-daniel-chapo-winner-of-controversial-election/\">Continue reading<span class=\"screen-reader-text\"> \"Mozambique’s Constitutional Council Declares Daniel Chapo Winner of Controversial Election\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Guardiola Speaks On Manchester City Woes",
            "url": "https://www.zimeye.net/2024/12/23/guardiola-speaks-on-manchester-city-woes/",
            "content": "Sports Correspondent\n\nManchester City manager Pep Guardiola has admitted that there are multiple underlying factors contributing to his teams poor results, beyond just injuries.\n\nCity suffered another defeat in the Premier League on Saturday, losing 2-1 to Aston Villa. Guardiolas side had a difficult start, conceding an early goal from Jhon Duran, and Villa extended their lead in the second half with a goal from Morgan Rogers. Phil Fodens stoppage-time goal was only a consolation.\n\nThe loss saw Manchester City drop to sixth place in the league, now nine points behind leaders Liverpool.\n\nGuardiola reflected on the performance, saying, Of course, there are more reasons. We concede goals we didnt concede in the past, and were not scoring the goals we used to. Football isnt about one single reason; there are many small factors at play.\n\nHe continued, Aston Villa are performing well in both the Champions League and Premier League. Its a tough place to visit. Last season, we won the Premier League, but we lost here.\n\nDespite the setbacks, Guardiola expressed confidence in his team, adding, We must remain positive. I have immense trust in these players. Some have incredible pride and a strong desire to succeed. We need to find a way, step by step, to turn things around.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Manchester City manager Pep Guardiola has admitted that there are multiple underlying factors contributing to his team’s poor … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/guardiola-speaks-on-manchester-city-woes/\">Continue reading<span class=\"screen-reader-text\"> \"Guardiola Speaks On Manchester City Woes\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mozambique: Daniel Chapo Declared President With 65%",
            "url": "https://www.zimeye.net/2024/12/23/mozambique-daniel-chapo-declared-president-with-65/",
            "content": "Mozambique: Daniel Chapo declared as the President of Mozambique with approximately 65% of the vote.\n\nBy A Correspondent | ZimEye | \nMaputo, Mozambique  Monday, December 23, 2024\nMozambiques Constitutional Council addressed the nation today, offering explanations for the delays in validating the results of the recent general elections, citing an overwhelming number of complaints and discrepancies. The Council, led by President Lucia Ribeiro, provided detailed responses to each complaint and appeal, shedding light on the contentious issues surrounding the electoral process.\n\n\nElection Complaints and Irregularities\n\nLucia Ribeiro began by outlining the context of the elections, including the total number of registered voters and the turnout rates. She acknowledged discrepancies in voter numbers, which opposition parties and civil society groups have flagged as potential indicators of fraud. Notably, civil society observers refused to share their reports, citing fears of being implicated in what they described as a fraudulent process.\n\nSubsequently, on November 20, 2024, one appeal from the Podemos party was submitted to the National Elections Commission (CNE), invoking the annulment of presidential election results in the diaspora in the Republic of Zimbabwe for alleged irregularities. The request in question was rejected due to lack of evidence and failure to meet procedural requirements, said Ribeiro.\n\nOpposition Concerns and Civil Society Stance\n\nThe opposition has been vocal in its criticism of the election process, with multiple appeals submitted to the Constitutional Council. The President of the Council described the content of these appeals as varied but largely focused on discrepancies in voter data and procedural flaws.\n\nAdding to the complexity, civil society organizations have refused to cooperate fully, arguing that they do not want to legitimize what they perceive as a flawed election process. This refusal has further strained the credibility of the electoral outcome.\n\nElection Results Announced\n\nAmid the controversies, the Constitutional Council officially declared Daniel Chapo as the President of Mozambique with approximately 65% of the vote. This figure marks a decrease from earlier projections, which had placed his support at 70%. The adjustment in numbers was attributed to ongoing scrutiny of voter data.\n\n\n\nCalls for Shutdown and Growing Tensions\n\nCommunicating hours before the announcement, opposition candidate Venncio Mondlane called for a nationwide five-day shutdown starting Monday. He urged citizens to protest what he described as a deeply compromised election process. The call for action has sparked concerns over potential unrest in the days ahead.\n\nLooking Ahead\n\nAs Mozambique grapples with the aftermath of its contentious election, the Constitutional Council has pledged to provide clarity on each complaint and appeal. However, with civil societys refusal to engage and the opposition mobilizing public protests, the path forward remains uncertain.\n\nThe nation now waits to see how the government and opposition will navigate this critical juncture in Mozambiques democratic journey.- ZimEye\n\nSubsequently, on 20 Nov 2024, 1 resource from the Podemos party entered the CNE, invoking the annulment of presidential elections results in the diaspora in the Republic of Zimbabwe for alleged irregularities, the request in question was rejected due to impunity and lack of priorpic.twitter.com/S9LT8rN8sL\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mozambique: Daniel Chapo declared as the President of Mozambique with approximately 65% of the vote. By A Correspondent | ZimEye … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/mozambique-daniel-chapo-declared-president-with-65/\">Continue reading<span class=\"screen-reader-text\"> \"Mozambique: Daniel Chapo Declared President With 65%\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Dangers of Distraction: A Single Glance Can Change Everything",
            "url": "https://www.zimeye.net/2024/12/23/dangers-of-distraction-a-single-glance-can-change-everything/",
            "content": "Weve all been therechecking an incoming text or email while on the road, convinced that a quick glance wont cause any harm.\n\nYet, it only takes that one moment of distraction to change everything.\n\nEvery time we take our eyes off the road, even for a fraction of a second, we risk our lives and the lives of others.\n\nDistractions, whether from a phone, adjusting the radio, or talking to a passenger, can have fatal consequences.\n\nStay focused and committed to driving distraction-free.\n\nPrioritize safety over convenience, because in that split second, everything can change.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "We’ve all been there—checking an incoming text or email while on the road, convinced that a quick glance won’t cause … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/dangers-of-distraction-a-single-glance-can-change-everything/\">Continue reading<span class=\"screen-reader-text\"> \"Dangers of Distraction: A Single Glance Can Change Everything\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Another Christmas Without Cheer For Troubled Marry Mubaiwa",
            "url": "https://www.zimeye.net/2024/12/23/another-christmas-without-cheer-for-troubled-marry-mubaiwa/",
            "content": "Unforgiving Chiwenga spoils Marys Christmas\n\nBy Tapiwa Gokoma| As the twinkling lights of Harares festive decor begin to illuminate the bustling city, for many, Christmas is a time of joy, community gatherings, and family traditions. Yet for Mary Chiwenga, the former wife of Zimbabwes Vice President Constantino Chiwenga, this season carries a heavy weight. Mary is facing the Christmas without her children, who are spending the holiday with their unforgiving father.\n\nMary is now perceived by many as a helpless woman grappling with a life of emotional and psychological distress under the weight of her husbands political authority. While Vice President Chiwenga stands tall in the public eye, his wifes narrative unfolds in the whispers of the streets and the concerned tones of local activists, where discussions grow around her deteriorating circumstances.\n\nEven some churches are saying people must pray for Mary who continue to suffer in the hands of his ruthless exhusband. Some are even calling for for help as she is agonizing.\n\nThis separation has ignited discussions within womens organizations and local churches, expressing solidarity with Mary while criticizing the system that has led to her current grief.\n\nDespite her efforts, she has been unable to see her children, who are currently in the custody of her powerful and politically connected husband.\n\nHer arm and leg was amputed this year but his unforgiving husband continue to cause more pain by denying her acesss to her kids.\n\nThe couples marriage has been marred by controversy, with Mary Chiwenga alleging abuse and mistreatment.\n\nChiwengas plight has sparked widespread sympathy. Many have taken to social media to express their support for her, using hashtags such as #JusticeForMaryChiwenga.\n\nSome members of the community have been vocal about their disappointment in Vice President Chiwenga, calling for him to engage more constructively with Mary and to prioritize the well-being of their children.\n\nChildren deserve stability and love from both parents, asserts a representative from a certain women organisation who refused to be mentioned. During these holidays, they should not be caught in political games but rather be surrounded by love.\n\nThis collective voice adds to a growing sentiment among activists calling for greater accountability among public figures in relation to their familial duties.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Unforgiving Chiwenga spoils Mary’s Christmas By Tapiwa Gokoma| As the twinkling lights of Harare’s festive decor begin to illuminate the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/another-christmas-without-cheer-for-troubled-marry-mubaiwa/\">Continue reading<span class=\"screen-reader-text\"> \"Another Christmas Without Cheer For Troubled Marry Mubaiwa\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mnangagwa Acknowledges Mugabe’s Legacy on National Unity Day",
            "url": "https://www.zimeye.net/2024/12/23/mnangagwa-acknowledges-mugabes-legacy-on-national-unity-day/",
            "content": "By A Correspondent\n\nAfter previously downplaying his former boss Robert Mugabes role in Zimbabwes liberation war, President Emmerson Mnangagwa on Sunday finally recognized the late leaders contributions to promoting unity in the country.\n\nSpeaking on Sunday, Mnangagwa said:Today, we commemorate 37 years since the signing of the historic Unity Accord, which laid the foundation for the peace, stability, and unity we enjoy as a nation. This landmark agreement, signed by our Founding Fathers, the late Comrades Joshua Nkomo and Robert Mugabe, remains a cornerstone of Zimbabwes national identity and progress.\n\nAs we reflect on this day, let us reject division, tribalism, and self-hate, while embracing the unity and patriotism that have driven our nation forward. Under the Second Republic, we are translating these principles into tangible progress through grassroots development, land empowerment initiatives, and the pursuit of Vision 2030.\n\nUnity remains our strength as we work to uplift every Zimbabwean, leaving no one behind. Let us celebrate responsibly and recommit to building a united, peaceful, and prosperous Zimbabwe.\n\nLong live our unity. Happy National Unity Day, Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent After previously downplaying his former boss Robert Mugabe’s role in Zimbabwe’s liberation war, President Emmerson Mnangagwa on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/mnangagwa-acknowledges-mugabes-legacy-on-national-unity-day/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Acknowledges Mugabe’s Legacy on National Unity Day\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        },
        {
            "title": "Clive Malunga Calls Mnangagwa a “Selfish Coward”",
            "url": "https://www.zimeye.net/2024/12/23/clive-malunga-calls-mnangagwa-a-selfish-coward/",
            "content": "By A Correspondent\n\nVeteran musician and liberation war hero Clive Malunga has accused Zanu PF agents of intimidating him after he criticized President Emmerson Mnangagwas Vision 2030 plan.\n\nSpeaking out over the weekend, Malunga boldly predicted that Mnangagwa would not remain in power beyond 2028, citing increasing political tensions and Zimbabwes deepening economic crisis.\n\nFollowing my recent submission about Mnangagwas 2030 issue, some Zanu PF agents are criticizing and intimidating me for exercising my democratic right to freedom of expression, Malunga posted on X (formerly Twitter).\n\nBut Ill never withdraw, and thats it. Im ready to stand my ground against anything that comes my way.\n\nMalunga, a vocal critic of the current regime, went further in his condemnation of the president.\n\nYes, I clearly said itMnangagwa wont see 2030 or even 2026 because he isnt God, and he wasnt appointed by God to be President of Zimbabwe, he stated.\n\nIn fact, Mnangagwa is a useless coward. Ive got nothing to fear, and here is meZimbabwe is boiling while hes busy creating his dynasty. To hell with him.\n\nMalungas comments highlight growing discontent with the governments leadership amidst ongoing challenges facing the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran musician and liberation war hero Clive Malunga has accused Zanu PF agents of intimidating him after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/23/clive-malunga-calls-mnangagwa-a-selfish-coward/\">Continue reading<span class=\"screen-reader-text\"> \"Clive Malunga Calls Mnangagwa a “Selfish Coward”\"</span></a></p>",
            "time": "20:25",
            "date": "23 Dec 2024"
        }
    ]
}