{
    "news": [
        {
            "title": "Zambian Union Demands Revocation Of Work Permits for 2 Zimbos",
            "url": "https://www.zimeye.net/2025/09/23/zambian-union-demands-revocation-of-work-permits-for-2-zimbos/",
            "content": "LUSAKA  5 September 2025  The Zambia Union of Tanker Drivers and Allied Workers (ZUTDAW) has written to the Immigration Department demanding the immediate revocation of two work permits issued to foreign nationals employed as Fleet Managers at Remus Logistics in Ndola.\n\nIn a strongly worded letter dated 5 September 2025, the union accused the company of bypassing local talent and advertising procedures, alleging that the positions in question  held by Mr. Tsungai Albert Mubatsa and Mr. Denford Zimuto  were not critical roles warranting expatriate employment under Zambias labour laws.\n\nAccording to the letter, ZUTDAW claims that Remus Logistics failed to advertise the posts locally and instead appointed the two expatriates without giving qualified Zambians the opportunity to apply. The union cites the Employment Code Act No. 3 of 2019, Section 61, which stipulates that non-critical positions should be filled by Zambian nationals where possible.\n\nZUTDAW also warns that the hiring of expatriates has led to job losses for local workers. The unions letter claims 17 Zambians have lost their jobs as a direct result of the appointments and expresses concern that such practices undermine the local workforce.\n\nWe demand for legal revocation of the two work permits, wrote Maureen Mbula, Union Secretary, on behalf of the General Secretary. As a result of employing foreign nationals in positions where our people are qualified, it has now resulted in business ventures where these people even oppressing the area where they are not supposed.\n\nThe union is urging the Immigration Department to act swiftly to protect local jobs and ensure compliance with Zambian labour and immigration laws.\n\nRemus Logistics had not responded to requests for comment at the time of going to press. Immigration officials also had yet to issue a statement.\n\nThis development highlights growing tensions between Zambian labour unions and employers over the hiring of expatriates in positions that local professionals say they can fill.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "LUSAKA – 5 September 2025 — The Zambia Union of Tanker Drivers and Allied Workers (ZUTDAW) has written to the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/zambian-union-demands-revocation-of-work-permits-for-2-zimbos/\">Continue reading<span class=\"screen-reader-text\"> \"Zambian Union Demands Revocation Of Work Permits for 2 Zimbos\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Senior Zanu PF Cadre Dies",
            "url": "https://www.zimeye.net/2025/09/23/senior-zanu-pf-cadre-dies/",
            "content": "By A Correspondent  A senior Zanu PF official in Hwange and secretary for administration, Obert Mpofus brother, has died.\n\nRobert Mpofu died at his home last Friday.\n\nHe was 79.\n\nHe was declared a Liberation Hero and laid to rest at his rural home in Matabeleland North.\n\nBorn on October 13, 1945, Mpofu became involved in nationalist politics at a young age.\n\nHe crossed into Zambia in 1961, where he became active in political mobilisation and later served as the ZAPU Organising Secretary in Zambia, operating from an office near Butoha Hospital.\n\nIn Zimbabwe, the conferring of Liberation Hero status is meant to recognise individuals who played roles during the struggle for independence.\n\nHowever, the process has long been criticised for being highly politicised and tightly controlled by Zanu PF.\n\nSince independence in 1980, the ruling party has reserved the power to determine who qualifies as a national, provincial or district hero, often sidelining individuals linked to opposition politics or those who fell out of favour with the party leadership.\n\nFamilies and civil society groups have regularly complained that the honour is used as a tool of patronage and political loyalty rather than an impartial acknowledgment of contributions to the liberation struggle.\n\nProminent figures such as the late former ZIPRA intelligence chief Dumiso Dabengwa and ex-Zanu PF stalwart Edgar Tekere were denied national hero status despite their clear involvement in the liberation movement.\n\nThis selective approach has deepened public debate on the need to establish an independent body to handle hero status declarations outside partisan structures.\n\nRobert Mpofus burial comes against this backdrop, highlighting once again how the conferment of hero status continues to reflect Zanu PFs hold over national symbols of remembrance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A senior Zanu PF official in Hwange and secretary for administration, Obert Mpofu’s brother, has died. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/senior-zanu-pf-cadre-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Senior Zanu PF Cadre Dies\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Mutsvangwa Attacks VP Chiwenga",
            "url": "https://www.zimeye.net/2025/09/23/mutsvangwa-attacks-vp-chiwenga/",
            "content": "By A Correspondent Zanu PF spokesperson and Politburo member Christopher Mutsvangwa has indirectly attacked Vice President Constantino Chiwenga while defending businessmen Kudakwashe Tagwirei, Scott Sakupwanya and Wicknell Chivayo.\n\nAddressing the media in Harare on Monday, Mutsvangwa challenged Zimbabweans who believe that Tagwirei is corrupt to formally report him to the police or the Zimbabwe Anti-Corruption Commission (ZACC), instead of relying on speculation and social media claims.\n\nIf anyone has evidence that Mr. Tagwirei has acted corruptly, the correct thing is to report him to the relevant statutory bodies. We have the police, we have ZACC  those are the institutions mandated to deal with corruption, Mutsvangwa said.\n\nTagwirei, the founder of Sakunda Holdings, has faced longstanding allegations of benefiting from inflated government contracts and preferential treatment due to his ties to top officials. In 2020, the United States sanctioned him, accusing his business empire of fuelling economic mismanagement and public suffering  charges he has denied.\n\nIn recent months, Tagwireis name has resurfaced in succession debates, amid reports that President Emmerson Mnangagwa was positioning him as a political ally and possible successor. Critics have nicknamed him Chigananda  Shona slang for criminal  and demanded his arrest.\n\nMutsvangwa dismissed such claims as baseless:We must respect institutions. Rumours and name-calling do not substitute for evidence. If there is wrongdoing, let it be established through due process.\n\nMutsvangwas remarks have fuelled speculation of a growing rift between him and Vice President Chiwenga. The two men have a long and uneasy history rooted in Zanu PFs factional battles.\n\nChiwenga, a former commander of the Zimbabwe Defence Forces, was a central figure in the 2017 military intervention that ousted the late Robert Mugabe and installed Mnangagwa. His military background and role in the coup cemented his position as a powerful political player and natural contender for the presidency.\n\nMutsvangwa, a former war veteran leader and long-time Mnangagwa loyalist, has often clashed with Chiwenga over the direction of the party and the influence of business figures around State House. Their feud deepened after 2018, when Mutsvangwa openly accused military elites aligned to Chiwenga of monopolising power and resources at the expense of civilians and war veterans.\n\nThe rivalry became more visible when Mutsvangwa was dropped from cabinet in 2018 amid speculation that Chiwenga had influenced Mnangagwa to sideline him. In return, Mutsvangwa has used his position as party spokesperson to defend Mnangagwas allies  including controversial businessmen like Tagwirei and Chivayo  while indirectly criticising Chiwengas calls for their arrest.\n\nAnalysts argue that these attacks reflect deeper factional struggles within Zanu PF, as Mnangagwa and Chiwenga jostle for control ahead of the partys next elective congress. Mutsvangwas strong defence of Tagwirei is seen as aligning himself firmly with Mnangagwas camp, and as a direct challenge to Chiwengas demands for accountability against Mnangagwas business associates.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF spokesperson and Politburo member Christopher Mutsvangwa has indirectly attacked Vice President Constantino Chiwenga while defending … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/mutsvangwa-attacks-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Attacks VP Chiwenga\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Obert Mpofu’s Brother Dies",
            "url": "https://www.zimeye.net/2025/09/23/obert-mpofus-brother-dies/",
            "content": "By A Correspondent Zanu PF secretary for administration, Obert Mpofu, has lost his brother.\n\nRobert Mpofu died at his home last Friday.\n\nHe was 79.\n\nHe was declared a Liberation Hero and laid to rest at his rural home in Matabeleland North.\n\nBorn on October 13, 1945, Mpofu became involved in nationalist politics at a young age.\n\nHe crossed into Zambia in 1961, where he became active in political mobilisation and later served as the ZAPU Organising Secretary in Zambia, operating from an office near Butoha Hospital.\n\nIn Zimbabwe, the conferring of Liberation Hero status is meant to recognise individuals who played roles during the struggle for independence.\n\nHowever, the process has long been criticised for being highly politicised and tightly controlled by Zanu PF.\n\nSince independence in 1980, the ruling party has reserved the power to determine who qualifies as a national, provincial or district hero, often sidelining individuals linked to opposition politics or those who fell out of favour with the party leadership.\n\nFamilies and civil society groups have regularly complained that the honour is used as a tool of patronage and political loyalty rather than an impartial acknowledgment of contributions to the liberation struggle.\n\nProminent figures such as the late former ZIPRA intelligence chief Dumiso Dabengwa and ex-Zanu PF stalwart Edgar Tekere were denied national hero status despite their clear involvement in the liberation movement.\n\nThis selective approach has deepened public debate on the need to establish an independent body to handle hero status declarations outside partisan structures.\n\nRobert Mpofus burial comes against this backdrop, highlighting once again how the conferment of hero status continues to reflect Zanu PFs hold over national symbols of remembrance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF secretary for administration, Obert Mpofu, has lost his brother. Robert Mpofu died at his home … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/obert-mpofus-brother-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Obert Mpofu’s Brother Dies\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Unsung Hero Carries Day For Simba Bhora",
            "url": "https://www.zimeye.net/2025/09/23/unsung-hero-carries-day-for-simba-bhora/",
            "content": "Sports Correspondent\n\nSimba Bhora announced their arrival on the continental stage with a gritty 1-0 triumph over Eswatinis Nsingizini Hotspurs in the opening leg of the CAF Champions League preliminary round.\n\nThe historic fixture, hosted at the Obed Itani Chilume Stadium in Francistown, Botswana, saw forward Ishmael Nyanhi carve his name into Simba Bhora folklore. His decisive strike not only sealed victory but also became the clubs first-ever goal in Africas premier club competition.\n\nThe narrow win gives the Zimbabwean newcomers a crucial edge heading into the reverse fixture, where they will aim to build on their slender advantage and continue their dream run in their debut Champions League campaign.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Simba Bhora announced their arrival on the continental stage with a gritty 1-0 triumph over Eswatini’s Nsingizini Hotspurs … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/unsung-hero-carries-day-for-simba-bhora/\">Continue reading<span class=\"screen-reader-text\"> \"Unsung Hero Carries Day For Simba Bhora\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Economists Doubt Zimbabwe’s Readiness to Abandon US Dollar",
            "url": "https://www.zimeye.net/2025/09/23/economists-doubt-zimbabwes-readiness-to-abandon-us-dollar/",
            "content": "By Business Correspondent\n\nHARARE  Finance Minister Professor Mthuli Ncube has declared that Zimbabwes de-dollarisation process is already in motion, but economic analysts remain unconvinced about the timing and viability of the plan.\n\nIn a statement on Saturday, Ncube said the launch of the Zimbabwe Gold (ZiG) currency marked the beginning of the transition away from the US dollar.\n\nDEDOLLARISATION ROADMAP We are on the de-dollarisation map already, we cannot de-dollarise if we dont have a local currency. The mere introduction of the ZiG was de-dollarisation, he said.\n\nHowever, critics warn that attempting to phase out the US dollar too quickly could worsen inflationary pressures, undermine stability, and place additional strain on citizens who still depend on foreign currency for daily trade.\n\nEconomists stress that without strong confidence in the local currency, the governments de-dollarisation drive may struggle to gain traction and could fail to deliver its intended outcomes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Correspondent HARARE – Finance Minister Professor Mthuli Ncube has declared that Zimbabwe’s de-dollarisation process is already in motion, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/economists-doubt-zimbabwes-readiness-to-abandon-us-dollar/\">Continue reading<span class=\"screen-reader-text\"> \"Economists Doubt Zimbabwe’s Readiness to Abandon US Dollar\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Mutsvangwa says VP Chiwenga is Lucky to be Alive; He Must be Grateful,",
            "url": "https://www.zimeye.net/2025/09/23/mutsvangwa-says-vp-chiwenga-is-lucky-to-be-alive-he-must-be-grateful/",
            "content": "ZANU PF Spokesman Chris Mutsvangwa says Chiwenga is lucky to be alive; he must be grateful,To survive a war its a matter of luck and once you survive, if you begin to see virtue in yourself because you survived the war, then you are not respecting those who remained, becausehttps://t.co/Hn8KhXSFAxpic.twitter.com/XCpe17DJGv\n\nTo survive a war its a matter of luck and once you survive, if you begin to see virtue in yourself because you survived the war, then you are not respecting those who remained, because for you to survive, somebody had to shoot the one who was going.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "“To survive a war it’s a matter of luck and once you survive, if you begin to see virtue in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/mutsvangwa-says-vp-chiwenga-is-lucky-to-be-alive-he-must-be-grateful/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa says VP Chiwenga is Lucky to be Alive; He Must be Grateful,\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Mutsvangwa Admits  Leaked Dossier Exposes Mnangagwa",
            "url": "https://www.zimeye.net/2025/09/23/mutsvangwa-admits-leaked-dossier-exposes-mnangagwa/",
            "content": "Mutsvangwa Brushes Off Leaked Dossiers, Says Party Focused on Delivering Prosperity\n\nBy A Correspondent | ZimEye | ZANU PF spokesman Christopher Mutsvangwa has dismissed a series of leaked dossiers calling them routine attempts to destabilise the ruling party ahead of its 2027/28 Congress, insisting that President Emmerson Mnangagwa and the Politburo remain focused on economic development and internal democracy.\n\nLeaked Dossiers Come and Go\n\nOpening the press conference, the party spokesperson said there would always be dossiers aimed at confusing or distracting the party. We have seen them for over 45 years, he said. They come and go, and when they reach the Politburo we simply put them aside and focus on delivering prosperity to the people of Zimbabwe.\n\nHe said the President had long been aware of the latest dossier  mentioning them by name including GoldMafia  as he said that party structures and African allies had been informed.\n\nInternal Democracy Ahead of 2027/28 Congress.\n\nThe spokesperson stressed that leadership changes are decided at Congress and not through leaked documents or manipulation. Some people may be impatient, he said. But ZANU PF will hold its Congress in 2027/28 to determine the partys future direction. Leadership contests are decided democratically, not by ambush.\n\nHe said President Mnangagwa remains committed to constitutional limits. He says, I believe in two terms. When my day comes, I go, the spokesperson added.\n\nMnangagwas Economic Achievements\n\nMoving to the Presidents record, the spokesperson listed economic achievements:Restoring Zimbabwes currency and power base.Moving the country from food aid dependency to wheat self-sufficiency.Building major infrastructure projects, including roads and steel plants.Attracting world-class investment in lithium and industrial processing.Creating opportunities for young people in mining, agriculture, and manufacturing.\n\nThe membership of ZANU PF supports this President, he said. They say, If it aint broke, dont fix it.\n\nAppointments Only Through Official Letters\n\nAddressing recent speculation about Central Committee appointments, the spokesperson underlined the partys procedures. I only announce appointments based on letters signed by the Secretary for Administration and cleared by the President, he said. I dont announce based on leaked minutes or social media.\n\nCorruption Allegations Should Go to Police\n\nOn corruption allegations, he urged journalists to report evidence to the Zimbabwe Anti-Corruption Commission or the police. Social media allegations remain allegations until they go through the system, he said. We cannot run a country through hearsay.\n\nAttacks and Personal Insults\n\nResponding to questions about personal attacks on himself and other leaders, the spokesperson said Zimbabwe is a democracy and people are free to criticise, but he reserved the right to respond legally if needed. One cannot fight every battle, he added.\n\nZANU PFs Core Identity\n\nThroughout the briefing, the spokesperson repeatedly described ZANU PF as a mass-based, democratic party born out of the liberation struggle. He said its structures safeguard the integrity of democratic, choice-based leadership selection and are not for sale. No one can buy their way into ZANU PF leadership, he stressed.\n\nIndustrial Investments as Proof of Progress\n\nHe also highlighted a $1.2 billion steel investment, partnerships with major South African and Chinese companies, and Zimbabwes emergence as a global lithium and agricultural exporter. He said engineers were tweaking the Manhize steel plant for optimal performance ahead of October, citing the plant as evidence of the Presidents industrialisation drive.\n\nFinal Message\n\nIn closing, the spokesperson said ZANU PF will not be swayed by rumours, dossiers, or external pressures. Our focus is on the prosperity and industrialisation of Zimbabwe, the integrity of our democratic processes, and the unity of the party, he concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutsvangwa Brushes Off Leaked Dossiers, Says Party Focused on Delivering Prosperity By A Correspondent | ZimEye | ZANU PF spokesman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/23/mutsvangwa-admits-leaked-dossier-exposes-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Admits  Leaked Dossier Exposes Mnangagwa\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "The Sakunda Republic: How Mnangagwa, Tagwirei, and Chivayo Bought a Party and Rented a Country:",
            "url": "https://www.zimeye.net/2025/09/22/the-sakunda-republic-how-mnangagwa-tagwirei-and-chivayo-bought-a-party-and-rented-a-country/",
            "content": "By Reason Wafawarova\n\nOpening: A Party for Sale:\n\nIn Zimbabwe, the line between party, state, and private company has never been clear. But recent revelations confirm what many already suspected: ZANU PF is no longer a political organisation. It is a subsidiary of Sakunda Holdings, held together by oil revenues, Dubai mansions, and loyalty networks financed with money siphoned from the people.\n\nAt the centre of the storm is President Emmerson Mnangagwa, now exposed as trustee of a secret 45 percent ZANU PF shareholding in Sakunda, a stake originally set up under Mugabe but repurposed as a war chest for a new dynasty. Instead of dividends sustaining the party, billions of dollars have flowed into the hands of one man: Kudakwashe Tagwirei, Mnangagwas economic alter ego.\n\nThe proceeds have not watered the party base. They have lubricated it  with loyalty purchased through SUVs, cash envelopes, and campaign handouts. They have funded the rise of Wicknell Chivayo as the nations official Father Christmas, Scott Sakupwanya as the golden mascot, and Delish Nguwaya as fixer-in-chief.\n\nThe goal? Not Vision 2030. Not rural development. But Dynasty 2050: a seamless handover of Zimbabwe from Mnangagwa to his financiers and eventually to his sons, Sean or Emmerson Jr.\n\nThe Politburo as Shareholders AGM:\n\nWhat should have been another routine politburo meeting last week erupted into what can only be described as a hostile shareholders annual general meeting.\n\nVice President Constantino Chiwenga marched into the room, not as a deputy but as a whistleblower, armed with a dossier that accused Tagwirei of looting US$3.2 billion. The revelations shocked even hardened politburo veterans.\n\nChiwenga declared that ZANU PF had never seen a cent of its supposed Sakunda dividends. Instead, the money had been repurposed to build parallel structures of power, bankrolled by Tagwirei and distributed by Chivayo, Sakupwanya, and Nguwaya.\n\nHe said the party had never received a cent, insiders revealed. Instead, Tagwirei was using what was essentially ZANU PFs money to capture its structures, with the complicity of the trustees.\n\nTrustees, of course, being none other than Mnangagwa himself, his deputy Kembo Mohadi, and party legal secretary Patrick Chinamasa.\n\nChiwenga reportedly demanded the immediate arrest of the four benefactors  Tagwirei, Chivayo, Sakupwanya, and Nguwaya. For a brief moment, it seemed as if the entire party hierarchy had been hijacked and was now being held hostage by its own financiers.\n\nThe Billion-Dollar Babysitters:\n\nThe scandal has revealed more than just missing billions. It has laid bare Mnangagwas new form of insurance: an entourage of billionaires and benefactors who function as political babysitters, guarding him against internal coups and external exposure.\n\nThe arrangement is simple: whenever Mnangagwa contemplates foreign travel, he considers taking along his babysitters  Tagwirei, Chivayo, Sakupwanya, and Nguwaya. Not as official delegates, not as policy experts, but as a human shield against arrest in his absence.\n\nThe logic is blunt: if the President leaves them behind, Chiwenga might pounce. If he carries them along, they remain untouchable. Such is the level of paranoia that Mnangagwa is said to be weighing whether to cancel his trip to the upcoming United Nations General Assembly in New York.\n\nNever in the history of diplomacy has a head of state hesitated to attend a global summit for fear that his personal benefactors might be arrested if left unsupervised at home.\n\nChiwengas Fury and Mnangagwas Fear:\n\nChiwengas dossier did not merely accuse Tagwirei of theft. It accused Mnangagwa of complicity. By highlighting Chivayos flashy handouts  including ten luxury vehicles and US$1 million in cash to provincial chairmen  Chiwenga was effectively pointing at the President and saying: Here is your legacy.\n\nMnangagwas discomfort was visible. His loyalists scrambled. Presidential spokesman George Charamba contradicted Chivayo by claiming the cars were party property, not personal gifts. But the contradiction only reinforced Chiwengas argument: the lines between party property, personal property, and looted property have dissolved.\n\nWhen State Security Minister Lovemore Matuke accused Chiwenga of plotting to seize power, the general snapped back: Ask Mnangagwa who got him out of the country in 2017 when Mugabe had fired him. It was a sharp reminder that loyalty, not legality, has always determined succession in ZANU PF.\n\nCommittees as Political Sedatives:\n\nMnangagwas response was vintage crisis management: form a committee. Obert Mpofu, Oppah Muchinguri, and Patrick Chinamasa were tasked to investigate.\n\nThe irony is sharp. Mpofu, himself no stranger to allegations of enrichment; Muchinguri, long part of the patronage machine; and Chinamasa, one of the very trustees accused in the dossier.\n\nThis is not oversight. It is a self-audit by the accused, a strategy perfected by Mugabe and now institutionalised under Mnangagwa.\n\nThe Rise of the Dynasty Project:\n\nThe Sakunda stake is not just about todays looting. It is about tomorrows succession.\n\nMnangagwas loyalists are openly floating the idea of postponing elections beyond 2028. The official line is continuity. The real motive is protection. Many fear that a Chiwenga presidency would bring investigations, arrests, and exposure.\n\nThe solution? A dynasty project:\n\nPhase 1 (20232030): Mnangagwa consolidates power with Sakunda billions.\n\nPhase 2 (20302040): Tagwirei steps in as economic president, deputised by Chivayo as political frontman.\n\nPhase 3 (20402050): Handover to Sean Mnangagwa or Emmerson Jr., ensuring the family brand remains intact.\n\nThis is not a political strategy. It is a family trust deed masquerading as a national vision.\n\nLiberation Struggle vs. Cartel Struggle:\n\nThe contrast with the liberation struggle could not be starker. Where the bush fighters sought sovereignty, todays cartel financiers seek dependency  on foreign banks, on Dubai mansions, on oil rents.\n\nWhere the liberation war was fought with guns and ideology, todays power struggle is fought with SUVs and WhatsApp transfers.\n\nWhat Chiwenga laid bare was not just a financial scandal. It was the complete transformation of ZANU PF from liberation movement into cartel republic.\n\nThe Human Face of Party Capture:\n\nBehind the billions lies a broken nation.\n\nRural communities still wait for boreholes while $1.2 billion was siphoned in advance for dry holes and ribbon-cutting.\n\nCancer patients still die without treatment while half a billion vanished into phantom tenders for machines that never arrived.\n\nVillagers were promised goats under the $40 million Presidential Goat Scheme; not a single goat appeared.\n\nYet in Harare, party loyalists drive luxury cars donated by benefactors, their loyalty purchased with looted dividends.\n\nThe people thirst while the elite feast.\n\nMnangagwas New York Dilemma:\n\nThe absurdity of the crisis crystallises in one question: will Mnangagwa attend the UN General Assembly?\n\nOrdinary leaders weigh diplomatic priorities, foreign policy, or global alliances. Mnangagwa must weigh whether his babysitters will remain safe if he leaves them behind.\n\nHis advisors warn him: if you fly to New York, Chiwenga might seize the moment. If you stay, you project weakness internationally.\n\nThe Presidents calendar is no longer determined by foreign policy, but by fear of arrest by his own deputy.\n\nWhat Next?\n\nAs ZANU PF prepares for its annual conference in Mutare, the battle lines are clear.\n\nChiwengas camp insists on discipline, arrests, and a return to order.\n\nMnangagwas camp insists on continuity, dynasty, and insulation from accountability.\n\nThe party is no longer a political organisation but a battlefield between a general with a dossier and a president with babysitters.\n\nConclusion: A Nation Held Hostage:\n\nZimbabwe is not governed by policy. It is governed by cartel mathematics. Sakunda dividends fund loyalty; loyalty funds dynasty; dynasty funds paranoia.\n\nThe liberation war was fought for independence. Today, independence is mortgaged to Dubai bankers and oil cartels.\n\nMnangagwa may yet skip New York. But he cannot skip history. And history will not remember him as the liberator who saved Zimbabwe from Mugabe. It will remember him as the trustee who rented ZANU PF to Sakunda, sold the party to billionaires, and tried to turn a nation into a family dynasty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Reason Wafawarova Opening: A Party for Sale: In Zimbabwe, the line between party, state, and private company has never … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/22/the-sakunda-republic-how-mnangagwa-tagwirei-and-chivayo-bought-a-party-and-rented-a-country/\">Continue reading<span class=\"screen-reader-text\"> \"The Sakunda Republic: How Mnangagwa, Tagwirei, and Chivayo Bought a Party and Rented a Country:\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        },
        {
            "title": "Ras Pompy Caged",
            "url": "https://www.zimeye.net/2025/09/22/ras-pompy-caged/",
            "content": "By Showbiz Reporter  Zimdancehall star Nyasha Reginald Mano, popularly known as Ras Pompy, has been jailed for six months after being convicted of unlawful possession of cough syrups, marking a dramatic fall for one of the genres most promising chanters.\n\nRas Pompy, who rose to fame as a teenage sensation in the Zimdancehall movement, was found guilty of contravening the Medicines and Allied Substances Control Act after a full trial before Harare magistrate Gamuchirai Gore.\n\nProsecutor Mandirasa Chigumira told the court that on July 16, 2025, detectives from CID Drugs Harare identified a black Honda Fit (registration number AGS 6699) in a traffic jam along Kambuzuma Road. The vehicle had already been flagged in police records as being linked to drug supplies in Harare.\n\nWhen ordered to pull over, Ras Pompy sped off into Rugare suburb, triggering a dramatic chase that ended when his vehicle struck a metal pole. Detectives then caught up with the artist and searched his car.\n\nInside, they discovered about 100 bottles of cough syrup valued at US$396, including 24x100ml bottles of Broncleer, 20x100ml bottles of Benylin, and 55x100ml bottles of Astra Pain cough syrup.\n\nThe star, once celebrated for hits that defined the new wave of Zimdancehall, was arrested and taken to CID Drugs Harare. Both his stash and his Honda Fit were seized.\n\nFor fans, Ras Pompys conviction highlights the struggles that have haunted many dancehall artists in Zimbabwe, where fame has often collided with brushes with the law. Once seen as a voice of the youthful ghetto generation, the artist now faces the sobering reality of serving time behind bars.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Zimdancehall star Nyasha Reginald Mano, popularly known as Ras Pompy, has been jailed for six months … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/22/ras-pompy-caged/\">Continue reading<span class=\"screen-reader-text\"> \"Ras Pompy Caged\"</span></a></p>",
            "time": "20:43",
            "date": "23 Sep 2025"
        }
    ]
}