{
    "news": [
        {
            "title": "Chiwenga Scores Surprise Victory Over Tagwirei in ZANU PF Power Clash",
            "url": "https://www.zimeye.net/2025/07/21/chiwenga-scores-surprise-victory-over-tagwirei-in-zanu-pf-power-clash/",
            "content": "By Political Affairs Correspondent | ZimEye | Vice President Constantino Chiwenga has pulled off an unexpected victory against controversial businessman Kudakwashe Tagwirei, barely 24 hours after being publicly dismissed as powerless and clueless by senior figures within ZANU PF.\n\nIn a dramatic turn of events, ZANU PF spokesperson Chris Mutsvangwa, who has previously derided Chiwenga as incompetent, announced at a surprise press conference on Monday that Tagwireis co-option into the Central Committee had been rejected  effectively handing Chiwenga a political win in the ruling partys ongoing power struggle.\n\nThe Constitution is very clear as to how you can become a Central Committee member, said Mutsvangwa.Harare province may have had aspirations for him but the party has its leadership the tick box was looked atSadly, for Harare province, it wasnt the case. So he wasnt successful. Their bid to support him wasnt successful.\n\nMutsvangwa added:\n\nZANU PF is a party of everybody, including business people. You can always go back and start again If you finally meet the tick box, you may find yourself again as a Central Committee member. But for the time being, you may not be satisfying those conditions.\n\nChiwengas Comeback  From Humiliation to Triumph\n\nThe announcement comes just a day after Chiwenga was widely mocked following a failed attempt to block Tagwireis inclusion at a Central Committee meeting held on 3 July. At that meeting, insiders say Chiwenga rose furiously, demanding Tagwirei be ejected  only to realise that the businessmans name had never been officially tabled.\n\nThe stunt was likened by critics to a Tsholotsho 2.0 trap, referencing the 2004 coup attempt against then-President Mugabe. This time, the trap allegedly sought to expose Chiwengas weakness and isolate him politically.\n\nZANU PF insider Temba Mliswa described the move as a panic response:\n\nKuda was used as a pawn to shake Chiwenga up. He was misled.Kudas issue was never tabled at the Central Committee. It was a setup, Mliswa explained in a ZimEye discussion.Chiwenga panicked, and instead of gaining ground, he only ended up making Kuda more popular.\n\nYet, despite the mockery, it is now Chiwengas position that has been vindicated.\n\nBlessed Gezas Anthem: Pasi NeZvigananda\n\nThe tension peaked on 6 July 2025, when Chiwengas campaign strategist, Blessed Geza, staged a public showdown by playing video footage denouncing Tagwirei. The anthem? A rousing chant: Pasi nezvigananda! (Down with gluttons).\n\nThough dismissed by many as political theatre, the chant now appears to have been the prelude to victory.\n\nThe Power Dynamics\n\nMliswa insisted that real authority in ZANU PF remains with the 10 provincial chairpersons, all allegedly loyal to President Emmerson Mnangagwa  and by extension, to Tagwirei.\n\nPower in ZANU PF lies with the 10 chairpersons  all of whom are loyal to ED, said Mliswa.The army has no control in ZANU PF because it does not control the chairpersons. Chiwenga misread the dynamics.\n\nYet, in a stunning twist, the partys top structures have seemingly defied that logic, rejecting Tagwireis inclusion, at least for now.\n\nPolitical critic Gifford Gomwe had a different view:\n\nChiwenga has not danced to the agitation of Mnangagwa.What he has done is show Mnangagwa that what he was doing is very wrong.If I have to give Chiwenga marks, I would say he is 10 out of 10.\n\nThe Businessman and the Party\n\nTagwireis intended elevation followed a familiar path  similar to past promotions of technocrats like Jonathan Moyo and Mthuli Ncube  but his alleged embezzlement of public funds has sparked resistance within ZANU PF.\n\nStill, ZANU PFs Political Commissar Munyaradzi Machacha has publicly defended Tagwirei:\n\nTagwirei has contributed immensely to the party, he told ZimEye.\n\nBut Mutsvangwas Monday announcement appears to sideline that endorsement  for now.\n\nThe Bottom Line\n\nThe rejection of Tagwirei  and the public credit it grants Chiwenga  signals deepening fault lines within ZANU PFs top ranks.\n\nIt may also mark the beginning of a new chapter in the strained relationship between Chiwenga and Mnangagwa, once ironclad allies during the 2017 coup that toppled Robert Mugabe.\n\nIf Chiwengas manoeuvres were meant to reassert control over ZANU PFs succession roadmap, this surprise outcome offers a temporary upper hand. Whether it translates into long-term influence  or sparks further retaliation from Mnangagwas camp  remains to be seen.\n\nAs Mutsvangwa cryptically concluded:\n\nWe may also have aspired to become very high along the way but 40 years later, were still thereBecause the party has a way of doing certain things.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Affairs Correspondent | ZimEye | Vice President Constantino Chiwenga has pulled off an unexpected victory against controversial businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/chiwenga-scores-surprise-victory-over-tagwirei-in-zanu-pf-power-clash/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Scores Surprise Victory Over Tagwirei in ZANU PF Power Clash\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Mwonzora in Embarrassing Party Debt",
            "url": "https://www.zimeye.net/2025/07/21/mwonzora-in-embarrassing-party-debt/",
            "content": "By A Correspondent MDC-T leader Douglas Mwonzora is facing the embarrassment of having his partys assets seized after the Labour Court granted a former employees application to register a ruling compelling the party to pay outstanding salary arrears amounting to US$7,600.\n\nThe application was made by Kudzanayi Mashumba, who once served as chief aide to the MDC-T presidium but later fell out with Mwonzora amid bitter internal power struggles. The court approved the registration of the ruling on July 9, 2025, opening the way for Mashumba to pursue legal enforcement through the sheriff of the court.\n\nAccording to court papers, Mashumba cited the MDC-T and a labour officer, Constance Kadenga, as first and second respondents respectively. The registration of the ruling strengthens the legal basis for action, including the possible attachment of party property if the debt remains unpaid.\n\nIn his affidavit, Mashumba said he was employed by the MDC-T on April 1, 2020, earning a monthly salary of US$550 and a US$50 cellphone allowance. However, by 2021, relations with Mwonzora had soured, leading to a fallout rooted in deepening factionalism within the embattled opposition party.\n\nOn the 21st of October 2021, the applicant and first respondent appeared before the second respondent (Kadenga) in conciliation proceedings, which yielded no results; hence, a certificate of no settlement was issued, Mashumba stated. The first respondent failed to submit notice of response after being served with the statement of claim. As such, on the 16th of November 2021, I filed my statement of claim against the first respondent. On the 16th of May 2022, the second respondent proceeded to make a draft ruling, which was in my favour.\n\nInitially, the ruling lacked enforceability as it had not been registered with the Labour Court under the provisions of the old Labour Act. However, the introduction of section 128 by the Labour Amendment Act of 2023 has now made such rulings executable upon registration.\n\nThis legal setback comes at a time when Mwonzoras grip on the MDC-T is under increasing scrutiny. Mwonzoras tenure has been plagued by internal dissent, defections, and allegations of authoritarian leadership.\n\nHis fallout with senior party figures, notably former deputy president Elias Mudzuri, exposed simmering tensions. Mudzuri, once a contender for the presidency of the MDC-T, was sidelined during Mwonzoras controversial rise to power. The internal wrangles have weakened the partys national standing and led to its poor performance in successive elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – MDC-T leader Douglas Mwonzora is facing the embarrassment of having his party’s assets seized after the Labour … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/mwonzora-in-embarrassing-party-debt/\">Continue reading<span class=\"screen-reader-text\"> \"Mwonzora in Embarrassing Party Debt\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Mutsvangwa Dismisses Tagwirei Central Committee Appointment",
            "url": "https://www.zimeye.net/2025/07/21/mutsvangwa-dismisses-tagwirei-central-committee-appointment/",
            "content": "By A Correspondent\n\nZanu PF spokesperson Christopher Mutsvangwa has dismissed reports that controversial businessman Kudakwashe Tagwirei has been co-opted into the ruling partys Central Committee, saying the attempt was unsuccessful and procedurally flawed.\n\nSpeaking to the media in Harare on Monday, Mutsvangwa made it clear that the business moguls name had not been formally accepted by the partys top leadership and emphasized that entry into the Central Committee requires strict adherence to Zanu PFs constitutional processes.\n\nThose seeking entry into the Central Committee must first obtain clearance from the Presidium, Mutsvangwa said. Any attempt to bypass this is constitutionally incorrect.\n\nTagwirei, a businessman often described as President Emmerson Mnangagwas blue-eyed boy, has been a subject of controversy due to his proximity to power and the opaque nature of some of his business dealings. His alleged appointment sparked backlash within and outside the party, with many questioning the basis of his nomination.\n\nMutsvangwa appeared to distance the party from the move, underlining that Zanu PF is not a platform for unchecked ambition or shortcuts to power.\n\nMembership isnt just about ambitionit requires respect for party regulations, procedural discipline, and a solid ideological foundation, Mutsvangwa stated.\n\nHe added that individuals seeking leadership positions must undergo proper orientation and prove themselves through the structures of the party.\n\nIn cases of procedural missteps, individuals should return to party basicswhether through grassroots engagement or formal ideological trainingbefore aspiring to higher office, he said.\n\nThe remarks have been interpreted by some analysts as a signal that even those with powerful connections are not immune to Zanu PFs internal rules, as the party seeks to project an image of order and constitutionalism amid rising internal tensions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF spokesperson Christopher Mutsvangwa has dismissed reports that controversial businessman Kudakwashe Tagwirei has been co-opted into … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/mutsvangwa-dismisses-tagwirei-central-committee-appointment/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Dismisses Tagwirei Central Committee Appointment\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "BREAKING: Tagwirei Bid for Co Option Finally And Fully Rejected By ZANU PF",
            "url": "https://www.zimeye.net/2025/07/21/breaking-tagwirei-bid-for-co-option-finally-and-fully-rejected-by-zanu-pf/",
            "content": "video loading below\n\nBy Political Affairs Correspondent | ZimEye | Vice President Constantino Chiwenga has pulled off an unexpected victory against controversial businessman Kudakwashe Tagwirei, barely 24 hours after being publicly dismissed as powerless and clueless by senior figures within ZANU PF.\n\nIn a dramatic turn of events, ZANU PF spokesperson Chris Mutsvangwa, who has previously derided Chiwenga as incompetent, announced at a surprise press conference on Monday that Tagwireis co-option into the Central Committee had been rejected  effectively handing Chiwenga a political win in the ruling partys ongoing power struggle.\n\nThe Constitution is very clear as to how you can become a Central Committee member, said Mutsvangwa.Harare province may have had aspirations for him but the party has its leadership the tick box was looked atSadly, for Harare province, it wasnt the case. So he wasnt successful. Their bid to support him wasnt successful.\n\nMutsvangwa added:\n\nZANU PF is a party of everybody, including business people. You can always go back and start again If you finally meet the tick box, you may find yourself again as a Central Committee member. But for the time being, you may not be satisfying those conditions.\n\nChiwengas Comeback  From Humiliation to Triumph\n\nThe announcement comes just a day after Chiwenga was widely mocked following a failed attempt to block Tagwireis inclusion at a Central Committee meeting held on 3 July. At that meeting, insiders say Chiwenga rose furiously, demanding Tagwirei be ejected  only to realise that the businessmans name had never been officially tabled.\n\nThe stunt was likened by critics to a Tsholotsho 2.0 trap, referencing the 2004 coup attempt against then-President Mugabe. This time, the trap allegedly sought to expose Chiwengas weakness and isolate him politically.\n\nZANU PF insider Temba Mliswa described the move as a panic response:\n\nKuda was used as a pawn to shake Chiwenga up. He was misled.Kudas issue was never tabled at the Central Committee. It was a setup, Mliswa explained in a ZimEye discussion.Chiwenga panicked, and instead of gaining ground, he only ended up making Kuda more popular.\n\nYet, despite the mockery, it is now Chiwengas position that has been vindicated.\n\nBlessed Gezas Anthem: Pasi NeZvigananda\n\nThe tension peaked on 6 July 2025, when Chiwengas campaign strategist, Blessed Geza, staged a public showdown by playing video footage denouncing Tagwirei. The anthem? A rousing chant: Pasi nezvigananda! (Down with gluttons).\n\nThough dismissed by many as political theatre, the chant now appears to have been the prelude to victory.\n\nThe Power Dynamics\n\nMliswa insisted that real authority in ZANU PF remains with the 10 provincial chairpersons, all allegedly loyal to President Emmerson Mnangagwa  and by extension, to Tagwirei.\n\nPower in ZANU PF lies with the 10 chairpersons  all of whom are loyal to ED, said Mliswa.The army has no control in ZANU PF because it does not control the chairpersons. Chiwenga misread the dynamics.\n\nYet, in a stunning twist, the partys top structures have seemingly defied that logic, rejecting Tagwireis inclusion, at least for now.\n\nPolitical critic Gifford Gomwe had a different view:\n\nChiwenga has not danced to the agitation of Mnangagwa.What he has done is show Mnangagwa that what he was doing is very wrong.If I have to give Chiwenga marks, I would say he is 10 out of 10.\n\nThe Businessman and the Party\n\nTagwireis intended elevation followed a familiar path  similar to past promotions of technocrats like Jonathan Moyo and Mthuli Ncube  but his alleged embezzlement of public funds has sparked resistance within ZANU PF.\n\nStill, ZANU PFs Political Commissar Munyaradzi Machacha has publicly defended Tagwirei:\n\nTagwirei has contributed immensely to the party, he told ZimEye.\n\nBut Mutsvangwas Monday announcement appears to sideline that endorsement  for now.\n\nThe Bottom Line\n\nThe rejection of Tagwirei  and the public credit it grants Chiwenga  signals deepening fault lines within ZANU PFs top ranks.\n\nIt may also mark the beginning of a new chapter in the strained relationship between Chiwenga and Mnangagwa, once ironclad allies during the 2017 coup that toppled Robert Mugabe.\n\nIf Chiwengas manoeuvres were meant to reassert control over ZANU PFs succession roadmap, this surprise outcome offers a temporary upper hand. Whether it translates into long-term influence  or sparks further retaliation from Mnangagwas camp  remains to be seen.\n\nAs Mutsvangwa cryptically concluded:\n\nWe may also have aspired to become very high along the way but 40 years later, were still thereBecause the party has a way of doing certain things..\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below By Political Affairs Correspondent | ZimEye | Vice President Constantino Chiwenga has pulled off an unexpected victory … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/breaking-tagwirei-bid-for-co-option-finally-and-fully-rejected-by-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Tagwirei Bid for Co Option Finally And Fully Rejected By ZANU PF\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Chiwenga Busts Fraud Scheme",
            "url": "https://www.zimeye.net/2025/07/21/chiwenga-busts-fraud-scheme/",
            "content": "By A Correspondent| Vice President General (Retd) Dr. Constantino Chiwenga has disowned a fraudulent event allegedly linked to his name, exposing it as a scam designed to deceive and extort unsuspecting citizens under the guise of government endorsement.\n\nIn a strongly worded statement issued Monday, the Office of the Vice President said it was not involved in the so-called event, which it described as a blatant violation of government protocol and a serious breach of organisational norms.\n\nThe Office of the Hon. Vice President Gen. (Retd) Dr. C. G. D. N. Chiwenga disassociates itself from the event, which has nothing to do with the Government, blatantly violates Government protocol; and goes against organisational norms, the statement said.\n\nThe Vice President further condemned the scheme, calling it afraudulent pseudo-eventaimed at extorting money from the public by falsely associating the scam with his office and other government officials.\n\nThe Vice President takes great exception to being associated with such a fraudulent pseudo-event designed to extort the unsuspecting public through false association with him and other figures of Government, the statement added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Vice President General (Retd) Dr. Constantino Chiwenga has disowned a fraudulent event allegedly linked to his name, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/chiwenga-busts-fraud-scheme/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Busts Fraud Scheme\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Liverpool Sign Ekitike in Record Deal…",
            "url": "https://www.zimeye.net/2025/07/21/liverpool-sign-ekitike-in-record-deal/",
            "content": "By Sports Correspondent\n\nLiverpool have successfully reached a full agreement with Eintracht Frankfurt to sign the talented young striker Hugo Ekitike. The deal is valued at a staggering $106m, with a guaranteed initial fee of $93m and potential add-ons worth $13m.\n\nThe Reds are set to welcome Ekitike to the fold, with the striker expected to undergo a medical examination later this week.\n\nThis move would mark a significant boost to Liverpools attacking options, and fans are eagerly anticipating the impact Ekitike could make at Anfield.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Liverpool have successfully reached a full agreement with Eintracht Frankfurt to sign the talented young striker Hugo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/liverpool-sign-ekitike-in-record-deal/\">Continue reading<span class=\"screen-reader-text\"> \"Liverpool Sign Ekitike in Record Deal…\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Lifeline for Epworth As Discovery Ambulance and Health Ministry Unite for Free Health Outreach",
            "url": "https://www.zimeye.net/2025/07/21/lifeline-for-epworth-as-discovery-ambulance-and-health-ministry-unite-for-free-health-outreach/",
            "content": "By A Correspondent| A rare wave of compassion swept through Epworth North Constituency this past weekend as residents were treated to free healthcare services during a large-scale outreach led by Discovery Ambulance Services (DAS) in collaboration with the Ministry of Health and Child Care.\n\nBacked by the governments health modernisation agenda, the outreach brought diagnostic services, first aid training, and free medication directly to the doorsteps of one of Harares most underserved communities. The event is part of a broader campaign spearheaded by DAS CEO David Munowenyu, whose efforts are quickly earning national recognition.\n\nThis is not just about ambulancesits about saving lives, empowering communities, and showing what we can achieve when public and private sectors work together, said Health Minister Dr. Douglas Mombeshora, who officiated the event.\n\nHundreds of residentsyoung and oldgathered to access lifesaving services. Mobile medical teams, backed by fully equipped ambulances, provided blood pressure and diabetes screening, cancer awareness education, consultations, and on-the-spot medication.\n\nMemory Chigwada, a 45-year-old mother of two, left the outreach beaming.\n\nI got my blood pressure checked and received medicinefor free. That has never happened in our area. They even trained us in first aid. Now I know what to do if someone collapses at home.\n\nResidents were also given the rare chance to explore the interior of one of DASs new high-tech ambulancespart of a fleet of 200 being deployed across the country. The vehicles are kitted out with modern life-support systems, GPS navigation, and are staffed by trained emergency personnel ready to respond via toll-free number991.\n\nBut the outreach didnt stop at clinical care. DAS also conducted intensive first aid training sessions, equipping residents with the skills to perform CPR, manage wounds, and stabilise patients before help arrives.\n\nOur vision isnt just to treat people in emergencies but to prepare communities to handle them. This is how we build a stronger, more resilient Zimbabwe, said DAS CEO David Munowenyu.\n\nMunowenyu said the Epworth event was just the beginning of a much larger effort to decentralise healthcare and ensure that no Zimbabwean is left behind.\n\nMinister Mombeshora hailed the outreach as a model for youth-led development and praised Munowenyus leadership in delivering tangible health services where they are needed most.\n\nDavid is proof that Zimbabwes own sons and daughters can solve our challenges. Discovery Ambulance Services is delivering what used to seem impossiblereliable, modern, emergency care, free and accessible to ordinary citizens, said Mombeshora.\n\nHe reiterated the governments support for the rollout of more than 200 state-of-the-art ambulances across all 10 provinces, saying the initiative is key to bringing Zimbabwes emergency services closer to international standards.\n\nFor Grace Mutambara, a 60-year-old grandmother, the outreach may have been a lifesaver.\n\nI had chest pains for days, but no money to see a doctor. They treated me with dignity and gave me medicine. I now know how to respond if it happens again.\n\nTinashe Moyo, a 32-year-old father, echoed the sentiment.\n\nThey checked my children and explained their conditions clearly. We even got tips on nutrition and hygiene. I feel safer now.\n\nAs Zimbabwe continues to modernise its health infrastructure, the Epworth outreach stands as a powerful example of how innovation, compassion, and collaboration can transform lives. The message from DAS is clear: accessible emergency healthcare is no longer a privilegeits a right.\n\nWe are here for every Zimbabwean. Whether in the city or a rural villageif you dial991, we will respond, affirmed Munowenyu.\n\nWith unwavering government support and a bold vision in motion, Discovery Ambulance Services may well be paving the way for a healthier, safer, and more empowered Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A rare wave of compassion swept through Epworth North Constituency this past weekend as residents were treated … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/lifeline-for-epworth-as-discovery-ambulance-and-health-ministry-unite-for-free-health-outreach/\">Continue reading<span class=\"screen-reader-text\"> \"Lifeline for Epworth As Discovery Ambulance and Health Ministry Unite for Free Health Outreach\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Como Secure Young Talent Jacobo Ramón from Real Madrid",
            "url": "https://www.zimeye.net/2025/07/21/como-secure-young-talent-jacobo-ramon-from-real-madrid/",
            "content": "Sports Correspondent\n\nHERE WE GO! Como have agreed to a deal with Real Madrid to sign talented young player Jacobo Ramn for a fee of 2.5m, with additional clauses based on appearances. As part of the agreement, Real Madrid will retain a 50% sell-on clause, ensuring they benefit from any future transfer.\n\nThe deal also includes three buy-back clauses, similar to the arrangement made for Nico Paz. With this signing, Como continue to strengthen their squad, adding fresh talent to their roster. Another exciting addition for the Italian club!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent HERE WE GO! Como have agreed to a deal with Real Madrid to sign talented young player Jacobo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/como-secure-young-talent-jacobo-ramon-from-real-madrid/\">Continue reading<span class=\"screen-reader-text\"> \"Como Secure Young Talent Jacobo Ramón from Real Madrid\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Tragedy as Dance Group Members Die Returning from Chibuku Neshamwari",
            "url": "https://www.zimeye.net/2025/07/21/ragedy-as-dance-group-members-die-returning-from-chibuku-neshamwari/",
            "content": "Three members of the Sekusile Sitshikitsha dance group tragically lost their lives in a road traffic accident along the Gweru-Bulawayo highway on Sunday. The group was travelling home to Matabeleland South after participating in the Chibuku Neshamwari Traditional Dance Festival held at Mutare Showgrounds.\n\nSeveral other members sustained minor injuries and are currently recovering at home.\n\nIn a joint statement, Delta Corporation, the National Arts Council of Zimbabwe (NACZ), and the Zimbabwe National Traditional Dancers Association (ZNTDA) extended their heartfelt condolences to the families of the deceased.\n\nThe loss leaves an irreplaceable void in our artistic community. We also stand in solidarity with members of the Sekusile Sitshikitsha dance group as they deal with the aftermath of this ordeal, the statement read.\n\nSOURCE: State media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Three members of the Sekusile Sitshikitsha dance group tragically lost their lives in a road traffic accident along the Gweru-Bulawayo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/ragedy-as-dance-group-members-die-returning-from-chibuku-neshamwari/\">Continue reading<span class=\"screen-reader-text\"> \"Tragedy as Dance Group Members Die Returning from Chibuku Neshamwari\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        },
        {
            "title": "Burkina Faso President Ibrahim Traoré Dissolves Electoral Commission, Labels It Tool of Foreign Influence",
            "url": "https://www.zimeye.net/2025/07/21/burkina-faso-president-ibrahim-traore-dissolves-electoral-commission-labels-it-tool-of-foreign-influence/",
            "content": "By A Correspondent\n\nBurkina Fasos transitional leader, Captain Ibrahim Traor, has dissolved the countrys electoral commission in a controversial decision that has sparked intense debate both online and within political circles.\n\nTraor defended the move by describing the electoral body as a waste of resources and a tool manipulated by foreign interests to interfere in our national affairs. He added, We cannot continue to fund institutions that serve agendas that are not aligned with our peoples sovereignty.\n\nThe decision has stirred a storm on social media, with users voicing mixed reactions. Critics say Traor is drifting from democratic principles, while his supporters argue he is taking bold steps to protect national interests.\n\nHe is moving weird now, posted @_Hoshiko_0, expressing skepticism about the captains latest move.\n\n@Fortunate_263 remarked sarcastically, The signs were there , suggesting the development was inevitable.\n\nSome users from outside Burkina Faso even chimed in. @Mo_Ongasaphuzi joked, That bathi we need a leader like him in RSA , referring to calls in South Africa for similarly decisive leadership.\n\nHowever, others maintained cautious support. @The_Villager_In commented, You had this discussion a while ago, and you have said it in between shows as well. But I think he started very well, and we really dont have reasons to doubt him. Lets see, though. I am still behind him.\n\nThis is not the first time Traor has taken a strong stance against institutions he sees as remnants of foreign control. His administration continues to pursue a path of sovereignty-focused governance, though critics warn such moves could undermine democratic progress in the long term.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Burkina Faso’s transitional leader, Captain Ibrahim Traoré, has dissolved the country’s electoral commission in a controversial decision … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/21/burkina-faso-president-ibrahim-traore-dissolves-electoral-commission-labels-it-tool-of-foreign-influence/\">Continue reading<span class=\"screen-reader-text\"> \"Burkina Faso President Ibrahim Traoré Dissolves Electoral Commission, Labels It Tool of Foreign Influence\"</span></a></p>",
            "time": "08:34",
            "date": "22 Jul 2025"
        }
    ]
}