{
    "news": [
        {
            "title": "Popular Mutare Transport Operator Dies In Road Accident",
            "url": "https://www.zimeye.net/2025/09/01/popular-mutare-transport-operator-dies-in-road-accident/",
            "content": "By A Correspondent-A, well-known Mutare transport operator, Mr Godfrey Chikosi, and five others have died in a tragic road accident that occurred Friday night at the Himalaya-Turn Off along the Mutare-Chimanimani Road.\n\nThe accident happened at the weekend, and one survivor was receiving treatment at Victoria Chitepo Provincial Hospital with severe injuries.\n\nMr Chikosi was among the four victims who died on the spot.\n\nTwo others died at the hospital.\n\nActing Manicaland police spokesman, Assistant Inspector Wiseman Chinyoka was not immediately available for a comment.\n\nHowever, fellow transporter, Mr Isau Mupfumi confirmed Mr Chikosis death, and deployed a team to visit the accident scene early this morning.\n\n-Manica Post\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-A, well-known Mutare transport operator, Mr Godfrey Chikosi, and five others have died in a tragic road accident … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/popular-mutare-transport-operator-dies-in-road-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Popular Mutare Transport Operator Dies In Road Accident\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Zanu PF Mashonaland East Declares Mnangagwa To Stay In Office Beyond 2028",
            "url": "https://www.zimeye.net/2025/09/01/zanu-pf-mashonaland-east-declares-mnangagwa-to-stay-in-office-beyond-2028/",
            "content": "By A CorrespondentMARONDERA ZANU PF leaders in Mashonaland East have thrown their weight behind President Emmerson Mnangagwa, calling for him to continue steering the country past 2028 despite constitutional limits on presidential terms.\n\nThe announcement was made at a Provincial Coordinating Committee (PCC) meeting held in Marondera, where party officials unanimously endorsed the push for Mnangagwa to extend his rule as part of advancing Zimbabwes Vision 2030 agenda.\n\nDelivering the official resolution, the partys Secretary for Legal Affairs in the province, Pension Chiutsi, said every district had rallied behind Mnangagwas leadership.\n\nAll structures in the province were clear in their submissions. The first resolution for 2025 states: His Excellency, President and First Secretary of ZANU PF, Cde Dr Emmerson Dambudzo Mnangagwa, must continue leading both the party and government until Vision 2030 has been fully realized, said Chiutsi.\n\nThe declaration drew resounding applause from senior party members, positioning Mashonaland East as the first province to formally endorse Mnangagwas continued stay in power beyond the current constitutional framework.\n\nBacking the resolution, Provincial Chairman  Daniel Garwe praised Mnangagwa for guiding the nation through difficult times, including natural disasters and economic shocks.\n\nWhether it was Cyclone Idai, the COVID-19 pandemic, or persistent droughts, the President ensured that people were not abandoned. He has shown resilience, foresight, and unity of purpose, Garwe said.\n\nHe added that the party believes Mnangagwas leadership is essential for the countrys long-term prosperity.\n\nThis is why we insist that Vision 2030 cannot be derailed. The President must remain in office until this national goal is achieved, Garwe declared.\n\nCalling for discipline and loyalty within party ranks, Garwe concluded: Our duty is to stand firmly behind the President and the party. Loyalty is the foundation of our success.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A CorrespondentMARONDERA —ZANU PF leaders in Mashonaland East have thrown their weight behind President Emmerson Mnangagwa, calling for him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/zanu-pf-mashonaland-east-declares-mnangagwa-to-stay-in-office-beyond-2028/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Mashonaland East Declares Mnangagwa To Stay In Office Beyond 2028\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Names Of  Bloody Weekend Crashes Victims",
            "url": "https://www.zimeye.net/2025/09/01/names-of-bloody-weekend-crashes-victims/",
            "content": "By A Correspondent The Zimbabwe Republic Police (ZRP) has released the names of victims who died in three separate fatal road traffic accidents that occurred over the weekend.\n\nMost of these accidents happened in Mutare, Juru, and Masvingo between 28 and 30 August 2025.\n\nIn a statement, police said: The Zimbabwe Republic Police releases the names of victims who died in three fatal road accidents which occurred at the 46-kilometre peg along Mutare-Masvingo Road in Mutare, the 49-kilometre peg along the Harare-Nyamapanda Road in Juru, and the 246-kilometre peg along the Mutare-Masvingo Road in Masvingo.\n\nMutare (28 August 2025)\n\nThe accident near the 46-kilometre peg along the MutareMasvingo Road claimed the lives of:\n\nJuru (29 August 2025)\n\nAt the 49-kilometre peg along the HarareNyamapanda Road in Juru, the victims were identified as:\n\nMasvingo (30 August 2025)\n\nAt the 246-kilometre peg along the MutareMasvingo Road in Masvingo, the deceased were listed as:\n\nThe police extended condolences to the bereaved families. The Zimbabwe Republic Police extends deepest condolences to the families of the victims. We appeal to drivers to seriously consider road safety while moving on the countrys roads, the statement read.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– The Zimbabwe Republic Police (ZRP) has released the names of victims who died in three separate fatal … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/names-of-bloody-weekend-crashes-victims/\">Continue reading<span class=\"screen-reader-text\"> \"Names Of  Bloody Weekend Crashes Victims\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "CUT Student Dies Just After Being Capped By Mnangagwa",
            "url": "https://www.zimeye.net/2025/09/01/cut-student-dies-just-after-being-capped-by-mnangagwa/",
            "content": "By A Correspondent A Chinhoyi University of Technology (CUT) student has died in a car crash only hours after being capped by President Emmerson Mnangagwa at the institutions graduation ceremony.\n\nThe student,Panashe Mwinga, had just graduated with a Bachelors Degree in Visual and Communication Multimedia on Thursday before tragedy struck later that evening.\n\nAccording to police, the accident occurred nearGwebi River, along the HarareChinhoyi Road, as the family travelled to Harare.\n\nMashonaland West Provincial Police Spokesperson,Inspector Ian Kohwera, confirmed the accident, saying it happened around 7 pm at the 70km peg.\n\nOn approaching the 70km peg, the driver lost control of the vehicle. It veered off the road, rolled several times, and landed in a ditch, Insp Kohwera said.\n\nMwingas father, an engineer, wasseriously injured, while three other family members, who were also in the car, remain hospitalised.\n\nAn eyewitness toldH-Metrothat the graduate was still in her academic gown when the crash happened.\n\nThe car burst a left-side tyre before overturning. I managed to pull out the father, mother, and the child. What pained me most was seeing people filming instead of helping, the witness said.\n\nThe CUT community described Mwinga as a talented student whose life ended far too soon.\n\nIt is with profound regret and a deep sense of loss that we inform you of the passing ofPanashe Mwinga, a gifted young lady who had just graduated. Her untimely passing is a profound loss to the university community and to all who had the privilege of sharing her journey, saidMalvin Saint Madanda, CUT SRC Minister for External Affairs, Information and Publicity.\n\nMwingas death marks thefourth loss of a CUT student within nine months. Two students have died in accidents, while two others recently took their own lives.\n\nJust last month, first-year Agricultural Engineering studentAbraham Chabatawas found dead after drinking poison at the campus sports field. He left a suicide note addressed to his family. His death came barely four days after another student,Takudzwa Alex Mapurisa, also took his own life following a long battle with mental health challenges.\n\nThe back-to-back tragedies have left the CUT community shaken and grappling with grief.\n\nMadanda said the campus had been plunged into mourning.\n\nIt is with deep sorrow that we inform you of the passing of Abraham Chabata. This loss has sent ripples of grief across our institution, and we extend our sincerest condolences to his family, friends, classmates, and all who knew him.\n\nAs we reflect on these tragedies, we are reminded of the silent battles many among us may be facing. We urge all students to open up about their struggles to family, trusted friends, or peer counsellors.\n\nIn response to Mwingas death, the CUT Students Representative Council declaredMonday a Black Day, urging students to wear black as a symbol of collective mourning and solidarity.\n\nWe encourage all students to wear black on this day as a sign of respect and remembrance, said Madanda.\n\nThe recent spate of deaths has raised alarm over the welfare and mental health of students, with the university community now calling for stronger support systems to help prevent further loss of young lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A Chinhoyi University of Technology (CUT) student has died in a car crash only hours after being … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/cut-student-dies-just-after-being-capped-by-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"CUT Student Dies Just After Being Capped By Mnangagwa\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Mutare, Juru, Masvingo Road Accidents: Police Identify Victims",
            "url": "https://www.zimeye.net/2025/09/01/mutare-juru-masvingo-road-accidents-police-identify-victims/",
            "content": "By A Correspondent\n\nHarare  The Zimbabwe Republic Police (ZRP) has released the names of victims who died in three separate fatal road traffic accidents that occurred in Mutare, Juru, and Masvingo between 28 and 30 August 2025.\n\nIn a statement, police said: The Zimbabwe Republic Police releases the names of victims who died in three fatal road accidents which occurred at the 46-kilometre peg along Mutare-Masvingo Road in Mutare, the 49-kilometre peg along the Harare-Nyamapanda Road in Juru, and the 246-kilometre peg along the Mutare-Masvingo Road in Masvingo.\n\nMutare (28 August 2025)\n\nThe accident near the 46-kilometre peg along the MutareMasvingo Road claimed the lives of:\n\nJuru (29 August 2025)\n\nAt the 49-kilometre peg along the HarareNyamapanda Road in Juru, the victims were identified as:\n\nMasvingo (30 August 2025)\n\nAt the 246-kilometre peg along the MutareMasvingo Road in Masvingo, the deceased were listed as:\n\nThe police extended condolences to the bereaved families. The Zimbabwe Republic Police extends deepest condolences to the families of the victims. We appeal to drivers to seriously consider road safety while moving on the countrys roads, the statement read.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – The Zimbabwe Republic Police (ZRP) has released the names of victims who died in three … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/mutare-juru-masvingo-road-accidents-police-identify-victims/\">Continue reading<span class=\"screen-reader-text\"> \"Mutare, Juru, Masvingo Road Accidents: Police Identify Victims\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Chiwenga Unwinds With Wife Mini Baloyi at Secret Rendezvous",
            "url": "https://www.zimeye.net/2025/09/01/chiwenga-unwinds-with-wife-mini-baloyi-at-secret-rendezvous/",
            "content": "By A Correspondent\n\nHarare  Vice President Constantino Chiwenga was spotted spending quiet time with his wife, Mini Baloyi, at a private rendezvous away from the political storms rocking Zanu PF headquarters.\n\nIn a rare public appearance without his usual phalanx of bodyguards, Chiwenga appeared calm and composed, relaxing alongside Baloyi. The two seemed to be enjoying each others company, a striking contrast to the tense atmosphere at the ruling partys headquarters.\n\nAlthough the exact date of when the picture was taken is not known, it was shared on the Mini Baloyi Facebook platform, offering the public a rare glimpse of the Vice President in a more personal light, far removed from the weight of statecraft and party disputes.\n\nRare picture of Soko relaxing with wife pic.twitter.com/QkEgxaGcEZ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – Vice President Constantino Chiwenga was spotted spending quiet time with his wife, Mini Baloyi, at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/chiwenga-unwinds-with-wife-mini-baloyi-at-secret-rendezvous/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Unwinds With Wife Mini Baloyi at Secret Rendezvous\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Warriors Stars Shine Abroad",
            "url": "https://www.zimeye.net/2025/09/01/warriors-stars-shine-abroad/",
            "content": "Sports Correspondent- Zimbabwean internationals made headlines across different leagues over the weekend, with several Warriors players delivering standout performances for their clubs.\n\nIn Scotland, forward Tawanda Maswanhise continued his fine form for Motherwell, striking just before the halftime whistle to put his team 21 ahead. The match eventually ended in a 22 stalemate against Kilmarnock, but Maswanhises sharp finish highlighted his growing importance to the side.\n\nOver in England, Warriors vice-captain Marshall Munetsi was once again influential in midfield. The versatile star turned provider, registering an assist for Wolverhampton Wanderers in their thrilling 32 loss to Everton. Despite the defeat, Munetsis contribution underlined his consistency at the highest level.\n\nBack in South Africa, young striker Thando Ngwenya was on target for AmaZulu, scoring his second league goal of the season. His strike, which beat fellow Zimbabwean goalkeeper Elvis Chipezeze, helped Usuthu secure a 11 draw with Magesi.\n\nThe weekends action will boost Zimbabwes hopes ahead of upcoming international fixtures, as the players continue to find rhythm and confidence with their clubs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent- Zimbabwean internationals made headlines across different leagues over the weekend, with several Warriors players delivering standout performances for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/warriors-stars-shine-abroad/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Stars Shine Abroad\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Opposition Leader Slams Zanu PF’s ‘Begging Bowl’ Economy",
            "url": "https://www.zimeye.net/2025/09/01/opposition-leader-slams-zanu-pfs-begging-bowl-economy/",
            "content": "By A Correspondent\n\nHarare  Freedom Fighters for Change president Michael Makaza has accused the Zanu PF government of presiding over an economy built on desperation, warning that Zimbabwes reliance on diaspora remittances exposes the regimes failure to provide for its own citizens.\n\nSpeaking on Saturday ahead of his partys official launch set for September 13, Makaza said the dependence on diaspora money was not a strength, but rather a glaring sign of failure.\n\nZimbabwes reliance on diaspora remittances is a stark reminder of the countrys failed economic policies, Makaza said. Instead of begging for scraps from abroad, we need sound policies that create opportunities for our citizens at home. Its time for a new direction, one that prioritizes job creation, economic growth, and sustainable development.\n\nThe opposition leader outlined his partys economic vision, urging leaders to focus on reforms that will address Zimbabwes deep-rooted structural problems.\n\nWe urge our leaders to focus on creating a conducive business environment, investing in infrastructure, and promoting innovation, he said. Only then can we stem the brain drain and encourage our talented Zimbabweans to build their country.\n\nMakaza also said the September 13 launch of Freedom Fighters for Change would mark the beginning of a movement for economic revival and dignity that seeks to restore hope to ordinary Zimbabweans.\n\nOur people deserve more than empty promises. They deserve opportunities to thrive in their own land, he declared. This is about #WeMove, #EconomicRevival, and ultimately, a #NewZimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – Freedom Fighters for Change president Michael Makaza has accused the Zanu PF government of presiding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/opposition-leader-slams-zanu-pfs-begging-bowl-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition Leader Slams Zanu PF’s ‘Begging Bowl’ Economy\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Woman Killed in Mutare Road Crash After Hilux Side-Swiped by Truck",
            "url": "https://www.zimeye.net/2025/08/31/woman-killed-in-mutare-road-crash-after-hilux-side-swiped-by-truck/",
            "content": "By A Correspondent | A horrific accident claimed one life this evening along Mutare Road in Ruwa when a Toyota Hilux double cab was side-swiped by a haulage truck, causing the vehicle to overturn.\n\nThe silver Hilux was left mangled on its side at the edge of the highway, its roof crushed and windows shattered, as stunned bystanders gathered at the scene. The force of the collision ripped parts of the vehicle apart, scattering debris and broken glass across the roadside.\n\nTragically, the drivers wife lost her life in the crash, while the driver and other possible occupants were rushed to hospital. Witnesses described the moment as a devastating impact that threw the vehicle off balance before it rolled and landed on its side.\n\nThe haulage truck involved reportedly continued along the road before stopping a short distance from the scene, as authorities were called to attend.\n\nThis accident once again highlights the deadly risks along Zimbabwes busy highways, where haulage trucks and private vehicles often share narrow, congested lanes under dangerous conditions.\n\nPolice have since attended the scene, and investigations into the cause of the crash are underway.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A horrific accident claimed one life this evening along Mutare Road in Ruwa when a Toyota … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/woman-killed-in-mutare-road-crash-after-hilux-side-swiped-by-truck/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Killed in Mutare Road Crash After Hilux Side-Swiped by Truck\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        },
        {
            "title": "Govt Finally Delivers Sweet News To Parirenyatwa Kidney Patients",
            "url": "https://www.zimeye.net/2025/08/31/govt-finally-delivers-sweet-news-to-parirenyatwa-kidney-patients/",
            "content": "By Dr Masimba Mavaza | The Permanent Secretary for the Ministry of Health and Child Welfare, Dr Aspect J.V Maunganidze, has set the record straight regarding the situation at the hospitals renal unit.\n\nIn correcting misinformation about Parirenyatwa Hospitals dialysis unit, Dr Maunganidze stated that the unit is ready and very ready. The new dialysis unit is fully equipped and prepared to offer dialysis services at any time.\n\nWhat has delayed the functioning of the unit is not the official opening. The delay is due to pending consumables. The only thing holding back the unit from starting services is the arrival of essential consumables, specifically dialysates, which are crucial for dialysis treatment, he explained.\n\nThe Permanent Secretary gave hope by confirming that a scheduled delivery is expected. These consumables are set to arrive next week, after which the unit will begin providing services to patients.\n\nHe categorically stated that the delay in the units operation is not dependent on an official opening ceremony. The hospital emphasizes that service delivery will commence as soon as the consumables are in place.\n\nThis clarification helps set the record straight about the hospitals readiness to provide much-needed dialysis services.\n\nSeveral people have already called in to express their joy at this news from Dr Maunganidze:\n\nThats wonderful news! The dialysis unit at Parirenyatwa Hospital will be a lifeline for many patients in need of this life-saving treatment. Its great to hear that the unit is fully equipped and ready to go, with only the consumables pending. The delivery of dialysates next week will mark a significant milestone in providing essential healthcare services to the community. Heres hoping everything goes smoothly and patients start receiving treatment as soon as possible!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | The Permanent Secretary for the Ministry of Health and Child Welfare, Dr Aspect J.V Maunganidze, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/govt-finally-delivers-sweet-news-to-parirenyatwa-kidney-patients/\">Continue reading<span class=\"screen-reader-text\"> \"Govt Finally Delivers Sweet News To Parirenyatwa Kidney Patients\"</span></a></p>",
            "time": "20:37",
            "date": "01 Sep 2025"
        }
    ]
}