{
    "news": [
        {
            "title": "Geza Protests Fears, Police Block Teachers’ Bulawayo March",
            "url": "https://www.zimeye.net/2025/04/26/geza-protests-fears-police-block-teachers-bulawayo-march/",
            "content": "By Munacho Gwamanda- Police in Bulawayo on Tuesday blocked teachers from staging a peaceful march to mark the opening of a regional sports event, amid growing fears of escalating protests calling for President Emmerson Mnangagwas resignation.\n\nThe Association of Non-Aligned Teachers Unions of Southern Africa (ANTUSA) hosted its annual sports festival from 17 to 20 April, bringing together educators from across the region.\n\nHowever, efforts by the Progressive Teachers Union of Zimbabwe (PTUZ) to lead a short, symbolic march were thwarted by the authorities.\n\nPTUZ spokesperson Peter Machenjera said the police denied them permission to march a short distance from Fazak Shopping Centre to Hillside Teachers College, a stretch of just 500 to 700 meters.We wrote to the police seeking permission to have an official march to mark our presence in Bulawayo, Machenjera said.But they denied us that chance to march and market ourselves just to show we were here.\n\nMachenjera also revealed that their request for government support through the Public Service Commission (PSC) was ignored.As PTUZ, we wrote to government seeking assistance with transport. Remember, we have Public Service Commission (PSC) buses, but we received no response, he said.We even wrote asking for financial assistance to host the games, but there was no response as well.\n\nDespite the police blockade and the lack of government support, the event proceeded successfully, with the Minister of Primary and Secondary Education, Torerai Moyo, officially opening the festival on Saturday.\n\nIn his speech, Moyo praised PTUZ for organizing the event, saying:ANTUSA games foster camaraderie among nations, promoting understanding and respect through the universal language of sport. As we cheer for our teams and celebrate their achievements, let us embrace the values of collaboration and mutual support that these games embody.\n\nANTUSA is a regional body uniting teachers unions across Southern Africa, including Botswana, Zambia, Lesotho, South Africa, Zimbabwe, Namibia, and Mauritius. Formed in 2007 at a BETUZ Annual Conference in Kabwe, Zambia, ANTUSA promotes regional cooperation, professional development, and improved working conditions for educators.\n\nIt also organizes annual sports and cultural exchange programs to strengthen bonds among teachers in the region.\n\nThe suppression of the teachers march comes as authorities intensify their clampdown on public gatherings, fearing a resurgence of anti-government protests led by Blessed Geza, a vocal war veteran demanding Mnangagwas resignation.\n\nGeza has in recent months spearheaded a wave of protests, mobilizing citizens around economic grievances, corruption scandals, and human rights abuses that have worsened under Mnangagwas rule.\n\nHis calls for peaceful demonstrations have gained momentum, particularly among frustrated civil servants, students, and unemployed youths.\n\nAuthorities have responded with heavy-handed measures  deploying riot police, banning marches, and arresting suspected organizers  citing security concerns.\n\nAnalysts say the government fears that seemingly unrelated gatherings, such as sporting events or union activities, could morph into political protests inspired by Gezas movement.The state apparatus is in panic mode, a Bulawayo-based political analyst said. Any public assembly is now viewed as a potential tinderbox.\n\nWhile Mnangagwas administration has long prided itself on promoting a Second Republic based on reform and openness, critics argue that the increasing suppression of civic space mirrors the authoritarian practices of the late Robert Mugabe era.\n\nAs tensions rise, civic organizations and human rights groups have warned that Zimbabwe risks sliding deeper into repression, with the government seeking to silence any form of peaceful dissent  even when it comes dressed in the colors of sport and camaraderie.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Police in Bulawayo on Tuesday blocked teachers from staging a peaceful march to mark the opening of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/geza-protests-fears-police-block-teachers-bulawayo-march/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Protests Fears, Police Block Teachers’ Bulawayo March\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "Furore As Farai Jere Shields Under Fire Chitembwe",
            "url": "https://www.zimeye.net/2025/04/26/furore-as-farai-jere-shields-under-fire-chitembwe/",
            "content": "By Sports Correspondent\n\nTensions are running high in the green half of Harare, as CAPS United continues to struggle on the pitch, but instead of addressing the most glaring issues, club owner Farai Jere has once again chosen to deflect blamethis time by firing long-serving team manager Shakespeare Chinogwenya.\n\nWhile many fans and observers agree that head coach Lloyd Chitembwes tactics are at the heart of the teams decline, Jere seems unwilling to even entertain that possibility. Instead, his recent actions suggest a pattern of scapegoating others in an attempt to protect Chitembwe at all costs.\n\nThis isnt the first time Jere has taken such a route. In previous seasons, he removed then-CEO Charlie Jones in a move many saw as an effort to shift focus away from the clubs poor on-field performances. Now, the dismissal of Chinogwenya has sparked further outrage, with critics pointing out that administrative reshuffles wont fix tactical failings.\n\nAny normal thinking person can see CAPS problems are on the technical bench, not in the office, one insider close to the club remarked.\n\nIts Jeres unwavering loyalty to Chitembwe that is raising the most eyebrows. Despite mounting criticism and a string of disappointing results, the former CAPS midfielder remains untouched, shielded by an owner who seems to believe the coach can do no wrong.\n\nThis approach is now being seen as the root of the chaos at CAPS United. Rather than addressing coaching issues head-on, Jeres defensive stance and his tendency to protect Chitembwe at all costs are widening rifts within the club and frustrating the fanbase.\n\nIn the end, the furore surrounding CAPS is no longer just about poor resultsits about leadership decisions that appear more concerned with preserving personal loyalties than steering the team back to success.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Tensions are running high in the green half of Harare, as CAPS United continues to struggle on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/furore-as-farai-jere-shields-under-fire-chitembwe/\">Continue reading<span class=\"screen-reader-text\"> \"Furore As Farai Jere Shields Under Fire Chitembwe\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "Watch: “Go Fix Your Problems With Mnangagwa” — Pregnant Zimbabwean Woman Chased Out of South African Hospital",
            "url": "https://www.zimeye.net/2025/04/26/watch-go-fix-your-problems-with-mnangagwa-pregnant-zimbabwean-woman-chased-out-of-south-african-hospital/",
            "content": "By Tinashe Sambiri\n\nIn a stark reminder of the dire state of Zimbabwes healthcare system, a pregnant young Zimbabwean woman was recently thrown out of a South African hospital, with staff reportedly telling her: Go and fix your problems with Mnangagwa.\n\nThe incident, which occurred at Kalafong Hospital in South Africa, has sparked outrage online.\n\nThe woman, who had allegedly tried to access maternity care without proper documentation, was humiliated and ordered to leave. A video shows her carrying her bag, visibly distressed, as she begins the journey back to Zimbabwe  a country where many hospitals are crippled by medicine shortages and underfunding.\n\nThe situation has reignited debates about the collapse of Zimbabwes public health sector and the growing trend of citizens seeking basic medical care across the border.\n\nCritics say the humiliation faced by the woman is not just an isolated case of xenophobia but a reflection of the broader failure of governance back home.\n\nThis is what happens when leaders neglect their people, one commenter wrote on social media. Our hospitals have no drugs, no staff, and no dignity.\n\nWatch: Go And Fix Your Problems With Mnangagwa, Pregnant Young Zimbabwean Woman Chased Out Of South African Hospitalpic.twitter.com/19Q56jRVGr\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri In a stark reminder of the dire state of Zimbabwe’s healthcare system, a pregnant young Zimbabwean woman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/watch-go-fix-your-problems-with-mnangagwa-pregnant-zimbabwean-woman-chased-out-of-south-african-hospital/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: “Go Fix Your Problems With Mnangagwa” — Pregnant Zimbabwean Woman Chased Out of South African Hospital\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "Insecure Mnangagwa Ropes Own Son Into Close Protection Unit",
            "url": "https://www.zimeye.net/2025/04/26/insecure-mnangagwa-ropes-own-son-into-close-protection-unit/",
            "content": "By A Correspondent\n\nAmid growing concerns over dissent within the ruling party and increasing public dissatisfaction, Zimbabwean President Emmerson Mnangagwa has reportedly brought his son, Major Sean Mnangagwa, into the elite Close Protection Unitraising eyebrows and fueling speculation about the presidents deepening insecurity.\n\nSources within the security establishment suggest that the move was triggered by Mnangagwas growing mistrust of his traditional security apparatus, with the president allegedly seeking greater control and assurance by surrounding himself with trusted family members.\n\nThe President is paranoid. He no longer trusts anyone, not even his long-serving security aides. Putting his son in that position is not about meritits about control, said a former intelligence official who spoke on condition of anonymity.\n\nThe development comes as political tensions rise, with cracks appearing even within the ruling Zanu PF party. War veteran Blessed Geza openly called for Mnangagwas resignation, accusing him of being incapacitated and allowing rampant looting by his inner circle.\n\nMnangagwa must step down. He has failed. The country is bleeding, and he continues to shield corrupt cronies who are looting state resources while the rest of us suffer, Geza said in a scathing statement.\n\nIn a contrasting tone, Zanu PF-aligned youths took to social media to praise Major Sean Mnangagwa after he appeared on the ground during the Zimbabwe International Trade Fair (#ZITF), showcasing what they described as humility and discipline.\n\n#ZITF special moments: Major Sean Mnangagwa on the ground leading by example. Clearly he is well raised. Vari vamwe vachiti ndiri mwana washefu handingawonekwi ndichimhanya pasi netsoka. Kudos to Baba naAmai vakarera, read a post from party youth supporters.\n\nCritics, however, see this praise as part of a broader attempt to sanitise what many view as dynastic politics and a dangerous centralisation of power.\n\nThe optics are clearthis is a frightened leader tightening his grip through bloodlines. Its no longer about the country; its about survival, a political analyst said.\n\nAs pressure mounts both inside and outside the party, the decision to rope in his son adds another layer to an increasingly volatile political atmosphere in Zimbabwe. Whether this move will strengthen Mnangagwas hold on power or further alienate him from the public remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Amid growing concerns over dissent within the ruling party and increasing public dissatisfaction, Zimbabwean President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/insecure-mnangagwa-ropes-own-son-into-close-protection-unit/\">Continue reading<span class=\"screen-reader-text\"> \"Insecure Mnangagwa Ropes Own Son Into Close Protection Unit\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "JUST IN: Wiwa Blocked From Visiting Jailed Journalist Blessed Mhlanga",
            "url": "https://www.zimeye.net/2025/04/26/ust-in-wiwa-blocked-from-visiting-jailed-journalist-blessed-mhlanga/",
            "content": "By James GwatiThe Zimbabwe Prisons and Correctional Services (ZPCS) has reportedly barred former St.MarysMP Job Sikhala from visiting jailed AMH journalist Blessed Mhlanga at Harare Remand Prison.\n\nMhlanga was arrested two months ago after covering a story about war veteran Blessed Geza, who has publicly called for President Emmerson Mnangagwa to step down.\n\nPosting on social media Saturday, Sikhala said:\n\nThe regime has refused to allow me to visit the incarceratedpeoplesjournalist, Blessed Mhlanga, at Harare Remand Prison this morning. The officer in charge, Superintendent Shuureki, informed me that he had received orders from Commissioner-General of Prisons Moses Chihobvu not to permit the visit.\n\nSikhala said he was accompanied by NDWG Northern Region Facilitator Dr. Wurayayi Zembe, Tauya Chinama, Isaya Ndawana, and AMH Deputy Editor Tangai Chipangura.\n\nAfree, democratic society does not behave the way we see happening in Zimbabwe today,Sikhala added.\n\nThe regime has refused me to see our incarceration people's journalist Blessed Mhlanga at Harare Remand prison today in the morning. The officer in charge of the day Supritendent Shuureki told me that he has been advised by the Commissioner General of Prisons Moses Chihobvu thatpic.twitter.com/jvBWe624zg\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati — The Zimbabwe Prisons and Correctional Services (ZPCS) has reportedly barred former St. Mary’s MP Job Sikhala from visiting jailed AMH … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/ust-in-wiwa-blocked-from-visiting-jailed-journalist-blessed-mhlanga/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Wiwa Blocked From Visiting Jailed Journalist Blessed Mhlanga\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "Varakashi Leader Gets Hefty Reward From Chinese Community",
            "url": "https://www.zimeye.net/2025/04/26/varakashi-leader-gets-hefty-reward-from-chinese-community/",
            "content": "By A Correspondent\n\nIn a move that has raised both eyebrows and questions over foreign influence in domestic politics, Varakashi4ED national chairperson Gody Nkata was on Friday gifted a full suite of farming equipment by members of the Chinese community in Zimbabwe, reportedly in recognition of his pro-government online activism.\n\nThe donation includes a brand new tractor, a 4-row planter, a 3-dish plough, a disc harrow, a trailer, a quadbike, and a trailerbike. Supporters of the ruling Zanu PF party were quick to celebrate the development online, hailing it as a reward for loyalty and dedication to the partys digital propaganda machinery.\n\nCongratulations Varakashi4ED National Chairman Cde Gody Nkatha for being awarded a brand new Tractor from the Chinese Community.\n\nThis generous gift serves as a token of appreciation for his exemplary social media efforts, read a post from Zanu PF youth supporters.\n\nThey went on to praise Nkata for his role in coordinating, guiding, and uniting the Varakashi4ED Cyber Team in their mission to defend the ZANU PF party, promote Government policies, and highlight President Mnangagwas transformative policies.\n\nHowever, political analysts have been quick to interpret the gesture as payment for partisan loyalty, with some saying the reward is less about agriculture and more about political messaging.\n\nThis is not just a tractor. Its a reward for digital warfare against the opposition and a pat on the back for sanitising the regimes image online, said political analyst Tendai Mugabe. The fact that its coming from the Chinese community raises serious questions about the role of foreign players in domestic political campaigns.\n\nNkata has been a prominent figure in Varakashi4ED, a Zanu PF-aligned online movement that aggressively defends the ruling party while attacking opposition figures and critics. His online presence has made him both a hero to Zanu PF supporters and a controversial figure among civil society and human rights groups.\n\nThis shows how the regime values propaganda more than policy. Rewarding someone for trolling opposition leaders while the economy burns is a slap in the face to suffering citizens, said an opposition supporter who asked to remain anonymous.\n\nThe Chinese embassy has yet to comment on the donation, but the optics have stirred debate about transparency and influence. Critics argue that the gift may set a precedent for rewarding politically charged content, deepening the divide between ruling party loyalists and the broader public.\n\nAs Zimbabwe continues its fragile engagement and re-engagement drive with global partners, the use of foreign-backed gifts to reward digital loyalty may complicate the narrative of sovereignty and self-determination that Zanu PF has long promoted.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that has raised both eyebrows and questions over foreign influence in domestic politics, Varakashi4ED … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/varakashi-leader-gets-hefty-reward-from-chinese-community/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi Leader Gets Hefty Reward From Chinese Community\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "President ED Appoints Fadzai Mahere’s Aunt Into Notorious Military-Zvigananda-Commission To Destroy Blessed Geza",
            "url": "https://www.zimeye.net/2025/04/26/president-ed-appoints-fadzai-maheres-aunt-into-notorious-military-zvigananda-commission-to-destroy-blessed-geza/",
            "content": "By A Correspondent | Analysis | ZimEye | President Emmerson Mnangagwa during the week appointed his Justice Malaba plant-Fadzayi Maheres aunt, Rose, into a military commission thats expected to shove off anti corruption activist Blessed Gezas movement.\n\nThe development is more confirmation of an investigation showing how Fadzayi Mahere, her father and her aunt are all notorious Mnangagwa agents since 2005, and the latest deployments include a recent fake-defamation-court award Fadzayi was granted against the presidents advisor in order to deceive the opposition voter-base. (Justice Mafusire passed a proclamation that supports her lie that she was never assisted by ZANU PF into the University of Zimbabwe).\n\nMnangagwa needs Fadzayi Mahere to deceive opposition voters as their hero alternative to Nelson Chamisa and Blessed Geza. Her father Stephen is a notorious ZANU PF activist responsible for torturing opposition teachers since 2005, and was once fired by the late President Robert Mugabe from an Education Ministry portfolio after being exposed by David Coltart in 2012.\n\nFadzayi is a Luke-Malaba-plant to neutralise both Chamisa and Geza as a fake hero.\n\nThis time, Fadzayi Maheres aunt, Rose, is the one chosen by Mnangagwa for a Defence Forces Commission job in a move falling within days of the President firing army commander Anselem Sanyatwe, whos been re-deployed to head the same Sports portfolio ministry that Stephen Mahere once led as Permanent Secretary. In this skillful plot, Mnangagwa is putting the Mahere family into position to grab back both military power and the opposition masses.\n\nThe Defence Forces Service Commission comprises in full:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Analysis | ZimEye | President Emmerson Mnangagwa during the week appointed his Justice Malaba plant-Fadzayi Mahere’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/president-ed-appoints-fadzai-maheres-aunt-into-notorious-military-zvigananda-commission-to-destroy-blessed-geza/\">Continue reading<span class=\"screen-reader-text\"> \"President ED Appoints Fadzai Mahere’s Aunt Into Notorious Military-Zvigananda-Commission To Destroy Blessed Geza\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "Namibia Introduces Free Higher Education, Exposes Mnangagwa’s Broken Promises",
            "url": "https://www.zimeye.net/2025/04/26/namibia-introduces-free-higher-education-exposes-mnangagwas-broken-promises/",
            "content": "Windhoek Namibias newly elected President, Netumbo Nandi-Ndaitwah, has announced that her government will introduce free higher education at all state universities and technical colleges starting next year, a move that casts an embarrassing spotlight on Zimbabwean President Emmerson Mnangagwas longstanding, unfulfilled promises.\n\nNandi-Ndaitwah, who became Namibias first female head of state when she was sworn in last month, made the landmark announcement during her maiden State of the Nation Address (SONA) to Parliament on Thursday, 24 April.I am pleased to announce that from the next academic year, commencing 2026, tertiary education will become 100% subsidised by the government, she said to loud applause.\n\nNamibia already offers free education at public primary and secondary schools, although parents still bear the costs of uniforms, stationery, books, and hostel fees.\n\nThe new policy will remove all tuition and registration fees at public universities and vocational training centres  a bold step aimed at tackling youth unemployment and poverty in the country of just over 3 million people, where 2.1 million citizens are under the age of 35.\n\nTwo of Namibias seven universities are state-run and will fall under the new scheme, as will all seven of the countrys government-owned vocational training centres.\n\nIn stark contrast, President Mnangagwa, leader of Namibias sister revolutionary party, ZANU PF, has failed to deliver on his promises of free education nearly a decade after seizing power through a military coup in November 2017.\n\nUpon taking office, Mnangagwa repeatedly vowed that his government would introduce free education from early childhood to secondary school as part of what he called a New Dispensation agenda.\n\nDuring the 2018 election campaign, ZANU PFs manifesto boldly declared that Zimbabwe would ensure access to quality and affordable education for all and that free education at primary and secondary levels would be introduced progressively.\n\nHowever, these promises have remained empty rhetoric. Instead, under Mnangagwas rule, education in Zimbabwe has become even more commercialised and expensive.\n\nAnnual school fees have soared far beyond the reach of ordinary families, and public schools frequently turn away students unable to pay exorbitant levies.\n\nEven at the tertiary level, tuition fees and accommodation costs have spiraled, pushing higher education further out of reach for many.\n\nIn 2022, amid mounting public pressure, the Zimbabwean government announced a supposed implementation of free primary education beginning in 2023.\n\nYet in reality, parents continue to bear heavy costs for tuition, school development levies, uniforms, and materials.\n\nTeachers have also been on frequent strikes over poor salaries and working conditions, further crippling the education sector.\n\nCritics argue that Mnangagwas broken promises reflect a broader pattern of governance failure and dishonesty.\n\nFar from ushering in a Second Republic of prosperity and reform as he had claimed, Mnangagwas tenure has been characterised by economic collapse, political repression, and widespread disillusionment.\n\nIn comparison, Namibias decisive move to provide free higher education stands as a powerful testament to what political will and accountable leadership can achieve.\n\nIt also highlights the deepening crisis in Zimbabwe, where public trust in the governments promises continues to erode.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Windhoek – Namibia’s newly elected President, Netumbo Nandi-Ndaitwah, has announced that her government will introduce free higher education at all state … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/namibia-introduces-free-higher-education-exposes-mnangagwas-broken-promises/\">Continue reading<span class=\"screen-reader-text\"> \"Namibia Introduces Free Higher Education, Exposes Mnangagwa’s Broken Promises\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "Shock As Pregnant Zimbabwean Woman Suffers Xenophobic Attacks At SA Hospital",
            "url": "https://www.zimeye.net/2025/04/26/shock-as-pregnant-zimbabwean-woman-suffers-xenophobic-attacks-at-sa-hospital/",
            "content": "By Tinashe Sambiri\n\nIn a stark reminder of the dire state of Zimbabwes healthcare system, a pregnant young Zimbabwean woman was recently thrown out of a South African hospital, with staff reportedly telling her: Go and fix your problems with Mnangagwa.\n\nThe incident, which occurred at Kalafong Hospital in South Africa, has sparked outrage online.\n\nThe woman, who had allegedly tried to access maternity care without proper documentation, was humiliated and ordered to leave. A video shows her carrying her bag, visibly distressed, as she begins the journey back to Zimbabwe  a country where many hospitals are crippled by medicine shortages and underfunding.\n\nThe situation has reignited debates about the collapse of Zimbabwes public health sector and the growing trend of citizens seeking basic medical care across the border.\n\nCritics say the humiliation faced by the woman is not just an isolated case of xenophobia but a reflection of the broader failure of governance back home.\n\nThis is what happens when leaders neglect their people, one commenter wrote on social media. Our hospitals have no drugs, no staff, and no dignity.https://x.com/ZimEye/status/1916050734581239831?t=_d-crOYmJOA1sblyD6dd7Q&s=19\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri In a stark reminder of the dire state of Zimbabwe’s healthcare system, a pregnant young Zimbabwean woman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/26/shock-as-pregnant-zimbabwean-woman-suffers-xenophobic-attacks-at-sa-hospital/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Pregnant Zimbabwean Woman Suffers Xenophobic Attacks At SA Hospital\"</span></a></p>",
            "time": "21:46",
            "date": "27 Apr 2025"
        },
        {
            "title": "Picture: Wicknell Chivayo Captures Zimbabwe’s President",
            "url": "https://www.zimeye.net/2025/04/26/picture-wicknell-chivayo-captures-zimbabwes-president/",
            "content": "Picture: Wicknell Chivayo Captures Zimbabwean President Chivayo walks confidently in front of a Presidential Guard vehicle, an indication of his rising influence.Chivayo is looting State funds at willpic.twitter.com/09d6myfaYU\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "21:46",
            "date": "27 Apr 2025"
        }
    ]
}