{
    "news": [
        {
            "title": "Prisons Close Hanging Gallows, Turn Them To Museum",
            "url": "https://www.zimeye.net/2025/01/17/prisons-close-hanging-gallows-turn-them-to-museum/",
            "content": "By James Gwati- The Zimbabwe Prisons and Correctional Service (ZPCS) has repurposed the infamous hanging gallows at Chikurubi Maximum Security Prison into a museum and radio broadcasting studios.This transformation marks a significant step following Zimbabwes recent abolition of the death penalty.\n\nThe gallows at Chikurubi were originally used in the 1970s to execute offenders.\n\nThe last execution at the facility took place in 1979 before the execution chamber was relocated to Harare Central Prison, where the death penalty was last carried out in 2005.\n\nSince then, Zimbabwe had maintained an unofficial moratorium on executions, culminating in the formal abolition of capital punishment under President Emmerson Mnangagwas administration.\n\nBrian Moyo, Director of Corporate Chaplaincy Services for Bridging the Gap Foundation, hailed the initiative, saying, This transformation signifies a genuine commitment to respecting United Nations human rights practices. We applaud the government and ZPCS for leading this reform, and we thank President Mnangagwa for championing the abolition of the death penalty.\n\nThe project has drawn technical support from the Broadcasting Authority of Zimbabwe (BAZ).\n\nMatthias Chakanyuka, BAZs technical director, noted the sites suitability for broadcasting purposes: After our assessment, we determined that this place is ideal for a radio station, with all necessary facilities in place.\n\nChikurubis Officer in Charge, Chief Superintendent Alfred Machingauta, described the psychological toll of the death penalty, saying, I have interacted with individuals who were on death row, and their experiences were profoundly traumatic. Transforming these facilities gives new meaning to a place once associated with despair.\n\nZPCS Commissioner General Moses Chihobvu highlighted the practical benefits of the conversion: This initiative allows us to generate revenue through museum visits while also symbolizing our alignment with modern penal reforms and the abolition of the death penalty.\n\nZimbabwes death penalty history is intertwined with its colonial and post-independence legal systems.\n\nExecutions were a common feature during the 1970s and early 1980s, primarily targeting political dissidents and convicted criminals.\n\nHowever, no executions have been carried out since 2005, owing to growing advocacy against the practice and a lack of a hangman willing to perform the grim task.\n\nThe abolition of the death penalty is a milestone in Zimbabwes justice system.\n\nPresident Mnangagwa, himself a former death row inmate during the liberation struggle, has been a vocal advocate against capital punishment.\n\nHis governments approval of the bill to abolish the death penalty demonstrates Zimbabwes commitment to aligning with global human rights standards.\n\nLocated on the outskirts of Harare, Chikurubi Maximum Security Prison houses over 2,000 inmates, with the majority serving long sentences.\n\nKnown for its harsh conditions, the prison has been at the center of various reform initiatives aimed at improving the rehabilitation of inmates.\n\nThe conversion of the gallows into a museum and radio studios is expected to contribute to educational and awareness efforts while generating revenue for the ZPCS.\n\nIt also provides an opportunity for the public to engage with the history of Zimbabwes justice system, learn about the abolition of the death penalty, and explore avenues for promoting restorative justice.\n\nThis transformation represents a symbolic closure of a dark chapter in Zimbabwes penal history, paving the way for a new era centered on rehabilitation and human rights.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati- The Zimbabwe Prisons and Correctional Service (ZPCS) has repurposed the infamous hanging gallows at Chikurubi Maximum Security … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/prisons-close-hanging-gallows-turn-them-to-museum/\">Continue reading<span class=\"screen-reader-text\"> \"Prisons Close Hanging Gallows, Turn Them To Museum\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Chen Chimutengwende Dies",
            "url": "https://www.zimeye.net/2025/01/17/chen-chimutengwende-dies/",
            "content": "By Munacho Gwamanda- Ex-cabinet minister Chenhamo Chen Chakezha Chimutengwende has died.He was 81.\n\nThe former Information,Posts and Telecommunications MinisteChimutengwende died Thursday evening.\n\nHis son, Tawanda Chimutengwende, confirmed the death last night.\n\nHe said his father had chronic kidney disease.\n\nBurial arrangements will be announced in due course.Born on August 28 1943, Cde Chimutengwende first became a Zanu PF Member of Parliament in 1985 in Mazowe, and would be a legislator for over 25 years.\n\nHe also served for 14 years as a Cabinet minister.\n\nChimutengwende served as Senator and Deputy President of the Senate, Member of the Pan-African Parliament (PAP) and Head of the Zimbabwe delegation to the PAP.\n\nHe earned a Masters degree in Social Science and a PhD from the University of Bradford in the UK.-State media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Ex-cabinet minister Chenhamo “Chen” Chakezha Chimutengwende has died. He was 81. The former Information, Posts and Telecommunications MinisteChimutengwende died … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/chen-chimutengwende-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Chen Chimutengwende Dies\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Movie Style ZRP Cops Catch Robber Within 24Hours",
            "url": "https://www.zimeye.net/2025/01/17/movie-style-zrp-cops-catch-robber-with-24hours/",
            "content": "Nyazura Farm Robbery Suspects Arrested in Daring Police Operation\n\nIn a swift response that could rival scenes from a Hollywood blockbuster, Nyazura police apprehended two suspects involved in a violent armed robbery at Cavalla Farm just a day after the crime was committed.\n\nOn December 1, 2024, at approximately 5:40 PM, a group of armed robbers stormed the property of prominent farmer Mr. Peter Dziruni, attacking him, his family, and an employee. The victims, including Mr. Dziruni (72), Ms. Maria Nyamusamba (70), Mr. Keith Dziruni (32), and Mr. Blessed Mafuta (43), were assaulted, bound, and robbed of valuables amounting to US$25,348.\n\nThe assailants, identified as Godfrey Mulizwe (20) and Herbert Ngwenya (46), were captured on December 3, 2024, following a police manhunt that led to Murambinda. The duo was found with some of the stolen items, including Mr. Dzirunis Toyota Hilux, four guns, and various personal belongings.\n\nDuring their court appearance before Rusape regional magistrate Mr. Francis Mapfumo, Mulizwe and Ngwenya were charged with four counts of armed robbery and remanded in custody until February 27, 2025, for routine remand. Prosecutor Mr. Tawanda Munjanja detailed the violent nature of the robbery, highlighting how the suspects assaulted the victims with the butts of their firearms, demanding cash and stealing items ranging from cash and cellphones to clothing and even biscuits.\n\nThe police operation not only led to the arrest of these two individuals but also the recovery of property valued at US$24,139. Despite these arrests, the search continues for the other accomplices involved in the crime.\n\nThis incident has shaken the local community, bringing to light the bravery and efficiency of the Nyazura police force in tackling crime with vigor and determination. The community and victims are relieved by the quick action but remain vigilant as the hunt for the remaining culprits continues.- Manica Post\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Nyazura Farm Robbery Suspects Arrested in Daring Police Operation In a swift response that could rival scenes from a Hollywood … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/movie-style-zrp-cops-catch-robber-with-24hours/\">Continue reading<span class=\"screen-reader-text\"> \"Movie Style ZRP Cops Catch Robber Within 24Hours\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Man Jailed For Stealing Neighbour’s Goat",
            "url": "https://www.zimeye.net/2025/01/17/man-jailed-for-stealing-neighbours-goat/",
            "content": "By A Correspondent\n\nShylock Zulu (28), from Themba Ndlovu Homestead in Mashala Village, Hwange, has been convicted and sentenced to six months in prison for stock theft.\n\nThe incident occurred on January 8, 2025, at the Mashala grazing area, where Zulu unlawfully took a black and white male goat belonging to Thabani Sibanda. After slaughtering the goat, Zulu went to Sibandas homestead and sold the meat from the carcass for USD$15, claiming it was bush buck meat.\n\nSibanda became suspicious when the meat resembled that of his missing goat. His suspicions were confirmed, leading to Zulus arrest and subsequent conviction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Shylock Zulu (28), from Themba Ndlovu Homestead in Mashala Village, Hwange, has been convicted and sentenced to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/man-jailed-for-stealing-neighbours-goat/\">Continue reading<span class=\"screen-reader-text\"> \"Man Jailed For Stealing Neighbour’s Goat\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Ancelotti Backs Tchouameni Despite Hierarchy Disapproval",
            "url": "https://www.zimeye.net/2025/01/17/ancelotti-backs-tchouameni-despite-hierarchy-disapproval/",
            "content": "Sports Correspondent\n\nCarlo Ancelotti continues to support Aurlien Tchouameni, despite growing doubts about the French midfielders ability to perform as a centre-back for Real Madrid.\n\nSince his return from injury in early December, Tchouameni has been deployed as a central defender due to the absences of key players David Alaba and Eder Militao. However, the 24-year-old has struggled in this unfamiliar position, which he has openly admitted to feeling uncomfortable in.\n\nAccording to Relevo, Real Madrids hierarchy has expressed disappointment in Tchouamenis performances. The prevailing sentiment within the club is that the Frenchman has not lived up to the high expectations placed upon him following his 80 million transfer from AS Monaco in 2022. Despite these concerns, Ancelotti remains supportive, continuing to field the player in various defensive roles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Carlo Ancelotti continues to support Aurélien Tchouameni, despite growing doubts about the French midfielder’s ability to perform as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/ancelotti-backs-tchouameni-despite-hierarchy-disapproval/\">Continue reading<span class=\"screen-reader-text\"> \"Ancelotti Backs Tchouameni Despite Hierarchy Disapproval\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Zanu PF Murakashi Mukuru Gets Brand New Car From Chivayo",
            "url": "https://www.zimeye.net/2025/01/17/zanu-pf-murakashi-mukuru-gets-brand-new-car-from-chivayo/",
            "content": "By A Correspondent\n\nA loyal Zanu PF foot-soldier, C.H Mukungunugwa, has received a brand-new Mercedes Benz C200 from controversial businessman and ruling party supporter Wicknell Chivayo.\n\nThe gesture has raised eyebrows, as Chivayo, known for his close ties to the ruling party, shared the news on his social media platform, X.\n\nI want to appreciate a committed ZANU PF cadre and information strategist Mr. C. H. MUKUNGUNUGWA, for his remarkable dedication to the party, Chivayo wrote. His unwavering efforts in publicizing ZANU PF activities and ensuring the nation remains informed about key developments in the ruling party have been truly outstanding.\n\nChivayo, a controversial businessman associated with Zanu PF, has previously faced scrutiny over his wealth and business dealings.\n\nHis latest gesture has reignited questions about the sources of his fortune, particularly his penchant for rewarding loyal party members.\n\nThe gift to Mukungunugwa, often referred to as a bootlicker due to his strong public support for President Emmerson Mnangagwa, has sparked debate on social media, with critics questioning whether such acts of generosity are a way to further cement loyalty within the party ranks.\n\nChivayos distribution of cars to Zanu PF loyalists has become a point of contention, fueling further speculation about his influence within the party and the nature of his business operations. As the debate over his wealth continues, his latest gesture adds fuel to the ongoing conversation about the intersection of business, politics, and loyalty in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A loyal Zanu PF foot-soldier, C.H Mukungunugwa, has received a brand-new Mercedes Benz C200 from controversial businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/zanu-pf-murakashi-mukuru-gets-brand-new-car-from-chivayo/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Murakashi Mukuru Gets Brand New Car From Chivayo\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Mnangagwa Is Zanu PF Creator, Declares Youth Leader",
            "url": "https://www.zimeye.net/2025/01/17/mnangagwa-is-zanu-pf-creator-declares-youth-leader/",
            "content": "By A Correspondent\n\nZanu PF Youth League official Taurai Kandishaya has made a bold statement, claiming that President Emmerson Mnangagwa is not only a long-standing member of the ruling party but its very architect, implying that Mnangagwa is the true owner of Zanu PF.\n\nIn a passionate address on Tuesday, Kandishaya hailed Mnangagwas pivotal role in shaping the party, stating, Here is the man who has been a part of ZANU PF since 1964.\n\nHe has never betrayed the struggle and remains the only surviving member of the first ZANU PF Politburo. Kandishaya continued to outline Mnangagwas immense contribution to both the party and the nation, positioning him as the central figure in Zimbabwes political history.\n\nThis man is not just a member of ZANU PF, but its architect, having laid the foundation and cast the pillars, he said. He established the National Security System of our beloved Zimbabwe. Kandishaya went on to describe Mnangagwa as a leader who bridges the past, present, and future of Zimbabwes political landscape.\n\nThe youth leader emphasized Mnangagwas unique place in Southern Africas political history, noting, As the only President in SADC who worked alongside the founding fathers of African solidarity, he embodies a perfect blend of past, present, and future.\n\nKandishaya also underscored the challenges Mnangagwa has overcome throughout his political career.\n\nHis entire political life has been marked by naysayers who claim he will not get, he will fail, he cannot, but he continues to triumph, he stated, commending the Presidents resilience and ability to outmaneuver his detractors.\n\nThe remarks come as Mnangagwa continues to consolidate power within the party, with some party officials and analysts debating the long-term future of Zanu PF leadership.\n\nKandishayas strong endorsement positions the President as not just a leader, but as the enduring foundation of the party itself, effectively claiming ownership over its direction and legacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Youth League official Taurai Kandishaya has made a bold statement, claiming that President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/mnangagwa-is-zanu-pf-creator-declares-youth-leader/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Is Zanu PF Creator, Declares Youth Leader\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Magpies Bury Wolves",
            "url": "https://www.zimeye.net/2025/01/17/magpies-bury-wolves/",
            "content": "By A Correspondent\n\nBarcelona delivered a dominating performance, crushing Real Betis 5-1 in the Copa Del Rey.\n\nThe Catalan giants were in top form, scoring five goals to secure a convincing victory.\n\nMeanwhile, in the English Premier League, several matches took place:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Barcelona delivered a dominating performance, crushing Real Betis 5-1 in the Copa Del Rey. The Catalan giants … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/magpies-bury-wolves/\">Continue reading<span class=\"screen-reader-text\"> \"Magpies Bury Wolves\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Shadreck Nyahwa Leaves DeMbare",
            "url": "https://www.zimeye.net/2025/01/17/dembare-lose-star-defender-2/",
            "content": "Sports Correspondent\n\nIn a significant blow to Harare soccer giants Dynamos FC, star defender Shadreck Nyahwa has made a shocking exit from the club. Nyahwa has reunited with his former coach, Herbert Maruwa, at TelOne FC, marking a major transfer coup for the club.\n\nNyahwa, widely regarded as one of the best defenders in the Premier Soccer League, had been a key player for Dynamos FC. His departure is a substantial loss for the team, and fans are likely to feel the impact of his absence.\n\nIn a cryptic social media post, Nyahwa seemed to celebrate his move, writing Tambosiya zveku pusher chicken bus The message, while unclear, appears to reflect his excitement about the new chapter in his career.\n\nNyahwas reunion with Maruwa, his former coach at Dynamos FC, is seen as a major factor in his decision to join TelOne FC. Maruwas influence and guidance are likely to play a significant role in Nyahwas future success.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a significant blow to Harare soccer giants Dynamos FC, star defender Shadreck Nyahwa has made a shocking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/dembare-lose-star-defender-2/\">Continue reading<span class=\"screen-reader-text\"> \"Shadreck Nyahwa Leaves DeMbare\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        },
        {
            "title": "Man Steals Neighbour’s Goat, Sells Meat To Owner",
            "url": "https://www.zimeye.net/2025/01/17/man-steals-neighbours-goat-sells-meat-to-owner/",
            "content": "By A Correspondent\n\nShylock Zulu (28), from Themba Ndlovu Homestead in Mashala Village, Hwange, has been convicted and sentenced to six months in prison for stock theft.\n\nThe incident occurred on January 8, 2025, at the Mashala grazing area, where Zulu unlawfully took a black and white male goat belonging to Thabani Sibanda. After slaughtering the goat, Zulu went to Sibandas homestead and sold the meat from the carcass for USD$15, claiming it was bush buck meat.\n\nSibanda became suspicious when the meat resembled that of his missing goat. His suspicions were confirmed, leading to Zulus arrest and subsequent conviction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Shylock Zulu (28), from Themba Ndlovu Homestead in Mashala Village, Hwange, has been convicted and sentenced to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/17/man-steals-neighbours-goat-sells-meat-to-owner/\">Continue reading<span class=\"screen-reader-text\"> \"Man Steals Neighbour’s Goat, Sells Meat To Owner\"</span></a></p>",
            "time": "18:28",
            "date": "17 Jan 2025"
        }
    ]
}