{
    "news": [
        {
            "title": "Clashes Expected At Zanu PF Meeting",
            "url": "https://www.zimeye.net/2025/07/30/clashes-expected-at-zanu-pf-meeting/",
            "content": "By A Correspondent  Fireworks are expected in todays politburo, which has been called for by the partys Zanu PF Secretary General Obert Mpofu at the partys headquarters, with no formal agenda publicly disclosed.\n\nThe timing of the meeting has raised eyebrows, coming amid escalating factional tensions, as insiders warn that the long-standing feud between Vice President Constantino Chiwenga and controversial businessman Kudakwashe Tagwirei is nearing a breaking point.\n\nAccording to an official party notice, the high-level meeting will take place at Zanu PFs national headquarters on Wednesday, July 30, beginning at 10:00am.\n\nThe Secretary General of ZANU PF, Cde. Dr. O. M. Mpofu advises members of a Politburo meeting to be held this Wednesday, 30 July 2025 at 1000hrs. The meeting shall be held at ZANU PF HEADQUARTERS. All members should be seated by 0945 Hours sharp, the statement read.\n\nBut party insiders say the real purpose of the meeting lies beyond the formalities. At the heart of the gathering is the growing power struggle between Chiwenga and Tagwirei  a battle that is now threatening to destabilise internal party cohesion.\n\nTagwirei, a billionaire businessman with deep interests in the fuel, mining, and financial sectors, is widely seen as President Emmerson Mnangagwas preferred successor. This perception has alarmed elements within the military-aligned camp of Zanu PF, particularly those loyal to Chiwenga.\n\nChiwenga believes Tagwirei is overstepping. Theres growing unease over the amount of influence the businessman now wields  not only in state contracts but within the partys internal decision-making processes, a senior Zanu PF source told this publication on condition of anonymity.\n\nWhile the rivalry has long been whispered about in backroom discussions, it has increasingly surfaced in public discourse in recent months, with factions openly jostling for control  a situation that threatens to further fracture the ruling party as it prepares for future leadership transitions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Fireworks are expected in today’s politburo, which has been called for by the party’s Zanu PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/clashes-expected-at-zanu-pf-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Clashes Expected At Zanu PF Meeting\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "VP Chiwenga Celebrates Ex-Wife’s Down-Fall",
            "url": "https://www.zimeye.net/2025/07/30/vp-chiwenga-celebrates-ex-wifes-down-fall/",
            "content": "By A Correspondent Vice President General (Retired) Constantino Chiwenga has openly welcomed the South African High Courts decision to forfeit assets belonging to his ex-wife, Marry Mubaiwa  a move critics say reveals the Vice Presidents unrelenting pursuit of vengeance masked as a fight for justice.\n\nIn a strongly worded statement issued through his lawyer, Lewis Uriri of Machingura Legal Practitioners, Chiwenga hailed the ruling as a victory for cross-border justice and accountability. The Vice President praised the collaboration between Zimbabwes National Prosecuting Authority (NPA) and its South African counterpart, which led to the forfeiture of Mubaiwas assets.\n\nNotably, Chiwenga  who has for four years now blocked Marry from seeing or accessing their children  claimed the ruling demonstrated that the proceeds of crime should find no sanctuary. This latest development adds another layer to a bitter and protracted saga that has left Mubaiwa stripped of both property and access to her children.\n\nOn 28 July 2025, the South African NPA confirmed that the Gauteng High Court, under Case No. 6435/22, had granted an order declaring Mubaiwas Pretoria property and two luxury Range Rover vehicles to be proceeds of crime. The assets, initially preserved in 2022, are now in the custody of an auctioneer. One of the vehicles has already been sold, with proceeds earmarked for restitution.\n\nChiwengas legal team said he played a direct role in initiating the matter by alerting authorities to the alleged misconduct.\n\nUpon becoming aware of the unlawful activities in question, he promptly reported the matter and has since rendered his full cooperation to the National Prosecuting Authority, said Uriri.His actions were motivated solely by the national interest and in furtherance of justice and accountability.\n\nBut human rights advocates and those close to Mubaiwa see it differently  pointing to a ruthless campaign by the Vice President to completely destroy his former partner, politically, financially, and emotionally. Despite her deteriorating health and multiple medical pleas, Mubaiwa has been denied custody and visitation rights since their acrimonious separation.\n\nOnce Zimbabwes celebrated First Lady-in-waiting, Mubaiwas fall from grace has been swift and brutal. The couples messy divorce has played out in multiple courtrooms, involving explosive allegations of attempted murder, fraud, and money laundering  all while Chiwenga, a powerful former military commander, remains insulated by state machinery.\n\nCritics argue that the Vice Presidents cold celebration of his ex-wifes downfall reveals more about power and revenge than justice  especially in a country where the law often serves the politically connected.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Vice President General (Retired) Constantino Chiwenga has openly welcomed the South African High Court’s decision to forfeit … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/vp-chiwenga-celebrates-ex-wifes-down-fall/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Celebrates Ex-Wife’s Down-Fall\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "Top CIO Agent Escapes Jail",
            "url": "https://www.zimeye.net/2025/07/30/top-cio-agent-escapes-jail/",
            "content": "By Crime and Courts Reporter-A Gweru-based member of the dreaded Central Intelligence Organization (CIO) has been cleared of rape charges.\n\nGweru regional magistrate Christopher Maturure yesterday acquitted a 45-year-old Makopa Manyadze who was facing allegations of raping a 20-year-old woman. He denied the charges.\n\nHis lawyer Innocent Hore applied for discharge at the close of the States case and Maturure ruled in favour of Manyadze, saying the State had failed to prove a case against the accused.\n\nIt was the States case that on June 23 this year, the complainant was at home alone in Kopje, Gweru, when Manyadze, who had earlier instructed her to bath, arrived at her residence.\n\nThe CIO operative allegedly ordered the complainant to sit closer to him when he got into house. When she refused, he allegedly grabbed her by the waist and fondled her breasts.\n\nFurther allegations were that Manyadze threw the complainant on a bed and continued fondling her breasts, stomach and thighs.\n\nThe State further alleged that Manyadze then removed the complainants clothes and raped her once.\n\nAfter the alleged offence, the accused person instructed the complainant to dress up and open the gate for him.\n\nThe matter was reported to the police by the complainants mother, after she informed her twin sister, who is based in Bulawayo, on the day the alleged assault took place. Newsday\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-A Gweru-based member of the dreaded Central Intelligence Organization (CIO) has been cleared of rape charges. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/top-cio-agent-escapes-jail/\">Continue reading<span class=\"screen-reader-text\"> \"Top CIO Agent Escapes Jail\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "Fireworks At Politburo Meeting",
            "url": "https://www.zimeye.net/2025/07/30/fireworks-at-politburo-meeting/",
            "content": "By A Correspondent  Fireworks are expected in todays politburo, which has been called for by the partys Zanu PF Secretary General Obert Mpofu at the partys headquarters, with no formal agenda publicly disclosed.\n\nThe timing of the meeting has raised eyebrows, coming amid escalating factional tensions, as insiders warn that the long-standing feud between Vice President Constantino Chiwenga and controversial businessman Kudakwashe Tagwirei is nearing a breaking point.\n\nAccording to an official party notice, the high-level meeting will take place at Zanu PFs national headquarters on Wednesday, July 30, beginning at 10:00am.\n\nThe Secretary General of ZANU PF, Cde. Dr. O. M. Mpofu advises members of a Politburo meeting to be held this Wednesday, 30 July 2025 at 1000hrs. The meeting shall be held at ZANU PF HEADQUARTERS. All members should be seated by 0945 Hours sharp, the statement read.\n\nBut party insiders say the real purpose of the meeting lies beyond the formalities. At the heart of the gathering is the growing power struggle between Chiwenga and Tagwirei  a battle that is now threatening to destabilise internal party cohesion.\n\nTagwirei, a billionaire businessman with deep interests in the fuel, mining, and financial sectors, is widely seen as President Emmerson Mnangagwas preferred successor. This perception has alarmed elements within the military-aligned camp of Zanu PF, particularly those loyal to Chiwenga.\n\nChiwenga believes Tagwirei is overstepping. Theres growing unease over the amount of influence the businessman now wields  not only in state contracts but within the partys internal decision-making processes, a senior Zanu PF source told this publication on condition of anonymity.\n\nWhile the rivalry has long been whispered about in backroom discussions, it has increasingly surfaced in public discourse in recent months, with factions openly jostling for control  a situation that threatens to further fracture the ruling party as it prepares for future leadership transitions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Fireworks are expected in today’s politburo, which has been called for by the party’s Zanu PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/fireworks-at-politburo-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Fireworks At Politburo Meeting\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "ZANU PF Politburo Meets Amid Explosive Tagwirei–Chiwenga Power Struggle",
            "url": "https://www.zimeye.net/2025/07/30/zanu-pf-politburo-meets-amid-explosive-tagwirei-chiwenga-power-struggle/",
            "content": "By A Correspondent\n\nZANU PFs powerful Politburo convenes in Harare today under a cloud of escalating factional tensions, with insiders warning that the long-simmering feud between Vice President Constantino Chiwenga and tycoon Kudakwashe Tagwirei is reaching a boiling point.\n\nThe party announced that the high-stakes meeting will take place at its national headquarters on Wednesday, July 30, starting at 10:00am.\n\nThe Secretary General of ZANU PF, Cde. Dr. O. M. Mpofu advises members of a Politburo meeting to be held this Wednesday, 30 July 2025 at 1000hrs. The meeting shall be held at ZANU PF HEADQUARTERS. All members should be seated by 0945 Hours sharp, read the official statement.\n\nBut beyond the formal agenda, insiders say the elephant in the room is the increasingly toxic power struggle between Chiwenga and Tagwirei  a contest that is now threatening party cohesion.\n\nTagwirei, a wealthy and controversial businessman with vast interests in energy, finance, and transport, is reportedly viewed as President Emmerson Mnangagwas preferred successor  a position that has sparked concern within the military-aligned faction of the party.\n\nChiwenga views Tagwirei as overreaching. Theres growing resentment over the amount of political sway the businessman holds  not just in government projects, but also in internal party affairs, a senior ZANU PF official told this publication on condition of anonymity.\n\nThe tension, which had previously been simmering behind closed doors, has become more open in recent months, with competing camps within ZANU PF now aligning themselves with either Chiwengas nationalist-military bloc or Tagwireis technocratic-business wing.\n\nWhat we are witnessing is more than a personal rivalry. Its a battle over the future direction of the party  whether it remains under the firm grip of its liberation war roots or shifts toward elite economic interests, the party insider added.\n\nSome Politburo members are reportedly growing uneasy about Tagwireis perceived kingmaker role, especially in light of speculation surrounding the partys succession dynamics and the 2028 elections.\n\nTodays meeting is likely to see subtle but significant moves by both camps to test influence and shore up support, even if no direct confrontation occurs.\n\nThe cracks are widening, and the centre may not hold if this tension is not managed carefully, the source said.\n\nZANU PF has not publicly commented on the internal rift, but the outcome of todays meeting may offer hints about which direction the party is leaning  and whether Tagwireis influence will be clipped or consolidated.\n\nAs political observers watch closely, the spotlight remains on the uneasy alliance between power and capital at the heart of Zimbabwes ruling elite.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF’s powerful Politburo convenes in Harare today under a cloud of escalating factional tensions, with insiders … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/zanu-pf-politburo-meets-amid-explosive-tagwirei-chiwenga-power-struggle/\">Continue reading<span class=\"screen-reader-text\"> \"ZANU PF Politburo Meets Amid Explosive Tagwirei–Chiwenga Power Struggle\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "UK: Police Called As COS Fraud Suspect Caught By Pregnant Girlfriend Marrying Another Woman",
            "url": "https://www.zimeye.net/2025/07/30/uk-police-called-as-cos-fraud-suspect-caught-by-pregnant-girlfriend-marrying-another-woman/",
            "content": "By Farai D Hove | Cheltenham, UK  29 July 2025\n\nA dramatic confrontation unfolded at the luxurious Greenway Hotel and Spa in Cheltenham on Tuesday evening after Munyaradzi Mangoma  a former British soldier accused of orchestrating a major Certificate of Sponsorship (CoS) scam  was caught by his girlfriend attempting to marry another woman in secret.\n\nThe exclusive event, booked under the name Mike Mangoma for private dining in the Panel Room, was intended for a party of 10 guests. But chaos erupted when Mangomas current girlfriend stormed the venue mid-dinner and confronted him in front of stunned guests and staff.\n\nEyewitness video posted by user @theresa_abs captured the scene as police vehicles swarmed the hotel grounds. She wrote:\n\nImagine another car pulled up  the people inside were moving mad but mi nah fraid of nobodyyyyy \n\nHotel staff called the police after the confrontation escalated, prompting swift law enforcement intervention. No arrests have been confirmed, but Mangoma was reportedly escorted out under police supervision.\n\nFRAUD INVESTIGATION INTENSIFIES\n\nThe incident has cast a fresh spotlight on serious fraud allegations against Mangoma. ZimEye investigations reveal he has been linked to a CoS scam targeting Zimbabweans seeking UK care work, with victims paying thousands of pounds for fake visa sponsorship documents.\n\nDespite his previous conviction for bank fraud (as reported by The Telegraph), Mangoma resurfaced in recent months promoting CoS services while claiming to be affiliated with a registered UK employer. Victims allege he collected payments but failed to deliver valid sponsorship certificates or job placements.\n\nIn one recorded interview, Mangoma failed to provide proof of employment or any signed contracts, instead blaming intermediaries and dodging accountability.\n\nNO ESCAPE YET\n\nContrary to earlier speculation that Mangoma had fled to Zimbabwe, he was physically present in the UK on 29 July 2025 during the Greenway Hotel incident. His current whereabouts remain unclear following the confrontation.\n\nZimEye has documented at least 10,000 in confirmed losses from two victims, though actual figures are believed to be much higher.\n\nUK authorities are now under pressure to act.\n\n Takeaways:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | Cheltenham, UK – 29 July 2025 A dramatic confrontation unfolded at the luxurious Greenway Hotel … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/uk-police-called-as-cos-fraud-suspect-caught-by-pregnant-girlfriend-marrying-another-woman/\">Continue reading<span class=\"screen-reader-text\"> \"UK: Police Called As COS Fraud Suspect Caught By Pregnant Girlfriend Marrying Another Woman\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "Top Doctor in Court Over Misuse of Funds",
            "url": "https://www.zimeye.net/2025/07/30/top-doctor-in-court-over-misuse-of-funds/",
            "content": "By A Correspondent\n\nVice Chairperson of the Medical and Dental Practitioners Council of Zimbabwe, Dr. Zindoga Tizirai Bungu, has found himself in legal trouble after being accused of misappropriating council funds to pay for another officials legal fees.\n\nBungu appeared before regional magistrate Mr. Donald Ndirowei facing charges of criminal abuse of duty as a public officer.\n\nHe was granted US$200 bail and ordered not to report to his workplace or interfere with witnesses. He has not yet entered a plea.\n\nThe allegations stem from events that began on December 17, 2024, when the councils registrar, Colin Benyure, was arrested by the CIDs Commercial Crimes Division and charged with perjury in his personal capacity. Following his arrest, a decision was made to cover his legal costs using council funds.\n\nAccording to the State, on March 3, 2025, Bungu and the councils chairperson, Dr. Rose Kambarami, agreed to pay Benyures legal expenses using public money. A day later, on March 4, the councils finance department processed two payments  US$4,120 and US$3,690.99  to reimburse Benyure.\n\nHowever, prosecutors say this decision went against resolutions made at two earlier council meetings held on January 9 and January 15, where it had been agreed that Benyure would cover his own legal fees, based on advice from the councils lawyers.\n\nThe State further alleges that the payments violated the Public Finance Management Act Regulations and amounted to an abuse of public office for the benefit of a colleague.\n\nIn a separate incident, Benyure is accused of misusing council funds to pay his own US$200 bail. After his arrest, he allegedly instructed administrator Filistas Chari to obtain the amount from council funds. The money was reportedly handed over by finance staff to one Tendai Chinyama, who delivered it to the court on Benyures behalf.\n\nThe council later resolved that Benyure must repay the US$200 and fund his own legal defence. To date, however, no reimbursement has been made, the court heard.\n\nProsecutors argue that the conduct of Bungu and his co-accused was not only inconsistent with their duties as public officers but also in direct violation of financial governance regulations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Vice Chairperson of the Medical and Dental Practitioners Council of Zimbabwe, Dr. Zindoga Tizirai Bungu, has found … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/top-doctor-in-court-over-misuse-of-funds/\">Continue reading<span class=\"screen-reader-text\"> \"Top Doctor in Court Over Misuse of Funds\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "Hwende Refuses To Vacate Portfolio Of Public Money | Video",
            "url": "https://www.zimeye.net/2025/07/30/hwende-refuses-to-vacate-portfolio-of-public-money-video/",
            "content": "Kana kuParamende vanogwirana  zvigaro. Hon Hwende vadya hukwe pic.twitter.com/9Bpl9RODoW\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "Businessman Thrown Back in Jail",
            "url": "https://www.zimeye.net/2025/07/30/businessman-thrown-back-in-jail/",
            "content": "By A Correspondent | Harare | 30 July 2025\n\nControversial Harare businessman Shingai Levison Muringi is back in police custody after allegedly defaulting on a court-ordered community service sentence. Muringi had been convicted of contempt of court for illegally selling a vehicle that was being held as an exhibit in a criminal case.\n\nHarare magistrate Lisa Mutendereki had ordered Muringi to perform community service at Marlbereign Police Station, but a warrant for his arrest was later issued after he reportedly failed to comply. A default inquiry into the matter is currently underway and is set to resume today.\n\nMuringis legal troubles began after he sold a white Toyota Hilux double cab, registration number AGE 2352, to businessman Patrick Chimpa Mutenha for US$50,000despite a standing court order prohibiting him from disposing of the vehicle.\n\nThe vehicle had initially been impounded by the Zimbabwe Republic Polices Commercial Crimes Division on August 4, 2024, when Muringi was arrested on fraud and money laundering charges. Though he was later granted temporary access to the car by a December 18 court order, the condition was clear: the vehicle was to be kept intact and made available to the State upon request.\n\nHowever, just two days later, on December 20, Muringi proceeded to sell the vehicle to Chimpa without disclosing its legal status.\n\nIn a judgment handed down by Magistrate Mutendereki, the court found that Muringi had deliberately breached the conditions of the release order.\n\nThe car was subject to a criminal case that was ongoing by selling the vehicle he would have breached the order as he wouldnt then be able to produce it upon demand by the court, she said.\n\nTo make matters worse, Muringi reportedly attempted to recover the car by falsely reporting it stolenresulting in Chimpas arrest by the Vehicle Theft Squad. During investigations, authorities discovered the true status of the car, which has since been re-impounded and remains in police custody.\n\nMuringis repeated disregard for the law has raised serious concerns about abuse of court processes and manipulation of the justice system by high-profile individuals. Legal experts say the case highlights a troubling pattern of defiance and deception, and could have wider implications if community service penalties continue to be undermined.\n\nThe ongoing inquiry will determine whether Muringi will face additional penalties for defaulting on his sentence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Harare | 30 July 2025 Controversial Harare businessman Shingai Levison Muringi is back in police custody … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/businessman-thrown-back-in-jail/\">Continue reading<span class=\"screen-reader-text\"> \"Businessman Thrown Back in Jail\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        },
        {
            "title": "Mnangagwa Regime Boasts Of Health System ‘Upgrades’ While Hospitals Rot",
            "url": "https://www.zimeye.net/2025/07/30/mnangagwa-regime-boasts-of-health-system-upgrades-while-hospitals-rot/",
            "content": "By A Correspondent\n\nThe Emmerson Mnangagwa administration is facing mounting criticism after claiming major progress in revamping Zimbabwes healthcare systemdespite widespread reports of hospital decay, drug shortages, and staff walkouts across the country.\n\nAt the centre of the governments recent media blitz is a new 52-room diagnostic laboratory at United Bulawayo Hospitals (UBH), which officials say positions the facility as a one-stop centre for testing and diagnosing infectious diseases, including Ebola.\n\nThis is a big laboratory, and it can diagnose infectious diseases like Ebola. It has increased our power to diagnose as an institution. We are now a one-stop centre, we no longer outsource services, and this has brought a lot of convenience to our patients, said UBH Chief Medical Officer, Dr William Busumani.\n\nGovernment spokespersons also praised the installation of a solar plant at UBH, citing it as part of the Second Republics commitment to uninterrupted healthcare delivery.\n\nThe Second Republic also equipped our institution with a solar plant. This plant has helped ensure that even when there is an electrical fault in a hospital, we are not disturbed, Busumani added.\n\nInformation Minister Dr Jenfan Muswere echoed the governments feel-good narrative:So many success stories have been recorded here in Bulawayo. Some of the stories include the expansion of many institutions. This has contributed towards the countrys industrialisation drive.\n\nBut outside of official statements, the reality on the ground paints a bleaker picture.\n\nPublic hospitals nationwide continue to grapple with chronic underfunding, lack of essential medication, understaffing, and dilapidated infrastructure. Patients often bring their own medical supplies or endure months-long waits for surgery. In rural areas, clinics operate without electricity or running water.\n\nCritics say the government is using isolated infrastructure upgrades to whitewash a national health crisis.\n\nThe government is trying to score political points with a few cosmetic upgrades while the rest of the country suffers, said a Harare-based medical professional. One lab doesnt fix a broken system.\n\nAt Parirenyatwa Hospital in Harareone of the countrys largest referral hospitalsongoing refurbishments have failed to address systemic issues like malfunctioning equipment, power cuts, and staff burnout.\n\nDespite claiming it is working toward universal health coverage, the Mnangagwa regime has done little to address the deep-rooted collapse of the sector. Analysts warn that without genuine reforms and increased investment, Zimbabwes health system will continue to deteriorateno matter how many ribbon-cutting ceremonies are held.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Emmerson Mnangagwa administration is facing mounting criticism after claiming major progress in revamping Zimbabwe’s healthcare system—despite … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/30/mnangagwa-regime-boasts-of-health-system-upgrades-while-hospitals-rot/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Boasts Of Health System ‘Upgrades’ While Hospitals Rot\"</span></a></p>",
            "time": "08:48",
            "date": "31 Jul 2025"
        }
    ]
}