{
    "news": [
        {
            "title": "Top African Author, Academic Ngũgĩ wa Thiong’o Dies",
            "url": "https://www.zimeye.net/2025/05/28/top-african-author-academic-ngugi-wa-thiongo-dies/",
            "content": "By A Correspondent Celebrated Kenyan author and academic Ngg wa Thiongo has died at the age of 87.\n\nRegarded as a titan of African literature, Nggs career spanned over six decades. He chronicled Kenyas journey from colonial rule to independence, using his pen to challenge both colonial and post-colonial regimes. His fearless commitment to writing in African languagesespecially Kikuyucemented his legacy as a literary revolutionary.\n\nBorn James Thiongo Ngg in 1938 in colonial Kenya, Nggs early life was shaped by the brutality of British repression during the Mau Mau uprising. His brother was shot by colonial soldiers, and his village was razed. These experiences heavily influenced his early works.\n\nNggs literary journey took off after he shared the manuscript of his first novelWeep Not, Childwith Chinua Achebe at Makerere University. The novel, published in 1964, was the first major English-language novel by an East African writer. He soon publishedThe River Between,A Grain of Wheat, andPetals of Bloodthe last of which criticized Kenyas new elite.\n\nIn 1977, Ngg abandoned English for Kikuyu and was imprisoned for co-writing a politically charged play. He famously wrote his first Kikuyu novel,Devil on the Cross, on toilet paper while jailed.\n\nExiled for over two decades, he taught at leading universities in the US, including Yale and UC Irvine. Despite enduring jail, exile, cancer, and a brutal home invasion, Ngg remained an outspoken champion of decolonising African literature.\n\nHis seminal workDecolonising the Mindchallenged African writers to abandon colonial languages. He had nine children, including author Mukoma wa Ngg.\n\nThough tipped for the Nobel Prize many times, he never won. Still, Ngg wa Thiongo leaves behind a legacy that reshaped African storytelling forever.\n\nSource: BBC\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Celebrated Kenyan author and academic Ngũgĩ wa Thiong’o has died at the age of 87. Regarded as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/top-african-author-academic-ngugi-wa-thiongo-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Top African Author, Academic Ngũgĩ wa Thiong’o Dies\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Mnangagwa Declares His Near Farm Accident A National Disaster",
            "url": "https://www.zimeye.net/2025/05/28/mnangagwa-declares-his-near-farm-accident-a-national-disaster/",
            "content": "By A Correspondent-President Emmerson Mnangagwa has declared the tragic road accident near Sebakwe River, which claimed 12 lives on Tuesday, 27 May, a national disaster.\n\nThe fatal crash occurred just a few kilometres from the Presidents private property, Precabe Farm, situated outside Kwekwe in the Midlands Province. The Sebakwe River area, close to the scene of the crash, is a known traffic black spot that has claimed numerous lives over the years due to its treacherous bends and high volumes of cross-country traffic.\n\nSebakwe River is a significant watercourse in central Zimbabwe, straddling the boundary between the Mashonaland West and Midlands provinces. It not only supports agricultural activities around President Mnangagwas sprawling Precabe Farm but also serves as a vital source of irrigation and livestock water for surrounding farming communities. The region has witnessed increasing vehicular traffic, particularly haulage trucks transporting fuel and agricultural produce.\n\nDetails of the Crash\n\nAccording to the Zimbabwe Republic Police (ZRP), the collision involved a petrol tanker pulling two trailers, a two-tonne truck, and a Nissan AD van carrying 12 passengers. Preliminary investigations indicate that the fuel tanker side-swiped the smaller truck before ploughing head-on into the AD van. The tanker reportedly dragged the van for several metres before overturning and crushing it, resulting in a horrifying scene of destruction and loss of life.\n\nPresidential Condolences and Declaration\n\nIn a message of condolence, President Mnangagwa expressed deep sorrow over the tragedy and extended heartfelt sympathies to the grieving families. He also acknowledged the pressing need to enhance road safety measures across the country.\n\nI learnt with a very heavy heart of the horrific traffic collision yesterday in Midlands which claimed twelve innocent lives, Mnangagwa said.\n\nThe deadly incident adds yet another grim statistic to the needless toll which reckless driving levies on our people and our Nation.\n\nThe President commended the ZRP for deploying high-end technologies to improve traffic management but emphasized that more decisive action is needed to reduce the growing number of road fatalities.\n\nThe duty for safe traffic conduct squarely falls on all road users, while the responsibility to call out reckless road-users includes the general public who should support our law enforcement agencies to tame what in essence has become a traffic jungle, he added.\n\nHe announced that the government would take full responsibility for the burial of the deceased and provide support to the injured, who are currently receiving treatment in local hospitals.\n\nI have since directed the responsible arms of my Government to declare this traffic accident a national disaster, Mnangagwa said. This crucial legal step paves the way for Government to move in and take all-round responsibility for the interment of all those who perished in the accident, and for support to those hospitalised.\n\nPublic Response\n\nThe declaration has been welcomed by affected families and the general public, though it has also reignited calls for the government to invest more in road safety infrastructure, particularly in accident-prone areas like Sebakwe.\n\nAs investigations into the cause of the crash continue, authorities have urged all motorists to exercise extreme caution, especially when driving along highways with known danger zones.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa has declared the tragic road accident near Sebakwe River, which claimed 12 lives on Tuesday, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/mnangagwa-declares-his-near-farm-accident-a-national-disaster/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Declares His Near Farm Accident A National Disaster\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "UN and SADC Receive Petition To Retire President Mnangagwa | FULL TEXT",
            "url": "https://www.zimeye.net/2025/05/28/un-and-sadc-receive-petition-to-retire-president-mnangagwa-full-text/",
            "content": "We, the citizens of Zimbabwe, write to bring to your urgent attention a matter of grave concern that requires immediate regional intervention. On a recent occasion, we submitted a formal letter to the Commander of the Zimbabwe Defence Forces, calling for their intervention in addressing the deepening crisis of state capture and presidential incapacity affecting our nation. The letter outlines rampant corruption by President Emmerson Mangagwa and his associates, which has plunged the country into unprecedented institutional collapse.Tragically, those who delivered the letter on behalf of the citizens are now being hunted and their lives are at serious risk. Some have fled to neighboring countries and are now living as undocumented immigrants, unable to regularize their stay due to the suddenness of their escape.We humbly appeal to you, as leaders of the SADC community, to protect these individuals from political persecution.We also wish to alert you to the emergence of a shadowy terror group within Zimbabwe, sponsored to abduct and intimidate citizens who oppose President Mangagwas attempts to illegally extend his term and entrench dynastic rule. This militia-like group represents a severe threat to national security and the safety of innocent civilians. We urgently call upon your offices to investigate and take immediate action against this threat.The scale of corruption perpetrated by the Mangagwa administration has become intolerable. State resources are being plundered for personal enrichment, leading to widespread deprivation and hardship across the country. We are convinced that only decisive regional action can help restore governance, accountability and democratic order in Zimbabwe.Accordingly, we respectfully request that you:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "We, the citizens of Zimbabwe, write to bring to your urgent attention a matter of grave concern that requires immediate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/un-and-sadc-receive-petition-to-retire-president-mnangagwa-full-text/\">Continue reading<span class=\"screen-reader-text\"> \"UN and SADC Receive Petition To Retire President Mnangagwa | FULL TEXT\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Chirambadare in Court Over Cloverdale Farm Violence",
            "url": "https://www.zimeye.net/2025/05/28/chirambadare-in-court-over-cloverdale-farm-violence/",
            "content": "By A Correspondent | ZimEye |  A Harare man was on Wednesday brought before the court on charges of public violence following a clash between police and residents resisting eviction at Cloverdale Farm, which is owned by former cabinet minister Petronella Kagonye.\n\nGarikai Chirambadare appeared before magistrate Ruth Moyo, who remanded him in custody.\n\nAccording to court papers, the incident occurred on the morning of May 16, when High Court sheriffs Sirwadi, David Dodzo, Maccduff Madenga, and Anna Chitemamiswe, accompanied by police officers, went to Cloverdale Farm to evict illegal settlers armed with a court order (HCH2294/24).\n\nThe accused, together with other settlers, barricaded the Harare-Mutare Highway using wooden logs and burning tyres. They also dug trenches at the entrance and along several roads within the farm.\n\nWhen the police attempted to disperse the group, the accused and others already on remand resisted, leading to a commotion.\n\nThe disturbance caused a traffic jam on the highway, prompting the police to deploy tear smoke to try and disperse the settlers. Several police officers were injured during the confrontation. Amid the chaos, the accused allegedly took a riot gun from a police officer and fled with it. He was later arrested on May 26, 2025, by a Support Unit team, reads the court documents.\n\nIn March, Magistrate Moyo had found seven land invaders guilty of contravening the Regional Town and Country Planning Act for illegally occupying Cloverdale Farm.\n\nChirambadare was among the settlers.\n\nThe seven were convicted based on evidence presented in court, which confirmed that the land belongs to Glorious Properties, represented by Kagonye.\n\nThe magistrate also noted that Glorious Properties provided documentary evidence showing they had been allocated the land and granted permission to develop the stands by the Ministry of Local Government.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | A Harare man was on Wednesday brought before the court on charges of public … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/chirambadare-in-court-over-cloverdale-farm-violence/\">Continue reading<span class=\"screen-reader-text\"> \"Chirambadare in Court Over Cloverdale Farm Violence\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Chivayo Says ‘I Beat Henry Olonga On Looks’",
            "url": "https://www.zimeye.net/2025/05/28/chivayo-says-i-beat-henry-olonga-on-looks/",
            "content": "PUBLIC BACKLASH\n\nWhy Is He Always Mad?  Chivayos Online Meltdown Draws Mockery, Psychological Speculation\n\nHarare  28 May 2025\n\nBy Showbiz Reporter | Businessman Wicknell Chivayo has once again found himself at the centre of social media ridicule after launching a crude attack on exiled cricket icon Henry Olonga. But this time, its not just his target thats making headlines  its the publics blunt reaction to Chivayo himself.\n\nAs screenshots of Chivayos disparaging comment about Olongas nationality and hairstyle spread, Facebook users did not hold back in diagnosing the man behind the insult. From mockery to outright concern over his mental state, the comments reveal growing unease over Chivayos behaviour despite his immense wealth.\n\nWith all the money he has, why is he always mad??? questioned Mukundi Chifamba, whose comment sparked a flurry of responses dissecting Chivayos psychological state.\n\nPope Shumba TheTenth replied, He knows this guy who he is  thats a kind response judging with what he did. His comment hinted at an internal recognition of guilt or conflict.\n\nMai Tawana Pirie went further, suggesting Chivayos condition was supernatural: Haa maghost aya. Kune maghost akawanda akuzviti Chivhayo. (Translation: These are ghosts. There are many ghosts calling themselves Chivayo now.)\n\nTop fan Jo Jo added, Money is not everything. Hes lacking something, reflecting a sentiment echoed by many Zimbabweans who see Chivayos lavish lifestyle as masking deeper issues.\n\nJuwett Katyora concluded the thread bluntly: Ndo kuromba kwacho ikoko, implying that Chivayos wealth may be the result of occult practices or spiritual manipulationa controversial claim often levelled at sudden millionaires in Zimbabwe.\n\nAs social media users continue to dissect his erratic behaviour, questions loom over whether Chivayos public outbursts are signs of unresolved personal trauma, spiritual conflict, or simply the side-effects of unchecked ego.\n\nDespite his riches, Chivayo is discovering that in the eyes of the people, true respect is earnednot bought.\n\n ENDS \n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "PUBLIC BACKLASH “Why Is He Always Mad?” – Chivayo’s Online Meltdown Draws Mockery, Psychological Speculation Harare – 28 May 2025 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/chivayo-says-i-beat-henry-olonga-on-looks/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Says ‘I Beat Henry Olonga On Looks’\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Dynamos FC’s Star Continues to Dim as Harare Giants Falter in 2025 PSL Campaign",
            "url": "https://www.zimeye.net/2025/05/28/dynamos-fcs-star-continues-to-dim-as-harare-giants-falter-in-2025-psl-campaign/",
            "content": "By Sports Correspondent\n\nOnce a towering force in Zimbabwean football, Dynamos FCaffectionately known as DeMbarenow finds itself in unfamiliar and unsettling territory.\n\nThe Harare giants, who once sent shivers down the spines of opponents across the continent, are rapidly fading into mediocrity.\n\nIn the ongoing 2025 Castle Lager Premier Soccer League season, Dynamos have managed just a single victorymatching the record of bottom-placed Kwekwe United.\n\nFor a club that reached the CAF Champions League final in 1998 and has historically dominated the local league, the current form is nothing short of alarming. Fans who once packed Rufaro Stadium with drums, chants, and sky-blue jerseys are now left disillusioned as the team lurches from one dismal performance to another.\n\nCritics point to poor administrative decisions, lack of investment in quality players, and coaching instability as major contributors to the decline.\n\nWhile other clubs have modernized and built on youth development, Dynamos appears stuck in the past, unable to adapt to the evolving dynamics of the modern game.\n\nThe loss of glamour is not just about resultsits about identity. Where once stood a proud symbol of footballing excellence in Zimbabwe, there now stands a team struggling to rediscover its soul. As rivals like FC Platinum and Highlanders continue to grow stronger, Dynamos risks becoming a relic of a bygone era rather than a pillar of the present.\n\nUnless urgent and meaningful reforms are implemented both on and off the pitch, Dynamos FCs legacy may be left to gather dust in history books, rather than being etched into new chapters of Zimbabwean football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Once a towering force in Zimbabwean football, Dynamos FC—affectionately known as “DeMbare”—now finds itself in unfamiliar and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/dynamos-fcs-star-continues-to-dim-as-harare-giants-falter-in-2025-psl-campaign/\">Continue reading<span class=\"screen-reader-text\"> \"Dynamos FC’s Star Continues to Dim as Harare Giants Falter in 2025 PSL Campaign\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Masandawana Celebrate Divine Lunga’s Birthday",
            "url": "https://www.zimeye.net/2025/05/28/masandawana-celebrate-divine-lungas-birthday/",
            "content": "Sports Correspondent\n\nSouth African football giants Mamelodi Sundowns are celebrating the birthday of their Zimbabwean star defender, Divine Lunga.\n\nIn a brief statement shared on their official platforms, Mamelodi Sundowns said:\n\nMasandawana, join us in wishing our defender Divine Lunga an amazing birthday today! Happy Birthday, Divine! \n\nThe message was accompanied by the hashtags #Sundowns and #HappyBirthdayDivine, as the club and its fans took a moment to honour the talented left-back on his special day.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent South African football giants Mamelodi Sundowns are celebrating the birthday of their Zimbabwean star defender, Divine Lunga. In … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/masandawana-celebrate-divine-lungas-birthday/\">Continue reading<span class=\"screen-reader-text\"> \"Masandawana Celebrate Divine Lunga’s Birthday\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Foreign Body Blockages in Goats and Sheep: A Hidden Threat to Livestock Health",
            "url": "https://www.zimeye.net/2025/05/28/foreign-body-blockages-in-goats-and-sheep-a-hidden-threat-to-livestock-health/",
            "content": "By Trywell Muzerengi\n\nGastrointestinal (GI) blockages in goats and sheep are a serious health concern, often caused by the ingestion of foreign objects. These animals, known for their curious nature, may consume non-food items found in their environment. Common culprits include plastic, hay twine, and other debris, especially when introduced through hay bales or externally sourced feed.\n\nThese blockages can be life-threatening and require immediate veterinary intervention. Below are key points every livestock keeper should know:\n\nSigns of a GI blockage vary depending on the severity and location of the obstruction. Common symptoms include:\n\nIn severe cases, the condition may become fatal before its properly diagnosed. Early recognition is crucial, as this can quickly escalate into a veterinary emergency.\n\nA veterinarian will perform a thorough physical examination. Diagnostic tools such as ultrasound or X-rays may be used to confirm the presence and location of the blockage.\n\nThe best approach is prevention. Regularly inspect and clean the animals environment to remove any foreign materials. Always ensure that hay and feed are free from plastic, twine, and other potential hazards. If a blockage is suspected, immediate veterinary care is essential.\n\nThis article is intended for informational purposes only and does not replace professional veterinary advice. Always consult a veterinarian if gastrointestinal blockage is suspected.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Trywell Muzerengi Gastrointestinal (GI) blockages in goats and sheep are a serious health concern, often caused by the ingestion … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/foreign-body-blockages-in-goats-and-sheep-a-hidden-threat-to-livestock-health/\">Continue reading<span class=\"screen-reader-text\"> \"Foreign Body Blockages in Goats and Sheep: A Hidden Threat to Livestock Health\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Mutsvangwa Praises His Boss Emmerson Mnangagwa For Reviving Economy While Whole Nation Is Burning",
            "url": "https://www.zimeye.net/2025/05/28/mutsvangwa-praises-his-boss-emmerson-mnangagwa-for-reviving-economy-while-whole-nation-is-burning/",
            "content": "By A Correspondent\n\nZANU PFs spokesperson, Christopher Mutsvangwa, has stirred controversy after he heaped praise on President Emmerson Mnangagwa for spearheading economic gains despite growing public discontent, inflation, and widespread hardship across Zimbabwe.\n\nSpeaking during a media briefing at the ZANU PF headquarters in Harare on Tuesday, Mutsvangwa lauded the Second Republic under Mnangagwas leadership, saying it had brought economic stability and international respect.\n\nPresident Mnangagwa is getting invitations globally and he is a much admired statesman on the global stage, said Mutsvangwa, insisting that Zimbabwes economic revival is underway. There is a resilient economic structure in the country after surviving economic sanctions by Zimbabwe.\n\nHe further claimed that the local economy was outpacing global giants. England is struggling to revive its steel economy whilst we have a vibrant one, he said, in remarks many critics have since called tone-deaf given the daily economic struggles faced by ordinary Zimbabweans.\n\nMutsvangwa defended Mnangagwas legitimacy, describing him as a leader elected by the people. He also took a swipe at opposition activists, particularly those associated with the failed March 31st movement. The people doing attacks against President Mnangagwa have a reckless unfulfilled ambition for power, he said. They thought chaos and confusion would transfer power to people who are power hungry.\n\nHe further claimed those plotting against the government had failed in their attempts. There is a lot of humble pie being eaten by those people who tried to cause chaos. I want to assure you that the ghost of confusion and despondency have been foisted aside through economic development done by President Mnangagwa, Mutsvangwa stated.\n\nOn the issue of leadership transition, Mutsvangwa dismissed any talk of succession. We cannot fast forward the time of succession, he said, arguing that Mnangagwa is focused on fulfilling the legacy of the liberation struggle. The sacrifice of the liberation struggle should never be taken in vain, President Mnangagwa is walking on a narrow path to make sure that Zimbabwe becomes a successful economy.\n\nDespite Mutsvangwas optimistic tone, Zimbabwe continues to grapple with soaring inflation, currency instability, and growing public unrest. The widening gap between official statements and the lived realities of millions of citizens has sparked sharp criticism and questions over the governments priorities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF’s spokesperson, Christopher Mutsvangwa, has stirred controversy after he heaped praise on President Emmerson Mnangagwa for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/mutsvangwa-praises-his-boss-emmerson-mnangagwa-for-reviving-economy-while-whole-nation-is-burning/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Praises His Boss Emmerson Mnangagwa For Reviving Economy While Whole Nation Is Burning\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        },
        {
            "title": "Zanu PF Challenges Nation To Embrace Economic Growth, Despite Deepening Crisis…",
            "url": "https://www.zimeye.net/2025/05/28/zanu-pf-challenges-nation-to-embrace-economic-growth-despite-deepening-crisis/",
            "content": "By A Correspondent\n\nZANU PF spokesperson Christopher Mutsvangwa has once again stirred political waters, firmly shutting down any talk of succession within the ruling party and declaring that President Emmerson Mnangagwas leadership remains essential for Zimbabwes futuredespite mounting economic turmoil and widespread public discontent.\n\nSpeaking at a media briefing held at ZANU PF Headquarters in Harare on Tuesday, Mutsvangwa praised Mnangagwa for what he described as spearheading economic gains, and warned against attempts to challenge his presidency.\n\nWe cannot fast forward the time of succession, Mutsvangwa said bluntly, as speculation grows over leadership transition.\n\nThe sacrifice of the liberation struggle should never be taken in vain. President Mnangagwa is walking on a narrow path to make sure that Zimbabwe becomes a successful economy.\n\nMutsvangwa insisted that Zimbabwe was on the rise under the Second Republic, brushing aside glaring signs of inflation, currency collapse, and persistent poverty.\n\nPresident Mnangagwa is getting invitations globally and he is a much admired statesman on the global stage, he said. There is a resilient economic structure in the country after surviving economic sanctions by Zimbabwe.\n\nHe went further to compare Zimbabwes economic performance to that of developed countries: England is struggling to revive its steel economy whilst we have a vibrant one, he claimed.\n\nMutsvangwa also took aim at critics of the government, particularly those aligned with the failed March 31st movement. The people doing attacks against President Mnangagwa have a reckless unfulfilled ambition for power, he charged. They thought chaos and confusion would transfer power to people who are power hungry.\n\nAccording to Mutsvangwa, those efforts have failed: There is a lot of humble pie being eaten by those people who tried to cause chaos. I want to assure you that the ghost of confusion and despondency have been foisted aside through economic development done by President Mnangagwa.\n\nThe remarks come as Zimbabweans continue to battle economic challenges that sharply contrast with the governments upbeat rhetoric. The growing disconnect between official narratives and everyday realities has only intensified calls for leadership renewalcalls that Mutsvangwa has made clear ZANU PF is not ready to entertain.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF spokesperson Christopher Mutsvangwa has once again stirred political waters, firmly shutting down any talk of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/28/zanu-pf-challenges-nation-to-embrace-economic-growth-despite-deepening-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Challenges Nation To Embrace Economic Growth, Despite Deepening Crisis…\"</span></a></p>",
            "time": "06:34",
            "date": "29 May 2025"
        }
    ]
}