{
    "news": [
        {
            "title": "OK Zimbabwe Closes Five Branches",
            "url": "https://www.zimeye.net/2025/02/27/ok-zimbabwe-closes-five-branches-2/",
            "content": "By BusinessReporter-OK Zimbabwe has rehired its former chief executive officer, Willard Zireva, who previously led the company from 2001 until his retirement in 2017.\n\nHis return comes as the 83-year-old retailer embarks on a strategic business review and restructuring to enhance operational efficiency and drive sustainable growth in a challenging economic environment.\n\nThe company recently announced the closure of five branches, citing atoughtrading environment exacerbated by exchange rate distortions, low US dollar sales, and unsustainable operating costs.\n\nThe affected stores include four outlets in HarareGlen Norah, Kuwadzana 5, Chitungwiza Town Centre, and Robson Manyika Streetas well asa branch in Bulawayos Entumbane high-density suburb.\n\nTheretail giant fired three top executives: former CEO Maxen Phillip Karombo, Chief Financial Officer Phillimon Mushosho, and Supply Chain Director Knox Mupayadue to business failure.\n\nOK Zimbabwe appointed Alex Edgar Siyavora, another former CEO, asCFO,and Muzvidzwa Richard Chingaira as the new supply chain director to stabilise operations.\n\nThe new leadership teamis expectedto implement a strategic recovery plan overthe nextsix months while the company searches for permanent executive replacements.\n\nOKZimbabwe has struggled to restock its branches over the past year, a challenge compounded by the introduction of the Zimbabwe Gold (ZiG) currency, which has disrupted supply chains and pricing structures.\n\nThe retailer experienced significant stockouts in late 2024 and early 2025, with daily availability levels plummeting to around 50percentof normal stocking levels.\n\nThe company attributed these shortages to restricted supplies from manufacturers and distributors, many of whom demand payment in foreign currency due to inflationary pressures and economic uncertainty.\n\nA recent trading update revealed a 36percentdecline in volumes during the last quarter compared to the same period in 2023.\n\nDespite a year-to-date volume growth of 10percent, revenue has suffered due to falling sales and mounting debts.\n\nOutstanding creditors balances, predominantly denominated in US dollars, have placed additional strain on the company, whichat timesreported US dollar sales as low as 20percentof total revenue.\n\nThe Reserve Bank of Zimbabwe (RBZ), however, has downplayed the impact of the economic environmenton retailers, suggesting that many of their challenges stem from poor management decisions rather than macroeconomic factors.\n\nThe Confederation of Zimbabwe Retailers (CZR) has pushed back against this assertion, arguing that exchange rate distortions, excessive taxation, and a rising informal sector have made compliance increasingly difficult for formal retailers.\n\nIf urgent interventions are not implemented, we risk a complete collapse of the formal retail sector, leading to mass job losses, declining tax revenues, and further economic instability, warned CZR President Denford Mutashu, represented by acting CEO Innocent Marimo during a recent presentation to the Tripartite Negotiating Forum Economic Cluster.\n\nIn response, OK Zimbabwe has adopted alternative procurement models, including structured stock supply arrangements with third parties to restore supplier relationships. Financial institutions have also stepped in with short-term funding facilities to support restocking efforts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-OK Zimbabwe has rehired its former chief executive officer, Willard Zireva, who previously led the company from 2001 until … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/ok-zimbabwe-closes-five-branches-2/\">Continue reading<span class=\"screen-reader-text\"> \"OK Zimbabwe Closes Five Branches \"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "Man Violates Ex Wife",
            "url": "https://www.zimeye.net/2025/02/27/man-violates-ex-wife/",
            "content": "38-Year-Old Man Sentenced to 15 Years for Raping Ex-Wife in Plumtree.\n\nPlumtree, Zimbabwe  In a landmark judgment, the Plumtree Regional Magistrates Court has sentenced a 38-year-old man to 15 years in prison for raping his 28-year-old ex-wife in Mphoengs, Plumtree. The harrowing incident, which occurred on January 22, 2021, underscores the persistent issue of gender-based violence (GBV) in the region.\n\nAccording to court documents, the accused ambushed his ex-wife while she was walking home with friends. He chased away her companions, forcibly leading the victim into a nearby bushy area. There, he produced a knife, threatening her before ordering her to undress. The court heard how the man raped her without protection, subjecting her to both physical and psychological trauma.\n\nFollowing the assault, the perpetrator forced his ex-wife to accompany him to his home. His intention, as revealed during the trial, was to take her to South Africa against her will. However, during their journey, the accused learned that the victims family was actively searching for her. In a bid to evade capture, he borrowed a bicycle and transported her back to her family home. The brave survivor reported the matter to the police, leading to his subsequent arrest and conviction.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) has applauded the survivors courage and urged other victims of sexual abuse to come forward and seek justice. In a public statement, NPAZ emphasized, We encourage survivors of sexual abuse to report abuse and seek justice. #EndGBV #ProtectSurvivors #SayNoToRape.\n\nThe courts decision sends a strong message against gender-based violence, reinforcing the nations stance on combating crime and corruption. Community leaders and advocacy groups have welcomed the sentence, hoping it will deter potential offenders and offer solace to survivors.\n\nAs Zimbabwe continues its fight against GBV, this case highlights the critical need for continued support, awareness, and robust legal action to protect vulnerable individuals from abuse and exploitation.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "38-Year-Old Man Sentenced to 15 Years for Raping Ex-Wife in Plumtree. Plumtree, Zimbabwe – In a landmark judgment, the Plumtree … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/man-violates-ex-wife/\">Continue reading<span class=\"screen-reader-text\"> \"Man Violates Ex Wife\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "Magaya Promises to Build 10 Stadiums While Bankrupt",
            "url": "https://www.zimeye.net/2025/02/27/magaya-promises-to-build-10-stadiums-despite-bankruptcy/",
            "content": "By A Correspondent | Harare, Zimbabwe  In a surprising twist, Prophet Walter Magaya, the charismatic leader of PhD Ministries, has announced an ambitious plan to construct 10 football stadiums across Zimbabwe by 2032, despite his organization facing a court-ordered auction to settle outstanding debts. The announcement, made during a tour of the under-construction Chahwanda Stadium in Kwekwe, has sparked a mixture of skepticism and disbelief among observers.\n\nWhile Magaya envisions hosting international tournaments such as the Council of Southern Africa Football Association (COSAFA) and the Africa Cup of Nations (AFCON) in Zimbabwe, his ministrys financial troubles are unfolding publicly. LM Auctioneers recently announced the auction of PhD Ministries assets, including approximately 5,000 plastic chairs, forklifts, generators, TVs, trailers, and assorted speakers, under a legal case labeled Simon Tendai vs. PhD Ministries (Case # HRECCG779/24).\n\nThe auction is scheduled for Thursday, 13 February 2025, at 1 Sherwood Drive, Simon Mazorodze Road, Waterfalls, Harare. A $1,000 deposit is required for vehicles and heavy-duty generators. The auction list suggests that basic operational items of the ministry are being liquidated to cover debts, casting a shadow over Magayas stadium-building aspirations.\n\nGrand Vision vs. Harsh Reality\n\nMagayas latest pronouncement came as he showcased progress at Chahwanda Stadium to journalists and local council representatives from Masvingo and Kadoma. He revealed ongoing negotiations with authorities in Masvingo, Kadoma, and Shurugwi to either construct new stadiums or rehabilitate existing ones, with the ultimate goal of transforming Zimbabwe into a viable host for major African football events.\n\nMy dream is to construct 10 stadiums by 2032, and God willing, I will achieve this, Magaya said. If I fail, I will still thank God for allowing me to build what I would have managed to in that timeframe. Should the stadiums be there by 2032, Zimbabwe will be able to bid to host COSAFA and AFCON tournaments. That is why I have a target of renovating at least one stadium in each of the 10 provinces.\n\nHowever, with essential assets heading to the auction block, questions are mounting about how Magaya intends to fund these grand projects. Critics argue that if the ministry cannot retain basic furniture and equipment, the feasibility of constructing multi-million-dollar sports facilities remains highly questionable.\n\nLocal Authorities Skeptical\n\nMasvingos Deputy Mayor, Daniel Mberikunashe, confirmed that the city council would deliberate on Magayas proposal in an upcoming full council meeting. While Magayas vision could boost local infrastructure and economy, the financial instability surrounding his ministry has raised concerns among potential stakeholders.\n\nA local economist, who preferred to remain anonymous, commented, This situation is like building castles in the air. The economic environment is harsh, and his financial troubles are too public to ignore. Unless there is a transparent and viable financial model, this might be more of a publicity stunt than a genuine development project.\n\nWhat Next for Magaya and PhD Ministries?\n\nAs the auction date approaches, all eyes will be on Magayas next move. Will he find a way to resolve his financial woes and realize his dream of transforming Zimbabwean football, or is this a sign of a deeper crisis within his ministry?\n\nFor now, Zimbabweans remain dividedsome hopeful for development and others wary of empty promises. One thing is clear: while Magaya dreams of stadiums, reality is knocking on his ministrys door, ready to take away more than just plastic chairs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Harare, Zimbabwe – In a surprising twist, Prophet Walter Magaya, the charismatic leader of PhD Ministries, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/magaya-promises-to-build-10-stadiums-despite-bankruptcy/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Promises to Build 10 Stadiums While Bankrupt\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "Will New ZIFA Referees Committee Stamp Out Corruption?",
            "url": "https://www.zimeye.net/2025/02/27/will-new-zifa-referees-committee-stamp-out-corruption/",
            "content": "Sports Correspondent\n\nThe newly appointed ZIFA Referees Committee has introduced a series of measures aimed at enhancing the quality of match officiating in the country, just ahead of the Premier Soccer Leagues season kick-off this Friday.\n\nUnder the leadership of Faith Mloyi, the committee acted swiftly to establish a solid foundation by hosting a training workshop, facilitated by former referee and ex-SRC Chairperson Anthony Mandiwanza. ZIFA vice-chairperson Kennedy Ndebele represented the association during the session.\n\nThe workshop resulted in the adoption of key resolutions designed to address issues that plagued officials last year, with some referees becoming the center of controversy for the wrong reasons. Among the resolutions passed, it was decided that all financial transactions involving referees would be handled solely by ZIFA, ensuring no payments are processed outside the associations official structures.\n\nTo further safeguard the integrity of the refereeing process, committee members will no longer participate in matches as officials, whether as referees, assessors, or match commissioners.\n\nAdditionally, the committee will focus on the recruitment of new referees, specifically targeting individuals between the ages of 18 and 25. They will also implement a strict code of conduct for all referees, which will apply across all levels of play, from lower leagues to the Premier Soccer League.\n\nReferees manager, Joshua Tigere, has been appointed to oversee all officiating matters on a full-time basis and will be stationed at ZIFAs offices.\n\nThe newly formed referees committee is headed by Faith Mloyi, with Munyaradzi Majoni serving as her deputy. Other members include Jacob Kuuya, Makonese Masakadza, and Rusina Kuda Chiramba, while Joshua Tigere will manage all refereeing operations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The newly appointed ZIFA Referees Committee has introduced a series of measures aimed at enhancing the quality of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/will-new-zifa-referees-committee-stamp-out-corruption/\">Continue reading<span class=\"screen-reader-text\"> \"Will New ZIFA Referees Committee Stamp Out Corruption?\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "Fake Goods Frenzy: Anti-Smuggling Taskforce Destroys Counterfeit Products",
            "url": "https://www.zimeye.net/2025/02/27/fake-goods-frenzy-anti-smuggling-taskforce-destroys-counterfeit-products/",
            "content": "By A Correspondent\n\nIn a bid to combat the scourge of counterfeit goods, the Anti-Smuggling Taskforce has launched a massive crackdown on the informal sector, destroying large quantities of fake and substandard products. While the taskforces intentions may be noble, consumers are crying foul, saying the approach is too harsh and heavy-handed.\n\nThe taskforces operation has left many informal traders reeling, as their livelihoods are being threatened by the destruction of their goods. Consumers, on the other hand, are lamenting the loss of affordable options, saying that the genuine products are often out of their price range.\n\nThe Anti-Smuggling Taskforce, however, remains resolute in its mission to protect consumers from the dangers of counterfeit goods. According to the taskforce, the fake products pose serious health and safety risks, and the destruction of these goods is necessary to safeguard the public.\n\nAs the debate rages on, one thing is clear: the Anti-Smuggling Taskforces crackdown on counterfeit goods has sparked a heated discussion about the balance between protecting consumers and preserving the livelihoods of informal traders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bid to combat the scourge of counterfeit goods, the Anti-Smuggling Taskforce has launched a massive … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/fake-goods-frenzy-anti-smuggling-taskforce-destroys-counterfeit-products/\">Continue reading<span class=\"screen-reader-text\"> \"Fake Goods Frenzy: Anti-Smuggling Taskforce Destroys Counterfeit Products\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "Zimbabwean Forward Pens Deal With Polish Outfit",
            "url": "https://www.zimeye.net/2025/02/27/zimbabwean-forward-pens-deal-with-polish-outfit/",
            "content": "By Sports Correspondent\n\nZimbabwean striker Munyaradzi Mwakanya has secured a move to Polish club Wisa Krakw after a successful trial stint. The 21-year-old forward, who was born in Chipinge, has signed a short-term contract until June 2025 with the option to extend.\n\nMwakanyas journey to Wisa Krakw began when he was spotted by scouts during a cup game. He subsequently underwent a two-week trial, impressing the coaching staff with his skills and determination.\n\nThe Polish club confirmed the signing on their website, stating that Mwakanya will play for Wisas reserve team. The club highlighted his impressive performance in the Polish Cup, where he scored five goals in four appearances.\n\nMwakanyas move to Wisa Krakw marks a significant step in his career. Prior to joining the Polish club, he played for Pogo Krakw, whom he joined in 2022 from Stamina Football Academy in Chipinge.\n\nWith this new opportunity, Mwakanya is poised to take his career to the next level and make a name for himself in Polish football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Zimbabwean striker Munyaradzi Mwakanya has secured a move to Polish club Wisła Kraków after a successful trial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/zimbabwean-forward-pens-deal-with-polish-outfit/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Forward Pens Deal With Polish Outfit\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "We Are Unstoppable: Tungwarara",
            "url": "https://www.zimeye.net/2025/02/27/we-are-unstoppable-tungwarara/",
            "content": "By A Correspondent\n\nIn a candid admission, Mr. Emmerson Mnangagwas advisor, Paul Tungwarara, has criticized internal factions within the ruling Zanu PF party who have been using social media to attack the party leader. Tungwarara made these remarks during the launch of the Harare Province Presidential War Veterans Fund at the Zanu PF headquarters on Tuesday.\n\nWhile addressing the gathering, Tungwarara responded directly to those he believes are attempting to sow division within the party, saying, We will not be swayed by those attempting to use divide and rule tactics through social media. This statement reflects growing tensions within the party as some factions seek to undermine Mnangagwas leadership.\n\nTungwarara also emphasized the strength and unity of those loyal to the president, stating, We know their agenda, its too narrow and we are unstoppable. His words indicate a strong resolve among Mnangagwas supporters to resist efforts aimed at destabilizing the party from within.\n\nThe occasion was marked by Tungwararas formal handover of a US$150,000 allocation to the Zanu PF War Veterans League, led by Douglas Mahiya, reinforcing his role as Mnangagwas investment advisor. The funds are intended to support the war veterans, a key base of support for the ruling party.\n\nTungwararas comments reveal not only the internal strife facing Zanu PF but also his determination to project an image of party unity in the face of growing divisions. Despite the public infighting, he maintains confidence in the leaderships ability to weather the storm and remain unstoppable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a candid admission, Mr. Emmerson Mnangagwa’s advisor, Paul Tungwarara, has criticized internal factions within the ruling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/we-are-unstoppable-tungwarara/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Unstoppable: Tungwarara\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "Nelson Chamisa Condemns Arrest Of Journalist Blessed Mhlanga",
            "url": "https://www.zimeye.net/2025/02/27/nelson-chamisa-condemns-arrest-of-journalist-blessed-mhlanga/",
            "content": "By A Correspondent\n\nOpposition leader Advocate Nelson Chamisa has strongly criticized the Zanu PF government for its ongoing harassment of journalist Blessed Mhlanga.\n\nIn a statement made on Tuesday, Chamisa condemned the arrest of Mhlanga as a blatant violation of basic freedoms and human rights.\n\nTARGETING OF JOURNALISTS IS ARCHAIC The arrest of journalist Blessed Mhlanga @bbmhlanga is a flagrant violation of fundamental freedoms and human rights, Chamisa said, emphasizing his strong opposition to such actions.\n\nHe further described the arrest as an attack on civilization itself, stating, This arrest is an affront to civilisation, press freedom and democracy.\n\nChamisa also underscored the critical role of journalism in a free society, pointing out that a free press is essential for the functioning of a modern and progressive nation.\n\nJournalism is the oxygen that thrives society. A free press is the lifeblood of a progressive and functional modern society, he added.\n\nThe opposition leader highlighted the constitutional guarantees that protect the media in Zimbabwe, specifically referencing Section 61 of the countrys Constitution, which ensures the freedom of the press. Section 61 of Zimbabwes Constitution guarantees freedom of the media; this right must be upheld! Chamisa remarked.\n\nChamisas comments also reflected concern over the growing repression of dissenting voices in Zimbabwe. He warned that the targeting of journalists signals a dangerous shift in governance. The first indicator that those in government have turned against the people is in the targeting of journalists as conveyors of information and news, he noted.\n\nChamisa reiterated the importance of protecting the journalism profession, stating, Journalism as a profession must be protected. Zimbabwe shall soon be the land of the free and happy!\n\nThis statement from Chamisa underscores his commitment to upholding press freedom and advocating for a society where human rights and democracy are respected.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Advocate Nelson Chamisa has strongly criticized the Zanu PF government for its ongoing harassment of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/nelson-chamisa-condemns-arrest-of-journalist-blessed-mhlanga/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Condemns Arrest Of Journalist Blessed Mhlanga\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "Brave Church Leader Rebukes Mnangagwa Over Harassment Of Zimbabwean Journalist",
            "url": "https://www.zimeye.net/2025/02/27/brave-church-leader-rebukes-mnangagwa-over-harassment-of-zimbabwean-journalist-2/",
            "content": "By A Correspondent\n\nBishop Ancelimo Magaya, a prominent church leader, has sharply criticized President Emmerson Mnangagwa over the arrest of journalist Blessed Mhlanga.\n\nIn a statement issued on Tuesday, Magaya condemned the actions of the authorities, calling the arrest a gross injustice.\n\nThe arrest of Blessed Mhlanga for doing his work is wicked and a mockery of justice in Zimbabwe, Magaya declared, expressing his outrage at the situation.\n\nHis comments reflect the broader concerns about the increasing repression of journalists in the country.\n\nMagaya also pointed out the apparent hypocrisy in the governments treatment of its officials compared to its treatment of journalists. Police Zimbabwe must be reminded of Zanu-pf officials like Josiah Hungwe and many more who have made wildest utterances  inflaming violence.\n\nThese have never been arrested, he said, highlighting the disparity in how the law is applied to government figures versus independent voices.\n\nThe church leader did not hold back in his criticism, adding, If there is anyone guilty on this matter, it is Zanu-pf zealots singing the 2030 chorus: which violates the constitution. He was referring to the regimes alleged disregard for constitutional rights in favor of its own agenda.\n\nMagaya concluded his statement with a call for justice and a prayer for Zimbabwes future: It is such acts of injustices and many more deplorable things that constitute reasons why people are demanding president Mnangagwa to step down. God save Zimbabwe.\n\nThe strong statement from Bishop Ancelimo Magaya underscores the growing concern among both political and religious leaders regarding the erosion of press freedom and the increasing authoritarianism in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Bishop Ancelimo Magaya, a prominent church leader, has sharply criticized President Emmerson Mnangagwa over the arrest of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/brave-church-leader-rebukes-mnangagwa-over-harassment-of-zimbabwean-journalist-2/\">Continue reading<span class=\"screen-reader-text\"> \"Brave Church Leader Rebukes Mnangagwa Over Harassment Of Zimbabwean Journalist\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        },
        {
            "title": "ZIFA Referees Committee Unveils New Measures to Improve Officiating",
            "url": "https://www.zimeye.net/2025/02/27/zifa-referees-committee-unveils-new-measures-to-improve-officiating/",
            "content": "Sports Correspondent\n\nThe newly appointed ZIFA Referees Committee has introduced a series of measures aimed at enhancing the quality of match officiating in the country, just ahead of the Premier Soccer Leagues season kick-off this Friday.\n\nUnder the leadership of Faith Mloyi, the committee acted swiftly to establish a solid foundation by hosting a training workshop, facilitated by former referee and ex-SRC Chairperson Anthony Mandiwanza. ZIFA vice-chairperson Kennedy Ndebele represented the association during the session.\n\nThe workshop resulted in the adoption of key resolutions designed to address issues that plagued officials last year, with some referees becoming the center of controversy for the wrong reasons. Among the resolutions passed, it was decided that all financial transactions involving referees would be handled solely by ZIFA, ensuring no payments are processed outside the associations official structures.\n\nTo further safeguard the integrity of the refereeing process, committee members will no longer participate in matches as officials, whether as referees, assessors, or match commissioners.\n\nAdditionally, the committee will focus on the recruitment of new referees, specifically targeting individuals between the ages of 18 and 25. They will also implement a strict code of conduct for all referees, which will apply across all levels of play, from lower leagues to the Premier Soccer League.\n\nReferees manager, Joshua Tigere, has been appointed to oversee all officiating matters on a full-time basis and will be stationed at ZIFAs offices.\n\nThe newly formed referees committee is headed by Faith Mloyi, with Munyaradzi Majoni serving as her deputy. Other members include Jacob Kuuya, Makonese Masakadza, and Rusina Kuda Chiramba, while Joshua Tigere will manage all refereeing operations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The newly appointed ZIFA Referees Committee has introduced a series of measures aimed at enhancing the quality of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/27/zifa-referees-committee-unveils-new-measures-to-improve-officiating/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Referees Committee Unveils New Measures to Improve Officiating\"</span></a></p>",
            "time": "18:09",
            "date": "27 Feb 2025"
        }
    ]
}