{
    "news": [
        {
            "title": "Unlawful Detention Of Frank Buyanga Sadiqi Sparks Outrage",
            "url": "https://www.zimeye.net/2025/02/08/unlawful-detention-of-frank-buyanga-sadiqi-sparks-outrage/",
            "content": "By A Correspondent| A shocking press statement released by the legal representatives and supporters of Frank Buyanga Sadiqi has exposed egregious violations of his fundamental rights and systemic abuses of power by South African authorities.\n\nSadiqi, a prominent businessperson and philanthropist, has been subjected to unlawful detention, procedural irregularities, and a blatant miscarriage of justice. His detention contravenes Section 50 of the Criminal Procedure Act, which mandates that an arrested person must be brought before a court within 48 hours.\n\nThe statement highlights several key violations, including:\n\nThe statement demands the immediate and unconditional release of Sadiqi, dismissal of all charges, and a thorough investigation into the abuses of power by the Hawks, SAPS, and other involved authorities.\n\nThe judiciary is urged to expedite the review of Sadiqis case and ensure that justice is served without further delay. The statement also appeals to the judicial and executive community, human rights organizations, and all people of conscience to stand in solidarity with Sadiqi.\n\nAs reported earlier, Sadiqis detention has taken a toll on his health, with reports indicating that he has fallen sick in prison. His supporters argue that his prosecution is concocted and malicious and that he has been denied his fundamental rights, including access to private medical healthcare.\n\nThe case has sparked widespread outrage, with many calling for Sadiqis immediate release and an end to the alleged persecution. As the matter continues to unfold, one thing is clear: justice must be served, and those responsible for these egregious violations must be held accountable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A shocking press statement released by the legal representatives and supporters of Frank Buyanga Sadiqi has exposed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/unlawful-detention-of-frank-buyanga-sadiqi-sparks-outrage/\">Continue reading<span class=\"screen-reader-text\"> \"Unlawful Detention Of Frank Buyanga Sadiqi Sparks Outrage\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Mystery Surrounds Junta Deaths & Rapid Burials",
            "url": "https://www.zimeye.net/2025/02/08/mystery-surrounds-junta-deaths-rapid-burialsheroes/",
            "content": "By Munacho Gwamanda-Zanu PF is, for the fifth time in a space of two weeks going back to the National Heroes Acre to bury another hero.\n\nThis time, Zanu Pf is burying former ZIPRA senior member and ex-Governor of Manicaland, Tinaye Chigudu, whom it conferred withNational Herostatus following his death in Harare on Wednesday.\n\nHis burial marks thefifth national hero interment within just two weeks, raising speculation over themysterious frequency of high-profile deathsamong senior government and military figures.\n\nOn22 January, Acting Presidentpresided over the burials of:\n\nDays later,Chiwenga returned to the National Heroes Acreto oversee the burial offormer top CIOboss,Justin Mupamhanga.\n\nChigudusdeath and subsequent hero status add to the growing list, fueling speculation over the unexplained mortality rate among prominent figures.\n\nBorn onAugust 13, 1942, Chigudu had a long career inliberation politics, government, and diplomacy. His early educationtook placeatChigudu School, Cyrene Mission, and Harare Secondary Schoolbefore he left Zimbabwe in1964to joinZAPUin Zambia.\n\nTrained inguerilla warfare in North Koreaas a ZIPRA cadre, Chigudu later returned to Zimbabwe as anintelligence officerbut was captured in1965and detained inGonakudzingwa, Gweru, and Whawha prisonsfor12 years.\n\nAfterexile in the UK, hestudied law at Exeter University (1978-1981)before returning to Zimbabwe to serve invarious government roles:\n\nChigudu later worked as asenior consultant for the UNDP, helping structureSouthSudansMinistry of Interior. Until his death, he wasfarming in Makoni District.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Zanu PF is, for the fifth time in a space of two weeks going back to the National … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/mystery-surrounds-junta-deaths-rapid-burialsheroes/\">Continue reading<span class=\"screen-reader-text\"> \"Mystery Surrounds Junta Deaths & Rapid Burials\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "5th National Hero Burial In Two (2) Weeks",
            "url": "https://www.zimeye.net/2025/02/08/5th-national-hero-burial-in-two-2-weeks/",
            "content": "Munacho Gwamanda- Zanu PF has conferred a national hero status to a former ZIPRA senior member and ex-governor of Manicaland Tinaye Chigudu.\n\nChigudu died in Harare on Wednesday.\n\nOn January 22, Acting President then Constantino Chiwenga presided over the burial of Major-General (Retired) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura at the National Heroes Acre.\n\nIn the same week, Chiwenga returned to the national shrine and buried former top CIO boss Justin Mupamhanga.\n\nChigudu was born on August 13, 1942, and had his early education at Chigudu School, Cyrene Mission and Harare Secondary School.\n\nHe left the country in 1964 and went to Zambia under ZAPU.\n\nHe then trained guerilla warfare in the Democratic Republic of Korea as a ZIPRA cadre.\n\nHe was deployed to the country as an intelligence officer upon his return.\n\nIn May 1965, he was captured and detained in Gonakudzingwa, Gweru and finally Whawha.He was in detention for 12 years and was released in 1977 and exiled.\n\nHe went to the UK and was enrolled at Exeter University, where he studied law between 1978 and 1981.\n\nOn coming home, he joined the civil service, first as Under Secretary (Legal Affairs) of the Ministry of Transport in 1981.\n\nHe was appointed Deputy Secretary for the Ministry of Home Affairs and then Permanent Secretary in the same Ministry from 1994 to 2004.\n\nHe later became Permanent Secretary for Mines and Mining Development from 2004 to 2005.\n\nHe was then appointed Governor and Resident Minister of Manicaland in 2005 and retired in 2008.\n\nHe is the former ZANU PF provincial chairman of Manicaland and worked as a senior consultant under the United Nations Development Programme to structure the Ministry of Interior for South Sudan.\n\nAt the time of his death, he was farming in Makoni District.\n\nHe is survived by his wife, Mrs Esther Chigudu and seven children.\n\nMourners are gathered at Number 9, Belsize Close, Northwood, Mount Pleasant in Harare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Munacho Gwamanda- Zanu PF has conferred a national hero status to a former ZIPRA senior member and ex-governor of Manicaland … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/5th-national-hero-burial-in-two-2-weeks/\">Continue reading<span class=\"screen-reader-text\"> \"5th National Hero Burial In Two (2) Weeks\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Mnangagwa’s Desperate Regime Announces Cosmetic Measures To Revive Economy",
            "url": "https://www.zimeye.net/2025/02/08/mnangagwas-desperate-regime-announces-cosmetic-measures-to-revive-economy/",
            "content": "By A Correspondent\n\nAs Zimbabwe grapples with an escalating economic crisis, the government is scrambling to implement measures it hopes will stabilize the nations deteriorating economy. Despite these attempts, experts are skeptical about the effectiveness of the actions, given the severity of the challenges the country faces.\n\nIn a bid to counter the spiraling inflation, devaluation of the local currency, and declining investor confidence, the Reserve Bank of Zimbabwe (RBZ) recently announced a series of economic interventions. One of the most notable actions involves reducing exporters foreign currency retention thresholds. However, many believe that these actions are merely cosmetic attempts to address much deeper economic issues.\n\nDuring the 2025 Monetary Policy Statement presentation in Harare this Thursday, RBZ Governor Dr. John Mushayavanhu outlined the banks strategy to boost growth and stabilize the currency market. He revealed that exporters foreign currency retention thresholds would be lowered, signaling a shift towards deeper reliance on the Zimbabwe Gold (ZiG) for financial transactions.\n\nTo guarantee continued stability in the interbank foreign exchange market, we have augmented the foreign currency supply needed to support the ZiG, Dr. Mushayavanhu stated. This means the portion of export proceeds that must be surrendered has increased from 25 percent to 30 percent, effective immediately.\n\nThis move, the governor emphasized, was necessary to bolster Zimbabwes currency reserves. However, it also places more pressure on exporters, many of whom are already facing mounting operational challenges. The increased 5 percent surrender requirement, according to Dr. Mushayavanhu, is designed to ensure that exporters mobilize enough ZiG to meet their local currency obligations, including tax payments.\n\nDespite the governments insistence that these policies are designed to bring stability, critics argue that the root causes of Zimbabwes economic collapsesuch as a loss of investor confidence, rampant corruption, and mismanagementremain unaddressed.\n\nThe economy is at a breaking point, said one economist .\n\nThese measures, while they may provide short-term relief, do little to fix the underlying issues that are driving inflation and unemployment through the roof.\n\nThe use of ZiG, a government-backed digital currency, has been promoted as a solution to the countrys cash shortages and to limit the dependence on foreign currencies. However, Zimbabweans remain wary, given the persistent depreciation of the Zimbabwean dollar and the governments history of failed economic policies.\n\nZimbabweans have little trust in the governments ability to manage the economy, said the economist. The crisis is too deep for cosmetic measures to have any lasting impact.\n\nAs the central bank continues to refine its foreign exchange management system, many Zimbabweans fear that without significant structural reforms, the country will continue to spiral into a deeper economic abyss.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As Zimbabwe grapples with an escalating economic crisis, the government is scrambling to implement measures it hopes … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/mnangagwas-desperate-regime-announces-cosmetic-measures-to-revive-economy/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Desperate Regime Announces Cosmetic Measures To Revive Economy\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "What is Mnangagwa Doing in Tanzania?",
            "url": "https://www.zimeye.net/2025/02/08/what-is-mnangagwa-doing-in-tanzania/",
            "content": "By A Correspondent | Dar es Salaam, Tanzania  Zimbabwean President Emmerson Mnangagwa has arrived in Tanzania to chair an extraordinary summit of the Southern African Development Community (SADC) and the East African Community (EAC). But the burning question remains: What is Mnangagwa really doing in Tanzania?\n\nAt first glance, the purpose of his visit seems clearleading the SADC Double Troika in high-stakes negotiations to address the escalating crisis in the Democratic Republic of Congo (DRC). Alongside Kenyan President William Ruto, who chairs the EAC, Mnangagwa is overseeing efforts to persuade warring factions to lay down arms and restore peace in the mineral-rich but war-ravaged eastern DRC.\n\nHowever, is there more to Mnangagwas presence in Tanzania than meets the eye?\n\nDiplomacy or Strategic Influence?\n\nMnangagwas role as chairperson of SADC places him at the center of one of Africas most complex conflicts, but some analysts question whether Zimbabwes leader is simply fulfilling a diplomatic duty or positioning himself as a key regional powerbroker.\n\nThis joint summitan unprecedented meeting between SADC and EACsignals a shift in Africas approach to conflict resolution. The deteriorating security situation in the DRC, worsened by alleged Rwandan support for the M23 rebels, has drawn in multiple regional actors, each with their own interests. Mnangagwas leadership in this forum raises questions about Zimbabwes own geopolitical ambitions.\n\nCould his presence in Tanzania signal Zimbabwes growing influence in regional security affairs? Is Mnangagwa leveraging this summit to assert his leadership beyond SADCs borders?\n\nA Strategic Military Move?\n\nZimbabwe has historically played a military role in the DRC, having deployed troops under former President Robert Mugabe during the Second Congo War. Now, with SADCs military mission in the DRC gaining momentum, could Mnangagwas involvement be more than just diplomatic?\n\nThere are whispers that Zimbabwe might be angling for a stronger military or economic role in the DRC crisis. The mineral wealth of the eastern DRChome to vast reserves of cobalt, gold, and coltanhas long been a magnet for regional and international powers. Could Mnangagwas presence in Tanzania be linked to Zimbabwes interests in the DRCs lucrative resources?\n\nThe Rwanda Factor\n\nAnother key question looms over Mnangagwas mission: how will he handle the delicate issue of Rwandas alleged support for the M23 rebels? President Paul Kagame, who is also attending the summit, has repeatedly denied involvement, despite accusations from the DRC government.\n\nMnangagwas challenge is to balance diplomatic neutrality while pushing for a resolution that aligns with SADCs stance. However, Zimbabwes own historical ties with both Rwanda and the DRC complicate matters. Could Mnangagwa be brokering a behind-the-scenes deal between Kinshasa and Kigali?\n\nPossibility of Collusion: A Hidden Agenda?\n\nAdding to the intrigue surrounding Mnangagwas visit to Tanzania is the growing speculation about possible collusion with corrupt motives. Tanzania is the same country where convicted and controversial Zimbabwean businessman Wicknell Chivayo has been frequently spotted, raising questions about whether Mnangagwas presence in Dar es Salaam is purely diplomatic or linked to clandestine business dealings. Chivayo, known for securing questionable government contracts in Zimbabwe, has reportedly been expanding his network in Tanzaniasparking concerns that his business interests could be intertwined with political maneuvering at the highest levels.\n\nGiven the secretive nature of Chivayos dealings and his close ties to Zimbabwes ruling elite, is it possible that Mnangagwas trip to Tanzania involves more than just peace talks? Could high-level corrupt dealings be unfolding under the guise of regional diplomacy? If so, what financial or political benefits might be at play, and who stands to gain?\n\nAs Mnangagwa chairs this crucial summit, these unanswered questions add another layer of mystery to his presence in Tanzania, raising concerns that the DRC peace process may be a smokescreen for deeper, undisclosed agendas.\n\nA Bid for Political Legacy?\n\nWith his term as SADC chairperson giving him a rare international platform, could Mnangagwa be looking to cement his legacy as a statesman beyond Zimbabwes borders? Domestically, his leadership has faced criticism over economic struggles and governance concerns. Successfully steering the DRC peace process could boost his standing both at home and in the region.\n\nWhat Comes Next?\n\nThe outcomes of this summit will determine whether Mnangagwas presence in Tanzania is a mere diplomatic duty or part of a larger strategic maneuver. If he manages to push warring factions toward a resolution, he could emerge as a key figure in regional diplomacy. But if the talks fail, the crisis in the DRC could deepen, with dire consequences for the entire Great Lakes region.\n\nFor now, as the world watches, the question remains: What exactly is Mnangagwa doing in Tanzania?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Dar es Salaam, Tanzania — Zimbabwean President Emmerson Mnangagwa has arrived in Tanzania to chair an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/what-is-mnangagwa-doing-in-tanzania/\">Continue reading<span class=\"screen-reader-text\"> \"What is Mnangagwa Doing in Tanzania?\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Man Nabbed Over Death Of Own Mom",
            "url": "https://www.zimeye.net/2025/02/08/man-nabbed-over-death-of-own-mom/",
            "content": "By A Correspondent\n\nA gruesome incident occurred in Marimba, where a 22-year-old man, Nyasha Bandawe, allegedly murdered his mother, 59-year-old Hilda Drawu, following a heated argument. According to authorities, Bandawe used a kitchen knife to stab his mother multiple times in the neck.\n\nIn an attempt to conceal his crime, Bandawe hid his mothers body under the bed and locked the bedroom door. However, his violent rampage did not end there. He then attacked his 5-year-old niece, stabbing her multiple times in the neck with a screwdriver.\n\nThe injured minor was rushed to Sally Mugabe Hospital for medical attention. Meanwhile, Bandawe was apprehended by police in Marimba and is currently facing charges of murder and attempted murder.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A gruesome incident occurred in Marimba, where a 22-year-old man, Nyasha Bandawe, allegedly murdered his mother, 59-year-old … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/man-nabbed-over-death-of-own-mom/\">Continue reading<span class=\"screen-reader-text\"> \"Man Nabbed Over Death Of Own Mom\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "Mnangagwa In Bid To Bribe War Veterans",
            "url": "https://www.zimeye.net/2025/02/08/mnangagwa-in-bid-to-bribe-war-veterans/",
            "content": "By A Correspondent\n\nIn a strategic gambit to appease the war veterans and suppress opposition within their ranks, President Emmerson Mnangagwa has rolled out an initiative offering significant perks to former freedom fighters.\n\nThis gesture comes as Mnangagwa faces growing dissent, particularly regarding his bid for a third term.\n\nBlessed Geza, a prominent war veteran, recently made waves by publicly condemning Mnangagwas third-term ambitions. He criticized the presidents leadership, signaling a deepening divide within the war veterans community.\n\nIn a statement from the ruling party, Zanu PF revealed that Mnangagwa had ordered the drilling of boreholes at the homes of war veterans.\n\nPresident Emmerson Dambudzo Mnangagwa has directed that each War Veteran have a borehole drilled at their home, the statement said. The initiative, intended to provide better access to water for the veterans, will commence next week in Mashonaland Central, according to Paul Tungwarara, the Special Presidential Investment Advisor to the United Arab Emirates.\n\nThis strategic move appears to be part of Mnangagwas efforts to win favor and neutralize any opposition within the influential war veterans association.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a strategic gambit to appease the war veterans and suppress opposition within their ranks, President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/mnangagwa-in-bid-to-bribe-war-veterans/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa In Bid To Bribe War Veterans\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "DJ Masomere Causes Havoc At Masvingo School",
            "url": "https://www.zimeye.net/2025/02/08/dj-masomere-causes-havoc-at-masvingo-school/",
            "content": "By A Correspondent\n\nParents in Masvingo have expressed growing concern over the impact of DJ Masomeres sporadic attendance at Ndarama High School, where he works as a teacher.\n\nAccording to several sources, his unreliability has disrupted the learning environment, and some are pointing the finger at his associations with influential figures, including controversial businessman Wicknell Chivayo.\n\nA parent voiced frustration, claiming that DJ Masomeres behaviour can be traced to his connections with powerful individuals.\n\nDJ Masomere, because of his interactions with the First Family and corrupt people like Wicknell, now goes to work only when it suits him, sabotaging the children in the process, the parent stated.\n\nThis attitude is believed to be stemming from Masomeres elevated status due to these connections.\n\nThe parent pointed out that Chivayos indirect influence is affecting the school system: Its clear that Chivayos involvement with Masomere is indirectly ruining the education system in this town.\n\nMasomere is now a law unto himself, neglecting his duties because he feels untouchable.\n\nDespite being a qualified educator and continuing to receive his salary, Masomere reportedly only appears at school when he feels like it, sparking growing dissatisfaction among both parents and school officials.\n\nThe school head is afraid of him, another parent revealed. Even those at the district education offices are afraid of him as well.\n\nA parent from Rujeko Suburb added to the mounting criticism, explaining how Masomeres behavior has grown more reckless with his newfound connections. This behaviour is a result of his associations with people in high places.\n\nHe even boasts that nothing will happen to him because hes now a big fish,' the parent said. Its a waste of taxpayers money to pay someone who isnt doing their job properly. If hes not sitting at home, hes travelling the country, propagating the unconstitutional 2030 mantra.\n\nAs the situation escalates, many are questioning the accountability of public servants, and whether connections with powerful figures like Chivayo should allow someone to evade their professional responsibilities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Parents in Masvingo have expressed growing concern over the impact of DJ Masomere’s sporadic attendance at Ndarama … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/dj-masomere-causes-havoc-at-masvingo-school/\">Continue reading<span class=\"screen-reader-text\"> \"DJ Masomere Causes Havoc At Masvingo School\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "I Am Different From My Dad : Gwekwerere Son",
            "url": "https://www.zimeye.net/2025/02/08/i-am-different-from-my-dad-gwekwerere-son/",
            "content": "Sports Correspondent\n\nDynamos have secured the signature of club legend Evans Gwekwereres son, Ephraim, ahead of the upcoming season.\n\nThe 18-year-old striker has inked a three-year deal after arriving from Herentals U20.\n\nA statement from the Glamour Boys reads: Dynamos FC is pleased to announce the signing of striker Ephraim Gwekwerere.\n\nThe young talent, 18 years old, has signed a three-year contract with the club after joining from Herentals U20.\n\nSpeaking after completing his move, Ephraim expressed his excitement: Im thrilled to sign for Dynamos. This marks a new chapter in my career, and Im eager to meet the clubs expectations.\n\nI play differently from my father, but Im committed to working hard and ensuring the Gwekwerere name continues to shine in football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Dynamos have secured the signature of club legend Evans Gwekwerere’s son, Ephraim, ahead of the upcoming season. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/i-am-different-from-my-dad-gwekwerere-son/\">Continue reading<span class=\"screen-reader-text\"> \"I Am Different From My Dad : Gwekwerere Son\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        },
        {
            "title": "FC Wangu Mazodze Target PSL Promotion",
            "url": "https://www.zimeye.net/2025/02/08/fc-wangu-mazodze-target-psl-promotion-2/",
            "content": "Sports Correspondent\n\nNewly appointed head coach George Magariro has made a promising start at FC Wangu Mazodze, leading his team to a solid performance in a pre-season friendly double-header against Castle Lager Premier Soccer League side Bikita Minerals.\n\nThe team held Bikita Minerals to a 0-0 draw in the first match, before securing a 1-0 victory in the second match.\n\nThese positive results mark a strong beginning to Magariros tenure at FC Wangu Mazodze, who compete in the Eastern Region Soccer League and are eyeing promotion to the PSL.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Newly appointed head coach George Magariro has made a promising start at FC Wangu Mazodze, leading his team … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/08/fc-wangu-mazodze-target-psl-promotion-2/\">Continue reading<span class=\"screen-reader-text\"> \"FC Wangu Mazodze Target PSL Promotion\"</span></a></p>",
            "time": "18:36",
            "date": "08 Feb 2025"
        }
    ]
}