{
    "news": [
        {
            "title": "SRC Boss Resigns",
            "url": "https://www.zimeye.net/2025/09/21/src-boss-resigns/",
            "content": "By Sports Reporter Sports and Recreation Commission (SRC) Director General, Eltah Nengomasha, has resigned from her post.\n\nNengomasha, who had been serving a three-month notice period that was due to end in October, left earlier than expected, sources at the commission confirmed. She was appointed substantive Director General in March 2023, a tenure marked by both achievements and challenges.\n\nHer leadership faced turbulence in March 2024, when she was suspended over alleged misconduct before being reinstated a year later. Despite the setback, Nengomasha reflected on her time at the helm with pride, saying:\n\nSport is richer because of the synergies created. I am grateful for the opportunity to have served my country at the realm of sports administration. I wish the sector all the best in its endeavours.\n\nThe SRC acknowledged her contributions, highlighting her role in strengthening governance structures and improving stakeholder engagement.\n\nIn the meantime, Director of Legal and Corporate Services, Peter Mudzimiri, has been appointed Acting Director General with immediate effect. The commission said the process to recruit a substantive replacement will be announced soon.\n\nNengomashas resignation closes a notable, if at times controversial, chapter in Zimbabwes sports administration, with many now watching closely to see who will steer the SRC into its next phase.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter – Sports and Recreation Commission (SRC) Director General, Eltah Nengomasha, has resigned from her post. Nengomasha, who had … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/21/src-boss-resigns/\">Continue reading<span class=\"screen-reader-text\"> \"SRC Boss Resigns\"</span></a></p>",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "Zim Scribes Mourn Top Video Journalist James Jemwa",
            "url": "https://www.zimeye.net/2025/09/21/zim-scribes-mourn-top-video-journalist-james-jemwa/",
            "content": "By A Correspondent Zimbabwes media fraternity is mourning the tragic loss of freelance journalist and acclaimed videographerJames Jemwa, who died after being struck by a car in central Harare on Saturday night.\n\nMISA Harare Advocacy Committee chair, Mlondolozi Ndlovu, confirmed the tragedy, saying Jemwa was hit near the NSSA building along Second Street. His body was later taken to Parirenyatwa Hospital.\n\nI received a call from the police this morning saying that his body is at Parirenyatwa Hospital, Ndlovu told ZimEye. He added that he had spent the previous evening with Jemwa and several journalists. What is painful is that we were together, sharing laughs until around 7 PM. He was in a jovial mood. Little did we know that was the last time we would see him alive.\n\nWidely respected for his sharp eye and dedication to his craft, Jemwa worked as a freelancer and fixer for international broadcasters includingAl Jazeera, earning a reputation as one of Zimbabwes finest visual storytellers. His lens captured the struggles, resilience, and humanity of ordinary Zimbabweans during some of the countrys darkest moments.\n\nBut his fearless work came at a cost. Under Robert Mugabes regime, Jemwa was frequently targeted by state security forces. On 27 June 2016, he was arrested while filming citizens queuing outside banks in Harare. Barely two months later, he spent a week inChikurubi Maximum Prisonafter another arrest, facing brutal assaults allegedly at the hands of soldiers.\n\nJust before that ordeal, Jemwa was detained alongside fellow journalists Garikai Chaunza, Christopher Mahove, Khumbulani Zamuchiya, and Edgar Gweshe while covering protests against thenVice President Phelekezela Mphokos extended stay at a top Harare Hotel. They were released without charge following intervention by theMedia Lawyers Network.\n\nThese experiences underscored both the hostility faced by independent journalists in Zimbabwe and Jemwas resilience in continuing to bear witness despite intimidation.\n\nColleagues and media organisations have described Jemwa not only as a journalist but also as a friend and mentor who combined professionalism with compassion.\n\nTheZimbabwe National Editors Forum (ZNEF)and theNational Association of Freelance Journalists (NAFJ)also joined in mourning, describing Jemwa as a professional who embodied courage, integrity, and dedication to truth-telling.\n\nFollowing the outpouring of tributes, theZimbabwe Film Industry Development Platformissued a statement confirming that funeral arrangements are underway.\n\nFor those wishing to contribute to the bereaved family, proceeds and contributions can be made to Madeline Chitiyo (0785193129), Sishakele Martha Mukwedini (0778860031), or Marian Kunonga (0775399586) for information, spokespersonAngeline Dimingosaid.\n\nDetails of the burial will be communicated in due course.\n\nJemwas untimely passing leaves a deep void, but his legacy endures in the countless stories he told with compassion and bravery. His life and work stand as a reminder of the risks journalists take to defend truth and the freedoms he so fiercely protected.\n\nIn honouring James, read one tribute, let us protect the freedoms he defended, support one another in our shared risks, and carry forward the fearless pursuit of truth that was his hallmark.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe’s media fraternity is mourning the tragic loss of freelance journalist and acclaimed videographer James Jemwa, who died … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/21/zim-scribes-mourn-top-video-journalist-james-jemwa/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Scribes Mourn Top Video Journalist James Jemwa\"</span></a></p>",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "ZANU PF party Says its Vice President Constantino Chiwenga is Lawless And Selfish",
            "url": "https://www.zimeye.net/2025/09/21/zanu-pf-party-says-its-vice-president-constantino-chiwenga-is-lawless-and-selfish/",
            "content": "VIDEO LOADING BELOW\n\nZANU PF party suggests its Vice President  Constantino Chiwenga is selfish and lawlesshttps://t.co/Hn8KhXSFAxpic.twitter.com/Ey07cVPSk7\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "Justice Chinhengo Dies",
            "url": "https://www.zimeye.net/2025/09/21/justice-chinhengo-dies/",
            "content": "By A Correspondent Former High Court of Zimbabwe judge, Justice Moses Hungwe Chinhengo, has died. He was 71. He passed away Friday morning atMasvingo Provincial Hospital.\n\nJustice Chinhengo left behind a distinguished legal legacy that spanned multiple Southern African jurisdictions. After obtaining his law degree, he served in Zimbabwes Ministry of Justice and later held senior legal offices before being appointed to Zimbabwes High Court in1996. He then undertook judicial roles in Botswana and acted as a judge in Lesothos Court of Appeal. In recent years, he was appointed as an acting High Court judge inNamibiain 2023.\n\nPerhaps his most notable recent assignment was presiding over theFishrot case, a sprawling fraud, corruption, and racketeering trial in Namibia linked to the alleged misuse of fishing quotas involving the Icelandic firmSamherji.The case includes accusations that tens of millions of Namibian dollars in quotas intended for governmental objectives were illegally diverted between 2011 and 2019.\n\nIn the Fishrot trial, Justice Chinhengo firmly pressed that plea-taking proceed even in the face of legal representation challenges, ensuring that constitutional rights to fair trial were respected. He heard and ruled on multiple challenges to his appointmenton nationality, age, and constitutional procedure groundsbut these challenges were ultimately dismissed. He stepped down from the Fishrot case inJuly 2025, citing personal reasons.\n\nTributes from across the legal profession have been pouring in. Advocate Thabani Mpofu called him a keen legal mind, jurist, and true gentleman who always tried to do the right thing. Namibias Chief Justice Peter Shivute described him as a distinguished jurist whose legal career was marked by a principled commitment to justice and the rule of law.\n\nJustice Chinhengos death is a loss not only to Zimbabwe but to the wider Southern African judiciary. His insistence on due process, fairness, and legal integrityespecially in high-stakes corruption cases like Fishrotwill be among the enduring parts of his legacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —Former High Court of Zimbabwe judge, Justice Moses Hungwe Chinhengo, has died. He was 71. He passed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/21/justice-chinhengo-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Justice Chinhengo Dies\"</span></a></p>",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "Zvigananda Properties To Be Seized Under Chiwenga | Full Print",
            "url": "https://www.zimeye.net/2025/09/21/zvigananda-properties-used-to-seized-under-chiwenga-full-print/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "Hellen Zille Announced for Joburg Mayor Post",
            "url": "https://www.zimeye.net/2025/09/21/hellen-zille-announced-for-joburg-mayor-post/",
            "content": "video loading below.\n\nDAs Helen Zille was yesterday announced for the Mayor of Joburg post.\n\nThe DAs leader @jsteenhuisensaid she is a daughter of Joburg who the party is fielding for the top job.\n\nDAs Helen Zille was yesterday announced for the Mayor of Joburg post.The DAs leader@jsteenhuisensaid she is a daughter of Joburg who the party is fielding for the top job.https://t.co/mYCT8oItC9pic.twitter.com/5KZCv1mijV\n\nDAs Helen Zille was yesterday announced for the Mayor of Joburg post.The DAs leader@jsteenhuisensaid she is a daughter of Joburg who the party is fielding for the top job.https://t.co/mYCT8oItC9pic.twitter.com/5KZCv1mijV\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below. DA’s Helen Zille was yesterday announced for the Mayor of Joburg post. The DA’s leader @jsteenhuisensaid she … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/21/hellen-zille-announced-for-joburg-mayor-post/\">Continue reading<span class=\"screen-reader-text\"> \"Hellen Zille Announced for Joburg Mayor Post\"</span></a></p>",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "Sad : Elephant Tramples Hwange Man To Death…",
            "url": "https://www.zimeye.net/2025/09/21/sad-elephant-tramples-hwange-man-to-death/",
            "content": "By A Correspondent\n\nHwange  A 76-year-old man from Hwange has been trampled to death by an elephant, in yet another tragic reminder of the growing human-wildlife conflict in the region.\n\nThe victim, Davison Mudimba, was laid to rest on Tuesday. Villagers described him as a devoted family man and a pillar of the community whose sudden death has left many in shock.\n\nWe have no idea what to do next. We keep losing our loved ones, and authorities must assist us. Khulu was a loving man, and we are in pain, one mourner said.\n\nAnother villager voiced frustration over the situation, saying, We love the animals, but they no longer stay in the parks. They come into our villages, destroy our food, and kill our people. This kind of death is painful to the victim and to us.\n\nFor the widow, Mrs. Violet Khumalo, the tragedy has left a devastating void. He was a loving husband, and we have grandchildren, some of them orphans, that we took care of together. Now that I am alone, it will be difficult. There should be compensation in cases like this because families are left struggling, she said.\n\nAuthorities confirmed that Mudimbas death is part of a broader crisis. More than 40 people have been killed in human-wildlife conflicts since January.\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo, urged communities to exercise caution. We continue to engage communities on animal behaviour and risk mitigation. It is unfortunate that lives continue to be lost, especially with elephants and crocodiles. We encourage communities to minimise movements at night when animals are most active, he said.\n\nHwange National Park, the countrys largest wildlife reserve, is home to more than 45,000 elephantswell above what the ecosystem can sustain. Conservationists say this overpopulation, coupled with the international ivory trade ban, has worsened both conservation challenges and deadly encounters between people and wildlife.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Hwange – A 76-year-old man from Hwange has been trampled to death by an elephant, in yet … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/21/sad-elephant-tramples-hwange-man-to-death/\">Continue reading<span class=\"screen-reader-text\"> \"Sad : Elephant Tramples Hwange Man To Death…\"</span></a></p>",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "RBZ In Uphill Battle To Win Citizens Trust In ZiG",
            "url": "https://www.zimeye.net/2025/09/21/rbz-in-uphill-battle-to-win-citizens-trust-in-zig/",
            "content": "By A Correspondent\n\nHarare  The Reserve Bank of Zimbabwe (RBZ) has urged citizens to place their trust in its ZiG digital currency, even as the nation struggles with a deepening economic crisis and a persistently weak local currency. Economists warn that confidence in ZiG is fragile, particularly as the central bank plans to phase out the US Dollar entirely by 2030.\n\nIn a statement on Thursday, the RBZ said its teams are conducting the ZiG Perception and Confidence Survey II across communities nationwide.\n\nOur teams are out in communities across the country, conducting the ZiG Perception and Confidence Survey II! We invite you to interact with them to share your thoughts. Your input will help us understand your experiences with ZiG, measure confidence in our currency, and inform future monetary policy decisions, the statement read.\n\nCritics argue that public scepticism is unlikely to be swayed by surveys or assurances.\n\nEconomists have warned that introducing a monocurrency system while the local currency remains unstable could trigger further economic disruption.\n\nThe RBZ is asking people to trust a currency that has yet to demonstrate it can survive Zimbabwes chronic financial challenges, said an independent analyst.\n\nPhasing out the US Dollar without earning public confidence risks serious market instability.\n\nDespite the RBZs outreach, ordinary Zimbabweans remain wary, concerned about declining purchasing power, shortage of essential goods, and the uncertainty of a ZiG-only system.\n\nThe reality is that trust cannot be demanded; it must be earned through credible policies and tangible economic stability, the analyst added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – The Reserve Bank of Zimbabwe (RBZ) has urged citizens to place their trust in its … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/21/rbz-in-uphill-battle-to-win-citizens-trust-in-zig/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ In Uphill Battle To Win Citizens Trust In ZiG\"</span></a></p>",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "Former Top Judge Dies",
            "url": "https://www.zimeye.net/2025/09/20/former-top-judge-dies/",
            "content": "By A Correspondent Justice Moses Hungwe Chinhengo, has died.\n\nHe was 71.\n\nThe former High Court of Zimbabwe judge, passed away Friday morning atMasvingo Provincial Hospital.\n\nJustice Chinhengo left behind a distinguished legal legacy that spanned multiple Southern African jurisdictions. After obtaining his law degree, he served in Zimbabwes Ministry of Justice and later held senior legal offices before being appointed to Zimbabwes High Court in1996. He then undertook judicial roles in Botswana and acted as a judge in Lesothos Court of Appeal. In recent years, he was appointed as an acting High Court judge inNamibiain 2023.\n\nPerhaps his most notable recent assignment was presiding over theFishrot case, a sprawling fraud, corruption, and racketeering trial in Namibia linked to the alleged misuse of fishing quotas involving the Icelandic firmSamherji.The case includes accusations that tens of millions of Namibian dollars in quotas intended for governmental objectives were illegally diverted between 2011 and 2019.\n\nIn the Fishrot trial, Justice Chinhengo firmly pressed that plea-taking proceed even in the face of legal representation challenges, ensuring that constitutional rights to fair trial were respected. He heard and ruled on multiple challenges to his appointmenton nationality, age, and constitutional procedure groundsbut these challenges were ultimately dismissed. He stepped down from the Fishrot case inJuly 2025, citing personal reasons.\n\nTributes from across the legal profession have been pouring in. Advocate Thabani Mpofu called him a keen legal mind, jurist, and true gentleman who always tried to do the right thing. Namibias Chief Justice Peter Shivute described him as a distinguished jurist whose legal career was marked by a principled commitment to justice and the rule of law.\n\nJustice Chinhengos death is a loss not only to Zimbabwe but to the wider Southern African judiciary. His insistence on due process, fairness, and legal integrityespecially in high-stakes corruption cases like Fishrotwill be among the enduring parts of his legacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —Justice Moses Hungwe Chinhengo, has died. He was 71.  The former High Court of Zimbabwe judge, passed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/20/former-top-judge-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Former Top Judge Dies\"</span></a></p>",
            "time": "21:26",
            "date": "21 Sep 2025"
        },
        {
            "title": "ED Enjoyed 6 Secs Advance Time To Escape Bomb Attack That Nearly Killed VP Chiwenga, Wife",
            "url": "https://www.zimeye.net/2025/09/20/ed-enjoyed-6-secs-advance-time-to-escape-bomb-attack-that-nearly-killed-vp-chiwenga-wife/",
            "content": "video loading below\n\nBomb video footage shows Mnangagwa enjoyed 6 seconds advance time to escape explosion targeting VP Chiwenga and wife on 23 Jun 2018.Footage credit: Conical Tower.@VOAAfricahttps://t.co/Hn8KhXSFAxpic.twitter.com/aJnUZGfjHM\n\nBomb video footage shows Mnangagwa enjoyed 6 seconds advance time to escape explosion targeting VP Chiwenga and wife on 23 Jun 2018\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "21:26",
            "date": "21 Sep 2025"
        }
    ]
}