{
    "news": [
        {
            "title": "A Tribute to Hulk Hogan",
            "url": "https://www.zimeye.net/2025/07/24/a-tribute-to-hulk-hogan/",
            "content": "Today, we remember and honour a true legend. Hulk Hogan was more than just a wrestling superstarhe embodied strength, charisma, and the larger-than-life spirit that defined the 1980s and 90s.\n\nInside and outside the ring, Hogan inspired millions with his iconic message:Say your prayers, take your vitamins, and believe in yourself.His impact went far beyond sports entertainment, becoming a cultural icon and a symbol of determination and hope for generations.\n\nThank you, Hulkster, for the unforgettable memories, the electrifying matches, and the passion you gave to every moment.\n\nRest in peace. Your legacy will live forever.\n\n Martial Arts and Pen\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Today, we remember and honour a true legend. Hulk Hogan was more than just a wrestling superstar—he embodied strength, charisma, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/a-tribute-to-hulk-hogan/\">Continue reading<span class=\"screen-reader-text\"> \"A Tribute to Hulk Hogan\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "Horror As Preschool Teacher Kills  Learner",
            "url": "https://www.zimeye.net/2025/07/24/horror-as-preschool-teacher-kills-learner/",
            "content": "By A Correspondent JOHANNESBURG  A chilling courtroom confession has sent shockwaves across South Africa after a 25-year-old preschool teacher admitted to killing her four-year-old learner, who was also her stepdaughter.\n\nAmber Lee Hughes appeared before the High Court of South Africa, Gauteng Division in Johannesburg, where she submitted supplementary admissions in a case that has already seen both the State and defence fully argue the merits.\n\nHughes confessed to drowning four-year-old Nada-Jane Challita following what she described as an emotionally charged dispute with the childs father over infidelity. In her admission, Hughes also revealed she had been diagnosed with Borderline Personality Disorder, but stated she was fully aware of her actions at the time. She further disclosed that she had attempted to take her own life multiple times after the incident.\n\nDespite admitting to the murder, Hughes firmly denied charges of rape, claiming she had no knowledge of such allegations.\n\nThe tragic case has been postponed to 7 August 2025 for closing arguments on the submitted admissions. Hughes remains in custody pending her next court appearance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – JOHANNESBURG – A chilling courtroom confession has sent shockwaves across South Africa after a 25-year-old preschool … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/horror-as-preschool-teacher-kills-learner/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Preschool Teacher Kills  Learner\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "Bruno Furniturez Calls for Caution on the Roads After Tragic Chitungwiza Crash",
            "url": "https://www.zimeye.net/2025/07/24/bruno-furniturez-calls-for-caution-on-the-roads-after-tragic-chitungwiza-crash/",
            "content": "By A Correspondent\n\nHarare  In the wake of the horrific road accident that claimed 17 lives along the Harare-Chitungwiza Road, leading local furniture manufacturer Bruno Furniturez has issued a heartfelt call for greater road safety.\n\nThe company, through a press statement released on Thursday, urged all road users to prioritize caution and responsibility when travelling.\n\nAs a brand that delivers furniture across Zimbabwe daily, we are deeply affected by the tragic loss of life on our roads, the statement read.\n\nBruno Furniturez extends its condolences to the bereaved families and calls upon all Zimbabweansdrivers, passengers, and pedestrians aliketo exercise caution and respect for traffic regulations to save lives.\n\nThe appeal forms part of Bruno Furniturezs ongoing corporate social responsibility programme, which seeks to promote community well-being beyond its core business operations.\n\nFounded in 2017 by Leo Tichaona Kambangaborn 13 July 1995Bruno Furniturez has grown from a humble operation into Zimbabwes leading furniture brand. Known for its custom designs and modern craftsmanship, the company has expanded its presence nationwide and continues to open new branches across the country.\n\nLeo Kambanga, widely regarded as a rising business mogul, emphasized that true success includes giving back to the communities that support your growth.\n\nWe didnt get here by chance. Hard work, faith, and the support of Zimbabweans built Bruno Furniturez, Kambanga said. Now its our duty to stand with the people, especially in times of tragedy. Lets protect each other on the roadsevery life matters.\n\nBruno Furniturez remains active on social media and continues to engage with customers via their Facebook page, @BrunoFurniturez.\n\nThe companys statement comes as the nation continues to mourn the victims of the Chitungwiza accident, which has since been declared a national disaster by President Emmerson Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – In the wake of the horrific road accident that claimed 17 lives along the Harare-Chitungwiza … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/bruno-furniturez-calls-for-caution-on-the-roads-after-tragic-chitungwiza-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Bruno Furniturez Calls for Caution on the Roads After Tragic Chitungwiza Crash\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "Passenger Blames Self for ChiTown Horror Crash",
            "url": "https://www.zimeye.net/2025/07/24/passenger-blames-self-for-chitown-horror-crash/",
            "content": "By Crime and Courts Reporter-A Chitungwiza man, identified as Baba Tiara, says he cannot stop blaming himself for the horrific crash that claimed 17 lives on Tuesday morning along Seke Road.\n\nThe tragic accident involved a Nissan Caravan kombi and an out-of-control haulage truck and has since been declared a national disaster by President Emmerson Mnangagwa.\n\nFresh details suggest that a dispute over just 50 cents may have indirectly contributed to the deadly collision.\n\nThe kombi, driven by 25-year-old Tatenda Dhokwani, had reportedly made an unscheduled stop near the waterworks area, just before the Hunyani River Bridge, to drop off Baba Tiara. The stop came after a disagreement over the fare.\n\nBaba Tiara had boarded the kombi at Koala Meats bus stop and offered a 20 ZiG noteroughly equivalent to 50 US centsfor the trip. However, the driver demanded a US$1 fare. When the two failed to reach a compromise, Dhokwani ordered him off the vehicle.\n\nMoments after the kombi resumed its journey, it collided head-on with the haulage truck that had veered into its lane, killing Dhokwani and 16 others.\n\nIn an emotional interview withH-Metro, Baba Tiara described witnessing the crash after stepping off the vehicle.\n\nThe driver wasnt speeding. But just after I got off, the haulage truck crossed into his lane and hit the kombi. I saw it all  it was devastating,he said.\n\nI cant stop blaming myself. Maybe if I had the money, the kombi wouldnt have stopped, and it would have passed that point before the truck came. Ndichirikurwadziwa zvakanyanya uye nekuzvipa mhosva (Im still deeply pained and blaming myself).\n\nThe victims of the crash ranged in age from three to 63. The youngest was Shantel Jere, aged just three, while the oldest was Mary Nyambiri, 63.Among the deceased was the kombi driver, Dhokwani, whom colleagues described as disciplined and responsible.\n\nSolomon Swikiro, popularly known as Solo, a rank marshal at Harare Central Police Station, paid tribute to Dhokwani.\n\nHe wasnt one of those reckless drivers. He didnt drink, wasnt violent, and was always focused. Weve lost a good man  one of the best drivers on the route,said Solo.\n\nNational police spokesperson, Commissioner Paul Nyathi, said investigations into the crash are ongoing.\n\nPolice are conducting comprehensive investigations to establish the full circumstances of the accident. We urge all motorists to exercise caution, ensure their vehicles are roadworthy, and always prioritise safety,he said.\n\nAs the nation mourns, a chilling thought lingers  a disagreement over 50 cents may have sealed the fate of 17 lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-A Chitungwiza man, identified as Baba Tiara, says he cannot stop blaming himself for the horrific … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/passenger-blames-self-for-chitown-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Passenger Blames Self for ChiTown Horror Crash\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "US Wresting Legend Hulk Hogan Dies",
            "url": "https://www.zimeye.net/2025/07/24/us-wresting-legend-hulk-hogan-dies/",
            "content": "Hulk Hogan, the American sports and entertainment star who made professional wrestling a global phenomenon has died at the age of 71, World Wrestling Entertainment said.\n\nWWE is saddened to learn WWE Hall of Famer Hulk Hogan has passed away, World Wrestling Entertainment wrote in a social media post on Thursday. One of pop cultures most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s. WWE extends its condolences to Hogans family, friends, and fans.\n\nHogan became a universal symbol of WWE during the 1980s, with a beach-blonde handlebar moustache, bandanas, and towering physique that he paired with an over-the-top persona that endeared him to fans and captured the spectacle of wrestling entertainment.\n\nHogans flair and bravado helped elevate US wrestling entertainment into a global phenomenon during the 1980s. He later became more involved in US politics, offering a full-throated endorsement of Donald Trump in the 2024 election.\n\nLet Trumpamania run wild, brother! he said during a speech at the 2024 Republican National Convention as he ripped off his shirt. Let Trumpamania rule again!\n\nHogan also became one of the first WWE stars to use his fame and success as a wrestler to pursue opportunities in Hollywood, appearing in films such as Rocky III and Santa With Muscles.\n\nReuters\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Hulk Hogan, the American sports and entertainment star who made professional wrestling a global phenomenon has died at the age … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/us-wresting-legend-hulk-hogan-dies/\">Continue reading<span class=\"screen-reader-text\"> \"US Wresting Legend Hulk Hogan Dies\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "ZIFA Hands Referee Dirwai Six-Match Ban Over FC Platinum-Dynamos Debacle",
            "url": "https://www.zimeye.net/2025/07/24/zifa-hands-referee-dirwai-six-match-ban-over-fc-platinum-dynamos-debacle/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has slapped referee Quesdani Dirwai with a six-match suspension for poor officiating during the controversial Premier Soccer League (PSL) encounter between FC Platinum and Dynamos.\n\nIn a statement released Wednesday, ZIFA confirmed that Dirwai has already begun serving the ban, which covers Matchdays 18 to 23 of the ongoing PSL season.\n\nQuesdani Dirwai has been serving a suspension from officiating Premier Soccer League matches, in line with the Associations commitment to upholding the highest standards of refereeing and fair play in the domestic game, the statement read.\n\nThe disciplinary action stems from Dirwais handling of the June 22 clash at Mandava Stadium, which was abandoned under contentious circumstances.\n\nA review of the match proceedings, bolstered by the Match Commissioners report, found that Dirwais performance fell short of the expected professional standards required at the Premier League level, according to ZIFA.\n\nThe suspension marks another chapter in what has become a turbulent PSL season, as authorities attempt to restore order and confidence in domestic football officiating.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has slapped referee Quesdani Dirwai with a six-match suspension for poor officiating during … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/zifa-hands-referee-dirwai-six-match-ban-over-fc-platinum-dynamos-debacle/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Hands Referee Dirwai Six-Match Ban Over FC Platinum-Dynamos Debacle\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "Mahere Faces Perjury Storm as Kudzayi Declares Legal War Over ‘Phantom’ Pre-Trial",
            "url": "https://www.zimeye.net/2025/07/24/mahere-faces-perjury-storm-as-kudzayi-declares-legal-war-over-phantom-pre-trial/",
            "content": "By Court Correspondent | ZimEye | Edmund Kudzayi Challenges $100,000 Defamation Judgment in Shocking High Court Affidavit\n\nHARARE  24 July 2025  In a dramatic legal development, journalist and political commentator Edmund Kudzayi has filed a bombshell founding affidavit at the High Court of Zimbabwe, seeking the rescission of a US$100,000 default judgment awarded to lawyer and opposition politician Fadzayi Mahere in a defamation case.\n\nKudzayis application, filed under Case No. HC ../25 and received on 24 July 2025 by the High Courts Civil Division, alleges manifest injustice, fraudulent resuscitation, and abuse of court process by Mahere and her legal team. He claims the judgment was improperly obtained through deception and procedural manipulation.\n\nKey Allegations:\n\nOn 10 July 2025, this Honourable Court granted a default judgment against me and in favour of the Respondent for the payment of USD100,000 in the matter Fadzayi Mahere v Edmund Kudzayi HC3060/22, Kudzayi confirms in the affidavit.\n\nKudzayi, represented by Messrs Gunje Legal Practice, says he was never in wilful default and argues that he had a valid defence to the defamation claim. He also contends that Mahere revived a dormant and twice-struck-off matter by misleading the court.\n\nThe matter had been twice struck off the court roll due to lack of prosecution and its resuscitation was based on a misrepresentation to the Court by Respondent and her legal practitioner.\n\nDenied Entry to Court\n\nKudzayi further reveals that he was physically present at the High Court on 24 March 2025 but was obstructed by security from entering the courtroom, resulting in his defence being struck off without representation:\n\nI was obstructed from attending the hearing by High Court security even though I was in the High Court building My defence was struck out and the matter placed on the unopposed roll without my knowledge.\n\nHe accuses the Respondent of snatching a judgment despite being aware that he was not in default and had actively participated in the matter from the outset.\n\nExtraordinary Damages and Manifest Injustice\n\nKudzayi brands the USD100,000 award as an unprecedented windfall not grounded in Zimbabwean legal precedent:\n\nNo court in Zimbabwe would award the quantum of damages awarded to the Respondent as it is so extraordinary as to constitute a manifest injustice.\n\nHe cites previous defamation rulings, arguing the award is drastically out of step with local jurisprudence:\n\nAn award of USD100,000.00 in defamation damages is out of the ordinary in this jurisdiction The highest award thus far granted is USD18,000.00.\n\nAlleged Affair with Married Man at the Core\n\nKudzayi maintains that his original statements, which led to the defamation suit, were truthful and made in the public interest. He claims Mahere had an extramarital affair with Mr. Tinashe Murapata and says his reporting was aimed at highlighting the ethical fitness of a public figure:\n\nThe Respondents case is that it is defamatory that I published the truth that she had an affair with Mr. Tinashe Murapata, a married man. My defence is that it is in the public interest to report on the unethical conduct of one who wishes to be a national leader.\n\nHe asserts that only three peopleMahere, Mr. Murapata, and Murapatas former wifecan confirm the truth, with the latter listed as a key defence witness:\n\nOne of my chief witnesses is the former wife of Mr. Murapata, the man with whom Respondent had an adulterous affair.\n\nCourt Misled, Judicial Integrity Undermined\n\nKudzayi accuses Mahere of abusing her status as an officer of the court:\n\nFraud does more than merely compromise a legal proceeding; it annihilates it These proceedings are void ab initio.\n\nHe further alleges that she deliberately misled the judge by bypassing a roundtable engagement and falsely claiming urgency due to Kudzayis supposed lack of cooperation.\n\nShe deprived me of the very engagement she had claimed was a prerequisite, contradicting her own justification and undermining the integrity of the process.\n\nAppeal to Justice\n\nIn a concluding plea to the court, Kudzayi states:\n\nThe application manifestly has merit. It should not be opposed. Respondent snatched at a judgment. She should not have done so.\n\nHe argues the matter must be properly ventilated through a full trial and cross-examination, warning that the court risks setting a dangerous precedent if it allows the judgment to stand.\n\nThis is a developing story. ZimEye will continue to follow proceedings in the High Court.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Court Correspondent | ZimEye | Edmund Kudzayi Challenges $100,000 Defamation Judgment in Shocking High Court Affidavit HARARE – 24 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/mahere-faces-perjury-storm-as-kudzayi-declares-legal-war-over-phantom-pre-trial/\">Continue reading<span class=\"screen-reader-text\"> \"Mahere Faces Perjury Storm as Kudzayi Declares Legal War Over ‘Phantom’ Pre-Trial\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "It’s Dog Eat Dog in PSL Elections as Power Struggles Intensify",
            "url": "https://www.zimeye.net/2025/07/24/its-dog-eat-dog-in-psl-elections-as-power-struggles-intensify/",
            "content": "By Sports Reporter\n\nThe race for control of Zimbabwes top-flight football has reached fever pitch, with a fierce contest unfolding ahead of the Premier Soccer League (PSL) and Zimbabwe Womens Soccer League (ZWSL) elections set for Friday in Harare.\n\nThe Zimbabwe Football Association (ZIFA) has confirmed the final list of candidates vying for influential positions that will shape the direction of local football. The electoral process, ZIFA said, will be conducted in strict compliance with the ZIFA Statutes and the newly adopted ZIFA Electoral Code (2024).\n\nThe PSL elections will decide a new five-member board, which includes the chairperson, vice-chairperson, and three executive committee members. Meanwhile, the ZWSL will elect a chairperson, vice-chairperson, and five board members to spearhead the growth of the womens game.\n\nThe battle for the PSL chairpersons post is a high-stakes affair, with four seasoned football administrators throwing their hats into the ring. These include former Dynamos chairman and current Simba Bhora official Isaiah Mupfurutsa, Masimba Chihowa of Manica Diamonds, Dumisani Siwale of FC Platinum, and Leonard Musariri of Ngezi Platinum.\n\nIn a rare development, Highlanders chairman Kenneth Mhlophe is running unopposed and will automatically assume the position of vice-chairperson of the PSL board.\n\nAnalysts believe the outcome of the elections will have far-reaching implications for the game in Zimbabwe, especially at a time when the Premier Soccer League faces pressure to reform and modernize.\n\nThis is more than just a football electionits a power struggle for the soul of the domestic game, said a football insider. Each candidate represents a different approach to administration, and the choices made on Friday could either steady the ship or deepen the leadership crisis.\n\nWith no clear frontrunner and competing club loyalties in play, Fridays elections promise to be a tense and potentially transformative moment in Zimbabwean football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter The race for control of Zimbabwe’s top-flight football has reached fever pitch, with a fierce contest unfolding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/its-dog-eat-dog-in-psl-elections-as-power-struggles-intensify/\">Continue reading<span class=\"screen-reader-text\"> \"It’s Dog Eat Dog in PSL Elections as Power Struggles Intensify\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "Deworming Livestock and Poultry: A Must for Healthy Animals",
            "url": "https://www.zimeye.net/2025/07/24/deworming-livestock-and-poultry-a-must-for-healthy-animals/",
            "content": "By Dr Trywell Muzerengi\n\nDeworming is a vital component of livestock and poultry management, yet it is often overlooked by many farmers. Understanding the importance of controlling internal parasites is key to improving animal health, productivity, and profitability.\n\nInternal parasites such as worms compete with animals for nutrients. When animals are infested, the feed provided ends up benefiting the parasites more than the animals themselves. This leads to poor growth, reduced production, and in severe cases, death.\n\nSo why do we deworm our animals and poultry?The primary reason is to control internal parasites so that animals and birds can fully utilise the feed given to them. A well-fed animal with a parasite-free gut is healthier, grows faster, and produces better milk, meat, or eggs.\n\nHow Often Should Deworming Be Done?\n\nEach animal species requires deworming at specific intervals:\n\nCattle should be dewormed twice a year  once before the rainy season and again after the rainy season.\n\nPigs need to be dewormed every three months, or soon after weaning from the sows.\n\nGoats should be dewormed every three months.\n\nChickens also require deworming every three months to prevent parasite build-up in the flock.\n\nImportant Tips for Effective Deworming\n\nAlways use broad-spectrum dewormers that can control all types of internal parasites, not just selective ones.\n\nRotate deworming drugs occasionally to prevent resistance.\n\nMaintain good hygiene and proper feeding practices to reduce the risk of re-infestation.\n\nBy keeping animals parasite-free, farmers not only improve the welfare of their livestock and poultry but also enhance their overall farm productivity. Regular deworming is a simple, cost-effective practice that pays big dividends in animal performance and farmer income.\n\nInstagram: lasmuzagro1\n\nLinkedIn: Lasmuz Agro\n\n[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Deworming is a vital component of livestock and poultry management, yet it is often overlooked by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/deworming-livestock-and-poultry-a-must-for-healthy-animals/\">Continue reading<span class=\"screen-reader-text\"> \"Deworming Livestock and Poultry: A Must for Healthy Animals\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "Zanu PF Government Proposal to Teach Maths, Physics in Shona Branded ‘Unrealistic’ by Experts",
            "url": "https://www.zimeye.net/2025/07/24/zanu-pf-government-proposal-to-teach-maths-physics-in-shona-branded-unrealistic-by-experts/",
            "content": "By Staff Reporter\n\nThe Mnangagwa-led government has ignited controversy after proposing that Mathematics and Physics be taughtand possibly writtenin Shona, as part of efforts to localise the national education curriculum.\n\nThough details remain sketchy, insiders within the Ministry of Primary and Secondary Education say discussions are underway to introduce the use of indigenous languages in teaching key scientific subjects traditionally taught in English.\n\nThe move has drawn sharp criticism from education experts who warn it could backfire.\n\nThis proposal is completely unrealistic, said a Harare-based educationist who spoke on condition of anonymity. Mathematics and Physics are universal languages. Changing the medium of instruction wont help learners grasp the conceptsit will only confuse them further.\n\nThe educationist said emphasis should be placed on better teaching tools and qualified personnel, rather than experimenting with language shifts in technical fields.\n\nIf learners are struggling, the answer is not to change the language of the formulas. Instead, we must improve teacher training and invest in learning materials. You dont fix comprehension issues by altering the mediumyou improve capacity.\n\nCritics also argue that shifting technical education to local languages risks isolating Zimbabwean learners from global academic and scientific communities, where English remains the dominant language of instruction and research.\n\nThe government has yet to issue a public statement clarifying the scope or implementation plan for the proposal.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Staff Reporter The Mnangagwa-led government has ignited controversy after proposing that Mathematics and Physics be taught—and possibly written—in Shona, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/24/zanu-pf-government-proposal-to-teach-maths-physics-in-shona-branded-unrealistic-by-experts/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Government Proposal to Teach Maths, Physics in Shona Branded ‘Unrealistic’ by Experts\"</span></a></p>",
            "time": "20:48",
            "date": "25 Jul 2025"
        }
    ]
}