{
    "news": [
        {
            "title": "New ZiG On The Cards As Economy Collapses",
            "url": "https://www.zimeye.net/2025/08/27/new-zig-on-the-cards-as-economy-collapses/",
            "content": "By Business Reporter  The Reserve Bank of Zimbabwe (RBZ) has begun producing redesigned ZiG banknotes, which it says will soon be rolled out into circulation.\n\nWhile authorities insist this is merely a redesign and not the introduction of a new currency, the move has been widely interpreted as confirmation that the ZiG  launched with fanfare just over a year ago  has already collapsed.\n\nThe development has revived bitter memories of Zimbabwes long history of failed currency experiments stretching back to the early 2000s.\n\nWhen the economy began to unravel in 2000 following the chaotic land reform programme, capital flight, and sanctions, Zimbabwes currency woes became the most visible sign of economic collapse. By 2003, thenRBZ Governor Gideon Gono rolled out a series of tricks to prop up the local unit  from introducing bearer cheques and agro-cheques to redenominating the dollar multiple times. None of these efforts worked, as hyperinflation destroyed savings, pensions, and wages, eventually forcing the government to abandon the Zimbabwe dollar altogether in 2009.\n\nFor a decade, Zimbabweans used a basket of foreign currencies, primarily the US dollar and South African rand, which restored a measure of stability. But in 2016, facing cash shortages, the government introduced bond notes, initially pegged 1:1 with the US dollar. The public, however, quickly rejected them as inflation returned. In 2019, the government attempted to de-dollarise again by reintroducing the Zimbabwe dollar, but that too rapidly lost value.\n\nBy April 2024, the ZiG (Zimbabwe Gold) was launched, marketed as a gold-anchored currency backed by the countrys gold and foreign exchange reserves. Officials claimed it would restore confidence, but like its predecessors, the ZiG has failed to inspire trust in a population scarred by two decades of monetary collapse.\n\nNow, barely a year after its launch, the RBZ has confirmed it is redesigning ZiG notes, citing poor durability and counterfeiting risks.\n\nRBZ Governor Dr. John Mushayavanhu maintained that this was standard international practice rather than an admission of failure:\n\nThe Reserve Bank is not going to issue a new currency. We are merely redesigning the current banknotes to enhance quality in line with international standards, he said.\n\nBut critics argue the move signals the collapse of the experiment. The ZiGs purchasing power has steadily eroded, and its use in mobile money platforms remains problematic, with many retailers preferring the US dollar and ignoring official exchange rates.\n\nAt present, only ZiG10 and ZiG20 notes are circulating, while the rest of the denominations announced in April 2024 never fully entered the market.\n\nThe RBZ insists it is building up foreign currency reserves to support a transition towards a mono-currency regime within five years. Yet economists note that similar promises were made in 2003, 2006, 2008, 2016, and 2019  and each ended in collapse.\n\nEconomist and RBZ Monetary Policy Committee member, Mr. Persistence Gwanyanya, insisted the redesign showed seriousness on the part of authorities:\n\nAll this can be construed as measures to restore confidence in the countrys currency. It reflects seriousness towards the currencys stability and permanency.\n\nHowever, many Zimbabweans remain unconvinced. With inflation still eroding wages, and the US dollar remaining the preferred store of value, the ZiG is now seen as the latest chapter in a two-decade cycle of monetary failure.\n\nThe RBZ has also moved to compel mobile money platforms to allow seamless use of ZiG alongside foreign currency, in a bid to boost acceptance. Many Zimbabweans, however, complain about high transaction fees and a lack of confidence in the official exchange rate, further undermining trust in the local unit.\n\nStakeholders have urged the central bank to revise bank charges and make digital payments more affordable, warning that current costs discourage people from depositing money.\n\nFrom bearer cheques to bond notes, from the Zimbabwe dollar to the ZiG, the story of Zimbabwes economy since 2000 has been one of currency collapse and broken promises. The redesign of the ZiG is the latest reminder that until government addresses the structural causes of economic decline  corruption, low production, and lack of investor confidence  no amount of rebranding can restore lasting stability to Zimbabwes money.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – The Reserve Bank of Zimbabwe (RBZ) has begun producing redesigned ZiG banknotes, which it says will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/27/new-zig-on-the-cards-as-economy-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"New ZiG On The Cards As Economy Collapses\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Leads In Mutangadura Murder Investigations",
            "url": "https://www.zimeye.net/2025/08/27/leads-in-mutangadura-murder-investigations/",
            "content": "By Crime and Courts Reporter Fresh details suggest that the late Ruwa businessman, Joseph Mutangaz Mutangadura, may have been killed in a murder plot linked to his wifes alleged lover, according to reports by a local online news portal.\n\nMutangadura and his wife, Patience Dambudzo, had endured a rocky marriage marked by allegations of infidelity and deep-seated distrust. The scandal spilled into Harares social circles last year when Mutangadura reportedly launched a failed manhunt for his wifes suspected lover. At one point, he even moved out of their home in protest, only to later return under strained circumstances. Though the couple had reconciled by the time of his death, tensions reportedly lingered.\n\nOn the night of Sunday, 17 August, Mutangadura, 67, was shot dead at his Lisheen Estate farmhouse in Ruwa by seven masked men. Strikingly, nothing of value was taken from the property, sparking speculation that the attack was a targeted hit rather than a robbery.\n\nAccording to police, the gang overpowered a security guard, tied him up, and demanded a description of Mutangadura before heading straight to the couples bedroom. Despite Mutangaduras reported offer to lead them to cash at his abattoir, the intruders shot him multiple times in the chest and stomach. Curiously, the attackers left behind valuables, taking only a cellphone worth about US$10.\n\nPatience was rendered unconscious during the attack and is currently hospitalised under police protection. Investigators have since seized her cellphone for forensic examination, fuelling rumours that she may have communicated with the attackers.\n\nThe online portal claims leaked messages circulating on social media suggest possible insider involvement, though police have not confirmed these claims.\n\nRelatives of the slain businessman insist the precision of the killing points to a planned assassination. What is disturbing is that the gang was not after money but the life of Joseph, one family member said.\n\nMutangadura, a prominent entrepreneur who owned butcheries, Lisheen Estate, and the popular Mutangadura Hideout, was buried in Goromonzi last Saturday. His violent death has left unanswered questions about who wanted him dead  and why  as detectives from the CID Homicide Unit intensify their manhunt for the seven suspects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Fresh details suggest that the late Ruwa businessman, Joseph “Mutangaz” Mutangadura, may have been killed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/27/leads-in-mutangadura-murder-investigations/\">Continue reading<span class=\"screen-reader-text\"> \"Leads In Mutangadura Murder Investigations\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Government Speaks On Coup Tanks Seen In Harare",
            "url": "https://www.zimeye.net/2025/08/27/government-speaks-on-coup-tanks-seen-in-harare/",
            "content": "By A Correspondent  Presidential spokesperson George Charamba has sought to allay fears after several army tanks were spotted in Harare on Monday, saying the new military hardware is part of efforts to strengthen the countrys defence systems.\n\nThe sight of the tanks, however, immediately revived memories of the dramatic November 2017 coup that ended the 37-year rule of the late Robert Mugabe. Then, armoured vehicles rolled into the capital under the command of General Constantino Chiwenga, who launched Operation Restore Legacy. Although the military insisted it was not a coup but a move to target criminals around the President, Mugabe was forced to resign within days, paving the way for his deputy Emmerson Mnangagwa to seize power.\n\nThat moment has remained deeply divisive. While some Zimbabweans welcomed Mugabes ouster as long overdue, others argue the coup entrenched military dominance in politics and merely replaced one authoritarian order with another. Mnangagwa and his then ally, now rival, Vice President Chiwenga have since been accused of consolidating power at the expense of democracy.\n\nGiven this history, Tuesdays unusual movement of military hardware in the capital quickly fuelled speculation about fresh political instability. But Charamba, writing on his X (formerly Twitter) account under the pseudonymJamwanda, dismissed the rumours, insisting the display was part of routine upgrades in the armys arsenal.\n\nMHANDO YEKUTANGA YETSVIMBO ITSVA YAPFUURA NDISATI NDAGADZIRISA CHIVHITIVHITI CHEMASHOKO. ZIMBABWE CONTINUES TO UPGRADE ITS DEFENCE CAPABILITIES TO DETER ANY WOULD-BE AGGRESSORS. WEAKNESS TEMPTS!!!!! he posted.\n\nCharamba stressed that the artillery movements were unrelated to internal politics and should be viewed solely as demonstrations of military readiness. Still, for many Zimbabweans, the shadow of 2017 looms large  making the presence of tanks on Harares streets a stark reminder of the militarys enduring role in the countrys fragile political landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Presidential spokesperson George Charamba has sought to allay fears after several army tanks were spotted in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/27/government-speaks-on-coup-tanks-seen-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Government Speaks On Coup Tanks Seen In Harare\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Mental Patient Brutally Kills Three In Karoi",
            "url": "https://www.zimeye.net/2025/08/27/mental-patient-brutally-kills-three-in-karoi/",
            "content": "By A Correspondent  The Zimbabwe Republic Police has expressed concern over the rising number of murder cases linked to individuals with mental health conditions.\n\nIn a statement, police said, The latest incident occurred in Makoni Village, Tengwe, on 18 August 2025, where Patrick Makufa, a mental health patient, allegedly struck Constaine Mabheka (55) several times on the head with an axe handle, resulting in her death.\n\nAccording to the report, the suspect also hit Kunashe Mabheka (04) once on the head with the axe handle before ambushing Atilda Mharadze (19), whom he struck several times on the head with the axe handle. All three victims died on the spot.\n\nPolice confirmed that the suspect has been arrested. They urged communities to take mental health issues seriously, stating, The Zimbabwe Republic Police urges the public to exercise caution, particularly when interacting with individuals with mental health challenges. We implore families and guardians of individuals with mental health issues to seek professional help and ensure that they receive the necessary support and treatment on time.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Zimbabwe Republic Police has expressed concern over the rising number of murder cases linked to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/27/mental-patient-brutally-kills-three-in-karoi/\">Continue reading<span class=\"screen-reader-text\"> \"Mental Patient Brutally Kills Three In Karoi\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Pastor Roy Mambongo Savens — From Pulpit to COS Fraud Allegations",
            "url": "https://www.zimeye.net/2025/08/27/pastor-roy-mambongo-savens-from-pulpit-to-cos-fraud-allegations/",
            "content": "By Investigative Reporter, ZimEye | London, August 24, 2025\n\nFor years (the Director of Group 6 International), Pastor Roy Mambongo Savens presented himself as a preacher and entrepreneur, running construction projects and posting on social media about faith and business success. But behind the polished image, a mounting dossier of allegations links him to fake Certificate of Sponsorship (COS) fraud  a scheme preying on Zimbabweans and other migrants desperate for work in the United Kingdom.\n\nToday, with at least 48,500 in new complaints surfacing in just the last month, Savens faces growing scrutiny  and pressure from mediators, journalists, and victims who say they were tricked into paying thousands for jobs that never materialised.\n\nVictims Complaints\n\nTwo complainants say Savens took tens of thousands of pounds from them on the promise of UK care-sector jobs.\n\nWhen pressed for repayment, Savens allegedly proposed paying 500 a month, starting on the 7th of each month  an offer the complainants rejected as inadequate given the sums involved.\n\nThe Mediation Transcripts\n\nTwo intervention meetings in early August captured Savens acknowledging the debts but delaying repayment:\n\n2 August  Mediator (Speaker 1):\n\nTheres an outstanding matter involving $38,000 and allegations of fake Certificates of Service.\n\nSavens: I understand. Theres been a lot of pressure from the people Im working with, but the matter is being addressed. Its underway.\n\n3 August  Mediator (Speaker B):\n\nSavens: Im taking responsibility and want to resolve thisnot because of pressure, but because Ive always been upfront with them.\n\nThe Cape Town Car Dealership Incident\n\nThe most vivid moment in this unfolding scandal came not in a church or a mediation room, but on the showroom floor of a luxury car dealership in Cape Town, South Africa.\n\nAccording to multiple sources, Savens arrived with USD 40,000 in cash, eager to purchase a high-end vehicle  a deal that should have been straightforward. Yet the transaction took an extraordinary turn.\n\nThe dealer, suspicious of his manner and paperwork, quietly began cross-checking Savens background. Within hours, the dealer had linked Savens name to social media posts and victim accounts describing the COS scam.\n\nAlarmed, the seller refused to release the car.\n\nHe had the money in hand, recalls a source close to the dealership. But the story didnt add up. His behaviour screamed red flag. When we realised people were calling him a scammer over visa fraud, we decided we couldnt sell him the car. It was too risky.\n\nFor victims, this incident was a powerful symbol: if even a car dealer in Cape Town could connect the dots and refuse to engage, why had authorities not acted sooner?\n\nHis Response\n\nIn WhatsApp messages seen by this publication, Savens denied being a scammer and insisted he had made a genuine repayment offer:\n\nIt is well, do as you will. I offered to pay 500 monthly every 7th, and you rejected it. If that is demonstration of scam theres nothing I can further do to appease. But thank you for giving me an opportunity to explain my position and not being biased.\n\nBut critics say the dealerships rejection speaks volumes: even in a high-value transaction, Savens was deemed too suspicious to trust.\n\nTimeline of Events\n\nWhats Next?\n\nSavens has not been charged with any crime in connection with the allegations. Complainants are preparing to escalate the matter through Action Fraud UK and the Home Office sponsor-licensing unit.\n\nMeanwhile, the transcripts, the Cape Town incident, and WhatsApp exchanges are circulating widely online  fueling debate over whether Savens is a misunderstood businessman caught in failed deals, or a pastor exploiting faith and desperation for profit.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigative Reporter, ZimEye | London, August 24, 2025 For years (the Director of Group 6 International), Pastor Roy Mambongo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/27/pastor-roy-mambongo-savens-from-pulpit-to-cos-fraud-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Pastor Roy Mambongo Savens — From Pulpit to COS Fraud Allegations\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Watch: ZRP Cop In Trouble For Denouncing Mnangagwa Regime…",
            "url": "https://www.zimeye.net/2025/08/27/watch-zrp-cop-in-trouble-for-denouncing-mnangagwa-regime/",
            "content": "Tongai Fambi, a recently resigned Assistant Police Inspector, has found himself in hot water after publicly criticizing the ZANU PF government for prioritizing welfare donations to Mozambique while many Zimbabweans struggle with hunger.\n\nOn Tuesday, Fambi was evicted from a police house at Chikato in Masvingo, an operation reportedly overseen by a chief superintendent. According to ZRP policy, retired officers are normally allowed to remain in government housing for three months or longer under certain circumstances.\n\nFambi told reporters that the sudden eviction left his family in a difficult situation. My house outside Masvingo is currently occupied by tenants who require proper notice before moving out, he explained. We have nowhere to go, and this eviction has left my family stranded.\n\nThe eviction has sparked discussions about the treatment of former officers who voice political criticism, and about the broader tension between government priorities and citizens hardships.\n\nVideo: Masvingo Mirror\n\nTongai Fambi, an Assistant Police Inspector who resigned from ZRP a few weeks ago and then went on to attack Zanu PF for being hypocritical by donating to the needy in Mozambique when Zimbabweans are starving was evicted out of a Police house at Chikato in Masvingo on Tuesday.pic.twitter.com/z9IuIApG6y\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tongai Fambi, a recently resigned Assistant Police Inspector, has found himself in hot water after publicly criticizing the ZANU PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/27/watch-zrp-cop-in-trouble-for-denouncing-mnangagwa-regime/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: ZRP Cop In Trouble For Denouncing Mnangagwa Regime…\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Zimbabwean Journalist Itai Mushekwe Dies in Germany",
            "url": "https://www.zimeye.net/2025/08/26/zimbabwean-journalist-itai-mushekwe-dies-in-germany/",
            "content": "By Our News Desk\n\nHarare, Zimbabwe  The Zimbabwean journalism fraternity is mourning the death of veteran journalist Itai Gwatidzo Mushekwe, who has died in Germany at the age of 42.\n\nThe news of his passing was confirmed last week by fellow journalist John Mokwetsi, who revealed that Mushekwe had in fact died months earlier, with the announcement only reaching close friends and colleagues two days before his burial in Cologne, Germanys fourth largest city.\n\nMushekwe, who was relied on by Prof Jonathan Moyo and once worked for the Zimbabwe Independent before relocating abroad, left Zimbabwe more than 15 years ago on a journalism training programme in Germany. Like many in the diaspora, he never returned home as the country plunged into economic turmoil and political uncertainty.\n\nDespite living thousands of kilometres away, he remained committed to his craft, contributing to various media outlets and carving a reputation as a sharp political and arts reporter. He was also known as co-founder of Spotlight-Z.com, an independent online platform dedicated to Zimbabwean affairs.\n\nA Life of Loyalty and Dedication\n\nColleagues and friends described Mushekwe as a loyal, intelligent, and passionate journalist whose love for family and community never waned despite years of distance.\n\nHe was the intellectual of our group, the guy who always had a newspaper in hand, who loved discussing serious issues and kept us thinking, one of his former schoolmates from Ellis Robins Boys High recalled.\n\nBeyond journalism, Mushekwe was remembered as a vibrant character who enjoyed laughter, sports, and nurturing talent around him. He had a close bond with his cousin, football star Nyasha Mushekwi, often supporting his sporting ambitions from the sidelines.\n\nA Lonely Passing Abroad\n\nTragically, Mushekwes final years were marked by increasing isolation. Friends say he had drifted from regular communication, choosing to live quietly and privately in Germany.\n\nItais lone death and lone burial in a foreign land is what pains us most, Mokwetsi said. But we take comfort in the memories of his brilliance and the indelible mark he left in journalism and in our lives.\n\nLegacy\n\nMushekwes passing has shocked colleagues across Zimbabwes media circles, many of whom only learned of his death through social media tributes.\n\nHe is remembered not only as a determined reporter but also as a mentor, cousin, and friend, who lived with loyalty, dedication, and an unwavering love for the written word.\n\nAs Zimbabwe reflects on the loss of yet another journalist in the diaspora, his story underscores the human cost of migration, exile, and the pursuit of truth far from home.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Our News Desk Harare, Zimbabwe – The Zimbabwean journalism fraternity is mourning the death of veteran journalist Itai Gwatidzo … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/zimbabwean-journalist-itai-mushekwe-dies-in-germany/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwean Journalist Itai Mushekwe Dies in Germany\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "“Slayqueen” Ritzmcleish Strawbae Strikes Again, Endorses Mnangagwa’s 2030 Agenda",
            "url": "https://www.zimeye.net/2025/08/26/slayqueen-ritzmcleish-strawbae-strikes-again-endorses-mnangagwas-2030-agenda/",
            "content": "By A Correspondent\n\nZimbabwean socialite Ritzmcleish Strawbae, real name Michelle Moyo, has once again sparked controversy after openly declaring her support for President Emmerson Mnangagwas Vision 2030 agenda in a bold social media post.\n\nThe influencer, who earlier caused a stir with her Zanu PF chants, doubled down on Tuesday afternoon with a statement that has left social media divided.\n\nTichifamba ne Vision 2030 tichitungamirirwa naBaba Vedu vaMnangagwa the Man of Progress, she wrote, signaling her endorsement of Mnangagwas long-term development plan.\n\nThe 2030 agenda, often associated with extending Mnangagwas grip on power beyond his constitutionally mandated second term ending in 2028, has been a highly contentious topic in Zimbabwean politics. Ritzmcleishs open support for it has reignited debate over the role of influencers in shaping political discourse.\n\nThis latest declaration comes hot on the heels of a viral Facebook live session where she chanted Zanu PF slogans and praised First Lady Auxillia Mnangagwa.\n\nED huchii. Special thanks to Mama Auxilia naMadzimai Lulu You are special, she said in the earlier video that spread rapidly across social platforms.\n\nHer remarks have triggered mixed reactions online. Some users praised her boldness and loyalty, while others accused her of chasing relevance through politics. Critics argue that many socialites deliberately avoid political involvement to protect their brand image, making her stance unusual.\n\nDespite the backlash, Ritzmcleish has not backed down or issued a retraction. Analysts suggest her move highlights a growing trend of influencers venturing into political spaceswhether out of genuine conviction or for strategic visibility.\n\nAs discussions rage on Facebook and X (formerly Twitter), Zimbabweans remain split: Is Ritzmcleishs endorsement a courageous exercise of free expression or a calculated play for attention?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean socialite Ritzmcleish Strawbae, real name Michelle Moyo, has once again sparked controversy after openly declaring her … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/slayqueen-ritzmcleish-strawbae-strikes-again-endorses-mnangagwas-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"“Slayqueen” Ritzmcleish Strawbae Strikes Again, Endorses Mnangagwa’s 2030 Agenda\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Susan Mutami ex Boyfriend Orders All Magistrates Countrywide To Salute Him As A Doctor",
            "url": "https://www.zimeye.net/2025/08/26/susan-mutami-ex-boyfriend-orders-all-magistrates-countrywide-to-salute-him-as-a-doctor/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:31",
            "date": "28 Aug 2025"
        },
        {
            "title": "Mutangadura Murder, Wife Infidelity Allegations Surface",
            "url": "https://www.zimeye.net/2025/08/26/mutangadura-murder-police-probe-wife-as-infidelity-allegations-surface/",
            "content": "By Crime and Courts Reporter Fresh details suggest that the late Ruwa businessman, Joseph Mutangaz Mutangadura, may have been killed in a murder plot linked to his wifes alleged lover, according to reports by a local online news portal.\n\nMutangadura and his wife, Patience Dambudzo, had endured a rocky marriage marked by allegations of infidelity and deep-seated distrust. The scandal spilled into Harares social circles last year when Mutangadura reportedly launched a failed manhunt for his wifes suspected lover.\n\nAt one point, he even moved out of their home in protest, only to later return under strained circumstances. Though the couple had reconciled by the time of his death, tensions reportedly lingered.\n\nOn the night of Sunday, 17 August, Mutangadura, 67, was shot dead at his Lisheen Estate farmhouse in Ruwa by seven masked men. Strikingly, nothing of value was taken from the property, sparking speculation that the attack was a targeted hit rather than a robbery.\n\nAccording to police, the gang overpowered a security guard, tied him up, and demanded a description of Mutangadura before heading straight to the couples bedroom. Despite Mutangaduras reported offer to lead them to cash at his abattoir, the intruders shot him multiple times in the chest and stomach. Curiously, the attackers left behind valuables, taking only a cellphone worth about US$10.\n\nPatience was rendered unconscious during the attack and is currently hospitalised under police protection. Investigators have since seized her cellphone for forensic examination, fuelling rumours that she may have communicated with the attackers.\n\nThe online portal claims leaked messages circulating on social media suggest possible insider involvement, though police have not confirmed these claims.\n\nRelatives of the slain businessman insist the precision of the killing points to a planned assassination. What is disturbing is that the gang was not after money but the life of Joseph, one family member said.\n\nMutangadura, a prominent entrepreneur who owned butcheries, Lisheen Estate, and the popular Mutangadura Hideout, was buried in Goromonzi last Saturday. His violent death has left unanswered questions about who wanted him dead  and why  as detectives from the CID Homicide Unit intensify their manhunt for the seven suspects.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Fresh details suggest that the late Ruwa businessman, Joseph “Mutangaz” Mutangadura, may have been killed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/26/mutangadura-murder-police-probe-wife-as-infidelity-allegations-surface/\">Continue reading<span class=\"screen-reader-text\"> \"Mutangadura Murder, Wife Infidelity Allegations Surface\"</span></a></p>",
            "time": "08:31",
            "date": "28 Aug 2025"
        }
    ]
}