{
    "news": [
        {
            "title": "Chivayo Overshadows VP Chiwenga",
            "url": "https://www.zimeye.net/2025/04/25/chivayo-overshadows-vp-chiwenga/",
            "content": "By Business ReporterWicknell Chivayo Friday overshadowed PresidentMnangagwastwo deputies, Constantino Chiwenga and Kembo Mohadi, after he dominatedMnangagwasentourage and official motorcade at the Zimbabwe International Trade Fair (ZITF) in Bulawayo.\n\nMnangagwa arrived at the 65th edition of thecountryspremier trade showcase alongside Mozambican President Daniel Chapo, thisyearsguest ofhonour.\n\nButit wasChivayosconspicuous presenceriding in the presidential convoythatignited fresh public outrage and sharpened concerns over state capture and the growing influence of politically connected elites inZimbabwesfaltering economy.\n\nIn a moment dripping with irony, the President of Zimbabwe entered a venue meant to celebrate transparency and opportunity while flanked by Chivayo, a convicted criminal under investigation by SouthAfricasFinancial Intelligence Centre for allegedly diverting over R1 billion in public funds.\n\nFar from a mere observer, Chivayo was visually dominant in the footage,symbolisingmore than just proximity to powerhebecame the embodiment oftheeventsglaring contradictions.\n\nOnce again,Chivayosnameis tiedto a string of opaque and controversial tenders: the failed Gwanda Solar Project, the Zimbabwe Electoral Commission (ZEC) ballot paper deal, and most recently, a jaw-droppingUSD $627 millionroad construction tender.\n\nHis presence alongside Mnangagwadidntjust raise eyebrowsit shattered any lingering illusions about theadministrationscommitment to clean governance.\n\nAlthough Mnangagwa has repeatedly denied personal business links to Chivayo, their public appearancescontinue tospeak louder than the denials.\n\nFridaysZITF showcase offered more than opticsitoffereda message.\n\nThat message, many argue, is damning: in Zimbabwe, power protects its own, even when corruption is in plain sight.\n\nAppearing with a man whose voice hasbeen heardin leaked audio tapes openly coordinating tendergrabs,at a trade fair branded as a celebration ofinnovative and honestbusiness,reflectsnot justpoor political judgmentit signalsdisdain for public accountability.\n\nIn a country battling broken infrastructure, a collapsing health sector, and plummeting investor confidence,Chivayoselevation in official spaces sends a chilling signal: the looting class isnot onlytolerated, itiscelebrated.\n\nChivayo, popularly known on social media asSir Wicknell,has becomebotha symbol of political impunity and a flashpoint for public frustration.\n\nDespite lacking the technical expertise or delivery track record, he has controversially secured billion-dollar government contractsmany of which remain incomplete or have collapsed entirely.\n\nHis most infamous deal, the $173 million Gwanda Solar Project awarded in 2015 to his company Intratrek Zimbabwe, remains unfinished nearly a decade later.\n\nDespite no progress on the ground, Chivayo received substantial advance payments from the Zimbabwe Power Company (ZPC), prompting criticism from the Auditor-General and members of Parliament.\n\nInvestigations into the deal unearthed glaring red flags, including the absence of a bank guarantee and premature disbursement of funds.\n\nWhile the Zimbabwe Anti-Corruption Commission (ZACC) initially opened an inquiry, the case has since gone silentfueling widespread belief that Chivayo enjoys high-level political protection.\n\nHis growing closeness to Mnangagwa is no longer subtle. He frequently appears at state functions, has posed for photos at State House, and floods social media with praise for the president, whom he hails as thefather of the nation.\n\nA vocal cheerleader ofMnangagwas#Vision2030 policywhich critics argue is more rhetorical flourish than reformChivayo has become a central figure in the theatre of Zimbabwean politics.\n\nYet despite the highly public nature of their interactions, Mnangagwa continues to deny any formal ties.\n\nThose denials, however, ring increasingly hollow in the face of images showing Chivayo riding in the presidential motorcade at one of thecountrysflagship economic events.\n\nThe optics have drawn fierce criticism from opposition parties and civil society groups, who argue thatChivayoselevation reflects how deeply corruption hasbeen entrenchedunderMnangagwasrule.\n\nChivayospresence in the motorcade is not just symbolicit shows how deeply embedded elite looting and state capture have become,said one political analyst.\n\nHe is no longer just a businessman; he is the poster child of impunity.\n\nDespite facing multiple charges over the yearsincluding money laundering and abuse of officeChivayosstar has only risen.\n\nHe flaunts his opulence across social media: luxury vehicles, designer outfits, and cash handouts, all while the average Zimbabwean endures soaring inflation, decaying public services, and mass unemployment.\n\nHis latest appearance at ZITF, surrounded by foreign dignitaries and business leaders, sends a dangerous message about the type of business climate Zimbabwe is promoting.\n\nTo many citizens, it reinforces a bleak reality: intodaysZimbabwe, loyalty to powernot competence, not ethicsis the only currency that matters.\n\nChivayosunchecked rise under Mnangagwa has become more than a scandal.\n\nIt is now a symbol of a broken systemone where corruption is not merely overlooked butrewarded,andwherepublic institutionsare routinely sacrificedat the altar of political expediency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter –Wicknell Chivayo Friday overshadowed President Mnangagwa’s two deputies, Constantino Chiwenga and Kembo Mohadi, after he dominated  Mnangagwa’s entourage and official motorcade at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/chivayo-overshadows-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Overshadows VP Chiwenga\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Chivayo Dominates Mnangagwa’s ZITF Entourage",
            "url": "https://www.zimeye.net/2025/04/25/chivayo-dominates-mnangagwas-zitf-entourage/",
            "content": "By Business ReporterConvicted fraudster and controversial businessman Wicknell Chivayo stole the spotlight on Friday as he dominated President Emmerson Mnangagwas entourage and official motorcade at the Zimbabwe International Trade Fair (ZITF) in Bulawayo.\n\nMnangagwa arrived at the 65th edition of the countrys premier trade showcase alongside Mozambican President Daniel Chapo, this years guest ofhonour.\n\nBut it wasChivayos conspicuous presenceriding in the presidential convoythatignited fresh public outrage and sharpened concerns over state capture and the growing influence of politically connected elites in Zimbabwes faltering economy.\n\nIn a moment dripping with irony, the President of Zimbabwe entered a venue meant to celebrate transparency and opportunity while flanked by Chivayo, a convicted criminal under investigation by South Africas Financial Intelligence Centre for allegedly diverting over R1 billion in public funds.\n\nFar from a mere observer, Chivayo was visually dominant in the footage,symbolisingmore than just proximity to powerhebecame the embodiment ofthe events glaring contradictions.\n\nOnce again, Chivayos nameis tiedto a string of opaque and controversial tenders: the failed Gwanda Solar Project, the Zimbabwe Electoral Commission (ZEC) ballot paper deal, and most recently, a jaw-droppingUSD $627 millionroad construction tender.\n\nHis presence alongside Mnangagwa didnt just raise eyebrowsit shattered any lingering illusions about the administrations commitment to clean governance.\n\nAlthough Mnangagwa has repeatedly denied personal business links to Chivayo, their public appearancescontinue tospeak louder than the denials.\n\nFridays ZITF showcase offered more than opticsitoffereda message.\n\nThat message, many argue, is damning: in Zimbabwe, power protects its own, even when corruption is in plain sight.\n\nAppearing with a man whose voice hasbeen heardin leaked audio tapes openly coordinating tendergrabs,at a trade fair branded as a celebration of innovative and honestbusiness, reflectsnot justpoor political judgmentit signalsdisdain for public accountability.\n\nIn a country battling broken infrastructure, a collapsing health sector, and plummeting investor confidence, Chivayos elevation in official spaces sends a chilling signal: the looting class isnot onlytolerated, itiscelebrated.\n\nChivayo, popularly known on social media as Sir Wicknell, has becomebotha symbol of political impunity and a flashpoint for public frustration.\n\nDespite lacking the technical expertise or delivery track record, he has controversially secured billion-dollar government contractsmany of which remain incomplete or have collapsed entirely.\n\nHis most infamous deal, the $173 million Gwanda Solar Project awarded in 2015 to his company Intratrek Zimbabwe, remains unfinished nearly a decade later.\n\nDespite no progress on the ground, Chivayo received substantial advance payments from the Zimbabwe Power Company (ZPC), prompting criticism from the Auditor-General and members of Parliament.\n\nInvestigations into the deal unearthed glaring red flags, including the absence of a bank guarantee and premature disbursement of funds.\n\nWhile the Zimbabwe Anti-Corruption Commission (ZACC) initially opened an inquiry, the case has since gone silentfueling widespread belief that Chivayo enjoys high-level political protection.\n\nHis growing closeness to Mnangagwa is no longer subtle. He frequently appears at state functions, has posed for photos at State House, and floods social media with praise for the president, whom he hails as the father of the nation.\n\nA vocal cheerleader of Mnangagwas #Vision2030 policywhich critics argue is more rhetorical flourish than reformChivayo has become a central figure in the theatre of Zimbabwean politics.\n\nYet despite the highly public nature of their interactions, Mnangagwa continues to deny any formal ties.\n\nThose denials, however, ring increasingly hollow in the face of images showing Chivayo riding in the presidential motorcade at one of the countrys flagship economic events.\n\nThe optics have drawn fierce criticism from opposition parties and civil society groups, who argue that Chivayos elevation reflects how deeply corruption hasbeen entrenchedunder Mnangagwas rule.\n\nChivayos presence in the motorcade is not just symbolicit shows how deeply embedded elite looting and state capture have become, said one political analyst.\n\nHe is no longer just a businessman; he is the poster child of impunity.\n\nDespite facing multiple charges over the yearsincluding money laundering and abuse of officeChivayos star has only risen.\n\nHe flaunts his opulence across social media: luxury vehicles, designer outfits, and cash handouts, all while the average Zimbabwean endures soaring inflation, decaying public services, and mass unemployment.\n\nHis latest appearance at ZITF, surrounded by foreign dignitaries and business leaders, sends a dangerous message about the type of business climate Zimbabwe is promoting.\n\nTo many citizens, it reinforces a bleak reality: in todays Zimbabwe, loyalty to powernot competence, not ethicsis the only currency that matters.\n\nChivayos unchecked rise under Mnangagwa has become more than a scandal.\n\nIt is now a symbol of a broken systemone where corruption is not merely overlooked butrewarded,andwherepublic institutionsare routinely sacrificedat the altar of political expediency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter –Convicted fraudster and controversial businessman Wicknell Chivayo stole the spotlight on Friday as he dominated President Emmerson Mnangagwa’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/chivayo-dominates-mnangagwas-zitf-entourage/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Dominates Mnangagwa’s ZITF Entourage\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Kwekwe United Seek Strategic Partnership",
            "url": "https://www.zimeye.net/2025/04/25/kwekwe-united-seek-strategic-partnership/",
            "content": "By Sports Correspondent\n\nKwekwe United, struggling in the Premier Soccer League, are eager to secure a strategic partnership to ensure their survival.\n\nTeam owner Phil Makekera expressed openness to potential partners, stating, Were willing to collaborate with anyone interested in joining us, whether through shareholding or sponsorship.\n\nMakekera highlighted the clubs diverse needs, saying, Help doesnt have to be financial; we also require essentials like fuel.\n\nWe have our team bus, but we need support to keep it running. He emphasized the clubs desire for progress, inviting anyone willing to contribute to join them.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Kwekwe United, struggling in the Premier Soccer League, are eager to secure a strategic partnership to ensure … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/kwekwe-united-seek-strategic-partnership/\">Continue reading<span class=\"screen-reader-text\"> \"Kwekwe United Seek Strategic Partnership\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Sundowns Keen To Embarrass Egyptian Giants Al Ahly",
            "url": "https://www.zimeye.net/2025/04/25/sundowns-keen-to-embarrass-egyptian-giants-al-ahly/",
            "content": "Sports Correspondent\n\nMamelodi Sundowns defender Divine Lunga has outlined his teams game plan for the high-stakes semifinal clash against Al Ahly in the CAF Champions League. The teams will lock horns on Friday night at the Cairo International Stadium, following a tense goalless draw in the first leg.\n\nLunga revealed that Sundowns are determined to secure a victory within 90 minutes and avoid the uncertainty of a penalty shootout. We know its not going to be easy, but well give it our all to win, he said. We dont want to leave our fate to penalties  its like a lottery. Well need to bring our A-game to score and win within regulation time.\n\nLunga also expressed confidence in his teams ability to handle the pressure of playing in front of a massive crowd. Big stadiums arent new to us, he said. We have players whove experienced huge crowds with their national teams, so were not intimidated. Well treat it like any other game and focus on getting the result we need.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Mamelodi Sundowns defender Divine Lunga has outlined his team’s game plan for the high-stakes semifinal clash against Al … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/sundowns-keen-to-embarrass-egyptian-giants-al-ahly/\">Continue reading<span class=\"screen-reader-text\"> \"Sundowns Keen To Embarrass Egyptian Giants Al Ahly\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Will Mnangagwa’s Anti-Corruption Commission Arrest Corruption?",
            "url": "https://www.zimeye.net/2025/04/25/will-mnangagwas-anti-corruption-commission-arrest-corruption/",
            "content": "By Tinashe Sambiri\n\nZimbabwes fight against corruption takes another step forward with the swearing-in of key commissioners.\n\nBut will the Zimbabwe Anti-Corruption Commission (ZACC) and Defence Forces Service Commission (DFSC) truly deliver?\n\nThe ZACC team, comprising Shelton Dube, Chido Madiwa, Zalerah Hazvineyi Makari, Obson Matunja, Betty Wenjere, Patrick Tendai Mukorera, Kindness Paradza, and Meme Rumbidzai Zvimba, faces skepticism.\n\nCan they tackle corruption without fear or favor? The DFSC, consisting of Charles Cleophas Murongazvombo, Mevis Gonde, Okay Mabhena, Peddie Mugoba, Patricia Sarah Bwerinofa, and Chipo Sheila Rose Mahere, also has a crucial role.\n\nPast experiences raise doubts. Will these commissions be mere window dressing or genuine guardians of good governance?\n\nCan they withstand political pressure and prioritize accountability? Only time will tell if ZACC and DFSC are more than just symbolic gestures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Zimbabwe’s fight against corruption takes another step forward with the swearing-in of key commissioners. But will the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/will-mnangagwas-anti-corruption-commission-arrest-corruption/\">Continue reading<span class=\"screen-reader-text\"> \"Will Mnangagwa’s Anti-Corruption Commission Arrest Corruption?\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "2008 Election Atrocities Mastermind Declared National Hero",
            "url": "https://www.zimeye.net/2025/04/25/2008-election-atrocities-mastermind-declared-national-hero/",
            "content": "By Political Reporter- The Zanu PF government has declared Brigadier General (Retired) Victor Rungani a national hero, sparking outrage over the states continued glorification of men with blood-soaked legacies.\n\nRungani, who led a reign of terror in Mashonaland East during the infamous 2008 presidential run-off, died Tuesday in Harare after a short illness.\n\nHis hero status was announced by State Security Minister Lovemore Matuke at the Rungani family farm in Goromonzi, where relatives and community members had gathered.\n\nRungani was not just a soldierhe was one of the late President RobertMugabesmost feared enforcers.\n\nIn 2008, after Mugabe lost the first round of the presidential election to Morgan Tsvangirai, Rungani was deployed as part of a brutal military operation designed to reverse the outcome through sheer terror.\n\nAt the time, he was Director of the Zimbabwe NationalArmysEngineering and Military Equipment Directorate. But instead of building bridges, Rungani was tasked with breaking spirits.\n\nIn Mashonaland East, he orchestrated mass beatings, abductions, and killings of MDC supporterspersonally directing torture sessions and re-education camps known aspungwes.\n\nHis actions were part of a nationwide scorched-earth campaign coordinated by the Joint Operations Command (JOC), the shadowy military cabal thathijackedZimbabweselectoral process under the guise of defending national sovereignty.\n\nState media, however, glossed over this dark historyreportingonlythat Rungani died at Mbuya Dorcas Hospital and praising his role in military engineering.\n\nNo mentionwas madeof the blood on his hands.\n\nBorn in Bikita, Masvingo province, Rungani was one of several senior commanders who turned villages into killing fields.\n\nHe operated alongside a terrifying cast of military men: Major General Engelbert Rugeje (Masvingo), Brigadier General David Sigauke (Mashonaland West), Brigadier General Douglas Nyikayaramba (Manicaland), Air Vice Marshal Abu Basutu (Matabeleland South), Air Vice Marshal Henry Muchena (Harare), Brigadier General Sibusiso Moyo (Midlands), Brigadier General Sibangumuzi Khumalo (Matabeleland North), Brigadier General Etherton Shungu (Mashonaland Central), Colonel Chris Sibanda (Bulawayo), and Air Commodore Mike Tichafa Karakadzai (Harare).\n\nTogether, backed by the Central Intelligence Organisation and more than 80,000 youth militia, they launched a nationwide campaign of violence that ultimately forced Tsvangirai to withdraw from the run-off.\n\nThis campaign was not only politicalit wasdeeply personal, systematic, and savage.\n\nIt left hundreds dead, thousands injured or raped, and entire communitiestraumatised.\n\nWhileRunganisdeath closes one chapter, it reopens anothera chapterof unanswered questions and unhealed wounds.\n\nIt reminds Zimbabweans that the men who destroyed democracy and violated the people have neverbeen broughtto justice.\n\nRunganisname, like those of his fellow commanders, may now appear in the National Heroes Acrebut in the hearts of many Zimbabweans, itis etchedin infamy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- The Zanu PF government has declared Brigadier General (Retired) Victor Rungani a national hero, sparking outrage over … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/2008-election-atrocities-mastermind-declared-national-hero/\">Continue reading<span class=\"screen-reader-text\"> \"2008 Election Atrocities Mastermind Declared National Hero\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Varakashi Defend Notorious Boys DzaMudhara Over Persecution Of Opposition Supporters",
            "url": "https://www.zimeye.net/2025/04/25/varakashi-defend-notorious-boys-dzamudhara-over-persecution-of-opposition-supporters/",
            "content": "By A Correspondent\n\nZanu PF Varakashi have vowed to defend perpetrators of acts of terror across the country.\n\nVarakashi claim the notorious group Boys DzaMudhara is patriotic and loyal to the national cause\n\nVarakashi Defend Boys DzaMudhara over persecution of opposition membersIn a statement on Friday Zanu PF Varakashi vowed to defend those accused of perpetrating acts of terrorpic.twitter.com/eOjEeW2h5G\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Varakashi have vowed to defend perpetrators of acts of terror across the country. Varakashi claim … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/varakashi-defend-notorious-boys-dzamudhara-over-persecution-of-opposition-supporters/\">Continue reading<span class=\"screen-reader-text\"> \"Varakashi Defend Notorious Boys DzaMudhara Over Persecution Of Opposition Supporters\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Mnangagwa Is Going, Geza Assures Nation",
            "url": "https://www.zimeye.net/2025/04/25/mnangagwa-is-going-geza-assures-nation/",
            "content": "By A Correspondent\n\nHARARE  War veteran Blessed Runesu Geza, known to his followers as Comrade Bombshell, has vowed that the national shutdown will continue, claiming it has already sent a powerful message to the Zimbabwean government and security forces.\n\nIn a statement released Thursday evening marking the third day of the shutdown, Geza declared the action a historic success and insisted that momentum is building toward the removal of President Emmerson Mnangagwa from power.\n\nToday is day three of our historic shutdown, which so far has been a success, Geza said.\n\nWe have demonstrated to the Mnangagwa regime that enough is enough. The message was clear and has reached home.\n\nGeza says the shutdown was necessary due to President Mnangagwas failure in governance, citing mental unfitness to lead and presiding over what he called monumental corruption that has crippled the countrys public services.\n\nMnangagwa is now mentally unfit to govern the country, Geza stated. He has destroyed the delivery of social services through rampant corruption. The entire system is broken.\n\nHe assured supporters that something is being done right now to ensure that Mnangagwa goes, suggesting that both civilians and sympathetic elements within the security forces are aligned in pushing for change. Action is being taken, he added. Things are happening as we speak.\n\nResponding to images of people moving around in city centers, Geza dismissed them as staged attempts by the state to undermine the impact of the stay-away protest. Some were bused from far and beyond to give the impression that the stay-away has failed, he said. Dont be discouragedmentally and emotionally, the nation is on shutdown.\n\nHe also accused the government of manipulating public perception. Mnangagwa sent buses to places like Muzarabani and Zvishavane to fill the towns and deceive the nation into thinking everything is normal, he claimed.\n\nGeza emphasized that the shutdown was intended to be peaceful. We never called for violence, he said. The Mnangagwas sent their people to commit acts of violence so they could blame us. We distance ourselves from those acts.\n\nHe expressed dismay at reports linking figures like former CCC MP Amos Chibaya to the shutdown planning. We never sent them to do any organizing of the shutdown. We are shocked where they are getting that.\n\nCalling for continued unity and resilience, Geza urged the public to stay the course. The Mnangagwas and their Zviganandas are going soon. Remain in shutdown mode. Emotionally, mentally, and physically, we are already there.\n\nHe ended by promising to keep Zimbabweans informed: I shall continue to speak with you. I will update you on the progress of our shutdown. Remain strong, family of Zimbabwe.\n\nThe government is yet to issue a formal response to Gezas renewed call for continued shutdown action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE — War veteran Blessed Runesu Geza, known to his followers as Comrade Bombshell, has vowed that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/mnangagwa-is-going-geza-assures-nation/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Is Going, Geza Assures Nation\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Minister Chadzamira Faces Backlash Over Trade Fair Visit",
            "url": "https://www.zimeye.net/2025/04/25/minister-chadzamira-faces-backlash-over-trade-fair-visit/",
            "content": "By A Correspondent\n\nMASVINGO  Minister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, is under fire for attending the Zimbabwe International Trade Fair (ZITF) in Bulawayo while his home province battles a worsening crisis marked by unemployment, poor infrastructure, and critical shortages in the health sector.\n\nOn Thursday morning, Chadzamira was seen touring the ZANU-PF exhibition stand at the ZITF, engaging with party departments and praising exhibitors for what he called impressive innovation. His visit was positioned as part of the governments push to promote Zimbabwes open for business agenda.\n\nHowever, his presence in Bulawayo has drawn sharp criticism from observers and local residents who say the Minister is ignoring pressing issues back home.\n\nIts a case of misplaced priorities, said a Masvingo-based civic activist who preferred to remain anonymous. We have clinics with no medication, roads that are death traps, and thousands of youths without jobs, yet our Provincial Minister finds it more important to take selfies at an exhibition stand.\n\nMany argue that while economic promotion is important, leadership should be rooted in addressing local challenges before seeking international investment.\n\nHe should fix Masvingo before promoting investment to outsiders, said a vendor in Mucheke. Who wants to invest in a province where roads are impassable and hospitals cant even treat minor injuries?\n\nChadzamira, who has remained silent on the criticism so far, lauded the ZITF as a powerful platform to showcase the countrys economic vision and achievements.\n\nBut for some Masvingo residents, that vision feels like a distant dream.\n\nWhat achievements is he talking about? asked a teacher in Zaka. The only thing thats functioning in Masvingo is political rhetoric.\n\nAs the 65th edition of the ZITF continues to attract both local and international businesses, the backlash at home highlights the growing disconnect between state officials and the day-to-day realities of ordinary Zimbabweans.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO — Minister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, is under fire for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/minister-chadzamira-faces-backlash-over-trade-fair-visit/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Chadzamira Faces Backlash Over Trade Fair Visit\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        },
        {
            "title": "Shutdown Continues, Declares Geza",
            "url": "https://www.zimeye.net/2025/04/25/shutdown-continues-declares-geza/",
            "content": "By A Correspondent\n\nHARARE  War veteran Blessed Runesu Geza, known to his followers as Comrade Bombshell, has vowed that the national shutdown will continue, claiming it has already sent a powerful message to the Zimbabwean government and security forces.\n\nIn a statement released Thursday evening marking the third day of the shutdown, Geza declared the action a historic success and insisted that momentum is building toward the removal of President Emmerson Mnangagwa from power.\n\nToday is day three of our historic shutdown, which so far has been a success, Geza said.\n\nWe have demonstrated to the Mnangagwa regime that enough is enough. The message was clear and has reached home.\n\nGeza alleges the shutdown was necessary due to President Mnangagwas failure in governance, citing mental unfitness to lead and presiding over what he called monumental corruption that has crippled the countrys public services.\n\nMnangagwa is now mentally unfit to govern the country, Geza stated. He has destroyed the delivery of social services through rampant corruption. The entire system is broken.\n\nHe assured supporters that something is being done right now to ensure that Mnangagwa goes, suggesting that both civilians and sympathetic elements within the security forces are aligned in pushing for change. Action is being taken, he added. Things are happening as we speak.\n\nResponding to images of people moving around in city centers, Geza dismissed them as staged attempts by the state to undermine the impact of the stay-away protest. Some were bused from far and beyond to give the impression that the stay-away has failed, he said. Dont be discouragedmentally and emotionally, the nation is on shutdown.\n\nHe also accused the government of manipulating public perception. Mnangagwa sent buses to places like Muzarabani and Zvishavane to fill the towns and deceive the nation into thinking everything is normal, he claimed.\n\nGeza emphasized that the shutdown was intended to be peaceful. We never called for violence, he said. The Mnangagwas sent their people to commit acts of violence so they could blame us. We distance ourselves from those acts.\n\nHe expressed dismay at reports linking figures like former CCC MP Amos Chibaya to the shutdown planning. We never sent them to do any organizing of the shutdown. We are shocked where they are getting that.\n\nCalling for continued unity and resilience, Geza urged the public to stay the course. The Mnangagwas and their Zviganandas are going soon. Remain in shutdown mode. Emotionally, mentally, and physically, we are already there.\n\nHe ended by promising to keep Zimbabweans informed: I shall continue to speak with you. I will update you on the progress of our shutdown. Remain strong, family of Zimbabwe.\n\nThe government has yet to issue a formal response to Gezas renewed call for continued shutdown action.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE — War veteran Blessed Runesu Geza, known to his followers as Comrade Bombshell, has vowed that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/25/shutdown-continues-declares-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Shutdown Continues, Declares Geza\"</span></a></p>",
            "time": "08:40",
            "date": "26 Apr 2025"
        }
    ]
}