{
    "news": [
        {
            "title": "Socialite in Court for Alleged Witchcraft",
            "url": "https://www.zimeye.net/2025/08/07/socialite-in-court-for-alleged-witchcraft/",
            "content": "Socialite in Court for Alleged Witchcraft\n\nBy A Correspondent | ZimEye | Personal stylist and social media influencer Melody Natasha Mhandu (34) appeared before a Mbare magistrate on Thursday, accused of casting a spell on her former friend, Tatenda Butau.\n\nMhandu was charged with engaging in practices associated with witchcraft under Section 98(i) of the Criminal Law (Codification and Reform) Act [Chapter 9:23]. She was released unconditionally after a brief court appearance.\n\nProsecutors allege that on August 4, at Churu Farm, Mhandu performed a ritual involving Butaus name, a red cloth, a knife, and snuff powder, which she allegedly buried under a muhacha tree with the help of a traditional healer, Christine Matashu, also known as Manjenje.\n\nThe case was reported after Mhandus former maid, Elizabeth Mhahire, claimed she had accompanied her to visit Manjenje. Mhahire told the court she later found snuff powder in Mhandus room and bathroom. When she confronted Mhandu, the two argued, and the maid quit.\n\nMhahire later informed Butau about the alleged spell. Butau, accompanied by her boyfriend and the maid, went to the site and dug up the knife and cloth before confronting Mhandu. A police report was then made.\n\nMhandu, however, denies all allegations.\n\nShe will deny having wrapped any red cloth with a dagger and snuff powder and burying it underground as alleged, or at all.\n\nShe will deny having any intention to harm or realising the real risk or possibility of harming any person as alleged, or at all. She will tell the court that she does not know any ritualist by whatever name. She never visited any, either alone or with any other person, as alleged or at all. She did not cast any spell on anyone as alleged or at all, said her lawyers.\n\nShe also dismissed the charges as a malicious fabrication of a vindictive former maid who is manipulating the current bad blood between the accused and the complainant.\n\nMhandu further argued the case is a smear campaign. She will also state that the allegations against her do not amount to any practice associated with witchcraft They are only meant as a public show for the purposes of causing embarrassment and humiliation, said her lawyers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Socialite in Court for Alleged Witchcraft By A Correspondent | ZimEye | Personal stylist and social media influencer Melody Natasha … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/socialite-in-court-for-alleged-witchcraft/\">Continue reading<span class=\"screen-reader-text\"> \"Socialite in Court for Alleged Witchcraft\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Nakamba’s Luton Town Future In Doubt As He Turns Out For U21s",
            "url": "https://www.zimeye.net/2025/08/07/nakambas-luton-town-future-in-doubt-as-he-turns-out-for-u21s/",
            "content": "BySports Correspondent \n\nLUTON  Zimbabwean international Marvelous Nakambas future at Luton Town appears increasingly uncertain after he featured for the clubs U21 side in a match against Leyton Orient on Wednesday.\n\nWith just one year remaining on his contract, Nakamba has been the subject of speculation, with reports linking him to a possible move away from the club. His appearance in the development squad  rather than the senior team  has only added fuel to the exit rumours.\n\nSources close to the club say the midfielder isno longer training with the first team, a clear indication that he may be on his way out.\n\nNakamba joined Luton Town permanently in 2023 after a successful loan spell from Aston Villa, but injuries and limited game time have hampered his impact.\n\nAs the new season approaches, it remains to be seen whether the Warriors midfielder will fight for his place at Kenilworth Road or seek a fresh start elsewhere.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent … LUTON – Zimbabwean international Marvelous Nakamba’s future at Luton Town appears increasingly uncertain after he featured … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/nakambas-luton-town-future-in-doubt-as-he-turns-out-for-u21s/\">Continue reading<span class=\"screen-reader-text\"> \"Nakamba’s Luton Town Future In Doubt As He Turns Out For U21s\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Tottenham’s Nightmare Confirmed: James Maddison’s Season in Jeopardy",
            "url": "https://www.zimeye.net/2025/08/07/tottenhams-nightmare-confirmed-james-maddisons-season-in-jeopardy/",
            "content": "Sports Correspondent\n\nTottenham Hotspurs James Maddison has been diagnosed with a ruptured anterior cruciate ligament (ACL) in his right knee, forcing him to undergo surgery and miss a significant portion of the 2025-26 season. The injury occurred during a pre-season friendly against Newcastle United in South Korea, with Maddison being stretchered off the pitch in agony.\n\nMaddisons absence is expected to last at least 6-7 months, potentially ruling him out for the majority of the upcoming season. This blow comes at a particularly unfortunate time for Spurs, as they face the new campaign without their influential midfielder. Head coach Thomas Frank described the injury as brutal and confirmed it affected the same knee Maddison injured last season.\n\nInjury Details\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Tottenham Hotspur’s James Maddison has been diagnosed with a ruptured anterior cruciate ligament (ACL) in his right knee, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/tottenhams-nightmare-confirmed-james-maddisons-season-in-jeopardy/\">Continue reading<span class=\"screen-reader-text\"> \"Tottenham’s Nightmare Confirmed: James Maddison’s Season in Jeopardy\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Effects of Ringworm in Cattle",
            "url": "https://www.zimeye.net/2025/08/07/effects-of-ringworm-in-cattle/",
            "content": "By Dr. Trywell Muzerengi\n\nRingworm in cattle  medically referred to as Dermatophytosis  is a contagious fungal skin infection caused by dermatophytes, and not actual worms, despite its misleading name.\n\nIt primarily affects young calves, especially during the cold winter months when cattle are housed in crowded, poorly ventilated environments.\n\n Causative Agent\n\nThe main culprit in cattle is the fungus Trichophyton verrucosum, which specifically targets bovines.\n\n Transmission\n\nRingworm is highly contagious and can spread through:\n\nDirect contact with infected animals\n\nContaminated objects, including brushes, halters, and fences\n\nEnvironmental spores, which can survive for months\n\nPoor barn conditions, especially overcrowding and lack of ventilation\n\n Clinical Signs\n\nFarmers should look out for:\n\nCircular, greyish-white crusty lesions\n\nPatchy hair loss (alopecia), especially on the head, ears, neck, shoulders, and back\n\nScaly or raised skin that may be mildly itchy\n\nMore severe infections in young, malnourished, or immunosuppressed cattle\n\n Zoonotic Risk\n\nRingworm can also infect humans, particularly farm workers and children, causing red, itchy, ring-shaped rashes on the skin. This highlights the importance of early detection and proper hygiene.\n\n Diagnosis\n\nThough often diagnosed based on appearance, confirmation methods include:\n\nSkin scraping and microscopy (KOH preparation to see fungal hyphae)\n\nFungal culture\n\nWoods lamp test (note: not reliable for T. verrucosum)\n\n Treatment Options\n\nWhile Dermatophytosis often self-cures, treatment is recommended to prevent spread:\n\nIdeal for mild or localized cases:\n\nLime sulfur (1:16) or Enilconazole (1:100) rinse\n\nTwice-a-week applications\n\nOther options: Miconazole, Iodine, or Chlorhexidine washes\n\nRemove crusts with a brush and discard the brush and burn the infective material, advises veterinary guidelines.\n\nFor severe or outbreak scenarios:\n\nGriseofulvin (restricted in food animals in some regions)\n\nIvermectin (some antifungal effect but not first-line)\n\nClean and disinfect barns, feeding troughs, and grooming tools\n\nUse antifungal disinfectants such as bleach (1:10 solution)  though some vets caution that bleach can be irritating and hazardous to humans\n\n Recovery & Immunity\n\nLesions can take weeks to fully heal\n\nImmunity generally develops after infection, making reinfection rare in older animals\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Ringworm in cattle — medically referred to as Dermatophytosis — is a contagious fungal skin infection … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/effects-of-ringworm-in-cattle/\">Continue reading<span class=\"screen-reader-text\"> \"Effects of Ringworm in Cattle\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Citizens Crucify MP Joanah Mamombe Over Mnangagwa Handshake…",
            "url": "https://www.zimeye.net/2025/08/07/citizens-crucify-mp-joanah-mamombe-over-mnangagwa-handshake/",
            "content": "By A Correspondent\n\nOpposition legislator Joanah Mamombe is facing fierce backlash after a photo of her shaking hands with President Emmerson Mnangagwa at a government event went viral on social media.\n\nMamombe, who represents Harare West and chairs the Parliamentary Portfolio Committee on Tourism and Hospitality, attended the official launch of Zimbabwes new Tourism Policy at State House on Monday.\n\nThe image of her greeting the President has ignited outrage among opposition supporters, who see the gesture as a betrayal of democratic principles.\n\nSome critics have gone as far as to accuse her of fraternising with the very system she was elected to challenge, with sexist insults and emotionally charged remarks dominating online discourse.\n\nHowever, others have defended Mamombe, highlighting the official capacity in which she attended the event.\n\nFormer MDC Alliance Youth Assembly leader Tererai Obey Sithole said the criticism was unjustified.\n\nThe vitriol and insults, some of which are sexist, directed towards Joanah are quite misplaced, he said. She is a Member of Parliament and Chairperson of a parliamentary committee. You dont need to like her as a person to understand this context as a basis for her presence.\n\nPolitical analyst Freddy Michael Masarirevhu also weighed in, saying the outrage lacked political understanding.\n\nThe political mindset of some Zimbabweans is astonishing, he posted on X. @JoanaMamombe chairs the Committee on Environment, Wildlife, Climate & Tourism. She has an obligation to attend events related to her committee and engage various stakeholders. The President was part of the event and so was his Minister. How does her shaking hands with the President become an issue?\n\nHe added, You wanted her to ignore the Head of State and the Minister? How will that enable her to perform her duties as the Chair of the Committee? Beyond anger and personal frustrations, politics also requires reasoning, logic and common sense.\n\nResponding to the uproar, Mamombe issued a statement on X to clarify her position.\n\nAs Chair, I led the Parliamentary Committee on Tourism & Hospitality to the launch of Zimbabwes new Tourism Policy, she said. Our role is oversight and accountability to ensure policies serve the people. We ought to interrogate, monitor and guide implementation of the policy.\n\nDespite the storm of criticism, a number of Zimbabweans continue to defend Mamombes actions, saying the reaction is more emotional than rational  and fails to appreciate the distinction between politics and parliamentary responsibility.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition legislator Joanah Mamombe is facing fierce backlash after a photo of her shaking hands with President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/citizens-crucify-mp-joanah-mamombe-over-mnangagwa-handshake/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens Crucify MP Joanah Mamombe Over Mnangagwa Handshake…\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "ECL judgement day set",
            "url": "https://www.zimeye.net/2025/08/07/ecl-judgement-day-set/",
            "content": "Judgement on whether Sixth Republican President, Edgar Lungu, should be buried in Zambia or South Africa has been scheduled for tomorrow, Friday, 8th August 2025, in the Pretoria High Court.\n\nThe ruling is set for 11:30 hours and will be delivered in open court, according to a notice issued by the Registrar, Joanna Hefner.\n\nThis development follows arguments presented on Monday, 4th August 2025, by legal representatives of the Zambian Government and the family of the late President.\n\nLawyers for the Zambian Government requested a court declaration granting authority to return President LUNGUs body to Zambia for a state-led funeral and burial at Embassy Park in Lusaka.\n\nPlans for President Lungus burial, originally scheduled for June, were put on hold following a mutual agreement by both parties, pending the courts final ruling.\n\nIn its submissions, the government argued that although President Lungu lost his retirement benefits after re-entering active politics, this disqualification ceased upon his death, making him once again eligible for state honours, including a state funeral.\n\nOn 24th June 2025, Attorney General Mulilo Kabesha filed an urgent application on public interest grounds, seeking to halt the private burial arrangements by the Lungu family in South Africa, pending the outcome of a full hearing held on 4th August.\n\nMr. Kabesha  based the application on Article 177 (5)(c) of the Zambian Constitution, which authorises the Attorney General to intervene in matters of national interest.\n\nHe argued that former Heads of State must be laid to rest in Zambia with full military honours, as was the case with Founding President, Kenneth Kaunda.\n\nRespondents in the case include former First Lady, Esther Lungu and the late Presidents children, Berthar Tasila Chitepo abd Daliso Lungu.\n\nAlso cited are family lawyer and spokesperson, Makebi Zulu , along with the funeral services provider, Two Mountains.\n\nPresident Edgar Lungu passed away on 5th June 2025 in South Africa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Judgement on whether Sixth Republican President, Edgar Lungu, should be buried in Zambia or South Africa has been scheduled for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/ecl-judgement-day-set/\">Continue reading<span class=\"screen-reader-text\"> \"ECL judgement day set\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Minister Chadzamira’s Sermon In Church Garment Sparks Mockery Online",
            "url": "https://www.zimeye.net/2025/08/07/minister-chadzamiras-sermon-in-church-garment-sparks-mockery-online/",
            "content": "By A Correspondent\n\nMASVINGO  Minister of State for Provincial Affairs and Devolution, Ezra Chadzamira, has become the subject of widespread online mockery after delivering a sermon while dressed in full apostolic church regalia during a visit to Johane the 5th of Africa International Church.\n\nImages and videos of the ZANU PF official donning a blue garment typically worn by African Indigenous Church leaders  and addressing congregants as if on a political crusade  quickly circulated across social media platforms, sparking a flood of satire, memes, and criticism.\n\nChadzamira used the opportunity to praise the ruling partys relationship with apostolic churches and reinforce ZANU PFs supposed commitment to development and unity.\n\nWe want to work together with the church in promoting development. In agriculture, health, and unity, the church is helping us, said Chadzamira. ZANU PF recognises the important role of African Indigenous Churches in transforming communities.\n\nBut it wasnt his words that got people talking  it was the outfit.\n\nIs he a minister or a madzibaba now? one user commented on X (formerly Twitter). Another wrote: Next thing well see cabinet reshuffles in white robes.\n\nCritics accused the minister of blurring the line between church and state, turning sacred gatherings into campaign platforms.\n\nThis is not unity, its desperation. Dressing like a prophet wont cleanse the economy, said one Facebook user.\n\nAdding to the political flavour of the event, Archbishop Dr. Andby Makururu, founder of the Johane the 5th of Africa International Church, also showered praise on the Second Republic, crediting President Emmerson Mnangagwas government for creating a conducive environment for apostolic sects to grow.\n\nWe are grateful to the Second Republic for empowering freedom of religion. Our church and many others have been able to expand because of that support, Makururu said.\n\nHe urged his followers to work hand-in-hand with the government: As a church, we must work together with the President Mnangagwa-led Government to achieve economic and social development.\n\nHowever, the ministers theatrics did little to win over the online public, who questioned whether this was genuine outreach or political gimmickry ahead of 2028 elections.\n\nPolitics in a prophets gown wont change the price of mealie-meal, another user quipped.\n\nWhile Chadzamira may have aimed to bridge politics and religion, it appears his choice of wardrobe stole the show  and not in the way he intended.\n\nMinister of State for Provincial Affairs in Masvingo Province Cde Ezra Chadzamira has remarked that ZANU PF is committed to working with Indigenous African  Churches to improve the lives of communities and foster unity.Additionally the Founder of Johane the 5th of Africapic.twitter.com/g0rwHRKTy3\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO – Minister of State for Provincial Affairs and Devolution, Ezra Chadzamira, has become the subject of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/minister-chadzamiras-sermon-in-church-garment-sparks-mockery-online/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Chadzamira’s Sermon In Church Garment Sparks Mockery Online\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Minister Mavetera Launches Digital Spying Programme With Russia’s Help",
            "url": "https://www.zimeye.net/2025/08/07/minister-mavetera-launches-digital-spying-programme-with-russias-help/",
            "content": "By A Correspondent\n\nHARARE  The Zimbabwean government has come under fire after launching a controversial cybersecurity programme that critics say is designed to spy on citizens, suppress dissent, and militarise the internet  with heavy involvement from Russian entities.\n\nThe programme, officially known as the National Cybersecurity Training Programme, was unveiled in Harare by ICT Minister Tatenda Mavetera, who claimed it would train over 10,000 youths in areas such as ethical hacking, cyberattack simulations, and digital monitoring.\n\nBut while authorities say the initiative is aimed at bolstering Zimbabwes digital infrastructure, rights groups, opposition figures, and tech experts see a more sinister motive  the creation of a state-sponsored cyber surveillance force.\n\nWe are happy to say we have come up with a cybersecurity strategy that outlines how we will deploy cybersecurity across the country, said Minister Mavetera at the launch. This is underpinned by infrastructure, digital skills, and ensuring safety in cyberspace and data protection.\n\nHowever, the programmes details  including the establishment of a national cybersecurity monitoring centre  have sparked alarm, particularly given the governments increasingly hostile stance towards online criticism and independent digital platforms.\n\nThis isnt about security. Its about surveillance, said a Harare-based digital rights advocate. Theyre training young people to become cyber spooks  to monitor what we say, what we post, and how we communicate.\n\nAdding to the alarm is the governments partnership with Russian cybersecurity firms, including CYBERUS, KOMIB, and InnoStage  all of which have ties to the Kremlins broader strategy of exporting cyber control tools to allied regimes.\n\nMavetera openly praised the 2023 Bilateral Cybersecurity Agreement signed between Zimbabwe and Russia, saying:\n\nThis partnership proposes three key domains: building national cyber security capacity; establishing a cyber-resilience verification framework; and creating a national cyber security monitoring centre.\n\nAnalysts say the partnership effectively gives Russia a foothold in Zimbabwes digital ecosystem, raising serious concerns over data privacy, sovereignty, and the militarisation of cyberspace.\n\nThis is a dangerous entanglement, said one analyst. Russia is known for its authoritarian use of cyber tools. Now Zimbabwe is importing that model.\n\nRussian officials present at the launch, including Sergey Kuzin from the Russian Embassy and Dmitry Grigoriev from KOMIB, framed the project as a way to foster global cooperation. But their comments only deepened suspicions.\n\nNo nation is immune to cyber intruders, Grigoriev said. We must invest in education, performance and innovative technologies to combat cybercrime effectively.\n\nYet critics argue the real threat isnt hackers  its a regime obsessed with control.\n\nThis is digital repression wearing a graduation cap, said opposition MP Tapiwa Nyambirai. Theyre calling it education, but its indoctrination.\n\nWhile the programme promises scholarships and job placements for top-performing recruits, civil society groups say its a smokescreen  an attempt to sanitise what is essentially a government-run programme to spy on its own people.\n\nThey want to turn tech-savvy youth into cyber vigilantes for the regime, one university student told reporters. Its not empowerment  its entrapment.\n\nThe involvement of Russian-linked organisations in managing the learning platform and selecting trainees has also triggered concern over foreign influence in domestic surveillance.\n\nThe internet was one of the last free spaces in Zimbabwe, said a digital journalist. Now its being brought under state control  with help from Moscow.\n\nAs the Mnangagwa administration faces growing criticism over shrinking civic space, this latest move suggests a new front has opened  one that may not be fought in the streets, but in chat groups, inboxes, and browsers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – The Zimbabwean government has come under fire after launching a controversial cybersecurity programme that critics … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/minister-mavetera-launches-digital-spying-programme-with-russias-help/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Mavetera Launches Digital Spying Programme With Russia’s Help\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Watch: Chadzamira Defends Invasion Of Church Gathering",
            "url": "https://www.zimeye.net/2025/08/07/watch-chadzamira-defends-invasion-of-church-gathering/",
            "content": "By A Correspondent\n\nMinister of State for Provincial Affairs and Devolution in Masvingo, Ezra Chadzamira, has defended his appearance at a recent church gathering in the ancient city, saying ZANU PF is committed to working closely with Indigenous African Churches to promote development and unity.\n\nChadzamira was speaking during a visit to the Johane the 5th of Africa International Church, led by Archbishop Dr. Andby Makururu.\n\nThe event, which some critics labeled as political intrusion into religious space, was met with mixed reactions online.\n\nHowever, the Minister maintained that the ruling party and apostolic churches share a common vision for national development.\n\nWe want to work together with the church in promoting development. In agriculture, health, and unity, the church is helping us, Chadzamira said.\n\nZANU PF recognises the important role of African Indigenous Churches in transforming communities.\n\nHe also emphasized that the government under President Emmerson Mnangagwa is creating space for freedom of worship and engagement between the state and religious institutions.\n\nBacking the ministers remarks, Archbishop Dr. Makururu praised the Second Republic for fostering religious freedom, saying the environment has allowed apostolic sects to grow and thrive.\n\nWe are grateful to the Second Republic for empowering freedom of religion. Our church and many others have been able to expand because of that support, said Archbishop Makururu.\n\nHe also encouraged his congregants to cooperate with the governments efforts to build the nation, urging them to remain peaceful and development-focused.\n\nAs a church, we must work together with the President Mnangagwa-led Government to achieve economic and social development, he said.\n\nThe event comes amid increasing efforts by political leaders to court support from religious communities ahead of future elections.While critics have raised concerns about politicisation of churches, leaders like Chadzamira argue that collaboration with churches is vital for grassroots transformation.\n\nMinister of State for Provincial Affairs in Masvingo Province Cde Ezra Chadzamira has remarked that ZANU PF is committed to working with Indigenous African  Churches to improve the lives of communities and foster unity.Additionally the Founder of Johane the 5th of Africapic.twitter.com/g0rwHRKTy3\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Minister of State for Provincial Affairs and Devolution in Masvingo, Ezra Chadzamira, has defended his appearance at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/watch-chadzamira-defends-invasion-of-church-gathering/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Chadzamira Defends Invasion Of Church Gathering\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        },
        {
            "title": "Witchcraft Accused Natalie Mhandu Released Unconditionally",
            "url": "https://www.zimeye.net/2025/08/07/witchcraft-accused-natalie-mhandu-released-unconditionally/",
            "content": "By A Correspondent| Socialite and video vixen Natalie Mhandu, popularly known as Enchantress or Madame Stylist, was released unconditionally by the Mbare Magistrates Court on Wednesday after facing charges of engaging in practices commonly associated with witchcraft.\n\nMhandu had been accused under Section 98 of the Criminal Law (Codification and Reform) Act following a complaint lodged by two former friends, who alleged she had used rituals to bewitch them after a fallout over a romantic relationship. The matter sparked widespread public interest due to the unusual nature of the allegations and Mhandus celebrity status.\n\nDespite her release, the scandal has cast a long shadow over Mhandus carefully curated public image, with critics accusing her of using her influence to evade accountability.\n\nThe case began after Mhandus dismissed domestic worker allegedly tipped off the complainants, claiming that the socialite had travelled to Mozambique to consult a sangoma in a bid to fix them. Acting on the tip, the complainants reportedly visited Pension Farm in Glen View, where they claimed to have unearthed a red cloth and a knife bearing their namesitems they alleged were part of the ritual.\n\nThough no physical evidence linking Mhandu directly to the items was presented in court, the allegations sparked a media frenzy. A leaked audio recordingbelieved to be a conversation between Mhandu and one of the complainantscirculated online, in which the voice alleged to be Mhandus denied any wrongdoing and accused the ex-maid of manufacturing the story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Socialite and video vixen Natalie Mhandu, popularly known as Enchantress or Madame Stylist, was released unconditionally by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/07/witchcraft-accused-natalie-mhandu-released-unconditionally/\">Continue reading<span class=\"screen-reader-text\"> \"Witchcraft Accused Natalie Mhandu Released Unconditionally\"</span></a></p>",
            "time": "09:41",
            "date": "08 Aug 2025"
        }
    ]
}