{
    "news": [
        {
            "title": "Ngoni Mukulula Final Send-off…",
            "url": "https://www.zimeye.net/2025/01/11/ngoni-mukulula-final-send-off/",
            "content": "Sports Correspondent\n\nThe Zimbabwean basketball community came together to pay their last respects to the late Ngoni Mukukula, a renowned basketball legend, at Glen Forest Memorial Park in Harare on Thursday. Despite the heavy rains, a multitude of mourners, including government officials, sports administrators, and professionals, gathered to honor Mukukulas contributions to the development of basketball in Zimbabwe.\n\nDeputy Minister of Sport, Recreation, Arts & Culture, Honourable Emily Jesaya, challenged the basketball community to emulate Mukukulas dedication and passion for the sport. Look at the people who are in this church, all respected people they all decided to be here to honour someone who worked hard to take basketball to the masses, Jesaya said.\n\nMark Crandal, Founder of Hoops 4 Hope, who worked closely with Mukukula, flew from New York to pay his respects. You are mourning, and I can tell you that you are not alone the whole of Africa and the world over are mourning the loss of Ngoni, Crandal said, highlighting Mukukulas impact on the sport globally. He changed the face of basketball in Zimbabwe, Crandal added, recalling Mukukulas tireless efforts to provide access to basketball for all kids and ensure they had the necessary equipment .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwean basketball community came together to pay their last respects to the late Ngoni Mukukula, a renowned … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/ngoni-mukulula-final-send-off/\">Continue reading<span class=\"screen-reader-text\"> \"Ngoni Mukulula Final Send-off…\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "Zimbabwe Bids Farewell To Basketball Legend",
            "url": "https://www.zimeye.net/2025/01/11/zimbabwe-bids-farewell-to-basketball-legend/",
            "content": "By A Correspondent\n\nThe Zimbabwean basketball community came together to pay their last respects to the late Ngoni Mukukula, a renowned basketball legend, at Glen Forest Memorial Park in Harare on Thursday.\n\nDespite the heavy rains, a multitude of mourners, including government officials, sports administrators, and professionals, gathered to honor Mukukulas contributions to the development of basketball in Zimbabwe.\n\nDeputy Minister of Sport, Recreation, Arts & Culture, Honourable Emily Jesaya, challenged the basketball community to emulate Mukukulas dedication and passion for the sport. Look at the people who are in this church, all respected people they all decided to be here to honour someone who worked hard to take basketball to the masses, Jesaya said.\n\nMark Crandal, Founder of Hoops 4 Hope, who worked closely with Mukukula, flew from New York to pay his respects. You are mourning, and I can tell you that you are not alone the whole of Africa and the world over are mourning the loss of Ngoni, Crandal said, highlighting Mukukulas impact on the sport globally.\n\nHe changed the face of basketball in Zimbabwe, Crandal added, recalling Mukukulas tireless efforts to provide access to basketball for all kids and ensure they had the necessary equipment .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwean basketball community came together to pay their last respects to the late Ngoni Mukukula, a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/zimbabwe-bids-farewell-to-basketball-legend/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Bids Farewell To Basketball Legend\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "Nick Mangwana Puts On Military Attire | Is He a Threatening VP Chiwenga?",
            "url": "https://www.zimeye.net/2025/01/11/nick-mangwana-puts-on-military-attire-is-he-a-threatening-vp-chiwenga/",
            "content": "By Dorrothy Moyo |Zimbabwe government spokesperson Nick Mangwana has announced that he is taking a break, but his choice of attire in the announcement has sparked significant speculation. The government official was photographed wearing a traditional military-style outfit reminiscent of the attire worn by Zimbabwean guerrilla fighters during the Rhodesian Bush War and the farm invasions of the 2000s.\n\nThe announcement comes amid swirling rumors of internal strife within ZANU-PF, the ruling party.\n\nReports of growing tensions between factions loyal to President Emmerson Mnangagwa and those supporting his deputy, Vice President Constantino Chiwenga, have dominated political discourse in recent weeks.\n\nSymbolism in Mangwanas Attire\n\nMangwanas outfitcommonly associated with Zimbabwes liberation struggleraises questions about its timing and intent. The visual parallels to military traditions may carry subtle undertones in a political climate marked by speculation of power struggles within the ZANU-PF hierarchy.\n\nObservers have pointed out the significance of Mangwana donning this attire during a period where political alliances within the party are reportedly being tested. Historically, military symbolism has played a central role in Zimbabwes political narrative, with clothing serving as a silent yet powerful message.\n\nHeightened Tensions: A Veiled Threat Against VP Chiwenga?\n\nThe political landscape is further complicated by recent remarks made by a ZANU-PF provincial chairperson who issued a bold statement targeting Vice President Constantino Chiwenga. The official declared that Chiwenga must drink crocodile milk before he dreams of taking over poweran apparent reference to Mnangagwas nickname, The Crocodile, and his perceived grip on authority.\n\nThis statement, combined with Mangwanas symbolic military attire, is being interpreted by political analysts as a possible warning to Chiwenga and his faction. The use of crocodile symbolism in Zimbabwean politics often reflects loyalty to Mnangagwa and serves as a metaphorical message to rivals attempting to challenge his position.\n\nAnalyst Richard Mahuni remarked:\n\nThis could be the clearest sign yet that Mnangagwas allies are drawing battle lines and sending a strong warning to Chiwenga. The crocodile imagery is not accidentalit is a reminder of who holds the ultimate power within ZANU-PF.\n\nMilitary Influence in Politics\n\nMangwanas announcement coincides with the reintroduction of the controversial National Youth Service program, commonly referred to as the Green Bombers. Images of uniformed youths undergoing training have resurfaced, evoking memories of the programs politicized history. The program has been criticized for its association with violence and intimidation tactics during elections.\n\nThe resurfacing of military-related imagerywhether in the form of Mangwanas attire, the Green Bombers, or veiled threats to Chiwengapaints a picture of a ruling party invoking its liberation war legacy as both a rallying point and a warning to dissenters.\n\nFactional Battle Lines\n\nSpeculation about Mnangagwa and Chiwengas relationship has intensified since their alliance during the 2017 coup that ousted Robert Mugabe. While Mnangagwa took the presidency, Chiwenga has been rumored to harbor ambitions for the top job. Recent events suggest a growing rift, with Chiwengas faction reportedly seeking to assert its influence ahead of the 2028 elections.\n\nThe symbolic messages conveyed by Mangwanas attire and the crocodile milk remark indicate a deepening of factional politics. Mangwanas announcement could be interpreted as aligning with Mnangagwas camp, sending a message of unity among his allies while signaling potential consequences for challengers.\n\nWhat Lies Beneath the Surface?\n\nThe interplay of military symbolism and political rhetoric within ZANU-PF suggests a calculated effort to consolidate power amid internal divisions. Whether these gestures are mere political theater or a prelude to a broader confrontation within the party remains to be seen.\n\nNick Mangwanas decision to pair his leave announcement with military-inspired attire, alongside veiled threats targeting Vice President Chiwenga, has amplified speculation about ZANU-PFs internal dynamics. As tensions between Mnangagwa and Chiwenga factions rise, these symbolic acts could reflect a power struggle that is quietly brewing but may soon erupt onto the national stage. Observers will be closely monitoring these developments as Zimbabwes political landscape continues to evolve.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Zimbabwe government spokesperson Nick Mangwana has announced that he is taking a break, but his choice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/nick-mangwana-puts-on-military-attire-is-he-a-threatening-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Nick Mangwana Puts On Military Attire | Is He a Threatening VP Chiwenga?\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "A Level Results Out…",
            "url": "https://www.zimeye.net/2025/01/11/a-level-results-out-4/",
            "content": "By A Correspondent\n\nThe Zimbabwe School Examinations Council (Zimsec) has officially released the 2024 November Advanced Level results. According to Zimsec board chairperson Professor Paul Mapfumo, the results are now accessible online through the Zimsec portal, which can be accessed via the Zimsec website \n\nTo access their results, candidates will need to provide their centre number, candidate number, session, level, and year of examination. They will also be required to create login credentials, including a username, password, and security phrase .\n\nThe online portal will be open for five days, after which heads of examination centres can collect hard copies of the results from Zimsecs regional offices starting Monday, January 13, 2025. Candidates facing difficulties can contact Zimsecs helpline for assistance .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe School Examinations Council (Zimsec) has officially released the 2024 November Advanced Level results. According to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/a-level-results-out-4/\">Continue reading<span class=\"screen-reader-text\"> \"A Level Results Out…\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "Tshabangu Defies Suspension",
            "url": "https://www.zimeye.net/2025/01/11/tshabangu-defies-suspension/",
            "content": "By A Correspondent\n\nSengezo Tshabangu, the interim secretary-general of the Citizens Coalition for Change (CCC), has defiantly rejected his suspension by Acting party President Welshman Ncube. Tshabangus suspension was announced shortly after a High Court ruling barred him from making changes to the partys parliamentary leadership .\n\nTshabangus legal representative, Nqobani Sithole, claimed in an interview with CITE News, they had received no formal communication about the suspension.\n\nSithole argued that Ncube lacks the authority to make leadership decisions, stating, What I know is there is a legal opinion that we communicated with the party to the extent that there is no president in the meantime because Prof Ncubes term of office expired.\n\nSithole emphasized that Ncube is merely an ordinary party member, saying, Welshman was also included when we communicated. He is not the acting president but masquerading as one.\n\nSithole added that Tshabangu remains the secretary-general of the party and leader of the opposition in Parliament.\n\nSithole pointed out that Ncubes term as party president expired, and his attempt to suspend Tshabangu is invalid.\n\nSithole stated, The rotation never happened, and the five years for holding the partys congress have expired, and surely he cannot all by himself purport to continue in contravention of their own constitution.\n\nTshabangus team plans to appeal the High Court ruling at the Supreme Court. Sithole confirmed, We have been instructed to appeal the High Court ruling.\n\nThere are certain internal issues being attended to, and soon after that, we will be given the green light to proceed with our client.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Sengezo Tshabangu, the interim secretary-general of the Citizens Coalition for Change (CCC), has defiantly rejected his suspension … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/tshabangu-defies-suspension/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Defies Suspension\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "Ngezi Platinum Stars Bid Farewell to Gareth Madhake",
            "url": "https://www.zimeye.net/2025/01/11/ngezi-platinum-stars-bid-farewell-to-gareth-madhake/",
            "content": "Sports Correspondent\n\nNgezi Platinum Stars have announced the departure of Gareth Madhake ahead of the 2025 Castle Lager Premier Soccer League season. The club confirmed Madhakes exit on X, expressing their gratitude for his contributions.\n\nMadamburo confirms the departure of Gareth Madhake ahead of the 2025 Castle Lager Premier Soccer League season, the post read. We extend a heartfelt thank you to Madhake for all his contributions and unforgettable moments weve shared. Wishing you all the best for the future, lad.\n\nMadhakes departure follows the recent exit of Tinotenda Meke, who joined Simba Bhora after spending one season at Ngezi Platinum. As the 2025 season approaches, Ngezi Platinum Stars continues to undergo changes in their squad.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Ngezi Platinum Stars have announced the departure of Gareth Madhake ahead of the 2025 Castle Lager Premier Soccer … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/ngezi-platinum-stars-bid-farewell-to-gareth-madhake/\">Continue reading<span class=\"screen-reader-text\"> \"Ngezi Platinum Stars Bid Farewell to Gareth Madhake\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "Seasonal Spike in Human Metapneumovirus Cases Reported in China",
            "url": "https://www.zimeye.net/2025/01/11/seasonal-spike-in-human-metapneumovirus-cases-reported-in-china/",
            "content": "By A Correspondent\n\nChinese authorities have confirmed a surge in cases of Human Metapneumovirus (HMPV), particularly among children. This increase is attributed to a seasonal spike, with the virus being most active during this time of year.\n\nWhile the rise in cases may be alarming, authorities and public health experts have reassured the public that HMPV is not similar to COVID-19. In fact, HMPV has been present for decades and was first identified in the Netherlands in 2001, according to the World Health Organization (WHO) .\n\nHMPV typically causes mild upper respiratory tract infections, characterized by symptoms such as coughing, fever, and nasal congestion. For most people, the virus is practically indistinguishable from the flu. However, in very young children and individuals with weakened immune systems, HMPV can lead to more severe illness.\n\nThe virus spreads through airborne transmission, direct contact with infected individuals, or by touching contaminated surfaces. As with any respiratory virus, taking precautions such as frequent handwashing, avoiding close contact with those who are sick, and maintaining good hygiene practices can help reduce the risk of transmission .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Chinese authorities have confirmed a surge in cases of Human Metapneumovirus (HMPV), particularly among children. This increase … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/seasonal-spike-in-human-metapneumovirus-cases-reported-in-china/\">Continue reading<span class=\"screen-reader-text\"> \"Seasonal Spike in Human Metapneumovirus Cases Reported in China\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "Landmine Tragedy: 3 Killed, 3 Injured in Binga Vehicle Blast",
            "url": "https://www.zimeye.net/2025/01/11/landmine-tragedy-3-killed-3-injured-in-binga-vehicle-blast/",
            "content": "By A Correspondent\n\nA devastating incident occurred on Wednesday evening in the Sebungwe area along the Zambezi River, resulting in the loss of three lives and injuring three others. A vehicle belonging to the Binga Rural District Council struck a landmine around 5 pm, causing the tragic accident.\n\nThe incident has sent shockwaves through the community, highlighting the ongoing risks posed by landmines in the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating incident occurred on Wednesday evening in the Sebungwe area along the Zambezi River, resulting in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/11/landmine-tragedy-3-killed-3-injured-in-binga-vehicle-blast/\">Continue reading<span class=\"screen-reader-text\"> \"Landmine Tragedy: 3 Killed, 3 Injured in Binga Vehicle Blast\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "JUST IN: Zimsec A Level Results Out",
            "url": "https://www.zimeye.net/2025/01/10/just-in-zimsec-a-level-results-out-2/",
            "content": "The 2024 Zimbabwe School Examinations Council (ZIMSEC) Advanced Level results are out.\n\nThe results were announced at a news conference addressed by ZIMSEC Chairperson, Professor Paul Mapfumo in Harare this Friday.\n\nThe results reflect that 94 percent of students who wrote a minimum of two subjects passed the examinations..\n\nThe total number of candidates who sat for the November 2024 examinations was 33585 compared to 34427 in 2023. This translates to a decrease of 852 candidature yielding a percentage decrease of 2.47%. For those who wrote two or more subjects, 31 443 obtained Grade E or better. This translates to a 94.58% pass rate. The total number of school candidates who set for November 2024 was 29,041 while in 2023 the number was 29,910.\n\n28,900 candidates wrote two or more subjects in November 2024. Of these, 27,509 obtained grade E or better in two or more subjects, achieving a percentage of 95.18%. The total number of private candidates who sat for the November 2024 examinations was 4544 while in 2023 the number was 4527, Professor Mapfumo said.\n\nFemale candidates outperformed their male counterparts.\n\nThe total number of female candidates who sat for the November 2025 Advanced Level examinations was 17306 as compared to 15504 who sat in November 2023. Of these, 16457 passed two or more subjects yielding a pass rate of 95.94%. The total number of male candidates who sat for two or more subjects was 16092, of which 14987 passed two or more subjects, translating to a percentage pass rate of 92.32. Female candidates did better than males by 2.81 percent, noted Professor Mapfumo.\n\nThe results will be accessible to all candidates online through the ZIMSEC portal accessed through ZIMSEC website.\n\n-ZBC News\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The 2024 Zimbabwe School Examinations Council (ZIMSEC) Advanced Level results are out. The results were announced at a news conference … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/just-in-zimsec-a-level-results-out-2/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Zimsec A Level Results Out\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        },
        {
            "title": "“A” Level Results Out",
            "url": "https://www.zimeye.net/2025/01/10/a-level-results-out-5/",
            "content": "By Munacho Gwamanda-TheZimbabweSchool Examinations Council (ZIMSEC) has announced the release of the 2024 November Advanced Level examination results.\n\nSpeaking ata press briefing in Harare, ZIMSEC board chairperson Professor Paul Mapfumo revealed that the results would be available online through the ZIMSEC portal starting today, January 10, 2025, at 4 PM.\n\nThe portal will remain open for five days.\n\nProfessor Mapfumo said:\n\n*The Zimbabwe School Examinations Council board and management would like to advise the nation of the release of the 2024 November Advanced Level examination results.\n\nWith effect from today, January 10, 2025, at 4 PM, Advanced Level examinationcandidatesresults will be accessible online through the ZIMSEC portal, which canbe accessedvia our website:www.zimsec.co.zw.\n\nPlease note that the portal will be open for five days only. Heads of examination centres can collect the results for their respective schools or centres from our regional offices starting Monday, January 13, 2025.*\n\nThe overall pass rate for 2024 stands at 94.58%, maintaining the same level as 2023.\n\nProfessor Mapfumo provided further details:\n\n*Atotal of 33,585 candidates sat for the November 2024 examinations, compared to 34,437 in 2023, reflecting a decrease of 852 candidates, or 2.47%.\n\nOf those who sat for two or more subjects in 2024, 31,443 candidates obtained a Grade E or better, achieving a pass rate of 94.58%.Thisis nearly identical to the 2023 pass rate of 94.60%,when 32,221 candidates out of 34,060 achievedGradeE or better in two or more subjects.*\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-The Zimbabwe School Examinations Council (ZIMSEC) has announced the release of the 2024 November Advanced Level examination results. Speaking at a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/a-level-results-out-5/\">Continue reading<span class=\"screen-reader-text\"> \"“A” Level Results Out\"</span></a></p>",
            "time": "20:37",
            "date": "11 Jan 2025"
        }
    ]
}