{
    "news": [
        {
            "title": "Zanu PF Heavyweights Jostle For Gutu East Parliamentary Seat",
            "url": "https://www.zimeye.net/2025/04/16/zanu-pf-heavyweights-jostle-for-gutu-east-parliamentary-seat/",
            "content": "The ruling ZANU PF party has launched primary elections to select candidates for both parliamentary and local council positions in Gutu East constituency.\n\nSix contenders  Zvarevashe Masvingise, Christopher Mashuro, Maone Vheremu, Norbert Chikumbo, Nicolas Chiname, and Phinias Chagonda  are vying for the partys ticket to represent Gutu East in Parliament.\n\nIn Ward 10, three candidates are also contesting the council seat.\n\nThe primary elections were triggered by the recent expulsion of former Gutu East MP Benjamin Ganyiwa and former Ward 10 Councillor Jainos Mudonhi. A senior party official confirmed the development, stating:The Politburo took a firm stance on disciplinary matters. Ganyiwa and Mudonhi were expelled for gross misconduct that was deemed inconsistent with party values.\n\nVoting took place across 26 district centres, where party supporters came out in significant numbers.The turnout has been impressive. People are enthusiastic to choose candidates who will carry forward the partys vision in the upcoming by-elections,said a ZANU PF provincial coordinator who requested anonymity.\n\nThe winners of the primaries will stand as ZANU PFs official candidates in the forthcoming by-elections.Only those who emerge victorious from this process will have the mandate to contest under the party banner,the source added.\n\nBy-elections are expected to be held later this year, though the official date is yet to be announced.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The ruling ZANU PF party has launched primary elections to select candidates for both parliamentary and local council positions in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/16/zanu-pf-heavyweights-jostle-for-gutu-east-parliamentary-seat/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Heavyweights Jostle For Gutu East Parliamentary Seat\"</span></a></p>",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "Two Accidents One After the Other Same Pothole Same Bus",
            "url": "https://www.zimeye.net/2025/04/16/two-accidents-one-after-the-other-same-pothole-same-bus/",
            "content": "Two accidents one after the other same pothole same buspic.twitter.com/zThC2W4NZa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "National Vendors Union Blasts Government Silence, Demands End to “Economic Cruelty”",
            "url": "https://www.zimeye.net/2025/04/16/national-vendors-union-blasts-government-silence-demands-end-to-economic-cruelty/",
            "content": "Harare  April 16, 2025\n\nIn a fiery and emotional address today, the National Vendors Union of Zimbabwe (NAVUZ) publicly condemned the Ministry of Finance and Economic Development for what it called three weeks of deafening silence following an urgent appeal submitted last month.\n\nSpeaking in central Harare, NAVUZ Chairperson Sten Zvorwadza accused the government of abandoning the countrys informal sector, which he said represents over six million Zimbabweans trapped between two sharp and deadly horns  the 2% Intermediated Money Transfer Tax (IMTT) and rampant police corruption.\n\nThis is not just a crisis of policy, Zvorwadza declared. It is a crisis of conscience.\n\nNAVUZ said its March 10 letter to Finance Minister Professor Mthuli Ncube was a plea for urgent economic relief on behalf of the countrys street vendors, cross-border traders, and micro-entrepreneurs  those Zvorwadza described as the backbone of Zimbabwes real economy. The letter, NAVUZ said, has gone unanswered.\n\nIn a rare and sharply worded rebuke of state policy, the union painted a grim picture of life for informal traders who are simultaneously taxed by the government and extorted by what it described as rogue elements in the Zimbabwe Republic Police (ZRP) and municipal authorities.\n\nBy day, the government bleeds every transaction with the 2% tax, Zvorwadza said. By night, vendors are harassed, threatened, and robbed by those meant to protect them.\n\nThe IMTT  a digital transaction tax introduced in 2018  has long been controversial. But NAVUZ is now calling for its complete removal from all informal sector transactions, arguing that it punishes survival and drives people back to the informal cash economy.\n\nThis tax does not build Zimbabwe  it shrinks it, Zvorwadza said. It locks people in poverty. It is economic violence.\n\nNAVUZ also called for a formal meeting with the Ministry of Finance and a full public inquiry into police abuse and corruption targeting vendors  citing repeated instances of harassment, forced bribes, and illegal confiscation of goods.\n\nThe union warned that the governments failure to respond to informal sector concerns is not only unsustainable, but dangerous.\n\nIf the government does not hear us in Parliament or the corridors of power, Zvorwadza said, it will hear us in the streets, in the markets, and in the hearts of citizens who know this injustice must end.\n\nNAVUZs public demands include:\n\nThe statement closes with a stern warning to the government: If you continue to tax the poor and protect corruption, you are no longer governing  you are exploiting.\n\nGovernment officials have yet to respond to todays address.\n\nThis is a developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – April 16, 2025 In a fiery and emotional address today, the National Vendors Union of Zimbabwe (NAVUZ) publicly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/16/national-vendors-union-blasts-government-silence-demands-end-to-economic-cruelty/\">Continue reading<span class=\"screen-reader-text\"> \"National Vendors Union Blasts Government Silence, Demands End to “Economic Cruelty”\"</span></a></p>",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "Macheso Donates USD500 To Pinjisi Funeral",
            "url": "https://www.zimeye.net/2025/04/16/macheso-donates-usd500-to-pinjisi-funeral/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "Prophet Ian Ndlovu Accepts Wicknell Chivayo’s Dirty Money, Flashy Vehicle",
            "url": "https://www.zimeye.net/2025/04/16/prophet-ian-ndlovu-accepts-wicknell-chivayos-dirty-money-flashy-vehicle/",
            "content": "BREAKING NEWS\n\nBy A Correspondent | ZimEye |  BULAWAYO, Zimbabwe  In a stunning development that threatens to rock the foundation of Zimbabwes religious and political elite, newly surfaced images show Prophet Ian Ndlovu and his wife receiving two top-of-the-range Toyota vehicles  reportedly funded by money now linked to criminal investigations in South Africa.\n\nThe vehicles, handed over at Faramatsi Toyota in a celebratory handover ceremony complete with red ribbons and balloons, are alleged to have been purchased using illicit funds funneled through convicted fraudster and ZANU PF-aligned mogul Wicknell Chivayo.\n\nDocuments obtained by South Africas Intelligence Unit indicate that the funds used in these luxury purchases form part of a broader cross-border money laundering operation, which South African authorities are now preparing to seize under international asset recovery protocols.\n\nProphet Ian Ndlovu accepts Wicknell Chivayos controversial giftspic.twitter.com/aIvCUdyJtS\n\nChivayo, long suspected of embezzling millions through bogus state contracts in Zimbabwe, has reportedly used a web of proxies and religious figures to launder his wealth  legitimizing stolen funds under the guise of gifts and donations to prominent church leaders. Prophet Ndlovu, once viewed as a moral compass for many devout followers, now finds himself in the crosshairs of a potential financial scandal of international proportions.\n\nFaith-Based Facade\n\nSources close to the investigation suggest that this latest move is part of a strategy to sanitize dirty money through high-profile religious endorsements.\n\nIn one photo, Prophet Ndlovu and his wife are seen proudly holding vehicle registration documents bearing the Zimbabwean government seal, an apparent attempt to showcase legitimacy. However, investigators believe these are merely part of a broader public relations smokescreen.\n\nWhat Next?\n\nWith growing regional pressure to crack down on illicit financial flows, South Africa is expected to formally notify Zimbabwean authorities of its findings. However, given the political connections of both Chivayo and his beneficiaries, questions loom over whether any meaningful action will be taken domestically.\n\nAs of this writing, Prophet Ian Ndlovu has not issued a public statement. Calls to his church, Divine Kingdom Baptist Ministries, went unanswered.\n\nThis story is developing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BREAKING NEWS By A Correspondent | ZimEye | BULAWAYO, Zimbabwe — In a stunning development that threatens to rock the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/16/prophet-ian-ndlovu-accepts-wicknell-chivayos-dirty-money-flashy-vehicle/\">Continue reading<span class=\"screen-reader-text\"> \"Prophet Ian Ndlovu Accepts Wicknell Chivayo’s Dirty Money, Flashy Vehicle\"</span></a></p>",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "Geza Doesn’t Have A Spokesman At All",
            "url": "https://www.zimeye.net/2025/04/16/geza-doesnt-have-a-spokesman-at-all/",
            "content": "By A Correspondent | ZimEye | Firebrand war veteran Blessed Geza does not have a spokesman at all, contrary to reports floating on social media.\n\nCde Geza has never had a spokesman at any time, the man made clear to ZimEye.\n\nThe development comes at a time when floating rumours suggested otherwise.\n\nCde Geza has repeatedly told ZimEye that he speaks on his own, and this through his social media accounts.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Firebrand war veteran Blessed Geza does not have a spokesman at all, contrary to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/16/geza-doesnt-have-a-spokesman-at-all/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Doesn’t Have A Spokesman At All\"</span></a></p>",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "3 UZ Lecturers Arrested",
            "url": "https://www.zimeye.net/2025/04/16/3-uz-lecturers-arrested/",
            "content": "VIDEO LOADING BELOW\n\n3 UZ lecturers arrested for demo.Three University of Zimbabwe lecturers and members of the Association of University Teachers (AUT) who were protesting against poor working conditions at the university have been arrested and are currently detained at Avondale Police Station.pic.twitter.com/snzEaCa6oR\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VIDEO LOADING BELOW",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "How Viva Energy’s Engineer, Tawanda Mutasa, Left Elderly Aunt Facing Homelessness Over Unpaid University Loan",
            "url": "https://www.zimeye.net/2025/04/16/how-viva-energys-engineer-tawanda-mutasa-left-elderly-aunt-facing-homelessness-over-unpaid-university-loan/",
            "content": "By Investigative Correspondent | ZimEye\n\nMELBOURNE  In a scandal that has cast a long shadow over Australian energy giant Viva Energy, one of its Advanced Process Control Engineers, Tawanda Calvin Mutasa, is at the center of a deeply disturbing family saga that calls into question both his personal integrity and, by association, the ethical standards of his employer.\n\nMutasa, a Zimbabwean national turned Australian resident, now enjoys a lucrative engineering career at Viva Energy. But behind the polish of his professional title lies a festering controversy: a $200,000 unpaid university loan provided by his now ailing 75-year-old aunt, Beryl Nkwazia woman who once rescued him from Zimbabwes economic crisis with a heart full of hope and a wallet nearly emptied by sacrifice.\n\nInstead of honouring the verbal agreement to repay her once employed, Mutasa has reportedly dismissed the debt with a callous claim that he already paid her backwith a single car ride. His stance has not only ripped apart his family but left his benefactor on the brink of losing her home in Canada.\n\nThis is no private quarrel gone quietly into the night. It is a public scandal, backed by court filings, email correspondence, and witness testimony. And yet, Viva Energya company that touts values of responsibility and respecthas continued to employ a man accused of heartless deceit, pathological greed, and emotional manipulation.\n\nViva Energys Reputational Risk\n\nAs the scandal gains traction, industry observers and ethicists are raising serious concerns: What does it say about a company when it retains an employee accused of leaving an elderly woman destitute after she bankrolled his education abroad? Should a corporation committed to corporate social responsibility stand by someone who, by multiple accounts, abandoned that very principle at home?\n\nThis is not simply a private matter between two relativesit is a glaring ethical question that now reflects on Viva Energys corporate culture. What kind of character does the company reward? What message does this send to employees, shareholders, and the broader community?\n\nMutasas public dismissiveness only compounds the reputational damage. In a July 2024 interview with journalist Simba Chikanza, when asked about the debt, he curtly responded, There is nothing outstanding, so everything has been concluded. He then hung up the phone.\n\nAn Aunts Kindness Turned Tragedy\n\nBack in 2006, as Zimbabwe teetered under economic collapse, Beryl Nkwazi, a Canadian immigrant, agreed to fund her nephews studies in Canada. She covered tuition, rent, groceries, and daily expenses, under the clear understandingnow backed by emailsthat this was a loan, not a gift. Once Mutasa secured work, repayment was expected.\n\nBut the repayment never came. And when Nkwazi, now battling severe illness and emotional trauma, took the matter to court, Mutasa and his mother, Graceherself a former Standard Bank managerdenied the existence of the agreement altogether. Email evidence has since debunked their denials.\n\nThis is not just financial betrayal, Nkwazi said in a recent statement. Its emotional abuse. I sacrificed everything for himand now, I may lose my home.\n\nDespite Graces courtroom denial, internal family communications confirm the agreement. One relative, Charles Mangurenje, publicly testified: Tawanda cannot be enriched at my sisters expense. She is facing homelessness while he flourishes.\n\nPrivilege Built on Pain\n\nWhat cuts deepest for Beryl is the arrogance with which Mutasa has treated her suffering. During the years she struggled to keep him fed and housed, bank statements revealed that other family members were secretly wiring him additional moneyenabling a lifestyle that included luxury dining, trips, and expensive clothing.\n\nHis coldest move, relatives say, came when he allegedly told another family member that his chauffeuring his aunt between Saskatoon and Calgary oncea ride needed after her night shiftwas equivalent compensation for the $200,000 she spent on him. A slap in the face, Beryl calls it.\n\nIn his defense, Mutasa has gone so far as to mock his aunt, asking whether she now wants to be a shareholder in my education.\n\nEthics Under Scrutiny\n\nIn a global industry increasingly defined by ESG (Environmental, Social, and Governance) metrics, Viva Energy must ask itself: Is this the calibre of individual we promote as the face of our workforce?\n\nCorporate accountability doesnt end at the office door. While Mutasa profits from a career his aunt paid for, she now faces a humiliating descent into poverty and homelessness. That this happens while he draws a healthy salary in one of Australias most respected companies makes the betrayal not just personalbut institutional.\n\nUnless Viva Energy addresses the matter, it risks being seen not merely as indifferent to ethical violationsbut complicit in enabling them.\n\nWill Mutasa repay the woman who built the foundation of his successor will Viva Energys silence speak louder than justice ever could?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Investigative Correspondent | ZimEye MELBOURNE – In a scandal that has cast a long shadow over Australian energy giant … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/16/how-viva-energys-engineer-tawanda-mutasa-left-elderly-aunt-facing-homelessness-over-unpaid-university-loan/\">Continue reading<span class=\"screen-reader-text\"> \"How Viva Energy’s Engineer, Tawanda Mutasa, Left Elderly Aunt Facing Homelessness Over Unpaid University Loan\"</span></a></p>",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "Barcelona and PSG Seal Champions League Semi-Final Spots After Thrilling Quarter-Finals",
            "url": "https://www.zimeye.net/2025/04/16/barcelona-and-psg-seal-champions-league-semi-final-spots-after-thrilling-quarter-finals/",
            "content": "European giants Barcelona and Paris Saint-Germain (PSG) have booked their spots in the UEFA Champions League semi-finals following dramatic second-leg encounters on a thrilling night of football.\n\nIn a high-stakes clash at Villa Park, Aston Villa edged PSG 3-2 on the night, but it wasnt enough to overturn the deficit from the first leg, with the French champions advancing 5-4 on aggregate. Villa pushed hard in front of a passionate home crowd and came within touching distance of a historic comeback, but PSGs first-leg advantage proved just enough to carry them through.\n\nMeanwhile, Barcelona delivered a commanding performance in Germany, defeating Borussia Dortmund 3-1 to seal their place in the last four with a 5-3 aggregate victory. The Catalan side, showing glimpses of their vintage European dominance, overcame Dortmunds early pressure with clinical finishing and a composed display in midfield.\n\nWith both sides progressing, fans can now look forward to an electric semi-final lineup featuring two of Europes most iconic clubs. The Champions League continues to deliver high drama, and the road to Wembley promises even more unforgettable moments.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "European giants Barcelona and Paris Saint-Germain (PSG) have booked their spots in the UEFA Champions League semi-finals following dramatic second-leg … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/16/barcelona-and-psg-seal-champions-league-semi-final-spots-after-thrilling-quarter-finals/\">Continue reading<span class=\"screen-reader-text\"> \"Barcelona and PSG Seal Champions League Semi-Final Spots After Thrilling Quarter-Finals\"</span></a></p>",
            "time": "06:41",
            "date": "17 Apr 2025"
        },
        {
            "title": "Former CIO Boss Gets Top Government Post",
            "url": "https://www.zimeye.net/2025/04/16/former-cio-boss-gets-top-government-post/",
            "content": "By Political Reporter  Former Central Intelligence Organisation (CIO) operative who served in Mugabes office has been appointed Minister of State for Matabeleland South.\n\nAlbert Nguluvhe,  who isalso the Zanu PF legislator for Beitbridge East, takes over from Evelyn Ndlovu, who has been appointed Minister of Environment, Climate and Wildlife.\n\nThe former spy chief briefly made headlines in November 2017 during the military operation that led to Mugabes ouster.\n\nHewas reportedly arrestednear the former presidents Blue Roof residenceshortly after briefing him on the prevailing security situation.\n\nWitnesses say Nguluvhe had stopped after noticing army tanks heading towards Mugabes home and queried the soldiers about their mission.\n\nHewas seizedby the troops, who confiscated hiscellphone, watch, and gold chain before detaining and interrogating him.\n\nHe was allegedly subjected to heavy assault, as he was among those viewed as key to Mugabes security and political network.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter – Former Central Intelligence Organisation (CIO) operative who served in Mugabe’s office has been appointed Minister of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/16/former-cio-boss-gets-top-government-post/\">Continue reading<span class=\"screen-reader-text\"> \"Former CIO Boss Gets Top Government Post\"</span></a></p>",
            "time": "06:41",
            "date": "17 Apr 2025"
        }
    ]
}