{
    "news": [
        {
            "title": "Mnangagwa Ally Abandons Press Conference Amid Factional Tensions",
            "url": "https://www.zimeye.net/2025/10/02/mnangagwa-ally-abandons-press-conference-amid-factional-tensions/",
            "content": "By A Correspondent| A key ally of President Emmerson Mnangagwa, Tonderai Chidawa, abandoned a scheduled press conference in Harare yesterday amid reports of looming factional clashes within ZANU-PF.\n\nChidawa, who had booked the Media Centre for the briefing, was expected to issue a stern warning to those who continue to undermine the partys direction, orders and authority.\n\nCalled by the Media Centre to confirm if he was still coming to address the media, Chidawa said, he had intelligence that there would be clashes.\n\nHowever, sources said the event was called off after intelligence suggested that a rival faction aligned to Vice President Constantino Chiwenga planned to disrupt the proceedings.\n\nFactional battles between Mnangagwa and his deputy Chiwenga have intensified, with tensions reportedly centering on Mnangagwas bid to extend his rule beyond the constitutional two-term limit, which ends in 2028.\n\nChidawa has emerged as one of Mnangagwas most vocal defenders, frequently convening press conferences to endorse the presidents so-called 2030 agenda.\n\nMeanwhile, Chiwenga, who is believed to be positioning himself for the presidency, has taken a combative stance against Mnangagwa loyalists. At a recent politburo meeting, he allegedly presented a dossier implicating businessmen linked to Mnangagwa  including Kudakwashe Tagwirei, Wicknell Chivayo, and Dilesh Nguwaya  in corrupt activities.\n\nThe abandoned press conference highlights the growing instability within ZANU-PF as succession battles intensify ahead of 2028.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A key ally of President Emmerson Mnangagwa, Tonderai Chidawa, abandoned a scheduled press conference in Harare yesterday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/mnangagwa-ally-abandons-press-conference-amid-factional-tensions/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Ally Abandons Press Conference Amid Factional Tensions\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Robert Mugabe Junior Arrested in Harare",
            "url": "https://www.zimeye.net/2025/10/02/robert-mugabe-junior-arrested-in-harare/",
            "content": "By A Correspondent | ZimEye | Harare  2 October 2025  Robert Mugabe Junior, aged 33, was arrested in Harare yesterday by police officers from the Drugs and Narcotics Section.\n\nHe was taken into custody at Harare Central Police Station after being allegedly found in possession of two sachets of dagga and a quantity of white powder suspected to be cocaine, which was discovered among cash in his possession.\n\nMugabe Jr is expected to appear before Harare magistrates this morning.\n\nThe Zimbabwe Republic Police has not yet issued an official statement.\n\nFurther updates will be provided.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Harare – 2 October 2025 — Robert Mugabe Junior, aged 33, was arrested in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/robert-mugabe-junior-arrested-in-harare/\">Continue reading<span class=\"screen-reader-text\"> \"Robert Mugabe Junior Arrested in Harare\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Tshabangu Airlifted To India For Cancer Treatment",
            "url": "https://www.zimeye.net/2025/10/02/tshabangu-airlifted-to-india-for-cancer-treatment/",
            "content": "By A Correspondent  ControversialCitizens Coalition for Change (CCC) secretary general Sengezo Tshabanguhas reportedly been flown to India for medical treatment amid claims that he is battling colon cancer.\n\nA source close to the matter told this publication that Tshabangu was airlifted two weeks ago and is currently undergoing treatment. His health has been the subject of intense speculation since October 2024, when he was admitted to intensive care in Switzerland after falling ill while attending the 149thInter-Parliamentary Union (IPU) Assembly, where he travelled as part of Zimbabwes delegation alongside Speaker of ParliamentJacob Mudenda.\n\nHowever, CCC parliamentary chief whipCharles Moyodismissed the latest reports, insisting that Tshabangu is on holiday. Moyo did not reveal his whereabouts or the length of his supposed break. Despite the denial, sources maintain that Tshabangu has been struggling with colon cancer for some time.\n\nTshabangu, who dramatically entered Zimbabwes political limelight inOctober 2023, declared himself the CCCs interim secretary general before initiating a series ofcontroversial recallsof opposition MPs and councillors. He argued that those targeted were no longer bona fide party members, a move that gutted the CCCs parliamentary representation and tilted the balance of power in favour of ZANU-PF.\n\nHis actions drew sharp criticism from CCC leaderNelson Chamisaand opposition supporters, who accused him of being a ZANU-PF proxy. Critics argued that the recalls were part of a state-sponsored project to dismantle the CCC from within and neutralise the opposition in Parliament. Tshabangu, however, insisted that he was merely enforcing party discipline and restoring order.\n\nThe states response to Tshabangus maneuvers has raised further suspicions about his political loyalties. Despite facing accusations of usurping the CCC leadership, the Zimbabwe Electoral Commission (ZEC) and Parliament consistently recognised his authority to effect recalls, effectively giving him institutional backing. Furthermore, court challenges against his actions were repeatedly dismissed or delayed, fuelling claims that he enjoyed the protection and support of ruling party structures and the security establishment.\n\nTshabangus relationship with the state became even clearer when he was included in high-profile government delegations, such as the trip to the IPU Assembly in Switzerland. His presence alongside senior ZANU-PF officials and state functionaries signalled official endorsement, further alienating him from the broader CCC membership, which viewed him as an instrument of ZANU-PFs broader strategy to weaken the opposition ahead of the 2028 elections.\n\nNow, amid reports of his deteriorating health, questions are being asked about what Tshabangus potential absence could mean for the ruling partysstrategy of engineering opposition fragmentation. With Tshabangu out of the picture, at least temporarily, CCC dynamics could shift once again, either opening a window for regrouping or deepening divisions depending on how the party responds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Controversial Citizens Coalition for Change (CCC) secretary general Sengezo Tshabangu has reportedly been flown to India for medical … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/tshabangu-airlifted-to-india-for-cancer-treatment/\">Continue reading<span class=\"screen-reader-text\"> \"Tshabangu Airlifted To India For Cancer Treatment\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Leaked Mliswa Audio with Aggripa Masiyakurima",
            "url": "https://www.zimeye.net/2025/10/02/leaked-mliswa-audio-with-aggripa-masiyakurima/",
            "content": "video loading below\n\nMbavha yemombe takazvitaura kuti Temba is fake & never take sides with him nor trust him. Chiwenga is Coming & as a country we are all rallying behind this noble man who is fighting for a noble cause.@ZimEye@killerzivhu1pic.twitter.com/8CBxCFmuhK\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Outrage As Teacher Rapes Grade Four Pupil During Extra Lessons",
            "url": "https://www.zimeye.net/2025/10/02/outrage-as-teacher-rapes-grade-four-pupil-during-extra-lessons/",
            "content": "A TEACHER has been arrested for allegedly raping a Grade 4 pupil attending extra lessons in Hopley.\n\nCollen Banda (48) of Hopley Zone 4, not attached to any school, was reported to have threatened the learner aged 12 and sexually assaulted her.\n\nBanda had finished conducting a lesson with the learner and it was just the two of them the room.\n\nThe learner disclosed the assault leading to Bandas arrest.\n\nHarare provincial police spokesperson Inspector Luckmore Chakanza confirmed the arrest.\n\nPolice are investigating a case of rape involving a Grade 4 pupil during an extra lesson.\n\nThe victim was escorted to MSF Edith Clinic Mbare for medical examination, said Insp Chakanza.\n\nSource: The Herald\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A TEACHER has been arrested for allegedly raping a Grade 4 pupil attending extra lessons in Hopley. Collen Banda (48) … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/outrage-as-teacher-rapes-grade-four-pupil-during-extra-lessons/\">Continue reading<span class=\"screen-reader-text\"> \"Outrage As Teacher Rapes Grade Four Pupil During Extra Lessons\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Mnangagwa Frog-Marches Mapostori to State House",
            "url": "https://www.zimeye.net/2025/10/02/mnangagwa-frog-marches-mapostori-to-state-house/",
            "content": "By A Correspondent President Emmerson Mnangagwa on Wednesday frog-marched thousands ofJohane Masowe eChishanu Vadzidzi VaJesumembers toState House, where he courted their loyalty under the guise of promoting moral values and national development.\n\nAddressing the gathering, which was also attended byFirst Lady Auxillia Mnangagwa, a lifelong member of the apostolic sect, Mnangagwa urged the church to play its part in eradicating social ills such as drug abuse, crime, bullying, and other anti-social behaviours. He called on churches to raise children on the foundations of Gods word and Zimbabwes rich cultural heritage.\n\nI call upon you, my fellow brothers and sisters in Christ, and all the Churches of our great motherland, Zimbabwe, to preach the gospel of Jesus Christ, love, peace, unity and harmony. Let us raise our children and young people according to Gods word and our rich culture, Mnangagwa declared.\n\nThe president further promised that under his so-calledSecond Republic, government would continue to support church-linked projects in education, agriculture, and entrepreneurship, particularly those targeting women and youth. He also quoted scripture, describing his administration as a government rooted in Christian values that remains open to godly guidance.\n\nMnangagwas overtures to the Johane Masowe eChishanu church form part of alongstanding ZANU-PF strategy of patronising religious institutions for political legitimacy. Since independence in 1980, the ruling party has consistently used churchesparticularly large apostolic sects with millions of followersas mobilising bases during elections.\n\nFormer PresidentRobert Mugabeperfected this tactic, often addressing apostolic gatherings and presenting ZANU-PF as a divinely ordained liberation movement. Mnangagwa has since intensified the practice, frequently appearing at mass gatherings of Vapostori, Zionist churches, and Pentecostal ministries, where he is presented as a chosen leader.\n\nApostolic sects, which command huge rural and peri-urban followings, are particularly attractive to ZANU-PF because of their disciplined structures, large membership, and unquestioning loyalty to church leaders. In turn, ruling party elites have provided these sects with state resources, land for shrines, and public recognition, effectively binding them into the partys patronage system.\n\nAhead of the2018 and 2023 elections, Mnangagwa heavily courted the apostolic vote, appearing in white garments at shrines and declaring that the voice of the people is the voice of God. Critics argue this strategy hasblurred the line between church and state, turning religious gatherings into de facto campaign rallies.\n\nThe politicisation of churches has also featured prominently in thesuccession battleswithin ZANU-PF. Vice PresidentConstantino Chiwengahas openly criticised Mnangagwas reliance on religious loyalists, disparaging them aszvigananda(bootlickers) propped up by pastors and prophets eager for state patronage.\n\nObservers say the latest State House event fits into Mnangagwas broaderED2030 Agenda, which seeks to extend his stay in power. By mobilising churches and portraying himself as the custodian of Christian values, Mnangagwa aims to counter opposition support and present himself as both a political and spiritual father figure.\n\nMnangagwas frog-marching of the Johane Masowe eChishanu congregants underscores how Zimbabwes ruling elite continues to exploit religious institutions for political ends. While packaged as moral guidance, such gatherings are increasingly seen ascampaign platforms designed to secure loyalty, neutralise dissent, and reinforce ZANU-PFs grip on power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa on Wednesday frog-marched thousands of Johane Masowe eChishanu Vadzidzi VaJesu members to State House, where he courted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/mnangagwa-frog-marches-mapostori-to-state-house/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Frog-Marches Mapostori to State House\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Police Arrest Two in Separate Drug-Related Incidents in Uzumba and Chivhu",
            "url": "https://www.zimeye.net/2025/10/02/police-arrest-two-in-separate-drug-related-incidents-in-uzumba-and-chivhu/",
            "content": "By Dorrothy Moyo | Mutawatawa, Zimbabwe  2 October 2025  The Zimbabwe Republic Police (ZRP) has announced two major arrests in connection with drug-related offences in Mashonaland East province.\n\nIn a statement released today, police confirmed the arrest of Chikoto Muskwe (40) of Nhakiwa Two Village, Uzumba, Murewa. The suspect was apprehended on 28 October 2025 after police in Mutawatawa acted on a tip-off and discovered 81 plants of dagga being unlawfully cultivated.\n\nMeanwhile, in a separate case, police in Chivhu arrested Mandizvidza Mandizvidza (47) on 29 September 2025 for the unlawful possession of Crystal Meth (methamphetamine), a dangerous narcotic that has been linked to rising drug abuse cases across the country.\n\nThe ZRP reiterated its warning that drug trafficking and abuse remain serious crimes punishable under Zimbabwean law, urging the public to continue providing information to help curb the spread of illicit substances.\n\nWe appeal to communities to remain vigilant and report any suspicious activities related to drug cultivation, trafficking, and abuse, the statement read.\n\nBoth suspects are expected to appear in court soon.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | Mutawatawa, Zimbabwe – 2 October 2025 — The Zimbabwe Republic Police (ZRP) has announced two major … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/police-arrest-two-in-separate-drug-related-incidents-in-uzumba-and-chivhu/\">Continue reading<span class=\"screen-reader-text\"> \"Police Arrest Two in Separate Drug-Related Incidents in Uzumba and Chivhu\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Julius Malema Convicted Over Firearm Incident",
            "url": "https://www.zimeye.net/2025/10/02/julius-malema-convicted-over-firearm-incident/",
            "content": "South Africa  The East London Magistrates Court on Wednesday convictedEFF leader Julius Malemaon multiple firearm-related charges stemming from a 2018 rally incident.\n\nMalema was found guilty onfive counts, including unlawful possession of a firearm, unlawful possession of ammunition, discharging a firearm in a public area, reckless endangerment of persons or property, and failing to take reasonable precautions to prevent danger.\n\nThe charges arose after video footage captured Malema being handed a rifle before firing several shots into the air at theSisa Dukashe Stadium in Mdantsaneduring the Economic Freedom Fighters (EFF) fifth anniversary rally in 2018. The packed stadium was filled with thousands of supporters at the time.\n\nMalemas co-accused and former bodyguard,Adriaan Snyman, who owned the private security company contracted by the EFF, was acquitted on two of the six charges and subsequently discharged.\n\nDelivering the ruling, MagistrateTwanet Olivier, despite being visibly unwell with flu, ruled that the state had proved its case against Malema beyond reasonable doubt.\n\nAccused one [Malema], in respect of counts one, two, three, four, and five you are found guilty as charged. Accused two [Snyman], in respect of counts four and six, you are found not guilty and discharged, Olivier said.\n\nThe case was initially brought forward after lobbying byAfriForum, which pressed charges following the viral footage of the incident. Thestate arguedthat Malemas actions posed a grave risk to public safety, while thedefence counteredthat the firearm was a toy gun that fired blanks, adding that no witnesses could confirm live rounds were discharged.\n\nMalema and Snyman consistently pleaded not guilty, arguing the charges lacked sufficient evidence and seeking to have the case thrown out. Their application was dismissed, paving the way for the trial.\n\nThe courtroom was packed with EFF supporters, who watched silently as the verdict was delivered.\n\nSentencing is expected to follow, with the conviction likely to fuel political debate as Malema continues to position himself as a vocal critic of the government ahead of the next elections.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa – The East London Magistrate’s Court on Wednesday convicted EFF leader Julius Malema on multiple firearm-related charges stemming from a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/julius-malema-convicted-over-firearm-incident/\">Continue reading<span class=\"screen-reader-text\"> \"Julius Malema Convicted Over Firearm Incident\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Zanu-PF Women’s League Pushes VP Chiwenga Out",
            "url": "https://www.zimeye.net/2025/10/02/zanu-pf-womens-league-pushes-vp-chiwenga-out/",
            "content": "By A Correspondent  The ZANU-PF Manicaland Womens League has revived the controversialED2030 Agenda, a campaign aimed at extending President Emmerson Mnangagwas rule until 2030, deepening the succession wrangle that continues to divide the ruling party.\n\nThe ED2030 proposal, which seeks to amend the Constitution to allow Mnangagwa to stay beyond his current second term, effectively sidelines Vice President Constantino Chiwenga, who has long been seen as the heir-apparent under the so-calledgentlemens agreementstruck during the 2017 coup that toppled the late Robert Mugabe.\n\nAt the height of that military-assisted transition, it was widely understood that Mnangagwa would serve one full term and hand over power to Chiwenga.\n\nHowever, as Mnangagwa consolidated his grip on the state and party, his loyalists began pushing narratives to extend his stay in power, igniting factional battles that now define the ruling partys politics.\n\nTheManicaland Womens Leaguedeclared it would use the upcomingZANU-PF National Conferenceset for October 13 to 18 in Mutare to push for formal endorsement of the ED2030 resolution.\n\nThis resolution was first tabled at last years conference and has since become a rallying point for Mnangagwa loyalists determined to block any potential challenge from Chiwengas camp.\n\nSpeaking at a provincial executive meeting, Manicaland Womens League chairpersonCde Dorothy Mabikainsisted that last years resolution must now be urgently implemented.\n\nLast year, we made a resolution that the President should remain in office until 2030. It has been almost a year without any update on its implementation. As we go to another conference, we are saying our resolution should be implemented expeditiously. This is our unanimous position as the Womens League in Manicaland, she declared.\n\nThe Womens League justified its support for ED2030 by citing policy continuity and the need to complete national projects tied toVision 2030and theNational Development Strategy 1 (NDS1). They argue that Mnangagwas leadership has brought infrastructure development and empowerment programmes, especially targeting women and youths.\n\nHowever, political observers note that the revival of the ED2030 campaign is more aboutinternal power strugglesthan development goals.\n\nWithin ZANU-PF, factional lines have hardened between Mnangagwas backerswho see ED2030 as a way of cementing his controland Chiwengas allies in the military and security establishment, who feel betrayed by what they perceive as Mnangagwas refusal to honour the 2017 pact.\n\nIn recent months, tensions between the two camps have played out through subtle propaganda wars, with rival groups sponsoring hashtags, media campaigns, and endorsements at rallies.\n\nThe Womens League, traditionally a powerful mobilising arm of the party, has now firmly aligned itself with Mnangagwa, further isolating Chiwengas faction ahead of the Mutare conference.\n\nAs Mutare readies to host thousands of delegates, the succession question looms large. While the Womens League celebrates the opportunity to thank the President by hosting the conference, the gathering is shaping up to be another battlefield in ZANU-PFsbitter succession warswars that could determine not only Mnangagwas future but also the political survival of his deputy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The ZANU-PF Manicaland Women’s League has revived the controversial ED2030 Agenda, a campaign aimed at extending President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/zanu-pf-womens-league-pushes-vp-chiwenga-out/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu-PF Women’s League Pushes VP Chiwenga Out \"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        },
        {
            "title": "Masvingo Residents Snub Zanu PF Victory Celebration Rally Despite Chadzamira’s Presence",
            "url": "https://www.zimeye.net/2025/10/02/masvingo-residents-snub-zanu-pf-victory-celebration-rally-despite-chadzamiras-presence/",
            "content": "By A Correspondent\n\nMasvingos Ward 7 saw a surprisingly low turnout at the ZANU PF victory celebration rally over the weekend, despite the presence of Masvingo Minister of State for Provincial Affairs and Devolution, Ezra Chadzamira.\n\nMany residents openly expressed frustration over the ruling partys performance and questioned whether promised development projects had truly benefited the community.\n\nChadzamira defended ZANU PFs record during the rally. You should benefit from government programmes; the government is committed to assisting every Zimbabwean. Im happy that you have done the right thing, which is voting for the ruling ZANU PF party, he told the thin crowd.\n\nHowever, some residents were quick to voice their disappointment. One Rujeko resident said: Most of us didnt even bother coming. We are tired of promises. The roads are still bad, the clinics are incomplete, and the boreholes are not enough for everyone. This rally feels like a show, not real change.\n\nAnother added: We get seed and fertilizers sometimes, but its inconsistent. People are struggling, and yet ZANU PF expects us to cheer for them. Attendance is low because people dont believe these celebrations reflect whats happening in our lives.\n\nWard 7 Councillor Simbarashe Shonhiwa attempted to highlight progress made in the area. We want to thank the electorate for voting for the ruling ZANU PF party, but most of all, we want to thank the President for the developmental projects taking place here, including the solar-powered boreholes under the Presidential Borehole Sinking Programme, he said.\n\nDespite these statements, residents remained skeptical. Its easy to thank the President on stage. We see the projects, but many are not completed, and some benefits never reach the most vulnerable, said another local.\n\nZANU PF Masvingo Provincial Vice Chairperson, Trust Mugabe, also addressed the rally, urging citizens to connect voting with development. We are all seeing what the President, Cde Emmerson Mnangagwa, is doing in the country  the life-changing developmental projects which are people-centred. That is why voting for the ruling ZANU PF is voting for success and development, he said.\n\nStill, the rally turnout reflected widespread apathy, highlighting growing frustration among Masvingo residents.\n\nThe Ward 7 by-election was held on September 13, following the death of former councillor Tafara Masimba.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo’s Ward 7 saw a surprisingly low turnout at the ZANU PF victory celebration rally over the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/02/masvingo-residents-snub-zanu-pf-victory-celebration-rally-despite-chadzamiras-presence/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Residents Snub Zanu PF Victory Celebration Rally Despite Chadzamira’s Presence\"</span></a></p>",
            "time": "08:39",
            "date": "03 Oct 2025"
        }
    ]
}