{
    "news": [
        {
            "title": "Ken Sharpe Brings Top International Hotel To Zim",
            "url": "https://www.zimeye.net/2025/01/23/ken-sharpe-brings-top-international-hotel-to-zim/",
            "content": "By Business Reporter- WESTPROP Holdings has successfully inked a partnership with hospitality giant Radisson Hotel Group for the management of the Millennium Heights block 5 aparthotel.\n\nThe aparthotel would be known as the Radisson Millennium Heights Aparthotel.\n\nChief executive officer Mr Ken Sharpe signed on behalf of WestProp while Mr Daniel Trappler, the senior director responsible for development in Sub-Sahara Africa, signed for the Radisson Hotel Group.\n\nThe hotel group has an impeccable track record in the management of aparthotels with its entry into the local market expected to ignite excitement and options for discerning travellers and holidayers.\n\nAparthotels offer a new type of hospitality experience that combines the comfort of home with the services of a hotel.\n\nThe 148-roomed aparthotel will have spacious, fully-equipped apartments with kitchenettes, separate living areas, and bedrooms. Guests can enjoy the flexibility of self-catering while still having access to hotel amenities such as fitness centres, restaurants, and meeting spaces.\n\nThe concept offers numerous benefits for both guests and property owners. Guests enjoy the comfort and convenience of a home-away-from-home experience, while owners benefit from Radissons global distribution network, revenue management expertise, and operational efficiencies.\n\nWhile the concept is still new in Zimbabwe, the demand for aparthotel is growing rapidly, driven by increasing demand for flexible, self-catering accommodations from business travellers, families, and digital nomads.\n\nThe aparthotel, whose construction begins this year, is expected to open in two years time. WestProp has already started accepting investment into the aparthotel with each share costing U$5 750 inclusive of the furniture.\n\nSo far 58 percent of the fractional shares have been bought since launch last November.\n\nMultiple investors can part own an apartment, which would be leased out to clients as serviced apartment accommodation for short-term stay.\n\nAfter the first year of operation as an aparthotel, investors can expect returns of at least 8 percent. However, as the property values increase and the hotels occupancy rates grow, so too will be the return on investment, said Mr Sharpe.\n\nMr Sharpe says investors should take up the offer and prepare for their future and that of their children. This is a sure way into long term secure investment. With the guarantee on the returns, it is surely a game changer in the property space in Zimbabwe. This offer is the first of its kind in Zimbabwe, where one can have his/her cake and eat it too.\n\nDo not miss out on this opportunity to invest in Zimbabwes future and secure a share of the profits, he said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter- WESTPROP Holdings has successfully inked a partnership with hospitality giant Radisson Hotel Group for the management of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/ken-sharpe-brings-top-international-hotel-to-zim/\">Continue reading<span class=\"screen-reader-text\"> \"Ken Sharpe Brings Top International Hotel To Zim\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "Chiwenga Fires Warning Shots",
            "url": "https://www.zimeye.net/2025/01/23/chiwenga-fires-warning-shots-2/",
            "content": "By Munacho Gwamanda-Acting President Constantino Chiwenga has issued a stern warning to Zanu PF factions seeking to sideline him from the partys succession race, signalling escalating tensions with President Emmerson Mnangagwas camp.\n\nSpeaking at the National Heroes Acre on Wednesday during the burial of three national heroes, Chiwenga cautioned against petty jealousy and internal divisions.\n\nHis remarks are seen as a veiled rebuke to Mnangagwa loyalists pushing for the President to extend his constitutionally mandated two-term limit, effectively sidelining Chiwengas long-anticipated takeover.\n\nLack of respect for each other and petty jealousy are mortal sins which cannot be forgiven here on earth and in heaven, Chiwenga declared, urging party members to prioritize unity and national development. What must always guide us is the need to shun hatred and to embrace each other through love, tolerance, and forgiveness.\n\nChiwengas comments come as tensions deepen between the two camps within Zanu PF.\n\nMnangagwa allies are reportedly lobbying for constitutional amendments to enable the President to extend his stay in power beyond 2028, breaking an alleged post-coup agreement that would have seen Chiwenga succeed him after two terms.\n\nAdding to the friction is the mysterious string of deaths of over 20 high-ranking military officers and political figures aligned with Chiwenga since the 2017 coup that ousted Robert Mugabe.\n\nProminent figures such as Foreign Minister Sibusiso Moyo and Agriculture Minister Perence Shiri have died under unclear circumstances, fueling speculation of a calculated purge designed to weaken Chiwengas power base.\n\nMnangagwa has breached the gentlemens agreement, said a senior Zanu PF insider. The pattern of eliminating Chiwengas loyalists is not accidentalits a deliberate strategy to ensure he retains power unchallenged.\n\nThe power struggle highlights Mnangagwas efforts to consolidate control within Zanu PF by neutralizing dissenters and weakening Chiwengas faction.\n\nPolitical analysts warn this could spark a retaliatory response from Chiwenga, potentially plunging Zimbabwe into another violent crisis.\n\nMnangagwas grip on power now depends on securing parliamentary loyalty and keeping the military neutralized, observed another political analyst i. But if Chiwengas camp continues to feel marginalized, they might see no alternative but to act decisivelypossibly through another coup attempt.\n\nThe rising tension between the President and his deputy is a grim reminder of Zanu PFs history of internal factionalism and violent disputes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Acting President Constantino Chiwenga has issued a stern warning to Zanu PF factions seeking to sideline him from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/chiwenga-fires-warning-shots-2/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Fires Warning Shots\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "ZIMRA’s Aggressive Tax Collection Strategy Triggers Concerns Among Citizens",
            "url": "https://www.zimeye.net/2025/01/23/zimras-aggressive-tax-collection-strategy-triggers-concerns-among-citizens/",
            "content": "By A Correspondent\n\nIn a move that many view as a further burden on already struggling citizens and companies, the Zimbabwe Revenue Authority (ZIMRA) has announced a target to collect over USD 7 billion in taxes this year, following a successful 2024 revenue collection period.\n\nZIMRA Commissioner General, Ms. Regina Chinamasa, revealed that the institution exceeded its 2024 target, collecting over USD 6 billion. We have surpassed our targets for the year, and as we move forward, we have set an even more ambitious target of over USD 7 billion, she stated, underlining that these funds are crucial for government projects and ongoing expenses.\n\nThe revenue collection will come from a range of taxes, including Value Added Tax (VAT), corporate tax, customs duties, Pay As You Earn (PAYE), and mining royalties. These taxes are expected to help sustain capital projects and cover the governments employment costs.\n\nThe focus is on working with taxpayers to generate more revenue, Chinamasa emphasized, suggesting that the governments strategy involves pushing harder on the already burdened public and businesses. She also highlighted that Zimbabwes tax collection ability has grown, saying, Zimbabwe has what it takes in terms of resource mobilisation and revenue generation. We are using all the relevant instruments to collect more taxes.\n\nHowever, many citizens and businesses are struggling to cope with the rising cost of living, inflation, and a fragile economy. Critics argue that the governments continued tax hikes, including the anticipated surge in revenue collections, will further squeeze the pockets of the already suffering population. While ZIMRA sees this as a positive trajectory, many citizens and businesses feel they are being milked dry with taxes that are unsustainable, one economic analyst noted.\n\nAdditionally, despite international financial support accounting for at least 20% of Zimbabwes national budget, it remains subdued, and the countrys domestic resource mobilisation remains key. Chinamasa further stressed, It is our mandate to ensure government projects are adequately funded, and we will continue focusing on long-term measures to boost revenue inflows.\n\nIn line with the countrys devolution agenda, a portion of the tax revenue will be directed toward infrastructure development across Zimbabwe, but it remains to be seen whether these projects will benefit the majority of citizens who are already struggling to make ends meet.\n\nThe anticipated rise in revenue collections is also expected to rely heavily on increased compliance from industry and commerce, reduced revenue leakages, and improved economic conditions, including a favorable summer cropping season. But with many facing dire economic challenges, the governments heavy-handed taxation policies are likely to remain a contentious issue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that many view as a further burden on already struggling citizens and companies, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/zimras-aggressive-tax-collection-strategy-triggers-concerns-among-citizens/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA’s Aggressive Tax Collection Strategy Triggers Concerns Among Citizens\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "Army, Army All Over President Chiwenga, Not A Single-2030-Clummy Nearby",
            "url": "https://www.zimeye.net/2025/01/23/army-army-all-over-president-chiwenga-not-a-single-2030-clummy-nearby/",
            "content": "Heroes Acre Event Signals Military Dominance, Silence on 2030 Slogan.\n\nBy Farai D Hove |Harare  A Heroes Acre burial ceremony held today has raised eyebrows as the event showcased a significant shift in tone, with a heavy military presence dominating the proceedings and a conspicuous absence of the widely circulated 2030 political slogans often tied to President Emmerson Mnangagwas re-election ambitions.\n\nVideos from the event revealed a sea of army personnel filling the stands, presenting a powerful and disciplined display. This visual contrast emphasized the absence of traditional partisan chants, including the controversial 2030 Anenge Achitonga slogan. Many analysts view this as a symbolic moment, underscoring the growing presence of the military in political narratives amid factional tensions in ZANU PF.\n\nChiwenga Maintains Poise Amid Military Atmosphere\n\nVice President Constantino Chiwenga, often seen as a key figure in the ongoing factional struggles, attended the ceremony and focused his speech on themes of unity and national healing.\n\nIn his address, Chiwenga highlighted, As we strive to develop our country, we must be guided by love, tolerance, and respect for one another. Hatred and petty jealousy are sins that cannot be forgiven on earth or in heaven. These remarks struck a sharp contrast to the polarizing rhetoric of previous party events.\n\nSocial Media Reactions: Silence on 2030 Sparks Debate\n\nSocial media commentators quickly noticed the unusual shift. Popular Twitter user LynneM posted, Dear VARAKASHI: Did Genroll chant your slogan yekuti 2030 Anenge Achitonga  Yes or No? Answer me oo!! The rhetorical question amplified online chatter about the Generals resistance to partisan endorsements.\n\nAnother user, Hosia Mviringi, criticized the 2030 slogan directly, stating, The General will never chant that 2030 NONSENSE! Hei, he is still very sane.\n\nArmys Presence Highlights Internal Party Dynamics\n\nThis event reflects the deepening complexities within ZANU PF. With the 2028 elections on the horizon, factions loyal to President Mnangagwa and those supportive of Chiwenga continue to send subtle yet powerful signals of their positions. The militarys prominent role in todays event has fueled speculation about its political alignment and potential influence moving forward.\n\nAs the party grapples with growing internal divisions, todays display at Heroes Acre may well signal the start of a new chapterone where the balance of power could shift further toward Zimbabwes military elites. For now, the nation watches with bated breath as these dynamics unfold. ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Heroes Acre Event Signals Military Dominance, Silence on “2030” Slogan. By Farai D Hove | Harare – A Heroes Acre … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/army-army-all-over-president-chiwenga-not-a-single-2030-clummy-nearby/\">Continue reading<span class=\"screen-reader-text\"> \"Army, Army All Over President Chiwenga, Not A Single-2030-Clummy Nearby\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "Mliswa Endorses ZIFA Polls",
            "url": "https://www.zimeye.net/2025/01/23/mliswa-endorses-zifa-polls/",
            "content": "By A Correspondent\n\nTemba Mliswa, the disqualified ZIFA presidential candidate, has withdrawn his application to block the upcoming elections scheduled for this Saturday.\n\nBoth Mliswa and the respondents agreed that the timing of the application was inappropriate.\n\nMliswa was one of five candidates disqualified by the ZIFA Electoral Committee for failing to meet the associations eligibility requirements. He had sought to challenge the election process as well as the validity and legitimacy of the new ZIFA statutes governing the upcoming election.\n\nThe court application, originally filed in the Bulawayo High Court, was later transferred to Harare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Temba Mliswa, the disqualified ZIFA presidential candidate, has withdrawn his application to block the upcoming elections scheduled … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/mliswa-endorses-zifa-polls/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Endorses ZIFA Polls\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "Is Jalai Staying At DeMbare?",
            "url": "https://www.zimeye.net/2025/01/23/is-jalai-staying-at-dembare/",
            "content": "Dynamos Football Club vice-captain, Emmanuel Jalai, has decided to remain with the Harare giants, putting to rest any speculation regarding his future at the club. The decision comes amidst several key changes within the team as the club continues to restructure.\n\nSources from Dynamos FC confirmed on Tuesday that Jalai, who has been an integral part of the team, will continue his tenure at the club. Emmanuel Jalai chooses to stay at Dembare, a source revealed, signaling a vote of confidence in the clubs ongoing efforts to rebuild.\n\nIn addition to Jalais decision, the club also made significant managerial adjustments. Former player Mark Mathe has been appointed as Dynamos new assistant coach. This move comes as part of the teams broader strategy to strengthen their technical staff. Furthermore, Ronald Gidiza Sibanda has been appointed as the new team manager, replacing Marriotts son in the role.\n\nWhile Jalais future at Dynamos has been clarified, unconfirmed reports suggest that goalkeeper Mapisa might be bidding farewell to the club, though no official statement has been made. The club is also set to announce a new CEO soon, signaling a new chapter for the storied team.\n\nIn a move to promote young talent, Dynamos has elevated promising striker Masango from the junior ranks to the first team, signaling the clubs commitment to nurturing local talent for the future.\n\nAs Dynamos FC continues its efforts to rejuvenate the squad, the clubs loyal fanbase will be hopeful that these changes will result in a resurgence of the once-dominant force in Zimbabwean football. The future looks bright with Jalais decision to stay, as the team looks to rebuild both on and off the pitch.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dynamos Football Club vice-captain, Emmanuel Jalai, has decided to remain with the Harare giants, putting to rest any speculation regarding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/is-jalai-staying-at-dembare/\">Continue reading<span class=\"screen-reader-text\"> \"Is Jalai Staying At DeMbare?\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "Chiwenga Declares War On Corruption But How Sincere Is Jenarari?",
            "url": "https://www.zimeye.net/2025/01/23/chiwenga-declares-war-on-corruption-but-how-sincere-is-jenarari/",
            "content": "By A Correspondent\n\nActing President of Zimbabwe, General (Rtd) Dr. Constantino Chiwenga, has pledged to tackle the rampant corruption undermining the countrys economic progress.\n\nWith President Emmerson Mnangagwa currently on annual leave and expected to return in early February, Chiwenga took the opportunity to address pressing issues surrounding corruption and shady business deals during a recent public event.\n\nWhile presiding over the triple burial ceremony for Major General (Rtd) Solomon Siziba, Chen Chimutengwende, and Ambassador John Shumba Mvundura at the National Heroes Acre on Wednesday, Chiwenga made a firm commitment to end the corrupt practices that are hindering Zimbabwes growth.\n\nHis words resonated with many as he condemned the detrimental effects of such deals on the nations economy.\n\nWe are aware of the shady deals that are disrupting the growth of the economy and we say no to corruption, Chiwenga stated. His remarks were a direct response to the persistent corruption that has plagued various sectors of the country, resulting in significant financial losses and an erosion of public trust in government institutions.\n\nChiwenga further emphasized that corruption is not only an economic issue but also a betrayal of the values and principles of the liberation struggle. Corruption is a betrayal of the liberation struggle, he declared, stressing the importance of integrity and transparency in rebuilding the nation.\n\nThe Acting Presidents vow to root out corruption comes at a time when Zimbabwe continues to face challenges related to economic instability and public disillusionment with governance. His speech highlighted a strong determination to address these issues and ensure that future business dealings align with the nations vision of growth and development.\n\nIn addition to addressing corruption, Chiwenga paid tribute to the three individuals honored at the ceremony, recognizing their contributions to Zimbabwes liberation and national development. His remarks served as a reminder of the sacrifices made by many in the struggle for independence, and the need to uphold their legacy through honest and effective governance.\n\nAs Zimbabwe navigates through these challenges, Chiwengas pledge to eradicate corruption marks a critical step in restoring confidence in the nations leadership and fostering an environment conducive to sustainable economic growth.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Acting President of Zimbabwe, General (Rtd) Dr. Constantino Chiwenga, has pledged to tackle the rampant corruption undermining … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/chiwenga-declares-war-on-corruption-but-how-sincere-is-jenarari/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Declares War On Corruption But How Sincere Is Jenarari?\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "Met Department Warns of Continuous Heavy Rains This Week",
            "url": "https://www.zimeye.net/2025/01/23/met-department-warns-of-continuous-heavy-rains-this-week/",
            "content": "By A Correspondent\n\nThe Meteorological Services Department of Zimbabwe (MSDZ) has issued a warning of continued heavy rains in various regions tomorrow, with the wet conditions expected to persist throughout the week.\n\nIn a statement shared on its X handle, MSDZ attributed the rainfall to the movement of the Inter-Tropical Convergence Zone (ITCZ), a key weather phenomenon. The ITCZ, a band of low pressure around the Earth near the equator, has a significant impact on rainfall patterns, the department explained.\n\nMSDZ further stated, The ITCZ should be influencing weather over much of Zimbabwe for much of this week, indicating that widespread heavy rains will continue in several areas. The department urged the public to remain cautious as the rains may lead to flooding and other weather-related hazards.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Meteorological Services Department of Zimbabwe (MSDZ) has issued a warning of continued heavy rains in various … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/met-department-warns-of-continuous-heavy-rains-this-week/\">Continue reading<span class=\"screen-reader-text\"> \"Met Department Warns of Continuous Heavy Rains This Week\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "Respect Constitution, Church Leaders Challenge Mnangagwa",
            "url": "https://www.zimeye.net/2025/01/23/respect-constitution-church-leaders-challenge-mnangagwa/",
            "content": "By A Correspondent\n\nIn a bold statement, church leaders in Zimbabwe have called on President Emmerson Mnangagwa to respect the constitutional term limits, amid growing calls from some Members of Parliament and political activists urging for an extension of his presidency beyond 2028.\n\nThe Zimbabwe Heads of Christian Denominations (ZHOCD), a coalition of church leaders, expressed deep concern over these proposals, warning that such actions would undermine the Constitution. The call to extend the Presidential Term Limits and postpone the 2028 elections is an invitation for the President to be a co-conspirator in overthrowing the Constitution of the Country which the President is elected to uphold, respect and defend, the ZHOCD declared in a statement issued on 21 January 2025.\n\nThe church leaders emphasized that Mnangagwas consistent declarations in defense of the Constitution should be upheld. We take relief from the consistent remarks made by His Excellency on several occasions where he has repeatedly affirmed his commitment to uphold the Constitution of Zimbabwe by committing not to extend his Presidency beyond the Constitutional and legal limits, the statement said. This reinforces the leaders belief that Mnangagwa intends to honor his oath to respect both the Constitution and the rule of law.\n\nThe ZHOCD also reiterated its commitment to promoting democratic values and constitutionalism, urging Mnangagwa to resist pressures for a term extension. As the Church, we encourage the President to adhere to the constitutional term limits, and to support a peaceful transition of power in the year 2028 following free, fair, and credible elections, they added.\n\nThe church leaders warned that extending the presidential term limits could erode public trust in Zimbabwes electoral processes and destabilize the country at a critical time. The proposal to extend presidential term limits may irretrievably erode public trust in the electoral processes in Zimbabwe and would destabilise the country at a time when unity and peace are most needed for our economic and social transformation, the statement emphasized.\n\nAdditionally, the church called for the implementation of electoral reforms to ensure accountability, transparency, and a peaceful transfer of power. We urge the Government to adhere to the electoral timelines as stipulated in the Constitution and ensure that all elections are conducted in a transparent, credible, and peaceful manner, the ZHOCD concluded.\n\nAs the country approaches the 2028 elections, the churchs message is clear: upholding the Constitution and ensuring a peaceful transition of power is essential for Zimbabwes democratic future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold statement, church leaders in Zimbabwe have called on President Emmerson Mnangagwa to respect the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/respect-constitution-church-leaders-challenge-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Respect Constitution, Church Leaders Challenge Mnangagwa\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        },
        {
            "title": "ZIMRA Targets USD 7 Billion Tax Revenue",
            "url": "https://www.zimeye.net/2025/01/23/zimra-targets-usd-7-billion-tax-revenue/",
            "content": "By A Correspondent\n\nIn a move that many view as a further burden on already struggling citizens and companies, the Zimbabwe Revenue Authority (ZIMRA) has announced a target to collect over USD 7 billion in taxes this year, following a successful 2024 revenue collection period.\n\nZIMRA Commissioner General, Ms. Regina Chinamasa, revealed that the institution exceeded its 2024 target, collecting over USD 6 billion. We have surpassed our targets for the year, and as we move forward, we have set an even more ambitious target of over USD 7 billion, she stated, underlining that these funds are crucial for government projects and ongoing expenses.\n\nThe revenue collection will come from a range of taxes, including Value Added Tax (VAT), corporate tax, customs duties, Pay As You Earn (PAYE), and mining royalties. These taxes are expected to help sustain capital projects and cover the governments employment costs.\n\nThe focus is on working with taxpayers to generate more revenue, Chinamasa emphasized, suggesting that the governments strategy involves pushing harder on the already burdened public and businesses. She also highlighted that Zimbabwes tax collection ability has grown, saying, Zimbabwe has what it takes in terms of resource mobilisation and revenue generation. We are using all the relevant instruments to collect more taxes.\n\nHowever, many citizens and businesses are struggling to cope with the rising cost of living, inflation, and a fragile economy. Critics argue that the governments continued tax hikes, including the anticipated surge in revenue collections, will further squeeze the pockets of the already suffering population. While ZIMRA sees this as a positive trajectory, many citizens and businesses feel they are being milked dry with taxes that are unsustainable, one economic analyst noted.\n\nAdditionally, despite international financial support accounting for at least 20% of Zimbabwes national budget, it remains subdued, and the countrys domestic resource mobilisation remains key. Chinamasa further stressed, It is our mandate to ensure government projects are adequately funded, and we will continue focusing on long-term measures to boost revenue inflows.\n\nIn line with the countrys devolution agenda, a portion of the tax revenue will be directed toward infrastructure development across Zimbabwe, but it remains to be seen whether these projects will benefit the majority of citizens who are already struggling to make ends meet.\n\nThe anticipated rise in revenue collections is also expected to rely heavily on increased compliance from industry and commerce, reduced revenue leakages, and improved economic conditions, including a favorable summer cropping season. But with many facing dire economic challenges, the governments heavy-handed taxation policies are likely to remain a contentious issue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that many view as a further burden on already struggling citizens and companies, the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/23/zimra-targets-usd-7-billion-tax-revenue/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA Targets USD 7 Billion Tax Revenue\"</span></a></p>",
            "time": "06:37",
            "date": "24 Jan 2025"
        }
    ]
}