{
    "news": [
        {
            "title": "VP Chiwenga Takes Over Power",
            "url": "https://www.zimeye.net/2025/09/07/vp-chiwenga-takes-over-power/",
            "content": "By A Correspondent Vice President Constantino Chiwenga has assumed the role of Acting President following President Emmerson Mnangagwas trip to Eswatini, where he is officiating at the Kingdoms 57th International Trade Fair and attending the Umhlanga Reed Dance ceremony.\n\nMnangagwa, who arrived in Eswatini over the weekend, used the visit to strengthen bilateral ties, stressing the importance of cooperation in agriculture, tourism, trade, education, science, innovation, and technology. He also encouraged Eswatinis citizens to visit and invest in Zimbabwe, reiterating his now-familiar mantra:Zimbabwe is open for business.\n\nThe President further called on Africans to take pride in their heritage and to push for reforms in global institutions such as the United Nations, while thanking Eswatini for its consistent support in calling for the removal of Western sanctions on Zimbabwe. King Mswati III, in turn, applauded Zimbabwes Vision 2030 and development initiatives, promising that Eswatini would learn from Zimbabwes experiences.\n\nAlthough Mnangagwas trip is an ordinary diplomatic assignment, Chiwengas assumption of presidential powers rekindles memories of Zimbabwes unresolved succession battles within Zanu PF. The ruling party has been plagued by factionalism for over two decades, largely rooted in the question of who should lead after long-serving figures.\n\nDuring Robert Mugabes final years, Zanu PF was split between theLacoste faction, loyal to Mnangagwa, and theG40 faction, fronted by Grace Mugabe and younger party elites. That power struggle culminated in the 2017 military coup, which saw Chiwengathen commander of the Zimbabwe Defence Forcesplaying a decisive role in removing Mugabe and installing Mnangagwa as President.\n\nChiwenga, widely seen as the kingmaker of 2017, was initially regarded as the natural successor to Mnangagwa. However, once in power, Mnangagwa consolidated control by sidelining military influence in politics and strengthening his civilian allies. This created an undercurrent of mistrust between the two leaders.\n\nThe unresolved tension resurfaced in the lead-up to the 2023 elections, when whispers of succession battles began to circulate again. Reports suggested that Chiwengas military-backed faction still harbored ambitions of taking over the presidency, while Mnangagwa moved to amend party and national constitutions to potentially extend his stay in power beyond 2028.\n\nThough routine, every instance of Chiwenga stepping in as Acting President is viewed through the lens of Zanu PFs succession politics. His assumption of authority underscores the delicate balance within the ruling party, where leadership transitions remain a source of anxiety and intrigue.\n\nFor many Zimbabweans, the unresolved rivalry between Mnangagwa and Chiwenga represents the continuation of a decades-long pattern: leadership struggles within Zanu PF overshadowing the pressing national crises of economic decline, unemployment, and political repression\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Vice President Constantino Chiwenga has assumed the role of Acting President following President Emmerson Mnangagwa’s trip to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/vp-chiwenga-takes-over-power/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Takes Over Power\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "ZANU PF Accuses Mutarisi Saying He’s Insulted Luxury Train",
            "url": "https://www.zimeye.net/2025/09/07/zanu-pf-accuses-mutarisi-saying-hes-insulted-luxury-train/",
            "content": "ZANU PF Youth leader accuses Mandebvu Tinashe Mutarisi of insulting govt. Did Mutarisi insult the state and not defend it Cde Taurai Kandishaya ?pic.twitter.com/xmS4u3PnFa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "Top Diplomat Dies",
            "url": "https://www.zimeye.net/2025/09/07/top-diplomat-dies-2/",
            "content": "By A Correspondent  One of the countrys respected and top diplomats, Ambassador Stuart Comberbach, has died.\n\nAmbassador Comberbach died of cancer in the UK.\n\nHe was 72.\n\nThe announcement was made by Acting President Dr Constantino Chiwenga, who described Comberbach as a rare patriot whose career spanned nearly five decades of loyal service to the nation.\n\nDuring his five decades of professional service to the Government, Ambassador Comberbach demonstrated a rare and unwavering commitment to duty, said Acting President Chiwenga. His patriotism was never in question, and he believed that our differences in race, colour, and creed only served to enrich our shared humanity as one family in a unified Zimbabwe.\n\nActing President Chiwenga, speaking on behalf of President Mnangagwa, the First Family, and Government, extended condolences to Comberbachs widow, family, and loved ones, noting that his death was a loss not only to them but to the entire nation.\n\nA career diplomat of exceptional standing, Comberbach served Zimbabwe with distinction in numerous capacities at home and abroad. He represented the country as Ambassador to Italy, Japan, and South Korea, and most recently as Permanent Representative to the United Nations in Geneva, where his voice carried weight in advancing Zimbabwes values and aspirations.\n\nBetween 2018 and 2021, he was Special Advisor to the Minister of Foreign Affairs and International Trade, while from 2014 to 2018, he served as Secretary of the Corporate Governance Unit in the Office of the President and Cabinet.\n\nHis long service portfolio included:\n\nAmbassador Comberbach was widely regarded as a consummate diplomat who combined professionalism with an unwavering belief in dialogue and mutual respect. His career, stretching back to the early years of Zimbabwes independence, reflected a deep commitment to building bridges across nations while defending the countrys sovereignty.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – One of the country’s respected and top diplomats, Ambassador Stuart Comberbach, has died. Ambassador Comberbach died … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/top-diplomat-dies-2/\">Continue reading<span class=\"screen-reader-text\"> \"Top Diplomat Dies\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "President Mugabe Was One of a Kind",
            "url": "https://www.zimeye.net/2025/09/07/president-mugabe-was-one-of-a-kind-2/",
            "content": "By Dr. Masimba Mavaza |  As we remember the African icon, Cde Robert Mugabe, we must also acknowledge the team that worked alongside him. It is impossible to speak of Mugabe without mentioning Cde Innocent D. Tizora, a man who tirelessly served behind the scenes.\n\nInnocent Dzapasi Tizora, a Zimbabwean politician, was the former Principal Director of State Residences. He was relieved of his duties in January 2018 by President Emmerson Mnangagwa and succeeded by Douglas Tapfuma, a Midlands Central Committee member in the ZANU-PF party. Such was the weight of Tizoras position that his departure unsettled State House, as many of his predecessors had been dismissed, with some even arrested and imprisoned. Tizora dedicated himself fully to both government and country. During the September 2018 reshuffle, he was reassigned by President Mnangagwa.\n\nCde Tizora attended Kutama Mission School. As a senior staffer in the Presidents Office, he managed state residences under the Mugabe administration and was listed under the thematic group Senior Civil Servants. Though the nation may be quick to forget him, Tizora remains one of the finest Principal Directors to have ever served at State House.\n\nHowever, today, our focus is on the icon himselfCde Robert Mugabe.\n\nThe blood of Zimbabwes heroes flows beneath our freedom, reminding us that every celebration and every fruit of liberty was watered by their sacrifice. This legacy will fade if we fail to remind one another. It is our duty to keep alive the memory of those who secured our independence.\n\nRobert Mugabe (19242019), leader of Zimbabwe from independence in 1980, was one of Africas longest-serving and most admired figures in the earlier part of his rule. Trained as a teacher, he taught at several schools before moving to Ghana, where he furthered his profession and met the beloved First Lady, Sally Mugabe.\n\nHe endured 11 years as a political prisoner under Ian Smiths Rhodesian regime before escaping Zimbabwe in a bread truck driven by Moven Mahachilater Minister of Defencewho tragically died in a car accident in Nyanga. With the help of Cde Sekuru Rekai Tangwena Simboti, Mugabe entered Mozambique through Nyanga, soon becoming leader of the Zimbabwe African National Union (ZANU). He played a crucial role in the 1979 Lancaster House Agreement, which paved the way for Zimbabwes independence.\n\nMugabe became the countrys first elected Prime Minister and later President. He initially promoted reconciliation with the white minority and unity among liberation comrades. He was the third Prime Minister of the countryafter Ian Smith of Rhodesia and Bishop Abel Muzorewa of Zimbabwe Rhodesiaand the second President of independent Zimbabwe, following Canaan Sodhindo Banana.\n\nMugabe spearheaded the controversial land redistribution program, aimed at empowering black Zimbabweans by taking land from commercial farmers. This policy drew economic sanctions from the West. Despite mounting pressure, Mugabe agreed to a power-sharing deal with the opposition in the 2000s, later describing the period as disastrous. He ruled Zimbabwe for 37 years until stepping down in 2017.\n\nBorn on February 21, 1924, at Katuma Mission (now Zvimba), Mugabe was the son of Gabriel Matibili, a carpenter from Nyasaland (now Malawi), and Bona, a Shona woman. After graduating from St. Francis Xavier College in 1945, he spent 15 years teaching in Rhodesia and Ghana, while also pursuing studies at Fort Hare University in South Africa. In Ghana, he married Sally Hayfron, his first wife.\n\nIn 1960, Mugabe joined the pro-independence National Democratic Party as publicity secretary. After its ban, the party re-formed as the Zimbabwe African Peoples Union (ZAPU). Mugabe, however, left in 1963 to co-found ZANU, which became his lifelong political home.\n\nWhen ZANU was banned in 1964, Mugabe was imprisoned. While incarcerated, he earned several degrees by correspondence and educated fellow inmates. Upon his release in 1974, he went into exile in Zambia and Mozambique, where he consolidated control of ZANUs political and military structures.\n\nThe Lancaster House Agreement of 1979 secured independence. After ZANUs electoral victory in 1980, Mugabe extended a hand of reconciliation to the white minority. However, tensions with ZAPU escalated, leading to violent conflict in Matabeleland between 1982 and 1987. Thousands of civilians were killed by Mugabes North Korean-trained Fifth Brigade. Yet, peace was eventually restored through the Unity Accord, merging ZANU and ZAPU into ZANU-PF.\n\nIn the 1990s, Mugabe was reelected twice. Following Sallys death, he married Grace Mugabe. In 1998, he deployed troops to the Democratic Republic of Congo, seeking to resist neo-colonialism.\n\nIn 2000, he held a referendum to expand presidential powers and legalize land seizures. For the first time, he was defeated. Soon after, the MDC was formed, and land invasions accelerated, causing economic collapse and hyperinflation.\n\nIn 2008, after losing the parliamentary majority, Mugabe was forced into a unity government with MDC leader Morgan Tsvangirai. In 2017, he resigned under pressure from impeachment, succeeded by his longtime ally, Cde Dr. Emmerson Mnangagwa.\n\nPresident Mugabe passed away on September 6, 2019, at the age of 95.\n\nMugabe gave his life to something greater than himselfour freedom. This nation will remain free only so long as it is the home of the brave. His legacy is the memory of a great name and the inheritance of a great example.\n\nA true hero does not simply order men into battle; he stands among them. Mugabes courage gave meaning to sacrifice. His memory, like the mellow rays of the setting sun, rests tenderly upon our hearts.\n\nOur heroes were real. They breathed, they felt, and they lived in this land we call Zimbabwe. The legacy of Mugabe reminds us of their sacrifice and courage. His name encouraged generations, and his memory will continue to inspire.\n\nHistory is the memory of a people. Without memory, humanity loses its place. Zimbabwe, therefore, has engraved Mugabes nameand those of other heroesdeep in our collective heart. Since his passing, his presence has never truly left us.\n\nCde Robert Gabriel Mugabe will always be missed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Masimba Mavaza | As we remember the African icon, Cde Robert Mugabe, we must also acknowledge the team … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/president-mugabe-was-one-of-a-kind-2/\">Continue reading<span class=\"screen-reader-text\"> \"President Mugabe Was One of a Kind\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "DJ Fantan Appears To Apologise",
            "url": "https://www.zimeye.net/2025/09/07/dj-fantan-appears-to-apologise/",
            "content": "video loading below\n\nDJ Fantan apologises over a recent scuffle that went viral, and he sayskana pane paka kanganiswa[if theres any error committed], trust me, tirikupagadzirisa[we are fixing it].pic.twitter.com/Qefg7W4lxJ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "Comberbach Dies",
            "url": "https://www.zimeye.net/2025/09/07/comberbach-dies/",
            "content": "Veteran Diplomat Ambassador Stuart Comberbach Dies at 72\n\nBy Farai D Hove | Zimbabwe is mourning the loss of one of its most distinguished diplomats, Ambassador Stuart Harold Comberbach, who has died in the United Kingdom at the age of 72.\n\nActing President Dr Constantino Chiwenga announced the news on Thursday, confirming that Ambassador Comberbach succumbed to cancer-related complications.\n\nIn a statement, Acting President Chiwenga paid tribute to the veteran envoys nearly five decades of service to the nation.\n\nDuring his five decades of professional service to the Government, Ambassador Comberbach demonstrated a rare and unwavering commitment to duty, said Dr Chiwenga.\n\nHis patriotism was never in question, and he believed that our differences in race, colour and creed only served to enrich our shared humanity as one family in a unified Zimbabwe. On behalf of His Excellency the President of the Republic of Zimbabwe, Cde Dr Emmerson Dambudzo Mnangagwa, and the First Family, the Government and ZANU PF party, the entire nation, and on my own behalf, I wish to express my sincere condolences to Mrs Comberbach and the entire family.\n\nAmbassador Comberbachs illustrious career saw him represent Zimbabwe across the globe in senior diplomatic roles. He served as Ambassador to Italy, Japan and South Korea, and later as Zimbabwes Permanent Representative to the United Nations in Geneva.\n\nBeyond diplomacy, he also held high-ranking Government positions, including Special Advisor to the Minister of Foreign Affairs and International Trade (20182021), Secretary of the Corporate Governance Unit in the Office of the President and Cabinet (20142018), and Permanent Secretary in the Ministry of Industry and International Trade (20002003).\n\nHis earlier postings included leading Zimbabwes trade mission in South Africa, serving as Ambassador to Italy and Permanent Representative to the FAO, and heading key departments in the Ministry of Foreign Affairs soon after independence.\n\nAmbassador Comberbach is remembered as a dedicated public servant and respected international diplomat who tirelessly championed Zimbabwes interests on the global stage.\n\nFuneral arrangements are expected to be announced in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Veteran Diplomat Ambassador Stuart Comberbach Dies at 72 By Farai D Hove | Zimbabwe is mourning the loss of one … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/comberbach-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Comberbach Dies\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "Thousands Left Homeless As Land Deal Collapses",
            "url": "https://www.zimeye.net/2025/09/07/thousands-left-homeless-as-land-deal-collapses/",
            "content": "MASVINGO  When bulldozers rolled into Mushandike, Masvingo province, in early 2024, the life that 42-year-old Esther Mativenga had painstakingly built was reduced to rubble within minutes.\n\nIt is like a thief in the night stole everything, she said, her voice breaking. This was not just a house; it was our future. We poured everything we had into it, believing sabhukus word.\n\nMativengas ordeal is part of a growing national crisis in Zimbabwe: the illegal allocation and sale of land by some traditional leaders  known as sabhukus. From Masvingo to Matabeleland, desperate families are being uprooted, defrauded, and left homeless after buying plots that carry no legal standing.\n\nA Nationwide Pattern of Loss\n\nWhile the Mushandike demolitions grabbed headlines, similar tragedies are playing out across the country:\n\nIn Mushandike, carpenter John Mbava lost a newly built four-room house. They took away more than bricks and mortar. They took away our hope, he said.\n\nIn Seke, 49-year-old Jotamu Ruwona paid nearly US$3 000 per hectare to his sabhuku. He later discovered the allocations were fraudulent and that the proceeds were allegedly shared with local officials as kickbacks.\n\nLegal Reality: No Title Deeds, No Rights\n\nLegal experts stress that these transactions are null from the outset. Lawyer Miriam Tose Majome explains:\n\nCommunal land cannot be sold. Under Section 3 of the Communal Lands Act, all land is vested in the President. Section 8 prohibits any sales or transfers without proper authority. Only rural district councils, after consultation with traditional leaders, can allocate land. Chiefs and headmen have no power to sell.\n\nDespite these provisions, many sabhukus issue stamped letters that mimic official RDC documents, creating a false impression of legitimacy. Some buyers never even receive written proof, only verbal promises after payment.\n\nGovernment Crackdown\n\nAuthorities have moved to stem the crisis. Between January and mid-February 2024, Operation No to Land Barons and Illegal Settlements led to 3 775 arrests, with nearly a thousand convictions.\n\nLands Minister Anxious Masuka warned:\n\nIt is a crime to occupy rural State land without authority. All illegal occupiers should vacate immediately or face prosecution.\n\nLocal Government Minister Daniel Garwe reinforced:\n\nChiefs must follow the Constitution and the Communal Lands Act. No land should be sold through sabhuku deals.\n\nA Crisis Driven by Demand\n\nAnalysts say Zimbabwes acute demand for land around growth points and peri-urban areas is fuelling the illegal trade. Cheap prices, ease of purchase, and lack of awareness make rural and peri-urban families vulnerable.\n\nThe result is haphazard, unplanned settlements  modern houses tucked among traditional huts  destabilising communities and straining local authorities.\n\nFor victims like Mativenga, the governments warnings and arrests bring little comfort.\n\nWe trusted our leaders. Now we have nothing, she said quietly, staring at the rubble that was once her family home.- state media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "MASVINGO – When bulldozers rolled into Mushandike, Masvingo province, in early 2024, the life that 42-year-old Esther Mativenga had painstakingly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/thousands-left-homeless-as-land-deal-collapses/\">Continue reading<span class=\"screen-reader-text\"> \"Thousands Left Homeless As Land Deal Collapses\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "Exposing the US11 Million Diversion Denied By PF Emmanuel Mwamba",
            "url": "https://www.zimeye.net/2025/09/07/exposing-the-us11-million-diversion-denied-by-pf-emmanuel-mwamba/",
            "content": "Comment By Tobbius Hamunkoyo- LLB| As a lawyer who has taken time to carefully study, understand, and expose the lies surrounding the so-called $11 million saga, I am compelled to set the record straight. The Patriotic Front (PF) and its mouthpieces, including Emmanuel Mwamba, have gone out of their way to distort facts in order to mislead the Zambian people.\n\nThey claim it is impossible to withdraw such an amount from Turkey, but this is nothing more than a smokescreen designed to cover up corruption that unfolded here at home. The Malanji case was never about armored planes carrying sacks of dollars out of Europe. It was about unexplained wealth and suspicious transactions within Zambia, backed by hard evidence presented in our courts by the National Prosecution Authority (NPA).\n\nThe record of evidence is clear. The National Prosecution Authority (NPA) demonstrated that of the US$7.1 million allocated for property purchases in Turkey, only US$1.1 million was accounted for, while US$4.6 million vanished into unexplained withdrawals, where did it go?. Soon after his return, Joseph Malanji began making massive deposits into Zambian banks.In October 2020, he deposited K10 million in K2 million tranches. In December 2020, he casually walked into the bank with US$204,500 and US$100,000 in cash. By March 2021, he was depositing US$100,000 at a time, and on 31 December 2020, he purchased houses in Silverest Gardens worth US$50,000, paid entirely in cash. These were not theoretical transfers, they were concrete domestic transactions and Emmanuel Mwamba is aware about this despite hiding behind a lot of PF pages to distort the truth.\n\nThe investigations further revealed the quick conversion of these funds into luxury assets. Malanji acquired two helicopters, a Bell 430 and a Bell 206, both traced, frozen, and eventually repatriated to Zambia as proceeds of crime. Several properties purchased under suspicious circumstances were also seized. These are not the figments of PFs imagination or Mwambas propaganda; they are material assets, identified, recovered, and presented before court of competent jurisdiction as part of the prosecutions case.\n\nPFs $11 million lie narrative deliberately omits one key fact, government-to-government transfers do exist, but they must strictly comply with the Public Finance Management Act. This is why former Treasury Secretary Fredson Yamba was convicted, for unlawfully authorising transfers to the Turkey mission outside prescribed financial procedures. So yes, governments can transfer money under special circumstances, but not in violation of the law. PFs attempt to use this argument as a shield for corruption is both dishonest and insulting to Zambians.\n\nI repeat, I have taken time, as a lawyer, to examine this case and expose the truth. Emmanuel Mwamba and PF have tried to confuse the people with half-truths and lies as usual, but the facts remain facts. The corruption was here at home, the money was deposited here, the assets were bought here, and the courts acted on evidence, not speculation. Zambians deserve better than leaders who insult their intelligence with diversions. The $11 million diversion is a failed attempt to rewrite history, and the truth about Malanjis unexplained wealth cannot be erased.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Comment By Tobbius Hamunkoyo- LLB | As a lawyer who has taken time to carefully study, understand, and expose the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/exposing-the-us11-million-diversion-denied-by-pf-emmanuel-mwamba/\">Continue reading<span class=\"screen-reader-text\"> \"Exposing the US11 Million Diversion Denied By PF Emmanuel Mwamba\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "Human Rights Groups Denounce Harassment Of Masvingo Journalist By ZRP Cops",
            "url": "https://www.zimeye.net/2025/09/07/human-rights-groups-denounce-harassment-of-masvingo-journalist-by-zrp-cops/",
            "content": "By A Correspondent\n\nTension gripped Masvingo on Thursday evening after police officers, reportedly accompanied by dogs, allegedly assaulted Masvingo Mirror Chief Photographer Nyasha Mariga while he was carrying out his professional duties.\n\nWitnesses said Mariga was attacked for photographing a mshikashika driver who lay under his vehicle for over an hour in an attempt to prevent it from being impounded. Police allegedly confiscated Marigas camera and cellphone, tore his shirt, and dragged him to Masvingo Central Police Station.\n\nThe heavy-handed actions sparked outrage from onlookers, who later forced the officers to retreat.\n\nThe crowd became uncontrollable and the police had no choice but to run for their lives, said one witness.\n\nIn the chaos, the mshikashika driver managed to speed away as people cheered, while a tow truck that had been called in was chased off after residents threatened to burn it.\n\nA senior employee at the Masvingo Mirror condemned the police actions and demanded Marigas immediate release. *Nyasha has committed no crime.\n\nHe is accredited with the Zimbabwe Media Commission and has every right to be at the scene taking pictures.\n\nHuman rights groups have also weighed in, denouncing the harassment and calling for urgent accountability and protection of journalists.\n\nThe Zimbabwe Republic Police is yet to issue a statement on the incident, and Masvingo police spokesperson Inspector Kudakwashe Dhewa was not immediately available for comment\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tension gripped Masvingo on Thursday evening after police officers, reportedly accompanied by dogs, allegedly assaulted Masvingo Mirror … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/human-rights-groups-denounce-harassment-of-masvingo-journalist-by-zrp-cops/\">Continue reading<span class=\"screen-reader-text\"> \"Human Rights Groups Denounce Harassment Of Masvingo Journalist By ZRP Cops\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        },
        {
            "title": "Chief Hwenje, Vharazipi To Perform At Zanu PF Masvingo Rally",
            "url": "https://www.zimeye.net/2025/09/07/chief-hwenje-vharazipi-to-perform-at-zanu-pf-masvingo-rally/",
            "content": "By A Correspondent\n\nZANU PF has kicked off a major campaign push in Masvingos Ward 7 ahead of the by-election scheduled for 13 September 2025, with party heavyweights expected to attend a mass rally this Sunday.\n\nIn an official statement, Zanu PF Masvingo said all Ward 7 members, supporters, businesspeople, vendors, entrepreneurs, voters, the elderly, youth, women, persons with disabilities, churches, school staff, council workers, and civil servants were urged to attend the rally.\n\nThe statement read: Come in your numbers and show your solidarity as we march together towards a resounding ZANU PF victory!\n\nThe mass rally is set for Sunday, 7 September 2025, at 10:00 AM at Ward 7, Rujeko. The Minister of State Security and Zanu PF Politburo Secretary for Security, Lovemore Matuke, will serve as the guest of honour.\n\nPopular artists Vharazipi and Wenje will provide live entertainment.\n\nZanu PF Masvingo said in a statement: We are mobilising all our supporters to ensure a decisive victory for our candidate, Councillor Simbarashe Shonhiwa. This by-election is crucial for consolidating ZANU PFs stronghold in Masvingo.\n\nThe statement added: We call on all party supporters, local businesses, and community members to attend in large numbers. Forward with ZANU PF! Forward with Victory!\n\nThe by-election on 13 September is expected to be closely contested, and the ruling party is leaving no stone unturned to drum up support and secure a win in Ward 7.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF has kicked off a major campaign push in Masvingo’s Ward 7 ahead of the by-election … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/07/chief-hwenje-vharazipi-to-perform-at-zanu-pf-masvingo-rally/\">Continue reading<span class=\"screen-reader-text\"> \"Chief Hwenje, Vharazipi To Perform At Zanu PF Masvingo Rally\"</span></a></p>",
            "time": "20:25",
            "date": "07 Sep 2025"
        }
    ]
}