{
    "news": [
        {
            "title": "Alvarez’s Disallowed Penalty Sparks Controversy in Champions League Shootout",
            "url": "https://www.zimeye.net/2025/03/13/alvarezs-disallowed-penalty-sparks-controversy-in-champions-league-shootout/",
            "content": "Sports Correspondent\n\nA contentious decision marred the Champions League last-16 shootout between Atletico Madrid and Real Madrid, as Julian Alvarezs successful penalty kick was ruled out.\n\nAlvarez, Atleticos second penalty taker, slipped while taking his shot but still managed to power the ball past Real Madrid goalkeeper Thibault Courtois.\n\nHowever, a VAR review deemed the goal invalid, citing that Alvarez had touched the ball with both feet as he fell.\n\nThe decision, which took one minute and eight seconds to be made, has sparked debate over whether Alvarez had indeed broken the rules.\n\nThe incident has added to the controversy surrounding VAR decisions in high-stakes matches.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent A contentious decision marred the Champions League last-16 shootout between Atletico Madrid and Real Madrid, as Julian Alvarez’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/alvarezs-disallowed-penalty-sparks-controversy-in-champions-league-shootout/\">Continue reading<span class=\"screen-reader-text\"> \"Alvarez’s Disallowed Penalty Sparks Controversy in Champions League Shootout\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Alarm As Cholera Kills 8 In Mash Central",
            "url": "https://www.zimeye.net/2025/03/13/alarm-as-cholera-kills-8-in-mash-central/",
            "content": "By A Correspondent\n\nCholera has resurfaced in Mashonaland Central Province, with 340 confirmed cases across six out of eight districts.\n\nThe outbreak has raised serious concerns, particularly due to the presence of illegal miners along the Mazowe River, whose activities are believed to be contaminating the water supply and exposing thousands to the disease.\n\nDr. Douglas Mombeshora, the Minister of Health and Child Care, along with Ministry officials, visited Matope Clinic in Mt Darwin, where three cholera patients are receiving treatment at the designated treatment center. The purpose of the visit is to assess the situation on the ground and to put in place strategies to curb the diseases spread.\n\nReports indicate that 68 cases have been verified, and the death toll stands at eight, leading to a case fatality rate of 2.4%.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Cholera has resurfaced in Mashonaland Central Province, with 340 confirmed cases across six out of eight districts. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/alarm-as-cholera-kills-8-in-mash-central/\">Continue reading<span class=\"screen-reader-text\"> \"Alarm As Cholera Kills 8 In Mash Central\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Nakamba To Remain Warriors Captain Despite Musona’s Return",
            "url": "https://www.zimeye.net/2025/03/13/nakamba-to-remain-warriors-captain-despite-musonas-return/",
            "content": "Sports Correspondent\n\nWarriors coach Michael Nees has confirmed that Marvelous Nakamba will retain the team captaincy, despite the return of Knowledge Musona.\n\nNees emphasized that Nakambas leadership role is unaffected by Musonas comeback. He praised Nakambas character, saying he has consistently demonstrated the qualities of a dependable captain.\n\nMarshall Munetsi will continue to serve as the teams vice-captain, providing support to Nakamba in leading the Warriors.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors coach Michael Nees has confirmed that Marvelous Nakamba will retain the team captaincy, despite the return of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/nakamba-to-remain-warriors-captain-despite-musonas-return/\">Continue reading<span class=\"screen-reader-text\"> \"Nakamba To Remain Warriors Captain Despite Musona’s Return\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "About Passengers’ Safety",
            "url": "https://www.zimeye.net/2025/03/13/about-passengers-safety/",
            "content": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a common practice, this situation poses serious risks to passengers and needs to be addressed by authorities.\n\nOne of the main dangers of overcrowded buses is the excessive weight that is placed on the vehicle.\n\nWhen a bus is overloaded, it becomes harder for the driver to maintain control, especially when navigating sharp turns or sudden stops. In the event the driver is forced to apply the emergency brake, passengers who are standing are at risk of falling and sustaining injuries due to the lack of support.\n\nMoreover, standing passengers are more vulnerable to accidents in the event of sudden maneuvers.\n\nThey lack the security of a seat belt or a steady handrail, making them more likely to be thrown off balance and potentially hurt in an accident. The possibility of injury only increases when buses are traveling at high speeds or during congested traffic conditions.\n\nThe safety of passengers should always be a priority, and overloading buses compromises this fundamental principle. Passengers deserve a safe and secure journey, and it is crucial for bus operators and regulatory authorities to enforce strict guidelines on vehicle capacity to prevent overloading.\n\nTo mitigate these risks, authorities should consider increasing inspections of public transportation systems and impose fines for overloading violations. Moreover, bus companies must adhere to regulated passenger limits and ensure that all safety protocols are followed to protect the well-being of those traveling.\n\nIn conclusion, the practice of overloading buses is not only illegal but extremely dangerous. It is essential for both passengers and authorities to recognize the risks involved and work together to prioritize safety in public transport.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Overloading buses to the point where passengers are standing is becoming an increasing safety hazard. While it may be a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/about-passengers-safety/\">Continue reading<span class=\"screen-reader-text\"> \"About Passengers’ Safety\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Geza Effect: Mnangagwa’s Administration Removes Vendors From Streets In Fear Of Protests",
            "url": "https://www.zimeye.net/2025/03/13/geza-effect-mnangagwas-administration-removes-vendors-from-streets-in-fear-of-protests/",
            "content": "By A Correspondent\n\nThe Zimbabwean government has issued a 48-hour ultimatum for local authorities to remove illegal vendors, particularly those operating at night, from undesignated spaces across cities and towns.\n\nThis crackdown, set to be enforced with the aid of law enforcement agencies, has ignited a heated debate.\n\nWhile the government justifies the move as a necessary measure for public health and safety, the deeper issue behind the proliferation of informal markets remains the countrys soaring unemployment rate.\n\nThe question now is whether these severe actions will truly revive the nations struggling economy, or if they will stoke further unrest.\n\nMinister of Local Government and Public Works, Daniel Garwe, expressed concern over what he described as serious health, safety, and security concerns related to the rise in unregulated markets.\n\nHe claimed that these unregulated spaces were not only disrupting registered businesses but were also creating unsanitary conditions that could lead to diseases such as cholera and typhoid. The mushrooming of unregulated marketplaces has disrupted legally registered businesses, Garwe remarked, adding that the expansion of the informal sector was fostering unfair competition and increasing unsanitary conditions.\n\nDespite these claims, Garwes comments fail to address the root cause of the issuethe countrys severe unemployment crisis. With the formal economy failing to provide enough job opportunities, many Zimbabweans, especially the youth, have turned to street vending as their only means of survival. These vendors are not criminals; they are citizens who have been left with no alternative in a deteriorating economy. Its not merely a question of public healthits about the economic desperation that forces people to seek any means of livelihood.\n\nWhats even more telling is the backdrop of fear and insecurity within President Emmerson Mnangagwas administration.\n\nThe governments decision to crack down on street vendors is widely seen as a direct response to rising tensions and growing dissent among the population.\n\nWar veteran Blessed Geza, in particular, has vowed to mobilize protests, threatening to organize public demonstrations against the regime.\n\nThis move by the Mnangagwa regime is seen as an effort to stave off potential unrest.\n\nThe authorities seem increasingly aware that their grip on power is slipping, and Gezas vow to stir protests underscores their growing fear of a popular uprising.\n\nAs the government pushes forward with its plans, the question remains whether these measures will quell the discontent or fuel further opposition.\n\nThe actions against vendors may be a short-term attempt to restore order, but the root causes of the unresteconomic hardship and lack of opportunityremain deeply entrenched.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwean government has issued a 48-hour ultimatum for local authorities to remove illegal vendors, particularly those … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/geza-effect-mnangagwas-administration-removes-vendors-from-streets-in-fear-of-protests/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Effect: Mnangagwa’s Administration Removes Vendors From Streets In Fear Of Protests\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "THE RISE OF THE ALLIANCE OF SAHEL STATES:A NEW ERA IN WEST AFRICAN GEOPOLITICS",
            "url": "https://www.zimeye.net/2025/03/13/the-rise-of-the-alliance-of-sahel-statesa-new-era-in-west-african-geopolitics/",
            "content": "The Sahel region, long plagued by instability, terrorism, and economic marginalization, has witnessed a transformative shift with the emergence of the Alliance of Sahel States (AES).\n\nThe long-awaited solution to Africans sitting on mineral wealth, yet called poor nations per happiness indexes in the world narrative, is changing in the AES.\n\nComprising Mali, Niger, and Burkina Fasothree nations governed by military-led regimes following a peoples inspired coups between 2020 and 2023the AES represents a bold challenge to the status quo in West Africa.\n\nIts formal establishment in January 2025, building on a 2023 mutual defense pact, marks a decisive break from the Economic Community of West African States (ECOWAS), underscoring deepening disillusionment with the blocs perceived alignment with Western interests and inadequate response to regional crises.\n\nThis realignment signals a redefinition of sovereignty, security, and economic autonomy in a region grappling with existential threats.\n\nDistressfully, for how long can the sovereign states who claim to have gained political independence from colonial dominion in Africa continue to be abused through neo-colonial elitist puppets in government?\n\nContext:Crisis, Coups, and the Birth of the AES-\n\nThe AES emerged against a backdrop of escalating jihadist violence, weak governance, and public frustration with foreign intervention.Mali (2020, 2021),Burkina Faso (2022), and Niger (2023) experienced military takeovers that ousted governments accused of failing to protect citizens and overly reliant on former colonial power France.\n\nECOWAS, which had long positioned itself as a guardian of democratic norms, responded with sanctions and ultimatums, further alienating the juntas.\n\nBy 2023, the trio solidified a mutual defense pact, vowing collective resistance to external pressure and jihadist threats.\n\nThis evolved into the AES in 2025, framed as a pragmatic alliance prioritizing sovereignty and grassroots security over institutional diplomacy.\n\nECOWAS Under Scrutiny:A Crisis of Legitimacy-\n\nThe AESs withdrawal from ECOWAS has exposed systemic flaws within the 50-year-old bloc:\n\nThe CFA franc, pegged to the euro and overseen by France, remained a symbol of enduring colonial-era economic ties.\n\nReflectively, the ECOWAS should not deviate from its healthy original mandate and constitute itself into a puppetry neo-colonial elitist boardroom.Instead, it should stay true to its original objectives to serve the broad interests of Africans.\n\nEven voices within ECOWAS, like Ghanaian President John Mahama, acknowledged a ruptured trust requiring urgent repair.\n\nThe AES Vision: Sovereignty, Security, and Solidarity-\n\nPositioning itself as a bank of hope for marginalized populations, the AES outlines an ambitious agenda:\n\n Collective Security:A 5,000-strong joint force aims to combat terrorism independently, reducing reliance on foreign troops (e.g., Frances withdrawn Operation Barkhane and the EUs Takuba Task Force).Early operations in 2024 targeted jihadist strongholds along the Mali-Burkina border, though efficacy remains uneven.\n\n Economic Decolonization:Plans to replace the CFA franc with a Sahelian currency by 2027 seek to assert monetary sovereignty.While details are scarce, the move aligns with broader anti-French sentiment and echoes regional precedents (e.g., Guineas 1960 CFA exit).\n\n Cultural Unity:Shared language policies (promoting indigenous languages alongside French) and cross-border educational initiatives aim to foster a cohesive Sahelian identity.\n\nChallenges and Geopolitical Implications-The AESs rise carries profound risks and opportunities:\n\nToward a New Regional Order?\n\nThe AES embodies a broader rejection of post-colonial hierarchies, demanding agency in security and economic policies.While its long-term viability is certain, the alliance has compelled ECOWAS to rethink.\n\nProposals for a two-tier ECOWAS, offering associate membership to AES states, and dialogues on shared counterterrorism goals suggest tentative steps toward coexistence.\n\nFor the Sahel, the AESs success hinges on delivering tangible security and economic gains to its populace.\n\nFor West Africa, it is a wake-up call:Regional institutions must evolve to address grassroots aspirations or risk irrelevance.In this turbulent era, the Sahels fate will reverberate far beyond its borders.\n\nBravo to the Sahelian redemptive transformational leadership. The people of Africa are with you wholeheartedly  being the nucleus of the New Africa.\n\nBenjamin Anyagre Aziginaateeg,CEO, AfriKan Continental Union Consult -ACUC-\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Sahel region, long plagued by instability, terrorism, and economic marginalization, has witnessed a transformative shift with the emergence of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/the-rise-of-the-alliance-of-sahel-statesa-new-era-in-west-african-geopolitics/\">Continue reading<span class=\"screen-reader-text\"> \"THE RISE OF THE ALLIANCE OF SAHEL STATES:A NEW ERA IN WEST AFRICAN GEOPOLITICS\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Horror As Woman Kills Husband With Pot",
            "url": "https://www.zimeye.net/2025/03/13/horror-as-woman-kills-husband-with-pot/",
            "content": "By A Correspondent\n\nA shocking incident of domestic violence has left a community reeling after a woman fatally struck her husband with a pot during a heated argument.\n\nTragedy struck in the early hours of March 7 when a marital dispute turned deadly. Sandra Ndoyiwa, 31, allegedly attacked her husband, Nixon Jemedze, 50, with a small black Kango pot, inflicting severe head injuries.\n\nThe altercation, which occurred in their Glen View home, was reportedly sparked by accusations of infidelity.\n\nThe force of the blows left Nixon with deep cuts to the forehead and the back of his head, ultimately leading to his demise.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking incident of domestic violence has left a community reeling after a woman fatally struck her … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/horror-as-woman-kills-husband-with-pot/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Woman Kills Husband With Pot\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Chivayo Boasts of Buying Expensive Car for Personal Cook",
            "url": "https://www.zimeye.net/2025/03/13/chivayo-boasts-of-buying-expensive-car-for-personal-cook/",
            "content": "By A Correspondent\n\nControversial businessman Wicknell Chivayo has made headlines once again, this time boasting about his wealth by gifting brand new vehicles to his cook and personal helpers. Over the weekend, Chivayo proudly shared the news on social media, revealing that he had bought them new Mercedes-Benz cars.\n\nI gifted my cook and helpers with brand new Mercedes-Benz gifts, Chivayo wrote, showcasing his generosity. He continued, highlighting the contributions of his staff, saying, Kubva Kune Vanowacha Magemenzi Vanomhanya nechikafu PaSowe Security Yavo Pamasowe NeUmwe Welogistics.\n\nChivayos lavish display of wealth comes at a time when he remains a highly controversial figure in Zimbabwe. The businessman, known for his ties to Zanu PF, is accused of looting state funds, with critics alleging that he took advantage of his proximity to President Emmerson Mnangagwa. His extravagant gifts to his staff seem to further fuel the perception that Chivayos wealth is built on questionable practices.\n\nWhile Chivayos actions have sparked mixed reactions, with some praising his generosity and others condemning the ostentatious display of wealth amidst ongoing economic struggles, he continues to assert his position as a prominent figure in both the business world and political circles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial businessman Wicknell Chivayo has made headlines once again, this time boasting about his wealth by gifting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/chivayo-boasts-of-buying-expensive-car-for-personal-cook/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Boasts of Buying Expensive Car for Personal Cook\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Mnangagwa Regime Targets Critics As Chivhu Councillor Is Arrested For Cyber Bullying",
            "url": "https://www.zimeye.net/2025/03/13/mnangagwa-regime-targets-critics-as-chivhu-councillor-is-arrested-for-cyber-bullying/",
            "content": "The Mnangagwa regime has intensified its onslaught against dissent by arresting and prosecuting perceived enemies of PresidentEmmerson Mnangagwaand his ruling ZANU PF political party.\n\nZimbabwe Republic Police(ZRP) officers on Wednesday 12 March 2025 arrested and detainedIshmael Maukazuva, the Councillor for Ward 12 in Chivhu in Mashonaland East province, whom they accused of cyber-bullying and harassment.\n\nZRP officers accused Maukazuva of contravening the Data Protection Act, when he allegedly forwarded on a residents WhatsApp group, a video footage showing a woman allegedly criticising President Mnangagwa for reportedly mismanaging the economy and also passing on some insulting message against the ZANU PF political party leader.\n\nMaukazuva, who is represented byPaidamoyo SaurombeofZimbabwe Lawyers for Human Rights, was detained overnight at a police station in Chivhu and was expected to appear at Chivhu Magistrates Court on Thursday 13 March 2025.\n\nMaukazuva becomes the latest person to be arrested and charged on charges related to insulting President Mnangagwa among several people, who have been targeted by Zimbabwean authorities, who of late have intensified a clampdown against criticism of the countrys leader.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Mnangagwa regime has intensified its onslaught against dissent by arresting and prosecuting perceived enemies of President Emmerson Mnangagwa and his ruling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/mnangagwa-regime-targets-critics-as-chivhu-councillor-is-arrested-for-cyber-bullying/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Targets Critics As Chivhu Councillor Is Arrested For Cyber Bullying\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Furore As Masvingo City Council Municipal Police Officers Torment Vendors",
            "url": "https://www.zimeye.net/2025/03/13/furore-as-masvingo-city-council-municipal-police-officers-torment-vendors/",
            "content": "By A Correspondent\n\nThere is chaos in the  city of Masvingo as municipal police officers from the city council have been accused of tormenting street vendors.\n\nThe crackdown comes as part of a broader government directive for local authorities to clear vendors from the streets within 48 hours.\n\nThe government has justified this drastic move, blaming vendors for disrupting normal business operations in the Central Business District (CBD).\n\nHowever, many believe the decision is rooted in political concerns, particularly with the growing possibility of widespread protests.\n\nPolitical analysts suggest that the government, led by President Emmerson Mnangagwa, is fearful of the growing unrest after war veteran Blessed Gezas recent declaration that Mnangagwa must step down.\n\nGeza vowed, If Mnangagwa doesnt resign, the people will take to the streets in protest, fueling fears within the administration of an impending popular uprising.\n\nVendors, who rely on their street businesses for survival, expressed their deep frustration with the governments harsh stance. One vendor, visibly upset, shared, This is too much. We have no jobs, no opportunities. Vending is the only way we can feed our families. How are we supposed to survive now? Another vendor added, The council doesnt understand that were not criminals; we are just trying to make a living in a failing economy.\n\nWhile the government claims the measure is necessary for maintaining order and hygiene, the move has only intensified feelings of injustice among the vendors. As the crackdown intensifies, the city of Masvingo, once calm and quiet, now finds itself on the edge of a simmering conflict, as both political tensions and economic desperation continue to rise.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent There is chaos in the city of Masvingo as municipal police officers from the city council have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/13/furore-as-masvingo-city-council-municipal-police-officers-torment-vendors/\">Continue reading<span class=\"screen-reader-text\"> \"Furore As Masvingo City Council Municipal Police Officers Torment Vendors\"</span></a></p>",
            "time": "06:29",
            "date": "14 Mar 2025"
        }
    ]
}