{
    "news": [
        {
            "title": "Dubious PhD Titles Dominate ZANU PF Mutare Conference",
            "url": "https://www.zimeye.net/2025/10/21/dubious-phd-titles-dominate-zanu-pf-mutare-conference/",
            "content": "By Tendai Ruben Mbofana-The just-ended ZANU PF National Peoples Conference in Mutare  which concluded on Saturday  was less a display of political intellect and more a parade of questionable academic titles. What stood out most during the proceedings was not the party resolutions or ideological debates, but the glaring obsession with the prefix Doctor among senior party figures.\n\nFrom the presidium to cabinet ministers and senior bureaucrats, nearly every name plaque on the high table bore the honorific Dr. It was as though the ruling party had convened a symposium of scholars rather than a political conference. Yet, beneath the pomp and the titles lies a troubling irony  the persistent rumours and allegations that some of these doctorates were obtained through dubious means, including plagiarized theses and compromised academic institutions trading degrees for political favour.\n\nThis fixation with PhD titles has become a defining feature of Zimbabwes political elite. The phenomenon, now bordering on the absurd, reveals a deeper malaise within the nations leadership culture: the use of academic credentials as a substitute for legitimacy and competence. The more government officials fail to deliver tangible results, the more they seem to seek refuge in academic decoration.\n\nIn much of the developed world, political leaders seldom flaunt doctorates. Only one U.S. president, Woodrow Wilson, ever held a PhD, yet leadership excellence in countries like the UK, Canada, and Germany has never depended on academic titles. In Zimbabwe, however, the opposite prevails  a regime overpopulated with Doctors presiding over collapsing hospitals, failing infrastructure, and a deteriorating economy.\n\nIf PhDs were truly a measure of wisdom and problem-solving capacity, Zimbabwe would be among the best-governed countries in the world. Instead, the proliferation of titles has coincided with deepening poverty, corruption, and policy paralysis. The title Doctor has been reduced to a vanity accessory  an ego booster for leaders desperate for validation and respectability in the face of failure.\n\nA true doctorate demands rigorous research, critical thinking, and the production of new knowledge. Yet within ZANU PFs political context, the PhD has been stripped of this intellectual dignity, becoming a prop for self-importance and elitism. Governance, unlike academia, is not about defending a thesis but about delivering results  ensuring justice, accountability, and the welfare of citizens.\n\nThe contrast with leaders such as Winston Churchill, Margaret Thatcher, Barack Obama, and Emmanuel Macron  none of whom held doctorates  is telling. Their legitimacy came not from academic certificates, but from vision, pragmatism, and the ability to inspire and transform their nations.\n\nBy contrast, Zimbabwes so-called Doctors appear more comfortable reciting jargon-laden speeches than addressing citizens real problems. They weaponise education as a symbol of status rather than a tool for transformation. In a country where basic services have collapsed and citizens struggle to survive, the obsession with titles underscores the gap between appearance and performance.\n\nThe conference, which ended on Saturday, culminated in a resolution that barely touched on policy substance or innovation  a document that, ironically, did not even attempt to reflect the intellectual depth expected from a gathering of so many PhD holders. It was yet another reminder that in Zimbabwean politics, the title Doctor has become a hollow credential  a symbol of intellectual arrogance masking practical incompetence\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tendai Ruben Mbofana-The just-ended ZANU PF National People’s Conference in Mutare — which concluded on Saturday — was less … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/dubious-phd-titles-dominate-zanu-pf-mutare-conference/\">Continue reading<span class=\"screen-reader-text\"> \"Dubious PhD Titles Dominate ZANU PF Mutare Conference\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "🟥 CHINYOKA vs MAHERE HIGH COURT CASE HCH3060/22",
            "url": "https://www.zimeye.net/2025/10/21/%f0%9f%9f%a5-chinyoka-vs-mahere-high-court-case-hch3060-22/",
            "content": "Lawyer Outlines Real-Life Damage From Defamation Tweet\n\n Harare | 21 October 2025\n\nBy Court Correspondent | ZimEye\n\nCase Update\n\nThe following are some key matters in the High Court of Zimbabwe defamation battle between lawyers Tinomudaishe Chinyoka and Fadzayi Mahere, following an emotional hearing on 30 September 2025 before Justice Munangati-Manongwa J in Court L.\n\nFiled under Case No. HCH3060/22, the matter remains open.\n\nMahere is listed as represented by Harrison Nkomo (Mhishi Nkomo Legal Practice) and Chinyoka by Shingai Israel Mutumbwa (Mutumbwa Mugabe & Partners).\n\nKEY TAKEAWAYS\n\n1 Lost Income & Career Opportunities\n\nSince the tweet was made, I have not received the same number of briefs,\n\nsaid Chinyoka, adding that at least two lawyers refused to engage him over allegations of corruption.\n\nHe told the court that when the Prosecutor-Generals post opened again, he was told he had to explain himself  effectively ending his candidacy.\n\n2 Psychological & Emotional Impact\n\nIts difficult to convince a potential employer now. The defendant has over 855 000 followers a former MP and champion of integrity. All I wanted was a retraction.\n\nHe said the stench of corruption still follows him, causing stress and anxiety.\n\nIt affects my business, my family, and my mental health.\n\n3 Family Embarrassment\n\nTwo of his daughters confronted him after seeing the tweet.\n\nThey asked, What is this? Unless the defendant publicly retracts, the damage remains, he testified.\n\n4 Collapse of Community Projects\n\nBefore the tweet, Chinyoka ran community programmes in Mberengwa, paying fees for underprivileged girls through public donations.\n\nI ran www.tinochinyoka.com, publishing anti-corruption articles every Tuesday. People trusted me  but donations stopped after the allegation.\n\nThe projects, he said, collapsed completely once public trust was lost.\n\n5 Legal & Social Media Accountability\n\nThe court is expected to make an update soon.\n\nObservers suggest the outcome could set a precedent on social-media responsibility in Zimbabwes legal and political spheres.\n\nTHE COST OF A TWEET\n\n Case No. HCH3060/22 | Justice Munangati-Manongwa J\n\nHearing held 30 Sept 2025 | Next date to be announced\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Lawyer Outlines Real-Life Damage From Defamation Tweet 📍 Harare | 21 October 2025 By Court Correspondent | ZimEye ⚖️  Case … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/%f0%9f%9f%a5-chinyoka-vs-mahere-high-court-case-hch3060-22/\">Continue reading<span class=\"screen-reader-text\"> \"🟥 CHINYOKA vs MAHERE HIGH COURT CASE HCH3060/22\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "Two Feared Dead as Trucks Plunge into Ngezi Bridge",
            "url": "https://www.zimeye.net/2025/10/21/two-feared-dead-as-trucks-plunge-into-ngezi-bridge/",
            "content": "By A Correspondent\n\nTwo people are feared dead aftertwo trucks loaded with chromeplunged intoNgezi Bridgeearlier this morning.\n\nThe trucks, which were travelling fromMberengwa to Zvishavane, reportedly fell into the bridge while attempting to avoid a stationary vehicle, authorities said.\n\nRescue teams were dispatched to the scene to search for survivors and recover the trucks, while the cause of the incident remains under investigation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two people are feared dead after two trucks loaded with chrome plunged into Ngezi Bridge earlier this … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/two-feared-dead-as-trucks-plunge-into-ngezi-bridge/\">Continue reading<span class=\"screen-reader-text\"> \"Two Feared Dead as Trucks Plunge into Ngezi Bridge\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "Mutsvangwa: VP Chiwenga Must Be Thankful He’s Alive",
            "url": "https://www.zimeye.net/2025/10/21/mutsvangwa-vp-chiwenga-must-be-thankful-hes-alive/",
            "content": "video loading below\n\nZANU PF Spokesman Chris Mutsvangwa says Chiwenga is lucky to be alive; he must be grateful,To survive a war its a matter of luck and once you survive, if you begin to see virtue in yourself because you survived the war, then you are not respecting those who remained, becausehttps://t.co/Hn8KhXSFAxpic.twitter.com/XCpe17DJGv\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "ED, Chiwenga Fight-Zim in Constitutional Crisis",
            "url": "https://www.zimeye.net/2025/10/21/ed-chiwenga-fight-zim-in-constitutional-crisis/",
            "content": "By A Correspondent The escalating power struggle betweenPresident Emmerson Mnangagwaand his deputy,Vice President Constantino Chiwenga, has plunged Zimbabwe into aconstitutional and political crisis, as ZANU PF pushes to extend Mnangagwas stay in office until2030 a move critics say threatens the countrys fragile democracy and exposes widening fissures within the ruling party.\n\nAt its22nd Annual National Peoples Conferencein Mutare last Saturday, ZANU PF reaffirmed its controversial resolution to extend Mnangagwas current term beyond2028 to 2030, with Justice Minister and party legal secretaryZiyambi Ziyambirevealing that the Ministry of Justice hadbeen directedtofast-track constitutional amendmentsby October 2026.\n\nIf adopted, the amendment would effectively cancel the2028 presidential election, stretching Mnangagwas second term  due to end in 2028  by an additional two years. The move isbeing justifiedas aligning his leadership with his Vision 2030 economic blueprint, but analysts warn its a veiled attempt toundermine constitutionalism and entrench personal rule.\n\nThe proposal deepensfactional tensionswithin ZANU PF, with insiders suggesting that Mnangagwas allies are attempting to neutralizeChiwengas presidential ambitionsahead of the next election cycle. The former army general, who played a key role in ousting Robert Mugabe in 2017, is reportedly opposed to any extension that would delay his own succession prospects.\n\nLegal experts have raised alarm over the implications of the planned constitutional amendment. Under Zimbabwes2013 Constitution, a president can serve only two terms. Changing this provision would requirea constitutional amendment, and potentiallytwo referendums, according to constitutional lawyers.\n\nHowever, former ZANU PF strategistProfessor Jonathan Moyohas argued that the party could lawfullyextend Mnangagwas current term without a referendum, by amendingSection 95(2)(b), which defines the length of the presidential term, rather than alteringSection 91(2), which limits the number of terms. With a two-thirds parliamentary majority and a fragmented opposition, ZANU PF has the political numbers to push through the change.\n\nCritics say this interpretation amounts toconstitutional manipulation, a tactic long used to maintain elite power under the guise of legal reform.\n\nThe resolution has nothing to do with the working class and peasantry, saidNgqabutho Nicholas Mabhena, general secretary of theZimbabwe Communist Party (ZCP).\n\nThis is about the looting class entrenching itself to continue plundering national resources. We condemn this action and call for the right of Zimbabweans to elect a leader of their choice in 2028.\n\nPolitical analystMxolisi Ncubeechoed similar sentiments, warning that extending Mnangagwas term prolongs the suffering of Zimbabweans already facing economic hardship and political repression.\n\nDespite his many promises in 2017, Mnangagwa has failed to unite the country, curb corruption, or reform state institutions, Ncube said. Even his deputy, Chiwenga, has accused him of surrounding himself with corrupt individuals who are milking Zimbabwe dry.\n\nPolitical commentatorDr. Vusumuzi Sibandadescribed the development as the climax of constitutional mutilation, warning that it could mark the beginning of the end for ZANU PF.\n\nMnangagwa has been systematically weakening the Constitution since 2017, Dr. Sibanda said. This attempt to extend his term is another step in reverting Zimbabwe to authoritarian rule under a legal disguise.\n\nHe likened Zimbabwes trajectory to other African countries where leaders extended their rule through technical amendments  includingUgandas Yoweri Museveni,Rwandas Paul Kagame,Ivory Coasts Alassane Ouattara, andBurundis Pierre Nkurunziza all of whom manipulated term limits to prolong their stay in power.\n\nDr. Sibanda added that the five-year presidential term is already too long, arguing that if a leader cannot deliver in five years, extending their term only extends failure.\n\nReligious leaders have also weighed in, warning of the moral and constitutional consequences of tampering with the supreme law.\n\nOrdinarily, this would be an internal party issue, but it strikes at the heart of our national unity and constitutional democracy, saidReverend Kenneth Mtatain a post on X (formerly Twitter).\n\nIf the president accepts this, he risks losing any legacy as a constitutionalist. Manipulating constitutional limits weakens institutions and could plunge the nation into instability.\n\nFrom the opposition,Gladys Kudzaishe Hlatywayowarned that allowing the 2030 plan to pass would reverse the democratic progress made after Robert Mugabes ouster.\n\nThe attempt by ZANU PF to extend President Mnangagwas term must be vehemently resisted, she said. We fought hard for term limits  never again must Zimbabwe allow dictatorship to return under constitutional disguise.\n\nAs Mnangagwa and Chiwengassuccession battle intensifies, Zimbabwe stands at a constitutional crossroads  torn between those seeking democratic renewal and those determined to rewrite the law in their favour. Observers warn that how this conflict unfolds may determine not justwho rules Zimbabwe, butwhether the rule of law survives at all.\n\n-CITE\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The escalating power struggle between President Emmerson Mnangagwa and his deputy, Vice President Constantino Chiwenga, has plunged Zimbabwe into a constitutional … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/ed-chiwenga-fight-zim-in-constitutional-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"ED, Chiwenga Fight-Zim in Constitutional Crisis\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "Mutsvangwa, Tagwirei In Shocking Anti-VP Chiwenga Alliance",
            "url": "https://www.zimeye.net/2025/10/21/mutsvangwa-tagwirei-in-shocking-anti-vp-chiwenga-alliance/",
            "content": "By A Correspondent Former rivals Christopher Mutsvangwa and businessman Kuda Tagwirei have stunned observers by joining forces in a calculated bid to block Vice President Constantino Chiwengas presidential ambitions.\n\nThe dramatic reunion was capturedat the partys national conference in Mutare, where the two men  once bitter foes  exchanged a warm embrace, signalling a new political alliance forged by expediency rather than friendship.\n\nFor years, Mutsvangwa and Tagwirei had been fierce competitors for influence and access to state resources. Mutsvangwa, a liberation war veteran and former presidential adviser, sought control of Zimbabwes lucrative fuel supply through his interest in the Feruka Pipeline from Mozambique. His ambitionswere thwartedby Tagwirei, the powerful Sakunda Holdings boss and close ally of President Emmerson Mnangagwa, whose dominance of the fuel sector under the Command Agriculture programme secured him immense political leverage.\n\nTheir rivalry exploded in 2018 when Tagwirei allegedly bankrolled independent candidate Temba Mliswas campaign against Mutsvangwa in Norton. Mliswas landslide victorywas widely interpretedas Tagwireis revenge  and a warning to anyone challenging his growing influence.\n\nNow, in a remarkable twist, political survival appears to have united the two against a shared enemy  Vice President Chiwenga. Once the kingmaker of the 2017 coup that installed Mnangagwa, Chiwenga has sincebeen increasingly sidelinedas the president consolidates his grip on power.\n\nSources within ZANU PF say Mnangagwa loyalists, including Mutsvangwa and war veterans leader Douglas Mahiya, have formed a united front to block Chiwengas rise. Tagwirei, whose vast business empire depends on government patronage, is said to have thrown his weight behind the same faction to secure his economic interests and maintain presidential favour.\n\nAt the just-ended Mutare conference, delegates endorsed Mnangagwas term extension from 2028 to 2030  a move widely viewed as a direct blow to Chiwengas succession hopes. Justice Minister Ziyambi Ziyambi, one of Mnangagwas staunchest allies, read out the controversial resolution as Mutsvangwa and Tagwireis symbolic embrace sealed the new power pact.\n\nFormer Norton MP Temba Mliswa, now aligned with Mnangagwas camp, summed up the political realignment in a social media post:\n\nInteresting images from the ZANU PF Conference reveal how alignment of interests is more permanent than enmity. In politics, there are no permanent enemies, only permanent interests.\n\nThe MutsvangwaTagwirei handshake thus encapsulates the fluid nature of Zimbabwean politics  where alliances shift with the winds of power, and yesterdays rivals become todays allies in the relentless struggle for dominance, wealth, and survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —Former rivals Christopher Mutsvangwa and businessman Kuda Tagwirei have stunned observers by joining forces in a calculated … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/mutsvangwa-tagwirei-in-shocking-anti-vp-chiwenga-alliance/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa, Tagwirei In Shocking Anti-VP Chiwenga Alliance\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "US$10 Million Gold Leaks From Mnangagwa’s Home Town",
            "url": "https://www.zimeye.net/2025/10/21/us10-million-gold-leaks-from-mnangagwas-home-town/",
            "content": "By A Correspondent  In what appears to be yet anotherGold Mafia-style scandal, gold worth at least US$10 million has reportedly been siphoned from Kwekwe, President Emmerson Mnangagwas home town, through a sophisticated smuggling network involving local and foreign business partners.\n\nAt least 120 kilogrammes of gold, valued at over US$10 million, vanished into the black market in less than two years under the watch of a mining syndicate that operated under the guise of legitimacy within Silobelas gold belt.\n\nOfficial production data obtained byCheck Pointshows that Podhill (Pvt) Ltd, jointly owned by Chinese national Mr. Zuo Wenzhong and Australian businessman Mr. Moham Karim, declared less than 4kg of gold for banking in 2024. Yet, internal mine reports reveal the company processed over 3 000kg of ore monthly, with several gold batches smelted off the books.\n\nIn December 2024 alone, Podhills carbon-in-pulp (CIP) processing line produced nearly 1.5kg of gold per batch, generating payments of up to US$16 000 per transactionmostly handled by a partner identified only as Talib. However, just 300 grammes were officially sold through Fidelity Printers and Refiners and the CID Minerals Unit.\n\nPodhills Heap Leaching operations in May and June 2024 processed over 3 000kg of ore, producing an estimated US$117 000 per smelt runincome that investigators say was never declared to the Reserve Bank of Zimbabwe or the Zimbabwe Revenue Authority.\n\nFurther spreadsheets reveal how flotation amalgam sales, composed of highly pure small batches, were privately sold at US$70 per gramme, significantly above the official rate, to undisclosed foreign buyers.\n\nAt the centre of the syndicate is Mr. Zuo Wenzhong, who controls 95 percent of Podhills shares through Generous Resources (Pvt) Ltd. Working with Mr. Mohamad Taleb, Mr. He Huayang, and Mr. Duan Yuanbin, Mr. Zuo allegedly masterminded an extensive gold-smuggling operation that moved smelted gold directly from Kwekwe to off-book refiners and international markets, mainly in Dubai and China.\n\nAn internal criminal dossier seen byCheck Pointdetails how Mr. Zuo instructed employees to smelt quietly and move shipments without record. Transaction ledgers attached to the report show16 854 grammes of gold sold privately between December 2023 and May 2024, and another 34kg by years endall diverted from official channels.\n\nBy early 2025, Podhills illicit operations had outpaced its legitimate mining cover, with total undeclared sales surpassing 120kg of goldconservatively valued at over US$10 million at prevailing global prices.\n\nThe syndicates elution plant and smelting facilities at Ourstrike Mine became the epicentre of the schemeindustrial-scale infrastructure repurposed for private gain under the pretext of national production.\n\nMining insiders described a ghost refinery network powered by cash transactions, private air cargo, and discreet couriers linking Zimbabwes Midlands Province to foreign buyers.\n\nInvestigators have since traced the smuggling web to Generous Resources, Podhill, and Milhub, all interlinked through Mr. Zuos shareholding and management control. The report also names Mr. He Huayang (Podhill general manager) and Mr. Duan Yuanbin (director) as key operatives in the gold diversion scheme.\n\nFinancial records, photographic evidence, and transaction ledgers now form the backbone of an ongoing investigation by the Zimbabwe Republic Polices Minerals and Border Control Unit, which is tracking proceeds channelled through the companies Generous Resources, Milhub, and Podhill.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — In what appears to be yet another Gold Mafia-style scandal, gold worth at least US$10 million has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/us10-million-gold-leaks-from-mnangagwas-home-town/\">Continue reading<span class=\"screen-reader-text\"> \"US$10 Million Gold Leaks From Mnangagwa’s Home Town\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "Chaos At Masvingo Tollgate As Zanu PF Hardliner Refuses To Pay Tollgate Fee",
            "url": "https://www.zimeye.net/2025/10/21/chaos-at-masvingo-tollgate-as-zanu-pf-hardliner-refuses-to-pay-tollgate-fee/",
            "content": "By A Correspondent\n\nA Zanu PF motor vehicle ferrying delegates from the partys Annual Conference in Mutare caused chaos at Roy Tollgate, located 40 km east of Masvingo, after weaving through the queue to pass through the exemption lane.\n\nObservers say the incident underscores the lawlessness that has become synonymous with members of the ruling party under the Second Republic. On Sunday, a Zanu PF twin-cab reportedly bypassed the toll gate along the Masvingo-Mutare Road near the Gutu turn-off.\n\nThe vehicle, believed to be returning from the Mutare conference, had no number plates. Its only identification was a Zanu PF Central Committee Member logo emblazoned on the doors.\n\nA ZINARA source, speaking on condition of anonymity, said, This kind of behaviour is becoming normal for ruling party officials.\n\nThey act as if rules do not apply to them. Vehicles bypassing the toll gate like this disrupt traffic and show blatant disregard for the law.\n\nMotorists caught up in the chaos expressed frustration, noting that ordinary citizens are expected to follow procedures while party members enjoy impunity.\n\nThe incident raises concerns about accountability and the selective enforcement of traffic regulations for political elites, with critics arguing that such actions erode public trust in state institutions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zanu PF motor vehicle ferrying delegates from the party’s Annual Conference in Mutare caused chaos at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/chaos-at-masvingo-tollgate-as-zanu-pf-hardliner-refuses-to-pay-tollgate-fee/\">Continue reading<span class=\"screen-reader-text\"> \"Chaos At Masvingo Tollgate As Zanu PF Hardliner Refuses To Pay Tollgate Fee\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "Mliswa Throws Jab At General Chiwenga, Accuses VP Of Lacking Patience",
            "url": "https://www.zimeye.net/2025/10/21/mliswa-throws-jab-at-general-chiwenga-accuses-vp-of-lacking-patience/",
            "content": "By A Correspondent\n\nIndependent politician and former Norton legislator Temba Mliswa on Sunday launched a scathing attack on Vice President Constantino Chiwenga, accusing him of impatience and political recklessness in his pursuit of power.\n\nWriting on X (formerly Twitter), Mliswa said the Vice Presidents recent conduct sharply contrasts with President Emmerson Mnangagwas patient rise to power following his 2004 political setback.\n\nIt has been clear to all and sundry that there were ongoing efforts to usurp ED, especially after the passing of Resolution Number 1 in Bulawayo, Mliswa wrote. Only those advancing the putschist agenda and the stoically stupid would try to argue that the Presidium has been in unison.\n\nHe argued that Mnangagwa displayed extraordinary patience and humility after losing the vice presidency to Joice Mujuru two decades ago, saying, What is striking in that chain of events is how ED nursed his disappointment and pain and still worked dutifully and faithfully until his turn finally came. His level of patience and humbleness is a feat for study and historical lessons.\n\nMliswa accused Chiwenga of taking a reckless and divisive path, claiming the former army general had failed to nurture patience so as to wait for his turn with humbleness and obedience. He added that the Vice Presidents alleged involvement in internal power struggles had damaged his reputation and weakened his political capital.\n\nAs things stand, he has essentially brought the party into disrepute and whatever political capital he possessed, especially within it, he has lost it, Mliswa said. Its one thing to be celebrated by social media, mainly opposition people in the diaspora, and another to build a support base within the party.\n\nIn his lengthy Sunday post, Mliswa also accused Chiwenga of being surrounded by moles and fence-sitters within government and ZANU PF structures. Multiple intelligence leaks have betrayed the presence of sellouts which increases pressure on ED to act boldly and fire many people, he wrote.\n\nHe further called for a purge of what he described as disloyal individuals close to the Vice President. How does the wife of the VP continue going to work when she has become a politically exposed person? It creates an unfair situation even for her superiors, Mliswa charged.\n\nTaking aim at Chiwengas political tactics, Mliswa said the VP had complicated his own position and weakened his influence. Like Mai Mujuru in 2004, plucked from nowhere and hoisted into a high office, the VP needed to bid his time and patiently focus on his duties, he wrote.\n\nHe concluded by urging Mnangagwa to act decisively against those undermining his leadership. There is a whole clean-up exercise that has to happen for ED to solidify his position otherwise he will be nurturing many people who were working against him. As for the President, many have shown their colours and inability to do the principled thing, and should simply be allowed or made to walk.\n\nMliswas Sunday comments have reignited speculation over widening cracks within ZANU PFs top leadership and the escalating succession tensions between President Mnangagwa and his deputy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Independent politician and former Norton legislator Temba Mliswa on Sunday launched a scathing attack on Vice President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/mliswa-throws-jab-at-general-chiwenga-accuses-vp-of-lacking-patience/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Throws Jab At General Chiwenga, Accuses VP Of Lacking Patience\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        },
        {
            "title": "Mnangagwa Publicly Boasts Of Unbreakable Bond With Citizens Despite Worsening Poverty, Joblessness",
            "url": "https://www.zimeye.net/2025/10/21/mnangagwa-publicly-boasts-of-unbreakable-bond-with-citizens-despite-worsening-poverty-joblessness/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa on Saturday publicly declared that ZANU PF maintains an unbreakable bond with Zimbabweans, as the ruling party concluded its 22nd National Peoples Conference in Mutare with a firm endorsement of his Vision 2030 agenda.\n\nAddressing delegates , Mnangagwa stressed the need for unity and inclusivity within the party and across the nation. Comprehensive feedback must ensure that no one is left behind. This is how we must nurture and cement an unbreakable bond between the people and the party, he said to applause.\n\nThe conference, themed on economic resilience and national transformation, reaffirmed ZANU PFs support for extending Mnangagwas leadership beyond 2028, with resolutions aligning with his Vision 2030 blueprint. Party officials described the move as necessary to safeguard national progress.\n\nCritics, however, argue that the Presidents rhetoric contradicts the daily realities faced by many Zimbabweans struggling with escalating poverty, unemployment, and political marginalization.\n\nMnangagwa speaks of an unbreakable bond, but that bond is being tested by hunger, joblessness, and lack of trust in government institutions, said a Harare-based political analyst. The rhetoric of inclusivity does not reflect what ordinary citizens are experiencing.\n\nAs the Mutare conference wrapped up, ZANU PF projected unity and control, yet public skepticism remains, raising questions about whether the partys 2030 agenda is aimed at national development or consolidating political power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa on Saturday publicly declared that ZANU PF maintains an “unbreakable bond” with Zimbabweans, as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/21/mnangagwa-publicly-boasts-of-unbreakable-bond-with-citizens-despite-worsening-poverty-joblessness/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Publicly Boasts Of Unbreakable Bond With Citizens Despite Worsening Poverty, Joblessness\"</span></a></p>",
            "time": "06:10",
            "date": "22 Oct 2025"
        }
    ]
}