{
    "news": [
        {
            "title": "Mnangagwa Appoints Loyalist To Top Police Post",
            "url": "https://www.zimeye.net/2024/12/22/mnangagwa-appoints-loyalist-to-top-police-post/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa is making calculated moves to consolidate his grip on power, as infighting within his party, Zanu PF, intensifies ahead of the upcoming elections. His recent decision to retire the long-serving Commissioner General of the Zimbabwe Republic Police, Godwin Matanga, and appoint Deputy Commissioner General Stephen Mutamba as his successor, is being seen as part of a broader strategy to secure control over key state institutions.\n\nIn a statement issued by Dr. Martin Rushwaya, the Chief Secretary to the President and Cabinet, it was announced that Mutamba would officially take up the role of Commissioner General starting January 1st. The announcement followed Mnangagwas decision to retire Matanga from the post, with his departure set for the end of this month.\n\nThis reshuffle comes at a time when internal divisions within Zanu PF are beginning to surface, with various factions positioning themselves for influence ahead of the 2024 elections. Analysts suggest that Mnangagwas appointment of Mutamba, a known loyalist, signals his intent to strengthen his position within the party and ensure that key institutions, such as the police force, remain firmly under his control during this critical period.\n\nWith opposition groups gaining traction and calls for reform growing louder, Mnangagwa is determined to avoid any disruptions that could threaten his authority. By securing the loyalty of the police force, which plays a crucial role in maintaining order during politically sensitive times, he hopes to quell dissent within both the party and the wider public.\n\nAs Zanu PFs internal power struggles threaten to overshadow the election process, Mnangagwas political maneuvering is increasingly being viewed as a desperate attempt to maintain his position amid mounting challenges. His control over key state apparatus, including the police, could prove pivotal in navigating these turbulent waters.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa is making calculated moves to consolidate his grip on power, as infighting within his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/mnangagwa-appoints-loyalist-to-top-police-post/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Appoints Loyalist To Top Police Post\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Shattered UK Dream: Zim Widow Seeks Support to Return Home After Health Setback",
            "url": "https://www.zimeye.net/2024/12/22/shattered-uk-dream-zim-widow-seeks-support-to-return-home-after-health-setback/",
            "content": "By A Correspondent | A Zimbabwean widow, Pamela Mazuva Nwaeze,has launched a heartfelt appeal on GoFundMe after her hopes for a better life abroad were shattered by a devastating health crisis. Her story is one of determination, resilience, andthe harsh realities faced by some immigrants in their pursuit of the so-called UK dream.\n\nPamela, who relocated to the UK in February 2024 after selling all her belongings back home, had high hopes of building a brighter future. With a Certificate of Sponsorship (COS) secured in January 2024, she left Zimbabwe to work in the care industry and make a fresh start. But just months after starting work in March, her life took a sudden and heartbreaking turn when her contract was terminated in April due to rapidly deteriorating eyesight.\n\nA Health Crisis Unfolds\n\nPamelas vision worsened between March and May, leading to near blindness. Medical specialists at Moorfields Eye Hospital, one of the worlds leading eye care institutions, discovered that she had a dislocated artificial lens in one eye and a retinal detachment. In June, she underwent emergency surgery to remove the lens, repair the retina, and address other complications. Despite this, Pamelas vision remains severely impaired, leaving her partially blind and unable to work in her chosen field.\n\nA Dream Deferred\n\nHer recovery period lasted until September, during which she was fitted with contact lenses to aid her vision. However, her disability has made finding employment nearly impossible, forcing her to make the difficult decision to return to Zimbabwe. Pamela described her journey with immense sadness, sharing that her dream of achieving what she could not in Zimbabwe as a teacher had been dashed.\n\nI had a dream, but illness took away my UK dream. I failed to achieve, Pamela said in her emotional appeal.\n\nA Plea for Help\n\nPamela is now seeking financial assistance to help her rebuild her life back home. Without a house of her own and with the added challenges of managing diabetes and ongoing eye treatment, she faces a daunting future. Her plea is directed at fellow Zimbabweans and well-wishers around the world, asking for support to help her regain her dignity.\n\nPlease have the heart and help me. I need to relocate and to have some funds to start from when I get home. May God bless the hands that give, she said.\n\nA Call for Compassion\n\nPamelas story serves as a stark reminder of the challenges faced by many who migrate abroad in search of better opportunities. It is also a testament to her strength in the face of adversity and her hope that her community can rally around her during this difficult time.\n\nFor those wishing to support Pamela, her GoFundMe campaign aims to raise funds for her relocation, medical needs, and a fresh start back in Zimbabwe.\n\nThis story continues to unfold, highlighting the power of community and compassion in times of need.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A Zimbabwean widow, Pamela Mazuva Nwaeze, has launched a heartfelt appeal on GoFundMe after her hopes … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/shattered-uk-dream-zim-widow-seeks-support-to-return-home-after-health-setback/\">Continue reading<span class=\"screen-reader-text\"> \"Shattered UK Dream: Zim Widow Seeks Support to Return Home After Health Setback\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Child Kidnap Woman Pleads",
            "url": "https://www.zimeye.net/2024/12/22/child-kidnap-woman-pleads/",
            "content": "A 39-year-old woman, Anita Khumalo, from Pumula South suburb in Bulawayo, stood visibly burdened by regret as she shared her story of desperation and crime during a recent interview. Dressed in her prison uniform, her expression was one of solemn remorse, her lips slightly parted as if mid-confession, with her eyes reflecting the weight of her actions. Her body posture, slightly leaned forward, communicated both vulnerability and a longing to explain the pain that led her down a dark path.\n\nKhumalo is currently serving a four-year sentence at Mlondolozi Female Prison, part of Khami Maximum Prison, after being convicted of kidnapping a two-day-old baby from Mpilo Central Hospital in September last year. Her actions, which shocked the Bulawayo community, stemmed from personal tragedy, marital pressure, and familial expectations, according to her account.\n\nIn an interview during the Zimbabwe Prisons and Correctional Services (ZPCS) Family Week, Khumalo recounted how the loss of her pregnancy in June 2023 and the fear of losing her marriage pushed her to commit the crime.\n\nI think most people read my story on social media. I am the one who kidnapped a two-day-old baby at Mpilo Hospital. Due to the pressure of keeping my marriage as well as that of my in-laws, I ended up taking the illegal route, she admitted.\n\nA Well-Calculated Plan\n\nKhumalo explained how she faked her pregnancy for months after her miscarriage to placate her husband and in-laws. As the due date approached, desperation took over. On September 10, 2023, she visited Mpilo Hospital, where she befriended an 18-year-old new mother. She offered her help but later abandoned the mother in Bulawayos Central Business District and took the newborn to Ntabazinduna.\n\nHer in-laws quickly grew suspicious, leading to her arrest.\n\nReflection and Regret\n\nBehind bars, Khumalo reflected on the consequences of her actions, cautioning others to pursue legal adoption instead of resorting to crime. To anyone who needs a baby, please do things the right way. There are legal ways of adopting a baby. I lost my job, my family, and my life as I knew it. I have not seen my three children from my previous marriage, and I do not even know the state of my house, she said.\n\nFamily Support\n\nDespite the ordeal, Khumalo expressed gratitude for her familys support. She has served one year and three months of her reduced sentence of two years and eight months.\n\nHer story stands as a cautionary tale about the pressures of societal expectations and the devastating consequences of desperate decisions. SundayMail\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A 39-year-old woman, Anita Khumalo, from Pumula South suburb in Bulawayo, stood visibly burdened by regret as she shared her … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/child-kidnap-woman-pleads/\">Continue reading<span class=\"screen-reader-text\"> \"Child Kidnap Woman Pleads\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Orlando Pirates Mourns the Loss of Young Star Setjhaba Mofokeng",
            "url": "https://www.zimeye.net/2024/12/22/orlando-pirates-mourns-the-loss-of-young-star-setjhaba-mofokeng/",
            "content": "By A Correspondent\n\nThe South African football community is in mourning following the sudden passing of Orlando Pirates player, Setjhaba Mofokeng.\n\nThe talented youngster was on loan at Bidvest Wits at the time of his untimely death.\n\nOrlando Pirates Football Club released a statement on Friday, expressing their deep sadness and shock at the loss of Mofokeng. His passing has sent shockwaves throughout the football community, with fans, players, and coaches paying tribute to his memory.\n\nThe exact circumstances surrounding Mofokengs death have not been disclosed, but his passing has left a void in the football world. Orlando Pirates and the entire football community will deeply miss Setjhaba Mofokengs talent, passion, and dedication to the beautiful game.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The South African football community is in mourning following the sudden passing of Orlando Pirates player, Setjhaba … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/orlando-pirates-mourns-the-loss-of-young-star-setjhaba-mofokeng/\">Continue reading<span class=\"screen-reader-text\"> \"Orlando Pirates Mourns the Loss of Young Star Setjhaba Mofokeng\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Land Issue : Mnangagwa Merely Playing Political Games",
            "url": "https://www.zimeye.net/2024/12/22/land-issue-mnangagwa-merely-playing-political-games/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas promises to revive Zimbabwes agricultural sector have been met with skepticism, with many critics labelling his recent efforts as political gimmicks rather than genuine steps towards transformation.\n\nOn Friday, Mnangagwa launched the Land Tenure Implementation Programme at Precabe Farm in Kwekwe, a new initiative he claims will rejuvenate the agricultural sector. During the event, he handed over Land Tenure Deeds to farmers, describing the move as a milestone in Zimbabwes agricultural progress.\n\nHowever, opposition leaders and critics have dismissed the programme as an attempt to distract from the countrys ongoing agricultural challenges. This is nothing more than a political stunt. For years, the countrys agricultural sector has suffered from poor policy implementation and lack of support, and this programme wont change that, one political analyst remarked.\n\nIn a statement during the event, Mnangagwa said, Today, I officially launched the new Land Tenure Implementation Programme at Precabe Farm in Kwekwe, where I also handed over Land Tenure Deeds to Zimbabwean farmers. This milestone is a critical step in transforming our agricultural sector, enabling farmers to access credit facilities, purchase inputs, and hire labour.\n\nThese tools will enhance agricultural production, improve yields, and uplift our people from poverty into prosperity.\n\nDespite the presidents optimism, many are doubtful that these measures will lead to significant improvements. The land reform process has been poorly managed for years, and handing over deeds now wont fix the systemic issues that have plagued farming in Zimbabwe, said a critic of the programme.\n\nMnangagwa also highlighted that the programme reflects his governments commitment to inclusive growth, focusing on marginalized groups such as war veterans, women, and youth. This programme reflects the Second Republics commitment to inclusive growth, ensuring that war veterans, women, and the youth are not left behind in this transformative journey, he added.\n\nWhile the president continues to champion agriculture as key to national development, his critics argue that the lack of tangible reforms over the years has made such promises seem increasingly far-fetched. Farming has always been close to my heart, and I am proud to support this initiative, which will create opportunities for sustainable commercial agriculture and attract investment into our economy, Mnangagwa said, but many believe that the focus should be on practical support for farmers, not just promises.\n\nAs Zimbabwe grapples with food insecurity and economic challenges, the real impact of this initiative remains to be seen. Many are calling for more than just ceremonial gestures, urging real action to revive the sector and restore confidence among farmers.\n\nTogether, we are building a thriving agricultural sector that drives Zimbabwes development and secures food security for future generations, Mnangagwa concluded, but for many, these words appear to be more hopeful rhetoric than a concrete plan.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s promises to revive Zimbabwe’s agricultural sector have been met with skepticism, with many critics … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/land-issue-mnangagwa-merely-playing-political-games/\">Continue reading<span class=\"screen-reader-text\"> \"Land Issue : Mnangagwa Merely Playing Political Games\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "BREAKING: Missing 14-Year-Old Nakai Rinomhota Found Safe and Well",
            "url": "https://www.zimeye.net/2024/12/22/breaking-missing-14-year-old-nakai-rinomhota-found-safe-and-well/",
            "content": "By A Correspondent | ZimEye |Leeds, UK  West Yorkshire Police have announced that Nakai Rinomhota, the 14-year-old girl who was the subject of an urgent missing persons appeal, has been found safe and well. The announcement came late Saturday, marking the end of a tense three-day search that drew significant public attention and support.\n\nIn their statement, police expressed gratitude to the community:\n\nNakai Rinomhota, who was previously the subject of a missing persons appeal, has been found safe and well. Thanks for your assistance!\n\nThe Search for Nakai\n\nNakai was last seen on the afternoon of Wednesday, December 18, in the Chapeltown area of Leeds. Her disappearance prompted widespread concern, with police issuing an appeal describing her as being black, with long ombre braids, standing 5ft 6ins tall, and of slim build. At the time, she was believed to be wearing light-coloured joggers and a black coat.\n\nAuthorities highlighted the urgency of the situation, emphasizing their increasing concern for her welfare. The public was asked to assist by reporting any sightings or relevant information.\n\nCommunity Effort and Relief\n\nThe news of Nakais safe recovery has brought relief to the local community and beyond. Social media platforms were flooded with messages of gratitude and joy following the announcement. Many thanked the police and members of the public for their efforts in locating the teenager.\n\nOne Facebook user commented, Fantastic news! while another added, Good news and thank you from MISSING  Police Appeals for Missing People in England and Wales.\n\nA Successful Conclusion\n\nThis positive outcome underscores the importance of community cooperation in missing persons cases. West Yorkshire Police have not released further details about the circumstances of Nakais recovery but have reiterated their appreciation for the publics help during the search.\n\nThis is a developing story, and more information may follow as updates become available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Leeds, UK – West Yorkshire Police have announced that Nakai Rinomhota, the 14-year-old girl … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/breaking-missing-14-year-old-nakai-rinomhota-found-safe-and-well/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Missing 14-Year-Old Nakai Rinomhota Found Safe and Well\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Grisly Murder in Esigodini Under Investigation",
            "url": "https://www.zimeye.net/2024/12/22/grisly-murder-in-esigodini-under-investigation/",
            "content": "By A Correspondent\n\nA shocking murder has shaken the community of Esigodini, with police launching an investigation into the gruesome killing of 26-year-old Vusumuzi Hlabangani.\n\nHis remains were discovered along the Bulawayo-Beitbridge railway line, near the Esigodini Vegetable Market, on December 19, 2024.\n\nSuspicious Circumstances\n\nIts believed that Hlabangani was murdered before his body was thrown onto the railway tracks, where it was tragically struck by a train, resulting in multiple fatal injuries. The victims head showed multiple stab wounds, and police found an okapi knife at the scene, which may be a crucial piece of evidence in the case .\n\nPolice Appeal for Information\n\nAs the investigation continues, authorities are urging anyone with information about the murder to come forward. If you have any details, no matter how small they may seem, please report to your nearest police station.\n\nThe community is in shock, and police are working tirelessly to bring justice to Hlabanganis family and loved ones.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A shocking murder has shaken the community of Esigodini, with police launching an investigation into the gruesome … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/grisly-murder-in-esigodini-under-investigation/\">Continue reading<span class=\"screen-reader-text\"> \"Grisly Murder in Esigodini Under Investigation\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Controversy Surrounds Mrs Mnangagwa Donations",
            "url": "https://www.zimeye.net/2024/12/22/controversy-surrounds-mrs-mnangagwa-donations/",
            "content": "By A Correspondent\n\nImpeccable government sources have raised concerns about the source of the goods being donated by First Lady Auxillia Mnangagwa. Allegations have surfaced suggesting that some of the items she has given away may have been confiscated by the Zimbabwe Revenue Authority (ZIMRA), sparking questions about the transparency of her philanthropic efforts.\n\nOn December 19, 2024, the office of the Minister of State for Provincial Affairs and Devolution announced that Mrs. Mnangagwa had donated 300 food hampers to the elderly in Gweru, a gesture described as part of her commitment to supporting vulnerable communities during the festive season.\n\nIn Gweru on 19 December 2024, Honourable Owen Ncube, Minister of State for Provincial Affairs and Devolution for Midlands, handed over 300 food hampers to the elderly at the Gweru Government Complex. The hampers, donated by the First Lady of Zimbabwe, Dr. Auxillia Mnangagwa, underscore her commitment to ensuring that no one is left behind during the festive season, a government official stated in a press release.\n\nHowever, sources within government circles have suggested that some of the items included in these hampers could have been seized by ZIMRA, raising concerns about the appropriateness of using such goods for charitable purposes. While her intentions may be good, the public deserves to know the origin of these goods. If they were taken by ZIMRA due to non-compliance with import regulations, it raises questions about the ethical use of such items, one government insider commented, requesting anonymity.\n\nAs of now, there has been no official confirmation regarding the exact source of the goods donated by the First Lady. Critics argue that using goods seized by ZIMRA for charity may undermine the integrity of the donations and contribute to a lack of transparency in public affairs.\n\nDespite these concerns, Mrs. Mnangagwas supporters have continued to praise her charitable work, particularly her focus on the elderly, a group often neglected in society. The First Ladys donations have been a blessing to many in need. Its crucial that we focus on the positive impact of her initiatives, said a government spokesperson.\n\nThe controversy surrounding the origin of the donated goods continues to raise questions about the broader implications of using confiscated goods in charity, and whether it might lead to a reassessment of how such donations are handled in the future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Impeccable government sources have raised concerns about the source of the goods being donated by First Lady … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/controversy-surrounds-mrs-mnangagwa-donations/\">Continue reading<span class=\"screen-reader-text\"> \"Controversy Surrounds Mrs Mnangagwa Donations\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "ZPC Hwange Eager to Shine in PSL",
            "url": "https://www.zimeye.net/2024/12/22/zpc-hwange-eager-to-shine-in-psl/",
            "content": "Sports Correspondent\n\nZPC Hwange marked a historic moment at its Annual Awards Ceremony on Friday night, celebrating the clubs promotion to the Premier League after more than three decades. The event, held in the heart of the coal mining town, was filled with excitement as the team looked ahead to a new chapter.\n\nStriker Israel Mukahanana was honored with the prestigious Player of the Year award. Other standout players included Morgan Okocha Nyoni, who received the Most Loyal Player award for his long-standing commitment to the club, and Beloved Mutambisi, who was named the Most Improved Player. Admire Banda earned the Most Consistent Player award, while Gerald Choto was recognized as the Most Disciplined Player.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent ZPC Hwange marked a historic moment at its Annual Awards Ceremony on Friday night, celebrating the club’s promotion … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/zpc-hwange-eager-to-shine-in-psl/\">Continue reading<span class=\"screen-reader-text\"> \"ZPC Hwange Eager to Shine in PSL\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        },
        {
            "title": "Mnangagwa Retires Police Boss In Strategic Move To Retain Power",
            "url": "https://www.zimeye.net/2024/12/22/mnangagwa-retires-police-boss-in-strategic-move-to-retain-power/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa is making calculated moves to consolidate his grip on power, as infighting within his party, Zanu PF, intensifies ahead of the upcoming elections. His recent decision to retire the long-serving Commissioner General of the Zimbabwe Republic Police, Godwin Matanga, and appoint Deputy Commissioner General Stephen Mutamba as his successor, is being seen as part of a broader strategy to secure control over key state institutions.\n\nIn a statement issued by Dr. Martin Rushwaya, the Chief Secretary to the President and Cabinet, it was announced that Mutamba would officially take up the role of Commissioner General starting January 1st. The announcement followed Mnangagwas decision to retire Matanga from the post, with his departure set for the end of this month.\n\nThis reshuffle comes at a time when internal divisions within Zanu PF are beginning to surface, with various factions positioning themselves for influence ahead of the 2024 elections. Analysts suggest that Mnangagwas appointment of Mutamba, a known loyalist, signals his intent to strengthen his position within the party and ensure that key institutions, such as the police force, remain firmly under his control during this critical period.\n\nWith opposition groups gaining traction and calls for reform growing louder, Mnangagwa is determined to avoid any disruptions that could threaten his authority. By securing the loyalty of the police force, which plays a crucial role in maintaining order during politically sensitive times, he hopes to quell dissent within both the party and the wider public.\n\nAs Zanu PFs internal power struggles threaten to overshadow the election process, Mnangagwas political maneuvering is increasingly being viewed as a desperate attempt to maintain his position amid mounting challenges. His control over key state apparatus, including the police, could prove pivotal in navigating these turbulent waters.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa is making calculated moves to consolidate his grip on power, as infighting within his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/22/mnangagwa-retires-police-boss-in-strategic-move-to-retain-power/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Retires Police Boss In Strategic Move To Retain Power\"</span></a></p>",
            "time": "08:24",
            "date": "22 Dec 2024"
        }
    ]
}