{
    "news": [
        {
            "title": "Mnangagwa Regime’s Desperation Deepens as ZINARA Enforces Mandatory ZBC Radio Licence Rule…",
            "url": "https://www.zimeye.net/2025/07/15/mnangagwa-regimes-desperation-deepens-as-zinara-enforces-mandatory-zbc-radio-licence-rule/",
            "content": "By A Correspondent\n\nThe Mnangagwa administration is drawing fierce criticism for what many see as a desperate attempt to squeeze every dollar out of struggling Zimbabweansthis time through a controversial and coercive law that ties the acquisition of motor vehicle licenses to payment of a Zimbabwe Broadcasting Corporation (ZBC) radio licence.\n\nAccording to a ZINARA internal memorandum dated 15 July 2025 and signed by the Revenue Operations Director, motorists are now barred from renewing their vehicle insurance or obtaining a ZINARA license disc unless they produce a valid ZBC radio licence or exemption certificate.\n\nIn line with the enacted Broadcasting Services Amendment Act, all motorists are now required to obtain a ZBC radio license before they can renew their vehicle insurance or acquire a ZINARA motor vehicle license disc, the memo states.\n\nCritics argue that the policy is nothing more than state extortion wrapped in bureaucratic procedure. This is a regime running on financial fumes, one transport industry observer said. Theyve failed to revive the economy, failed to curb inflation, failed to reform parastatals like ZBC\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Mnangagwa administration is drawing fierce criticism for what many see as a desperate attempt to squeeze … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/mnangagwa-regimes-desperation-deepens-as-zinara-enforces-mandatory-zbc-radio-licence-rule/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime’s Desperation Deepens as ZINARA Enforces Mandatory ZBC Radio Licence Rule…\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zanu PF In Double Heroes Burial",
            "url": "https://www.zimeye.net/2025/07/15/zanu-pf-in-double-heroes-burial/",
            "content": "By A Correspondent Zanu PF Harare province at the weekend buried two senior of its cadres and liberation war veterans, Tendai Maveve and Amos Mutizamhepo.\n\nThe pair passed away on the same day on 7 July and were laid to rest side by side over the weekend at the Harare Provincial Heroes Acre.\n\nBorn on May 5, 1964, in Chikombedzi Village, Chiredzi District, Masvingo Province, Maveve joined the liberation struggle in 1976, crossing into Mozambique to undergo military training. She was among the few survivors of the brutal Chimoio attack in 1977.\n\nAfterward, she continued serving the cause at Gondora and Chimhinga bases until the end of the war.\n\nShe is survived by seven children and several grandchildren.\n\nMutizamhepo also joined the liberation struggle in 1976.\n\nHe passed away at the age of 68 and is survived by five children and several grandchildren.\n\nBoth comrades were accorded full military honours in recognition of their immense contributions to Zimbabwes liberation and post-independence development.\n\nTheir joint burial symbolised their lifelong commitment to the countrys freedom and their enduring legacy within the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF Harare province at the weekend buried two senior of its cadres and liberation war veterans, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/zanu-pf-in-double-heroes-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF In Double Heroes Burial\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Mnangagwa Regime Punishes Citizens Through Mandatory ZBC Radio Licences…",
            "url": "https://www.zimeye.net/2025/07/15/mnangagwa-regime-punishes-citizens-through-mandatory-zbc-radio-licences/",
            "content": "By A Correspondent\n\nThe Mnangagwa administration has drawn widespread criticism for enforcing a new law that compels motorists to pay for a Zimbabwe Broadcasting Corporation (ZBC) radio licence before they can renew their vehicle insurance or obtain a ZINARA licence disc.\n\nThe law  theBroadcasting Services Amendment Act [Chapter 12:06] (No. 2 of 2025) officially took effect today. It requires that a ZBC radio licence be obtained either prior to or concurrently with insurance or licensing processes.\n\nIn a public statement, the Zimbabwe National Road Administration (ZINARA) confirmed its full implementation of the policy, stating that it was aligning its operations with the Broadcasting Services Act.\n\nThe development has sparked outrage among citizens and civil society groups, who accuse the government of punishing the public by forcing them to support a state broadcaster that many consider biased, underperforming, and irrelevant to their daily lives.\n\nMany Zimbabweans see the move as a veiled tax and a coercive way to prop up ZBC, which continues to suffer from low public trust and outdated infrastructure. The requirement has been described as unjust, especially considering the countrys ongoing economic hardships, high unemployment, and soaring costs of living.\n\nCritics also argue that the policy restricts freedom of choice, as it compels citizens to financially support a media institution that they neither watch nor approve of. Legal experts and media watchdogs have called the law unconstitutional, warning that it sets a dangerous precedent for forced contributions to state-controlled entities.\n\nGovernment officials have defended the decision, claiming the requirement is in line with global broadcasting standards. However, many observers point out that in democratic societies, public broadcasters are typically funded through transparent, accountable mechanismsnot forced payments tied to unrelated services like insurance or vehicle licensing.\n\nWith no clear exemption process in place, motorists now face a non-negotiable obligation: pay the ZBC radio licence fee or forfeit the ability to legally insure or license their vehicles.\n\nThe laws implementation marks yet another flashpoint in the ongoing tension between state power and citizen rights in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Mnangagwa administration has drawn widespread criticism for enforcing a new law that compels motorists to pay … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/mnangagwa-regime-punishes-citizens-through-mandatory-zbc-radio-licences/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Punishes Citizens Through Mandatory ZBC Radio Licences…\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Liz Tsvangirai’s Father Targeted",
            "url": "https://www.zimeye.net/2025/07/15/liz-tsvangirais-father-targeted/",
            "content": "By A Correspondent The late fomer Prime minister Morgan Tsvangirais wife Elizaberth Machekas father is one of Zanu PF and war veterans who are facing eviction from the farm they occupied during the hieght of the land reform programme, by controversial businessman Billy Rautenbach has emerged.\n\nThe farm covers over 1,000 hectares of prime farmland in Mashonaland East.\n\nJoseph Macheka, the father-in-law of the late former Prime Minister and MDC-T leader Morgan Tsvangirai. Macheka is a former Chitungwiza mayor and Zanu PF Central Committee member. Other evictees include retired army major Alfred Chademana and war veterans identified as Chikomo, Mangisa, and Muza.\n\nThe land in questionSprings Farm (about 600 hectares) and neighbouring Stuhm Farm (roughly 400 hectares)was allocated to Rautenbachs company, Marimba Residential Properties Limited, on June 5, 2025. This happened despite a pending High Court challenge by the affected farmers, scheduled to be heard on July 17.\n\nThe farmers, many of whom have occupied and developed the land for over two decades, say their offer letters were withdrawn without compensation. They accuse the government of favouring Rautenbach and undermining the gains of the land reform programme.\n\nChikomos son, Unikorecently honoured as Young Farmer of the Year for 2024 at a national awards ceremony hosted by the Ministry of Lands, Agriculture, Fisheries, Water and Rural Developmentis among the disillusioned.\n\nStuhm Farm was part of a 2019 government urbanisation scheme in which close to 200 residential stands were sold to current and former MPs, senior officials, and civil servants across the political divide. Many invested heavily in infrastructure, irrigation, and housing under long-term leases valid until 2029. Yet, despite their investments, the land has been reallocated to Rautenbach.\n\nA letter dated March 14, 2025, from Local Government Minister Daniel Garwe offered Rautenbach over 1,000 hectares, including Springs and Stuhm Farms, as compensation for his disputed claim over 180 hectares in Aspindale Park, Harare. However, a 2019 High Court ruling by Justice Philda Muzofa dismissed Rautenbachs claim to Aspindale, stating his companies had no legal title to the land, which had been allocated to housing cooperatives as early as 2004.\n\nFormer Mutasa Central MP (20182023) Trevor Saruwaka, now secretary of the Stuhm Residents Association, alleged corruption and irregularities in the land transfer.There are over 180 stands, and we bought the land from the Ministry of Local Government after formal negotiations led by Parliament. More than 80 MPs, past and present, were beneficiaries. Even ministry officials were allocated land. We are outraged. Why was Rautenbach given over 1,000 hectares when his claim was for just 100? This smacks of corruption. Worse still, he received an offer letter while the case is still before the courts, said Saruwaka.\n\nChademana, whose 100-hectare share of Springs Farm is now part of Rautenbachs allocation, also expressed outrage.I was allocated the land in 2001 as part of the war veterans quota. I moved in a year later and developed itbuilt a modern house, installed irrigation, even set up a school. In 2023, officials from the Agriculture Ministry came for inspections. By 2024, they said my offer letter was being withdrawn for urban expansion, he said.\n\nWhen I sought clarity, Minister Masuka refused to meet us. We later met Minister Garwe, who told us the land was going to Rautenbach. When I asked why, he claimed it was a presidential directive. I dont believe that. What is so special about Rautenbach that he gets almost 10 times what the government claims it owes him? Why are his rights superior to ours? asked Chademana.\n\nHe added that there has been no offer of compensation from the government: They are simply telling us to leave. This is outrageous.\n\nThe controversy has reignited debates about land tenure security under President Emmerson Mnangagwas administration, particularly in light of his much-publicised title deeds programme, which purports to offer landholders secure property rights. Critics say the eviction of long-standing land reform beneficiaries in favour of politically connected elites like Rautenbach undermines the programmes credibility and exposes deepening corruption in land governance.\n\nMinisters Masuka and Garwe were not available for comment. However, documents confirm that the land was officially handed over to Rautenbach on June 5, 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The late fomer Prime minister Morgan Tsvangirai’s wife Elizaberth Macheka’s father is one of Zanu PF and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/liz-tsvangirais-father-targeted/\">Continue reading<span class=\"screen-reader-text\"> \"Liz Tsvangirai’s Father Targeted\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Warriors To Receive $500,000 For 2025 AFCON Participation",
            "url": "https://www.zimeye.net/2025/07/15/warriors-to-receive-500000-for-2025-afcon-participation/",
            "content": "Sports Correspondent\n\nThe Zimbabwe national football team is set to receive a guaranteed $500,000 for participating in the 2025 Africa Cup of Nations (AFCON), which kicks off in December.\n\nZimbabwe qualified for the continental showpiece after finishing as runners-up in Group J, earning an initial $250,000 for their qualification. Group winners Cameroon received $350,000.\n\nAFCON participation guarantees each team a minimum payout of $500,000, which is awarded to all group stage participants who finish in fourth place.\n\nThe Warriors stand to earn more based on their performance:\n\n$700,000 if they finish third in the group\n\n$800,000 for reaching the Round of 16  a feat Zimbabwe has never achieved\n\n$1.3 million for a quarter-final finish\n\n$2.5 million for reaching the semi-finals\n\n$4 million for finishing as runners-up\n\n$7 million for winning the tournament\n\nWith the potential for a record financial reward, Zimbabwes AFCON journey carries both national pride and high stakes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe national football team is set to receive a guaranteed $500,000 for participating in the 2025 Africa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/warriors-to-receive-500000-for-2025-afcon-participation/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors To Receive $500,000 For 2025 AFCON Participation\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Tagwirei More Powerful Than Soko",
            "url": "https://www.zimeye.net/2025/07/15/tagwirei-more-powerful-than-soko/",
            "content": "Below is the link to join the upcoming LIVE program.\n\n5PM UK time Sunday\n\nUPCOMING PROGRAM\n\nTagwirei could be more powerful than Soko | ON SUNDAY 5PM WITH SABHUKU MLISWAhttps://t.co/Hn8KhXSFAxpic.twitter.com/SZxJpymEqt\n\nTagwirei could be more powerful than Soko\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Below is the link to join the upcoming LIVE program. 5PM UK time Sunday UPCOMING PROGRAM Tagwirei could be more … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/tagwirei-more-powerful-than-soko/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei More Powerful Than Soko\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Tagwirei Is A Conman, Not A Businessman- Mawarire",
            "url": "https://www.zimeye.net/2025/07/15/tagwirei-is-a-conman-not-a-businessman-mawarire/",
            "content": "By A Correspondent\n\nFormer National Patriotic Front (NPF) spokesperson Jealousy Mawarire has launched a scathing attack on controversial businessman Kudakwashe Tagwirei, labelling him a conman, not a businessman, and accusing him of orchestrating large-scale corruption and looting through his ties with the Reserve Bank of Zimbabwe (RBZ) and government programmes.\n\nPosting on X (formerly Twitter), Mawarire alleged that Tagwirei manipulated financial systems for personal enrichment at the expense of ordinary Zimbabweans.\n\nTagwirei is not a businessman. He is just a well-connected conman, wrote Mawarire.\n\nHe claimed that in February 2019, during the introduction of the RTGS dollar under Statutory Instrument 33  which pegged the new currency at 1:1 with the U.S. dollar  Tagwirei exploited the transition for massive profit. According to Mawarire, Tagwirei, through his associate Chris Fourie, negotiated with the RBZ to convert $15 million in treasury bills at an inflated rate of 1:5.5, effectively securing over $75 million.\n\nInstead of getting $15m, Tagwirei and company were paid more than $75m, making a $60m killing overnight, he stated.\n\nMawarire further alleged that between 2017 and 2019, Tagwireis company, Sakunda Holdings, and its affiliates received over US$3 billion in Treasury Bills, most of which were allegedly issued outside of the approved national budget.\n\nHe cited a 2019 parliamentary inquiry that revealed a lack of transparency and accountability in the disbursement of these funds, accusing the RBZ of effectively printing money for Tagwirei and worsening Zimbabwes inflation crisis.\n\nMawarire also criticised Sakundas involvement in the Command Agriculture programme, claiming that while Parliament confirmed the company received US$1.28 billion, only US$1 billion was accounted for as input expenditure.\n\nThe remaining US$280 million could not be traced, said Mawarire. The Auditor General described the programme as opaque and riddled with financial irregularities.\n\nHe also took issue with Tagwireis more recent role in the Land Tenure Implementation Committee, accusing him of using the platform to enrich himself further by allegedly selling fraudulent title deeds to unsuspecting land reform beneficiaries.\n\nThe guy sold the country a dummy and used sanction-busting as an excuse to loot our resources through his government and RBZ connections This guy has to be stopped, Mawarire declared.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former National Patriotic Front (NPF) spokesperson Jealousy Mawarire has launched a scathing attack on controversial businessman Kudakwashe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/tagwirei-is-a-conman-not-a-businessman-mawarire/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Is A Conman, Not A Businessman- Mawarire\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zanu PF Heavyweights “Exchange Blows” Over Tagwirei Central Committee Appointment…",
            "url": "https://www.zimeye.net/2025/07/15/zanu-pf-heavyweights-exchange-blows-over-tagwirei-central-committee-appointment/",
            "content": "By A Correspondent\n\nZANU PF is reportedly embroiled in an internal dispute over the controversial attempted appointment of businessman Kudakwashe Tagwirei to the partys powerful Central Committee, with senior officials confirming tensions between Secretary-General Obert Mpofu and Secretary for Legal Affairs Patrick Chinamasa.\n\nAccording to ZANU PF sources in Harare, the conflict stems from two conflicting circularsone issued by Mpofu on 5 June 2025 and a subsequent one by Chinamasa dated 30 June 2025. Mpofus directive reportedly blocked Tagwireis co-option into the Central Committee, while Chinamasa sought to reverse that decision by issuing a clarification on the procedures for co-option.\n\nCommunications from the Secretary-Generals Office take precedence over departmental circulars, a senior party source said. Unless revoked by the Presidium, Obert Mpofus directive stands. Chinamasas attempt to override it is procedurally flawed and unconstitutional.\n\nSources insisted that within the party structure, the Secretary-Generalpreviously known as the Secretary for Administrationhas overarching authority on administrative matters.\n\nThe Secretary-General is the custodian of the partys administrative processes. Other secretaries, including the Secretary for Legal Affairs, cannot unilaterally override directives from that office, one insider explained.\n\nChinamasas circular was seen as an effort to clear the path for Tagwireis appointment, but insiders maintain it holds no weight against Mpofus earlier instruction.\n\nEven if there had been mutual consent between Mpofu and Chinamasa, it would still have required proper procedure and endorsement from the Presidium. You cannot just cancel or supersede a directive from the Secretary-General without following due process, another senior official noted.\n\nThe clash has highlighted growing tensions within the ruling party over Tagwireis influence and attempts to integrate him more formally into its structures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF is reportedly embroiled in an internal dispute over the controversial attempted appointment of businessman Kudakwashe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/zanu-pf-heavyweights-exchange-blows-over-tagwirei-central-committee-appointment/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Heavyweights “Exchange Blows” Over Tagwirei Central Committee Appointment…\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "How Cucsman Got Cooked Up By A 54 Year Old Identity Fraudster",
            "url": "https://www.zimeye.net/2025/07/15/how-cucsman-got-cooked-up-by-a-54-year-old-identity-fraudster/",
            "content": "Mbudzi yadhura is our biggest nyoka in Zimbabwe\n\nvideo loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "09:50",
            "date": "16 Jul 2025"
        },
        {
            "title": "Broke Government Fails To Pay Service Providers",
            "url": "https://www.zimeye.net/2025/07/15/broke-government-fails-to-pay-service-providers/",
            "content": "By A Correspondent\n\nThe Zimbabwean governments persistent failure to pay its service providers on time has pushed several companies to the brink, forcing many to either shut down or scale back operationsleading to massive job losses across the country.\n\nAccording to Zimbabwe National Chamber of Commerce (ZNCC) Chief Executive Christopher Mugaga, the situation has become critical, with hundreds of thousands of workers affected.\n\nQuoted by the Daily News, Mugaga said:Businesses have been feeling the impact of the governments non-payment for services rendered. Many of our members are in dire financial straits. Some have already closed, and others are being forced to downsize, shedding jobs in the process.\n\nHe warned that unless the government takes immediate steps to settle its debts with service providers, the country risks further economic instability and rising unemployment.\n\nWe are seeing ripple effects throughout the economy. When companies dont get paid, they cant meet their own obligationswhether its paying workers, suppliers, or taxes, Mugaga added.\n\nThe World Bank recently joined a growing number of voices urging the Zimbabwean government to honour its financial commitments promptly. In its latest economic brief, the institution emphasised that consistent and timely payments to suppliers are key to stimulating business confidence, promoting job creation, and fostering overall economic growth.\n\nGovernment arrears to private sector suppliers weaken business operations and contribute to a slowdown in economic activity, the World Bank noted in its report.\n\nBusiness leaders say confidence in the governments procurement processes has been severely eroded, with contractors and suppliers increasingly reluctant to engage in public projects.\n\nThis isnt just about outstanding invoices, said another executive within the ZNCC. Its about trust. Right now, that trust has been broken, and it will take more than promises to restore it.\n\nThe continued financial mismanagement has prompted calls for urgent reform in public sector spending and procurement to avoid further economic deterioration.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwean government’s persistent failure to pay its service providers on time has pushed several companies to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/15/broke-government-fails-to-pay-service-providers/\">Continue reading<span class=\"screen-reader-text\"> \"Broke Government Fails To Pay Service Providers\"</span></a></p>",
            "time": "09:50",
            "date": "16 Jul 2025"
        }
    ]
}