{
    "news": [
        {
            "title": "Mnangagwa Bunks Funeral Of ZANU Accident Victims Killed Driving To Celebrate His Own Birthday.",
            "url": "https://www.zimeye.net/2025/09/18/mnangagwa-bunks-funeral-of-zanu-accident-victims-killed-driving-to-celebrate-his-own-birthday/",
            "content": " Mnangagwa Skips Burial of Aides Killed on Way to His Birthday Bash.\n\nBy Farai D Hove | ZimEye | Harare, 18 September 2025  A storm is brewing online after it emerged that President Emmerson Mnangagwa is not attending the burial of two ZANU PF loyalists who died on their way to his birthday celebrations in Zvishavane on 15 September.\n\nZANU PF Mash West Chairpersons secretary Nokutenda Shambare (22) and party youth member Mainah Mangombe (25) perished in a gruesome head-on collision between their Toyota GD6 and a ZUPCO bus on the Gweru-Zvishavane highway. They were reportedly travelling to the Presidents birthday event dubbed Munhumutapa Celebrations.\n\nTheir tragic deaths have sparked widespread public outrage and accusations of elitist abandonment, after Mnangagwa was seen enjoying the festivities, while the bereaved families were left to bury their children alone.\n\nTwitter user @SMbavari posted a scathing comment:\n\nChinongo nakidza pazviri  they died on their way to someones birthday, but the very someone is not attending their burial. Haaa zvinoda pfungwa izvi. Business as usual.\n\nThe emotional tweet has gone viral, drawing thousands of views and hundreds of reactions, with many Zimbabweans questioning the moral priorities of the ruling elite.\n\nShambare will be buried today at Glen Forest Cemetery in Harare, while Mangombe will be laid to rest in Sanyati.\n\nZANU PF has remained silent on whether any senior party official will represent the President at either funeral.\n\nMeanwhile, Wicknell Chivayo, a known close ally of Mnangagwa, has continued flaunting luxury and wealth online, fuelling further resentment among grieving citizens.\n\nThis tragedy and the leaderships absence at the funerals have become a symbol of the widening disconnect between the Zimbabwean elite and the suffering masses who continue to sacrifice in the name of political loyalty.\n\nMore updates to follow.\n\n #ZANUPF #ED2030 #ZvishavaneCrash #ChivayoFiles #ZimbabwePolitics #BreakingNews\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "🟥 Mnangagwa Skips Burial of Aides Killed on Way to His Birthday Bash. By Farai D Hove | ZimEye | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/mnangagwa-bunks-funeral-of-zanu-accident-victims-killed-driving-to-celebrate-his-own-birthday/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Bunks Funeral Of ZANU Accident Victims Killed Driving To Celebrate His Own Birthday.\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "“Zimbabwe Belongs to All of Us,” Chamisa Declares Amid Economic Chaos",
            "url": "https://www.zimeye.net/2025/09/18/zimbabwe-belongs-to-all-of-us-chamisa-declares-amid-economic-chaos/",
            "content": "By Tinashe Sambiri\n\nHarare  As Zimbabwe continues to grapple with economic collapse and mounting social unrest, Citizens Alliance leader Advocate Nelson Chamisa delivered a stirring message on Thursday, insisting that the country must belong to all its people, not just a select few.\n\nZimbabwe is ours. Zimbabwe is us. It belongs to us all, not to a few, Chamisa declared, condemning the concentration of power and resources in the hands of a privileged elite. He urged citizens to reclaim their role as active stewards of the nation.\n\nDescribing the country as a gift from God, Chamisa warned that it is being allowed to deteriorate due to mismanagement and neglect. Zimbabwe is neither party nor personal property. This jewel is Gods gift to us all. We, the people, are Gods stewards of this jewel. We cannot fold our hands while it fades, he said.\n\nChamisa also called for a collective effort to restore Zimbabwes dignity and potential. Zimbabwe is too precious to be left dying and decaying. Zimbabwe must shine. Come, let us reason together, he added, emphasizing the need for unity and active participation from citizens across all communities.\n\nHis statement comes amid rising inflation, fuel shortages, and the collapse of public services, frustrations that have intensified public discontent and political tension. By invoking the hashtag #OnePeople, Chamisa reinforced his appeal for solidarity and shared responsibility in steering the nation toward recovery and progress.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Harare – As Zimbabwe continues to grapple with economic collapse and mounting social unrest, Citizens Alliance leader … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/zimbabwe-belongs-to-all-of-us-chamisa-declares-amid-economic-chaos/\">Continue reading<span class=\"screen-reader-text\"> \"“Zimbabwe Belongs to All of Us,” Chamisa Declares Amid Economic Chaos\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "CIO Boss Bounces Back",
            "url": "https://www.zimeye.net/2025/09/18/cio-boss-bounces-back/",
            "content": "By A Correspondent Former Central Intelligence Organisation (CIO) director-general Isaac Moyo has bounced back into government service after being appointed Zimbabwes new Ambassador to the United Arab Emirates (UAE), less than a year after his abrupt dismissal from the spy agency.\n\nThe appointment, announced in the latest Government Gazette by Chief Secretary to the President and Cabinet, Martin Rushwaya, marks a dramatic return for Moyo. He replaces Ambassador Lovemore Mazemo, who has been reassigned to South Africa.\n\nThe Gazette also confirmed other diplomatic reshuffles: Patrick Ronald Mutasa heads to Cuba, Mazemo takes over in Pretoria from David Douglas Hamadziripi, who is now posted to Washington as Zimbabwes ambassador to the United States.\n\nMoyos deployment to Abu Dhabi comes after his February 2024 sacking, which shocked many in government circles. His ouster from the CIO, alongside that of then Police Commissioner-General Godwin Matanga, was never officially explained but was widely linked to internal rivalries within the security sector and growing factional battles in Zanu PF ahead of the 2028 elections.\n\nA career diplomat before leading the intelligence service, Moyo was appointed CIO boss in December 2017 following President Emmerson Mnangagwas rise to power after the ouster of Robert Mugabe. He succeeded long-serving spy chief Happyton Bonyongwe, who had briefly served as Justice Minister in Mugabes last cabinet.\n\nMoyo had previously served as Zimbabwes ambassador to South Africa and Lesotho, where he was instrumental in managing sensitive issues around migration, trade, and regional politics. He also represented the country at several international platforms and was widely regarded as a loyal foreign service technocrat.\n\nHis six years at the helm of the CIO were defined by controversy. Rights groups accused him of intensifying surveillance of opposition and civic groups, while critics claimed he oversaw a heavily politicised and factionalised intelligence service. These internal divisions were said to have played a role in his downfall.\n\nAnalysts view his new posting to the UAE as a strategic redeployment by Mnangagwaremoving him from the local political battleground while keeping him within the state machinery, especially given the growing importance of the UAE in Zimbabwes trade, gold exports, and investment diplomacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former Central Intelligence Organisation (CIO) director-general Isaac Moyo has bounced back into government service after being appointed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/cio-boss-bounces-back/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Boss Bounces Back\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "Blue Ribbon Foods Closes Bulawayo Milling Plant",
            "url": "https://www.zimeye.net/2025/09/18/blue-ribbon-foods-closes-bulawayo-branch/",
            "content": "By Business Reporter Blue Ribbon Foods, one of the countrys largest milling companies, has closed its Bulawayo plant after running out of maize grain, leaving dozens of jobs and household food security on the line.\n\nDuring a site visit on Monday, the companys Matabeleland North sales coordinator, Nqabutho Mkhize, revealed that all seven silos at the plant  each capable of holding 180 tonnes  have stood empty since April.\n\nWe have seven silos outside that hold about 180 tonnes each. They have been empty since April. We are wondering when they will actually have full capacity again, said Mkhize.\n\nAt full operation, the plant runs two shifts daily, employing 34 workers per shift and producing up to 60 tonnes of maize meal. But for months, the production floor has been silent, with workers livelihoods hanging in the balance.\n\nBlue Ribbons shutdown follows a wave of company closures and retrenchments across key sectors. Big retailers such asOK Zimbabwe,TM Pick n Pay, and wholesalers likeN. Richards Grouphave all scaled back operations, citing a combination of foreign currency shortages, collapsing consumer demand, and unreliable supply chains.\n\nIndustry insiders warn that the closure of milling plants will worsen food insecurity in urban areas already grappling with shortages of basic commodities.\n\nDavid Moyo, chairperson of the Grain Millers Association of Zimbabwe (GMAZ) Southern Region, said the crisis stems from acute shortages of maize.\n\nNow it is hard to fill even a 30-tonne truck. Some days, all we get is two or three 50kg bags. It can take a whole week just to fill one truck, said Moyo.\n\nThe shortages have been compounded by the governments June decision to ban maize imports, a move justified at the time by what now appear to beinflated harvest figures.\n\nIn May, President Emmerson Mnangagwa told the Zanu PF Central Committee that Zimbabwe had secured a bumper harvest. Lands and Agriculture Minister Anxious Masuka later claimed the country had harvested2.9 million tonnes of cereals, comfortably above the 2.2 million tonnes needed for national consumption.\n\nBut independent economists, including Tinashe Murapata, have since dismissed those figures, placing actual production closer toone million tonnes less than half of what was budgeted in the 2025 national estimates.\n\nThe mismatch between government claims and market realities has forced companies such as Sunset Marketing, National Foods, Mathokozisi Milling, and Bulateke Milling to either scale down or retrench workers, leaving the milling sector in crisis.\n\nTrade experts warn that Zimbabwe could facesevere maize shortages within weeksif the government continues to block imports. Jacques Pieener of Commodity Insight Africa said the policy reflects political expediency rather than market logic.\n\nThe government is prioritising optics over reality, but the consequences will be catastrophic. If this continues, Zimbabwe could soon be facing a food crisis of its own making, Pieener said.\n\nEconomists caution that the closure of mills will not only pushmealie meal prices to new highsbut also increase the risk of hunger among urban households already reeling from rising inflation and unemployment.\n\nMoyo urged authorities to deregulate maize imports to save jobs and protect consumers.\n\nWe are not asking for handouts. The private sector is here to complement government efforts. But we need an environment where maize can be imported freely and prices set by the market. Ultimately, deregulating maize imports will make mealie meal affordable for every Zimbabwean.\n\nAs industrial giants fall one by one and retailers shutter branches across the country, the collapse of Blue Ribbons Bulawayo plant has become the latest symbol of Zimbabwes deepening economic crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – Blue Ribbon Foods, one of the country’s largest milling companies, has closed its Bulawayo plant after running … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/blue-ribbon-foods-closes-bulawayo-branch/\">Continue reading<span class=\"screen-reader-text\"> \"Blue Ribbon Foods Closes Bulawayo Milling Plant\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "“I Am 100% Strong”: Mnangagwa Praises Himself As Public Services Collapse",
            "url": "https://www.zimeye.net/2025/09/18/i-am-100-strong-mnangagwa-praises-himselfas-public-services-collapse/",
            "content": "By A Correspondent\n\nHarare  President Emmerson Mnangagwa used his 83rd birthday celebrations at ZANU PF headquarters to boast about his strength and vitality, a display critics say underscores his detachment from the daily hardships of ordinary Zimbabweans.\n\nAddressing party staffers who staged a surprise celebration before a Politburo meeting, Mnangagwa joked about his age while taking credit for his longevity. I want to thank you, my colleagues in the party who are celebrating with me on my 83rd birthday. I have another 83 years to go. I will clock another 83, he declared, drawing laughter from loyal supporters.\n\nThe President insisted that his survival and energy were gifts from God. Let me assure you that this is the Grace of God, it is not my design or anybodys design. It is the will of God that I reach that age. I dont feel it, I think sometime in future I might begin feeling the age but for now I am strong, he said.\n\nWhile Mnangagwa celebrated with carvings, pictures, and adoring cadres, millions of Zimbabweans continue to grapple with a collapsing economy, skyrocketing inflation, and failing public services. Critics say his boasts of strength and vitality reveal a leadership insulated from the harsh realities affecting ordinary citizens.\n\nIt is shocking that Mnangagwa can joke about being strong while hospitals lack medicine, schools struggle to operate, and families cannot afford basic food, said one political analyst. These celebrations may amuse party staffers, but they mock the daily struggles of the nation.\n\nObservers also warn that Mnangagwas focus on his personal health and longevity highlights a government more concerned with self-celebration than addressing Zimbabwes crises. His quips about living another 83 years have fueled concerns that he intends to cling to power indefinitely, prolonging the nations hardships while securing his personal legacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – President Emmerson Mnangagwa used his 83rd birthday celebrations at ZANU PF headquarters to boast about … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/i-am-100-strong-mnangagwa-praises-himselfas-public-services-collapse/\">Continue reading<span class=\"screen-reader-text\"> \"“I Am 100% Strong”: Mnangagwa Praises Himself As Public Services Collapse\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "ED Redeploys Key Diplomats",
            "url": "https://www.zimeye.net/2025/09/18/ed-redeploys-key-diplomates/",
            "content": "By A Correspondent  President Emmerson Mnangagwa has reshuffled Zimbabwes diplomatic corps, reassigning several senior envoys to new postings in a move that underscores the administrations bid to consolidate foreign relations in key capitals.\n\nAccording to the latest Government Gazette published Wednesday by Chief Secretary to the President and Cabinet, Martin Rushwaya, former Central Intelligence Organisation (CIO) director-general Isaac Moyo has been appointed Ambassador to the United Arab Emirates (UAE). His posting marks a dramatic comeback less than a year after his surprise dismissal as spy chief in February 2024.\n\nMoyo replaces Ambassador Lovemore Mazemo, who has been reassigned to South Africa. Mazemo takes over from David Douglas Hamadziripi, who has been moved to Washington as Zimbabwes new envoy to the United States. Patrick Ronald Mutasa will now head to Cuba.\n\nMoyos new deployment draws particular attention given his high-profile exit from the CIO, where his six-year tenure was marred by allegations of politicisation of the intelligence service and internal factional rifts. While his removal last year was never officially explained, it coincided with a sweeping shake-up in the security sector that also claimed Police Commissioner-General Godwin Matanga.\n\nA seasoned diplomat before his foray into intelligence, Moyo previously served as Zimbabwes ambassador to South Africa and Lesotho, where he helped navigate sensitive issues around migration and trade. His return to diplomatic service in Abu Dhabi is viewed as a strategic redeployment, positioning him in a Gulf state that has become increasingly important for Zimbabwes trade, investment, and gold exports.\n\nThe broader reshuffle signals Mnangagwas attempt to strengthen diplomatic engagement in critical regionsSouth Africa as Zimbabwes largest trading partner, the United States as a key power centre on sanctions and foreign policy, Cuba as a long-time ally, and the UAE as a vital economic partner.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has reshuffled Zimbabwe’s diplomatic corps, reassigning several senior envoys to new postings in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/ed-redeploys-key-diplomates/\">Continue reading<span class=\"screen-reader-text\"> \"ED Redeploys Key Diplomats\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "Top Mnangagwa Aide Undressed In Chinhoyi",
            "url": "https://www.zimeye.net/2025/09/18/top-mnangagwa-aide-undressed-in-chinhoyi/",
            "content": "By A Correspondent  One of President Emerson Mnangagwas alllies, Justice Minister Ziyambi Ziyambi was publicly humiliated on Sunday by Zanu PF youths during a provincial inter-district conference at Chinhoyi University of Technology, as frustrations over unfulfilled promises boiled over.\n\nThe angry exchanges centred on land distribution and the much-publicised Presidential Heifer Scheme. Ziyambi, who was delivering an address, was jeered and interrupted three times, forcing fellow politburo member and Health and Child Care Minister Douglas Mombeshora to step in. His attempts to calm the delegates were, however, met with more hostility.\n\nYoung party members accused the leadership of issuing offer letters for non-existent land and prioritising the 2030 agenda over promises made for 2028.\n\nEfforts by provincial chairperson Mary Mliswa-Chikoka to restore order also failed, with the crowd growing louder in its demands. It was only after Mashonaland West War Veterans League chairperson Happison Muchechetere intervened that tempers cooled and proceedings resumed.\n\nDespite the disruption, the conference concluded with limited discussions, adopting only one resolution: to endorse the extension of President Emmerson Mnangagwas term beyond 2028. The resolution, echoing a similar decision made at last years Bulawayo conference, stated:\n\nAs Mashonaland West province has unanimously resolved, we call for the immediate implementation of our resolution to endorse and affirm His Excellency Dr Emmerson Mnangagwa as the first secretary for Zanu PF and President of Zimbabwe to continue serving in both capacities until 2030.\n\nNewsDays attempts to obtain comment from Mliswa-Chikoka were unsuccessful, while provincial secretary for information and vice-chairperson Misheck Nyarubero declined to discuss what he described as a sensitive matter involving national leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – One of President Emerson Mnangagwa’s alllies, Justice Minister Ziyambi Ziyambi was publicly humiliated on Sunday by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/top-mnangagwa-aide-undressed-in-chinhoyi/\">Continue reading<span class=\"screen-reader-text\"> \"Top Mnangagwa Aide Undressed In Chinhoyi\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "Prosecutors Seek Death Penalty Over Killing of Political Activist Charlie Kirk",
            "url": "https://www.zimeye.net/2025/09/18/prosecutors-seek-death-penalty-over-killing-of-political-activist-charlie-kirk/",
            "content": "By A Correspondent\n\nUtah authorities are moving swiftly in the case of political activist Charlie Kirk, who was fatally shot last week at Utah Valley University, announcing plans to pursue the death penalty against the 22-year-old charged in connection with the killing.\n\nTyler Robinson faces multiple charges, including aggravated murder, weapon offenses, and obstruction of justice, in a case that has drawn national attention. He is scheduled to appear in court later today.\n\nCounty Attorney Jeff Gray described the crime as especially heinous, citing what he called aggravating factors behind the decision to seek the ultimate penalty. The defendant is believed to have targeted Charlie Kirk based on his political expression and did so knowing children were present and would witness the homicide, Gray said.\n\nInvestigators say Robinsons DNA was discovered on the trigger of the gun used in the attack that claimed Kirks life at the age of 31.\n\nAuthorities also allege that Robinson attempted to cover up the crime. Prosecutors claim he instructed his roommate to delete incriminating texts related to the killing and to stay silent if questioned. Additional obstruction charges stem from claims that Robinson disposed of the firearm and clothing worn during the shooting.\n\nRobinson has been held without bail since his arrest. The investigation has extended to his family home, located 240 miles from the university, as authorities continue to piece together the events leading to the tragedy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Utah authorities are moving swiftly in the case of political activist Charlie Kirk, who was fatally shot … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/prosecutors-seek-death-penalty-over-killing-of-political-activist-charlie-kirk/\">Continue reading<span class=\"screen-reader-text\"> \"Prosecutors Seek Death Penalty Over Killing of Political Activist Charlie Kirk\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "Harare-Beitbridge Road Upgrade Plagued by Delays and Dangerous Detours",
            "url": "https://www.zimeye.net/2025/09/18/harare-beitbridge-road-upgrade-plagued-by-delays-and-dangerous-detours/",
            "content": "By A Correspondent\n\nHARARE  While the government claims that the upgrading of the Harare-Masvingo-Beitbridge Road has entered its final stage, road users paint a very different picture, describing ongoing detours and hazardous conditions along the route.\n\nOn Tuesday, authorities announced that 497 kilometres of the 580-kilometre road are open to traffic, leaving 83 kilometres yet to be completed. However, motorists say progress on the ground tells another story.\n\nIts only a month ago I used Masvingo-Beitbridge road and there was a lot detour. I hope its the one that is already fixed because uuuum someone almost lost their pregnancy because of that road, one commuter commented.\n\nIsaac Mhofu Skies added: The road has to be completed soon after Masvingo to Mwenezi is an isore. Only lots of detours but no work is being done. Seems mari yakadyiwa paya.\n\nOther users echoed similar frustrations. Sam Deltas wrote, Since this road started, still not yet finished. Its a shame. Samson Marufu called the stretch between Masvingo and Ngundu shambolic, while Sibanda N Sibbs highlighted that from Chibi turnoff to Nyanda, detours have persisted for more than two years.\n\nTumai Manyerere also lamented, After Masvingo towards Beitbridge, detour riripo rinorwadza. Dai wakagadzirisa, wopedza mvura isati yatanga kunaya.\n\nThe ongoing delays have raised concerns about road safety and accountability, as citizens continue to face dangerous conditions on one of Zimbabwes most important transport corridors. Despite official assurances, motorists are left questioning when the upgrade will be fully completed and whether authorities can finally deliver on their promises.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE — While the government claims that the upgrading of the Harare-Masvingo-Beitbridge Road has entered its “final … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/harare-beitbridge-road-upgrade-plagued-by-delays-and-dangerous-detours/\">Continue reading<span class=\"screen-reader-text\"> \"Harare-Beitbridge Road Upgrade Plagued by Delays and Dangerous Detours\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        },
        {
            "title": "Zimbabwe Now Has More Refugees Than During the War of Liberation",
            "url": "https://www.zimeye.net/2025/09/18/zimbabwe-now-has-more-refugees-than-during-the-war-of-liberation/",
            "content": "By Jacob Kudzayi Mutisi | More than four decades after independence, there are now more Zimbabwean refugeeslabelled as diasporansscattered across the globe than there ever were during the liberation struggle. What was once a proud nation fighting for self-rule has become a source of mass migration, burdening regional neighbours and the wider international community.\n\nAccording to aid agencies, millions of Zimbabweans are living in South Africa, Botswana, Mozambique, the UK, Canada, and Australia, many of them classified as asylum seekers or refugees. This exodus is not driven by war, but by economic collapse, political instability, and a lack of opportunity at home. Families are split across borders, professionals abandon careers, and young Zimbabweans see leaving as the only path to survival.\n\nThe irony is glaring. At independence in 1980, the government promised empowerment, dignity, and prosperity. Today, Zimbabweans are among the most mobile populations in Africa, fleeing the very system that was supposed to liberate them. This movement has become a regional crisis, stretching public services in South Africa, straining humanitarian aid budgets in Europe, and creating diplomatic friction with host nations.\n\nThe truth is clear: Zimbabwe cannot continue on this path. The government urgently needs a new strategy that goes beyond rhetoric.\n\nFirst, economic revival must be prioritised. Citizens need jobs, a stable currency, and predictable policies that allow businesses to thrive. Without this, migration will only accelerate.\n\nSecond, governance must be strengthened. Corruption, patronage, and lack of accountability push Zimbabweans to despair. Restoring trust in public institutions will give citizens a reason to invest their energies at home rather than abroad.\n\nThird, empowerment must move from slogans to reality. Zimbabwe is rich in land, minerals, and human talent, yet these resources remain trapped by poor planning. Giving citizens real access to credit, land-use rights, and modern training will unleash productivity and reduce dependency.\n\nFinally, the government must recognise that this is not just a domestic issue. The refugee crisis is destabilising the region and tarnishing Zimbabwes global reputation. By engaging sincerely with international partnersrather than blaming sanctions or outsidersZimbabwe can rebuild confidence and attract the investment needed to anchor people at home.\n\nThe liberation struggle was about reclaiming dignity and control over destiny. Todays struggle is about stopping a dangerous exodus that undermines the very sovereignty so hard won. Empowering Zimbabweans to stay, work, and prosper in their homeland is not just a moral imperative; it is a survival strategy for the nation.\n\nIf bold action is not taken now, history will record this as the era when Zimbabwe lost more of its people to migration than it ever did to war. The time to act is now.\n\nEngineer Jacob Kudzayi Mutisi\n\n+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Jacob Kudzayi Mutisi | More than four decades after independence, there are now more Zimbabwean refugees—labelled as “diasporans”—scattered across … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/18/zimbabwe-now-has-more-refugees-than-during-the-war-of-liberation/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Now Has More Refugees Than During the War of Liberation\"</span></a></p>",
            "time": "06:40",
            "date": "19 Sep 2025"
        }
    ]
}