{
    "news": [
        {
            "title": "UEFA Fines Yamal and Lewandowski for Doping Control Breach",
            "url": "https://www.zimeye.net/2025/08/09/uefa-fines-yamal-and-lewandowski-for-doping-control-breach/",
            "content": "Sports Correspondent\n\nUEFA has handed FC Barcelona financial penalties following their Champions League semi-final exit to Inter Milan at San Siro, hitting two of the clubs star players with sanctions.\n\nAccording to Marca, Lamine Yamal and Robert Lewandowski will each pay a 5,000 fine for failing to immediately report for post-match doping control as required by competition regulations.\n\nWhile the breach carries no sporting consequences, the lapse in procedure has raised concerns about the clubs adherence to UEFAs strict compliance protocols.\n\nThe governing body has been firm in enforcing its rules, and this latest disciplinary action serves as a reminder that even minor procedural oversights can come at a cost for Europes top clubs.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent UEFA has handed FC Barcelona financial penalties following their Champions League semi-final exit to Inter Milan at San … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/uefa-fines-yamal-and-lewandowski-for-doping-control-breach/\">Continue reading<span class=\"screen-reader-text\"> \"UEFA Fines Yamal and Lewandowski for Doping Control Breach\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "RBZ Reports ZiG Usage Uptake",
            "url": "https://www.zimeye.net/2025/08/09/rbz-reports-zig-usage-uptake/",
            "content": "By Business Reporter The Reserve Bank of Zimbabwe (RBZ) has reported a 14-percentage-point surge in the use of the Zimbabwe Gold (ZiG) currency to 40% as of June 2025, up from 26% in April 2024, when it was introduced.\n\nWhile the central bank hails this as a sign of growing acceptance, deep-rooted distrust of local currencies and Zimbabwes long history of monetary collapse continue to cloud its prospects.\n\nZimbabwes currency woes date back to the early 2000s, when economic mismanagement, land reform disruptions, and collapsing production triggered hyperinflation.\n\nBy 2008, inflation had spiraled out of control, forcing the country to abandon the Zimbabwe dollar in early 2009 and adopt a multicurrency system dominated by the US dollar.\n\nThe local currency made a comeback in 2016 with the introduction of bond notes, initially pegged 1:1 to the greenback, but the peg quickly collapsed under market pressure.\n\nIn 2019, the RBZ reintroduced the Zimbabwe dollar (ZWL) and banned foreign currency transactions, but runaway inflation  driven by fiscal indiscipline, money printing, and exchange rate controls  eroded its value almost immediately.\n\nBy 2022, the ZWL was virtually worthless, and the economy was again heavily dollarised.\n\nAgainst this backdrop, the ZiG  backed by gold and introduced on April 5, 2024  was touted as a stable alternative. Yet its rollout has been dogged by limited public trust, restricted cash availability, and an entrenched preference for the US dollar in everyday transactions.\n\nRBZ governor John Mushayavanhu, in the newly released 2025 Mid-Term Monetary Policy Statement, said the increase in ZiG usage reflected improved macroeconomic stability. The proportion of electronic ZiG in the National Payments System rose from 26% in April 2024 to over 40% in June 2025, Mushayavanhu said, adding that demand for ZiG cash had also risen.\n\nThe RBZ has instructed banks to ensure at least 3% of their ZiG deposits are available as cash, in line with regional benchmarks. It has also ordered all banks to distribute ZiG through ATMs by the end of September 2025, with over ZiG200 million in cash currently in bank vaults awaiting distribution.\n\nMushayavanhu said work was underway to modernise ZiG banknotes, with redesigned notes at an advanced stage of production.\n\nHowever, the ZiGs value remains volatile, sustained largely by strict central bank exchange rate controls and tight monetary policy  a strategy that in the past has often led to sudden market distortions once controls are loosened.\n\nThe RBZs ultimate goal is to fully abandon the multicurrency regime by 2030, leaving the ZiG as the sole legal tender. But this raises fresh fears among Zimbabweans who vividly remember the forced conversions of foreign currency accounts in 2019 and earlier. Stakeholders at the policy review consultations urged the bank to present a clear de-dollarisation roadmap, protect foreign currency accounts, and guarantee that USD-denominated contracts would be honoured beyond 2030.\n\nWhile the RBZ paints the ZiGs uptake as a sign of growing confidence, economists warn that without deep structural reforms, transparent fiscal management, and genuine market trust, the currency risks following the same path as its ill-fated predecessors. In Zimbabwes turbulent monetary history, official optimism has often masked the underlying fragility  and many fear the ZiG could become the latest chapter in that cycle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – The Reserve Bank of Zimbabwe (RBZ) has reported a 14-percentage-point surge in the use of the Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/rbz-reports-zig-usage-uptake/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Reports ZiG Usage Uptake\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "45 Years After Independence, Chinamasa Blames Western Forces For Sabotaging Economic Progress",
            "url": "https://www.zimeye.net/2025/08/09/45-years-after-independence-chinamasa-blames-western-forces-for-sabotaging-economic-progress/",
            "content": "By A Correspondent\n\nZanu PF Secretary for Legal Affairs, Patrick Chinamasa, spoke out strongly on Friday, accusing Western governments of ongoing efforts to undermine Zimbabwes sovereignty and economic development, even 45 years after independence.\n\nChinamasa made these remarks during a Virtual Working Meeting of the Standing Committee of the International Movement Forum of Supporters of the Struggle against Modern Practices of Neocolonialism For the Freedom of Nations, held on Thursday, 31 July 2025.\n\nThe meeting brought together political figures and representatives from various countries, including Russia, Venezuela, Serbia, Zimbabwe, China, Cuba, and others.\n\nIn his five-minute contribution, Chinamasa reaffirmed ZANU PFs unwavering commitment to combating neocolonialism and highlighted the urgent need for new international mechanisms to oversee elections, free from Western interference.\n\nHe declared: ZANU PF should stand counted as a worthy supporter of the Forum of Supporters of the Struggle against Modern Practices of Neocolonialism For the Freedom of Nations.\n\nChinamasa further claimed:\n\nThe Global South, particularly liberation movements, face deliberate attacks from Western governments and their proxies aiming to effect regime change through manipulation of electoral processes.\n\nRecent social unrest and violence in the 2024 elections in Mozambique and South Africa were orchestrated by Western proxies, exposing the reality of electoral neocolonialism as a threat to national sovereignty.\n\nZimbabwes 2023 Harmonised Elections were similarly targeted, with an observer mission head acting as a puppet in the service of the West producing an unfounded adverse report intended to destabilize the country and ZANU PF, violating international norms and the UN Charter.\n\nNeocolonialism today takes many subtle forms, including the imposition of foreign democratic standards that do not fit local contexts, and the manipulation of electoral technology and voter registration systems under the guise of technical assistance.\n\nForeign aid is often made conditional on adopting specific electoral reforms, thereby undermining Zimbabwes sovereignty.\n\nWestern governments exploit media and social media platforms to manipulate public opinion against ruling liberation parties.\n\nThey selectively weaponize human rights rhetoric to interfere in sovereign electoral processes, following a do as I say, not as I do approach.\n\nForeign governments provide financial, technical, and moral support to opposition parties in Zimbabwe, aiming to tilt electoral outcomes.\n\nIllegal economic sanctions imposed over 25 years constitute economic terrorism designed to cripple Zimbabwes economy and influence elections against ZANU PF.\n\nNGOs and civil society organizations funded by Western governments act as proxies to influence elections and maintain neocolonial control. Chinamasa called for prohibiting NGOs from political lobbying or backing opposition parties in Zimbabwe.\n\nThere were even attempts by Western intelligence agencies to hack into the Zimbabwe Electoral Commissions voter database and election processes during the 2023 elections.\n\nChinamasa concluded with a warning to skeptics: Those who have eyes, let them eye, and those who have ears, let them ear. Nokuti hatigoni kurega kutaura izvi, takoona neizvotakanzwa.\n\nHis remarks reaffirm ZANU PFs position that Western interference remains the biggest obstacle to Zimbabwes true economic progress and political independence, decades after colonial rule officially ended.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Secretary for Legal Affairs, Patrick Chinamasa, spoke out strongly on Friday, accusing Western governments of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/45-years-after-independence-chinamasa-blames-western-forces-for-sabotaging-economic-progress/\">Continue reading<span class=\"screen-reader-text\"> \"45 Years After Independence, Chinamasa Blames Western Forces For Sabotaging Economic Progress\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "JUST IN – COS Workers Face Mass Sackings As Govt tears up Sponsor Licences",
            "url": "https://www.zimeye.net/2025/08/09/just-in-cos-workers-face-mass-sackings-as-govt-tears-up-sponsor-licences/",
            "content": " MIGRANT CARE CRISIS \n\nSTATE-SPONSORED SLAVERY CLAIM AS UK RIPS UP JOB VISAS\n\nThousands of foreign care workers could be kicked out of Britain after a shock Home Office crackdown thats already wiping out entire companies overnight.\n\nBy A Correspondent | ZimEye | New rules  branded state-sponsored slavery by campaigners  are revoking sponsor licences if employers cant prove they paid full wages for the last three years, even when there was no work available.\n\nFrom 22 July, migrant carers must earn at least 25,000 a year (12.80/hr), compared to 12.20/hr for British staff  a 60p gap fuelling workplace tensions and sparking fears of discrimination claims.\n\nThis isnt about dodgy bosses anymore, said one furious immigration adviser. The enemy is the Government. They want the deportation numbers before the election  and they dont care who gets destroyed.\n\nThe care sector warns it cant survive the hike, with fluctuating hours and lost council contracts making it impossible to guarantee salaries. Some employers have drained personal savings to keep workers on  but many are now folding.\n\nA Hands of Justice Campaign with Amnesty International is gearing up for legal war, calling the policy a human rights breach.\n\nSupplementary work clampdown: COS visa holders risk deportation if they take side gigs outside the official shortage list  from hairdressing to hosting events  even if its just 20 hours a week.\n\nBottom line: The Tories are tightening the screws, and thousands of carers could be jobless, homeless and on a plane home before Christmas a statement by one of the campaigners alleged.\n\nA comment from the home office was not possible at the time of writing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "💥 MIGRANT CARE CRISIS 💥 “STATE-SPONSORED SLAVERY” CLAIM AS UK RIPS UP JOB VISAS Thousands of foreign care workers could … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/just-in-cos-workers-face-mass-sackings-as-govt-tears-up-sponsor-licences/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN – COS Workers Face Mass Sackings As Govt tears up Sponsor Licences\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "Watch: Mutsvangwa’s Empty Rhetoric On Heroes Day",
            "url": "https://www.zimeye.net/2025/08/09/watch-mutsvangwas-empty-rhetoric-on-heroes-day/",
            "content": "By A Correspondent\n\nZANU PF Secretary for Information and Publicity, Christopher Mutsvangwa, on Friday delivered yet another speech heavy on slogans and light on substance, using the run-up to Heroes Day and Defence Forces Day to repeat tired political talking points.\n\nSpeaking at the partys headquarters in Harare, Mutsvangwa dwelled on the well-worn narrative linking the Defence Forces to the liberation struggle, insisting that August remains a sacred month in Zimbabwes history.\n\nHe spoke of the great sacrifices made by sons and daughters to restore the nations dignity, freedom, sovereignty, and independencesentiments that, while noble in theory, rang hollow for many citizens who see little connection between such rhetoric and the daily hardships they face.\n\nThe address, lacking in fresh ideas or acknowledgment of current national challenges, once again underscored how commemorations are being used as platforms for political self-praise rather than meaningful reflection or action.\n\nZANU PF Secretary for Information and Publicity, Cde Christopher Mutsvangwa, has underscored the significance of August in Zimbabwes national calendar, as it marks the commemoration of Heroes Day and Defense Forces Day. He noted that these two observances are closely linked, aspic.twitter.com/j3C2lDOV6r\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Secretary for Information and Publicity, Christopher Mutsvangwa, on Friday delivered yet another speech heavy on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/watch-mutsvangwas-empty-rhetoric-on-heroes-day/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Mutsvangwa’s Empty Rhetoric On Heroes Day\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "Togarepi Insists Mnangagwa Should Stay, Despite Growing Discontent",
            "url": "https://www.zimeye.net/2025/08/09/togarepi-insists-mnangagwa-should-stay-despite-growing-discontent/",
            "content": "By A Correspondent\n\nAt a recent inter-district meeting in Rusape, Zimbabwe Liberation War Collaborators Association (ZILWACO) national chairman Pupurai Togarepi made a series of optimistic claims regarding government support for war collaborators, while pushing the narrative that President Mnangagwa should remain in officedespite widespread dissatisfaction and delays in fulfilling promised benefits.\n\nTogarepi announced that a comprehensive housing scheme for war collaborators is in development as part of a broader government empowerment strategy, yet many remain sceptical about the pace and sincerity of delivery. At one point, representatives from the Government had not agreed on a way forward. They were instructed to reconcile their differences and I can assure you that they have reached an agreement.\n\nThe document is now with the President, ready for gazetting, Togarepi claimed, without providing a clear timeline.\n\nHe further expressed confidence in Mnangagwas leadership, stating, If he is doing good for us, why should he leave? This staunch endorsement comes amid growing criticism of the Presidents extended rule and questions about the countrys stalled progress.\n\nHighlighting the governments efforts, Togarepi announced plans to launch housing stands for war collaborators, noting that the President has initiated this process, demonstrating his appreciation for war collaborators even before the gazetting of other benefits. He revealed a US$500,000 allocation for related projects, although critics argue this amount is insufficient given the number of beneficiaries and the scope of needs.\n\nRegarding land ownership, Togarepi said the Ministry of Lands would provide title deeds to war collaborators who received farms during the Land Reform Programme, emphasizing that they will only pay a token amount for land ownership, reflecting their struggle for land rights. However, concerns remain over the slow pace of land formalization and persistent bureaucratic obstacles.\n\nHe portrayed war collaborators as authentic ZANU PF members, claiming, You do not need to campaign to these individuals. Such statements ignore growing fractures within the party and the broader publics demand for accountability.\n\nDr Jenfan Muswere, ZANU PF Central Committee member and Minister of Information, acknowledged the long delay in addressing war collaborators grievances but attempted to reassure them. We attained independence in 1980, but it took a considerable amount of time for the Government to address many of your grievances, he said. However, under the New Dispensation, we crafted the Veterans of the Liberation Struggle Act Although the journey has been long, we are nearing its end.\n\nMuswere praised the governments infrastructural projects and food relief efforts, claiming, Fortunately, no one succumbed to hunger. Yet, many citizens continue to face food insecurity and economic hardships.\n\nHe also stressed Mnangagwas commitment: Our President possesses a fatherly heart and is a listening President He will never abandon you. Such paternalistic rhetoric does little to conceal the administrations failure to deliver timely benefits and meaningful empowerment.\n\nAdvocate Misheck Mugadza echoed the sentiment, saying Mnangagwas Vision 2030 encapsulates the aspirations of war collaborators, urging them to actively participate in the economy. But critics argue that this vision remains distant and vague for many struggling Zimbabweans.\n\nDespite the optimistic assurances, the meeting exposed deep cracks in promises made to war collaborators and the public. Togarepis call to keep Mnangagwa in power ignores growing frustrations with prolonged delays, unfulfilled commitments, and an administration increasingly seen as out of touch with the needs of its people.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent At a recent inter-district meeting in Rusape, Zimbabwe Liberation War Collaborators Association (ZILWACO) national chairman Pupurai Togarepi … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/togarepi-insists-mnangagwa-should-stay-despite-growing-discontent/\">Continue reading<span class=\"screen-reader-text\"> \"Togarepi Insists Mnangagwa Should Stay, Despite Growing Discontent\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "Police Nab 143 Touts As Blitz Continues Against Rogue Elements On Country’s Roads",
            "url": "https://www.zimeye.net/2025/08/09/police-nab-143-touts-as-blitz-continues-against-rogue-elements-on-countrys-roads/",
            "content": "By A Correspondent\n\nPolice in Harare have intensified their crackdown on touts harassing pedestrians and passengers, arresting 143 individuals since Monday in a bid to restore order on the citys public transport routes.\n\nHarare provincial police spokesperson Inspector Luckmore Chakanza confirmed the arrests, which took place over four days: We arrested 25 touts on Monday, 30 on Tuesday, 45 on Wednesday, and 33 on Thursday. These operations are part of a broader effort targeting illegal kombi operators as well as those picking up passengers at unauthorised locations.\n\nThe crackdown responds to growing reports of harassment against travellers, raising serious concerns about safety in public transport. Inspector Chakanza emphasized the polices commitment to protecting the public, stating, During the blitz, 143 touts were arrested and taken to court. Police continue to warn touts over harassing pedestrians and passengers.\n\nMany of those apprehended are expected to remain in Remand Prison over the extended weekend as they await bail hearings.\n\nIn response to the escalating challenges, Commissioner Maxwell Chikunguru, Officer Commanding Harare Province, is scheduled to meet with kombi drivers and transport operators to discuss the fate of impounded vehicles currently held at the Chikurubi Police Support Unit yard. The meeting aims to clarify transport regulations and encourage compliance among operators.\n\nFurther, Commissioner Chikunguru will spearhead a traffic safety initiative at Mbare Musika, collaborating with stakeholders including the Traffic Safety Council of Zimbabwe, the City of Harare, the Vehicle Inspection Department, and transport associations. This joint effort is designed to improve safety standards and rebuild public trust in Harares transport system.\n\nAs police sustain their operations, the community awaits updates not only on the crackdown on touts but also on the ongoing investigation into a recent rape caseboth underscoring the urgent need for comprehensive safety reforms in public transport.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Police in Harare have intensified their crackdown on touts harassing pedestrians and passengers, arresting 143 individuals since … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/police-nab-143-touts-as-blitz-continues-against-rogue-elements-on-countrys-roads/\">Continue reading<span class=\"screen-reader-text\"> \"Police Nab 143 Touts As Blitz Continues Against Rogue Elements On Country’s Roads\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "Shocking Details in Natalie Mhandu’s Witchcraft Case",
            "url": "https://www.zimeye.net/2025/08/09/shocking-details-in-natalie-mhandus-witchcraft-case/",
            "content": "By Crime and Courts Reporter  Disturbing revelations have surfaced in the sensational case in which Harare socialite Natalie Mhandu is accused of engaging in witchcraft rituals targeting her acquaintances.\n\nMhandu recently appeared before Harare magistrate Sikhethile Moyo on charges of witchcraft. She was not asked to plead and was released unconditionally, having come directly from her home.\n\nAccording to the State, the controversy began when Mhandu allegedly persuaded her former maid, Elizabeth Mharire (48), to accompany her to a traditional healer, Christine Matashupopularly known as Manjenjenjein Glen Norah. From there, the trio reportedly travelled to Churu Farm in Glen View to conduct a ritual.\n\nIt is alleged that at a secluded spot on the farm, Matashu produced a red cloth and wrote down several names, including Mwarianesu, Amanda, Ishmael, and Tariro Maumbe. She then sprinkled snuff on the cloth and instructed Mhandu to dig a hole, bury the cloth along with a knife (bakata), and recite her wishesdirections Mhandu allegedly followed.\n\nThe case took a bizarre turn on 5 July, when Mharire returned home to find snuff scattered in her bedroom and on the toilet seat. Upon questioning, Mhandu reportedly claimed she had accidentally dropped it, later suggesting it was the work of Mharires ancestral spirit.\n\nThe maid resigned shortly after, accusing Mhandu of casting a harmful spell. She further alleged that Mhandu deleted all the photos from her phone to prevent them from being shared online. On 14 July, Mharire accompanied the complainant to Churu Farm, where the buried cloth and knife were allegedly dug up.\n\nMhandu is expected back in court on 13 August for the start of her trial, which has already drawn widespread public interest due to its unusual and sensational allegations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – Disturbing revelations have surfaced in the sensational case in which Harare socialite Natalie Mhandu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/shocking-details-in-natalie-mhandus-witchcraft-case/\">Continue reading<span class=\"screen-reader-text\"> \"Shocking Details in Natalie Mhandu’s Witchcraft Case\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "Mutsvangwa Praises Past, Ignores Present Suffering Of Citizens",
            "url": "https://www.zimeye.net/2025/08/09/mutsvangwa-praises-past-ignores-present-suffering-of-citizens/",
            "content": "By A Correspondent\n\nZANU PF Secretary for Information and Publicity, Christopher Mutsvangwa, on Friday delivered a speech filled with slogans but devoid of meaningful substance, using the approach to Heroes Day and Defence Forces Day as yet another opportunity to recycle stale political rhetoric.\n\nSpeaking at the ZANU PF headquarters in Harare, Mutsvangwa leaned heavily on the overused narrative linking the Defence Forces to the liberation struggle, declaring August a sacred month in Zimbabwes history.\n\nWhile he spoke of the great sacrifices made by sons and daughters to restore the nations dignity, freedom, sovereignty, and independence, the remarks rang hollow for many citizens grappling with poverty, unemployment, and declining public servicesissues left conspicuously unaddressed.\n\nThe speech, lacking any fresh policy direction or tangible solutions, highlighted how national commemorations continue to be hijacked for political self-congratulation rather than serving as genuine moments of reflection or commitment to improving the lives of ordinary Zimbabweans.\n\nZANU PF Secretary for Information and Publicity, Cde Christopher Mutsvangwa, has underscored the significance of August in Zimbabwes national calendar, as it marks the commemoration of Heroes Day and Defense Forces Day. He noted that these two observances are closely linked, aspic.twitter.com/j3C2lDOV6r\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Secretary for Information and Publicity, Christopher Mutsvangwa, on Friday delivered a speech filled with slogans … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/mutsvangwa-praises-past-ignores-present-suffering-of-citizens/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Praises Past, Ignores Present Suffering Of Citizens\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        },
        {
            "title": "City of Harare Confirms Eastwind Trust Regularisation Plan",
            "url": "https://www.zimeye.net/2025/08/09/city-of-harare-confirms-eastwind-trust-regularisation-plan/",
            "content": "By A Correspondent| City of Harare Housing Director, Addmore Nhekairo has confirmed that a Eastwind Trust, a land development company owned by Rodgers Pote and Trymore Arineshito is among the more than 40 cooperatives set for regularisation.\n\nEastwind Trust holds a significant piece of land in Mabvuku-Donnybrooke.\n\nDuring a hearing before Harare Magistrate Tapiwa Banda on Thursday, Nhekairo revealed that there are currently 40 land developers awaiting regularisation in Harare.\n\nNotably, Nhekairo stated that former Zanu PF legislator for Mt Pleasant Jason Passadi who has been fighting for the same piece pf land is not on the list of regularisation list.\n\nThis development follows Eastwind Trusts recent complaint against the state owned, The Herald for publishing what they deemed inaccurate information regarding their regularisation status.\n\nEastwind Trusts representatives argued that the medias portrayal of their status has harmed their reputation.\n\nIn an official statement, Eastwind Trust said: An article published by a local newspaper titled Suspected land barons threatening state witnesses, court told, contains gross inaccuracies and misrepresentations about us as Eastwind Trust.\n\nThe company emphasized that as a responsible and reputable organization, it felt compelled to correct what it termed a false narrative.\n\nThe statement continued: The articles claims that the companys representatives are threatening state witnesses, as revealed in a court cross-examination, are entirely unfounded and based on malicious intent.\n\nThe trust clarified that there had been no cross-examination regarding Passadi, stating, There is no cross-examination on Passadi that has taken place, as the last court hearing on Friday was postponed to April 3.\n\nEastwind Trust asserted, Our record speaks for itself, and we have the evidence to prove it. The articles assertion that we are threatening state witnesses is a blatant fabrication.\n\nMoreover, they emphasized their commitment to ethical business practices.\n\nWe have always conducted our business with the utmost integrity and transparency, and we are law-abiding citizens.\n\nThe company expressed disappointment in the local newspapers lack of journalistic integrity, stating, It is clear that the article was written with a predetermined agenda, rather than a genuine interest in reporting the facts.\n\nEastwind Trust called on stakeholders, customers, and the public to be wary of mis-information: We urge our stakeholders, customers, and the general public to be cautious of misinformation and seek out credible sources.\n\nThey expressed confidence that a thorough examination of the facts will reveal the truth about Eastwind Trust officials and our commitment to excellence.\n\nThe statement concluded with an invitation for inquiries: We invite anyone seeking accurate information about Eastwind Trust to contact us directly. We are always happy to provide the facts and set the record straight.\n\nAdditionally, the company indicated that it would pursue legal action against The Herald.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| City of Harare Housing Director, Addmore Nhekairo has confirmed that a Eastwind Trust, a land development company … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/09/city-of-harare-confirms-eastwind-trust-regularisation-plan/\">Continue reading<span class=\"screen-reader-text\"> \"City of Harare Confirms Eastwind Trust Regularisation Plan\"</span></a></p>",
            "time": "20:45",
            "date": "09 Aug 2025"
        }
    ]
}