{
    "news": [
        {
            "title": "Cash Reward For Bosso Rising Star",
            "url": "https://www.zimeye.net/2025/08/06/cash-reward-for-bosso-rising-star/",
            "content": "By Sports Correspondent\n\nHighlanders rising talent Mvelo Khoza has been recognised for his outstanding performances, walking away with the clubs Players Player of the Month award for July.\n\nThe young midfielder was honoured with a certificate and a US$500 cash reward courtesy of the Business Friends of Bosso (BFB), a group of local businesspeople dedicated to supporting the club and its players.\n\nKhozas consistent displays and growing influence on the pitch have caught the attention of both fans and teammates, earning him the prestigious peer-voted accolade.\n\nThe award is seen as a significant morale booster for the youngster, who has quickly become one of the standout performers in the Bosso squad.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Highlanders’ rising talent Mvelo Khoza has been recognised for his outstanding performances, walking away with the club’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/cash-reward-for-bosso-rising-star/\">Continue reading<span class=\"screen-reader-text\"> \"Cash Reward For Bosso Rising Star\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "FC Platinum Dismiss Match-Fixing Allegations Against Players",
            "url": "https://www.zimeye.net/2025/08/06/fc-platinum-dismiss-match-fixing-allegations-against-players/",
            "content": "By Sports Correspondent\n\nFC Platinum has strongly refuted recent allegations linking its senior team players to alleged match-fixing, describing the claims as unsubstantiated and damaging.\n\nIn an official statement released on August 5, the club emphasized its commitment to ethical conduct, transparency, and adherence to all relevant laws and regulations.\n\nFC Platinum operates with integrity and adheres strictly to all relevant laws, regulations, and ethical standards, the statement read. We view these allegations with the seriousness they deserve and are currently reviewing all options available to address this matter appropriately.\n\nThe club urged both the media and the public to avoid spreading misinformation that could tarnish reputations without evidence.\n\nWe urge the public and the media to refrain from spreading unverified information that can cause unwarranted reputational damage, the statement continued. Should further clarification be necessary, we remain open to transparent engagement through the appropriate channels.\n\nFC Platinum concluded by stating that no further comments would be made at this stage.\n\nThe statement comes amid growing speculation on social media, with unnamed sources suggesting impropriety involving members of the senior squad. The clubs swift response aims to contain potential fallout and affirm its stance against any form of corruption in football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent FC Platinum has strongly refuted recent allegations linking its senior team players to alleged match-fixing, describing the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/fc-platinum-dismiss-match-fixing-allegations-against-players/\">Continue reading<span class=\"screen-reader-text\"> \"FC Platinum Dismiss Match-Fixing Allegations Against Players\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "Dealing With Ringworm In Cattle…",
            "url": "https://www.zimeye.net/2025/08/06/dealing-with-ringworm-in-cattle/",
            "content": "By Dr. Trywell Muzerengi\n\nRingworm in cattle  medically referred to as Dermatophytosis  is a contagious fungal skin infection caused by dermatophytes, and not actual worms, despite its misleading name. It primarily affects young calves, especially during the cold winter months when cattle are housed in crowded, poorly ventilated environments.\n\n Causative Agent\n\nThe main culprit in cattle is the fungus Trichophyton verrucosum, which specifically targets bovines.\n\n Transmission\n\nRingworm is highly contagious and can spread through:\n\nDirect contact with infected animals\n\nContaminated objects, including brushes, halters, and fences\n\nEnvironmental spores, which can survive for months\n\nPoor barn conditions, especially overcrowding and lack of ventilation\n\n Clinical Signs\n\nFarmers should look out for:\n\nCircular, greyish-white crusty lesions\n\nPatchy hair loss (alopecia), especially on the head, ears, neck, shoulders, and back\n\nScaly or raised skin that may be mildly itchy\n\nMore severe infections in young, malnourished, or immunosuppressed cattle\n\n Zoonotic Risk\n\nRingworm can also infect humans, particularly farm workers and children, causing red, itchy, ring-shaped rashes on the skin. This highlights the importance of early detection and proper hygiene.\n\n Diagnosis\n\nThough often diagnosed based on appearance, confirmation methods include:\n\nSkin scraping and microscopy (KOH preparation to see fungal hyphae)\n\nFungal culture\n\nWoods lamp test (note: not reliable for T. verrucosum)\n\n Treatment Options\n\nWhile Dermatophytosis often self-cures, treatment is recommended to prevent spread:\n\nIdeal for mild or localized cases:\n\nLime sulfur (1:16) or Enilconazole (1:100) rinse\n\nTwice-a-week applications\n\nOther options: Miconazole, Iodine, or Chlorhexidine washes\n\nRemove crusts with a brush and discard the brush and burn the infective material, advises veterinary guidelines.\n\nFor severe or outbreak scenarios:\n\nGriseofulvin (restricted in food animals in some regions)\n\nIvermectin (some antifungal effect but not first-line)\n\nClean and disinfect barns, feeding troughs, and grooming tools\n\nUse antifungal disinfectants such as bleach (1:10 solution)  though some vets caution that bleach can be irritating and hazardous to humans\n\n Recovery & Immunity\n\nLesions can take weeks to fully heal\n\nImmunity generally develops after infection, making reinfection rare in older animals\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Ringworm in cattle — medically referred to as Dermatophytosis — is a contagious fungal skin infection … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/dealing-with-ringworm-in-cattle/\">Continue reading<span class=\"screen-reader-text\"> \"Dealing With Ringworm In Cattle…\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "Mnangagwa Caught In Magunje Land Grab Scandal",
            "url": "https://www.zimeye.net/2025/08/06/mnangagwa-caught-in-magunje-land-grab-scandal/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas administration is under growing pressure after revelations that a US$1 billion cement and mining project in Magunje was approved without following proper legal and environmental procedures.\n\nThe scandal has triggered outrage from traditional leaders, villagers, and civil society, who accuse the government of trampling on citizens rights in pursuit of investment.\n\nThe backlash comes after Tafadzwa Muguti, the Permanent Secretary in the Office of the President and Cabinet responsible for devolution, publicly rebuked the Environmental Management Agency (EMA) for issuing an Environmental Impact Assessment (EIA) certificate to a cement company  despite the fact that it does not have verified legal claim to the land.\n\nEMA, I dont know what kind of kickback you received, but it is highly improper to grant an EIA to someone who has no legitimate claim to the land, Muguti said during a heated engagement in Mashonaland West.\n\nThat EIA should never have been issued.\n\nLocal chiefs and community leaders have slammed the project as an unlawful intrusion on communal land, approved without consultation or consent.\n\nThis dam is used by villagers, the army and Magunje residents. No investor should be allowed to poison it because of shortcuts, Muguti warned. Even the President pays taxes to his local authority. Why should an anonymous investor operate tax-free and outside Government control?\n\nHe also revealed that Labenmon Investments had not obtained licensing from the Zimbabwe Investment and Development Agency (ZIDA), nor had it engaged the local Rural District Council. Even more alarming, the investors physical address remains unknown.\n\nIn what appears to be a desperate attempt to contain the fallout, Muguti said the decision on whether the project proceeds would now rest with the provincial leadership  but only if the project complies with all legal frameworks.\n\nI told Minister Chombo and the provincial chairperson, if the province wants the project, it must be done properly. Lets reach consensus. But if there is crime involved, we arrest, because thats what the Office of the President and Cabinet does under its mandate, he said.Development is our national agenda, but it must be lawful and transparent.\n\nThe Centre for Natural Resource Governance (CNRG) added fuel to the fire last month by calling for an immediate suspension of the project. The watchdog reported cases of forced displacement, desecration of ancestral graves, and intimidation of local villagers and activists.\n\nWhile government officials had touted the project as a game-changing investment set to create 5,000 jobs, communities on the ground say it has brought only fear, division, and disregard for the rule of law.\n\nWith chiefs and citizens demanding answers, and civil society turning up the heat, the Mnangagwa regime is now caught in a storm of its own making  one that could cost far more than just a cement plant.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s administration is under growing pressure after revelations that a US$1 billion cement and mining … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/mnangagwa-caught-in-magunje-land-grab-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Caught In Magunje Land Grab Scandal\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "Tungwarara, Zanu PF Affiliates Invade Masvingo Ahead Of By-election",
            "url": "https://www.zimeye.net/2025/08/06/tungwarara-zanu-pf-affiliates-invade-masvingo-ahead-of-by-election/",
            "content": "By A Correspondent\n\nPresidential Advisor Dr. Paul Tungwarara descended on Masvingo on Tuesday to officiate at the launch of a revolving empowerment fundjust weeks before the Ward 7 by-election set for September 13a move critics say smacks of political opportunism disguised as development.\n\nTungwarara, who serves as the Presidential Special Advisor on Investment, led the disbursement of funds under the Presidential Empowerment Revolving Fund at a provincial event held at the Masvingo Showgrounds.\n\nWeve brought US$150,000 specifically for war veterans in Masvingo, as a clear demonstration that the President is a man of action, not just words, Tungwarara told attendees.\n\nThe $150,000 cash package for war veterans was presented as part of President Emmerson Mnangagwas grassroots empowerment agenda. However, the timing of the handover has sparked criticism.\n\nUnder the direct instruction of President Mnangagwa, the Presidential Special Advisor on Investment, Dr. Paul Tungwarara was in Masvingo Province today spearheading the disbursement of the Presidential Empowerment Revolving Fund, a transformative initiative designed to uplift and energize grassroots communities, declared a Zanu PF official during the ceremony.\n\nDespite the official tone of the event, political observers have criticised the move as a thinly veiled campaign tactic.\n\nWith the by-election just weeks away, many are questioning whether the funds rollout is driven by a desire to secure votes rather than a genuine commitment to community empowerment\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Presidential Advisor Dr. Paul Tungwarara descended on Masvingo on Tuesday to officiate at the launch of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/tungwarara-zanu-pf-affiliates-invade-masvingo-ahead-of-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Tungwarara, Zanu PF Affiliates Invade Masvingo Ahead Of By-election\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "Prominent Opposition Activist Dies",
            "url": "https://www.zimeye.net/2025/08/06/prominent-opposition-activist-dies/",
            "content": "By A Correspondent\n\nNgundu-based opposition activist and former councillor Amato Ndekere has died.\n\nHe passed away on Wednesday morning at Neshuro Hospital in Mwenezi at approximately 10:45 AM.\n\nHis death was confirmed by his sister, Mercy Ndekere, who spoke to Change Radio.\n\nAccording to family sources, Ndekere was discovered unconscious outside his homestead late Tuesday evening.\n\nDespite efforts to save him, he succumbed to his condition the following morning after being rushed to the hospital.\n\nAmato Ndekere was a key figure in Zimbabwes opposition politics, particularly in Chivi South.\n\nHe rose to prominence after defeating a ZANU PF candidate in the hotly contested 2008 elections during the leadership of the late President Morgan Tsvangirai.\n\nHe served as Ward 25 councillor from 2008 to 2013.\n\nNdekere also held the distinction of being the longest-serving District Chairperson for the Movement for Democratic Change (MDC) in Chivi South, a position he maintained since the partys formation in 1999.\n\nLater in his political career, he aligned himself with the Citizens Coalition for Change (CCC), joining the new party following its formation by Advocate Nelson Chamisa. However, he parted ways with the CCC after Chamisas departure from the organisation.\n\nMourners have begun to gather at his family home in Ngundu to pay their respects, a citizens leader in Masvingo said. Burial arrangements will be announced in due course, reflecting the profound impact Mr. Ndekere had on his community and the political landscape of the region.\n\nNdekeres unwavering commitment to the opposition and grassroots mobilisation efforts earned him respect across the political divide. His death marks the end of a significant chapter in Chivi Souths opposition history.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Ngundu-based opposition activist and former councillor Amato Ndekere has died. He passed away on Wednesday morning at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/prominent-opposition-activist-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Opposition Activist Dies\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "Chamisa Says Truth About 2018, 2023 Election Rigging Will Come Out",
            "url": "https://www.zimeye.net/2025/08/06/chamisa-says-truth-about-2018-2023-election-rigging-will-come-out/",
            "content": "By Tinashe Sambiri\n\nCitizens leader Advocate Nelson Chamisa has once again challenged the legitimacy of Zimbabwes previous two general elections, accusing the Emmerson Mnangagwa-led regime of rigging both the 2018 and 2023 polls.\n\nIn a strongly worded statement issued on Wednesday, Chamisa insisted that the truth about the disputed outcomes cannot remain hidden forever and declared that Zimbabweans had overwhelmingly voted for changeonly to be denied their will through electoral manipulation.\n\nThe truth cannot be buried, Chamisa declared. The fullness of time will vindicate us, no matter how nay and doomsayers might try to blur the lines of truth and history.\n\nHe claimed that citizens had voted for his leadership in both elections.\n\nDear citizens, you won emphatically in 2018 and prevailed again in 2023, he said. Sooner or later, the honest truth about what exactly transpired in the last two elections shall come out.\n\nUsing African proverbs to reinforce his message, Chamisa added, That which has horns cannot be wrapped! Okulempondo akufihlwa emgodleni. Rine manyanga hariputirwe.\n\nWhile Chamisa has repeatedly accused the ruling ZANU PF party of manipulating electoral outcomes, Zimbabwes electoral commission and the government have consistently denied allegations of rigging. However, both the 2018 and 2023 elections were widely criticised by international observers for lacking transparency and fairness.\n\nChamisa ended his message with the hashtag #TheNewRise and his signature phrase #GodIsInIt, signaling continued defiance and hope for what he calls a citizens government.\n\nThe opposition leaders statement has reignited debate over the credibility of Zimbabwes electoral processes and the unresolved grievances stemming from the last two national votes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Citizens leader Advocate Nelson Chamisa has once again challenged the legitimacy of Zimbabwe’s previous two general elections, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/chamisa-says-truth-about-2018-2023-election-rigging-will-come-out/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Says Truth About 2018, 2023 Election Rigging Will Come Out\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "Fire Destroys Chipinge Commercial Building, Goods Worth Thousands Lost",
            "url": "https://www.zimeye.net/2025/08/06/fire-destroys-chipinge-commercial-building-goods-worth-thousands-lost/",
            "content": "Property worth thousands of dollars was destroyed after a fire engulfed a commercial building housing over ten shops in Chipinge Tuesday afternoon.\n\nPanic gripped the town of Chipinge after the building housing hardware and electrical gadgets caught fire.\n\nOne of the shops was completely engulfed by the inferno, while others were partially damaged.\n\nWe just saw fire flames on this building, but we are yet to ascertain the cause of the fire.\n\nA lot of goods have been burnt. The people of Chipinge are united as we managed to bring out a lot of goods from the shops to reduce losses.\n\nWe are saddened by the outbreak of fire, but we give credit to the fire tenders for putting of the fire. Without their response, the damage could have been greater, Chipinge residents said.\n\nThere was also a swift response by the Civil Protection unit with fire tenders arriving at the scene in time to salvage the situation.\n\nWe commend the Civil Protection Unit for their swift response. The fire was intense, but our fire tenders from both the Town Council and the RDC managed to contain it before spreading further. Reports say one of the batteries exploded, and there are a lot of hardware and plastics and other flammable materials that made the fire quickly escalate. Only one shop out of ten was completely gutted, said Chipinge District Development Coordinator, Mr William Mashava.\n\nWhile the cause of the fire is still being investigated, the full extent of the damage is yet to be confirmed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Property worth thousands of dollars was destroyed after a fire engulfed a commercial building housing over ten shops in Chipinge … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/fire-destroys-chipinge-commercial-building-goods-worth-thousands-lost/\">Continue reading<span class=\"screen-reader-text\"> \"Fire Destroys Chipinge Commercial Building, Goods Worth Thousands Lost\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "New Opposition Party Vows to End ZANU PF’s Firm Grip on Power",
            "url": "https://www.zimeye.net/2025/08/06/new-opposition-party-vows-to-end-zanu-pfs-firm-grip-on-power/",
            "content": "By A Correspondent\n\nFreedom Fighters for Change (FFC) President Michael Makaza has vowed to dismantle ZANU PFs decades-long hold on power, as the newly formed political party gears up for its official launch on September 13, 2025, in Harare.\n\nIn a defiant statement issued on Tuesday, Makaza declared that the launch would mark the beginning of a new political era in Zimbabwe  one focused on uprooting corruption, ending economic decay, and restoring dignity to citizens.\n\nSeptember 13, 2025, a new era dawns in Zimbabwe! Makaza proclaimed. Join us in Harare as we officially launch the Freedom Fighters for Change party.\n\nHe called on Zimbabweans from all walks of life to attend the event in large numbers, describing it as a symbolic break from oppression.\n\nTell a friend to tell a friend: the time for change is here! Celebrate with us as we bid farewell to sorrow and hello to a brighter future, he said.\n\nMakazas message comes at a time when Zimbabwe is reeling from widespread economic instability, marked by soaring inflation, mass unemployment, and collapsing public services  conditions many blame on ZANU PFs continued misrule.\n\nCome in thousands, come in hundreds of thousands! Lets witness the birth of a new Zimbabwe together, he urged.\n\nThe FFC positions itself as a youth-driven, reformist alternative to ZANU PF, which has ruled Zimbabwe since independence in 1980. The party has pledged to tackle systemic corruption, rejuvenate the economy, and put citizens welfare at the centre of governance.\n\nAs the countdown to the launch begins, the FFCs bold rhetoric is setting the stage for what could become a serious challenge to the ruling partys grip on power.\n\nMakaza believes the time has come: We are not just launching a party  we are launching a revolution for the people of Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Freedom Fighters for Change (FFC) President Michael Makaza has vowed to dismantle ZANU PF’s decades-long hold on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/new-opposition-party-vows-to-end-zanu-pfs-firm-grip-on-power/\">Continue reading<span class=\"screen-reader-text\"> \"New Opposition Party Vows to End ZANU PF’s Firm Grip on Power\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        },
        {
            "title": "Zimbabwe gvt rigged 2018 and 2023 elections",
            "url": "https://www.zimeye.net/2025/08/06/zimbabwe-gvt-rigged-2018-and-2023-elections/",
            "content": "Advocate Nelson Chamisa has raised the 2018 and 2023 election fraud. Below is what he posted on his  official Facebook page.\n\nTHE TRUTH CANNOT BE BURIEDThe fullness of time will vindicate us no matter how nay and doomsayers might try to blur the lines of truth and history. Sooner or later, the honest truth about what exactly transpired in the last 2 elections shall come out. You(dear citizens) won emphatically in 2018 and prevailed again in 2023. That which has horns cannot be wrapped! Okulempondo akufihlwa emgodleni. Rine manyanga hariputirwe. #TheNewRise #Godisinit\n\nWhat are your views on the above statement?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Advocate Nelson Chamisa has raised the 2018 and 2023 election fraud. Below is what he posted on his official Facebook … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/06/zimbabwe-gvt-rigged-2018-and-2023-elections/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe gvt rigged 2018 and 2023 elections\"</span></a></p>",
            "time": "18:39",
            "date": "07 Aug 2025"
        }
    ]
}