{
    "news": [
        {
            "title": "Minister Chadzamira in Job Sikhala Assassination Plot",
            "url": "https://www.zimeye.net/2025/07/19/minister-chadzamira-in-job-sikhala-assassination-plot/",
            "content": "By A Correspondent Masvingo Minister of State for Provincial Affairs, Ezra Chadzamira, has been implicated in the violent disruption of opposition politician Job Sikhalas book launch held in Masvingo last week,  a disruption that Sikhala has since described as an assassination attempt on his life.\n\nAccording to investigations by theMasvingo Mirror, the attack was carried out by a terror gang allegedly led by known Zanu PF activist Esau Mutanho and Zanu PF district youth secretary Mashingaidze Mabhucho.\n\nIt has since emerged that the group used a Zanu PF-branded Toyota Hilux Twin Cab (registration number AGE-0791), reportedly allocated to Chadzamira for his Masvingo West Constituency. Sources claim the youths involved in the disruption gathered at Dhiyo Shopping Centre, where Mutanho allegedly promised them generous payments from Minister Chadzamira once the mission was completed.\n\nSikhala, in response, has filed a US$150,000 lawsuit against Mutanho, whom he accuses of being central to what he now believes was a coordinated attempt on his life under the guise of political disruption.\n\nTheMirroris in possession of several videos allegedly showing Mutanho disrupting multiple events in Masvingo, including the Zanu PF primary elections in which Chadzamira was a contestant, and the Public Voluntary Organisations (PVO) Bill hearing held on May 16, 2024.\n\nEfforts to get a comment from Minister Chadzamira were unsuccessful. He did not answer calls nor respond to messages. Repeated visits byMirrorreporters to his offices at Benjamin Burombo Building also yielded no results, with officials saying he was away touring gold mines in the province.\n\nMutanho, who is also reportedly involved in illegal foreign currency dealings, refused to comment and instead accused the reporter of harassment.\n\nChadzamira is accused by sources of vowing to block all opposition meetings in the province, or any public gatherings that do not align with his political stance.\n\nOne of the youths involved in the disruption, Maguchu  reportedly unemployed and intoxicated at the time  told reporters he was proud of stopping the event. He claimed the speakers had insulted his President, in reference to President Emmerson Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Masvingo Minister of State for Provincial Affairs, Ezra Chadzamira, has been implicated in the violent disruption of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/minister-chadzamira-in-job-sikhala-assassination-plot/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Chadzamira in Job Sikhala Assassination Plot\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "Junior Makunike Punishes DeMbare",
            "url": "https://www.zimeye.net/2025/07/19/junior-makunike-punishes-dembare/",
            "content": "Sports Correspondent\n\nFormer Dynamos midfielder Junior Makunike returned to torment his old club, firing home an 84th-minute winner that handed Simba Bhora a crucial 1-0 win in a Castle Lager Premier Soccer League clash at Wadzanayi Stadium.\n\nWith Dynamos now battling to avoid relegation, the defeat adds to their growing woes in what has become a nightmare season for the once-mighty Harare giants. The result leaves DeMbare firmly entrenched in the bottom half of the table, with pressure mounting on both players and technical staff.\n\nDespite dominating possession for large parts of the game, Dynamos once again lacked a cutting edge in front of goal and were ultimately punished by a late sucker punch from one of their own. Makunike, composed and clinical, capitalised on a defensive lapse to seal the win for Simba Bhora.\n\nIt was a moment of heartbreak for DeMbare fans, who watched their team slump to another defeat  this time delivered by a familiar face. As Simba Bhora celebrated, Dynamos were left to confront an uncomfortable reality: the relegation zone is no longer a distant threat  its knocking at their door.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Former Dynamos midfielder Junior Makunike returned to torment his old club, firing home an 84th-minute winner that handed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/junior-makunike-punishes-dembare/\">Continue reading<span class=\"screen-reader-text\"> \"Junior Makunike Punishes DeMbare\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "Fired Gen Rugeje Set To China",
            "url": "https://www.zimeye.net/2025/07/19/fired-gen-rugeje-set-to-china/",
            "content": "By A Correspondent-Zanu PF has redeployed the fired Retired Lieutenant General Dr Engelbert Rugeje to China on a high-level agricultural investment mission, barely months after unceremoniously firing him from key ministerial boards, in a move widely interpreted as part of a broader purge targeting Vice President Constantino Chiwengas military allies.\n\nRugeje, once a prominent figure in the military-engineered 2017 coup that ousted the late Robert Mugabe and installed Mnangagwa, is leading a Zimbabwean delegation currently engaging the Jiangsu Academy of Agricultural Sciences (JAAS) in Nanjing. The Chinese expressed interest in collaborative projects with Zimbabwean universities and agricultural institutions, and a memorandum of mutual cooperation was reportedly reached.\n\nThe visit, while seemingly routine, comes under the shadow of deepening internal tensions in ZANU-PF.\n\nRecently Rugeje was among five senior retired military officers summarily removed from the boards of the Tobacco Industry and Marketing Board (TIMB) and the Agricultural Marketing Authority.\n\nSources familiar with the developments said the purged generals were suspected of resisting Mnangagwas reported bid to extend his presidency beyond 2028.\n\nFrequent flyer rewards\n\nThe dismissals have fuelled speculation of an intensifying cold war between Mnangagwa and Chiwenga, with the latest moves seen as part of a wider strategy to weaken the vice presidents influence ahead of a potentially explosive ZANU-PF elective congress.\n\nBoth Rugeje and Chiwenga were central to the 2017 military operation that propelled Mnangagwa to power, but relations have since deteriorated amid fierce succession battles.\n\nA source toldZimEyethat the removals were meant to test Chiwengas capacity to respond or revolt, and signaled a new phase in the political chess game within the ruling elite. Rugeje declined to comment, referring questions to the Ministry of Agriculture, which had not responded at the time of publication.\n\nDespite his demotion, Rugeje was all diplomacy in China, projecting loyalty to Mnangagwa and reiterating Zimbabwes commitment to inclusive, agriculture-led economic growth. He praised the presidents Vision 2030 agenda, which targets a US$13.75 billion agricultural economy by 2025up from an initial US$8.2 billion goal. He also outlined strategic plans under the Agriculture and Food Systems Transformation Strategy to triple agricultural output by 2030.\n\nWe see immense potential in sectors such as maize, wheat, cotton, livestock, poultry, and horticulture. These areas are ripe for investment and growth, Rugeje told Chinese officials.\n\nHis delegation extended an invitation to JAAS for joint research, student exchanges, and curriculum development to help modernise Zimbabwes agriculture sector through smart technologies and innovation.\n\nBut analysts say Rugejes reassignment to a largely technical diplomatic mission, stripped of his former policymaking influence, signals a deliberate sideliningpart of Mnangagwas broader strategy to dismantle the remaining networks loyal to Chiwenga within the state, military, and party structures.\n\nFrequent flyer rewards\n\nSince the 2023 elections, which Mnangagwa controversially won amid widespread allegations of rigging, political tensions within ZANU-PF have been rising. Chiwengas silence has only heightened intrigue around his political future, as key allies are gradually being removed from influential roles.\n\nWhat remains to be seen is whether Mnangagwas tactical purges will neutralise internal resistanceor provoke the same kind of backlash that once toppled Robert Mugabe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Zanu PF has redeployed the fired Retired Lieutenant General Dr Engelbert Rugeje to China on a high-level agricultural … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/fired-gen-rugeje-set-to-china/\">Continue reading<span class=\"screen-reader-text\"> \"Fired Gen Rugeje Set To China\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "Noni Madueke Joins Arsenal in £52m Move from Chelsea",
            "url": "https://www.zimeye.net/2025/07/19/noni-madueke-joins-arsenal-in-52m-move-from-chelsea/",
            "content": "Sports Correspondent\n\nLONDON  Arsenal have officially confirmed the signing of England winger Noni Madueke from Chelsea in a blockbuster 52 million ($67 million) deal.\n\nThe 22-year-old has signed a five-year contract with the Gunners, becoming the clubs fourth acquisition of the summer.\n\nMadueke joins goalkeeper Kepa Arrizabalaga and midfielder Martin Zubimendi as part of Mikel Artetas ongoing squad rebuild. The club is also finalising the transfer of Sporting CP striker Viktor Gyokeres.\n\nMaduekes arrival is expected to boost Arsenals attacking options ahead of a demanding season in both the Premier League and Champions League.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent LONDON – Arsenal have officially confirmed the signing of England winger Noni Madueke from Chelsea in a blockbuster … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/noni-madueke-joins-arsenal-in-52m-move-from-chelsea/\">Continue reading<span class=\"screen-reader-text\"> \"Noni Madueke Joins Arsenal in £52m Move from Chelsea\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "Police Deny Blocking MDC-T Meeting",
            "url": "https://www.zimeye.net/2025/07/19/police-deny-blocking-mdc-t-meeting/",
            "content": "By A Correspondent  Police have dismissed claims that they disrupted a scheduled MDC-T meeting at Morgan Richard Tsvangirai House, stating that officers were only deployed in response to violence among party members.\n\nIn a statement released on Friday, ZRP spokesperson Commissioner Paul Nyathi strongly refuted a report published by a local daily on 18 July 2025, titled Police block MDC-T meeting, accusing the media of misrepresenting facts.\n\nContrary to the newspapers claims, the Zimbabwe Republic Police did not block the meeting, said Nyathi.\n\nInstead, the Police was called to intervene and maintain law and order after violence erupted among feuding members during the gathering.\n\nHe said the police acted only after receiving a request for assistance when tensions escalated between rival MDC-T factions.\n\nAny insinuation by the media that the Police blocked the meeting is incorrect and misrepresents the correct circumstances on the ground, Nyathi added.\n\nThe ZRP urged journalists to uphold ethical standards and avoid distorting facts. The Zimbabwe Republic Police appeals to the media to report objectively and accurately, ensuring that the public is informed of the correct facts as they unfold, said Nyathi.\n\nThe MDC-T is yet to issue an official response to the ZRPs statement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Police have dismissed claims that they disrupted a scheduled MDC-T meeting at Morgan Richard Tsvangirai House, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/police-deny-blocking-mdc-t-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Police Deny Blocking MDC-T Meeting\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "WATCH LIVE: Tragedy on the Road: Six Members of the Malindi Family Perish in Horror Crash — One Survivor",
            "url": "https://www.zimeye.net/2025/07/19/watch-live-tragedy-on-the-road-six-members-of-the-malindi-family-perish-in-horror-crash-one-survivor/",
            "content": "By A Correspondent | A devastating road accident has claimed the lives of six members of the Malindi family in a horrific collision involving a haulage truck. The tragic incident occurred as the family was reportedly returning from a trip, with only one out of the seven passengers surviving the impact.\n\nImages from the crash scene reveal the familys white vehicle mangled beyond recognition after colliding with the heavy-duty truck along the Kurufuse stretch. Authorities confirmed that the crash resulted in the immediate deaths of the occupants, with emergency responders managing to pull out only one survivor, currently hospitalised in critical condition.\n\nThe deceased have been named as:\n\nThe Malindi family, remembered for their vibrant community presence, was mourned in an emotional candlelight vigil attended by scores of friends, relatives, and neighbours. Photos from the night show mourners clutching candles, standing in silence before a wall of family portraits and floral tributes.\n\nThe funeral services, coordinated by Boiketlong Funeral Directors, are scheduled as follows:\n\nMemorial Service: July 11, 2025\n\nBurial Day: July 12, 2025\n\nIn a message printed on the familys funeral programme, the words from Revelation 21:4 echo a promise of comfort:\n\nHe will wipe every tear from their eyes. There will be no more death or mourning or crying or pain, for the old order of things has passed away.\n\nThe cause of the accident is still under investigation, and road safety authorities have called for an urgent review of heavy truck operations on South Africas highways, especially during nighttime travel.\n\nThe nation mourns with the Malindi family and prays for the sole survivors recovery.\n\n May their souls rest in eternal peace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A devastating road accident has claimed the lives of six members of the Malindi family in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/watch-live-tragedy-on-the-road-six-members-of-the-malindi-family-perish-in-horror-crash-one-survivor/\">Continue reading<span class=\"screen-reader-text\"> \"WATCH LIVE: Tragedy on the Road: Six Members of the Malindi Family Perish in Horror Crash — One Survivor\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "Priorities Questioned as Govt Pushes Bill to Rebury Liberation War Heroes Amid Health Crisis",
            "url": "https://www.zimeye.net/2025/07/19/priorities-questioned-as-govt-pushes-bill-to-rebury-liberation-war-heroes-amid-health-crisis/",
            "content": "By A Correspondent\n\nThe Zimbabwean government is pushing ahead with a proposed law to exhume, repatriate, and rebury thousands of fallen liberation war heroes  a move raising eyebrows as the country grapples with a deteriorating public health system.\n\nThe legislation, currently under legal review, aims to support a nationwide and cross-border effort to recover the remains of combatants still buried in unmarked mass graves more than four decades after the countrys independence.\n\nMinister of War Veterans Affairs Monica Mavhunga defended the move during a press briefing in Harare on Thursday, insisting it is a matter of national dignity and historical justice.\n\nAs we continue to look after surviving veterans, it is not lost on Government that there is a need for memorialisation through repatriation, exhumation, reburials and related processes, she said. This legislation is a key step towards fulfilling the promises made by comrades during the war that no one would be left behind.\n\nThe announcement comes just weeks ahead of the Heroes and Defence Forces commemorations set for August 11 and 12, and as government hospitals face chronic shortages of medicine, equipment, and personnel.\n\nCritics say the exhumation programme, however noble, exposes misplaced priorities in a nation battling collapsing health services, rampant drug stockouts, and low doctor morale.\n\nStill, authorities are pressing ahead. Minister Mavhunga said the process would involve several ministries, veterans associations, traditional leaders, political structures, and even foreign governments.\n\nThe Ministry has approached the Office of the President and Cabinet to provide guidance on a coordinated approach, she said. We are working hand-in-hand with the Ministries of Home Affairs and Cultural Heritage; Local Government and Public Works; Foreign Affairs and International Trade and other stakeholders to ensure this is done in a dignified, inclusive and nationally guided manner.\n\nShe also commended the work already being done by the Fallen Heroes Trust of Zimbabwe and traditional leaders to identify and exhume remains in areas such as Masvingo, Hurungwe, Sanyati, and Rusape.\n\nI want to sincerely appreciate the work being done by the trusts, traditional leaders and communities who have kept this memory alive. Their role in identifying graves has been invaluable, Mavhunga said.\n\nMinister of Home Affairs and Cultural Heritage Kazembe Kazembe added that the programme transcends political and geographical boundaries.\n\nThese gallant sons and daughters are still our heroes, said Kazembe. Whether they lie at the National Heroes Acre or in the bush, they are the foundation of our independence. We are crafting not only policy, but also a historical correction. The journey towards their reburial has begun.\n\nMavhunga said efforts were also underway to locate and honour fighters buried beyond Zimbabwes borders.\n\nWe are engaging neighbouring countries to assist with the identification and possible repatriation of our fighters. In cases where repatriation isnt possible, we will ensure their resting places are marked and preserved, she said.\n\nIn a recent exhumation operation at Sanyati Rest Camp, the Fallen Heroes Trust unearthed the remains of 29 ZIPRA fighters and is preparing to return to exhume 15 more, a mix of ZIPRA and ZANLA cadres. A total of 64 remains  55 ZIPRA and 9 ZANLA  will soon be reburied at the Grand Parade in Hurungwe in a joint ceremony.\n\nAs the Bill moves through Parliament, the government insists it is fulfilling Zimbabwes promise to its liberators  but critics are left wondering whether the living are being forgotten in the process.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwean government is pushing ahead with a proposed law to exhume, repatriate, and rebury thousands of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/priorities-questioned-as-govt-pushes-bill-to-rebury-liberation-war-heroes-amid-health-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Priorities Questioned as Govt Pushes Bill to Rebury Liberation War Heroes Amid Health Crisis\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "Auxillia Mnangagwa Takes Over Shrine in Campaign-Style Spectacle",
            "url": "https://www.zimeye.net/2025/07/19/auxillia-mnangagwa-takes-over-shrine-in-campaign-style-spectacle/",
            "content": "By A Correspondent\n\nCHIMANIMANI  First Lady Auxillia Mnangagwas well-publicized development projects at the Apostolic Ejuwel Jekenisheni Church have sparked fresh controversy, with critics accusing her of using aid as a tool for political gain.\n\nThe projectslaunched in 2022were celebrated again this week during the churchs Passover Conference, with ZANU PFs top brass, including party National Chairperson Oppah Muchinguri-Kashiri, praising Mnangagwa for her visionary leadership in rural development.\n\nThese projects are evidence of Governments commitment to inclusive development and recognition of faith-based organisations as key partners, Muchinguri-Kashiri said during a tour of the Mabiya Shrine.\n\nMost of these are women empowerment projects this area is now a centre of excellence.\n\nBut not everyone is applauding.\n\nObservers say the six projectsrural electrification, a solar-powered borehole, a four-hectare commercial farm, a sewing centre, a goat-rearing scheme, and improved school infrastructureappear more like an electoral strategy than a genuine development initiative.\n\nThis is all meant to capture votes ahead of future polls, said a local civic leader. You dont just donate boreholes and goats to one church unless youre trying to manufacture loyalty.\n\nDespite the political suspicion, the practical benefits are visible. Local schools now have electric lighting, a first in the area. The solar borehole supplies clean water, and women are producing and selling uniforms thanks to sewing machines funded by the First Ladys office. One hundred goats are also expected to kickstart a livestock program.\n\nThe President is saying water is life. Let us complement the First Ladys work by taking care of this borehole, Muchinguri-Kashiri said.\n\nChurch officials were quick to defend the gesture. What the First Lady did here is more than charity. It changed how we think and live, said national chairperson Gwinyai Banganwa. Children are now going to better schools, people have clean water, and our women are making an income.\n\nBut critics remain skeptical, pointing out that such high-profile handouts in religious spaces blur the lines between faith, state, and party politics.\n\nIts campaign PR dressed as philanthropy, said a local teacher. Meanwhile, hospitals still lack basics like power and medicine.\n\nThe church has also entered talks with Marondera University of Agricultural Sciences and Technology to train congregants in agro-business, a move welcomed by both government and church representatives.\n\nStill, the lasting motive behind the First Ladys generosity remains under scrutiny. Today its goats and gifts, the civic leader said. Tomorrow, its ballots theyll be collecting.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent CHIMANIMANI – First Lady Auxillia Mnangagwa’s well-publicized development projects at the Apostolic Ejuwel Jekenisheni Church have sparked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/auxillia-mnangagwa-takes-over-shrine-in-campaign-style-spectacle/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa Takes Over Shrine in Campaign-Style Spectacle\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "World’s First Breakthrough Cancer Vaccine Patient, Launches Charity to Help Others",
            "url": "https://www.zimeye.net/2025/07/19/worlds-first-breakthrough-cancer-vaccine-patient-launches-charity-to-help-others/",
            "content": "By A Correspondent | ZimEye | LONDON  19 July 2025  The worlds first patient to receive a groundbreaking mRNA cancer vaccine has officially launched a charitable foundation to assist others battling the disease. Elliot Pfebve, a cancer survivor and UKs pioneering participant in the revolutionary personalised cancer vaccine trial, has unveiled the Pfebve Cancer Intervention and Support Foundation to raise awareness, fund care, and provide critical support to those navigating cancer.\n\nPfebve, who underwent the novel mRNA vaccine treatment in March 2024 as part of a historic trial at University Hospitals Birmingham, says his lived experience inspired him to give back. I want to use my journey to help others diagnosed with cancer navigate the complex systems available to them, he said. This Foundation is about hope, access, and empowerment.\n\nA GoFundMe campaign has now been launched to support the foundations setup, with a target of 5,000. The funds will cover vital startup processes such as professional documentation, workshops, and the development of an educational website.\n\nAims of the Foundation\n\nThe Pfebve Cancer Intervention and Support Foundation will focus on two core areas:\n\n1. Patient Support & Care\n\n2. Awareness & Education\n\nGlobal Support and Urgency\n\nWith cancer remaining a global crisisclaiming an estimated 10 million lives annuallyPfebves initiative has already attracted backing from medical professionals and patients worldwide. Data from Cancer Research UK reveals that 55% of global cancer deaths are among men, highlighting the urgent need for more targeted and accessible interventions.\n\nPfebves story has been featured extensively across major media outlets including BBC, Sky News, ITV, and Cancer Research UK, with headlines hailing the personalised vaccine as a landmark moment in oncology.\n\nCall for Donations\n\nSupporters can contribute through the official GoFundMe page. Only 55 has been raised so far, and Pfebve is appealing to the public, philanthropists, and corporate sponsors to help meet the initial 5,000 goal.\n\nThis is more than a fundraiser. Its a life-saving movement, Pfebve concluded.\n\nTo donate orlearn more, visit: Pfebve Cancer Intervention and Support Foundation on GoFundMe\n\nFollow updates via the official YouTube video: Cancer Treatment Breakthrough  Elliot Pfebve\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | LONDON – 19 July 2025 — The world’s first patient to receive a groundbreaking … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/worlds-first-breakthrough-cancer-vaccine-patient-launches-charity-to-help-others/\">Continue reading<span class=\"screen-reader-text\"> \"World’s First Breakthrough Cancer Vaccine Patient, Launches Charity to Help Others\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        },
        {
            "title": "Earthquake Hits Chimanimani …",
            "url": "https://www.zimeye.net/2025/07/19/earthquake-hits-chimanimani/",
            "content": "By A Correspondent\n\nCHIMANIMANI  Residents of Chimanimani were jolted awake in the early hours of Thursday morning after a 3.9 magnitude earthquake struck the region, though authorities say no damage or injuries were recorded.\n\nThe tremor occurred at 03:02 AM local time and was widely felt across the district, prompting concern and confusion among locals. Some residents reported their homes rattling and the ground briefly shaking.\n\nThe Meteorological Services Department (MSD) later confirmed the seismic event in an official statement, pinpointing the epicentre at Latitude -20.067 and Longitude 32.655, deep within Chimanimani.\n\nAn earthquake of magnitude 3.9 (Local Magnitude) occurred in Chimanimani on the 17th of July 2025 at 0302hrs local time, read the statement.\n\nMr Maringo, the Provincial Meteorological Officer for Manicaland, also confirmed the incident and said multiple residents had contacted the department to report feeling the tremor.\n\nThe MSD attributed the earthquake to ongoing tectonic activity linked to the East African Rift System, which stretches southward through Zimbabwe into Mozambique.\n\nThe earthquake was of moderate magnitude, and no reports of damage were received, the department said.\n\nWhile earthquakes of this magnitude are not uncommon in seismically active regions like Chimanimani, Thursdays event served as a reminder of the geological volatility that underpins parts of Manicaland Province.\n\nAuthorities have urged the public to remain calm but vigilant, and to report any aftershocks or related disturbances.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent CHIMANIMANI – Residents of Chimanimani were jolted awake in the early hours of Thursday morning after a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/19/earthquake-hits-chimanimani/\">Continue reading<span class=\"screen-reader-text\"> \"Earthquake Hits Chimanimani …\"</span></a></p>",
            "time": "06:53",
            "date": "20 Jul 2025"
        }
    ]
}