{
    "news": [
        {
            "title": "Bulawayo Endorses VP Chiwenga",
            "url": "https://www.zimeye.net/2025/09/26/bulawayo-endorses-vp-chiwenga/",
            "content": "By A Correspondent-Bulawayo-based Zanu PF stalwart Eliphas Mashaba has openly thrown his weight behind Vice-President Constantino Chiwenga in his bruising showdown with President Emmerson Mnangagwa over corruption allegations rocking the ruling party.\n\nSources who attended last weeks politburo said Mashaba, said corrupt figures aligned with the so-called Zvigananda cartel must face immediate arrest. He warned that conflating the fight against graft with the 2030 campaign to extend Mnangagwas rule beyond constitutional limits was a dangerous diversion that threatened Zanu PFs survival.\n\nHis remarks came as Chiwenga escalated his offensive, tabling a dossier implicating Mnangagwas close allies  Kudakwashe Tagwirei, Wicknell Chivayo, Pedzisayi Scott Sakupwanya, and Delish Nguwaya  in what he described as industrial-scale looting. He accused the businessmen of siphoning billions from state coffers while manipulating internal party politics through lavish patronage.\n\nThe explosive confrontation between Mnangagwa and his deputy, which began at State House before spilling into the politburo, laid bare the deepening factional rifts as succession battles intensify. Chiwengas demand that the Zviganandas be jailed shocked many, underscoring the existential stakes of the power struggle.\n\nMnangagwa, who denies plotting to overstay beyond 2028, responded with a sweeping politburo reshuffle aimed at weakening Chiwengas camp. Yet Mashabas intervention from Bulawayo highlights that grassroots voices within the party are increasingly rallying to the Vice-Presidents call for accountability.\n\nWith the annual party conference set for October in Mutare, the crisis has reached a boiling point. What began as an anti-corruption push has morphed into a defining battle for Zanu PFs future  one that pits the President against the very generals who helped install him in 2017.\n\nAs one politburo insider observed:The generals who toppled Mugabe are now turning on each other.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Bulawayo-based Zanu PF stalwart Eliphas Mashaba has openly thrown his weight behind Vice-President Constantino Chiwenga in his bruising … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/bulawayo-endorses-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Endorses VP Chiwenga\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "LEAKED AUDIO: All Clinics Shut Down As Nurses Are Ordered To Attend Tungwarara’s Presidential Money Meeting",
            "url": "https://www.zimeye.net/2025/09/26/leaked-audio-all-clinics-shut-down-as-nurses-are-ordered-to-attend-tungwararas-presidential-money-meeting/",
            "content": "LEAKED AUDIO: Zvimba Clinics Shut Down As Nurses Are Ordered To Attend Tungwararas Presidential Money Meeting.Good afternoon, (District Nursing Officers) DNO's. I hope I find you well. Please, there is an event for nurses that is happening tomorrow. Can we release our nurseshttps://t.co/Hn8KhXSFAxpic.twitter.com/tkANbCvYko\n\nGood afternoon, (District Nursing Officers) DNOs. I hope I find you well. Please, there is an event for nurses that is happening tomorrow. Can we release our nurses so that they can also benefit on these programs? Because its important. Vakasara, havana , chavanozo benefitter (they will lose out on the benefits). So allow them to go for this program in Kutama, so that they can also, if its financial, if its projects, theyll definitely benefit. So lets allow them to go to Kutama tomorrow. This is above board. Its known an national level, at provincial level. PMD (Provincial Medical Doctor) is aware, so lets allow them to go so that they can also benefit. I wish you the best, all the best for you. You can also go. Yes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "“Good afternoon, (District Nursing Officers) DNO’s. I hope I find you well. Please, there is an event for nurses that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/leaked-audio-all-clinics-shut-down-as-nurses-are-ordered-to-attend-tungwararas-presidential-money-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"LEAKED AUDIO: All Clinics Shut Down As Nurses Are Ordered To Attend Tungwarara’s Presidential Money Meeting\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "Prominent Harare Stripper Marries Top Pastor",
            "url": "https://www.zimeye.net/2025/09/26/prominent-harare-stripper-marries-top-pastor/",
            "content": "By Showbiz Reporter-A well-known Harare stripper, Vimbai Chocolate Muzuva, has married a pastor.\n\nOnce the queen of neon lights and smoky nightclubs, Chocolate, the pole dancer who captivated crowds with her sultry moves, has shed her sequins for the sanctity of the church.\n\nToday, she walks a very different stage, hand in hand with her new husband, a pastor, and draped not in glitter but in grace.\n\nGone are the raunchy costumes and blaring sound systems of Harares club scene. In their place: biblical scriptures, whispered prayers, and a new life of devotion.\n\nChocolate, as she was once famously known, has transformed into a born-again Christian, erasing her old contacts, changing her social media handles, and turning her gaze heavenward.\n\nHer metamorphosis has stunned many who knew her during her heyday as a dancer. Former manager Shepherd Sherpy Taz Tsandukwa, who once guided her career, could hardly hide his astonishment.\n\nI am glad that Chocolate has turned to God after winning her battle against drug abuse, he said. Many people knew her as the dancer who turned heads, but now she is a changed woman. I worked with her for years  even took her to China for a six-month tour. She had her storms, including drug abuse and even false accusations against me, but seeing her embrace Gods calling is truly a miracle.\n\nChocolates journey has been anything but smooth. At one point, she was consumed by drugs and alcohol, drifting into erratic behavior that alienated her friends.\n\nRehab brought her back from the brink, and today she sells beauty products in Glen View while supporting her husbands ministry.\n\nHarpers Mapimhidze, president of the Dancers Association of Zimbabwe (DAZ), echoed the same sense of wonder.\n\nI celebrated when I heard she had turned to God, Mapimhidze said. Earlier this year, she was unrecognizable  lost to drugs, violent, and out of control. But today, she is transformed, and her partner has shielded her from old friends to keep her from slipping back.\n\nHer reinvention has been accompanied by a digital rebirth.\n\nNow identifying asVimbai Muzuva, she fills her Facebook wall not with sultry poses but with biblical scriptures, daily affirmations of faith, and glimpses of her new life as a pastors wife.\n\nFrom the glare of strip-club spotlights to the quiet glow of church candles, Chocolates story is a testimony to the possibility of redemption.\n\nOnce compared to Beverly Sibanda and Zoey for her ability to outshine the fiercest dancers, she now seeks only to outshine her past.\n\nAnd for those who doubted her, she has one enduring message: it is never too late to rise from the ashes and dance to the rhythm of grace.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter-A well-known Harare stripper, Vimbai “Chocolate” Muzuva, has married a pastor.  Once the queen of neon lights and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/prominent-harare-stripper-marries-top-pastor/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Harare Stripper Marries Top Pastor\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "Auxillia Mnangagwa’s The One Who Got Mpofu Fired- Report",
            "url": "https://www.zimeye.net/2025/09/26/auxillia-mnangagwas-the-one-who-got-mpofu-fired-report/",
            "content": "ZIMBABWE IN A VERY TUMULTUOUS SITUATION\n\nBy Mandla Mpofu | The recent Politburo reshuffle in ZANU PF has significant implications for Zimbabwes political landscape, particularly regarding the relationship between President Emmerson Mnangagwa and his deputy, Vice-President Constantino Chiwenga. The reshuffle is widely seen as a direct retaliation against Vice-President Chiwenga for his anti-corruption stance and for his actions in the last Politburo.\n\nThe President made key changes with serious implications.\n\nThe demotion of Obert Mpofu and his replacement by Jacob Mudenda signals a major shift in power dynamics. The appointment of Mudenda  a trusted Mnangagwa ally and Speaker of Parliament  as Secretary-General, replacing Mpofu, a suspected Chiwenga loyalist, has plunged the party into uncertainty. This move strengthens President Mnangagwas grip on the partys administrative core and could open the door for the firing of the Vice-President, effectively returning the political landscape to 2017 conditions.\n\nPatrick Chinamasas new role has also earned him a seat in the power drive. Another Mnangagwa ally, Chinamasa has been moved to Treasurer-General, taking control of party finances and further consolidating Mnangagwas influence.\n\nObert Mpofus demotion is said to have been influenced by First Lady Auxillia Mnangagwa, who is viewed by some as the de facto president, particularly as the President reportedly suffers occasional lapses in memory. Mpofus reassignment to Secretary for ICT is seen as a demotion, potentially alienating supporters in Matabeleland where he wields influence.\n\nImpact on the MnangagwaChiwenga Relationship\n\nThe reshuffle appears to deepen the rift between Mnangagwa and Chiwenga, who were once united in the 2017 coup that ousted Robert Mugabe. The ZANU PF power struggle is intensifying because Mnangagwa is perceived as protecting corrupt networks. Critics argue the country is now in the hands of a mafia looting funds at unprecedented levels. Chiwenga reportedly handed Mnangagwa a damning anti-corruption dossier alleging that Mnangagwas allies, including Kudakwashe Tagwirei, looted billions  further escalating tensions. People are asking why Mnangagwa protects alleged criminals and why he is associated with them.\n\nThere are also claims that the Presidents twin sons have become involved in the drug trade, while Collins Mnangagwa is allegedly exerting influence over the judiciary through the Judicial Service Commission.\n\nThe Beginning of the Succession Battles\n\nThese moves suggest Mnangagwa is securing his legacy and positioning allies for potential succession, while Chiwenga sees this as a direct threat. Mnangagwa is already accused of creating a dynasty fuelled by corruption.\n\nMnangagwa is reportedly jittery. He recently cancelled a UN trip amid warnings from the Central Intelligence Organisation of potential internal attacks, highlighting fears of instability.\n\nPotential Consequences\n\nMnangagwa appears willing to risk the countrys stability to preserve his power. He has already promoted instability within the party. The reshuffle could destabilize ZANU PF further, affecting Zimbabwes governance and economic confidence.\n\nMilitary involvement cannot be ruled out. Given Chiwengas military background and his past role in Mnangagwas ascension, there is a real risk of the army becoming involved in the power struggle.\n\nMnangagwa has chosen a path of corruption, building his dynasty on looted funds.\n\nBuilding Peace and Trust\n\nReconciliation between President Mnangagwa and Vice-President Chiwenga would require addressing underlying tensions and fostering open communication within Zimbabwes complex political landscape.\n\nPotential Steps Towards Reconciliation:\n\nHowever, Mnangagwa is reportedly benefiting from looting overseen by his wife and twins, undermining any moves towards reform.\n\nHistorical Context Matters\n\nThe MnangagwaChiwenga relationship evolved from collaboration in the 2017 coup. Current tensions reflect deeper power struggles. Factionalism within ZANU PF is being fuelled by Mnangagwas refusal to address corruption. Internal party divisions complicate interpersonal relationships at the top.\n\nExternal pressures such as Zimbabwes economic challenges and international relations add to the complexity. The partys dynamics significantly influence the relationship between Mnangagwa and Chiwenga. Questions around succession and term extensions also heighten tensions.\n\nZimbabwes stability and development needs could be a unifying factor, but Mnangagwas current approach risks bloodshed. Different viewpoints exist on whether and how reconciliation is feasible, given the high political stakes and Zimbabwes historical context.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "ZIMBABWE IN A VERY TUMULTUOUS SITUATION By Mandla Mpofu | The recent Politburo reshuffle in ZANU PF has significant implications … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/auxillia-mnangagwas-the-one-who-got-mpofu-fired-report/\">Continue reading<span class=\"screen-reader-text\"> \"Auxillia Mnangagwa’s The One Who Got Mpofu Fired- Report\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "Chiwenga Calls for Urgent Urban Renewal: “Cracked Houses and Dilapidated Roads Unacceptable”",
            "url": "https://www.zimeye.net/2025/09/26/chiwenga-calls-for-urgent-urban-renewal-cracked-houses-and-dilapidated-roads-unacceptable/",
            "content": "By Shelton Muchena | In a forceful address delivered today in Masvingo, Vice President Constantino Chiwenga painted a stark picture of Zimbabwes urban decay  urging immediate and decisive action to revive towns such as Kadoma, Mutare, Bulawayo, and Makokoba. His statement struck at the heart of a growing national crisis: the countrys infrastructure is crumbling, roads are riddled with potholes, houses are cracking, and essential services are failing.\n\nWe cannot move forward, Chiwenga declared, while our cities and towns are in disrepair. We must prioritise the use of local materials, green technologies, and innovative, sustainable designs in all development projects. His remarks come at a time when residents across Zimbabwes urban centres are expressing growing frustration over service delivery failures, particularly in transport, housing, and sanitation.\n\nIn cities like Mutare, the numbers are staggering. The city has approximately 507 kilometres of road network, yet two-thirds  about 350km  are in urgent need of full rehabilitation. Only around 157km are considered to be in fair or good condition. To fully repair Mutares roads alone, the city requires an estimated US$108 million, a figure far beyond the current allocations from funding institutions like ZINARA. Such funding gaps are mirrored across Zimbabwe, where most local authorities are struggling with outdated infrastructure and shrinking revenues.\n\nThe housing crisis is no less pressing. Zimbabwe faces a housing backlog of roughly 1.5 million units, driven by a combination of rapid population growth and years of neglect in maintaining existing housing stock. Major cities including Bulawayo, Harare, Gweru, and Mutare are the hardest hit, with thousands of residents living in structurally compromised homes or in informal settlements. Service delivery, too, has deteriorated. A report from the Office of the Auditor-General found that local authorities are unable to meet demand for critical services such as clean water, sanitation, and healthcare. In Kadoma, for instance, some clinics lack staff, medication, and functioning ambulances, putting lives at risk.\n\nIn response, Vice President Chiwenga outlined a three-pronged approach to reversing the decay. First, he emphasised the need to use locally available materials to reduce costs, create employment, and cut reliance on imports. Second, he advocated for the adoption of green technologies  including solar energy, eco-friendly building methods, and cleaner waste management systems. Third, he called for sustainable, climate-resilient urban planning that not only addresses todays problems but also prepares towns for future environmental challenges.\n\nWhile the vice presidents vision is ambitious, the government has already taken some steps. The 2025 National Budget allocates ZiG58.6 billion toward infrastructure through the Zimbabwe Infrastructure Investment Programme, with more than ZiG28 billion earmarked for transport. Under the Emergency Road Rehabilitation Programme (ERRP), an additional ZiG2.2 billion has been set aside to regravel 1,155km of roads, alongside ZiG305 million dedicated to completing the Harare-Masvingo-Beitbridge highway. A further ZiG27.5 billion has been committed for road development and maintenance projects nationwide.\n\nHowever, challenges loom large. A backlog of US$1.2 billion is owed to infrastructure contractors, slowing down progress on key projects. Local councils are grappling with limited revenues from road user charges, fuel levies, and property taxes  all of which are essential for road repairs and other services. Corruption and poor planning have also played a role, with issues like irregular land allocations and substandard project execution further undermining development efforts.\n\nTo turn the tide, Chiwenga stressed the need for immediate marshalling of both domestic and foreign investment. He suggested strengthening public-private partnerships as a strategy to close financing gaps and speed up implementation. He also called for stricter enforcement of building codes, procurement standards, and regular audits to ensure transparency and value for money. Community involvement, he said, is crucial  residents must be part of planning and decision-making processes to ensure development meets real local needs. Pilot projects in areas like Makokoba or Kadoma could be used to demonstrate how green and sustainable development can succeed at scale.\n\nThe state of Zimbabwes infrastructure is more than just a technical problem; it touches on the very fabric of national development. Poor roads increase transport costs and delay commerce. Unsafe housing endangers lives. Inadequate sanitation and healthcare threaten public health. If Chiwengas message leads to meaningful action, Zimbabwe could begin reversing decades of deterioration, raising living standards and fostering economic resilience.\n\nOn corruption, VP Chiwenga said  We cannot and will not tolerate corruption, tender manipulation or unethical dealings that undermine confidence and compromise delivery,\n\nHe continued:\n\nYou will agree with me that all thriving economies the world overwere built through sacrifice, honesty and hard work.\n\nIt is common cause that unethical dealings result in public outrage and diminished consumer confidence, which can significantly harm the reputation of companies and individuals, ultimately affecting future business opportunities and national development.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena | In a forceful address delivered today in Masvingo, Vice President Constantino Chiwenga painted a stark picture … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/chiwenga-calls-for-urgent-urban-renewal-cracked-houses-and-dilapidated-roads-unacceptable/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Calls for Urgent Urban Renewal: “Cracked Houses and Dilapidated Roads Unacceptable”\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "Couple Fights in Front of Children – Police Urged to Act",
            "url": "https://www.zimeye.net/2025/09/26/couple-fights-in-front-of-children-police-urged-to-act/",
            "content": "By Dorrothy Moyo | ZimEye | A disturbing video circulating online has sparked outrage after showing a couple in a violent altercation inside what appears to be a family home while children are present.\n\nThe footage shows a man and a woman shouting, grappling and pointing at each other as young voices can be heard in the background. Household items are visible on the floor and furniture, suggesting the children may have been close by during the fight.\n\nMukadzi ndiye akurova saka ndiye ngaasungwe matove ne corruption mu mind kunge nyika yedu ye zimbabwe futi apana fight ikuitika apo murume akubatirirwa\n\nChild welfare advocates say the footage highlights the devastating impact of domestic violence on minors, who are often silent victims.\n\nChildren witnessing violence in the home are at serious risk of emotional trauma, and its urgent that authorities step in to protect them, said one Harare-based social worker James Kundaiafter reviewing the clip.\n\nMembers of the public are urged not to share the video in a sensational way, but to help identify the individuals so that the relevant authorities can act.\n\nIf you recognise the people involved, or have information about the incident, you are encouraged to contact the Zimbabwe Republic Police immediately or tag @PoliceZimbabwe on X/Twitter to report what you know.\n\nDomestic violence and child endangerment are criminal offences in Zimbabwe under the Domestic Violence Act [Chapter 5:16], which empowers police and social services to intervene.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | A disturbing video circulating online has sparked outrage after showing a couple in a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/couple-fights-in-front-of-children-police-urged-to-act/\">Continue reading<span class=\"screen-reader-text\"> \"Couple Fights in Front of Children – Police Urged to Act\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "Teacher Jailed for Fatal Road Crash That Killed Two Prominent Educators",
            "url": "https://www.zimeye.net/2025/09/26/teacher-jailed-for-fatal-road-crash-that-killed-two-prominent-educators/",
            "content": "Mutare  A 56-year-old driver, Jabulani Mwenzva, has been sentenced to 24 months in prison after being convicted of culpable homicide over a fatal crash that killed two respected Mutare educators in July last year.\n\nMwenzva, of Chitakatira Growth Point and employed as a teacher at Rowa Primary School under the Ministry of Primary and Secondary Education, was driving a Toyota Hiace when the collision occurred. Mutare magistrate Mr Poterai Gwezhira handed down the sentence on Monday, suspending six months on condition of good behaviour for five years. Mwenzva was also banned from driving for six months.\n\nAccording to the State, led by Ms Deliwe Masibhera, the accident took place on 12 July last year at around 10am along the Mafararikwa22 Miles Road. Mwenzva, driving a Toyota Hiace (AFL 8633) towards Marange Clinic, encroached into the opposite lane while negotiating a sharp curve at the 45km peg. His vehicle collided head-on with a Madza double cab (AAI 5593) driven by the late Trevor Mtisi, who was travelling with 10 passengers to a primary schools sports event in Marange.\n\nMtisi, a well-known headmaster, and his colleague Portia Dhliwayo died instantly, while several passengers sustained varying degrees of injury and were rushed to hospital.\n\nBoth vehicles were later sent to the Vehicle Examination Departments Mutare Depot for inspection.\n\nIn sentencing, Mr Gwezhira ruled that Mwenzva had been negligent, noting he was travelling at excessive speed and failed to maintain proper control of his vehicle when an accident became imminent.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare – A 56-year-old driver, Jabulani Mwenzva, has been sentenced to 24 months in prison after being convicted of culpable … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/teacher-jailed-for-fatal-road-crash-that-killed-two-prominent-educators/\">Continue reading<span class=\"screen-reader-text\"> \"Teacher Jailed for Fatal Road Crash That Killed Two Prominent Educators\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "Zanu PF Erupts as Chiwenga, Mnangagwa Clash In Public",
            "url": "https://www.zimeye.net/2025/09/26/zanu-pf-erupts-as-chiwenga-mnangagwa-clash-in-public/",
            "content": "By A Correspondent-The Zanu PF politburo descended into chaos last week as Vice-President Constantino Chiwenga confronted President Emmerson Mnangagwa over corruption, dragging in senior figures including CIO Minister Lovemore Matuke, party spokesperson Christopher Mutsvangwa, and Bulawayo stalwart Eliphas Mashaba.\n\nThe explosive meeting followed a near-physical showdown between Chiwenga and Mnangagwa at State House earlier that day, before the confrontation spilled over to party headquarters on Wednesday, 17 September 2025.\n\nAccording to insiders, Chiwenga arrived at State House unannounced and tabled a dossier accusing Mnangagwas allies  Kudakwashe Tagwirei, Wicknell Chivayo, Pedzisayi Scott Sakupwanya, and Delish Nguwaya  of industrial-scale looting. He claimed the businessmen were siphoning billions through fraudulent tenders while financing Mnangagwas alleged bid to cling to power beyond 2028.\n\nWhen Chivayo gives you ten million dollars, he will already have taken ninety million, Chiwenga warned, accusing the clique, dubbed the Zviganandas, of bleeding the state and buying influence in Zanu PF.\n\nMnangagwa rejected the claims, insisting he was a constitutionalist with no intention of overstaying. But his defence of the accused  including the remark, Nguwaya is my friend  further enraged Chiwenga, who accused the President of shielding corrupt cronies.\n\nAt the politburo, Mnangagwa provocatively presented Chiwengas dossier himself, daring members to declare whether he had failed as leader. Silence followed, until Chiwenga unleashed a blistering attack, demanding the arrest of Tagwirei, Chivayo, and their associates.\n\nThe party made him, he thundered of Tagwirei, and now he is feeding us crumbs.\n\nThe fallout was swift. Days later, Mnangagwa reshuffled the politburo in what many saw as retaliation, demoting Obert Mpofu, shifting Patrick Chinamasa to Treasurer-General, and elevating Jacob Mudenda to secretary-general. Justice Minister Ziyambi Ziyambi was handed the powerful Legal Affairs portfolio, tightening Mnangagwas grip.\n\nMeanwhile, Mutsvangwa rushed to defend Tagwirei, mocking Chiwenga as no superhero, signalling that the propaganda machinery was now in full swing against the Vice-President.\n\nStill, Chiwenga remains defiant, branding Mnangagwas allies gluttons and warning that corruption threatens both the state and the partys survival.\n\nWith the Zanu PF annual conference looming in October, the showdown has left the ruling party deeply unsettled  and for many, the sight of Mnangagwa and his deputy nearly coming to blows is a chilling echo of 2017. Only this time, the generals are turning on each other.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-The Zanu PF politburo descended into chaos last week as Vice-President Constantino Chiwenga confronted President Emmerson Mnangagwa over … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/zanu-pf-erupts-as-chiwenga-mnangagwa-clash-in-public/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Erupts as Chiwenga, Mnangagwa Clash In Public\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "43-Year-Old Suspected Fraudster Nabbed at RGM Airport Over US$580,000 Property Scam",
            "url": "https://www.zimeye.net/2025/09/26/43-year-old-suspected-fraudster-nabbed-at-rgm-airport-over-us580000-property-scam/",
            "content": "Harare  26 September 2025Police have arrested a 43-year-old man at Robert Gabriel Mugabe International Airport after he allegedly masterminded a fraudulent transfer of ownership of a high-value property in Gletwin, Harare.\n\nThe suspect, identified as Elijah Meskano, was apprehended on 23 September 2025 as he reportedly attempted to flee the country.\n\nAccording to national police spokesperson Commissioner Paul Nyathi, Meskano allegedly transferred ownership of a property worth US$580,000 into his and his wifes names without the knowledge or consent of the rightful owner.\n\nOn 23 September 2025, police in Harare arrested Elijah Meskano, aged 43, at R.G. Mugabe International Airport in connection with a fraud case. The suspect allegedly orchestrated a fraudulent transfer of ownership for a property valued at US$580,000 located in Gletwin, Harare. The offence came to light when the rightful owner received Harare City Council bills bearing the names of the suspect and his wife, Commissioner Nyathi said.\n\nPolice investigations indicate the suspect had been preparing to leave Zimbabwe before his arrest. Authorities say the case was exposed when municipal bills for the property began arriving under Meskanos name, alerting the actual owner.\n\nInvestigations into the case are ongoing, and more arrests could follow as police probe possible accomplices.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 26 September 2025 Police have arrested a 43-year-old man at Robert Gabriel Mugabe International Airport after he allegedly … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/43-year-old-suspected-fraudster-nabbed-at-rgm-airport-over-us580000-property-scam/\">Continue reading<span class=\"screen-reader-text\"> \"43-Year-Old Suspected Fraudster Nabbed at RGM Airport Over US$580,000 Property Scam\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        },
        {
            "title": "Coup Looms as VP Chiwenga, ED Fight Turns Ugly",
            "url": "https://www.zimeye.net/2025/09/26/coup-looms-as-vp-chiwenga-ed-fight-turns-ugly/",
            "content": "By A Correspondent-Analysts have warned of an imminent coup as President Emmerson Mnangagwas power struggle with his deputy, Vice President Constantino Chiwenga, intensifies, pushing Zanu PF to the brink of a major rupture.\n\nThe crisis comes as one of the ruling partys dominant factions pushes for a constitutional amendment to extend Mnangagwas second and final term by two years  from 2028 to 2030. The proposed extension, which would effectively remove the presidential two-term limit, has split the party and exposed deep divisions at the top.\n\nChiwenga, the retired army general who masterminded the 2017 military coup that ousted Robert Mugabe, is fiercely opposed to the plan. He views it as a direct threat to his own presidential ambitions and, according to sources, has the quiet backing of elements within the security establishment.\n\nTensions boiled over last week when Chiwenga presented Mnangagwa with a dossier accusing petroleum tycoon Kudakwashe Tagwirei of looting billions of US dollars from Zanu PF through opaque investments. Chiwenga demanded the immediate arrest of Tagwirei and businessman Wicknell Chivayo, accusing both of using looted funds to bankroll Mnangagwas bid for an extended stay in power.\n\nTagwirei, already under US and UK sanctions for allegedly sustaining Mnangagwas patronage networks, is widely regarded as the Presidents preferred successor. Efforts are reportedly underway to secure him a seat on Zanu PFs Central Committee.\n\nChiwengas confrontation with Mnangagwa came just a day after Tagwirei donated 300 luxury vehicles to Zanu PF. Days earlier, Chivayo had donated over US$4 million in cash, vehicles, and ambulances to provincial chairpersons, claiming it was in celebration of Mnangagwas 83rd birthday. The timing of the donations has fuelled allegations that both businessmen are bankrolling Mnangagwas third-term project.\n\nIn his dossier, Chiwenga alleged that Tagwirei siphoned US$3.2 billion from Zanu PF accounts, funds he claimed were now being used to buy support for Mnangagwas 2030 agenda.\n\nPolitical analysts say the stakes could not be higher. Harare-based academic Eldred Masunungure noted that Zanu PFs internal rivalries stretch back to the liberation war era and often ended violently.\n\nThose phases had bloody endings  hopefully that wont be repeated this time, Masunungure warned. These dynamics must not be misread by the public, especially the opposition, as signalling the collapse of Zanu PF or the regime.\n\nHe cautioned that the October 1318 conference, while not featuring leadership contests, is likely to escalate tensions as Mnangagwas loyalists push through the term-extension resolution.\n\nIf anything, the gladiation will be either more vicious, hopefully bloodless, or more subtle in a Machiavellian sense, he said. There will be winners and losers, but its hard to imagine the losers turning the other cheek.\n\nPolitical commentator Reuben Mbofana added that Mnangagwas recent reshuffle of the partys top leadership was a pre-emptive strike to protect his succession plan.\n\nTo me, this is nothing short of Mnangagwa safeguarding his 2030 agenda just ahead of the party conference, using those reassignments, Mbofana said.\n\nChiwenga has never publicly declared presidential ambitions, while Mnangagwa insists he will respect the two-term limit  even as his loyalists openly campaign for a two-year extension.\n\nWith the October conference looming, analysts warn that the showdown between the President and his deputy has brought Zanu PF to a dangerous tipping point  one that could plunge the country into yet another military-backed transition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Analysts have warned of an imminent coup as President Emmerson Mnangagwa’s power struggle with his deputy, Vice President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/26/coup-looms-as-vp-chiwenga-ed-fight-turns-ugly/\">Continue reading<span class=\"screen-reader-text\"> \"Coup Looms as VP Chiwenga, ED Fight Turns Ugly\"</span></a></p>",
            "time": "06:29",
            "date": "27 Sep 2025"
        }
    ]
}