{
    "news": [
        {
            "title": "Kevin De Bruyne Leaves Manchester City",
            "url": "https://www.zimeye.net/2025/04/04/kevin-de-bruyne-leaves-manchester-city/",
            "content": "Sports Correspondent\n\nManchester City is bracing itself for an emotional farewell as Kevin De Bruyne prepares to bid adieu to the club this summer.\n\nThe Belgian midfielders illustrious 10-year stint at the Etihad Stadium will come to an end as his contract expires.\n\nDe Bruynes impact on Manchester City has been profound. As a pivotal player, he has been instrumental in shaping the teams success, contributing significantly to their dominance in English football. His exceptional vision, passing range, and control have made him a beloved figure among the City faithful.\n\nThroughout his decade-long tenure, De Bruyne has been an integral part of Manchester Citys trophy-laden era, helping the team secure numerous honors, including Premier League titles, FA Cups, and League Cups. His individual accolades are equally impressive, with multiple selections to the PFA Team of the Year and the UEFA Champions League Squad of the Season.\n\nAs De Bruyne prepares to embark on a new chapter in his career, Manchester City fans will undoubtedly reflect on the countless memories he has created at the Etihad. His legacy will undoubtedly be celebrated for years to come, cementing his status as one of the greatest players in Manchester Citys history.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Manchester City is bracing itself for an emotional farewell as Kevin De Bruyne prepares to bid adieu to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/kevin-de-bruyne-leaves-manchester-city/\">Continue reading<span class=\"screen-reader-text\"> \"Kevin De Bruyne Leaves Manchester City\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "CAPS United Date Ngezi Platinum FC",
            "url": "https://www.zimeye.net/2025/04/04/caps-united-date-ngezi-platinum-fc/",
            "content": "By A Correspondent\n\nThis Sunday, Rufaro Stadium will play host to a thrilling encounter between CAPS United and log leaders Ngezi Platinum FC. The Harare giants are determined to turn their season around, currently sitting 14th on the log with four points from four matches.\n\nCAPS Uniteds Assistant Coach, Tonderai Marime, acknowledged that the teams performance has not met expectations. Weve analyzed our games, and we feel were underperforming. The recent result didnt reflect our efforts, but were aware that as CAPS United, were expected to deliver.\n\nMarime emphasized that Sundays match against Ngezi Platinum is a must-win to restore the teams pride. We need to capitalize on our chances and get back to winning ways. Were confident in our abilities, and were ready to face the challenge.\n\nNgezi Platinum, on the other hand, is riding high on a wave of success, having collected maximum points in their last outing against Triangle. They currently occupy pole position, six points ahead of CAPS United.\n\nThe match promises to be an exciting encounter, with CAPS United seeking to revive their season and Ngezi Platinum looking to maintain their lead.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent This Sunday, Rufaro Stadium will play host to a thrilling encounter between CAPS United and log leaders … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/caps-united-date-ngezi-platinum-fc/\">Continue reading<span class=\"screen-reader-text\"> \"CAPS United Date Ngezi Platinum FC\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Road Safety Tip: Be Mindful of Long Vehicles on Roundabouts and Turns",
            "url": "https://www.zimeye.net/2025/04/04/road-safety-tip-be-mindful-of-long-vehicles-on-roundabouts-and-turns/",
            "content": "When navigating roundabouts or joining a road, its important to be mindful of long vehicles, such as trucks or buses, which may need to use more than one lane to make their turns. These vehicles require additional space and may take a different course than expected to safely maneuver through the area.\n\nTo ensure safety for both yourself and the driver of the long vehicle, stay well back and give them plenty of room. Remember, their size and turning radius mean they need extra space to complete the maneuver without obstruction. By keeping a safe distance and being patient, you help prevent accidents and ensure smoother traffic flow for everyone on the road.\n\nAlways be aware of the needs of larger vehicles, particularly in tight spaces like roundabouts or when merging onto busy roads. Safety and awareness are key to preventing collisions and promoting safer driving habits.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When navigating roundabouts or joining a road, it’s important to be mindful of long vehicles, such as trucks or buses, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/road-safety-tip-be-mindful-of-long-vehicles-on-roundabouts-and-turns/\">Continue reading<span class=\"screen-reader-text\"> \"Road Safety Tip: Be Mindful of Long Vehicles on Roundabouts and Turns\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Joy For Zimbos Applying For SA VISA Permits",
            "url": "https://www.zimeye.net/2025/04/04/joy-for-zimbos-applying-for-sa-visas/",
            "content": "South Africa- The government has extended the deadline for Zimbabwe Exemption Permit (ZEP) holders and other visa applicants to the end of September.\n\nThe affected are those whose documents expired at the end of March.\n\nThe new deadline, now set for 30 September, provides temporary relief for thousands of Zimbabweans who have been left in limbo as authorities work through a backlog of visa and permit applications.\n\nHome Affairs Minister Dr Leon Schreiber announced the extension on Tuesday under Immigration Directive Number 4 of 2025.\n\nHe acknowledged that despite efforts to clear outstanding applications, many remain unprocessed due to administrative delays.The Department of Home Affairs has been working to resolve the backlog in its visa and permitting system. However, many applications will not be ready for collection before the 31 March deadline due to delays in printing and processing, Schreiber said.\n\nThe decision is particularly significant for Zimbabweans on the ZEP, a special dispensation permit that has been in place since 2009.\n\nOriginally introduced as the Dispensation of Zimbabweans Project (DZP), it was later restructured into the Zimbabwe Special Permit (ZSP) in 2014 and the current ZEP in 2017.The ZEP has provided a legal pathway for Zimbabweans who moved to South Africa, but its future remains uncertain. The South African government has indicated plans to phase out exemption permits, urging Zimbabweans to apply for mainstream visas or consider returning home.Around 178,000 Zimbabweans were eligible to apply for new exemption permits, which are set to expire at the end of November. However, processing delays have left many waiting for clarity on their legal status.Under the latest directive, ZEP holders and other affected visa applicants will not be declared undesirable if they choose to leave South Africa before 30 September. Those awaiting the outcome of waiver applications can travel in and out of the country without penalty until then.However, non-visa-exempt individuals with pending waiver applications must apply for a port of entry visa before re-entering South Africa. The directive also applies to long-term visa applicants but does not cover those awaiting permanent residence decisions.Only foreign nationals who have legally entered South Africa and submitted their applications via VFS Global, with verifiable proof of submission, will qualify for this concession.-Online\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa- The government has extended the deadline for Zimbabwe Exemption Permit (ZEP) holders and other visa applicants to the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/joy-for-zimbos-applying-for-sa-visas/\">Continue reading<span class=\"screen-reader-text\"> \"Joy For Zimbos Applying For SA VISA Permits\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Bulawayo Cop Killers Shot Dead",
            "url": "https://www.zimeye.net/2025/04/04/bulawayo-cop-killers-shot-dead/",
            "content": "By A Correspondent\n\nTwo suspects were fatally shot while three others were arrested in connection with the killing of a Bulawayo police officer who was attending a crime scene in Tshabalala suburb.\n\nSipho Ncube (24) and Dumisani Ndlovu (32) attempted to flee from arrest, leading to a violent shootout with police detectives along Harrow Street, Sauerstown in Bulawayo on Sunday.\n\nBoth men later succumbed to gunshot wounds after being admitted to United Bulawayo Hospitals.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the development in a statement.\n\nHe said, In reference to the Zimbabwe Republic Polices press statement released on March 28, 2025, regarding the shooting of police officer Sergeant Abel Masava in Sizinda, Bulawayo, at approximately 0030 hours, we confirm the arrest of Mandlenkosi Albert Munangati (26), Clifford Desmond Nare (33), and Thabo Dube (24) in connection with the murder. The firearm used to kill the officer has been recovered from the suspects.\n\nNyathi further revealed that the suspects were also connected to a series of armed robberies in the Bulawayo area that occurred between April 22, 2024, and March 28, 2025. On March 30, 2025, detectives received information linking a Honda Fit vehicle, registration number AGG 8380, to the murder and several armed robbery cases in Bulawayo. The vehicle was tracked, leading to the arrest of Munangati, he said.\n\nUpon interrogation, Munangati implicated the other suspects, which led to the recovery of five firearms, including a National Browning pistol, Blow F92 Blank pellet gun, Long Rifle 12GA 76/3-inch-long, Vizor Pistol, shotgun, and a sword.\n\nTwo other suspects, Sipho Ncube and Dumisani Ndlovu, attempted to flee when confronted by police. A shootout ensued along Harrow Street, resulting in their deaths after being admitted to United Bulawayo Hospitals.\n\nThe suspects are linked to 25 armed robbery cases, including one at a supermarket in New Luveve on December 28, 2024, where cash and three cellphones were stolen. Another robbery occurred at a funeral parlour in Kelvin North, Bulawayo, on February 10, 2025, where US$3,608, R21,130, and a cellphone were taken, said Commissioner Nyathi.\n\nHe added that the suspects were also involved in a robbery at a service station at the corner of Nketa Drive and Rangemore Road on March 2, 2025, where a shotgun and a cellphone were stolen. Investigations revealed that the group targeted service stations, liquor outlets, supermarkets, funeral parlours, and gas operators.\n\nThe Zimbabwe Republic Police appreciates the public for providing valuable information that led to the arrest of the suspects. We encourage the public to continue sharing information via the National Complaints Desk at (0242) 703631, WhatsApp on 0712 800 197, or report to the nearest police station. We reiterate that the fight against robbery syndicates in the country will continue relentlessly, and the law will take its course without fear or favour, said Commissioner Nyathi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two suspects were fatally shot while three others were arrested in connection with the killing of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/bulawayo-cop-killers-shot-dead/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Cop Killers Shot Dead\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Chivayo Buys Luxurious Vehicle For Nehemiah Mutendi",
            "url": "https://www.zimeye.net/2025/04/04/chivayo-buys-luxurious-vehicle-for-nehemiah-mutendi/",
            "content": "By A Correspondent\n\nControversial Zanu PF businessman Wicknell Chivayo has donated a brand-new vehicle to Zion Christian Church (ZCC) leader Bishop Nehemiah Mutendi.\n\nIn a statement released on Friday morning, Chivayo expressed:\n\nTIRIPA JOIN YE ZION\n\nThere is nothing more fulfilling in this life than witnessing compassion being extended to the less privileged and vulnerable members of our communities, especially children, women, and young girls who face limited educational opportunities and have grown up in abject poverty. The remarkable work of the Zion Christian Church in Masvingo, led by His Grace Bishop Nehemiah Mutendi and Amai Mutendi, is a true testament to selfless giving and love for one another.\n\nI am filled with great pride knowing that following my donation of US$1 million in April of last year, the ZCC has made phenomenal progress in supporting charitable organizations and making donations to hospitals and schools under the guidance of His Grace and Amai Mutendi. I was impressed by the audited financial statements provided, showing the clear allocation of funds and their impact.\n\nBishop Mutendi, your dedication to providing opportunities for the underprivileged within communities is unparalleled. During my visits to Mbungo and Defe, I was deeply impressed by the extensive initiatives the church has undertaken under your spiritual leadership. The magnificent church and the journey to the holy shrine to witness Parere Muporofita Sameri, though from a distance, was spiritually fulfilling. Particularly notable is the churchs commitment to paying school fees for orphans and vulnerable children, caring for the elderly, and initiating community projects to combat drought-induced hunger and socio-economic challenges in Masvingo and across the country. This aligns perfectly with President E.D. Mnangagwas mantra, Nyika inovakwa nevene vayo.\n\nIn recognition of your extraordinary work, His Grace, Bishop Mutendi, and the crucial role Amai Mutendi plays in supporting the spiritual leadership of such a large congregation, I had the honor of personally selecting a fitting gift as a small token of my appreciation for them. Yesterday, I was delighted to purchase a 2025 Range Rover Autobiography SV valued at US$400,000 for the Bishop, and a 2025 Toyota Land Cruiser 300 Series valued at US$190,000 for Amai Mutendi, both brand new, to support their philanthropic and evangelical endeavors.\n\nI would be most honored to receive His Graces acceptance of this small gesture, acknowledging the remarkable work of God that he is tirelessly advancing through the ZCC.\n\nMay God richly and abundantly bless you forever.\n\n#FambaZion #Defe #Mbungo #Tiri_pa_Join_ye_ZION.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial Zanu PF businessman Wicknell Chivayo has donated a brand-new vehicle to Zion Christian Church (ZCC) leader … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/chivayo-buys-luxurious-vehicle-for-nehemiah-mutendi/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Buys Luxurious Vehicle For Nehemiah Mutendi\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Ken Sharpe: Building Dreams, Legacy, And One Billion Bricks",
            "url": "https://www.zimeye.net/2025/04/04/ken-sharpe-building-dreams-legacy-and-one-billion-bricks/",
            "content": "ByBusiness Reporter-Renowned entrepreneur and WestProp Holdings Chief Executive,Mr. KenSharpe,has inspired Zimbabweans to focus onbuilding generational wealththat endures beyond their lifetimes and uplifts entire communities.\n\nAddressing theCEO Africa Roundtable Zimbabwe Wealth and Retirement Summit, Mr. Sharpe delivered a powerful message on the purpose and value of wealth.\n\nWealth is not just about accumulating riches; its about leaving a lasting legacy, he declared. God blesses us to be a blessing to others. Its our responsibility to use our wealth to uplift those around us  through family, philanthropy, or community development.\n\nAself-proclaimed man of the future,Mr. Sharpe is not only talkinglegacy hes building it.\n\nUnder his visionary leadership,WestProphas set an ambitious target tolay one billion bricks by 2050, reshaping Zimbabwes urban landscape and economic prospects.\n\nFrom pioneering developments likeMillennium Heights,Pomona City, andWarren Hills GolfEstate,to transforming housing into hubs of opportunity and lifestyle, Sharpe ischampioning smart, sustainable growthgrounded in Christian values and ethical leadership.\n\nWe must think beyond ourownlifetimes, he said.We cant take our wealth to the grave,butwecan pass down its values and purpose.Our children and grandchildren must learn about wealth creation, moral integrity, and hard work.\n\nMr. Sharpe also applauded theCEO Africa Roundtablefor fostering dialogue and innovation.\n\nTogether, we can make a difference in Zimbabwe. Lets unite to build a brighter future for our nation andgenerations to come.\n\nMore than just bricks and buildings, Ken Sharpe is constructing a vision of hope, responsibility, andlasting prosperity setting the blueprint for abetter Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-Renowned entrepreneur and WestProp Holdings Chief Executive, Mr. Ken Sharpe, has inspired Zimbabweans to focus on building generational wealth that endures beyond their lifetimes … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/ken-sharpe-building-dreams-legacy-and-one-billion-bricks/\">Continue reading<span class=\"screen-reader-text\"> \"Ken Sharpe: Building Dreams, Legacy, And One Billion Bricks\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Mnangagwa Gives Chiwenga Ally Hard Kick",
            "url": "https://www.zimeye.net/2025/04/04/mnangagwa-gives-chiwenga-ally-hard-kick/",
            "content": "By A Correspondent\n\nIn a notable move signaling internal unrest, President Emmerson Mnangagwa has removed Dr. Sithembiso Nyoni from her role as the Minister of Environment, Climate, and Wildlife.\n\nThis decision came as a surprise and has fueled growing speculation about political instability within the government.\n\nThe Chief Secretary to the President and Cabinet, Dr. Martin Rushwaya, confirmed the change in a statement, noting that Nyonis removal was effective immediately and made in accordance with Zimbabwes constitution. The statement read:\n\nHis Excellency the President of the Republic of Zimbabwe, Cde Dr. E D Mnangagwa, has in terms of section 340, subsection (1), paragraph (f), as read with section 108, subsection (1), paragraph (a) of the Constitution of Zimbabwe, removed Sithembiso Gile Gladys Nyoni from the position of Minister of Environment, Climate and Wildlife with immediate effect.\n\nThe removal of Dr. Nyoni comes amidst rising tensions within Zimbabwes political landscape. Recently, war veteran Blessed Geza has openly challenged President Mnangagwas efforts to extend his political tenure beyond constitutional limits, sparking protests. Gezas opposition, particularly regarding Mnangagwas alleged attempts to secure a third term, has fueled growing unrest, contributing to the broader political uncertainty in the country.\n\nThis shake-up in the Cabinet could be seen as part of the ongoing political turbulence surrounding Mnangagwas leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a notable move signaling internal unrest, President Emmerson Mnangagwa has removed Dr. Sithembiso Nyoni from her … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/mnangagwa-gives-chiwenga-ally-hard-kick/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Gives Chiwenga Ally Hard Kick\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Geza: We Have Mnangagwa’s Medical Records",
            "url": "https://www.zimeye.net/2025/04/04/geza-we-have-mnangagwas-medical-records/",
            "content": "By A Correspondent\n\nWar veteran Blessed Runesu Geza, widely known as Comrade Bombshell, declared that he and his colleagues, who oppose President Emmerson Mnangagwas third-term aspirations, are now pursuing the impeachment route.\n\nImpeachment is a legal procedure used to formally accuse a public official, such as a president, of misconduct or illegal actions while in office, with the ultimate aim of removing them from office if they are found guilty.\n\nIn a video posted on his YouTube channel on April 2, Geza announced that they have taken significant steps in their push to remove President Mnangagwa from power. Today, I am announcing a further step in our fight to rescue Zimbabwe from Emmerson and his looting mafia. We have escalated our efforts. We are moving forward with the impeachment of President Emmerson Dambudzo Mnangagwa. The die is cast, and tomorrow we begin this process, Geza stated.\n\nGeza went on to elaborate that their move for impeachment stems from claims that President Mnangagwa is no longer mentally capable of performing his duties. We are constitutionalists, so we are using the Constitution to reclaim the country. Section 97(1)(d) of the Constitution allows for the removal of a president due to incapacity to perform presidential functions, specifically when there is a lack of mental capacity, he added.\n\nThe war veteran further claimed that President Mnangagwa is suffering from vascular dementia, which he believes renders the president incapable of fulfilling his presidential responsibilities effectively. Vascular dementia is a condition caused by poor blood circulation to the brain, leading to cognitive impairment such as memory loss, confusion, and difficulty with thinking and problem-solving.\n\nMnangagwa is suffering from vascular dementia, Geza asserted. We have copies of his medical records. His doctors have informed him, his family is aware, and the looting mafia knows about it too.\n\nGeza claimed that some members of Mnangagwas family and associates, particularly individuals linked to businessman Kudakwashe Tagwirei, are exploiting the presidents condition. They are taking advantage of his memory loss and confusion to have him sign documents that promote their corruption and looting, he said.\n\nAccording to Geza, the extent of Mnangagwas cognitive decline is severe. Last Thursday, he forgot who July Moyo was and which ministry he heads. He even argues with his aides about whether he is at home or in the office. The situation is dire, Geza explained.\n\nHe further accused those around the president of manipulating his condition for their benefit. As a result, vultures are circling. They are looting in his name, selling off state-owned enterprises, and making decisions like hiring and firing officials as if they are in charge, Geza claimed.\n\nGeza went on to highlight that unelected individuals have been taking advantage of Mnangagwas condition to exercise presidential powers. Unvetted individuals, whom the public didnt elect, are now wielding presidential authority. They follow him to his farm, awarding government tenders in his name. They seize land in his name, and they even appoint or dismiss high-ranking officials such as army generals on his behalf. Its become a free-for-all for the criminals around him, he said.\n\nIn the past, President Mnangagwa had mentioned that he was aware of some members of parliament plotting to impeach him after his election. In May 2018, Mnangagwa informed ZANU-PF members that he had received intelligence about potential impeachment attempts, Geza recalled.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Runesu Geza, widely known as Comrade Bombshell, declared that he and his colleagues, who … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/geza-we-have-mnangagwas-medical-records/\">Continue reading<span class=\"screen-reader-text\"> \"Geza: We Have Mnangagwa’s Medical Records\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        },
        {
            "title": "Prominent Businessman Brutally Assaults Female Mine Manager Over Illegal Mine Access",
            "url": "https://www.zimeye.net/2025/04/04/prominent-businessman-brutally-assaults-female-mine-manager-over-illegal-mine-access/",
            "content": "Prominent businessman and Doves Holdings Board Member, Farai Matsika and his Chief Executive Officer, Edison Gatsi, allegedly launched a savage and vicious physical attack on a defenceless female General Manager at Botha Gold Mine in Bindura after she rightfully denied them unlawful entry.\n\nThe shocking incident unfolded when Matsika and Gatsi attempted to force their way into the mine with heavy equipment, despite having no contract or legal right to access the property.\n\nThe female General Manager, a respected professional, stood her ground and politely refused them entry, only to be met with a torrent of unprintable profanities and unprovoked, barbaric physical violence.\n\nEyewitnesses report that Gatsi, in a fit of rage, lashed out at the woman, leaving her with injuries and a smashed mobile phone in what can only be described as a blatant act of male intimidation and brutality. Had mine security not intervened swiftly, the situation could have escalated into an even more horrific assault.\n\nThe traumatised victim has since reported the assault to Bindura Central Police Station under RRB Number: 12/04/25CR. However, given the high-profile status of the accused, there are fears that wealth and influence may be used to sweep this shameful incident under the rug.\n\nThis is not the first time Matsika and Gatsi have been embroiled in scandalous misconduct. In 2021, the pair faced allegations of stripping a life assurance firm of its assets, raising serious questions about their ethical standards and disregard for the law. Now, their thuggish behaviour has escalated to physical violence against a woman in the workplace.\n\nThis brazen attack is not just an assault on one woman, it is an affront to professional women everywhere who face intimidation and aggression in male-dominated industries. The Botha Gold Mine incident must serve as a wake-up call: no one is above the law, and violence against women, especially in the workplace, must be met with the full force of justice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Prominent businessman and Doves Holdings Board Member, Farai Matsika and his Chief Executive Officer, Edison Gatsi, allegedly launched a savage … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/04/prominent-businessman-brutally-assaults-female-mine-manager-over-illegal-mine-access/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Businessman Brutally Assaults Female Mine Manager Over Illegal Mine Access\"</span></a></p>",
            "time": "09:28",
            "date": "05 Apr 2025"
        }
    ]
}