{
    "news": [
        {
            "title": "Heroes Acre Now A Hub Of Thieves, As Veterans Shun The National Shrine",
            "url": "https://www.zimeye.net/2024/12/16/heroes-acre-now-a-hub-of-thieves-as-veterans-shun-the-national-shrine/",
            "content": "By Political Reporter- Once a revered symbol of unity and sacrifice in Zimbabwe, The National Heroes Acre, is now mired in controversy as a growing number of liberation war veterans reject burial at the site.\n\nThe latest to do so is former Vice President Phelekezela Mphoko, who was laid to rest Sunday at his Douglasdale home in Bulawayo.\n\nMphokos decision follows a series of similar snubs by prominent nationalists, reflecting deep divisions over the legacy of the Heroes Acre and the ruling Zanu PFs role as gatekeepers of national heroism.\n\nDumiso Dabengwa, a former ZIPRA intelligence chief, was buried at his rural home in Ntabazinduna in 2019 after expressing distrust of the government.\n\nWelshman Mabhena, an ex-ZAPU stalwart, openly denounced the Heroes Acre as a resting place for corrupt people and opted for a private burial in 2010.\n\nEven former President Robert Mugabe, ousted in a 2017 coup, rejected the Heroes Acre and chose burial at his rural home in Zvimba, while Tshinga Dube, another ZIPRA commander, had his familys wishes for a Bulawayo burial overridden by the government.\n\nThis growing trend highlights a fractured national identity and the disillusionment of liberation icons with Zanu PFs custodianship of the Heroes Acre.\n\nOnce intended to honour those who fought for independence, the site is increasingly seen as a political tool, reflecting a legacy of division and mistrust rather than unity and sacrifice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- Once a revered symbol of unity and sacrifice in Zimbabwe, The National Heroes Acre, is now mired … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/heroes-acre-now-a-hub-of-thieves-as-veterans-shun-the-national-shrine/\">Continue reading<span class=\"screen-reader-text\"> \"Heroes Acre Now A Hub Of Thieves, As Veterans Shun The National Shrine\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "BREAKING: Chiminya Arrested",
            "url": "https://www.zimeye.net/2024/12/16/breaking-chiminya-arrested/",
            "content": "By A Correspondent | The self proclaimed King Munhumutapa, Timothy Chiminya has been arrested on charges of undermining the authority of the President.\n\nHe is at Harare Central Police Station\n\nMore details to follow\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | The self proclaimed King Munhumutapa, Timothy Chiminya has been arrested on charges of undermining the authority … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/breaking-chiminya-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Chiminya Arrested\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Warriors Star Struggles With Injury Setbacks",
            "url": "https://www.zimeye.net/2024/12/16/warriors-star-struggles-with-injury-setbacks/",
            "content": "Sports Correspondent\n\nDerby County head coach Paul Warne has addressed the ongoing situation regarding Tawanda Chirewas loan spell at the club, following the midfielders recent injury setbacks.\n\nChirewa, who joined the Rams on a season-long loan from Premier League side Wolves in August, has struggled for game time due to a torn thigh muscle that sidelined him for nearly two months. The Warriors international has made just two league appearances since his arrival.\n\nHowever, after completing his recovery, Chirewa resumed training with the senior team last week. Warne, speaking to Derby Telegraph, emphasized that there are no plans to cut short Chirewas loan deal. He stated that the player must now earn his place in the squad through hard work and competition.\n\nHes got himself back fit and now he has to get back into the squad, Warne said. To do that, he needs to train better than everybody else. He has to fight for his spot. If he does that and performs well, hes definitely a player I want to keep.\n\nWarne further clarified that neither Wolves nor Chirewas agent have contacted him regarding the players future, adding that it was too early to make any decisions.\n\nIt hasnt worked out for him or for us as well as it could have simply because he got injured, Warne concluded. But hes here for the season and has looked good in training.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Derby County head coach Paul Warne has addressed the ongoing situation regarding Tawanda Chirewa’s loan spell at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/warriors-star-struggles-with-injury-setbacks/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Star Struggles With Injury Setbacks\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Mnangagwa Bunks Mphoko Burial",
            "url": "https://www.zimeye.net/2024/12/16/mnangagwa-bunks-mphoko-burial/",
            "content": "By Farai D Hove |In a development stirring controversy across Zimbabwe, President Emmerson Mnangagwa has come under fire for failing to attend the burial of former Vice President Phelekezela Mphoko, who was laid to rest in Matabeleland over the weekend.\n\nMphoko, who passed away in India, had served as Zimbabwes vice president alongside Mnangagwa during the late Robert Mugabes tenure. According to the constitution, Mphoko was next in line to take over the presidency following Mugabes resignation in 2017. However, the 2017 coup orchestrated by Mnangagwa and his allies saw both Mugabe and Mphoko violently sidelined, paving the way for Mnangagwas ascent to power.\n\nDespite the historical and political significance of Mphokos passing, Mnangagwas absence at the burial has raised eyebrows, especially given the regions political sensitivities and lingering tensions from the events of 2017.\n\nDefending the presidents decision, presidential spokesperson George Charamba issued a statement:\n\nHIS EXCELLENCY THE PRESIDENT, DR E D MNANGAGWA, HAD AN OPPORTUNITY TO PAY HIS LAST RESPECTS TO LATE VP MPHOKO BEFORE COMMENCEMENT OF BURIAL PROCEEDINGS. MAY THE LATE FREEDOM FIGHTER REST IN ETERNAL PEACE\n\nCharambas statement has done little to quell public criticism, with many viewing Mnangagwas absence as a snub to Mphokos legacy and a continuation of the political rift that defined their tumultuous relationship.\n\nA Troubled Legacy\n\nPhelekezela Mphoko, a veteran of Zimbabwes liberation struggle, found himself sidelined during the 2017 coup, despite being constitutionally positioned to succeed Mugabe. His subsequent years were marred by political isolation, with his legacy divided between his service in government and the controversies surrounding his role in ZANU-PF politics.\n\nHis burial in Matabelelandan area long associated with political marginalization and the scars of the Gukurahundi atrocitiesadded another layer of significance to the presidents absence. Local leaders and commentators have noted that Mnangagwas decision not to attend risks deepening the perception of neglect and disregard for the regions historical grievances.\n\nPublic Reaction\n\nSocial media and political commentators have been ablaze with speculation and criticism of Mnangagwas motives, with some suggesting his absence underscores unresolved tensions from the 2017 coup. Others view it as a missed opportunity to reconcile with Matabeleland and honor a figure who, despite their differences, shared the liberation struggle with him.\n\nAs Zimbabweans continue to reflect on the legacy of Phelekezela Mphoko, questions remain about how his deathand Mnangagwas apparent snubwill shape the ongoing narrative of the nations troubled political history.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | In a development stirring controversy across Zimbabwe, President Emmerson Mnangagwa has come under fire for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/mnangagwa-bunks-mphoko-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Bunks Mphoko Burial\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Mnangagwa Snubs Mphoko Burial",
            "url": "https://www.zimeye.net/2024/12/16/mnangagwa-snubs-mphoko-burial/",
            "content": "By Political Reporter-President Emmerson Mnangagwa Sunday snubbed the burial of the former Vice President Phelekezela Report Mphoko.\n\nMphoko also snubbed National Heroes Acre and was buried at his Douglasdale home plot in Bulawayo.\n\nMphoko, a former senior ZIPRA commander during the Liberation Struggle, died on December 6, 2024, in India, where he was undergoing treatment for an undisclosed ailment.\n\nMphokos casket, draped in the national flag, was displayed as family, friends, relatives, and dignitaries gathered to pay their last respects.\n\nAmong the notable officials were Judith Ncube, Minister of State for Bulawayo Province; Richard Moyo, Minister of State for Matabeleland North Province; and Sithembiso Nyoni, Minister of Environment, Climate, and Wildlife, among others.\n\nAlthough Mphoko was declared a national hero by President Emmerson Mnangagwa and ZANU PF and was supposed to be buried at Heroes Acre in Harare, his family said he expressed a wish to be buried at his home.\n\nRecently, another late former ZIPRA commander, Tshinga Dube, had a similar wish, although the government overrode it and buried him at Heroes Acre in Harare.\n\nDube had wanted to be buried at Lady Stanley Cemetery in Bulawayo.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter-President Emmerson Mnangagwa Sunday snubbed the burial of the former Vice President Phelekezela Report Mphoko. Mphoko also snubbed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/mnangagwa-snubs-mphoko-burial/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Snubs Mphoko Burial\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Employee Sentenced for Embezzlement as Businessman’s Fraud Trial Continues",
            "url": "https://www.zimeye.net/2024/12/16/employee-sentenced-for-embezzlement-as-businessmans-fraud-trial-continues/",
            "content": "By A Correspondent| A former employee of MA Auto Supplies, Lorraine Mawema, has been sentenced to 24 months in prison for misappropriating over $3,500 entrusted to her by her employer.\n\nMawema was arrested in June after failing to account for funds, including money earmarked for fuel allowances for other employees.\n\nInitially, she admitted to using the funds in a sworn affidavit and pledged to repay the amount. However, she later reversed her plea, leading her employer to escalate the case to court.\n\nDuring the investigation, authorities confirmed that Mawema had used the funds for personal purposes. She was granted bail under strict conditions, including regular reporting to Marlborough Police Station.\n\nOn December 3, Mawema was convicted and remanded in custody.\n\nRecently, she was sentenced to 24 months, with portions of the sentence suspended under various conditions.\n\nSix months were suspended for five years, provided she does not commit a similar offense during that period.\n\nAnother six months were suspended on the condition that she repays the embezzled funds by January 27, 2025.\n\nThe remaining 12 months were suspended on the condition that she completes 420 hours of community service.\n\nMeanwhile, the trial of Michael Smith, a businessman accused of defrauding MA Auto Supplies of more than $38,000 and R124,000, is ongoing.\n\nSmith faces a range of charges, including two counts of theft of trust property, 12 counts of fraud, and 25 counts of corruptly concealing transactions from his principal. The State continued to lead evidence from witnesses in his case before Harare magistrate Ethel Chichera.\n\nSmith has been remanded to February 2025 as the trial progresses.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A former employee of MA Auto Supplies, Lorraine Mawema, has been sentenced to 24 months in prison … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/employee-sentenced-for-embezzlement-as-businessmans-fraud-trial-continues/\">Continue reading<span class=\"screen-reader-text\"> \"Employee Sentenced for Embezzlement as Businessman’s Fraud Trial Continues\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Leganes Stun Barcelona",
            "url": "https://www.zimeye.net/2024/12/16/leganes-stun-barcelona/",
            "content": "Sports Correspondent\n\nBarcelonas La Liga lead is under threat after a shocking 1-0 home defeat to Leganes on Sunday.\n\nThe loss leaves Barcelona vulnerable, as Atletico Madrid and Real Madrid can surpass them with wins in their respective games in hand.\n\nMidfielder Pedri emphasized the need for improvement, stating, We must be better to turn things around before the winter break. Barcelonas 38 points from 18 games are now within reach for Atletico (38) and Real Madrid (37), who can capitalize on Barcelonas misstep.\n\nManager Hansi Flicks team must regroup and refocus to maintain their top spot. The pressure is on Barcelona to rediscover their scoring form and reclaim their momentum in La Liga.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Barcelona’s La Liga lead is under threat after a shocking 1-0 home defeat to Leganes on Sunday. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/leganes-stun-barcelona/\">Continue reading<span class=\"screen-reader-text\"> \"Leganes Stun Barcelona\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Fostering A Culture Of Responsibility For Road Safety",
            "url": "https://www.zimeye.net/2024/12/16/fostering-a-culture-of-responsibility-for-road-safety/",
            "content": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls on every individual. While authorities play a crucial role in setting rules, providing infrastructure, and enforcing traffic laws, the safety of our roads depends on how each of us behaves behind the wheel or as a pedestrian.\n\nIts easy to assume that road safety is solely the responsibility of lawmakers and authorities, but the reality is that every person who uses the road contributes to creating a safer or more dangerous environment. Drivers, passengers, cyclists, and even pedestrians all have a part to play in ensuring that our roads remain safe for everyone.\n\nThe Importance of Safe Driving\n\nOne of the most significant contributors to road safety is the way we drive. Speeding, distracted driving, and driving under the influence of alcohol or drugs are all actions that put not only the driver but also other road users at serious risk. Being aware of road conditions, following traffic signals, wearing seat belts, and respecting speed limits are some of the simplest yet most effective ways to avoid accidents.\n\nDriving safely involves more than just adhering to the lawit means being conscious of other drivers and pedestrians, maintaining a safe distance, and reacting calmly in emergency situations. The decision to drive responsibly can prevent countless accidents and save lives.\n\nPedestrians and Cyclists: Sharing the Road\n\nRoad safety isnt just about cars. Pedestrians and cyclists also need to be vigilant and responsible. Pedestrians should use crosswalks, avoid jaywalking, and stay alert when walking near busy streets. Similarly, cyclists must wear helmets, signal their turns, and follow traffic rules to minimize the risk of accidents.\n\nEveryone, regardless of how they travel, plays a part in maintaining road safety. Drivers must be aware of pedestrians and cyclists, while pedestrians and cyclists should respect the rules designed to protect them.\n\nA Culture of Responsibility\n\nBuilding a culture of road safety starts with individuals taking responsibility for their actions. Whether you are driving, cycling, or walking, your behavior on the road can have a direct impact on others. Everyone should recognize that safety is not just a matter of personal well-being but also the well-being of everyone else on the road.\n\nConclusion\n\nRoad safety is not only about laws and regulations; it is about creating a culture where everyone takes responsibility for their actions. To ensure that roads are safe for everyone, we must all participatedrivers, pedestrians, cyclists, and law enforcement. The message is simple: Drive safely, save lives. Lets make road safety a shared priority for all.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/fostering-a-culture-of-responsibility-for-road-safety/\">Continue reading<span class=\"screen-reader-text\"> \"Fostering A Culture Of Responsibility For Road Safety\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Government Enforces Use Of  ZiG Currency",
            "url": "https://www.zimeye.net/2024/12/16/government-enforces-use-of-zig-currency/",
            "content": "Commentary on Enforcement and Strengthening of ZiG Currency\n\nBy Linda Tsungirirai Masarira\n\n14 December 2024\n\nThe announcement by Deputy Minister of Finance, Kudakwashe David Mnangagwa, regarding covert operations to enforce the use of the Zimbabwean ZiG currency underscores the governments growing concern about the slow acceptance of the gold-backed currency.\n\nThis move comes as part of efforts to bolster confidence in the ZiG, which was introduced in April 2024 as a gold-backed currency aimed at stabilizing the economy and reducing reliance on foreign currencies like the US dollar.\n\nThe operation reflects the Governments strategy to enforce the use of the ZiG.While ensuring the circulation and acceptance of the ZiG is critical to its success, the dual approach of persuasion and compulsion raises questions about the sustainability of such measures.\n\nForced compliance through law enforcement, arrests, and fines risks creating resistance among businesses and the public, undermining trust in the ZiG rather than building confidence.\n\nTo strengthen confidence in the ZiG and ensure its integration into the economy, the government must prioritize creating consistent and widespread demand for the currency. A more effective and economically sound approach would involve incentivizing the use of the ZiG while discouraging reliance on the US dollar through fiscal policies. We propose the introduction of a transaction tax on USD payments to make its usage less attractive. Simultaneously, reducing VAT rates for transactions conducted in ZiG would create a tangible financial benefit for businesses and consumers who adopt the local currency. This dual strategy will encourage a gradual shift toward the ZiG without coercion, fostering voluntary acceptance and reinforcing its credibility as a stable and reliable currency.\n\nOne critical step would be mandating that fuel be sold exclusively in ZiG, as fuel is a key commodity that drives economic activity across all sectors. By anchoring such a high-demand product to the local currency, the government can immediately boost its usage and legitimacy.\n\nMoreover, all government services, including passport applications, licenses, and other administrative fees, should only be payable in ZiG. This approach will institutionalize the currencys use, ensuring that it becomes the default medium of exchange for accessing essential services. By doing so, the government demonstrates its confidence in the currency and encourages both businesses and citizens to adopt it for daily transactions.Creating demand for a currency is essential for it to take root in the economy.\n\nWithout sufficient demand, no amount of enforcement will sustain its usage. By aligning policies to promote organic demand for the ZiG through strategic pricing mechanisms, targeted incentives, and exclusive use in critical sectors, the government can gradually phase out reliance on the US dollar.\n\nThis will complement measures such as introducing a transaction tax on USD usage and reducing VAT for ZiG transactions, further incentivizing the local currency without over-reliance on compulsion.\n\nAdditionally, the government must ensure the fundamentals of the ZiG are strongtransparent gold reserves, consistent supply, and public awareness campaigns highlighting the benefits of the currency. Trust in the currency is built on its perceived stability and usability, not through punitive measures.\n\nA collaborative approach that engages stakeholders, including businesses and consumers, will be more effective in establishing the ZiG as Zimbabwes preferred medium of exchange.\n\nUltimately, the success of the ZiG depends not only on enforcement but on its practicality and acceptance as a stable, reliable, and widely usable currency. Transparent management of its gold backing and a clear communication strategy to build public trust are equally vital to this effort.\n\nIn conclusion, the ZiG, introduced as a gold-backed currency to stabilize Zimbabwes economy, holds immense potential to restore confidence and reduce reliance on foreign currencies.\n\nHowever, its success hinges on consistent monetary policies and fostering trust in the market. By implementing strategic measures to create demand such as mandating its use for essential goods and services, incentivizing its adoption, and ensuring transparency in its management, the government can transform the ZiG into a widely accepted and stable currency.\n\nA strong, reliable ZiG will not only strengthen economic sovereignty but also lay the foundation for sustainable growth and resilience in Zimbabwes financial system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Commentary on Enforcement and Strengthening of ZiG Currency By Linda Tsungirirai Masarira 14 December 2024 The announcement by Deputy Minister … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/government-enforces-use-of-zig-currency/\">Continue reading<span class=\"screen-reader-text\"> \"Government Enforces Use Of  ZiG Currency\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        },
        {
            "title": "Zanu PF Zealots Block Wheelchair Donation to Mvuma Hospital",
            "url": "https://www.zimeye.net/2024/12/16/zanu-pf-zealots-block-wheelchair-donation-to-mvuma-hospital/",
            "content": "By A Correspondent\n\nA generous donation of wheelchairs to Mvuma District Hospital has been halted due to political red tape, with Zanu PF officials reportedly blocking the delivery.\n\nAsherboy Mafukidze, a former Forestry Commission employee, has been attempting to donate two new wheelchairs to the hospital since May of this year.\n\nHowever, he has been unable to do so due to the bureaucratic approval process, which requires sign-offs from several political figures, including the District Medical Officer (DMO), the District Development Coordinator (DDC), the local MP, and the Minister of State.\n\nMafukidze, who witnessed the dire need for proper medical equipment at the hospital, described the current wheelchairs at Mvuma Hospital as being in deplorable condition. I experienced excruciating pain in those wheelchairs. They have no armrests, they are all rusty steel, they have no leg rests, and the wheels are tied to the wheelchairs with pieces of wire and strings. I have never sat on something so uncomfortable, Mafukidze remarked.\n\nMvuma Hospital, which serves the Chirumanzu District, has long struggled with outdated and broken-down medical equipment. The existing wheelchairs are estimated to be over 20 years old, with only four available for the hospitals many patients in need.\n\nMafukidze first approached Dr. Simbarashe Maunga, the District Medical Officer, in May to offer the wheelchairs. He was subsequently referred to Joram Chimedza, the District Development Coordinator, who informed him that approval from the Minister and the MP for Chirumanzu-Zibagwe, Jacob Chokururama, was necessary before any donation could be accepted.\n\nI have been trying to donate these wheelchairs for months, but politics has gotten in the way, said Mafukidze.\n\nThey told me I had to get permission from all the politicians before I could help. It is frustrating to see how political bureaucracy is delaying something that could make a real difference for the hospital.\n\nThe political barriers surrounding the donation reflect broader issues within Zimbabwe, where development initiatives not aligned with the ruling party, Zanu PF, are often blocked. Donations and infrastructure projects have been halted in several areas, especially those that could be perceived as benefiting opposition political causes.\n\nMafukidze, undeterred by the political hurdles, vowed to continue his efforts once he is able to recover from his current health struggles. Once I am well again, I will appeal for further donations to Mvuma Hospital. The need is urgent, he said.\n\nAlthough several officials were approached for comment, staff at Mvuma District Hospital remained tight-lipped on the situation.\n\nThe incident highlights how political red tape continues to hinder charitable initiatives in Zimbabwe, leaving vulnerable communities without much-needed resources.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A generous donation of wheelchairs to Mvuma District Hospital has been halted due to political red tape, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/16/zanu-pf-zealots-block-wheelchair-donation-to-mvuma-hospital/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Zealots Block Wheelchair Donation to Mvuma Hospital\"</span></a></p>",
            "time": "18:09",
            "date": "16 Dec 2024"
        }
    ]
}