{
    "news": [
        {
            "title": "Horror In Mberengwa: Dad In Court For Raping Daughter",
            "url": "https://www.zimeye.net/2025/01/10/horror-in-mberengwa-dad-in-court-for-raping-daughter/",
            "content": "By A Correspondent\n\nA 54-year-old man from Mberengwa has been taken into custody after being accused of raping his eight-year-old daughter. The alleged incident occurred in December last year at their homestead, where the victim lived with her father and four-year-old sister.\n\nAccording to court records, the accused followed his daughters to bed, forcing the eight-year-old to sleep on his bed while her sister slept on a floor mat. The accused allegedly took advantage of the situation and raped the young girl. He then threatened her with death if she reported the incident.\n\nFortunately, the brave young girl confided in a neighbor the next morning, leading to the accuseds arrest. The case is ongoing, with the accused remanded in custody until the 17th of this month.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 54-year-old man from Mberengwa has been taken into custody after being accused of raping his eight-year-old … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/horror-in-mberengwa-dad-in-court-for-raping-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Horror In Mberengwa: Dad In Court For Raping Daughter\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "CCC Suspends Tshabangu Amid Deepening Drama",
            "url": "https://www.zimeye.net/2025/01/10/ccc-suspends-tshabangu-amid-deepening-drama-2/",
            "content": "The Citizens Coalition for Change (CCC), led by Professor Welshman Ncube, has suspended the membership of Sengezo Tshabangu just hours after the High Court reversed his controversial removal of Karenyi Konye and others from Parliaments Standing Rules Committee.\n\nIn a statement released on Wednesday, CCC acting president Professor Ncube announced the suspension of Tshabangu, stating that the decision was made in light of recent events.\n\nTshabangus suspension is pending a disciplinary hearing, which will be conducted in accordance with the partys internal processes, said CCC presidential spokesperson, Kurauone Chihwayi.\n\nThe drama within the party intensified when Tshabangus actions were overruled by the High Court, which reversed his decision to remove Konye and others from their committee positions. The move has sparked a series of conflicts, which have further deepened the political crisis within the opposition.\n\nAt the beginning of 2024, tensions within the CCC took a dramatic turn when the partys leader, Advocate Nelson Chamisa, announced his departure from the formation, citing heavy infiltration.\n\nThis latest move to suspend Tshabangu signals the continued infighting within the CCC as it grapples with internal divisions. The crisis appears to be escalating, leaving the partys future uncertain as it faces mounting internal and external pressures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Citizens Coalition for Change (CCC), led by Professor Welshman Ncube, has suspended the membership of Sengezo Tshabangu just hours … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/ccc-suspends-tshabangu-amid-deepening-drama-2/\">Continue reading<span class=\"screen-reader-text\"> \"CCC Suspends Tshabangu Amid Deepening Drama\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Latest On Rodrigo Bentancur Health Scare",
            "url": "https://www.zimeye.net/2025/01/10/latest-on-rodrigo-bentancur-health-scare/",
            "content": "Sports Correspondent\n\nRodrigo Bentancur has shared an update following his collapse during Tottenhams 1-0 win over Liverpool in the first leg of their Carabao Cup semifinal on Wednesday.\n\nThe Spurs midfielder fell to the ground unchallenged while attempting to reach a corner kick in the 14th minute. The incident caused a significant stoppage, and Bentancur was subsequently taken to the hospital for further assessment.\n\nTottenham manager Ange Postecoglou offered an initial update after the match, saying: My understanding is that he was conscious when he got to the dressing room. We took him to the hospital for checks. It was a worrying moment, but hopefully, he will be OK from what I know.\n\nIn the early hours of Thursday, Bentancur reassured fans via Instagram, writing: All good, guys. Thank you for the messages. Congratulations to the boys on the victory.\n\nLucas Bergvalls late goal secured the win for Spurs.\n\nThe second leg of the semifinal is scheduled for February 6 at Anfield.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Rodrigo Bentancur has shared an update following his collapse during Tottenham’s 1-0 win over Liverpool in the first … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/latest-on-rodrigo-bentancur-health-scare/\">Continue reading<span class=\"screen-reader-text\"> \"Latest On Rodrigo Bentancur Health Scare\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Chikuhwa Leaves Bosso for Scottland FC",
            "url": "https://www.zimeye.net/2025/01/10/chikuhwa-leaves-bosso-for-scottland-fc/",
            "content": "Sports Correspondent\n\nLynoth Chikuhwa has completed a transfer from Highlanders to newly promoted Castle Lager Premier Soccer League club, Scottland FC.\n\nHis contract with Highlanders expired on December 31, and he has now signed with the Mabvaku-based club.\n\nChikuhwa was formally introduced by Scottland FC in a post on X.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Lynoth Chikuhwa has completed a transfer from Highlanders to newly promoted Castle Lager Premier Soccer League club, Scottland … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/chikuhwa-leaves-bosso-for-scottland-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Chikuhwa Leaves Bosso for Scottland FC\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Legendary Mzansi Actor Dies",
            "url": "https://www.zimeye.net/2025/01/10/legendary-mzansi-actor-dies/",
            "content": "By A Correspondent\n\nIt has been reported with great sadness that the legendary actor Peter Mashigo, widely known as Justice from the popular drama series Isiphetho, has passed away.\n\nHis loved ones, colleagues, and fans are deeply mourning the loss of this talented individual.\n\nHis remarkable body of work will ensure that his legacy continues to live on. Peter Mashigo will be remembered fondly.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent It has been reported with great sadness that the legendary actor Peter Mashigo, widely known as Justice … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/legendary-mzansi-actor-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Legendary Mzansi Actor Dies\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Shock As Father R*pes Own Daughter",
            "url": "https://www.zimeye.net/2025/01/10/shock-as-father-rpes-own-daughter/",
            "content": "By A Correspondent\n\nA 54-year-old man from Mberengwa has been taken into custody after being accused of raping his eight-year-old daughter. The alleged incident occurred in December last year at their homestead, where the victim lived with her father and four-year-old sister.\n\nAccording to court records, the accused followed his daughters to bed, forcing the eight-year-old to sleep on his bed while her sister slept on a floor mat. The accused allegedly took advantage of the situation and raped the young girl. He then threatened her with death if she reported the incident.\n\nFortunately, the brave young girl confided in a neighbor the next morning, leading to the accuseds arrest. The case is ongoing, with the accused remanded in custody until the 17th of this month.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 54-year-old man from Mberengwa has been taken into custody after being accused of raping his eight-year-old … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/10/shock-as-father-rpes-own-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Father R*pes Own Daughter\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Trump Admin Blocks Gay Funding For Zimbabwe",
            "url": "https://www.zimeye.net/2025/01/09/trump-admin-blocks-gay-funding-for-zimbabwe/",
            "content": "US- The incoming Donald Trump Republican administration has blocked millions of dollars in taxpayer funds allocated by the outgoing Biden administration for LGBTQI initiatives in Zimbabwe.\n\nRepublican House Foreign Affairs Committee chairman Brian Mast (R., Fla.) criticised the proposals in a letter addressed to Secretary of State Antony Blinken and U.S. Agency for International Development (USAID) administrator Samantha Power.\n\nMasts letter, underscores growing Republican frustration with what they view as ideologically driven foreign aid programs.In recent weeks, my office has been made aware of hundreds of millions of dollars of proposed obligations for initiatives that offer no clear national security benefit to the U.S. or its allies, Mast wrote.\n\nAmong the targeted programs were efforts to combat climate change in the Middle East and promote LGBTQI awareness in Zimbabwe, a southern African country with a deeply entrenched anti-gay stance and a history of criminalising same-sex relationships.\n\nMasts letter reflects his intent to block these expenditures, citing the recent midterm elections as evidence that Americans demand more accountability in government spending.\n\nThe American people sent a clear message in November that they will no longer tolerate uncontrolled spending on programs that are incompatible with the United States interests abroad, Mast wrote. As their representative, I cannot, in good faith, allow you to spend millions of dollars to combat climate change in the war-torn Middle East or fund LGBTQI awareness in Zimbabwe  both of which are among your recent proposals.\n\nZimbabwes government and society are notoriously hostile to LGBTQI rights, with same-sex relationships criminalised and public discourse often rife with homophobic rhetoric.\n\nCritics argue that such initiatives risk backlash that could endanger local activists and alienate an already resistant population.\n\nThese concerns are compounded by Zimbabwes historical ties to the U.S., which are predominantly rooted in diplomatic and economic partnerships rather than progressive social reform.\n\nLeveraging long-standing congressional precedent, Mast vowed to put the funds on hold to prevent the outgoing administration from finalising the expenditures.\n\nHe highlighted plans to reassess such programs under the incoming Trump administration, which is expected to prioritise more conservative foreign policy and aid strategies.\n\nIn defense of its policies, the State Department maintained that the initiatives align with long-standing bipartisan goals.\n\nThe policies and current spending of the administration align with bipartisan foreign policy and national security goals that span many administrations  such as advancing democracy and human rights, protecting and ensuring access to natural resources, and increasing access to education and innovation, a spokesperson told National Review.\n\nHowever, Mast has doubled down on his broader critique of Biden-era foreign aid, releasing a December report detailing the State Departments use of taxpayer dollars for progressive programs.\n\nThese included hosting drag shows in Ecuador, facilitating illegal migrants navigation of the U.S. asylum system, and even domestic censorship efforts targeting conservative media.\n\nSource-National Review/ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "US- The incoming Donald Trump Republican administration has blocked millions of dollars in taxpayer funds allocated by the outgoing Biden … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/trump-admin-blocks-gay-funding-for-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Trump Admin Blocks Gay Funding For Zimbabwe\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Bosso Prolific Forward Joins Scotland FC",
            "url": "https://www.zimeye.net/2025/01/09/bosso-prolific-forward-joins-scotland-fc/",
            "content": "Sports Correspondent\n\nLynoth Chikuhwa has made a move from Highlanders to join newly promoted Castle Lager Premier Soccer League club Scottland FC.\n\nChikuhwas contract with Highlanders ended on December 31, and he has now signed with the Mabvaku-based side.\n\nThe striker was officially unveiled by Scottland FC in a post on X.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Lynoth Chikuhwa has made a move from Highlanders to join newly promoted Castle Lager Premier Soccer League club … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/bosso-prolific-forward-joins-scotland-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Bosso Prolific Forward Joins Scotland FC\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Tottenham Midfielder Collapses During Victory Over Liverpool",
            "url": "https://www.zimeye.net/2025/01/09/tottenham-midfielder-collapses-during-victory-over-liverpool/",
            "content": "Sports Correspondent\n\nRodrigo Bentancur has provided an update after collapsing during Tottenhams 1-0 win over Liverpool in the first leg of their Carabao Cup semifinal on Wednesday.\n\nThe Spurs midfielder fell to the ground unchallenged while attempting to meet a corner kick in the 14th minute of the match. The incident led to a significant stoppage before Bentancur was taken to the hospital for further evaluation.\n\nTottenham manager Ange Postecoglou shared an initial update following the match, stating:My understanding is that he was conscious when he got to the dressing room. We took him to the hospital to get checked. It was a worrying moment, but hopefully, he will be OK from what I know.\n\nIn the early hours of Thursday, Bentancur took to Instagram to reassure fans, writing: All good, guys. Thank you for the messages. Congratulations to the boys on the victory.\n\nThe win was secured by Lucas Bergvalls late goal.\n\nThe second leg of the semifinal will take place on February 6 at Anfield.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Rodrigo Bentancur has provided an update after collapsing during Tottenham’s 1-0 win over Liverpool in the first leg … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/tottenham-midfielder-collapses-during-victory-over-liverpool/\">Continue reading<span class=\"screen-reader-text\"> \"Tottenham Midfielder Collapses During Victory Over Liverpool\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        },
        {
            "title": "Precautions For Pedestrians",
            "url": "https://www.zimeye.net/2025/01/09/precautions-for-pedestrians/",
            "content": "As we welcome the New Year, many of us have made resolutions to prioritize our health and wellbeing.\n\nFor some, this means increasing our physical activity by walking more.\n\nHowever, with the hustle and bustle of daily life, its essential to remain vigilant and aware of our surroundings, especially when sharing the roads with vehicles.\n\nTo all pedestrians, be mindful of your surroundings and take necessary precautions to ensure your safety. Before stepping out, make sure to:\n\nTo all drivers, its crucial to be aware of pedestrians and take necessary precautions to ensure their safety. Remember to:\n\nSafety is a shared responsibility, and by working together, we can create a safer and more harmonious environment for everyone. Remember, safety never takes a holiday, so lets make it a priority in 2025.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "As we welcome the New Year, many of us have made resolutions to prioritize our health and wellbeing. For some, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/precautions-for-pedestrians/\">Continue reading<span class=\"screen-reader-text\"> \"Precautions For Pedestrians\"</span></a></p>",
            "time": "18:41",
            "date": "10 Jan 2025"
        }
    ]
}