{
    "news": [
        {
            "title": "RBZ Goes After Chivhayo’s Cash Stash",
            "url": "https://www.zimeye.net/2025/02/11/rbz-goes-after-chivhayos-cash-stash/",
            "content": "ByBusinessReporter-TheReserve Bank of Zimbabwe (RBZ) has raised alarm over millions of dollars lying idle in cash deposit boxes across the country, a growing trendthat isstarving the economy of much-needed liquidity.\n\nWhile the central bank did not mention names, its latest statement appears tobe aimedat controversial businessman and Zanu PF loyalist Wicknell Chivhayo, along with his associates like gold dealer Scott Sakupwanya, who frequently flaunt vast amounts of foreign currency on social media.\n\nChivayo, a self-styled tycoon with a well-documented history of fraud and shady dealings, has become infamous for his ostentatious displays of wealth.\n\nHe has splurged on an extravagant fleet of luxury vehiclesranging from Rolls Royces to Bentleys and Lamborghinissome of which he has gifted to musicians, socialites, and influencers in exchange for public endorsements of President Emmerson Mnangagwas Vision 2030 agenda.\n\nDespite his extravagant lifestyle, Chivhayo has never publicly declared his sources of income or provided proof of financial legitimacy, fueling widespread speculation about his dealings.\n\nHehas previouslybeenimplicatedin high-profile scandals, including a multi-million-dollar Zimbabwe Power Company (ZPC) tender fraud case in which hewas accusedof receiving $5 million for a power project that never materialized.\n\nAnnouncing his 2025 Monetary Policy Statement, RBZ Governor John Mushayavanhu cautioned against the growing trend of businesses and individuals hoarding large sums of cash outside the formal banking system.\n\nThere are manufacturers who are supplying goods to the informal market but are not banking their proceeds. They are keeping these monies in their cash boxes, which is not in line with the Anti-Money Laundering Act. The Financial Intelligence Unit (FIU) will not just watch but will dismantle this practice, Mushayavanhu stated.\n\nThe central bank governor emphasized that stockpiling cash presents unnecessary risks, especially in light of recent increases in prepaid credit limits and attractive interest rates on savings accounts.\n\nThe issue here is that robbers have been targeting buses, especially cross-border traders, and stealing their cash. There is no need to keep large sums of money in cash when one can simply upload their funds onto a card, with limits now increased to US$1 million. We have also adjusted interest rates on savings accounts, which makes banking more attractive, he explained.\n\nToinstillconfidence in the local banking sector and encourage a culture of saving, the RBZ has implemented incremental increases in interest rates on deposits.\n\nHowever, whether the central bank will take concrete action against individuals like Chivayowho continue to operate outside the formal financial system while openly displaying unexplained wealthremains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-The Reserve Bank of Zimbabwe (RBZ) has raised alarm over millions of dollars lying idle in cash deposit boxes across the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/rbz-goes-after-chivhayos-cash-stash/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ Goes After Chivhayo’s Cash Stash\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "Mohadi In Fresh Health Scare",
            "url": "https://www.zimeye.net/2025/02/11/mohadi-in-fresh-health-scare/",
            "content": "By Munacho Gwamanda- Vice PresidentKembo Mohadimade a rare public appearance at theNational Heroes Acreon Monday for the burial ofnational hero Tinaye Chigudu, but his frail posture, masked face, and unsteady gait have reignited concerns about his deteriorating health.\n\nDressed in a dark navy suit and wearing a black face mask, his security detail closely assisted Mohadi, his slow and deliberate movements reflecting physical strain.\n\nHis use of a maskdespite COVID-19 restrictions being largely liftedhas fueled speculation about a possible respiratory condition or another undisclosed ailment.\n\nMohadis health has long been a subject of concern, with reports of frequent medical trips abroad and past incidents where he collapsed at public functions.\n\nIn 2023, he fainted while delivering a lecture at theUniversity of Zimbabwe, appearing disoriented before requesting water and losing consciousness.\n\nThe same year, security agents allegedly forced journalists to delete footage of him collapsing at aZanu PFcampaign rally in Gutu, Masvingo.\n\nHis declining health has also led to reduced public engagement.\n\nLast month, while PresidentEmmerson Mnangagwa was on leave,Defence Minister Oppah Muchinguriwas unexpectedly tasked with representing Zimbabwe atJohn Mahamas inauguration in Ghanaa duty that should have fallen to Mohadi as acting president.\n\nGovernment insiders suggested concerns over his ability to handle the physical demands of the trip led to the last-minute change.\n\nBeyond his health struggles, Mohadis political career has been marred by scandal.\n\nIn 2021, he resigned in disgrace after leaked audio tapes alleged he had engaged in sexual misconduct with multiple women, including married subordinates.\n\nDespite denying the accusations, the controversy forced him out of officeonly for him to be quietly reinstated in 2023 assecond vice president, alongsideConstantino Chiwenga.\n\nMohadis return was widely seen as part of Mnangagwas strategy to counterbalanceChiwenga, his powerful deputy and former coup ally.\n\nWith Mnangagwa pushing for a controversialthird term, tensions between the two men have escalated.\n\nMohadis continued presence in high-profile engagements, includingMnangagwas Vision 2030 campaign, appears to be an effort to reinforce loyalty within the ruling partys inner circle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Vice President Kembo Mohadi made a rare public appearance at the National Heroes Acre on Monday for the burial of national hero … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/mohadi-in-fresh-health-scare/\">Continue reading<span class=\"screen-reader-text\"> \"Mohadi In Fresh Health Scare\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "Bosso Under Pressure To Clear Salary Arrears",
            "url": "https://www.zimeye.net/2025/02/11/bosso-under-pressure-to-clear-salary-arrears/",
            "content": "By A Correspondent\n\nHighlanders Football Clubs preparations for the 2025 season have suffered a significant setback after FIFA imposed a transfer ban on the club due to unpaid salaries to their former coach, Baltemer Brito.\n\nThe club had recently reassured fans and stakeholders that they were making progress in settling the debts owed to Brito and his assistant, Antonio Torres. It was believed that the clubs principal sponsor, Sakunda Holdings, was in the process of covering the outstanding payments.\n\nBrito is owed US$15,000, while Torres is owed nearly US$12,000 in salary and bonuses.\n\nAs a result of the ban, Highlanders are prohibited from making new signings, whether local or international. With the club already facing a player exodus, the team had hoped to strengthen its squad but will now have to rely on its current roster or look to its development side for reinforcements.\n\nHighlanders FC is not the first Zimbabwean club to face such sanctions. Yadah FC also received a similar ban in the past for failing to meet their contractual obligations to Brazilian players.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Highlanders Football Club’s preparations for the 2025 season have suffered a significant setback after FIFA imposed a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/bosso-under-pressure-to-clear-salary-arrears/\">Continue reading<span class=\"screen-reader-text\"> \"Bosso Under Pressure To Clear Salary Arrears\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "Victim Of Crocodile Attack Named",
            "url": "https://www.zimeye.net/2025/02/11/victim-of-crocodile-attack-named/",
            "content": "By A Correspondent\n\nA fisherman was tragically killed in a suspected crocodile attack at Mogalakwena River, Limpopo, on Friday. His lifeless body was discovered with significant injuries, including the loss of his hands and stomach.\n\nThe victim, identified as Phuthi Oscar Serumula from Arrie Village in Maleboho, was last seen fishing at the same location. Authorities are urging local residents to avoid swimming, fishing, or crossing rivers known to be infested with crocodiles to prevent further tragedies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A fisherman was tragically killed in a suspected crocodile attack at Mogalakwena River, Limpopo, on Friday. His … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/victim-of-crocodile-attack-named/\">Continue reading<span class=\"screen-reader-text\"> \"Victim Of Crocodile Attack Named\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zanu PF Youths Humiliate Mnangagwa DJ",
            "url": "https://www.zimeye.net/2025/02/11/zanu-pf-youths-humiliate-mnangagwa-dj/",
            "content": "By A Correspondent\n\nMr. Emmerson Mnangagwas personal DJ (DJ Masomere) was reportedly manhandled at an event in Bulawayo over the weekend, according to well-placed sources within Zanu PF.\n\nThe incident, which took place at a Zanu PF gathering, has stirred controversy, though the exact reasons for the altercation remain unclear. The Zanu PF controlled Operation Restore Legacy Facebook Page revealed details about the incident.\n\nIn the post, the page expressed outrage at the assault on DJ Masomere, castigating the actions of Zanu PF youths in Bulawayo.\n\nThe post, which appeared on Monday, stated:\n\nBulawayo Province Youths, we are coming for you. Why did you want to beat DJ? We, SADC, cannot tolerate you assaulting our DJ. You cannot grab his collar, his jacket, and humiliate him like that.\n\nThe statement continued by addressing internal disagreements within the province, specifically highlighting the role of the Commissariat department:\n\nKo Bulawayo Province hanzi tine department re Commissariate hatina ma DJ, ma DJ anowanikwa kubhawa (Translation: So Bulawayo Province says it has no DJ department, DJs are only found in bars)\n\nAdditionally, the post referred to a separate issue involving a person named Aphia, accusing her of causing trouble among attendees and publicly disrespecting others at the event.\n\nUkuwo uyu musikana Aphia achinetsawo kumaHumpers kutotuka badala bedu, haaaaa these people, (Operation Restore Legacy posted, implying further internal tensions within the gathering).\n\nThough the exact motives behind the assault on DJ Masomere remain unclear, the event has triggered a wave of discussions and raised questions about the internal dynamics within Zanu PF, particularly in Bulawayo. The matter is likely to continue unfolding in the coming days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mr. Emmerson Mnangagwa’s personal DJ (DJ Masomere) was reportedly manhandled at an event in Bulawayo over the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/zanu-pf-youths-humiliate-mnangagwa-dj/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Youths Humiliate Mnangagwa DJ\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "Govt Wants New PigShed At Mbare To Fix Zig Currency",
            "url": "https://www.zimeye.net/2025/02/11/govt-wants-new-pigshed-at-mbare-to-fix-zig-currency/",
            "content": "Will the Ragtag Pig Shed Built by ZANU Restore the ZiG Currency?\n\nA Temporary Fix for a Permanent Crisis?\n\nHarares Mbare Musika, once a thriving hub for informal traders, is now the site of a controversial reconstruction effort following the devastating fire that left thousands of vendors destitute. The ZANU PF government has quickly moved to erect a modern temporary market, but critics are questioning whether this hastily built structure is anything more than a cosmetic solution to a deeper economic crisis.\n\nAt the heart of the debate is the newly introduced Zimbabwe Gold (ZiG) currency, which the government insists will stabilize the economy. But will a makeshift trading market, likened by some vendors to a ragtag pig shed, be enough to restore confidence in a currency that many Zimbabweans already view with skepticism?\n\nA Currency on Shaky Ground\n\nSince its launch last April, the ZiG has struggled to gain public trust. Market confidence is at an all-time low due to Zimbabwes turbulent monetary history, including the catastrophic hyperinflation of the 2000s and the more recent collapse of the RTGS dollar. Many traders at Mbare Musika, where transactions are often conducted in US dollars, have refused to fully adopt the ZiG, fearing it will follow the same disastrous path as its predecessors.\n\nThe government, however, has doubled down on enforcing the currency, with authorities targeting informal traders suspected of engaging in forex dealings. Leaked reports suggest that the fire that gutted Mbare Musika may have been a deliberate ploy to disrupt illegal currency trading and force vendors to accept the ZiG.\n\nSpace Barons and Corruption: Business as Usual?\n\nEven as officials tout the new market as a step toward formalization and economic stability, reports are emerging that space baronsconnected to ruling party elitesare already exploiting traders by demanding bribes of US$10 per person just to be considered for a stall. This raises serious concerns about the true beneficiaries of the reconstruction efforts.\n\nLocal Government Minister Daniel Garwe has assured traders that the allocation of stalls will be done fairly, but vendors on the ground remain skeptical. Many fear that politically connected individuals will seize the prime trading spots, leaving those most affected by the fire without a place to rebuild their businesses.\n\nA Broken Trust: Traders Speak Out\n\nMbare Musika traders are unconvinced that rebuilding the market will address the economic realities they face. A new structure will not bring back our lost goods, and it wont fix the economy, says one trader who lost over US$10,000 in the fire. People dont trust the ZiG, so they use US dollars. Unless the government stabilizes the economy, this is just another exercise in deception.\n\nThe mistrust is well-founded. Previous government initiatives, such as the 2019 reintroduction of the Zimbabwean dollar, ended in disaster as inflation spiraled out of control. Without addressing the root causes of Zimbabwes economic instabilityrampant corruption, excessive government borrowing, and a lack of investor confidenceno amount of infrastructure development will restore faith in the national currency.\n\nWill the Pig Shed Save the ZiG?\n\nThe rush to erect a temporary market in Mbare Musika may serve as a political gesture, but it does little to resolve the deeper financial turmoil gripping Zimbabwe. The governments alleged role in the market fire, combined with its failure to rein in corruption among space barons, has only fueled public distrust.\n\nFor the ZiG to gain legitimacy, the government needs more than new buildingsit needs policies that inspire economic confidence. Without concrete steps to curb inflation, protect traders from exploitation, and restore faith in monetary policies, the ZiG will be nothing more than another failed experiment in Zimbabwes long history of currency disasters.\n\nFor now, traders at Mbare Musika remain caught between a crumbling economy and a government that seems more interested in optics than solutions. Whether the makeshift market will become a beacon of economic revival or just another monument to Zimbabwes ongoing crisis remains to be seen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Will the Ragtag Pig Shed Built by ZANU Restore the ZiG Currency? A Temporary Fix for a Permanent Crisis? Harare’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/govt-wants-new-pigshed-at-mbare-to-fix-zig-currency/\">Continue reading<span class=\"screen-reader-text\"> \"Govt Wants New PigShed At Mbare To Fix Zig Currency\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "President Chamisa Mobilizes Grassroots Support In Rushinga",
            "url": "https://www.zimeye.net/2025/02/11/president-chamisa-mobilizes-grassroots-support-in-rushinga/",
            "content": "By A Correspondent\n\nGift Ostallos Siziba, a prominent representative of opposition leader Advocate Nelson Chamisa, addressed a passionate crowd in Rushinga, Mashonaland Central, over the weekend, urging citizens to prepare for the upcoming transformation in Zimbabwe.\n\nSiziba, speaking on behalf of Chamisa, emphasized the importance of leadership and grassroots political mobilization in bringing about meaningful change in the country.\n\nDeep in Rushinga, Mashonaland Central, were spreading the message of change, led by President Chamisa, Siziba declared, highlighting the regions crucial role in the fight for a better Zimbabwe.\n\nThe people of Rushinga are resilient and vigilant; they have resisted the now-fashionable regime trinkets and trappings. We salute them.\n\nSiziba acknowledged the strength and determination of Rushingas citizens, recognizing their ability to see through the distractions and false promises of the current government. The people here are awake to the truth, he said, emphasizing that their resilience is a key force in the movement for change.\n\nSizibas message was clear: Zimbabwe is ready for transformation. Fellow Zimbabweans, we are all clear: the nation is ready, and we must provide the much-needed leadership to change our realities, he stated. He stressed that the change the country desperately needs cannot happen without strong leadership that understands the concerns and aspirations of ordinary people.\n\nThe call for grassroots political mobilization was central to Sizibas speech. To achieve this, grassroots political mobilization is the answer, he declared, underscoring that true transformation will come when citizens at every level of society are engaged and actively working toward a common goal.\n\nThe statement marked another pivotal moment in the ongoing push for change by the opposition, as Chamisas leadership continues to resonate with communities across the country.\n\nAs Siziba concluded, the message was clear: Onwards!a call for all Zimbabweans to stand together in anticipation of the changes to come.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Gift Ostallos Siziba, a prominent representative of opposition leader Advocate Nelson Chamisa, addressed a passionate crowd in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/president-chamisa-mobilizes-grassroots-support-in-rushinga/\">Continue reading<span class=\"screen-reader-text\"> \"President Chamisa Mobilizes Grassroots Support In Rushinga\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "RBZ to Roll Out Redesigned ZiG Notes as Economy Crumbles",
            "url": "https://www.zimeye.net/2025/02/11/rbz-to-roll-out-redesigned-zig-notes-as-economy-crumbles/",
            "content": "By A Correspondent\n\nIn a continued effort to address Zimbabwes ongoing economic challenges, the Reserve Bank of Zimbabwe (RBZ) has announced plans to redesign the ZiG banknotes.\n\nThis move comes as the country grapples with severe economic instability, marked by inflation, currency devaluation, and a significant decline in domestic production.\n\nZimbabwes economic turmoil has left the nation with little room to sustain itself. The government has been scrambling to find solutions, but the countrys economy remains fragile, with production at a standstill.\n\nThis economic collapse is highlighted by the crumbling currency system, which is struggling to maintain its value amidst the uncertainty.\n\nRBZ Governor, Dr. John Mushayavanhu, explained that the redesigned ZiG notes aim to address two major concerns: combating counterfeiting and improving the durability of the current banknotes.\n\nThe redesign of the ZiG notes incorporates valuable feedback received from stakeholders during the 2025 Monetary Policy Statement and Reserve Bank 2025-2029 strategy formulation stakeholder consultations, Dr. Mushayavanhu told State media.\n\nThe current ZiG notes, introduced in April 2024, have been widely criticized for their poor durability. Consumers and businesses alike have pointed out that the notes quickly become worn and difficult to handle. Merchants and banks have also raised concerns about the usability of the notes as they easily fade and fray, making them hard to accept in daily transactions. Only the ZiG10 and ZiG20 notes have so far been released into circulation, adding to the uncertainty surrounding Zimbabwes currency.\n\nAccording to Dr. Mushayavanhu, the new designs will feature enhanced security features to prevent counterfeiting, a standard practice for central banks around the world. He emphasized, The redesign of ZiG notes does not signify redenomination or any form of currency reform. This initiative is solely focused on enhancing the quality of the notes.\n\nWhile the public might hope that this redesign could signal a much-needed currency overhaul, Dr. Mushayavanhu was quick to clarify that this is not the case. I must reiterate that the Reserve Bank is not going to issue a new currency, and in this regard, the public should not be apprehensive, he said. Instead, the Reserve Bank is merely redesigning the current banknotes to enhance quality, in line with international standards.\n\nThe Governor also assured the public that the redesigned notes would be issued in the same denominations as the original ZiG notes, which include ZiG1, ZiG2, ZiG5, ZiG10, ZiG20, ZiG50, ZiG100, and ZiG200. The new notes will be rolled out as the need arises in the market.\n\nDr. Mushayavanhu confirmed that the rollout of these enhanced notes would be communicated to the public in due course. However, higher-denomination notes will only be introduced if there is a clear demand for them in the economy. The focus, for now, remains on making the current banknotes more durable and secure as Zimbabwe continues to battle its ongoing economic crisis.\n\nAs the country struggles with inflation and the lack of domestic production, the redesigned ZiG notes serve as a temporary measure in the face of a much deeper economic crisis that is unlikely to improve without fundamental reforms.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a continued effort to address Zimbabwe’s ongoing economic challenges, the Reserve Bank of Zimbabwe (RBZ) has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/rbz-to-roll-out-redesigned-zig-notes-as-economy-crumbles/\">Continue reading<span class=\"screen-reader-text\"> \"RBZ to Roll Out Redesigned ZiG Notes as Economy Crumbles\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "Mutsa Mangombe Funeral Procession",
            "url": "https://www.zimeye.net/2025/02/11/mutsa-mangombe-funeral-procession/",
            "content": "By Dorrothy Moyo | ZimEye | Mabvazuva, Zimbabwe  The local biking community came together in a heartfelt and solemn tribute to honor the life of their late comrade, Mutsa Mangombe. In a display of brotherhood and deep sorrow, bikers from various clubs escorted his body from the First Mutual Parlour to his home in Mabvazuva.\n\nMourners, dressed in black biker jackets adorned with club insignias, gathered in large numbers to pay their last respects. The emotional procession was marked by the roaring sounds of motorcycles and the sight of bikers standing shoulder to shoulder, carrying the casket of their fallen friend.\n\nIn one poignant moment, a floral arrangement spelling out the word BIKER was held high, symbolizing the strong bond that Mangombe shared with his riding family. Friends, family, and fellow bikers could be seen holding white and blue floral wreaths, reflecting the respect and admiration he earned in the community.\n\nAs the coffin was brought into the home, riders stood solemnly, helmets in hand, a symbol of their grief and tribute. The streets leading to the house were lined with high-performance motorcycles, a fitting honor for a man whose passion for riding was evident throughout his life.\n\nMangombe, whose life was tragically cut short, was described by his peers as a dedicated rider, mentor, and beloved member of the ZIM Bikers fraternity. His passing leaves a deep void in the biking community, with many remembering him as a man who embraced the thrill of the open road with unwavering enthusiasm.\n\nAs bikers, we are in deep pain over the loss of a family member, and we say, Rest in Peace, read a statement from ZIM Bikers, the group that organized the procession.\n\nThe funeral arrangements are set to continue with more tributes expected from friends and fellow bikers. The biking community has vowed to keep Mangombes memory alive through future rides and events in his honor.\n\nRest in Power, Mutsa Mangombe. Your spirit will forever ride on.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | Mabvazuva, Zimbabwe – The local biking community came together in a heartfelt and solemn … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/mutsa-mangombe-funeral-procession/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsa Mangombe Funeral Procession\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        },
        {
            "title": "Urikhob Takes Dynamos To FIFA Over 9000 Debt",
            "url": "https://www.zimeye.net/2025/02/11/urikhob-takes-dynamos-to-fifa-over-9000-debt/",
            "content": "By A Correspondent\n\nHarare football powerhouse Dynamos FC could face sanctions, including a potential ban from the CAF Confederation Cup or a transfer ban, after former striker Sadney Urikhob escalated a dispute over unpaid signing-on fees and performance bonuses to FIFA.\n\nUrikhob, who played for Dynamos during the 2022 season, contributed to the teams success in winning the Chibuku Super Cup, which secured them a spot in the CAF Confederation Cup.\n\nAfter his stint at Dynamos, the former Simba SC striker joined Premiership debutants Scottland.\n\nIt has been revealed that Urikhob was due to receive his signing-on fees, totaling US$9,000, from Dynamos by February of the previous year.\n\nHowever, the Harare-based club failed to make the payment. After attempts to resolve the matter internally, Urikhob notified the Moses Maunganidze-led executive of his intention to take the issue to FIFA.\n\nFollowing standard procedure, Urikhobs representatives sent three formal letters to Dynamos, but the financially-struggling club failed to respond.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare football powerhouse Dynamos FC could face sanctions, including a potential ban from the CAF Confederation Cup … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/11/urikhob-takes-dynamos-to-fifa-over-9000-debt/\">Continue reading<span class=\"screen-reader-text\"> \"Urikhob Takes Dynamos To FIFA Over 9000 Debt\"</span></a></p>",
            "time": "09:08",
            "date": "12 Feb 2025"
        }
    ]
}