{
    "news": [
        {
            "title": "Gonyet Accident At Rhodesville Police Station",
            "url": "https://www.zimeye.net/2025/09/17/gonyet-accidentally-at-rhodesville-police-station/",
            "content": "Container Truck Overturns at Rhodesville Police Station  Police Yet to Comment\n\nBy Dorrothy Moyo | ZimEye | Harare  17 September 2025  A dramatic accident occurred this morning at Rhodesville Police Station in Harare after a heavy-duty truck hauling a shipping container overturned, crushing a parked vehicle inside the police station yard.\n\nEyewitnesses at the scene reported that the truck, pulling a large MOL-branded container, appeared to lose stability as it was manoeuvring through the police station premises. The container toppled off the trailer, landing on a white Ford pickup parked nearby. Bricks, debris and fuel spillage were visible across the yard after the impact.\n\nEmergency services quickly cordoned off the area while efforts to stabilise the container and assess the damage got underway. It was not immediately clear whether anyone was injured, though onlookers described the incident as frightening given how close it came to the police stations main offices.\n\nThe accident caused a temporary disruption at the station as traffic into the yard was halted and motorists diverted. Police officials at the scene declined to give details, saying a formal statement would be issued later.\n\nAs of publication, the Zimbabwe Republic Police (ZRP) had not yet released an official comment on the cause of the accident or whether any injuries had been recorded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Container Truck Overturns at Rhodesville Police Station – Police Yet to Comment By Dorrothy Moyo | ZimEye | Harare – … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/gonyet-accidentally-at-rhodesville-police-station/\">Continue reading<span class=\"screen-reader-text\"> \"Gonyet Accident At Rhodesville Police Station\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "ED Minister Humiliated in Public",
            "url": "https://www.zimeye.net/2025/09/17/ed-minister-humiliated-in-public/",
            "content": "By A Correspondent Justice Minister Ziyambi Ziyambi was publicly humiliated on Sunday by Zanu PF youths during a provincial inter-district conference at Chinhoyi University of Technology, as frustrations over unfulfilled promises boiled over.\n\nThe angry exchanges centred on land distribution and the much-publicised Presidential Heifer Scheme.\n\nZiyambi, who was delivering an address, was jeered and interrupted three times, forcing fellow politburo member and Health and Child Care Minister Douglas Mombeshora to step in. His attempts to calm the delegates were, however, met with more hostility.\n\nYoung party members accused the leadership of issuing offer letters for non-existent land and prioritising the 2030 agenda over promises made for 2028.\n\nEfforts by provincial chairperson Mary Mliswa-Chikoka to restore order also failed, with the crowd growing louder in its demands. It was only after Mashonaland West War Veterans League chairperson Happison Muchechetere intervened that tempers cooled and proceedings resumed.\n\nDespite the disruption, the conference concluded with limited discussions, adopting only one resolution: to endorse the extension of President Emmerson Mnangagwas term beyond 2028. The resolution, echoing a similar decision made at last years Bulawayo conference, stated:\n\nAs Mashonaland West province has unanimously resolved, we call for the immediate implementation of our resolution to endorse and affirm His Excellency Dr Emmerson Mnangagwa as the first secretary for Zanu PF and President of Zimbabwe to continue serving in both capacities until 2030.\n\nNewsDays attempts to obtain comment from Mliswa-Chikoka were unsuccessful, while provincial secretary for information and vice-chairperson Misheck Nyarubero declined to discuss what he described as a sensitive matter involving national leadership.\n\n-NewsDay\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Justice Minister Ziyambi Ziyambi was publicly humiliated on Sunday by Zanu PF youths during a provincial inter-district … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/ed-minister-humiliated-in-public/\">Continue reading<span class=\"screen-reader-text\"> \"ED Minister Humiliated in Public\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Cameroon Forthcoming 2025 Elections: A Litmus Test for Democracy in Africa | VICTORIA MALUA",
            "url": "https://www.zimeye.net/2025/09/17/cameroon-forthcoming-2025-elections-a-litmus-test-for-democracy-in-africa-victoria-malua/",
            "content": "By Victoria Malua | Democracy in Africa has long been a subject of both scrutiny and aspiration, often suspended between the ideal and the real. At independence, many Africans believed that the end of colonial rule would usher in an era of freedom, accountability, and people-centered governance. Visionary leaders such as Kwame Nkrumah spoke passionately of a united and democratic Africa, one where sovereignty was anchored not only in national independence but also in the collective will of the people. Nkrumah declared that the independence of Ghana is meaningless unless it is linked up with the total liberation of Africa. Liberation was never meant to be merely political, but rather it was meant to be democratic. Yet decades later, the continents democratic journey remains fragile and uneven. While some countries, such as Ghana, Botswana, and Zambia, have demonstrated that peaceful alternation of power is possible, others remain locked in cycles of manipulated elections, authoritarian entrenchment, and the hollowing out of institutions. This leads to some questions, like what explains this divergence? Is democracy in Africa a mere faade, preserved through ritualistic elections but emptied of substance? Or is it a project still in the making, struggling to find an authentic African expression?\n\nThe 2025 presidential elections in Cameroon, scheduled for October 12, illustrate these contradictions with remarkable clarity. On the surface, they reaffirm the ritual of democratic practice: ballots, campaigns, and the language of political choice. Yet beneath the surface lies a reality that casts doubt on their legitimacy. The exclusion of opposition leader Maurice Kamto who secured second place in the disputed 2018 elections demonstrates how fragile democratic institutions can be when wielded by those in power. Can a political process truly be called democratic when credible challengers are disqualified? What message does this send to citizens whose aspirations for change are effectively silenced before a single ballot is cast?\n\nCameroons case is far from unique. Across Africa, leaders have extended their tenure beyond constitutional limits, often invoking stability, national security, or development as justifications. In Uganda, President Yoweri Museveni has remained in power since 1986, navigating constitutional amendments to eliminate age and term limits. In Rwanda, President Paul Kagame secured a referendum in 2015 that potentially allows him to remain in office until 2034. While such leaders argue that continuity provides stability, history shows that centralization of power more often breeds corruption, governance failures, and public disillusionment. Can sustainable development be achieved when the competition of ideas is stifled and accountability mechanisms are eroded? How can citizens continue to believe in the sanctity of the ballot when it repeatedly favors incumbency rather than genuine choice?\n\nAt the heart of this dilemma lies the question of institutional strength. Elections alone do not make a democracy. Without strong electoral commissions, independent judiciaries, and impartial security forces, ballots risk becoming little more than legitimizing tools for entrenched elites. The irony is glaring: many African governments champion the language of democracy before international partners while simultaneously undermining the very institutions that make democracy meaningful at home. Is democracy in Africa thus becoming an external performance for global legitimacy rather than an internal process for empowering citizens?\n\nCameroons present predicament echoes similar crises across the continent. In Zimbabwe, elections under both Robert Mugabe and his successor Emmerson Mnangagwa have been tainted by accusations of manipulation and violence. In Equatorial Guinea, Teodoro Obiang has consistently claimed electoral victories with margins exceeding 90%, results that raise more suspicion than confidence. And in Ethiopia, elections have too often coincided with outbreaks of violence and ethnic unrest, raising the question of whether elections can heal or merely inflame fragile societies. Yet, counter-examples exist. Ghana has since 1992 demonstrated that peaceful transfers of power are possible, making it a benchmark for democratic practice on the continent. Zambias 2021 elections, which saw Hakainde Hichilema defeat an entrenched incumbent, rekindled hope that the will of the people can prevail even under difficult circumstances. Does this not suggest that the problem is not democracy itself, but the way it is practiced or perhaps misused in different contexts?\n\nCivil society has emerged as a vital safeguard against democratic decline. In Senegal, civil society groups successfully resisted President Abdoulaye Wades attempt to secure a third term in 2012, mobilizing citizens in defense of constitutional order. In Burkina Faso, a popular uprising in 2014 ended Blaise Compaors 27-year rule after he sought to amend the constitution to extend his stay in power. These examples highlight the power of ordinary citizens to reclaim democracy from elites. But they also raise pressing questions: how sustainable are such movements in the face of repression? Can grassroots mobilization alone counter entrenched systems, or must it be coupled with institutional reforms to secure long-term democratic gains?\n\nThe international dimension adds yet another layer of complexity. Global powers often champion democracy in rhetoric, yet their actions are inconsistent. Western governments may condemn flawed elections, but their geopolitical interests in resources, counterterrorism, or regional stability sometimes lead them to turn a blind eye. Chinas growing presence in Africa, rooted in economic partnerships and a doctrine of non-interference, provides authoritarian regimes with an alternative to Western pressure. Does this geopolitical competition strengthen African agency, or does it undermine efforts to promote democratic accountability? Can Africa forge a democratic path that is both authentic and insulated from external manipulation?\n\nThe irony of elections in Africa is that they often provide both hope and disillusionment in equal measure. For citizens, elections remain moments of anticipation, opportunities to demand change and exercise sovereignty. Yet for many elites, they remain instruments of control, carefully managed to project legitimacy without risking the transfer of power. This duality between ritual and reality, form and substance defines the paradox of African democracy. How long can this contradiction endure before citizens abandon faith in the ballot altogether? And if they do, what alternative forms of governance might emerge in its place?\n\nSolutions to Africas electoral challenges must therefore be multidimensional. Institutional reforms are essential: strengthening electoral commissions, ensuring judicial independence, and enforcing presidential term limits are non-negotiable steps. But reforms alone are insufficient without a cultural transformation in how democracy is understood and practiced. Citizens must be empowered not just to vote but to engage in governance beyond elections through active civil society, accountability mechanisms, and grassroots participation. Perhaps Africa needs to rediscover its own democratic traditions systems of consensus, communal decision-making, and accountability rooted in indigenous governance and adapt them to contemporary realities. Could it be that authentic African democracy will emerge not from mimicking Western models, but from reinterpreting local traditions in modern forms?\n\nThe 2025 elections in Cameroon thus stand as more than a national political event. They are a mirror reflecting the broader dilemmas of African democracy. They raise uncomfortable but necessary questions about power, legitimacy, and accountability. Above all, they remind us that democracy is not a destination but a struggle. A struggle to turn the ritual of elections into the reality of peoples sovereignty. If Africa is to fulfill Nkrumahs vision of genuine liberation, it must confront these contradictions head-on. For without democratic substance, independence remains incomplete, and freedom remains an illusion.\n\nBy Victoria Malua\n\nMalua is an undergraduate student at Africa University and she writes this in her personal capacity\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Victoria Malua | Democracy in Africa has long been a subject of both scrutiny and aspiration, often suspended between … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/cameroon-forthcoming-2025-elections-a-litmus-test-for-democracy-in-africa-victoria-malua/\">Continue reading<span class=\"screen-reader-text\"> \"Cameroon Forthcoming 2025 Elections: A Litmus Test for Democracy in Africa | VICTORIA MALUA\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zim Accountant Loses Estate Over R17 million Fraud",
            "url": "https://www.zimeye.net/2025/09/17/zim-accountant-loses-estate-over-r17-million-fraud/",
            "content": "By A Correspondent| A Zimbabwean accountant has had his estate finally sequestrated after stealing millions of rand from his former employer, Johannesburg-based non-profit company Education and Training Unit (ETU).\n\nEdward Mwanandimai siphoned millions of rand meant to pay the SA Revenue Service (SARS) and other suppliers, and later failed to honour acknowledgement of debt payments despite claiming to have over R145 million in assets.\n\nHe worked as an accountant at ETU from July 2014 until voluntarily leaving on or around May 31, 2020.\n\nAccording to papers filed at the Gauteng High Court, Pretoria, the first fraudulent ETU payment was made in January 2015 to SARS, with a total of 384 such payments occurring during employment, the last being in April 2020.\n\nMwanandimai also diverted payments meant for legitimate creditors like SARS to his or his company Lopdale Services and Investments accounts.\n\nAn internal investigation conducted by ETU revealed that these payments did not reach the intended recipients. Between January and July 2015, one of Mwanandimais bank accounts received nearly R679,000.\n\nLopdale Services and Investments was paid R14.65 million in the period between August 2015 to December 2019, while an additional R396,100 was also transferred.\n\nMwanandimai set up supplier accounts resembling existing ones, directing payments to accounts linked to himself and created a fake employee, who as part of ETUs Discovery Medical Aid Scheme, led to fraudulent contributions totalling R160,845 from September 2017 to April 2020.\n\nMwanandimais actions were discovered after a new accountant was hired and audited the accounts, and established that he misappropriated over R17m, with about R6.8m, the capital debt, confirmed.\n\nIn September 2020, he acknowledged the use of funds from ETU and confirmed that the amount owed corresponds to the outstanding balance specified in the signed acknowledgment of debt.\n\nThe debtor (Mwanandimai) is truly and lawfully indebted and legally bound to the creditor (ETU) in the amount of six million seven hundred and ninety-seven thousand seven hundred and fifteen rand and sixty cents (R6 797 715.60), reads the acknowledgment of debt.\n\nIn the acknowledgment of debt, he admitted that he stole several millions of rand from ETU and that the total amount stolen was in excess of the capital debt.\n\nHe did repay certain of the money which he stole.\n\nIn my considered opinion, the interests of justice are best served by the court exercising its discretion to grant a final sequestration order.\n\nThe issuance of such an order would benefit all the creditors by invoking the pertinent provisions of the Insolvency Act, thereby facilitating an investigation of the estate for their advantage, the acting judge declared.\n\nETU also filed a fraud case with the Yeoville police station in September 2020.\n\nMwanandimais legal representative did not respond to requests for comment while attempts to contact ETU were unsuccessful.\n\nHis lawyers indicated that he was willing to settle the amount outstanding of R1.777m but could only afford an amount of R100,000 a month due to the Covid-19 pandemic and the July 2021 looting unrest, which has affected his business.\n\nIn a letter dated October 11, 2021, Mwanandimai offered to pay over R10.9m, starting January 31, 2022, over a period of 72 months, which is less than the outstanding balance of R17.1m.\n\nA certificate of balance indicating an amount of R17.1m was issued after all transactions were confirmed by the relevant banks, but Mwanandimai has not made any payments since June 2021.\n\nLast Thursday, Acting Judge Sanet van Aswegen found that Mwanandimai did not manage or disclose his estate with sufficient transparency, and that supporting documentation was provided only at the hearing, despite the prior submission of both an answering affidavit and a supplementary answering affidavit.\n\nETU also paid R239,819 for his medical aid contributions to Bestmed from November 2016 to April 2020, without deducting these amounts from his salary.ETU also covered his cellular phone accounts, with no recovery from his salary and he set up three debit orders on the entitys account.\n\nMwanandimai manipulated bank master data and payroll records to gain unauthorised benefits.\n\nHe initially had viewing rights on the banking system but was subsequently granted payment loading access after he requested further authorisation, according to court papers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A Zimbabwean accountant has had his estate finally sequestrated after stealing millions of rand from his former … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/zim-accountant-loses-estate-over-r17-million-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Accountant Loses Estate Over R17 million Fraud\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "WATCH: Geza Reveals Clearer Graphics Of Mr. Wicknell Chivayo Publicly Imitating Donald Trump’s Wife In Bedroom Duties for Mnangagwa",
            "url": "https://www.zimeye.net/2025/09/17/watch-geza-reveals-clearer-graphics-of-mr-wicknell-chivayo-publicly-imitating-donald-trumps-wife-in-bedroom-duties-for-mnangagwa/",
            "content": "War veteran@BlessedGezaon Tuesday night confirmed a bizarre sexual relationship that@wicknellchivayoonce suggested he has with President@edmnangagwain descriptions of his key body part (\"held it in a dzvii way!\", and front body parts which Mnangagwa himself also motionedhttps://t.co/Hn8KhXSFAxpic.twitter.com/hRMMOeWy40\n\nBy Simba Chikanza | ZimEye | War veteran @BlessedGeza on Tuesday night confirmed a bizarre sexual relationship that @wicknellchivayo once suggested he has with President @edmnangagwa in descriptions of his key body part (held it in a dzvii way!, and front body parts which Mnangagwa himself also motioned towards during a meeting with news editors earlier in 2025 saying that Wicknell isnt his front affair person, and yet at his own birthday function on 15 Sept 2025, the first person who came out of his helicopter wasnt the First Lady @MnangagwaA but a privileged male by name Mr Wicknell Chivayo, by order of First Family seniority. Geza said Chivayo is entangled in a tri-sexual relationship with Mnangagwa both men being ritualists, who include Auxillia herself, a well known Chiweshe shrine girl, from Mash Central where Mnangagwa selected her during a witch doctors spiritist sessions. The attached documentary examines Gezas damning allegations.\n\nAll accused persons were reached for comment.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Simba Chikanza | ZimEye | War veteran @BlessedGeza on Tuesday night confirmed a bizarre sexual relationship that @wicknellchivayo once … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/watch-geza-reveals-clearer-graphics-of-mr-wicknell-chivayo-publicly-imitating-donald-trumps-wife-in-bedroom-duties-for-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"WATCH: Geza Reveals Clearer Graphics Of Mr. Wicknell Chivayo Publicly Imitating Donald Trump’s Wife In Bedroom Duties for Mnangagwa\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Top Benz Garage Up In Flames",
            "url": "https://www.zimeye.net/2025/09/17/top-benz-garage-up-in-flames/",
            "content": "By A Correspondent One of Mutares top luxury car workshops, Brooms Garage, was reduced to rubble yesterday after a fierce blaze tore through the Riverside premises, destroying at least 30 Mercedes-Benz vehicles valued at thousands of US dollars each.\n\nThe garage, well-known for specialising in high-end Benz models, was engulfed in flames that reportedly broke out during a routine litter-clearing exercise by Mutare City Council workers. Within minutes, the blaze spread across the property, leaving behind twisted metal and blackened shells of once-pristine cars.\n\nGarage owner Mr. Anesu Akim, who watched helplessly as the fire consumed his fleet, was left devastated. Visibly shaken and overwhelmed, he could not immediately grant an interview, saying only that the loss was too big to comprehend.\n\nMutare City Council officials have yet to issue a statement, but residents in the Riverside area were quick to blame negligence. Witnesses claimed council workers had been burning litter nearby when the flames leapt onto the garage grounds.\n\nThe police and fire brigade have since launched investigations into the cause of the fire, with questions mounting over safety protocols during council clean-up operations.\n\nCommunity members expressed sympathy for Mr. Akim, whose garage has long been regarded as a trusted destination for luxury car owners across the city and beyond. This is a huge blow, not just to the business but to Mutares reputation as well, said one resident.\n\nAs investigations continue, the disaster has raised fresh concerns over fire safety measures in urban centres, particularly where valuable property and livelihoods are at stake.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – One of Mutare’s top luxury car workshops, Brooms Garage, was reduced to rubble yesterday after a fierce … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/top-benz-garage-up-in-flames/\">Continue reading<span class=\"screen-reader-text\"> \"Top Benz Garage Up In Flames\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Mutare Garage Reduced To Ashes",
            "url": "https://www.zimeye.net/2025/09/17/mutare-garage-reduced-to-ashes/",
            "content": "By A Correspondent A raging fire tore through Brooms Garage in Mutares Riverside area early yesterday, destroying at least 30 vehicles worth thousands of US dollars each and leaving behind a trail of charred shells.\n\nThe garage, known for specialising in Mercedes-Benz models, was engulfed after flames reportedly broke out during a routine litter-clearing operation by Mutare City Council workers.\n\nOwner Mr. Anesu Akim was left devastated by the inferno, which wiped out his fleet in a matter of hours. Visibly shaken and overwhelmed, he could not immediately grant an interview as he grappled with the scale of the loss.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – A raging fire tore through Brooms Garage in Mutare’s Riverside area early yesterday, destroying at least 30 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/mutare-garage-reduced-to-ashes/\">Continue reading<span class=\"screen-reader-text\"> \"Mutare Garage Reduced To Ashes\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Mutangadura Gets Top NPA Job",
            "url": "https://www.zimeye.net/2025/09/17/mutangadura-gets-top-npa-job/",
            "content": "By A Correspondent  Seasoned and controversial state lawyer, Chris Mutangadura has been promoted to the role of Deputy Prosecutor General.\n\nBulawayo-based Chief Public Prosecutor Mrs Tariro Rosa Takuva has also been promoted to the same position, while Mr Dingidhlela Zisengwe, formerly head of uniformed service and formations with the Public Service Commission, has been appointed NPAZ board secretary and Accounting Officer.\n\nProsecutor General Justice Loyce Matanda-Moyo, in a communication to senior NPAZ officials, described the appointments as a significant milestone in strengthening the leadership and operational capacity of the authority as it continues to deliver on its mandate with professionalism, integrity, and excellence. She said the new appointees bring a wealth of experience, expertise, and commitment to the rule of law, adding that their service will enhance prosecutorial efficiency, governance, and overall delivery. Mutangadura and Takuva will now join Mr Nelson Mutsonziwa, who already serves as Deputy Prosecutor General.\n\nDespite his rise through the ranks, Mutangaduras career has not been without controversy. In 2019, he successfully challenged an attempt by then-Prosecutor General Kumbirai Hodzi to transfer him to Guruve. In a landmark ruling, Justice Happious Zhou of the Harare High Court found that the Prosecutor General had no constitutional or statutory authority to employ, deploy, assign, or transfer NPA staff, as such powers are vested in the NPA board. The judge ruled the attempted transfer illegal, irrational, and in violation of Mutangaduras right to administrative justice and legitimate expectation, likening it to assigning a university professor to teach at a primary school  a move he described as grossly irrational. Zhou further stressed that even if Hodzi had such powers, Mutangadura was entitled to be heard before any transfer, a principle that had been deliberately ignored.\n\nFollowing that setback, Hodzi initiated disciplinary proceedings against Mutangadura, accusing him of misconduct in a case involving the release of theft suspect Kudakwashe Unity Mhike, who had been charged with stealing US$8,000 from RAM Petroleum. Mutangadura allegedly allowed Mhike to be released via summons rather than remand, a decision that drew criticism after the suspect fled to South Africa. RAM Petroleum subsequently lodged a complaint with the NPA, and Hodzi attempted to proceed against Mutangadura.\n\nThe controversies, however, have not derailed his prosecutorial career. His promotion to Deputy Prosecutor General cements his place in the top ranks of the NPA at a time when the authority is under pressure to assert independence and restore public trust.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Seasoned and controversial state lawyer, Chris Mutangadura has been promoted to the role of Deputy Prosecutor … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/mutangadura-gets-top-npa-job/\">Continue reading<span class=\"screen-reader-text\"> \"Mutangadura Gets Top NPA Job\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "No Licence, No Obedience: Kombi Driver Sentenced for Chaos at Intersection",
            "url": "https://www.zimeye.net/2025/09/17/no-licence-no-obedience-kombi-driver-sentenced-for-chaos-at-intersection/",
            "content": "By A Correspondent\n\nA commuter omnibus driver who brazenly disregarded traffic rules has been jailed for more than two years after failing to stop at a red light at the busy Simon Mazorodze Road and Remembrance Drive intersection in Mbare last month.\n\nThe driver, identified as Mandava, was convicted by a Mbare Magistrate on Monday. In addition to the main sentence, he received another six months in prison for driving without a valid licence.\n\nMandava was also slapped with fines amounting toUS$300 US$100 for ignoring police orders and US$200 for attempting to deceive authorities by giving a fake name during his arrest.\n\nPolice investigations later uncovered his true identity, which added to his list of penalties.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A commuter omnibus driver who brazenly disregarded traffic rules has been jailed for more than two years … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/no-licence-no-obedience-kombi-driver-sentenced-for-chaos-at-intersection/\">Continue reading<span class=\"screen-reader-text\"> \"No Licence, No Obedience: Kombi Driver Sentenced for Chaos at Intersection\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "As Zimbabweans Starve, President Enjoys Extravagant Birthday Pageantry…",
            "url": "https://www.zimeye.net/2025/09/17/as-zimbabweans-starve-president-enjoys-extravagant-birthday-pageantry/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa turned 83 on Monday, staging a grand celebration in Zvishavane where he and the First Lady, Dr Auxillia Mnangagwa, were seen feeding each other cake in a choreographed display of joy. The event has been branded Munhumutapa Day, a new addition to the regimes propaganda calendar.\n\nWhile the President basked in personal festivities, millions of Zimbabweans continue to suffer under the weight of poverty, unemployment, and failing public services. Critics argue that such extravagant celebrations expose the widening gulf between the ruling elite and ordinary citizens struggling to make ends meet.\n\nObservers say the attempt to rebrand Mnangagwas birthday as a national day is nothing more than a self-serving bid to cement his legacy, while ignoring mounting crises in health, education, and governance.\n\nAs the leadership indulges in cake-cutting ceremonies, the real celebration for most Zimbabweans remains a daily fight for survival in an economy that shows little sign of recovery.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa turned 83 on Monday, staging a grand celebration in Zvishavane where he and the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/17/as-zimbabweans-starve-president-enjoys-extravagant-birthday-pageantry/\">Continue reading<span class=\"screen-reader-text\"> \"As Zimbabweans Starve, President Enjoys Extravagant Birthday Pageantry…\"</span></a></p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        }
    ]
}