{
    "news": [
        {
            "title": "WATCH LIVE: Lungu Family Lawsuit Against Zambia Govt",
            "url": "https://www.zimeye.net/2025/09/08/watch-live-lungu-family-lawsuit-against-zambia-govt/",
            "content": "video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "Tragedy on Chiremba Road as Bus and Kombi Collide, Leaving Two Dead",
            "url": "https://www.zimeye.net/2025/09/08/tragedy-on-chiremba-road-as-bus-and-kombi-collide-leaving-two-dead/",
            "content": "Epworth, Zimbabwe  Saturday Afternoon\n\nBy A Correspondent | ZimEye | Two people lost their lives and several others were seriously injured following a horrific head-on collision between a bus and a commuter omnibus (kombi) along Chiremba Road in Epworth this Saturday afternoon.\n\nEyewitnesses reported that the impact was so severe that the front of the kombi was completely crushed, trapping passengers inside. Emergency services, including police and ambulances, quickly arrived at the scene to rescue survivors and ferry the injured to nearby hospitals.\n\nThe bus, belonging to City Connection, was visibly damaged at the front, while the kombi suffered the worst impact, its frame twisted beyond recognition. Police officers cordoned off the area as shocked onlookers gathered.\n\nPreliminary reports suggest that reckless driving and excessive speed may have contributed to the tragedy, though police have yet to release an official statement on the cause of the crash.\n\nThe collision caused a major traffic jam on Chiremba Road as authorities worked to clear the wreckage.\n\nResidents of Epworth expressed sorrow over the recurring road accidents in the area, calling on authorities to tighten road safety measures.\n\nThe names of the deceased have not yet been released pending notification of their families.\n\nThis accident is the latest in a series of deadly road crashes that continue to claim lives on Zimbabwes highways and urban roads.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Epworth, Zimbabwe – Saturday Afternoon By A Correspondent | ZimEye | Two people lost their lives and several others were … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/tragedy-on-chiremba-road-as-bus-and-kombi-collide-leaving-two-dead/\">Continue reading<span class=\"screen-reader-text\"> \"Tragedy on Chiremba Road as Bus and Kombi Collide, Leaving Two Dead\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "Will ED’s Sons Forgive Holy Ten?",
            "url": "https://www.zimeye.net/2025/09/08/will-eds-sons-forgive-holy-ten/",
            "content": "What guarantee does@holytenmusichave that Mnangagwas sons have forgiven him?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "Why Zimbabwe Will Not Ban the Misuse of the Title “Doctor”",
            "url": "https://www.zimeye.net/2025/09/08/why-zimbabwe-will-not-ban-the-misuse-of-the-title-doctor/",
            "content": "By Engineer Jacob Kudzayi Mutisi\n\nWhile countries such as Ghana and Ethiopia are taking bold steps to regulate the misuse of honorary and fake doctorates, Zimbabwe is unlikely to follow suit. The reason is simple: the system is deeply compromised. Many senior officials, politicians, and influential business leaders parade questionable qualifications that would not withstand scrutiny under stricter rules.\n\nOver the years, the title Doctor has been diluted by a flood of dubious degrees from unaccredited institutions and cheaply acquired honorary awards. These titles are flaunted in public life to command respect, gain influence, or enhance political campaigns. In reality, they often lack academic merit.\n\nA ban similar to those introduced in Ghana and Ethiopia would expose the rot at the heart of Zimbabwes leadership. Too many decision-makers themselves rely on these titles, meaning any crackdown would directly implicate them. This has created a culture of impunity, where genuine doctorsmedical professionals and academicsare overshadowed by counterfeit credentials.\n\nUntil Zimbabwe confronts the uncomfortable truth about fake qualifications within its own corridors of power, reform is unlikely. The continued abuse of the Doctor title reflects not just vanity but a deeper problem of accountability and credibility in public life.\n\nYou definitely know an individual with a fake Doctorate.\n\nEngineer Jacob Kudzayi Mutisi\n\n+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi While countries such as Ghana and Ethiopia are taking bold steps to regulate the misuse … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/why-zimbabwe-will-not-ban-the-misuse-of-the-title-doctor/\">Continue reading<span class=\"screen-reader-text\"> \"Why Zimbabwe Will Not Ban the Misuse of the Title “Doctor”\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "Zanu PF Haunts Hwange Villagers",
            "url": "https://www.zimeye.net/2025/09/08/zanu-pf-haunts-hwange-villagers/",
            "content": "By A Correspondent  Zanu PF has rolled out a cell verification programme in Hwange District, a move the ruling party says is crucial for consolidating its membership base and strengthening grassroots structures.\n\nAt an inter-district meeting held at Hwange Colliery Club, Politburo members Advocate Jacob Mudenda and Deputy Secretary for Youth Affairs Tino Machakaire stressed the importance of the exercise, particularly in mobilising young people.\n\nThe young people have always been very important to the party and government. We thank them for their support and that is why we always put up empowerment programmes that also benefit them immensely, Mudenda said.\n\nMachakaire added: This is an important exercise which should be done in the district of Hwange. While they are lagging behind, we encourage them to move and regularise their cell membership. It is an exercise which must include all key stakeholders.\n\nHowever, behind the official rhetoric, villagers fear the exercise is yet another tool for coercion. Whenever Zanu PF conducts such campaigns, communities say they are forced or intimidated into joining, often under the watch of local traditional leaders and youth militias aligned to the party.\n\nSince independence in 1980, Zanu PF has repeatedly weaponised rural structures to entrench its power. Traditional leaderschiefs, headmen and village headshave been co-opted into the party machinery, with government incentives such as vehicles, allowances and land used to secure their loyalty. In return, they have been accused of ordering villagers to attend Zanu PF rallies, blocking opposition campaigns, and threatening those who refuse to toe the ruling party line.\n\nThis pattern intensified during key elections, notably in 2000, 2002, 2008 and 2013, when ruling party-aligned militias, particularly the notorious Green Bombers from the National Youth Service, unleashed violence and intimidation in rural areas. Thousands of villagers were beaten, displaced, or forced to publicly declare loyalty to Zanu PF. In some cases, food aid was distributed along party lines, with opposition supporters excluded.\n\nHwange, a district that has traditionally shown pockets of resistance to Zanu PF, now finds itself under renewed pressure. The ruling partys cell verification drive may appear administrative, but villagers fear it signals the return of a long-standing strategy: using fear, poverty, and traditional authority to bind rural communities to Zanu PF.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zanu PF has rolled out a cell verification programme in Hwange District, a move the ruling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/zanu-pf-haunts-hwange-villagers/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Haunts Hwange Villagers\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "New Mutare Train In An Embarrassing Start",
            "url": "https://www.zimeye.net/2025/09/08/new-mutare-train-in-an-embarrassing-start/",
            "content": "By A Correspondent The National Railways of Zimbabwe (NRZ)s new Mutare train at the weekend took two hours and fifteen minutes to cover the 75 km stretch from Harare to Marondera  a journey that usually takes less than an hour by car.\n\nPassengers could have jogged, cycled, or taken a donkey cart and still arrived earlier.\n\nAt the helm of this slow-motion revival is none other than Misheck Sibanda, the long-serving Chief Secretary to the President and Cabinet under the late Robert Mugabe. Having been swept aside after the 2017 coup, Sibanda has now re-emerged as chairperson of the NRZ board  a comeback as surprising as the trains record-breaking crawl.\n\nThe appointment, effective September 1, was announced by Mutapa Investment Fund CEO John Mangudya and confirmed at a Bulawayo media briefing. Sibanda replaces Advocate Mike Madiro, marking yet another reshuffle in the long-running saga of NRZs decline.\n\nSibanda was one of Mugabes most loyal bureaucrats until Operation Restore Legacy, led by then-General Constantino Chiwenga, pushed Mugabe out and reshaped the state machinery. He was succeeded by Martin Rushwaya and quietly retreated from the limelight, reportedly working on memoirs while the country sank deeper into economic crisis. His sudden return to national duty underscores Mnangagwas habit of recycling Mugabe-era loyalists, presenting them as fresh leadership while the system stays the same.\n\nSibanda told reporters he was honoured to lead efforts to resuscitate NRZ, insisting the railway could once again drive national growth. Our President has long recognised that NRZ is not delivering what it should to the economy. He has directed that its resuscitation be accelerated, he declared  words as familiar as the broken promises of past decades.\n\nNRZs collapse is part of the wider rot in Zimbabwes parastatals. Once vital to development, state enterprises have been bled dry by looting, opaque deals and political patronage. At its peak, NRZ hauled 18 million tonnes of cargo and employed more than 20,000 people. By 2017, volumes had dropped to just 3.4 million tonnes, with industries forced onto costly road transport that destroyed the countrys highways.\n\nSuccessive revival deals  with Indians, Russians, and Chinese  have all collapsed under the weight of corruption and mismanagement. Now, during his state visit to Beijing, Mnangagwa has dusted off another US$600 million proposal with China Railway International Group.\n\nSibanda promised focus, teamwork and accountability, declaring NRZ could reclaim its place as a continental leader. Yet for critics, the spectacle of a train that takes two hours to crawl from Harare to Marondera symbolises the farce of Zimbabwes parastatal reforms.\n\nThe return of Mugabes lieutenants, now dressed up as reformers, points less to renewal and more to recycling. As long as parastatals like NRZ remain under the grip of political appointees and party interests, sceptics argue, the railways revival may remain as sluggish as its new train.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —The National Railways of Zimbabwe (NRZ)’s new Mutare train at the weekend took two hours and fifteen … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/new-mutare-train-in-an-embarrassing-start/\">Continue reading<span class=\"screen-reader-text\"> \"New Mutare Train In An Embarrassing Start\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "Minister Garwe in Hot Soup After Threatening to Gouge People’s Eyes",
            "url": "https://www.zimeye.net/2025/09/08/minister-garwe-in-hot-soup-after-threatening-to-gouge-peoples-eyes/",
            "content": "Video footage emerged earlier in the year showing Local Government minister Daniel Garwe standing before a packed hall, clad in full ZANU PF regalia, threatening residents of Cloverdale Farm with brutal violence. In the footage, Garwe can be seen rising to his feet and angrily declaring that he would gouge out their eyes if they defied his orders  a chilling outburst that has sparked outrage and raised fresh questions over intimidation within the ruling partys ranks.\n\nHarare  Local Government minister and ZANU PF Mashonaland East provincial chairperson Daniel Garwe is facing mounting political turbulence after fresh warnings from within the ruling party over his violent threats and intimidation tactics.\n\nEarlier this year, Garwe sparked outrage after footage emerged of him threatening to gouge out the eyes of ZANU PF members during a heated meeting. In another recent confrontation, while addressing families he had previously led to settle at Cloverdale Farm before evicting them, he declared: Ndonokutushurai kazoos ese! (I will gouge out all your eyes).\n\nNow, the powerful Youth Minister, Tino Machakaire, has seemingly turned his guns on Garwe. Speaking at a ZANU PF Womens League meeting in Wedza on Friday, Machakaire issued a blunt warning against individuals using threats and intimidation to personalise the party.\n\nThe president says no one should be left behind, but there is someone who wants to leave everyone behind and go it alone, Machakaire said.\n\nWho are you? Did your vote count to five? You have one vote and so do I. If you want to provoke us, we will beat you right in front of the people.\n\nThough Machakaire avoided naming Garwe directly, party supporters from Mashonaland East were quick to identify him as the target of the remarks.\n\nInsiders say Garwe has been aggressively pushing a controversial agenda to extend President Emmerson Mnangagwas term from 2028 to 2030, threatening party members who oppose the move.\n\nGarwes own political record is chequered. In 2013, he broke ranks with ZANU PF and stood as an independent candidate, only to lose. His comeback into the party has since been marked by accusations of arrogance, coercion, and violent threats against colleagues and supporters alike.\n\nWith Machakaires open defiance, Garwe now finds himself isolated and under pressure, as internal ZANU PF battles intensify ahead of the 2028 succession question.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Video footage emerged earlier in the year showing Local Government minister Daniel Garwe standing before a packed hall, clad in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/minister-garwe-in-hot-soup-after-threatening-to-gouge-peoples-eyes/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Garwe in Hot Soup After Threatening to Gouge People’s Eyes\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "Godfrey Chihuri Arrested",
            "url": "https://www.zimeye.net/2025/09/08/godfrey-chihuri-arrested/",
            "content": "Car Theft Suspect Nabbed at Yadah Hotel, Used to Lure Accomplices in Harare CBD\n\nHARARE  Police last week arrested one of four men accused of stealing a vehicle in South Africa after finding him relaxing inside the stolen car at the Yadah Hotel complex in Waterfalls, Harare.\n\nThe suspect, Geoffrey Chihuri, was apprehended by detectives from the Vehicle Theft Squad after a tip-off led them to the unregistered white Nissan Magnite parked at the hotel.\n\nAccording to investigators, Chihuri was then used to lure his alleged accomplices  Vincent Luwizhi, Obvious Nkomo, and Blessed Kambeni  into the Harare CBD, where they were also arrested.\n\nThe four appeared before Harare regional magistrate Marewanazvo Gofa over the weekend. They were not asked to plead and were remanded as investigations continue.\n\nChecks with Interpol National Criminal Bureau Harare confirmed the Nissan Magnite had been stolen in South Africa. The suspects reportedly told police they received the car from unknown South Africans they had met between Rutenga and Beitbridge.\n\nMeanwhile, in a separate case, police have arrested four suspected armed robbers accused of a spate of vehicle thefts.\n\nWellington Jinya (20), Nyasha Mushure (24), Tatenda Maphosa (21), and Edmore Muchenje (24) appeared in court Saturday facing eight counts of stealing cars.\n\nZRP CID spokesperson Detective Inspector Rachel Muteweri said the gang masqueraded as travellers seeking lifts before robbing unsuspecting motorists of vehicles and valuables.\n\nTheir arrest followed a September 4 operation in Chinhoyi, where police recovered an AK-47, a Retay pistol with three rounds, knives, cellphones, and laptops linked to the crimes.\n\nDet-Insp Muteweri confirmed that several accomplices  Tinotenda Devillious Chiremba, Lloyd Makiwa, Eddie alias Dhama, Jacob Maphosa, Huni, and Watson alias Mandebvu  remain on the run.\n\nAll stolen motor vehicles have since been recovered.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Car Theft Suspect Nabbed at Yadah Hotel, Used to Lure Accomplices in Harare CBD HARARE – Police last week arrested … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/godfrey-chihuri-arrested/\">Continue reading<span class=\"screen-reader-text\"> \"Godfrey Chihuri Arrested\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "🔴 Don’t Mess With Me…I’m Not Blessed Geza… I’m Taking The First Flight… Holy Ten Explodes at President’s Sons, Alleges Soldiers Sent to Evict Him",
            "url": "https://www.zimeye.net/2025/09/08/%f0%9f%94%b4-dont-mess-with-meim-not-blessed-geza-im-taking-the-first-flight-holy-ten-explodes-at-presidents-sons-alleges-soldiers-sent/",
            "content": "By A Correspondent | ZimEye | Harare  In a stunning and explosive broadcast that has rocked social media, Zimbabwean rapper Holy Ten has publicly accused President Emmerson Mnangagwas twin sons, Sean and Collins, of intimidation  alleging they dispatched soldiers to his home to repossess a house and gifts once given to him.\n\nThe musician, born Mukudzei Chitsama, who last year was a vocal supporter of Zanu PF, has now made a dramatic U-turn, creating an online firestorm that has left the nation talking.\n\nFrom Ally to Accuser\n\nIn an emotional Instagram Live on Sunday, Holy Ten claimed that Sean Mnangagwa, a Major in the Zimbabwe National Army, sent armed personnel to his residence with instructions for his wife, Kimberly Richards, to vacate.\n\nLeaked screenshots from his WhatsApp messages appeared to confirm the move, with the rapper telling his wife:\n\nPack all our things. Were giving them back their house.\n\nOn his Instagram stories, he directly tagged Sean and Collins, writing:\n\nShouldve never given me your gifts if you knew you could take them back.\n\nMake Sure You Kill Me\n\nIn a furious tirade, Holy Ten openly confronted the First Familys sons:\n\nSean, what you did at my house, Im coming to your house. Make sure you kill me. Im not afraid of Zanu PF, all of you. I can end Zanu PF today. Im bigger than Zanu PF.\n\nHe went further, accusing them of tarnishing his reputation after he had worked hard to clean up Zanu PFs image.\n\nCollins thinks he is loved by the people, let him start a live right now and lets see how many people join. I know where Collins lives. They shouldnt mess with me.\n\nApology and Backtrack\n\nLess than an hour later, the artist appeared to backtrack, posting a message apologising:\n\nApologies to my brothers Sean & Collins.\n\nHe also posted a cryptic story reading:\n\nIts not fear. Its respect. @zanupf1 Dont try me.\n\nFallout and Speculation\n\nThe Mnangagwa family has not yet issued a response. Online, reactions have ranged from concern for Holy Tens safety to suggestions this may have been a publicity stunt ahead of new music releases.\n\nAnalysts note the significance of the fallout, given Holy Tens previous loyalty to Zanu PF and his prominent role in defending the party through music and public commentary.\n\nFor now, the 26-year-old rapper has drawn a dangerous line in the sand  directly challenging the Presidents sons in a way rarely seen in Zimbabwes fraught political and entertainment landscape.\n\nSocial media remains ablaze, with many warning the artist could face serious reprisals for his explosive outburst.\n\n Community Comments\n\n Concern for Safety They will beat him very hard, agochema sechana chenguruve  Some warn that Holy Ten may face brutal consequences from state security forces. Nah they wont, because they fear the truth  Others believe his boldness has exposed a hidden power struggle. Munozoanyanya kukwata ZANU PF too much, ndosaka isingabve  Suggesting that Holy Ten may have overplayed his hand by aligning too closely with ZANU PF in the first place.\n\n Public Sympathy This boy is brave, but I fear for his life  Fans admire his courage in calling out alleged intimidation. He was once Zanu PFs cheerleader, now hes learning the hard way  Some are critical, saying his turnaround shows opportunism.\n\n Speculation of Publicity Stunt Maybe this is just album marketing, he knows drama sells  A number of people believe Holy Ten could be using controversy to promote new music. This meltdown looks staged; he apologised too fast  Observers note the quick apology raises questions about authenticity.\n\n Wider Political Debate It shows even those inside ZANU PF are not safe from their own  Suggesting the fallout highlights internal mistrust. This is proof of how politics and music shouldnt mix, because artists end up as pawns  Criticism of Holy Tens earlier closeness to the ruling party.\n\n Analysis\n\nThis incident represents a collision between celebrity culture, political patronage, and authoritarian power in Zimbabwe.1. Shift from Ally to Dissenter Holy Tens meltdown underscores the risks of aligning too closely with ruling elites. Once celebrated as a Zanu PF cultural ambassador, he is now painting himself as a victim of the very system he supported.2. Fragile Nature of Political Patronage His alleged eviction from a state-gifted house highlights how political favors can be quickly withdrawn, leaving beneficiaries vulnerable. This feeds into a broader public narrative of corruption, power abuse, and conditional loyalty.3. The Power of Social Media In a country where traditional media is heavily censored, Holy Tens Instagram Live exposed a raw, unfiltered challenge to the Mnangagwa family. His wordsI can end ZANU PF todayreflect how influential figures now wield digital platforms as political weapons.4. Backlash and Backtracking The rapid apology suggests immense pressure behind the scenes, either from state actors or party loyalists. His phrase Its not fear, its respect appears as damage control, but also hints at ongoing coercion.5. Implications for Artists and Politics This saga will likely intensify debate on whether artists should involve themselves in partisan politics. Holy Tens ordeal may serve as a cautionary tale for creatives who tie their careers to ruling party patronage.6. Potential Outcomes Holy Ten could face silencing through state intimidation. Alternatively, this incident might mark the start of a political awakening among young artists, exposing fractures within the ruling establishment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Harare – In a stunning and explosive broadcast that has rocked social media, Zimbabwean … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/%f0%9f%94%b4-dont-mess-with-meim-not-blessed-geza-im-taking-the-first-flight-holy-ten-explodes-at-presidents-sons-alleges-soldiers-sent/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 Don’t Mess With Me…I’m Not Blessed Geza… I’m Taking The First Flight… Holy Ten Explodes at President’s Sons, Alleges Soldiers Sent to Evict Him\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        },
        {
            "title": "Rising Unemployment in Zimbabwe Prompts Opposition Alarm",
            "url": "https://www.zimeye.net/2025/09/08/rising-unemployment-in-zimbabwe-prompts-opposition-alarm/",
            "content": "By A Correspondent  The Freedom Fighters for Change (FFC) party has raised alarm over the rising levels of unemployment in Zimbabwe, saying the crisis is robbing the nations youth of their future.\n\nIn a statement issued on Saturday, the opposition movement called for urgent action, warning that the current situation is unsustainable.\n\nEnough is enough! Unemployment is stealing our future. Join the movement, join the fight. Freedom Fighters for Change party launch  lets create jobs, lets create change! #WeMove #JobsJustice #FFC, the party said.\n\nThe statement went on to describe joblessness as one of the biggest national crises.\n\nUnemployment is a crisis, not a choice. Lets rise up and demand change! Join the Freedom Fighters for Change party launch and lets fight for job justice together! #WeMove #JobsJustice #FFC, FFC added.\n\nThe party urged citizens to rally behind its agenda, promising that employment creation would be placed at the centre of its political programme.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Freedom Fighters for Change (FFC) party has raised alarm over the rising levels of unemployment … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/08/rising-unemployment-in-zimbabwe-prompts-opposition-alarm/\">Continue reading<span class=\"screen-reader-text\"> \"Rising Unemployment in Zimbabwe Prompts Opposition Alarm\"</span></a></p>",
            "time": "08:31",
            "date": "09 Sep 2025"
        }
    ]
}