{
    "news": [
        {
            "title": "Zim Independent Editor Arrested Over Muckraker Article Mocking Mnangagwa",
            "url": "https://www.zimeye.net/2025/07/01/zim-independent-editor-arrested-over-muckraker-article-mocking-mnangagwa/",
            "content": "Senior Journalist and Editor of Zimbabwe Independent  Faith Zaba has been arrested by the ZRP today (July 1, 2025) on allegations of undermining the authority of or insulting the President. The charge relates to a satirical Muckraker article published last week Friday. After police recorded a warned and cautioned statement from Zaba, they insisted on detaining her overnight, pending a court appearance provisionally tomorrow (July 2, 2025).\n\nWe are deeply disappointed with the determination of the authorities to lock Zaba up, even in the face of medical confirmation of her current severe illness, said her lawyer  Chris Mhike\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Senior Journalist and Editor of Zimbabwe Independent – Faith Zaba has been arrested by the ZRP today (July 1, 2025) … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/zim-independent-editor-arrested-over-muckraker-article-mocking-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Independent Editor Arrested Over Muckraker Article Mocking Mnangagwa\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "FIFA Club World Cup: Al-Hilal Shock Manchester City",
            "url": "https://www.zimeye.net/2025/07/01/fifa-club-world-cup-al-hilal-shock-manchester-city/",
            "content": "Sports Correspondent\n\nIn a dramatic and unforgettable clash in Orlando, Saudi Arabias Al-Hilal pulled off a stunning 4-3 extra-time victory over English giants Manchester City on Monday night, booking their place in the Club World Cup quarter-finals against Brazilian side Fluminense.\n\nMarcos Leonardo sealed the upset with his second goal in the 112th minute, capping a thrilling encounter where Al-Hilal repeatedly outpaced and outsmarted the reigning Premier League champions.\n\nCity initially took control with an early opener in the ninth minute when Bernardo Silva bundled home from close range after a deflected clearance fell kindly for him. Despite Al-Hilals appeals for handball in the buildup involving Rayan Ait-Nouri, the goal stood.\n\nThe momentum shifted swiftly after the break. Al-Hilal drew level seconds into the second half as Malcoms quick run and low cross found Joao Cancelo, whose blocked shot rebounded kindly for Leonardo to head into an open net.\n\nJust six minutes later, Malcom turned scorer, breaking free of the City backline and finishing coolly past Ederson after a pinpoint pass from Cancelo.\n\nManchester City responded through Erling Haaland, who headed in from a Silva corner in the 55th minute, levelling the match once again. The game pushed into extra-time after both sides failed to find a winner in regulation.\n\nAl-Hilal struck first in the added period, with Kalidou Koulibaly rising high to glance in a Ruben Neves corner in the 94th minute. But City clawed their way back once again, as Phil Foden met a clever cross from Rayan Cherki with a superb volley to make it 3-3.\n\nThe decisive moment came with just seven minutes remaining. After Ederson parried a header from Sergej Milinkovic-Savic, Leonardo reacted quickly and steered home the rebound despite losing his footing  securing a famous victory for the Riyadh-based club.\n\nWe knew it was a difficult game against one of the best teams in the world, said Koulibaly after the match. We wanted to show our ideas, our talent, our power and I think that we made a very good game. Defensively we were very strong and offensively all of the opportunities we could put inside we put in, so we can be happy.\n\nAl-Hilal goalkeeper Yassine Bounou also played a key role, making several critical saves before the Saudi side seized control of the second half and extra-time.\n\nThe result sends shockwaves through the tournament and underlines Al-Hilals growing presence on the global football stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a dramatic and unforgettable clash in Orlando, Saudi Arabia’s Al-Hilal pulled off a stunning 4-3 extra-time victory … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/fifa-club-world-cup-al-hilal-shock-manchester-city/\">Continue reading<span class=\"screen-reader-text\"> \"FIFA Club World Cup: Al-Hilal Shock Manchester City\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "Temba Mliswa Fired from CP Chemicals Board — He Hits Back",
            "url": "https://www.zimeye.net/2025/07/01/temba-mliswa-fired-from-cp-chemicals-board-he-hits-back/",
            "content": "Harare  1 July 2025\n\nBy Farai D Hove | ZimEye | Outspoken businessman and former legislator Temba Mliswa has been fired from his position as Director and Chairperson of the Board of CP Chemicals (Private) Limited, following a damning board resolution citing serious misconduct.\n\nA formal termination letter dated 27 June 2025 and signed by the companys Corporate Secretary, Ezra Dzoro, confirms that Mliswas removal is with immediate effect. The letter lists breaches of fiduciary duty, conflict of interest, and unilateral decision-making beyond the scope of board resolutions as reasons for his dismissal. His conduct, according to the board, has adversely affected the companys public image and reputation.\n\nThe termination was executed in line with:\n\nIn light of the above, the Board has determined that your continued participation in the governance of the company is not in the best interests of CP Chemicals (Private) Limited, the letter reads.\n\nCP Chemicals is one of Zimbabwes leading suppliers of crop chemicals and veterinary products, headquartered in Graniteside, Harare. The company stamp affixed to the letter confirms the authenticity of the decision and its immediate enforcement.\n\nMliswa Responds\n\nResponding to the announcement, Mliswa dismissed the move as politically and personally motivated. In a strongly worded statement, he said:\n\nThis is absolute hogwash and far from the truth. I shall elaborate in due course; however, let me take a moment to assert that I remain firmly in position, despite the chaotic antics of those with questionable motives.\n\nWhile a select few elite figures bend over backwards to appease the whims of the corrupt, let us not forget that many families are bearing the brunt of this absurdity and require leaders with a spine.\n\nMliswa, known for his forthright style and confrontations with both political and business elites, is expected to issue a more detailed response in the coming days. The unfolding saga adds a new chapter to the controversies surrounding corporate governance and accountability in Zimbabwes private sector.\n\nFurther developments are awaited.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 1 July 2025 By Farai D Hove | ZimEye | Outspoken businessman and former legislator Temba Mliswa has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/temba-mliswa-fired-from-cp-chemicals-board-he-hits-back/\">Continue reading<span class=\"screen-reader-text\"> \"Temba Mliswa Fired from CP Chemicals Board — He Hits Back\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "Supersport United Sold and Set for Major Rebrand to Celtic United",
            "url": "https://www.zimeye.net/2025/07/01/supersport-united-sold-and-set-for-major-rebrand-to-celtic-united/",
            "content": "Sports Correspondent\n\nIn a significant development in South African football, Premier Soccer League (PSL) outfit Supersport United has been sold to a Bloemfontein-based businessman for a reported R50 million.\n\nThe club is now poised for a rebranding that will see it renamed Celtic United, signaling a new chapter in its history.\n\nThe new owner, whose identity has not yet been formally disclosed, is believed to have strong ties to the Free State football community.\n\nThe rebranding to Celtic United is widely viewed as an attempt to revive the legacy of Bloemfontein Celtic, a beloved club that was previously sold and relocated, much to the dismay of local fans.\n\nSources close to the transaction say the deal includes the clubs PSL status, player contracts, and academy structures. While official confirmation of operational changes is still pending, the rebrand is expected to also shift the teams home base from Pretoria to Bloemfontein  returning top-flight football to the city.\n\nFans of both Supersport United and the former Bloemfontein Celtic are watching developments closely, with mixed emotions. While some Supersport loyalists lament the end of an era, Celtic supporters are hopeful that this move could restore their citys presence in elite football.\n\nFurther announcements from the clubs new leadership are expected in the coming days, including details on management, technical staff, and player retention plans.\n\nIf confirmed, the transformation of Supersport United into Celtic United marks one of the most notable club ownership changes in recent PSL history  with far-reaching implications for the league and its fanbase.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a significant development in South African football, Premier Soccer League (PSL) outfit Supersport United has been sold … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/supersport-united-sold-and-set-for-major-rebrand-to-celtic-united/\">Continue reading<span class=\"screen-reader-text\"> \"Supersport United Sold and Set for Major Rebrand to Celtic United\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "Farming: A Guide to Dystocia Management",
            "url": "https://www.zimeye.net/2025/07/01/farming-a-guide-to-dystocia-management/",
            "content": "By Dr. Trywell Muzerengi\n\nDefinition:Dystocia refers to difficult or abnormal labor, where an animal is unable to give birth naturally without human assistance. This condition is commonly observed in domestic animals such as cows, goats, and sheep.\n\nCommon Causes of Dystocia:\n\nSigns of Dystocia:\n\nProlonged straining without progress\n\nVisible fetal parts with no advancement\n\nRepeated restlessness, lying down, and getting up\n\nNo delivery after 23 hours of active labor\n\nFirst Aid / On-Farm Management:\n\nPrevention Tips:\n\nProvide balanced and adequate nutrition during pregnancy\n\nUse appropriate breeding stock to reduce the risk of oversized fetuses\n\nClosely monitor animals as they approach parturition\n\nBe ready to assist at the first sign of complications\n\nProper understanding and timely management of dystocia can save both the mother and offspring. Always seek veterinary support when in doubt to ensure the best outcome.\n\nlasmuzagrosolutions@gmail.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr. Trywell Muzerengi Definition:Dystocia refers to difficult or abnormal labor, where an animal is unable to give birth naturally … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/farming-a-guide-to-dystocia-management/\">Continue reading<span class=\"screen-reader-text\"> \"Farming: A Guide to Dystocia Management\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "Mai Jeremaya Praised Me for Being Better Than Own Husband in Bed – Martin Charlie",
            "url": "https://www.zimeye.net/2025/07/01/mai-jeremaya-praised-me-for-being-better-than-own-husband-in-bed-martin-charlie/",
            "content": "By A Correspondent\n\nMartin Charlie, one of two men accused of gang raping social media personality Ashley Masendeke, popularly known as Mai Jeremaya, told a Harare court that the encounter was consensual and transactionalclaiming she even complimented his sexual performance, saying he was better than her husband.\n\nTestifying on Monday, Charlie alleged that Mai Jeremaya willingly offered sexual services after a meeting in Harares CBD on April 30.\n\nHe claimed that after meeting with his co-accused, Thabo Blessing Dube, they all went to Joina City, where Dube informed him that Mai Jeremaya was offering paid sex. Charlie said he confirmed this directly with her.\n\nShe said she charged twenty US dollars per hour, said Charlie. I asked her where we would go and she suggested a lodge. We went to Paradise Lodge in Eastlea.\n\nCharlie described what he called a consensual sexual encounter, adding that once they entered the room, Mai Jeremaya requested payment upfront.\n\nI gave her the money, and she put it away, he told the court. She took off her clothes, approached me, and started undressing me. She sucked my nipples, kissed me, and put the condom on me using her mouth.\n\nCharlie continued, saying the act was mutual and initiated by both parties.\n\nShe got on top of me and asked if I was enjoying it. I told her it was going well, he testified. Afterward, she removed the condom and thanked me. She said I had done it better than her husband.\n\nHe also claimed that following the encounter, Mai Jeremaya began demanding more money.\n\nShe asked for five hundred dollars, then dropped to three hundred. I told her I didnt have that kind of money, Charlie said. She agreed, and we both took a bath before I took her back to town and booked her an InDrive.\n\nWhen questioned about allegations of intimidation or coercion, Charlie denied any wrongdoing.\n\nWe were playing music and laughing on the way. No one was scared, he said. The place was full of people. If she was being raped, she could have screamed and someone would have heard her.\n\nCharlie told the court that he believes the rape accusation may have stemmed from Mai Jeremayas attempt to protect her marriage after her husband found out about the alleged transactional sex.\n\nThree days later, on May 3, she called asking where I was. She came with a man named Tafadzwa Chidawa, who was angry that I had slept with her for only twenty dollars instead of the five hundred she claimed she was worth, said Charlie.\n\nDuring cross-examination, prosecutor Cecilia Mashingaidze challenged Charlies testimony, arguing that nothing in his account supported his claim that the encounter warranted additional payment or extras.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Martin Charlie, one of two men accused of gang raping social media personality Ashley Masendeke, popularly known … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/mai-jeremaya-praised-me-for-being-better-than-own-husband-in-bed-martin-charlie/\">Continue reading<span class=\"screen-reader-text\"> \"Mai Jeremaya Praised Me for Being Better Than Own Husband in Bed – Martin Charlie\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "Opposition MP Donates Chicks to Survivors of 2008 ZANU PF Political Violence",
            "url": "https://www.zimeye.net/2025/07/01/opposition-mp-donates-chicks-to-survivors-of-2008-zanu-pf-political-violence/",
            "content": "By A Correspondent -Masvingo Province  Honourable Tendeukai Matara, the Proportional Representation MP for Masvingo Province, on Tuesday donated 150 chicks, 12 bags of starter pellets, antibiotics, and poultry feeding equipment to survivors of the 2008 ZANU PF political violence at Jerera Growth Point in Zaka.\n\nThe beneficiaries of the donation  Isaac Mbanje, Tsumele, and Edison Gwenhure  survived a brutal petrol bombing attack during the 2008 political unrest, which claimed the lives of Washington Nyangwa and Crison Mbano.\n\nSpeaking during the handover, Hon. Matara emphasized her commitment to supporting victims of political violence and disadvantaged members of society.\n\nWe cannot erase the pain of the past, but we can walk with the victims toward a better future, said Hon. Matara. These men endured unimaginable trauma simply for holding different political beliefs. This donation is a small but meaningful step toward restoring their dignity and helping them regain economic independence.\n\nShe added that her gesture was part of a broader vision to empower marginalized communities. I will continue to stand with the vulnerable and ensure they are not forgotten. Our people deserve opportunities to rebuild their lives in peace.\n\nThe donation was welcomed by community members, who praised the MP for her hands-on approach and continued solidarity with victims of past political violence.\n\nOpposition MP Tendeukai Matara Donates Chicks to Victims of 2008 ZANU PF Political Violencepic.twitter.com/adcwBWm7UE\n\nPeter Imbayarwo, a veteran opposition activist speaks on the donation of chicks by Hon Tendeukai Matara to survivors of the Zanu PF Jerera bombingpic.twitter.com/3ntqcujDAa\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent -Masvingo Province – Honourable Tendeukai Matara, the Proportional Representation MP for Masvingo Province, on Tuesday donated 150 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/opposition-mp-donates-chicks-to-survivors-of-2008-zanu-pf-political-violence/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition MP Donates Chicks to Survivors of 2008 ZANU PF Political Violence\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "Blessed Geza Returns Tonight",
            "url": "https://www.zimeye.net/2025/07/01/blessed-geza-returns-tonight-2/",
            "content": "Anti Corruption activist Blessed Geza announces a session tonight.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Anti Corruption activist Blessed Geza announces a session tonight.",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "Disturbing Video: Young Zimbabwean Lady Claims Zimbabwe Belongs to Zanu PF",
            "url": "https://www.zimeye.net/2025/07/01/disturbing-video-young-zimbabwean-lady-claims-zimbabwe-belongs-to-zanu-pf/",
            "content": "By Tinashe Sambiri\n\nA young Zimbabwean woman has sparked outrage and disbelief on social media after boldly declaring that Zimbabwe belongs to the ruling Zanu PF party.\n\nCharmaine Ropafadzo, whose video was posted on X (formerly Twitter) on Monday, can be seen confidently proclaiming the supremacy of Zanu PF over the nations identity, a sentiment many have described as dangerous and undemocratic.\n\nWherever we go, we carry the spirit of ZANU PF because ZANU PF is Zimbabwe, she said.\n\nWe constantly remind ourselves of who we are and we represent with pride and excellence every time.\n\nHer remarks have ignited strong backlash online, with critics accusing her of undermining national unity and equating a political party with the country itself. Others have expressed concern that such views reflect a growing culture of political indoctrination, particularly among the youth.\n\nThis is exactly the problem, one user replied. Zanu PF is a political party, not the country. Zimbabwe belongs to all Zimbabweans.\n\nThe incident comes at a time when public frustration with political repression, economic hardship, and limited democratic space continues to mount. Many Zimbabweans, especially those in the diaspora, argue that conflating the nation with the ruling party is both historically inaccurate and socially divisive.\n\nAs the video continues to circulate, calls are growing for greater civic education and a clear distinction between state and party to be reinforcedespecially among younger generations.\n\nWherever we go, we carry the spirit of ZANU PF because ZANU PF is Zimbabwe. We constantly remind ourselves of who we are and we represent with pride and excellence every time.@zanupf_patriots@zanupfbyoinfo@ZANUPF_Officialpic.twitter.com/Mub4YNWpt3\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri A young Zimbabwean woman has sparked outrage and disbelief on social media after boldly declaring that Zimbabwe … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/disturbing-video-young-zimbabwean-lady-claims-zimbabwe-belongs-to-zanu-pf/\">Continue reading<span class=\"screen-reader-text\"> \"Disturbing Video: Young Zimbabwean Lady Claims Zimbabwe Belongs to Zanu PF\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        },
        {
            "title": "“This Is What Development Looks Like”: MP Matambo Backs Crowborough Clinic Vision",
            "url": "https://www.zimeye.net/2025/07/01/this-is-what-development-looks-like-mp-matambo-backs-crowborough-clinic-vision/",
            "content": "By Tinashe Sambiri\n\nKuwadzana West MP Johnson Matambo has thrown his weight behind a bold community-led healthcare initiative in Crowborough, describing it as the kind of development Zimbabwe needs.\n\nThis clinic project is not just about bricks and mortar, Matambo said. It is a symbol of what happens when people come together with purpose and vision. I commend the Crowborough residents for taking the lead. This is what development looks likefrom the people, for the people.\n\nThe MP was speaking during a gathering convened to rally support for the construction of a state-of-the-art polyclinic in the high-density suburb of Crowborough, one of Harares fastest-growing communities. The initiative, birthed by local residents and officially recognised by the City of Harare, aims to provide accessible and exceptional healthcare within the community.\n\nDelivering a stirring address on behalf of the residents, community leader Ishmael Kauzani painted a powerful picture of collective action and hope.\n\nCrowborough residents, fellow countrymen and countrywomen, I welcome you with open arms, Kauzani began. Today, I stand before you, driven by a noble cause that ignites our passions and fills our hearts with purpose.\n\nHe spoke passionately about the vision to establish a polyclinic that serves as a beacon of healthcare excellence: Envisage a thriving community where every resident receives exceptional healthcare services, right within our own community. That is the vibrant community we strive to build.\n\nWhile the dream has taken root, Kauzani acknowledged the hurdles still to be overcome. Our community lacks resources, both material and financial, despite our remarkable progress in securing 2000 bricks through resident contributions, he said. We eagerly anticipate further donations to bolster our quest for enhanced healthcare and business social responsibility.\n\nIn a call to action, Kauzani emphasized unity and resilience: Stand with us on this remarkable journey as we combine our efforts, resources, and unwavering dedication to establish our clinic. Together, we can create a powerful movement for change.\n\nAlso lending institutional support was Councillor Adoniah Shoko from the City of Harare Health Department. Councillor Shoko praised the initiative, describing it as a model of participatory development and an example for other communities to follow.\n\nThis is a community that understands its needs and is not waiting for handouts but working together for solutions, said Shoko. As the City of Harare, we stand ready to support this initiative and ensure that the vision becomes a reality.\n\nThe Crowborough clinic project now stands as a symbol of grassroots empowerment, community cohesion, and the belief that sustainable development begins at home.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Kuwadzana West MP Johnson Matambo has thrown his weight behind a bold community-led healthcare initiative in Crowborough, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/01/this-is-what-development-looks-like-mp-matambo-backs-crowborough-clinic-vision/\">Continue reading<span class=\"screen-reader-text\"> \"“This Is What Development Looks Like”: MP Matambo Backs Crowborough Clinic Vision\"</span></a></p>",
            "time": "21:07",
            "date": "02 Jul 2025"
        }
    ]
}