{
    "news": [
        {
            "title": "Turmoil Hits Mnangagwa’s Gukurahundi Outreach",
            "url": "https://www.zimeye.net/2025/11/25/turmoil-hits-mnangagwas-gukurahundi-outreach/",
            "content": "Tinashe Sambiri Chiefs involved in President Emmerson Mnangagwas Gukurahundi outreach programme have allegedly demanded hefty monthly allowances of US$4,000, paid strictly in cash, along with Starlink kits and large allocations of fuel coupons before proceeding with the exercise.\n\nMnangagwa launched the Gukurahundi community outreach programme on 14 July 2024 at the Bulawayo State House, five years after the initiative was first announced in 2019. The hearings are intended to give survivors and families of victims an opportunity to share their experiences of the 1980s Gukurahundi massacres.\n\nThe process is being coordinated by a 14-member panel led by traditional leaders tasked with gathering testimonies across Matabeleland. However,The Standardreported that the chiefs financial and material demands have now thrown the already-delayed programme into disarray. One source said:At present, there is a dispute over the allowances which the chiefs are demanding. They were demanding US$4,000 a month paid in cash, but the steering committee slashed the figure to US$1,100 a month.\n\nThe source added:They wanted hundreds of litres of fuel coupons per month, but this was again turned down and an arrangement was made for them to refuel at selected service stations. They also wanted Starlink kits installed at their homesteads\n\nThe chiefs reportedly clashed with authorities after it emerged that many had appointed relatives, close family, and friends to serve on their 14-member outreach panels. These appointees are said to have received three months worth of allowances in advanceUS$1,100 per person, totalling at least US$3,300 eachyet the dispute over further payments has resurfaced and stalled the programme once again.\n\nThe hearings themselves are being conducted away from the public eye in selected parts of Matabeleland. Critics have questioned why the Midlands provincealso a region that suffered during Gukurahundihas been excluded.\n\nOpposition groups, civic organisations and human rights advocates have condemned the secrecy, warning that the process lacks transparency and risks becoming another controlled narrative rather than a genuine truth-telling exercise.\n\nAn estimated 20,000 civilians were killed during the Gukurahundi massacres, when the government deployed the North Koreantrained Fifth Brigade across Matabeleland North, Matabeleland South, and parts of Midlands.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– Chiefs involved in President Emmerson Mnangagwa’s Gukurahundi outreach programme have allegedly demanded hefty monthly allowances of US$4,000, paid … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/turmoil-hits-mnangagwas-gukurahundi-outreach/\">Continue reading<span class=\"screen-reader-text\"> \"Turmoil Hits Mnangagwa’s Gukurahundi Outreach\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Details Emerge on Paul Mwazha’s Funeral",
            "url": "https://www.zimeye.net/2025/11/25/details-emerge-on-paul-mwazhas-funeral/",
            "content": "By A Correspondent  The family of the late Archbishop Paul Mwazha has accepted President Emmerson Mnangagwas decision to confer national hero status on the revered African Apostolic Church leader, popularly known asMutumwa Mwazha.\n\nMwazha, who died last Thursday at the age of 107, was one of Zimbabwes most influential religious figures, commanding a church with millions of followers across the country and the region.\n\nFamily spokesperson Masimba Mwazha said they were honoured by the recognition.\n\nOn behalf of the family, we are really grateful to the President for affording Mutumwa Mwazha the highest honour in the land. We thank the President for recognising the investment that our father made, not just spiritually but politically as well. We are very grateful, he said.\n\nArchbishop Mwazha maintained a warm relationship with the late President Robert Mugabes Zanu PF for decades.Since the 1980s, he was known for publicly praying for Mugabe and his partys leadership, urging spiritual unity and discouraging confrontation during moments of national tension. Over the years, senior Zanu PF officials regularly attended his church gatherings, describing him as a unifying figure whose blessings were important to the partys political messaging.\n\nMwazhas churchone of Zimbabwes largest Apostolic movementshas long been viewed as strategically important in the countrys political landscape. His teachings emphasised obedience to national leadership, a stance that aligned well with Zanu PFs governance philosophy and contributed to the partys attempts to influence religious constituencies.\n\nZanu PF has historically cultivated strong ties with churches with significant membership bases.Since Independence in 1980, ruling party leaders have consistently courted religious organisations to reinforce political legitimacy, mobilise supporters, and shape public opinionparticularly during elections.\n\nLarge apostolic sects such asVapositoriandZiongroups have been central to this strategy.Mugabe and, later, Emmerson Mnangagwa have frequently attended church gatherings, offered material support, and publicly praised influential church leaders. This patronage approach has been criticised by civil society groups, who argue that it blurs the line between church and state and uses faith communities as political mobilisation platforms.\n\nIn recent years, the ruling partys engagement with churches has become more visible, with high-profile donations of vehicles, food aid, and financial contributions to sect leaders and institutions. Critics say such acts serve as political currency, while supporters view them as recognition of the churches social role.\n\nA few weeks before his passing, Mwazha received giftsincluding a vehiclefrom Zanu PF-linked benefactor and convicted fraudster, Wicknell Chivayo. The gesture drew mixed public reactions, with some describing it as honouring a long-standing spiritual leader, while others perceived it as part of broader attempts by political figures to curry favour with influential religious communities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The family of the late Archbishop Paul Mwazha has accepted President Emmerson Mnangagwa’s decision to confer … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/details-emerge-on-paul-mwazhas-funeral/\">Continue reading<span class=\"screen-reader-text\"> \"Details Emerge on Paul Mwazha’s Funeral\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "President Mugabe’s Press Officer Dies",
            "url": "https://www.zimeye.net/2025/11/25/president-mugabes-press-officer-dies/",
            "content": "By A Correspondent One of President Robert Mugabes first press officers at Independence and a war veteran, Ambassador Thomas Bvuma, has died.\n\nBorn and raised in Manicaland, Ambassador Bvuma attended St Augustines School in Penhalonga before enrolling at the then University of Rhodesia. In 1976, during his second year of study, he left the country to join the liberation struggle, crossing into Mozambique and arriving at Doroi Refugee Camp.\n\nHe later moved to Chimoio Military Base for politico-military training and was selected for advanced ideological instruction at the Chitepo Ideological College. As the Second Chimurenga intensified, ZANU leaders identified him as part of the group that would be educated for post-independence national reconstruction. In 1977, he was sent to Eduardo Mondlane University in Maputo to continue his studies.\n\nFollowing Independence in 1980, Bvuma was appointed to the Office of the President and Cabinet as Chief Press Officer, becoming one of Mugabes first official press officers during the formative years of the new government. He later joined the Ministry of Foreign Affairs and International Trade.\n\nAmbassador Bvuma went on to serve as Zimbabwes representative to Brazil, where he played a key diplomatic role during the period of Western-imposed sanctions following the land reform programme. His work helped secure the More Food for Africa programme, a cooperation deal through which Brazil supplied agricultural equipment to Zimbabwe, helping boost productivity amid economic pressure.\n\nHe later served as Vice-Chairman of the Zimbabwe Broadcasting Corporation, his final public appointment.\n\nBeyond government service, Ambassador Bvuma was also a published writer and one of the few liberation fighters to document the struggle from an insiders viewpoint. Last year, the Institute of African Knowledge/Museum of African Liberation launched his historical bookThe Chosen Generation, adding to his earlier poetry collectionThe Tale That Turns.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent —  One of President Robert Mugabe’s first press officers at Independence and a war veteran, Ambassador Thomas … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/president-mugabes-press-officer-dies/\">Continue reading<span class=\"screen-reader-text\"> \"President Mugabe’s Press Officer Dies\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Top Diplomat Dies",
            "url": "https://www.zimeye.net/2025/11/25/top-diplomat-dies-3/",
            "content": "By A Correspondent The government has announced the death of veteran diplomat and liberation struggle cadre Thomas Bvuma.\n\nBorn and educated in Manicaland, Ambassador Bvuma attended St Augustines School in Penhalonga before enrolling at the then University of Rhodesia. In 1976, during his second year of study, he left the country to join the liberation struggle. He crossed into Mozambique and arrived at Doroi Refugee Camp that same year.\n\nHe later proceeded to Chimoio Military Base for politico-military training and was selected for further ideological instruction at the Chitepo Ideological College. Recognising the need to develop a skilled cadre for post-independence state-building, ZANU leadership identified Bvuma as one of the fighters who should resume formal education. In 1977, he was sent to Eduardo Mondlane University in Maputo to continue his studies while the liberation war intensified.\n\nAfter Independence, Ambassador Bvuma joined the Office of the President and Cabinet as Chief Press Officer before moving to the Ministry of Foreign Affairs and International Trade. He later represented Zimbabwe as Ambassador to Brazil, where he played a significant role in diplomatic efforts to counter Western sanctions imposed after the land reform programme. One of his major achievements was securing the More Food for Africa cooperation initiative, through which Brazil supplied modern agricultural equipment to Zimbabwehelping ease the impact of sanctions and boosting agricultural productivity.\n\nHe went on to serve as Vice-Chairman of the Zimbabwe Broadcasting Corporation, his final public appointment.\n\nBeyond diplomacy and government service, Ambassador Bvuma made notable contributions to Zimbabwean literature. He was among the few liberation war cadres to publish accounts of the struggle from an insiders perspective. Last year, the Institute of African Knowledge/Museum of African Liberation launched his historical bookThe Chosen Generation, adding to his earlier poetry collectionThe Tale That Turns.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — The government has announced the death of veteran diplomat and liberation struggle cadre Thomas Bvuma. Born … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/top-diplomat-dies-3/\">Continue reading<span class=\"screen-reader-text\"> \"Top Diplomat Dies\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Mnangagwa On fresh Purges, Places New Army Loyalists",
            "url": "https://www.zimeye.net/2025/11/25/mnangagwa-on-fresh-purges-places-new-army-loyalists/",
            "content": "By A Correspondent President Emmerson Mnangagwa has signalled a major restructuring within the military, strongly hinting that the recent retirements and fresh deployments are part of a broader strategy to position loyal allies at the centre of the Zimbabwe Defence Forces (ZDF).\n\nPresiding over the handover-takeover parade at Charles Gumbo Barracks  where General Emmanuel Matatu officially assumed command from the retiring General Philip Valerio Sibanda  Mnangagwa issued a carefully worded but revealing message: leadership may change, but loyalty, discipline and continuity must remain unquestioned.\n\nBehind the ceremonial tone, analysts say Mnangagwas speech reflected a deeper political calculation. The retirement of Sibanda, the appointment of Matatu, and the quiet movement of other senior officers have widely been interpreted as Mnangagwas latest effort to reshape the militarys command structure in his favour.\n\nWhile we may have changes in leadership, the mission of the ZDF remains the same, Mnangagwa said, urging soldiers to remain disciplined and loyal  a line that many observers read as code forstay aligned with the Commander-in-Chiefs restructuring.\n\nThe transition comes as Mnangagwa accelerates subtle but strategic changes within the armed forces. For years, the military has been divided between factions loyal to Mnangagwa and those aligned with Vice President Constantino Chiwenga, the former ZDF commander who led the 2017 coup that installed Mnangagwa in power.\n\nNow, as succession battles intensify, the President appears determined to secure absolute control over the army  the same institution that made and could potentially unmake him.\n\nGeneral Matatus elevation, from lieutenant general to full general, is seen by insiders as the cementing of Mnangagwas trusted inner circle within the military hierarchy. Over the past few months, senior officers perceived to be aligned with Chiwenga have been quietly retired, repositioned, or pushed into diplomatic assignments, while those loyal to Mnangagwa have been promoted into strategic command posts.\n\nDuring the ceremony, Mnangagwa repeatedly praised Sibandas loyalty, emphasising it to the point that it appeared less like commendation and more like a reminder to the incoming leadership about exactly which qualities matter most.\n\nTo the officers, men and women of the ZDF, I urge you to remain disciplined and loyal, he stressed  words that carried unmistakable political weight given the current internal dynamics.\n\nMnangagwa also highlighted Sibandas long liberation-war pedigree and his service under the post-independence army structures  an implicit nod to the older generation of commanders whose influence he has carefully sought to neutralise.\n\nTurning to Matatu, he expressed strong confidence that the new commander would uphold continuity  a phrase widely understood to mean maintaining the security and political architecture that protects Mnangagwas rule.\n\nI am confident you will use your vast experience to effectively and professionally lead the ZDF as was the case with your predecessor, Mnangagwa said.\n\nThe developments came as Vice President Chiwenga and former Presidential Guard commander Anselem Sanyatwe  both key military figures in the 2017 coup  made striking public appearances in full military regalia. Their timing, coinciding with Mnangagwas military reshuffles, has fuelled speculation of deepening factional tensions.\n\nPolitical observers note that Mnangagwas latest moves reflect both consolidation and caution: cementing his factions control while preemptively guarding against any internal challenge from commanders sympathetic to Chiwengas camp.\n\nBy the time Mnangagwa concluded his speech, the message was unmistakably clear: the retirements, promotions and reassignments are not mere routine military procedures. They form part of a deliberate political choreography  one recalibrating the balance of power within the army ahead of looming succession battles.\n\nMnangagwa may not have spoken the word purge, but his actions  and the tone of his address  strongly suggest that the restructuring of the ZDF is just beginning.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — President Emmerson Mnangagwa has signalled a major restructuring within the military, strongly hinting that the recent retirements … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/mnangagwa-on-fresh-purges-places-new-army-loyalists/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa On fresh Purges, Places New Army Loyalists\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Reggae King Jimmy Cliff Dies",
            "url": "https://www.zimeye.net/2025/11/25/reggae-king-jimmy-cliff-dies/",
            "content": "By Showbiz Reporter One of the most influential and beloved figures in global reggae music, Jimmy Cliff, has died.He was 81.\n\nCliff, who rose to fame in the 1960s, played a key role in taking the sound of Jamaica to the world with classics such asWonderful World, Beautiful People,You Can Get It If You Really Want, andMany Rivers to Cross. His breakout performance as the gun-toting rebel Ivan in the 1972 filmThe Harder They Comebecame a landmark in Jamaican cinema and is widely credited with introducing reggae music to American audiences.\n\nHis wife, Latifa Chambers, confirmed his passing in a statement posted on Instagram.\n\nIts with profound sadness that I share that my husband, Jimmy Cliff, has crossed over due to a seizure followed by pneumonia, she wrote.\n\nI am thankful for his family, friends, fellow artistes and co-workers who have shared his journey with him. To all his fans around the world, please know that your support was his strength throughout his whole career. Jimmy, my darling, may you rest in peace. I will follow your wishes.\n\nThe message was also signed by their children, Lilty and Aken.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter — One of the most influential and beloved figures in global reggae music, Jimmy Cliff, has died.He … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/reggae-king-jimmy-cliff-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Reggae King Jimmy Cliff Dies\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Sanyatwe, VP Chiwenga Return to Military Regalia",
            "url": "https://www.zimeye.net/2025/11/25/sanyatwe-vp-chiwenga-return-to-military-regalia/",
            "content": "By A Correspondent In a dramatic display laden with political symbolism, Vice President Constantino Chiwenga and former Presidential Guard commander Lieutenant General (Rtd) Anselem Sanyatwe on Monday made rare public appearances dressed in full military regalia  the uniforms they both shed after the 2017 coup that toppled the late Robert Mugabe.\n\nSanyatwe, now the Minister of Sports, Arts and Recreation, arrived at Charles Gumbo Barracks flanked by his wife, Deputy Home Affairs Minister Chido Sanyatwe, as he joined the ceremony marking the handover-takeover of command between outgoing ZDF Commander General Philip Valerio Sibanda and incoming Commander General Emmanuel Matatu. Chiwenga, the countrys second-in-command, also appeared in his full Zimbabwe Defence Forces (ZDF) uniform, a striking move considering it is the first time he has worn it publicly since retiring in 2017 to become Emmerson Mnangagwas deputy.\n\nThe timing of Chiwengas decision was symbolic. It came exactly eight years after Mnangagwa was sworn in as President, a rise made possible by the military intervention Chiwenga led. Since then, the Vice President has worked to present himself as a statesman, favouring suits and traditional attire. His choice to reappear in uniform was therefore deliberate. In Zimbabwes political culture, military uniforms convey authority, legitimacy, and the power to command. For a retired general and sitting Vice President, putting on that uniform at a public event is an unmistakable political signal.\n\nSanyatwes appearance was equally significant. Once one of the most powerful commanders within the Zimbabwe Defence Forces, he played a central role in the 2017 coup as head of the Presidential Guard Brigade  a unit integral to Mugabes removal. After Mnangagwa took office, Sanyatwe was moved out of the military and posted as ambassador to Tanzania, a move widely interpreted as an attempt to weaken Chiwengas influence. His return to Zimbabwe in 2024 and swift appointment as Sports Minister marked a surprising resurgence that many insiders interpreted as part of a broader consolidation of Chiwengas loyal networks. Seeing him back in military attire beside Chiwenga underscored the re-emergence of the alliances that shaped the 2017 military transition.\n\nRelations between Chiwenga and Mnangagwa have grown increasingly strained over the past five years. Mnangagwa has systematically weakened Chiwengas military base by retiring or reassigning loyalists such as Sanyatwe, Engelbert Rugeje, and the late Perrance Shiri. The rise of FAZ as the ruling partys electoral machinery has also sidelined war veterans and disrupted traditional military patronage channels aligned with Chiwenga. Added to this are tensions over Mnangagwas suspected third-term ambitions, which clash directly with the informal 2017 agreement that he would serve one term before handing over power to Chiwenga. The Vice Presidents recent admission that the 2017 transition was a coup further embarrassed Mnangagwas camp and aggravated internal rifts.\n\nAgainst this backdrop, the reappearance of both Chiwenga and Sanyatwe in uniform looks like a coordinated political manoeuvre. For Chiwenga, the uniform is a reminder of the authority he once held  and a signal that he still sees himself as the architect of Zimbabwes current political order. For Sanyatwe, it symbolises the revival of a military faction that felt marginalised under Mnangagwas restructuring of the security establishment. The visual message was unmistakable: the military networks that delivered Mnangagwa to power in 2017 are reasserting themselves ahead of the ruling partys looming leadership battles.\n\nThe images have unsettled many in the ruling elite. To some, they reflect confidence and renewed momentum within Chiwengas camp; to others, they point to desperation and the escalation of a high-stakes struggle for power. For ordinary Zimbabweans, the sight of senior politicians in military attire recalls the unresolved traumas of 2008, 2017 and the armys involvement in electoral and political affairs.\n\nWhatever the interpretation, one conclusion is clear: the return of military uniforms to the political stage is not nostalgic theatre. It is a calculated signal of power, defiance and ambition, delivered at a moment when ZANU-PF is once again hurtling toward a potentially destabilising succession fight.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — In a dramatic display laden with political symbolism, Vice President Constantino Chiwenga and former Presidential Guard commander … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/sanyatwe-vp-chiwenga-return-to-military-regalia/\">Continue reading<span class=\"screen-reader-text\"> \"Sanyatwe, VP Chiwenga Return to Military Regalia\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Political Earthquake: Ziyambi Confirms Move to Stretch Presidential Power",
            "url": "https://www.zimeye.net/2025/11/25/political-earthquake-ziyambi-confirms-move-to-stretch-presidential-power/",
            "content": "Tinashe Sambiri  Confusion and criticism intensified on Sunday after Justice Minister Ziyambi Ziyambi finally clarified Resolution Number One at a ZANU PF Interdistrict meeting in Banket  a clarification many say confirms growing fears about attempts to prolong executive power.\n\nZiyambi declared that the resolution will not change the two-term presidential limit, but will instead extend the length of each term, a move that has already raised alarm among analysts and opposition figures. According to him, the adjustment is meant to boost stability and continuity in national governance, though sceptics view it as a strategic step to tighten political control.\n\nHe revealed that the draft implementation framework will be completed before Christmas, adding that once it is done, its contents will be shared directly to the grassroots so every cadre understands the new direction. Critics, however, warn that the outreach may be more symbolic than meaningful.\n\nZiyambi further insisted that Resolution Number One is intended to end unnecessary politicking, claiming it will help refocus the nation  including Members of Parliament  on development, service delivery, and advancing President Mnangagwas agenda.\n\nDespite these assurances, the ministers explanation has triggered widespread concern, with many interpreting the plan as another step toward diminishing democratic checks and expanding long-term executive influence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri – Confusion and criticism intensified on Sunday after Justice Minister Ziyambi Ziyambi finally clarified Resolution Number One at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/political-earthquake-ziyambi-confirms-move-to-stretch-presidential-power/\">Continue reading<span class=\"screen-reader-text\"> \"Political Earthquake: Ziyambi Confirms Move to Stretch Presidential Power\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Soaring Prices Force Mnangagwa Regime To Lift Restrictions On External Cement Supplies",
            "url": "https://www.zimeye.net/2025/11/25/soaring-prices-force-mnangagwa-regime-to-lift-restrictions-on-external-cement-supplies-2/",
            "content": "Tinashe Sambiri The Emmerson Mnangagwa administration has been forced into an embarrassing policy reversal as the worsening cement crisis  marked by spiralling prices and collapsing supply  pushed authorities to lift long-standing restrictions on external cement supplies, a desperate move critics say exposes the governments failure to manage the economy.\n\nSpeaking in Parliament last week during a session dominated by anger over the near-doubling of cement prices in just two months, Minister of Skills Audit and Development Paul Mavima, representing the Leader of Government Business, admitted the situation had become untenable.He told MPs: This is a matter that the Cabinet discussed yesterday (Tuesday).\n\nCement prices have surged to about US$20 per 50kg bag, up from roughly US$12 in August, placing even basic construction materials beyond the reach of ordinary citizens.\n\nMavima, who is also the MP for Gokwe Sengwa, claimed the crisis was driven by several factors, including surging demand in residential and commercial construction. He explained:The factors are many, but there is also an increase, a boom, in the construction industry, including residential construction and other structures that are going up, which is contributing to this shortage.\n\nIn a revealing admission that local producers could not meet national needs, Mavima added: The Cabinet took a decision yesterday (Tuesday) to open up the importation of cement, and this is supposed to be with immediate effect.\n\nHowever, critics argue the government should have anticipated supply pressures well before the situation reached crisis level.\n\nDeputy Minister of Industry and Commerce Raji Modi also disclosed worrying bottlenecks in the supply system, telling the House that even companies with valid licences were stuck in prolonged border delays.He said the backlogs had created severe disruptions to external supply at a time when domestic shortages were intensifying.\n\nModi further highlighted deep-seated structural problems within Zimbabwes cement industry, including a shortage of clinker  the key raw material  coupled with frequent breakdowns at ageing production plants.\n\nDespite Zimbabwe having an installed production capacity of 2.6 million tonnes per year, actual output remains far below potential due to chronic issues such as power shortages, obsolete machinery and inconsistent operations among key producers.\n\nThe countrys major cement manufacturers  Khayah Cement in Harare, PPC Zimbabwe in Harare and Bulawayo, Sino-Zimbabwe Cement in Gweru and the Chinese-owned Livetouch Cement in Redcliff  have all struggled to stabilise supply amid mounting production challenges.\n\nEconomic analysts say the governments sudden decision to open external cement supplies reflects broader governance failures and a lack of long-term planning. With shortages worsening and prices soaring, many Zimbabweans now view the move as yet another sign that the Mnangagwa regimes economic policies are collapsing under their own weight.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri– The Emmerson Mnangagwa administration has been forced into an embarrassing policy reversal as the worsening cement crisis — … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/soaring-prices-force-mnangagwa-regime-to-lift-restrictions-on-external-cement-supplies-2/\">Continue reading<span class=\"screen-reader-text\"> \"Soaring Prices Force Mnangagwa Regime To Lift Restrictions On External Cement Supplies\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        },
        {
            "title": "Understanding Market Moves Begins with the Right Currency Pair",
            "url": "https://www.zimeye.net/2025/11/25/understanding-market-moves-begins-with-the-right-currency-pair/",
            "content": "Its easy to get lost in the thrill of the forex market. With charts flashing and news breaking every second, most people jump straight to the big question: will it go up or down? It feels like the only thing that matters. But heres something most people dont think about right away: the specific currency pair you choose to trade is just as important as predicting its direction. This choice sets the entire tone for your trading. It affects your costs, your risks, and the kind of opportunities youll even see. Getting a feel for the markets rhythm truly starts with picking the right instrument to play.\n\nImagine walking into a huge party where you dont know anyone. Youll see a big, lively group in the center of the room, smaller clusters of people having interesting conversations in the corners, and a few unpredictable individuals who are fascinating but hard to read.\n\nThe forex market is a lot like that party. The different groups are the currency pairs. At a basic level, a pair just tells you the price of one currency in terms of another. But each one has a totally different vibe. Before you can even think about having a good conversation or making a trade, you need to decide which group you want to approach. Thats why figuring out thebest currency pairs to tradeis such a crucial first move; it helps you find a comfortable starting point in a crowded room.\n\nThe main groups are the minors, majors, and exotics. The majors are the popular crowd in the middle of the room. The minors are the interesting side conversations. And the exotics are those fascinating, but unpredictable, lone wolves. Knowing whos who is the first step to navigating the party successfully.\n\nThese are the big names of the currency world. Pairs like EUR/USD (the euro versus the U.S. dollar), USD/JPY (the U.S. dollar versus the Japanese yen), and GBP/USD (the British pound versus the U.S. dollar) are the A-listers. So many people are trading them at any given moment that the market is incredibly liquid. Think of it like a busy highway; its easy to get on and off without causing a traffic jam. This constant activity usually means the cost of entry, known as the spread, is quite low.\n\nBut they arent all the same. Each major pair has a personality. The EUR/USD is like the steady, reliable one of the group. Its the most traded pair on the planet, and its movements are often a bit more measured. TheGBP/USDis the energetic, sometimes dramatic friend. Its known for bigger, faster swings, which can be exciting but also require you to be more on your toes. Then you have a pair like USD/CHF (the U.S. dollar versus the Swiss franc). The Swiss franc is often seen as a safe place to park money when the world feels chaotic, so this pair behaves differently during times of global stress.\n\nOnce youre comfortable with the main crowd, you might start looking around the room. Thats where youll find the minor and exotic pairs. Minors, like EUR/GBP or AUD/JPY, are currencies that dont involve the U.S. dollar. They offer a chance to trade based on the relationship between two other major economies. The action might not be as constant as with the majors, and the cost of entry might be a little higher, but the opportunities can be just as interesting if you know what youre looking for.\n\nExotic pairs, like USD/TRY (the U.S. dollar versus the Turkish lira), are a whole different ballgame. This is like striking up a conversation with that unpredictable person in the corner. The potential for sudden, sharp movements is much higher, oftendriven by political newsor economic surprises in the smaller country. The market is thinner, and the spreads are wider to reflect that risk. This is advanced territory, usually best left to seasoned traders.\n\nThis is where it all comes together. The right currency pair for you isnt the best one in a vacuum; its the one that fits your personality as a trader. Think of it like choosing a vehicle. Are you looking for a reliable sedan for a daily commute, or a rugged off-road truck for a long, adventurous journey?\n\nIf youre a short-term trader who wants to get in and out of the market quickly to catch small moves, youre a commuter. You need the majors. Their low spreads and high traffic are perfect for that style. A wider spread would be like paying a huge toll on a short trip; it would just eat away at your results. But if youre a long-term trader who plans to hold a position for weeks or months based on a big economic trend, youre on an adventure. You might be willing to drive that off-road truck. The higher initial cost of a wider spread on a minor or exotic pair becomes less significant over a long journey, as long as youre confident in your destination.\n\nIn the end, learning to read the market is about more than just charts and headlines. Its about choosing your playing field wisely before the game even starts. By taking a moment to understand the personalities of different pairs and seeing how they align with your own approach, youre doing more than just trading. Youre making a strategic choice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "It’s easy to get lost in the thrill of the forex market. With charts flashing and news breaking every second, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/25/understanding-market-moves-begins-with-the-right-currency-pair/\">Continue reading<span class=\"screen-reader-text\"> \"Understanding Market Moves Begins with the Right Currency Pair\"</span></a></p>",
            "time": "09:32",
            "date": "26 Nov 2025"
        }
    ]
}