{
    "news": [
        {
            "title": "Walter Magaya Slapped With ZIFA Exclusion Application",
            "url": "https://www.zimeye.net/2024/12/17/walter-magaya-slapped-with-zifa-exclusion-application/",
            "content": "By Sports Reporter |Harare, Zimbabwe  A formal objection has been raised against the nomination ofWalter Magayafor the presidency of the Zimbabwe Football Association (ZIFA). The objection, submitted to the ZIFA Electoral Committee and Ethics and Integrity Committee Chairperson, cites multiple criminal, civil, and disciplinary allegations that question Magayas ethical, legal, and financial suitability for the role.\n\nCriminal Matters: Pending and Past Cases\n\nThe letter highlights a series of unresolved criminal charges and past convictions that could potentially disqualify Mr. Magaya. These include:\n\n1.Pending Criminal Charges: Walter Magaya faces charges underSection 81 of the Income Tax Actfor alleged tax violations. The matter,State v Walter Magaya (CRB1848/19), is scheduled for hearing at theRotten Row Magistrates Courton 21 January 2024.\n\n2.Asset Forfeiture Investigation: In the caseState v Walter Magaya (PPs Ref 1193/22), financial mismanagement and potential illicit activities are under scrutiny by theAsset Forfeiture Department.\n\n3.Conviction Under Medicines Control Act: Magaya, through his companyMagaya Aretha Medical Private Limited, was convicted and fined US$700 for promoting a false cure for HIV and AIDS. This act was deemed unethical and dangerous to public health.\n\nCivil Matters: Financial Instability and Property Seizure\n\nThe objection also outlines civil cases that question Magayas financial stability and capacity to lead ZIFA responsibly:\n\nIn the caseGet Bucks Microfinance Bank Ltd v Walter Magaya (HCHC657/24), the High Court ordered the sale of Magayas property on 9 October 2024 to settle a significant debt of US$420,140.72.\n\nThis ruling underscores his inability to meet financial obligations, a critical concern for someone vying to manage ZIFAs finances and affairs.\n\nFIFA Disciplinary Sanction: Yadah Football Club\n\nFurther complicating Magayas candidacy is a disciplinary sanction imposed by FIFA on 6 August 2024.\n\nFIFA bannedYadah Football Club, owned and chaired by Magaya, from registering international players due to violations of FIFA club licensing rules.\n\nThe objection emphasizes that, as owner and leader of Yadah FC, Magaya bears ultimate responsibility for governance lapses. The precedent of FIFA holding leaders accountable for ethical breaches, as seen in theSamson Siasiacase, has been cited to stress Magayas ethical shortcomings.\n\nImplications for ZIFA Leadership\n\nThe objection raises concerns about Magayas integrity, financial management, and accountabilitycritical traits required for ZIFAs top leadership role. The letter suggests that his history of legal troubles and FIFA sanctions reflects poorly on his ability to restore credibility to the countrys football administration.\n\nWhats Next?\n\nThe ZIFA Ethics and Integrity Committee is expected to assess the merit of these objections before determining whether Walter Magayas candidacy will proceed. Football stakeholders and fans alike will be watching closely as this controversy unfolds, given ZIFAs ongoing efforts to clean up its image and improve governance.\n\nReporters Note\n\nWalter Magaya, a prominent businessman and football club owner, has yet to comment on the allegations. The developments surrounding his candidacy will likely spark debates over ethics, governance, and the future of Zimbabwean football.\n\nThis is a developing story. Updates will follow as more information becomes available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Reporter | Harare, Zimbabwe — A formal objection has been raised against the nomination of Walter Magaya for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/walter-magaya-slapped-with-zifa-exclusion-application/\">Continue reading<span class=\"screen-reader-text\"> \"Walter Magaya Slapped With ZIFA Exclusion Application\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Botswana Refutes Mnangagwa Cattle Gift Allegations",
            "url": "https://www.zimeye.net/2024/12/17/botswana-refutes-mnangagwa-cattle-gift-allegations/",
            "content": "Gaborone-The governmentof Botswana has dismissed reports circulating on online news platforms and social media alleging that Zimbabwean President Emmerson Mnangagwa gifted10cattle to the President of Botswana, Duma Boko, during a recent official visit.\n\nPresident Mnangagwa recently visited Botswana as the rotational chair of the Southern African Development Community (SADC) to inspect the regional blocs headquarters and assess new projects proposed under SADCs agenda.\n\nThe visit, hosted by President Boko, was part of routine diplomatic engagements.\n\nRumours of the cattle gift emerged shortly after the visit, prompting the Office of the President of Botswana to issue a strongly-worded statement through Press Secretary Emang Mutapati, unequivocally denying the claims.\n\nMutapati stated:\n\nThe Office of the President categorically refutes false allegations that President Duma Boko has received any breed of cows or similar gifts from His Excellency President Emmerson Mnangagwa of the Republic of Zimbabwe. President Boko has never been involved in farming, either as a cattle rancher or in any other capacity.\n\nDescribing the claims as baseless propaganda, Mutapati emphasised that theywere designedto mislead the public, disrupt the governments work, and undermine the strong diplomatic ties between the two nations.\n\nShefurthercalled on media institutions, particularly the Botswana Editors Forum, to guard against misinformation and hold rogue elements accountable.\n\nMutapati concluded by reaffirming the professional and developmental focus of the relationship between the two presidents:\n\nThe relationship between President Boko and President Mnangagwa remains diplomatic, focused solely on strengthening cooperation and fostering mutual development between the two nations.\n\nThe statement serves as a reminder of the importance of accurate reporting in safeguarding the integrity of both nations and their leaders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Gaborone-The government of Botswana has dismissed reports circulating on online news platforms and social media alleging that Zimbabwean President Emmerson Mnangagwa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/botswana-refutes-mnangagwa-cattle-gift-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Botswana Refutes Mnangagwa Cattle Gift Allegations\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Guardiola Concedes Manchester City in Turmoil",
            "url": "https://www.zimeye.net/2024/12/17/guardiola-concedes-manchester-city-in-turmoil/",
            "content": "Sports Correspondent\n\nManchester Citys woes deepened as they suffered a stunning 2-1 defeat to Manchester United in the Premier League on Sunday. The loss marked Citys eighth in eleven games, leaving them in fifth place and nine points adrift of leaders Liverpool.\n\nPep Guardiola acknowledged the severity of the situation, stating: Something is wrong, and Im the one responsible. Im the boss, and I need to find a solution.\n\nDespite taking the lead through Joko Gvardiols goal, City conceded two late goals to Bruno Fernandes and Amad Diallo. Guardiolas frustration was palpable, as he admitted: Im not good enough. Its as simple as that.\n\nWith Citys title hopes dwindling, Guardiola must rally his troops to arrest the slump and revive their season.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Manchester City’s woes deepened as they suffered a stunning 2-1 defeat to Manchester United in the Premier League … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/guardiola-concedes-manchester-city-in-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"Guardiola Concedes Manchester City in Turmoil\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Harare Says Lake Chivero Contamination Report Exaggerated",
            "url": "https://www.zimeye.net/2024/12/17/harare-says-lake-chivero-contamination-report-exaggerated/",
            "content": "The City of Harare said that reports of contamination at Lake Chivero are exaggerated, despite confirmation from the Zimbabwe Parks and Wildlife Management Authority (Zimparks) that several animals, including four rhinos, three zebras, four wildebeests, four fish eagles, as well as multiple goats and cattle, have died after drinking water from the lake.I\n\nn a statement issued on Monday, the City of Harare said a stakeholder meeting had been convened, bringing together council experts and representatives from other government agencies to address the reports of animal deaths linked to alleged contamination.\n\nThe council also said that further investigations will be conducted, and a joint statement from the City of Harare and the Environmental Management Agency (EMA) will be issued in due course.\n\nTeams are already on the ground to take samples on the particular part of the lake the rhinos drink from. Animals are territorial and it appears they drink from the same place.\n\nResidents are urged to ignore exaggerated social media and media reports that the whole lake has been contaminated, CoH said.\n\nEarlier, Zimparks spokesperson Tinashe Farawo said that the deaths were caused by contamination from cyanobacteria in the lakes water.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The City of Harare said that reports of contamination at Lake Chivero are exaggerated, despite confirmation from the Zimbabwe Parks … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/harare-says-lake-chivero-contamination-report-exaggerated/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Says Lake Chivero Contamination Report Exaggerated\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Ademola Lookman Wins CAF Player of the Year Award",
            "url": "https://www.zimeye.net/2024/12/17/ademola-lookman-wins-caf-player-of-the-year-award/",
            "content": "Sports Correspondent\n\nNigerias Ademola Lookman has been crowned the Confederation of African Football (CAF) Player of the Year at the 2024 CAF Awards ceremony in Morocco.\n\nLookman, who plays for Atalanta, beat out top contenders to claim the prestigious award.\n\nFull List of Winners:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Nigeria’s Ademola Lookman has been crowned the Confederation of African Football (CAF) Player of the Year at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/ademola-lookman-wins-caf-player-of-the-year-award/\">Continue reading<span class=\"screen-reader-text\"> \"Ademola Lookman Wins CAF Player of the Year Award\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Be Responsible On The Road",
            "url": "https://www.zimeye.net/2024/12/17/be-responsible-on-the-road-2/",
            "content": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls on every individual. While authorities play a crucial role in setting rules, providing infrastructure, and enforcing traffic laws, the safety of our roads depends on how each of us behaves behind the wheel or as a pedestrian.\n\nIts easy to assume that road safety is solely the responsibility of lawmakers and authorities, but the reality is that every person who uses the road contributes to creating a safer or more dangerous environment. Drivers, passengers, cyclists, and even pedestrians all have a part to play in ensuring that our roads remain safe for everyone.\n\nThe Importance of Safe Driving\n\nOne of the most significant contributors to road safety is the way we drive. Speeding, distracted driving, and driving under the influence of alcohol or drugs are all actions that put not only the driver but also other road users at serious risk. Being aware of road conditions, following traffic signals, wearing seat belts, and respecting speed limits are some of the simplest yet most effective ways to avoid accidents.\n\nDriving safely involves more than just adhering to the lawit means being conscious of other drivers and pedestrians, maintaining a safe distance, and reacting calmly in emergency situations. The decision to drive responsibly can prevent countless accidents and save lives.\n\nPedestrians and Cyclists: Sharing the Road\n\nRoad safety isnt just about cars. Pedestrians and cyclists also need to be vigilant and responsible. Pedestrians should use crosswalks, avoid jaywalking, and stay alert when walking near busy streets. Similarly, cyclists must wear helmets, signal their turns, and follow traffic rules to minimize the risk of accidents.\n\nEveryone, regardless of how they travel, plays a part in maintaining road safety. Drivers must be aware of pedestrians and cyclists, while pedestrians and cyclists should respect the rules designed to protect them.\n\nA Culture of Responsibility\n\nBuilding a culture of road safety starts with individuals taking responsibility for their actions. Whether you are driving, cycling, or walking, your behavior on the road can have a direct impact on others. Everyone should recognize that safety is not just a matter of personal well-being but also the well-being of everyone else on the road.\n\nConclusion\n\nRoad safety is not only about laws and regulations; it is about creating a culture where everyone takes responsibility for their actions. To ensure that roads are safe for everyone, we must all participatedrivers, pedestrians, cyclists, and law enforcement. The message is simple: Drive safely, save lives. Lets make road safety a shared priority for all.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/be-responsible-on-the-road-2/\">Continue reading<span class=\"screen-reader-text\"> \"Be Responsible On The Road\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Motorist Kills Learner(13) in Hit-and-Run Incident, Abandons Vehicle, Flees Scene",
            "url": "https://www.zimeye.net/2024/12/17/motorist-kills-learner13-in-hit-and-run-incident-abandons-vehicle-flees-scene/",
            "content": "By A Correspondent\n\nA 13-year-old grade 7 learner tragically lost their life in a hit-and-run accident on December 15, 2024, in Mbare. The incident occurred around 1:52 pm on New Chitungwiza Road, when the victim was struck by an unknown driver of a Nissan Caravan kombi (registration number AGZ 0118). In a shocking act of cowardice, the driver abandoned the victims body and the vehicle at Chitungwiza Hospital before fleeing the scene.\n\nThe Zimbabwe Republic Police (ZRP) is urging anyone with information to come forward and help apprehend the driver responsible for this heart-wrenching tragedy. Authorities are determined to bring justice to the grieving family.\n\nThis devastating incident highlights the urgent need for drivers to exercise caution and prioritize pedestrian safety, as the community mourns the loss of a young life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A 13-year-old grade 7 learner tragically lost their life in a hit-and-run accident on December 15, 2024, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/motorist-kills-learner13-in-hit-and-run-incident-abandons-vehicle-flees-scene/\">Continue reading<span class=\"screen-reader-text\"> \"Motorist Kills Learner(13) in Hit-and-Run Incident, Abandons Vehicle, Flees Scene\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Israel: Hall of Faith Dedicated to ED at the Church of the Nativity in Bethlehem",
            "url": "https://www.zimeye.net/2024/12/17/israel-hall-of-faith-dedicated-to-ed-at-the-church-of-the-nativity-in-bethlehem/",
            "content": "By Dr Masimba Mavaza |Africas Hall of Faith Dedicated to President Mnangagwa at the Church of the Nativity in Bethlehem\n\nIn an unprecedented and historic gesture, President Emmerson Mnangagwa, who also serves as the Chairperson of the Southern African Development Community (SADC), has been honored with the dedication of theAfricas Hall of Faithat the Church of the Nativity in Bethlehem  the birthplace of Jesus Christ. This marks President Mnangagwa as the first African leader to receive such an esteemed recognition.\n\nThe dedication ceremony, a collaborative effort spearheaded by Ambassador Ronny Levi Musan, the Consul General of Zimbabwe in Israel, and Father Rami Asakrieh, the Parish Priest of Bethlehem, symbolizes a significant spiritual bridge between Africa and the Holy Land.\n\nIn the sacredAfricas Hall of Faith, the names of all SADC Presidents and senior state officials have been inscribed, alongside other global leaders, including Pope Francis, in a gesture of prayerful unity. This hall represents a unique acknowledgment of Zimbabwes leadership and the collective role of SADC nations in fostering peace and hope for their people.\n\nThe images captured at the dedication depict the solemn significance of the moment. The first photo highlights Ambassador Musan and Father Rami Asakrieh proudly unveiling a commemorative plaque inscribed with President Mnangagwas name. Additional photos show Father Asakrieh prayerfully reflecting before the engraved golden plaques  a testament to the spiritual reverence bestowed upon these leaders.\n\nThis dedication is seen as an early Christmas gift for Zimbabwe and a profound honor for the SADC region. Millions of Christians across Zimbabwe and Southern Africa will now look to this holy site for inspiration, drawing strength, faith, and hope into their lives. The initiative solidifies a deep spiritual connection between Africa and Bethlehem, underscoring the global importance of regional unity and leadership.\n\nPresident Mnangagwas recognition at such a revered site is not only a personal accolade but a historic milestone for Zimbabwe and the SADC family as a whole, affirming their enduring faith and leadership on the international stage.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | Africa’s Hall of Faith Dedicated to President Mnangagwa at the Church of the Nativity in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/israel-hall-of-faith-dedicated-to-ed-at-the-church-of-the-nativity-in-bethlehem/\">Continue reading<span class=\"screen-reader-text\"> \"Israel: Hall of Faith Dedicated to ED at the Church of the Nativity in Bethlehem\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "Cyclone Chido Hits Masvingo",
            "url": "https://www.zimeye.net/2024/12/17/cyclone-chido-hits-masvingo/",
            "content": "By A Correspondent\n\nTropical Cyclone Chido, which had been the subject of widespread anticipation, made its arrival in Masvingo on Tuesday afternoon.\n\nHowever, instead of the predicted torrential rains, the cyclone only brought light showers that lasted for less than 30 minutes, leaving residents somewhat relieved.\n\nGovernment officials had previously warned that Masvingo could face intense rainfall and possible flooding, prompting heightened preparedness in the region. Local authorities, including meteorologists, had issued advisories urging people to take precautions. Despite the cyclones weak impact in the area, officials remained cautious and continued to monitor the situation closely.\n\nWe are still monitoring the situation. We cant afford to relax at this juncture, a government source at Benjamin Burombo Building in Masvingo stated in an interview with ZimEye.com on Tuesday.\n\nThe source emphasized that the cyclones trajectory could change and that further updates would be provided if the weather conditions worsened.\n\nResidents in Masvingo expressed mixed reactions, with some relieved that the storm did not bring the expected devastation, while others remained on alert, mindful of the unpredictable nature of cyclonic weather systems in the region. Emergency teams and local authorities are maintaining vigilance as the cyclones remnants continue to move across the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tropical Cyclone Chido, which had been the subject of widespread anticipation, made its arrival in Masvingo on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/cyclone-chido-hits-masvingo/\">Continue reading<span class=\"screen-reader-text\"> \"Cyclone Chido Hits Masvingo\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        },
        {
            "title": "We Are Transforming Your Lives, Claims Mnangagwa’s Personal Friend Owen Ncube",
            "url": "https://www.zimeye.net/2024/12/17/we-are-transforming-your-lives-claims-mnangagwas-personal-friend-owen-ncube/",
            "content": "By A Correspondent\n\nOwen Mudha Ncube, the Minister of State for Provincial Affairs and Devolution in the Midlands Province, has claimed that the new dispensation under President Emmerson Mnangagwa is working tirelessly to improve the lives of Zimbabwean citizens.\n\nSpeaking at the recent commissioning of the Gweru Provincial Hospitals ZERA LED Retrofit Project, Ncube welcomed the Minister of Energy and Power Development, Hon. Edgar Moyo, and other distinguished guests to the Midlands Province, highlighting the importance of the project.\n\nIt is an honor and privilege for me to warmly welcome our Guest of Honour, the Minister of Energy and Power Development, Hon. Edgar Moyo, and all invited guests to the Midlands Province on this auspicious occasion of the commissioning of the Gweru Provincial Hospital LED Retrofit Project, Ncube said.\n\nHe noted that the commissioning of the LED Retrofit Project marks a significant step towards promoting energy efficiency and adopting alternative energy technologies, aligning with the broader goals of modernization and industrialization under the governments Vision 2030. Ncube highlighted that this vision aims to achieve an upper-middle-income society by 2030, as outlined by President Mnangagwa.\n\nHon Minister, I am pleased to note that following my launch of this LED retrofitting project on the 21st of October 2024, ZERA moved with speed to complete the project in a record 3 months. This attests to ZERAs adherence to the Second Republics work ethics of timely and results-oriented implementation of programs and projects, in line with the goal of achieving universal access to sustainable energy before 2030, Ncube remarked.\n\nThe Minister further commended ZERA for decentralizing its operations to the Midlands Province to ensure that no one and no place is left behind in efforts to transform communities and grow the economy. He also praised ZERA for establishing an electric car charging point at the Petro-trade Fuel Service Station in Gweru, aligning with the countrys goal to embrace global energy trends.\n\nHonourable Minister, energy efficiency is our low-hanging fruit that creates excess power for the productive sectors of our economy, such as mining, agriculture, construction, manufacturing, and tourism, which are crucial for GDP growth in the Midlands Province, Ncube said. He also highlighted the importance of the provinces abundant lithium deposits, which contribute to the energy value chain through value addition and beneficiation.\n\nNcube commended the Ministry of Energy and Power Development for advancing energy access in the Midlands Province, citing the successful connection of 957 public institutions through the Rural Electrification Fund (REA). Additionally, Ncube praised REAs efforts in promoting alternative energy technologies, including the deployment of 66 solar mini-grids, 47 solar units, and 16 biogas digesters in the province.\n\nAs part of our commitment to transforming the livelihoods of communities, we continue to focus on ensuring access to quality and affordable social services, such as health, education, and rural development, Ncube noted.\n\nHe also lauded the groundbreaking construction of a USD 1 billion, 720-megawatt coal thermal power plant by Titan New Energy in partnership with ZESA, which is expected to eliminate load shedding in Zimbabwe.\n\nIn conclusion, Ncube urged Gweru General Hospital and all stakeholders present to actively participate in energy efficiency initiatives and safeguard the investments being made. He expressed gratitude to ZERAs Board, management, and staff for successfully lighting up Gweru Provincial Hospital.\n\nWith these few remarks, I heartily welcome our Guest of Honour and everyone here present. Enjoy our warm hospitality, Ncube concluded.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Owen Mudha Ncube, the Minister of State for Provincial Affairs and Devolution in the Midlands Province, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/17/we-are-transforming-your-lives-claims-mnangagwas-personal-friend-owen-ncube/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Transforming Your Lives, Claims Mnangagwa’s Personal Friend Owen Ncube\"</span></a></p>",
            "time": "20:38",
            "date": "17 Dec 2024"
        }
    ]
}