{
    "news": [
        {
            "title": "Warriors Coach Optimistic Ahead of Benin Clash",
            "url": "https://www.zimeye.net/2025/03/20/warriors-coach-optimistic-ahead-of-benin-clash/",
            "content": "By A Correspondent\n\nZimbabwes national football team, the Warriors, are gearing up to face Benin in a crucial 2026 World Cup Qualifiers Group C encounter this evening. Despite a slow start to the campaign, coach Michael Nees remains confident that his side can secure a positive result.\n\nThe match is set to take place at the Moses Mabhida Stadium in Durban, South Africa, with kick-off scheduled for 6 pm CAT. Zimbabwe currently sits at the bottom of Group C, having picked up just two points in their first four games.\n\nHowever, Nees believes that his team has the potential to turn their fortunes around. Speaking at a press conference on Wednesday, he expressed his optimism, stating, I think we can be confident and positive going into this match without being overconfident, with focus and concentration.\n\nNees emphasized the importance of executing a solid game plan, saying, If we bring our best into the match, we can be successful. Its very simple. We have to throw in the best possible plan to get a win and reduce the gap.\n\nA win would be crucial for the Warriors, as a draw would do little to improve their current standing.\n\nBenin currently tops Group C with seven points after four games, making this evenings match a must-win for Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s national football team, the Warriors, are gearing up to face Benin in a crucial 2026 World … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/warriors-coach-optimistic-ahead-of-benin-clash/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Coach Optimistic Ahead of Benin Clash\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Zimbabwe Government Offers Warriors $300,000 Winning Bonus Ahead of World Cup Qualifiers",
            "url": "https://www.zimeye.net/2025/03/20/zimbabwe-government-offers-warriors-300000-winning-bonus-ahead-of-world-cup-qualifiers/",
            "content": "Sports Correspondent\n\nIn a significant show of support, the Government of Zimbabwe has offered the national football team, the Warriors, a winning bonus of $150,000 ahead of their crucial 2026 FIFA World Cup Qualifiers match against Benin this evening.\n\nThe team will also receive an additional $150,000 winning bonus for their next match against Nigeria on Monday.\n\nThe Warriors, who have struggled in the campaign with only two points from four games, will host Benin in Durban, South Africa, with kick-off scheduled for 6 pm CAT.\n\nThe team is eager to secure their first win ahead of the restart of the qualifiers.\n\nThe Governments offer was confirmed by ZIFA in a statement, highlighting President Emmerson D. Mnangagwas commitment to national football.\n\nThe statement emphasized that the bonus is a gesture of encouragement and recognition of the teams efforts.\n\nIf the Warriors secure wins in both fixtures, they stand to earn an extra $300,000, in addition to the $1 million set aside by the Government for the CAF Africa Cup of Nations Finals.\n\nThis significant financial support underscores the Governments commitment to the growth and success of football in Zimbabwe .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a significant show of support, the Government of Zimbabwe has offered the national football team, the Warriors, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/zimbabwe-government-offers-warriors-300000-winning-bonus-ahead-of-world-cup-qualifiers/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe Government Offers Warriors $300,000 Winning Bonus Ahead of World Cup Qualifiers\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Why You Need To Avoid Speeding . ..",
            "url": "https://www.zimeye.net/2025/03/20/why-you-need-to-avoid-speeding/",
            "content": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in an instant.\n\nEach time you choose to drive above the speed limit, you are not only endangering yourself but also putting others at risk. Speeding kills, disables, and causes heartache, leaving behind broken families and shattered lives. Its essential to understand the profound impact of your actions on the road and the ripple effect they can have on others.\n\nOne of the most tragic consequences of speeding is the loss of life. Car accidents are a leading cause of death worldwide, and speed is often a contributing factor. When drivers exceed the speed limit, they decrease their ability to react to sudden changes in road conditions, such as pedestrians crossing, animals running into the road, or other vehicles making unexpected movements. At higher speeds, the impact of a collision is much more severe, increasing the chances of fatalities or life-altering injuries.\n\nThe consequences extend far beyond the driver. A fatal or serious crash caused by speeding can leave children without parents, spouses without partners, and entire families grieving. Imagine the pain and suffering that your loved ones would endure if you were taken from them because of your reckless decision behind the wheel. Your family loves you and wants you to come home safely at the end of each day. They depend on you, and speeding compromises that promise.\n\nMoreover, speeding can lead to long-term disabilities for both drivers and other road users. Survivors of high-speed crashes often face permanent injuries, which can affect their ability to work, care for their families, or live independently. These injuries are not just physical; they can also have a psychological toll, leading to trauma, depression, and a diminished quality of life. The emotional and financial burden of recovery falls not only on the individual but also on their family and community.\n\nRespecting road laws and driving responsibly isnt just about following rules; its about ensuring the safety of everyone on the road. There are countless other drivers, pedestrians, cyclists, and motorcyclists sharing the same roads as you, and their lives are just as important. Your behavior behind the wheel affects them directly. Driving carefully and within speed limits is a basic way of showing respect for the lives and safety of others. By choosing to drive responsibly, youre helping to create a safer, more considerate driving environment for everyone.\n\nWe all have a responsibility to ensure that our actions on the road do not harm others. Every life is precious, and the impact of speeding is far-reaching. It can change your life forever and leave scars on those around you. So, before you accelerate, take a moment to think about the consequences. Your loved ones, the people around you, and even strangers on the road depend on you making the right choice. Drive safely, follow the speed limits, and remember that speeding kills. Its not just a statistic  its a reality we can all prevent.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/why-you-need-to-avoid-speeding/\">Continue reading<span class=\"screen-reader-text\"> \"Why You Need To Avoid Speeding . ..\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Broke Government Fails to Pay Pensioners",
            "url": "https://www.zimeye.net/2025/03/20/broke-government-fails-to-pay-pensioners/",
            "content": "By A Correspondent\n\nThe administration of President Emmerson Mnangagwa is facing increasing pressure as it struggles to settle outstanding payments owed to pensioners.\n\nThis issue was brought to the forefront by Mbizo Constituency Member of Parliament, Honourable Corban Madzivanyika, who criticized the governments failure to meet its financial obligations to retirees.\n\nOn Wednesday, Hon. Madzivanyika highlighted the severity of the situation, calling it a serious eyesore for the country. In a statement, he called on both the Ministry of Finance and the Insurance and Pensions Commission (IPEC) to take urgent action. He said:\n\nThe plight of our pensioners is a serious eyesore! The Ministry of Finance and IPEC must urgently expedite this process instead of dodging questions. Our old men and women deserve adequate compensation that corresponds to the blameworthiness of the government and pension companies to enjoy it while the sun still shines, according to the Justice Smith Commission report of 2015.\n\nHon. Madzivanyikas comments reflect the frustrations of pensioners who have long been waiting for compensation that reflects the value of their contributions over the years. Despite repeated calls for action, both pensioners and concerned citizens continue to face delays, leaving many elderly Zimbabweans in financial distress.\n\nThe Justice Smith Commission report of 2015 recommended measures to address the pensioners issues, yet little progress has been made since its release. The MPs appeal to expedite the compensation process emphasizes the urgency of resolving the situation before it worsens.\n\nPensioners, many of whom rely on these funds for their daily survival, are left in a state of uncertainty as the government struggles with financial constraints. The failure to address this issue is exacerbating the sense of neglect felt by Zimbabwes retired citizens.\n\nAs the pressure mounts on the Mnangagwa administration, the need for swift action on pension payments becomes more critical. Without prompt intervention, pensioners are left to face a grim reality of inadequate financial support in their twilight years.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The administration of President Emmerson Mnangagwa is facing increasing pressure as it struggles to settle outstanding payments … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/broke-government-fails-to-pay-pensioners/\">Continue reading<span class=\"screen-reader-text\"> \"Broke Government Fails to Pay Pensioners\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Mnangagwa’s Cash Donation to Warriors: A Blessing or a Curse?",
            "url": "https://www.zimeye.net/2025/03/20/mnangagwas-cash-donation-to-warriors-a-blessing-or-a-curse/",
            "content": "President Emmerson Mnangagwas $150,000 winning bonus for the Zimbabwe Warriors ahead of their FIFA World Cup qualifiers against Benin and Nigeria has sparked debate. On one hand, the generous offer is a testament to the governments commitment to national football and the teams aspirations for World Cup qualification . The bonus, which will be awarded to the players, technical team, and support staff for each victory, serves as a morale booster for the team.\n\nHowever, some might argue that this donation could be a curse in disguise. With the teams current ranking at sixth in Group C, the pressure to secure victories in both matches and claim the full $300,000 bonus might be overwhelming. This added pressure could potentially negatively impact the teams performance.\n\nAdditionally, the timing of the donation raises questions. Is this a genuine attempt to support the team, or a political move to gain popularity? The fact that this amount is in addition to the $1 million already set aside by the government for the CAF Africa Cup of Nations Finals adds to the skepticism.\n\nUltimately, only time will tell if Mnangagwas cash donation will prove to be a blessing or a curse for the Warriors.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "President Emmerson Mnangagwa’s $150,000 winning bonus for the Zimbabwe Warriors ahead of their FIFA World Cup qualifiers against Benin and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/mnangagwas-cash-donation-to-warriors-a-blessing-or-a-curse/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Cash Donation to Warriors: A Blessing or a Curse?\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Hip-hop Artist Holy Tears Into Uebert Angel: Aindikumbira Mababe",
            "url": "https://www.zimeye.net/2025/03/20/hip-hop-artist-holy-tears-into-uebert-angel-aindikumbira-mababe/",
            "content": "By A Correspondent\n\nZimbabwean hip-hop artist Holy Ten has accused Uebert Angel, the countrys Ambassador-at-Large to Europe and the Americas, of inappropriate behavior and misconduct within his church.\n\nIn an explosive interview on DJ Ollah 7s podcast, Holy Ten detailed troubling allegations, claiming that Angel repeatedly asked him to find young women for his personal pleasure.\n\nHoly Ten further accused gospel musician Mudiwa Hood, a close associate of Angel, of bringing firearms and condoms into the church. The artists revelations paint a picture of significant disillusionment with Angel, who he once admired.\n\nI was first inspired to pray by Uebert Angel. I used to watch his sermons. But for him to turn into someone who asks me to find slay queens was the worst thing ever, Holy Ten shared during the podcast. The rapper revealed his shock and disappointment, stating that what was once an inspiration had now turned into a source of distress.\n\nHoly Ten also recalled a disturbing incident during a visit to Angels church, where he alleges that Mudiwa Hood showed him a gun and then revealed a stash of condoms from his bag. I swear I will never go back to that church again. You can even ask my crew. Those people are not who they claim to be, he declared, expressing his deep frustration and disillusionment with the churchs leaders.\n\nThese allegations come two years after Uebert Angel was implicated in the Al Jazeera Gold Mafia documentary, which exposed illegal gold smuggling and money laundering schemes operating in Southern Africa. In the documentary, Angel was secretly recorded bragging about his ability to launder over US$1 billion, exploiting his diplomatic immunity.\n\nNeither Uebert Angel nor Mudiwa Hood has publicly responded to Holy Tens accusations, leaving the allegations to circulate without comment from the accused. Nonetheless, the artists claims have sparked a significant public debate, with many calling for further investigations into Angels activities, both within his church and in relation to the allegations of financial misconduct.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean hip-hop artist Holy Ten has accused Uebert Angel, the country’s Ambassador-at-Large to Europe and the Americas, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/hip-hop-artist-holy-tears-into-uebert-angel-aindikumbira-mababe/\">Continue reading<span class=\"screen-reader-text\"> \"Hip-hop Artist Holy Tears Into Uebert Angel: Aindikumbira Mababe\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Dejected Mnangagwa Launches Presidential Youth Empowerment Scheme",
            "url": "https://www.zimeye.net/2025/03/20/dejected-mnangagwa-launches-presidential-youth-empowerment-scheme/",
            "content": "By A Correspondent\n\nIn a move aimed at addressing rising discontent, President Emmerson Mnangagwa launched the Presidential Youth Empowerment Scheme in Harare on Thursday morning, amidst increasing pressure from war veterans demanding his immediate resignation.\n\nThe war veterans, led by Blessed Geza Bombshell, have openly called for Mnangagwas resignation, accusing him of undermining the constitution. On Tuesday night, Geza urged citizens to stage protests against what he described as Mnangagwas efforts to subvert the countrys legal framework.\n\nDespite the mounting political pressure, thousands of youths from across the country gathered at the Harare International Conference Centre to witness the launch of the much-anticipated Presidential Youth Empowerment Scheme, where President Mnangagwa was expected to officially unveil the initiative.\n\nThe event saw a thunderous arrival of President Mnangagwa, with thousands of enthusiastic youth chanting slogans in his support. 2030 Ndeya Emmerson!! and Kutonga Kwaro Gamba Is Unstoppable 2030 Pfeee Gezaa Tsaa, echoed through the venue as the president made his entrance, signaling the high expectations and enthusiasm surrounding the youth empowerment initiative.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move aimed at addressing rising discontent, President Emmerson Mnangagwa launched the Presidential Youth Empowerment Scheme … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/dejected-mnangagwa-launches-presidential-youth-empowerment-scheme/\">Continue reading<span class=\"screen-reader-text\"> \"Dejected Mnangagwa Launches Presidential Youth Empowerment Scheme\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Eight Critically Injured In DZ Blackspot Accident",
            "url": "https://www.zimeye.net/2025/03/20/eight-critically-injured-in-dz-blackspot-accident/",
            "content": "By Crime and Courts, Reporter-Eight people have been critically injured in Wednesdays deadly traffic in Dzivaresekwa that also claimed seven lives\n\nThree cars collided, resulting in the accident.\n\nA local witness, Hebert Karimazondo, who narrowly escaped the tragedy, has called on authorities to install speed humps to prevent further loss of life.I cannot believe I survived. I was supposed to be among the victims, he said.Karimazondo had chased after the speeding kombi in Dzivaresekwa, hoping to board, but the driver failed to notice him.When the accident happened, my neighbor, Mai Alice, called my name at the scene, thinking I was among the victims, he added.According to Karimazondo, the spot has become notorious for deadly crashes.This is the third fatal accident here in just five months. The traffic lights are not working, and drivers wont slow down unless speed humps are installed.Eyewitnesses say a speeding UD truck, attempting to switch lanes, slammed into the kombi, which had reversed to pick up a passenger.A woman carrying day-old chicks was injured in the crash. Only one chick survived, while she was rushed to the hospital, Karimazondo recounted.Residents now fear more deaths if urgent action is not taken.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts, Reporter-Eight people have been critically injured in Wednesday’s deadly traffic in Dzivaresekwa that also claimed seven … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/eight-critically-injured-in-dz-blackspot-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Eight Critically Injured In DZ Blackspot Accident\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Bus Company Shuns Zim Roads Due To Inaccessibility",
            "url": "https://www.zimeye.net/2025/03/20/bus-company-shuns-zim-roads-due-to-inaccessibility/",
            "content": "By A Correspondent\n\nLikili Bus Company has raised serious concerns about the state of Zimbabwes roads, citing their poor condition as a major hindrance to operations.\n\nAs a result, the company has decided to adopt alternative routes to ensure the safety of its passengers and the protection of its property.\n\nIn a statement issued on Tuesday, Likili Bus Company announced that it will no longer use the Chirundu border for its cross-border services due to deteriorating road conditions in Zimbabwe. The company also indicated that it would now be utilizing the Victoria Falls border as an alternative route.\n\nThe statement, directed at all cross-border clients, read:\n\nATT: All CROSS BORDER CLIENTSBe informed that all Likili Motors Buses from Johannesburg entry to Zambia will be using Vic Falls Border, we will avoid Chirundu Border until further notice.\n\nThe bus company further clarified that the decision was motivated by concerns over road safety. The statement highlighted that poor road conditions on the Zimbabwean side of the border posed risks to both the companys vehicles and passengers, prompting the management to find a safer route.\n\nThis is due to some bad roads on the Zimbabwean side and in order to protect property and safety of our passengers, the company added in the notice.\n\nIn light of these challenges, Likili Motors has taken proactive measures to ensure uninterrupted service for its clients while prioritizing the safety and well-being of passengers. While the company has not yet provided a timeline for the resumption of services via the Chirundu border, the current focus remains on safer alternatives for the foreseeable future.\n\nThe decision by Likili Motors underscores the growing concerns about the state of infrastructure in Zimbabwe, which has been under scrutiny for some time.\n\nRoad conditions in the country have long been a source of frustration for both local and international travelers, with poor maintenance and the wear and tear of major roads contributing to numerous accidents and delays.\n\nLikili Motors move to bypass one of Zimbabwes key borders reflects a broader issue facing the countrys transportation sector, which has been struggling to maintain the infrastructure necessary to support a growing demand for road travel.\n\nAs Zimbabwe continues to grapple with these infrastructure challenges, the governments response and potential solutions remain a critical aspect of the countrys ability to retain and attract cross-border businesses like Likili Bus Company.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Likili Bus Company has raised serious concerns about the state of Zimbabwe’s roads, citing their poor condition … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/bus-company-shuns-zim-roads-due-to-inaccessibility/\">Continue reading<span class=\"screen-reader-text\"> \"Bus Company Shuns Zim Roads Due To Inaccessibility\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        },
        {
            "title": "Geza Colleague Gomwe’s House Vandalised",
            "url": "https://www.zimeye.net/2025/03/20/geza-colleague-gomwes-house-vandalised/",
            "content": "By A Correspondent | ZimEye | A top colleague of war veteran Blessed Gezas Gifford Gomwe s home was last night reportedly vandalised.\n\nIve just received information that my house in Zvimba has been vandalised all the glasses have been smashed and the vehicle parked there also smashedaround 12 midnight, Gomwe who was recently fired from ZANU with Blessed Geza, told ZimEye.\n\nThis follows a recent threat from (ZANU PF Provincial Chairperson) Mary Mliswa who once said to me Gomwe wapinda mukanwa meShumba,  he added.\n\nFurther details were not available at the time of writing.\n\nMary Mliswa was reached for comment and she said, Gifford Gomwe is a liar and is very good at creating stories Simba. I have never communicated with him neither have I ever threatened him.\n\n I have not received the report above at all. You know me better, she added.\n\nThis is a developing article.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | A top colleague of war veteran Blessed Geza’s Gifford Gomwe ‘s home was last … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/20/geza-colleague-gomwes-house-vandalised/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Colleague Gomwe’s House Vandalised\"</span></a></p>",
            "time": "06:30",
            "date": "21 Mar 2025"
        }
    ]
}