{
    "news": [
        {
            "title": "Ok Zimbabwe Closes Five Branches",
            "url": "https://www.zimeye.net/2025/02/01/ok-zimbabwe-closes-five-branches/",
            "content": "By Business Reporter- Zimbabwes largest retailer, OK Zimbabwe, has shut down five outlets nationwide, citing a harsh trading environment and mounting financial pressures.\n\nThe closures come just weeks after rival retailer N Richards shuttered two stores in Harare, signalling deepening distress in the formal retail sector.\n\nAt the heart of OK Zimbabwes troubles is its inability to restock, with many of its stores running out of essential food items.\n\nSuppliers, wary of local currency payments and unpaid debts, have cut off credit lines.\n\nThe retailer reportedly owes US$17 million and ZiG537 million in outstanding payments, with some suppliers withholding fresh stock until previous debts are cleared.\n\nIn an internal memo, OK Zimbabwe announced it would shut down Robson Manyika, Glen Norah, Kuwadzana Express, Mbare (all in Harare), Chitungwiza Town Centre, and Entumbane (Bulawayo). Another store is set to close in March 2025.\n\nThe closures will result in job losses, with hundreds of employeesmainly low-level stafffacing retrenchment starting March 31, 2025.\n\nAffected workers have been offered severance packages, including one months salary per year served, three months notice pay, and outstanding leave payments.\n\nHowever, sources say it remains unclear whether employees have accepted these terms.\n\nCompany executives attribute the crisis to Zimbabwes volatile economic environment, particularly its currency challenges.\n\nOK Zimbabwe acquired goods on credit in US dollars but is struggling to settle payments due to cash flow constraints.\n\nThe companys woes were exacerbated by last years currency turmoil, which led to the reintroduction of the Zimbabwe Gold (ZiG) currency in April.\n\nDespite some stabilization, the retailer has yet to recover.\n\nAnother major challenge is competition from informal traders, who have gained a market advantage by offering lower prices, paying cash in US dollars, and avoiding taxes and regulatory costs.\n\nThe Confederation of Zimbabwe Retailers (CZR) has called on President Emmerson Mnangagwa to intervene, warning that continued closures threaten the survival of the formal retail sector.\n\nFormal businesses are struggling against an unfairly competitive informal sector that does not pay taxes. The government must act, CZR president Denford Mutashu said.\n\nOK Zimbabwe has also tied up capital in land acquisitions for future stores, including sites in Mutoko, Southly Park (Harare), Guruve, Kadoma, and Gwerufunds that could have helped stabilize operations.\n\nCEO Maxen Karombo declined to comment when contacted, requesting questions via email but failing to respond.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter- Zimbabwe’s largest retailer, OK Zimbabwe, has shut down five outlets nationwide, citing a harsh trading environment and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/ok-zimbabwe-closes-five-branches/\">Continue reading<span class=\"screen-reader-text\"> \"Ok Zimbabwe Closes Five Branches\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "Operation No Mushikashika Continues",
            "url": "https://www.zimeye.net/2025/02/01/operation-no-mushikashika-continues/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has arrested 10 suspected armed robbers who used pirate taxis to target and rob passengers. The suspects, aged between 26 and 51, were identified as Liberty Matsika, Temptation Mazodze, Blessing Murize, Rodgers Marufu, Golden Tangwanda, Admire Makumalo, Ashely Bakasa, Ndoro Chiriwa Zambezi, Stanley Matarutse, and Nyasha Kamujoma.\n\nThe arrest comes after a string of robberies, according to ZRP spokesperson Assistant Commissioner Paul Nyathi. This operation is part of a broader crackdown on pirate taxis and lawlessness on the roads, which has seen over 6,500 kombis and 190 touts arrested so far .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has arrested 10 suspected armed robbers who used pirate taxis to target … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/operation-no-mushikashika-continues/\">Continue reading<span class=\"screen-reader-text\"> \"Operation No Mushikashika Continues\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "Remembering Veteran Journalist",
            "url": "https://www.zimeye.net/2025/02/01/remembering-veteran-journalist/",
            "content": "By A Correspondent\n\nZvikomborero Sibanda, a renowned journalist and former ZBCTV Breakfast News anchor, has passed away at the age of 46. She died in Bulawayo after a prolonged battle with fibroid-related complications.\n\nBorn on April 5, 1978, in Bulawayo, Sibanda began her journalism career with the Chronicle before joining ZBC. She is survived by her husband.\n\nHer brother, Stephen Sibanda, remembered her as a unifying force in their family. Growing up, she was always a lively child who ensured the family remained united, he said. Sibanda was the fifth of seven siblings, and her brother praised her for playing many important roles in their lives.\n\nSibandas passing has sent shockwaves through the journalism community, with colleagues and friends paying tribute to her remarkable career and personality.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zvikomborero Sibanda, a renowned journalist and former ZBCTV Breakfast News anchor, has passed away at the age … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/remembering-veteran-journalist/\">Continue reading<span class=\"screen-reader-text\"> \"Remembering Veteran Journalist\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "Garwe Threatens To Unmask Force Behind War Veteran Geza",
            "url": "https://www.zimeye.net/2025/02/01/garwe-threatens-to-unmask-force-behind-war-veteran-geza/",
            "content": "By A Correspondent\n\nThe Minister of Local Government and Public Works, Daniel Garwe, has warned that the ruling party will soon take decisive action against war veteran Blessing Geza. During a meeting with civil servants in Masvingo on Thursday, Garwe threatened Geza, saying, Blessing Geza ndiBhoki, saka takurova Bhoki tiwone kuti akatumwa nani. Pane akatuma Bhoki kuti ataure zvisina basa, which translates to Blessing Geza is a puppet, so we will deal with him and see who sent him. Someone is controlling him to speak nonsense.\n\nGeza, who is a war veteran, caused a stir last week when he held a press conference attacking senior ZANU PF and government officials, including President Emmerson Mnangagwa. While Geza did not specify who he referred to as his master, speculation remains about the internal factions within the party.\n\nGarwe made it clear to civil servants and ZANU PF supporters gathered at Masvingo Polytechnic that Geza is being manipulated by someone from within the party. Geza is being controlled by a master, and he is going to be jailed over corruption, Garwe said, reinforcing the governments stance against the war veterans allegations and statements.\n\nAdditionally, Garwe took the opportunity to praise U.S. President Donald Trump for his plan to send back 504 Zimbabweans who are reportedly illegally staying in the USA.\n\nGarwe expressed approval of the move, saying, Let them come back home, and added that these individuals were among those attacking Mnangagwa on social media.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Minister of Local Government and Public Works, Daniel Garwe, has warned that the ruling party will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/garwe-threatens-to-unmask-force-behind-war-veteran-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Garwe Threatens To Unmask Force Behind War Veteran Geza\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "Man Kills Wife With Switch",
            "url": "https://www.zimeye.net/2025/02/01/man-kills-wife-with-switch/",
            "content": "By A Correspondent\n\nA gruesome murder case has shaken the community of Gutu in Masvingo Province.\n\nNehemiah Mukaro, 26, from Village Humarikwa, Chief Gutu, has been charged with murder after allegedly killing his wife, Mitchelle Madzivadondo, 27, for drinking Mahewu from a neighbours house.\n\nAccording to Gutu police, the trouble began on January 15, 2025, when Mitchelle had Mahewu from a neighbours house, angering Nehemiah.\n\nThe couple started quarreling, and Nehemiah allegedly used a switch to assault Mitchelle, whipping her all over her body.\n\nMitchelle reported the incident to her father-in-law, Sungai Mudonhi, who took her to Gutu Mission Hospital.\n\nShe was later transferred to Parirenyatwa Hospital in Harare, where she tragically passed away on January 27, 2025, due to the injuries she sustained during the assault.\n\nNehemiah was arrested on January 18, 2025, after a police report was filed for domestic violence.\n\nHe appeared before the Gutu Magistrate and was remanded in custody.\n\nThe incident has left the community in shock, highlighting the dangers of domestic violence and the devastating consequences of unchecked anger.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A gruesome murder case has shaken the community of Gutu in Masvingo Province. Nehemiah Mukaro, 26, from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/man-kills-wife-with-switch/\">Continue reading<span class=\"screen-reader-text\"> \"Man Kills Wife With Switch\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "Mnangagwa In Bid To Solidify Grip On Power",
            "url": "https://www.zimeye.net/2025/02/01/mnangagwa-in-bid-to-solidify-grip-on-power/",
            "content": "By A Correspondent\n\nIn a move that has sparked mixed reactions, President Emmerson Mnangagwa has named a new law school after himself, further solidifying his presence in Zimbabwes political and educational landscape. The E.D. Mnangagwa Law School, currently under construction at Midlands State University, is set to be one of the premier institutions for legal education in the region once completed.\n\nThe project is 65% finished and is expected to be ready by August.\n\nDuring a recent tour of the site, Hon. Ministers Owen Ncube and Jenfan Muswere praised the progress of the development, which will feature four key expansions.\n\nThis is a showcase of the progress we are making under the visionary leadership of President Mnangagwa, said Ncube, highlighting the schools state-of-the-art facilities, including a moot court and a comprehensive library resource center.\n\nThe law school is part of Mnangagwas broader agenda to strengthen Zimbabwes legal education and contribute to the countrys long-term goals, as outlined in Resolution number 1. This is a clear demonstration of our commitment to educational advancement and legal reform, Muswere noted during the tour.\n\nWhile the law school is seen as a positive step forward for Zimbabwes educational infrastructure, some critics argue that naming such a significant institution after himself sends a message that Mnangagwa is unwilling to cede power anytime soon.\n\nHis historical contributions to Zimbabwes legal framework, coupled with the school bearing his name, have led to concerns about the growing centralization of power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a move that has sparked mixed reactions, President Emmerson Mnangagwa has named a new law school … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/mnangagwa-in-bid-to-solidify-grip-on-power/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa In Bid To Solidify Grip On Power\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "Real Madrid, Man City Clash Again In UEFA Champions League",
            "url": "https://www.zimeye.net/2025/02/01/real-madrid-man-city-clash-again-in-uefa-champions-league/",
            "content": "By A Correspondent\n\nThe UEFA Champions League knockout phase play-offs are set to kick off, featuring some of the biggest clubs in European football.\n\nManchester City will face off against Real Madrid in one of the highly anticipated matches.\n\nOther exciting clashes include Juventus vs PSV Eindhoven, Monaco vs Benfica, and Sporting CP vs Dortmund. Celtic will take on Bayern Munich, while Feyenoord will face AC Milan.\n\nIn other matches, Club Brugge will meet Atalanta, and Brest will face PSG. The Champions League play-offs promise to deliver thrilling football action, with some of the best teams in Europe vying for a spot in the next round.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The UEFA Champions League knockout phase play-offs are set to kick off, featuring some of the biggest … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/real-madrid-man-city-clash-again-in-uefa-champions-league/\">Continue reading<span class=\"screen-reader-text\"> \"Real Madrid, Man City Clash Again In UEFA Champions League\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "Tributes Pour in for Late ZBC TV Anchor Zvikomborero Sibanda",
            "url": "https://www.zimeye.net/2025/02/01/tributes-pour-in-for-late-zbc-tv-anchor-zvikomborero-sibanda/",
            "content": "By A Correspondent\n\nZvikomborero Sibanda, a renowned journalist and former ZBCTV Breakfast News anchor, has passed away at the age of 46. She died in Bulawayo after a prolonged battle with fibroid-related complications.\n\nBorn on April 5, 1978, in Bulawayo, Sibanda began her journalism career with the Chronicle before joining ZBC. She is survived by her husband.\n\nHer brother, Stephen Sibanda, remembered her as a unifying force in their family. Growing up, she was always a lively child who ensured the family remained united, he said. Sibanda was the fifth of seven siblings, and her brother praised her for playing many important roles in their lives.\n\nSibandas passing has sent shockwaves through the journalism community, with colleagues and friends paying tribute to her remarkable career and personality.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zvikomborero Sibanda, a renowned journalist and former ZBCTV Breakfast News anchor, has passed away at the age … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/tributes-pour-in-for-late-zbc-tv-anchor-zvikomborero-sibanda/\">Continue reading<span class=\"screen-reader-text\"> \"Tributes Pour in for Late ZBC TV Anchor Zvikomborero Sibanda\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "ZRP Nabs Robbers Posing As Pirate Taxi Drivers",
            "url": "https://www.zimeye.net/2025/02/01/zrp-nabs-robbers-posing-as-pirate-taxi-drivers/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has arrested 10 suspected armed robbers who used pirate taxis to target and rob passengers.\n\nThe suspects, aged between 26 and 51, were identified as Liberty Matsika, Temptation Mazodze, Blessing Murize, Rodgers Marufu, Golden Tangwanda, Admire Makumalo, Ashely Bakasa, Ndoro Chiriwa Zambezi, Stanley Matarutse, and Nyasha Kamujoma.\n\nThe arrest comes after a string of robberies, according to ZRP spokesperson Assistant Commissioner Paul Nyathi.\n\nThis operation is part of a broader crackdown on pirate taxis and lawlessness on the roads, which has seen over 6,500 kombis and 190 touts arrested so far .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has arrested 10 suspected armed robbers who used pirate taxis to target … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/01/zrp-nabs-robbers-posing-as-pirate-taxi-drivers/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Nabs Robbers Posing As Pirate Taxi Drivers\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        },
        {
            "title": "DeMbare Boss Acquitted",
            "url": "https://www.zimeye.net/2025/01/31/dembare-boss-acquitted/",
            "content": "By A Correspondent\n\nHarare magistrate Yeukai Dzuda has cleared Dynamos Football Club founding member Bernard Marriott Lusengo of allegations of corruptly acquiring 51% shareholding in the club.\n\nThe magistrate ruled that the complainants didnt qualify as former players according to the clubs 1963 Constitution, as none of them played for Dynamos during its formation.\n\nLusengos defense argued that the complainants werent entitled to shares, and he claimed to be the only surviving founder of the club. He also stated that the 1963 constitution was repealed and replaced with articles of association.\n\nThe State had accused Lusengo of declaring himself chairman and violating a High Court order that granted each founder 1% share. However, the court found insufficient evidence to prove fraud charges against Lusengo, leading to his acquittal.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare magistrate Yeukai Dzuda has cleared Dynamos Football Club founding member Bernard Marriott Lusengo of allegations of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/31/dembare-boss-acquitted/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Boss Acquitted\"</span></a></p>",
            "time": "06:35",
            "date": "02 Feb 2025"
        }
    ]
}