{
    "news": [
        {
            "title": "Another Top Actress Dies",
            "url": "https://www.zimeye.net/2024/12/21/another-top-actress-dies/",
            "content": "South Africa- The country is mourning the loss of another beloved Isidingo star.\n\nMichelle Botes, known for her iconic role as Cherel de Villiers in the SABC3 soapieIsidingo, passed away on Saturday after a battle with cancer.\n\nShe was 62.\n\nHer agent, Suzi Howes, confirmed the news, expressing deep sorrow over her death.\n\nBoteswas celebratedforher portrayal ofthe cunning and complex Cherel de Villiers Haines, a character she brought to life with unmatched brilliance.\n\nShe first joinedIsidingoin 1998, captivating audiences for nine years before returning in 2009 for another stint on the show.\n\nBorn on October 12, 1962, in Cape Town, Botes completed her high school education in the city before earning aBachelorsDegree in Speech and Drama.\n\nHer illustrious career spanned decades, featuring roles in numerous films and TV series that cemented her as a household name in South African entertainment.\n\nBotespassing follows the recent death of another actress, Connie Chiume, a veteran actor who appeared in the Marvel film Black Panther in August.\n\nThe multi-award-winning actress starred in several South African TV shows, including Rhythm City, Zone 14 and Gomora.\n\nFans and colleagues have taken to social media to pay tribute to Botes, remembering her as a talented actress whose performances left an indelible mark on thenationscultural landscape.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa- The country is mourning the loss of another beloved Isidingo star.  Michelle Botes, known for her iconic role … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/another-top-actress-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Another Top Actress Dies\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Cde Kerina: Masoja nemaCIO, Nguva Yasvika",
            "url": "https://www.zimeye.net/2024/12/21/cde-kerina-masoja-nemacio-nguva-yasvika/",
            "content": "Dambudzo rapinda muZimbabwe ndiMnangagwa. Munhu iyeyu inyoka. Kutomuti inyoka kutuka nyoka nokuti kuipa kwemwoyo wake kwakaipa kupfuura kwenyoka inoruma chaisingadye. Zvimwe zvezvinhu zvinoratidza kuipa kwemunhu uyu ndezvizvi.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dambudzo rapinda muZimbabwe ndiMnangagwa. Munhu iyeyu inyoka. Kutomuti inyoka kutuka nyoka nokuti kuipa kwemwoyo wake kwakaipa kupfuura kwenyoka inoruma chaisingadye. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/cde-kerina-masoja-nemacio-nguva-yasvika/\">Continue reading<span class=\"screen-reader-text\"> \"Cde Kerina: Masoja nemaCIO, Nguva Yasvika\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Rey Mysterio Dies",
            "url": "https://www.zimeye.net/2024/12/21/rey-mysterio-dies/",
            "content": "By A Correspondent\n\nRey Mysterio Sr., a celebrated Mexican wrestler and uncle of WWE superstar Rey Mysterio Jr., has passed away at the age of 66, according to a statement from his family on December 20, 2024.\n\nMysterio Sr. was a prominent figure in Mexicos lucha libre scene, securing championship titles with prestigious organizations such as the World Wrestling Association and Lucha Libre AAA Worldwide, often compared to WWE in the U.S. His legacy extended beyond Mexico, with notable international appearances, including World Championship Wrestlings Starrcade event in 1990. Known for his acrobatic, high-flying wrestling style, Mysterio inspired countless fans and athletes around the world.\n\nThe news of his death was confirmed by Lucha Libre AAA through a post on X, where they expressed their heartfelt condolences.\n\nWe mourn the loss of Miguel Angel Lopez Dias, known as Rey Mysterio Sr. Our deepest sympathies go to his family, and our prayers are with him for his eternal rest, the statement read.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Rey Mysterio Sr., a celebrated Mexican wrestler and uncle of WWE superstar Rey Mysterio Jr., has passed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/rey-mysterio-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Rey Mysterio Dies\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Pfumbidzai Signs Contract Extension with Scottland FC",
            "url": "https://www.zimeye.net/2024/12/21/pfumbidzai-signs-contract-extension-with-scottland-fc/",
            "content": "Sports Correspondent\n\nRonald Pfumbidzai has committed to an additional year at Scottland FC, signing a one-year contract extension with the club.\n\nThe left-back initially joined the Mabvaku-based team at the start of 2024 on a six-month deal after leaving SuperSport United in South Africa in June. Following Scottlands triumph in the Northern Region Division One League and their subsequent promotion to the top tier, Pfumbidzai will remain with the club for their debut season in the Castle Lager Premier Soccer League.\n\nBefore finalizing his new contract, Pfumbidzai, who earned a spot in the NRSL Team of the Year, had been linked with a move to Richards Bay in South Africa.\n\nIn other news, Scottland FC is reportedly eyeing several notable players, including 2024 Soccer Star of the Year Walter Musona, Golden Boot winner Lynoth Chikuhwa, and Peter Mudhuwa from Highlanders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Ronald Pfumbidzai has committed to an additional year at Scottland FC, signing a one-year contract extension with the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/pfumbidzai-signs-contract-extension-with-scottland-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Pfumbidzai Signs Contract Extension with Scottland FC\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "What Is Tailgating?",
            "url": "https://www.zimeye.net/2024/12/21/what-is-tailgating/",
            "content": "Drivers should always maintain a safe following distance, ensuring they do not tailgate or follow another vehicle more closely than is reasonable and prudent. This distance should be determined by factors such as the speed of the vehicles, traffic conditions, and the state of the road.\n\nMany rear-end collisions occur because drivers follow too closely, not allowing enough time to react in case of sudden stops or changes in traffic. Maintaining a safe distance can prevent such accidents and ensure safer driving for everyone on the road.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Drivers should always maintain a safe following distance, ensuring they do not tailgate or follow another vehicle more closely than … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/what-is-tailgating/\">Continue reading<span class=\"screen-reader-text\"> \"What Is Tailgating?\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "35 Children Die At Christmas Fanfair",
            "url": "https://www.zimeye.net/2024/12/21/35-children-killed-in-christmas-fanfair/",
            "content": "Nigeria- Police in Ibadan have confirmed the death of 35 children in a crash at a Christmas funfair in the south-western city, with six others hospitalised.\n\nThe organisers had promised to give cash handouts and food, but so many people turned up that there was a crush as they struggled to gain entry.\n\nResidents said that over 5,000 children had gathered at the venue and the crush occurred when the main organisers arrived to start the event.\n\nThe sequence of events leading to the crush has not been disclosed.\n\nThe police say they have arrested eight people who were behind the event, including the main organiser, Naomi Silekunola, a well-known figure in the city.\n\nPresident Bola Tinubu has extended his heartfelt condolences to the parents who have lost their children, and ordered a thorough investigation.\n\nThe Oyo state government said victims had been taken to hospitals across Ibadan for treatment after the crush at the Islamic High School in the citys Bashorun district.\n\nAuthorities have urged parents who are concerned about the whereabouts of their children to check at the citys hospitals.\n\nMedics in one hospital told the BBC that six children had been admitted but only two survived  four had died.At another hospital, a doctor who declined to be named said he had counted three dead bodies.\n\nSome affected parents told journalists that they had accompanied their children to converge at the venue of the End of the Year Christmas funfair as early as 05:00 on Wednesday  five hours before the event was due to start.\n\nThey were hoping to get some money and food as the organisers had promised to give out 5,000 naira each (about 2.50; $3) to 5,000 children as well as make free food available to attendees.\n\nNigeria is grappling with its worst economic crisis in a generation, which explains why more than 10,000 people reportedly turned up for the event.\n\nThere have been several similar incidents this year.\n\nIn March, two female students were crushed to death at the Nasarawa State University, Keffi, near the capital Abuja, when a rice distribution programme by the state governor caused a crowd surge.\n\nAt least 23 people were injured.\n\nThree days later in the northern state of Bauchi, at least seven people died in another crush when a philanthropist and businessman was giving handouts of 5,000 naira.\n\nEarlier in February, five people were reported killed in Lagos when the Nigerian Customs Service auctioned seized bags of rice.\n\nA crowd surge for bags of rice being auctioned for about $7:00 led to the trampling to death of five people with dozens more injured.\n\n-BBC\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Nigeria- Police in Ibadan have confirmed the death of 35 children in a crash at a Christmas funfair in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/35-children-killed-in-christmas-fanfair/\">Continue reading<span class=\"screen-reader-text\"> \"35 Children Die At Christmas Fanfair\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "WestProp Dishes Out Christmas Presents To Loyal Clients",
            "url": "https://www.zimeye.net/2024/12/21/westprop-dishes-out-christmas-presents-loyal-to-clients/",
            "content": "By Business Reporter-The live, work, shop and play customer-centric Westprop Holdings is offering its residential property customers at Pomona City the opportunity of a lifetime to pay a 50 per cent deposit for their brick requirements and enjoy a two-year instalment payment.\n\nThe company is setting up a US$1 million brick moulding company to assist in the realisation of the one billion bricks vision by 2050 and to speed development after encountering delays in brick delivery and, at times, standard bricks.\n\nOf all its development projects so far  only customers at Pomona City are building their own homes, while at other developments, the company is offering complete turn-key products.\n\nOnly 29 residential stands remain at Pomona phases 1B & C and 1A out of the initial 765 ahead of the introduction of the exciting leasehold concept next year.\n\nThe brick factory is designed to supply bricks to WestProp projects, and with growth, the company will then be able to supply excess bricks to outside customers.\n\nChief executive officer Mr Ken Sharpe says the new venture is in response to market delays in delivering bricks to the companys construction sites and a quest to manage brick quality.\n\nAs of March, next year, we start production. Those bricks are pre-sold. They are going to our customers. Our customers will pay a 50 percent deposit and pay the balance in instalments over two years, he said.\n\nThe initiative is meant to incentivise the customers to build and not be burdened by paying lump sums towards the bricks and then failing to buy other building materials.The purchase price of $0.14 a brick will include transportation costs to the building site.\n\nSpeaking at a Christmas and excellence recognition awards ceremony for WestProp employees, Mr Sharpe stressed the concept of urgency in service delivery to meet customer expectations.\n\nHe rallied the employees to embrace the one billion brick vision, adding that their hands would be imprinted on the achievements of the vision.\n\nWhatever we do with the billion bricks stands forever. For the test of time, he said.\n\nMr Sharpe reiterated his love for Zimbabwe, noting that he formed the company to make a difference and provide livelihoods for thousands of people whose value chain depends on WestProp.I set up this business to be a public company. Not to enrich myself. I have enough money. I set it up so that you can benefit from it, he said.\n\nMR Sharpe challenged the employees to introspect and inspire themselves to achieve more for the company.\n\nThe plant that will manufacture WestProp branded bricks.Our plant will be operational in 2025. We are targeting to do our first installations of new equipment in January and February. Initially the plants output will be directed exclusively to our Harare projects, he said.The land we own requires one billion bricks which translates to US$5 billion to build. We want to be able to meet our own deadlines in terms of construction timelines, he says.\n\nWestProp has been on a drive to self-resource by purchasing yellow machines and other capital-intensive equipment to avoid hiring and delays in completing work.\n\nWestProp are the developers of Pomona City, Pokugara, Millennium Heights, The Hills Luxury Golf Estate, the soon-to-be-built Mall of Zimbabwe and the upcoming branded apartment hotel at Millennium Heights (block 5).\n\nThe companys developments embody the live, work, shop, and play themes, which have quickly become the signature selling point of all its products.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-The live, work, shop and play customer-centric Westprop Holdings is offering its residential property customers at Pomona City … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/westprop-dishes-out-christmas-presents-loyal-to-clients/\">Continue reading<span class=\"screen-reader-text\"> \"WestProp Dishes Out Christmas Presents To Loyal Clients\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Mnangagwa’s Agricultural Revival Claims Seen Mere Gimmicking",
            "url": "https://www.zimeye.net/2024/12/21/mnangagwas-agricultural-revival-claims-seen-mere-gimmicking/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas promises to revive Zimbabwes agricultural sector have been met with skepticism, with many critics labeling his recent efforts as political gimmicks rather than genuine steps towards transformation.\n\nOn Friday, Mnangagwa launched the Land Tenure Implementation Programme at Precabe Farm in Kwekwe, a new initiative he claims will rejuvenate the agricultural sector. During the event, he handed over Land Tenure Deeds to farmers, describing the move as a milestone in Zimbabwes agricultural progress.\n\nHowever, opposition leaders and critics have dismissed the programme as an attempt to distract from the countrys ongoing agricultural challenges. This is nothing more than a political stunt. For years, the countrys agricultural sector has suffered from poor policy implementation and lack of support, and this programme wont change that, one political analyst remarked.\n\nIn a statement during the event, Mnangagwa said, Today, I officially launched the new Land Tenure Implementation Programme at Precabe Farm in Kwekwe, where I also handed over Land Tenure Deeds to Zimbabwean farmers. This milestone is a critical step in transforming our agricultural sector, enabling farmers to access credit facilities, purchase inputs, and hire labour.\n\nThese tools will enhance agricultural production, improve yields, and uplift our people from poverty into prosperity.\n\nDespite the presidents optimism, many are doubtful that these measures will lead to significant improvements. The land reform process has been poorly managed for years, and handing over deeds now wont fix the systemic issues that have plagued farming in Zimbabwe, said a critic of the programme.\n\nMnangagwa also highlighted that the programme reflects his governments commitment to inclusive growth, focusing on marginalized groups such as war veterans, women, and youth. This programme reflects the Second Republics commitment to inclusive growth, ensuring that war veterans, women, and the youth are not left behind in this transformative journey, he added.\n\nWhile the president continues to champion agriculture as key to national development, his critics argue that the lack of tangible reforms over the years has made such promises seem increasingly far-fetched. Farming has always been close to my heart, and I am proud to support this initiative, which will create opportunities for sustainable commercial agriculture and attract investment into our economy, Mnangagwa said, but many believe that the focus should be on practical support for farmers, not just promises.\n\nAs Zimbabwe grapples with food insecurity and economic challenges, the real impact of this initiative remains to be seen. Many are calling for more than just ceremonial gestures, urging real action to revive the sector and restore confidence among farmers.\n\nTogether, we are building a thriving agricultural sector that drives Zimbabwes development and secures food security for future generations, Mnangagwa concluded, but for many, these words appear to be more hopeful rhetoric than a concrete plan.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s promises to revive Zimbabwe’s agricultural sector have been met with skepticism, with many critics … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/mnangagwas-agricultural-revival-claims-seen-mere-gimmicking/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Agricultural Revival Claims Seen Mere Gimmicking\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Is Auxillia Mnangagwa Giving Away ZIMRA-Seized Goods As Donations?",
            "url": "https://www.zimeye.net/2024/12/21/is-auxillia-mnangagwa-giving-away-zimra-seized-goods-as-donations/",
            "content": "By A Correspondent\n\nImpeccable government sources have raised concerns about the source of the goods being donated by First Lady Auxillia Mnangagwa. Allegations have surfaced suggesting that some of the items she has given away may have been confiscated by the Zimbabwe Revenue Authority (ZIMRA), sparking questions about the transparency of her philanthropic efforts.\n\nOn December 19, 2024, the office of the Minister of State for Provincial Affairs and Devolution announced that Mrs. Mnangagwa had donated 300 food hampers to the elderly in Gweru, a gesture described as part of her commitment to supporting vulnerable communities during the festive season.\n\nIn Gweru on 19 December 2024, Honourable Owen Ncube, Minister of State for Provincial Affairs and Devolution for Midlands, handed over 300 food hampers to the elderly at the Gweru Government Complex. The hampers, donated by the First Lady of Zimbabwe, Dr. Auxillia Mnangagwa, underscore her commitment to ensuring that no one is left behind during the festive season, a government official stated in a press release.\n\nHowever, sources within government circles have suggested that some of the items included in these hampers could have been seized by ZIMRA, raising concerns about the appropriateness of using such goods for charitable purposes. While her intentions may be good, the public deserves to know the origin of these goods. If they were taken by ZIMRA due to non-compliance with import regulations, it raises questions about the ethical use of such items, one government insider commented, requesting anonymity.\n\nAs of now, there has been no official confirmation regarding the exact source of the goods donated by the First Lady. Critics argue that using goods seized by ZIMRA for charity may undermine the integrity of the donations and contribute to a lack of transparency in public affairs.\n\nDespite these concerns, Mrs. Mnangagwas supporters have continued to praise her charitable work, particularly her focus on the elderly, a group often neglected in society. The First Ladys donations have been a blessing to many in need. Its crucial that we focus on the positive impact of her initiatives, said a government spokesperson.\n\nThe controversy surrounding the origin of the donated goods continues to raise questions about the broader implications of using confiscated goods in charity, and whether it might lead to a reassessment of how such donations are handled in the future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Impeccable government sources have raised concerns about the source of the goods being donated by First Lady … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/is-auxillia-mnangagwa-giving-away-zimra-seized-goods-as-donations/\">Continue reading<span class=\"screen-reader-text\"> \"Is Auxillia Mnangagwa Giving Away ZIMRA-Seized Goods As Donations?\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        },
        {
            "title": "Kisimusi To Spend Christmas In Jail After Brutally Killing Brother-in-law",
            "url": "https://www.zimeye.net/2024/12/21/kisimusi-to-spend-christmas-in-jail-after-brutally-killing-brother-in-law/",
            "content": "By A Correspondent\n\nA Christmas celebration turned deadly in Gokwe after a violent altercation led to the murder of a 30-year-old man.\n\nBruce Kisimusi, 25, was arrested by police on December 17, 2024, in connection with the killing of his brother-in-law, Mthembisi Sibanda.\n\nAccording to reports, the suspect brutally attacked Sibanda at Gababe Business Centre, striking him multiple times on the head and face with an empty bottle and a brick. The victim succumbed to his injuries while being treated at a hospital in Gokwe.\n\nKisimusi will spend Christmas in jail as he awaits trial for the murder charge. The incident has sent shockwaves through the community, highlighting the devastating consequences of violence and conflict.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Christmas celebration turned deadly in Gokwe after a violent altercation led to the murder of a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/21/kisimusi-to-spend-christmas-in-jail-after-brutally-killing-brother-in-law/\">Continue reading<span class=\"screen-reader-text\"> \"Kisimusi To Spend Christmas In Jail After Brutally Killing Brother-in-law\"</span></a></p>",
            "time": "20:31",
            "date": "21 Dec 2024"
        }
    ]
}