{
    "news": [
        {
            "title": "ED To Dish Out Degrees To UZ Students Who Sat For Only 1 Semester",
            "url": "https://www.zimeye.net/2025/08/10/ed-to-dish-out-degrees-to-uz-students-who-sat-for-only-1-semester/",
            "content": "By Dorrothy Moyo |\n\nUniversity of Zimbabwe Faces Urgent Court Bid to Halt Graduation Over Degree Printing Machine Allegations\n\nHarare  9 August 2025  The Association of University Teachers (AUT) has filed an urgent High Court application seeking to block the Chancellor of the University of Zimbabwe (UZ) from conferring degrees, diplomas, and certificates at the institutions 44th graduation ceremony.\n\nThe court papers, stamped by the High Courts Civil Division on Saturday, list 13 respondents, including the Vice Chancellor Prof Paul Mapfumo, the Minister of Higher and Tertiary Education, the Zimbabwe Council for Higher Education, the Law Society of Zimbabwe, and various professional councils.\n\nAccording to the AUT, the drastic move follows what they describe as gross violations of academic regulations by the UZ administration, which they claim have rendered the institutions qualifications defective. The lecturers union accuses the university leadership of turning the institution into a Degree Printing Machine, alleging that academic standards have collapsed to the point where like pizza, one can now order a degree.\n\nThe AUT says the crisis stems from an indefinite strike launched on 16 April 2025, which they claim deprived students of meaningful teaching and learning in Block 3 and Block 4 modules. The union blames the UZ administration, led by Prof Mapfumo, for arrogance and academic fraud, citing a 45-page dossier that reportedly details the most grave instances of malpractice in Zimbabwes higher education history.\n\nThe statement praises members who endured alleged intimidation, kangaroo courts, and attempts to force them to disavow the union, vowing that their struggle has been recorded in history.\n\nIf the court grants the interdict, it would halt the conferring of qualifications at one of Zimbabwes flagship universities, potentially throwing thousands of students graduation plans into uncertainty.\n\nThe case is now before the High Court under an urgent application, with the matter pitting academic staff against the countrys largest tertiary institution in a dispute that could reshape the governance and credibility of Zimbabwes higher education sector.\n\nCase No: HCH (Harare High Court)  Filed 9 August 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | University of Zimbabwe Faces Urgent Court Bid to Halt Graduation Over ‘Degree Printing Machine’ Allegations Harare … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/ed-to-dish-out-degrees-to-uz-students-who-sat-for-only-1-semester/\">Continue reading<span class=\"screen-reader-text\"> \"ED To Dish Out Degrees To UZ Students Who Sat For Only 1 Semester\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "Punters Stun CAPS United in Chibuku Super Cup Clash",
            "url": "https://www.zimeye.net/2025/08/10/punters-stun-caps-united-in-chibuku-super-cup-clash/",
            "content": "Sports Correspondent\n\nCAPS United have crashed out of the Chibuku Super Cup after suffering a shock defeat to minnows MWOS FC in a thrilling encounter at Ngoni Stadium.\n\nThe match saw MWOS produce a spirited performance, securing a 20 victory with spectacular goals from Nigel Matinha and Arthur Banda. The result marked a historic moment for the club.\n\nIn a celebratory statement, MWOS FC said: CAPS United FC become the FIRST EVER team we beat in the Chibuku Super Cup. #Punters #moudzandudzana.\n\nAdding to the days significance, MWOS FC owners son, 13-year-old Ethan Tamson, made his first team debut during the match  an inspiring moment for the youngster and the clubs supporters.\n\nThe upset will be remembered as one of the biggest surprises in recent Chibuku Super Cup history, with MWOS advancing to the next round and CAPS United left to reflect on a missed opportunity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent… CAPS United have crashed out of the Chibuku Super Cup after suffering a shock defeat to minnows MWOS … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/punters-stun-caps-united-in-chibuku-super-cup-clash/\">Continue reading<span class=\"screen-reader-text\"> \"Punters Stun CAPS United in Chibuku Super Cup Clash\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "KAYCIE DEATH: Corpse War Breaks Out As Amwene Accuses Muroora Saying You Were Not Married At All, His Body, His Wealth Are Mine",
            "url": "https://www.zimeye.net/2025/08/10/kaycie-death-corpse-war-breaks-out-as-amwene-accuses-wife-saying-you-were-not-married-at-all-his-body-his-wealth-are-mine/",
            "content": "Is KCs Widow Beverly the One Holding Up the Burial?\n\nSolicitor accused of delaying funeral despite widows legal rights and burial instructions\n\nBy Simba Chikanza | Investigations Desk\n\nAt a time when swirling rumours are casting dark shadows over the sudden death of popular UK-based Zimbabwean DJ, Kudzaishe Chipadza, better known as Kaycie, a bitter dispute over his burial is playing out behind the scenes. While some family members and online observers are accusing his widow, Beverly Hanyani, of stalling the funeral, an in-depth look at the evidence reveals a different storyone that places the delay squarely at the feet of KCs biological mothers solicitor, Ivon Sampson of Privatus Law.\n\n The Legal Letter That Raised Eyebrows\n\nOn 10 July 2025, Ms Glory Chipadza, the deceaseds mother, through her solicitor at Privatus Law, served Beverly with a Pre-Action Protocol Letter demanding she stop all funeral arrangements. The letter accused Beverly of falsely claiming to be next of kin, despite being KCs wife and mother of his eldest children. It insisted that because the couple was not married at the time of death, she had no legal right to direct the burial.\n\nYou were not married to the deceased at the time of his death and have no automatic legal entitlement to act as next of kin, wrote Sampson.You have acted unilaterally Presented yourself as next of kin to Walton & Taylor without legal authority.\n\nBut these claims contradict reality. Multiple messages and forwarded communications reveal that Beverly does have a marriage certificate and that the UK coroners office formally recognised her as the legal spouse, granting her custody of KCs body.\n\n WhatsApp Evidence Paints a Different Picture\n\nIn WhatsApp messages reviewed by this publication, a clearer narrative emergesone where Beverly is actively trying to organise the burial, only to be obstructed by members of the Chipadza family who are pushing for KCs mother to be declared next of kin.\n\nThey paid 6000 for KC funeral then they went and took their money back because the mother wanted to be next of kin, reads one forwarded message.But now we have paid 11065 she [the mother] went and told the council that Bev is lyingSo thats whats stopping the burial.\n\nAnother message notes that the mother and her representatives even wrote to the Zimbabwean embassy alleging that Beverly was refusing to release the bodya claim the coroners office itself invalidated by releasing the body to Beverly on the basis of her legal status as wife and mother.\n\n KC Wanted to Be Buried in Zimbabwe\n\nThe conflict is not just legalits also cultural. Beverly has consistently maintained that KC had expressed his wish to be buried in Zimbabwe, not the UK, where his mother now insists he must be laid to rest. Family members admit in group chats that this disagreement over burial location and control has halted progress.\n\nI think isusu tese tirikuda kuradzika Kudzai. But unfortunately amai vake havasikuda kuti Bevy ange ariye next of kin, one message reads.Saka we are not going anywhere ambuya Inyaya yeNext of Kin here?\n\nMeanwhile, logistical issues also compounded the delay. A message from a relative said the funeral directors needed final confirmations, including a signed estimate by a Thursday deadline, in order to proceed with a scheduled Friday the 4th of July burial. Due to the confusion and interference, the funeral parlour has since demanded full payment for continued storagenow totalling 11,065 for over eight weeks.\n\n Rumours, Threats, and Postmortem Claims\n\nWhat has further complicated the case are wild accusations made by some relatives, including Kumbirai Chipadza, KCs brother. In several messages, Kumbirai engages in heated exchanges, at one point threatening that the truth will come out in what some interpret as an attempt to intimidate Beverly.\n\nThere are also unsubstantiated rumours circulated online and within the family alleging that KC was murdered and that Beverly had tampered with his body. However, reliable sources have confirmed that the body was only handled for toxicology and postmortem examinations in line with standard Coroners office procedures when a person suddenly dies who was otherwise seen and deemed healthy-and not for any nefarious reasons.\n\n The Legal Irony\n\nIn a twist of irony, while Privatus Law argues that unmarried partners lack legal standing, their entire legal challenge hinges on excluding a legally married spouse from her rightful role as next of kin. Beverley was married to KC both traditionally and legally.\n\nAccording to UK law under the Non-Contentious Probate Rules 1987, if a person dies intestate, the estate is managed in the following hierarchy:\n\nSince Beverly is KCs legal spouse, she outranks the mother, siblings, or other relatives. Also from a recent hospital attendance in March 2025, KC in his own writing stated that Beverly Hanyani was his next of kin.\n\nPrivatus own argument falsely states that no spouse exists and relies on the assumption that there is no marriage certificate. However, all evidence reviewed confirms the contrary.\n\n Cultural Rights vs Legal Rights\n\nThis case pits Zimbabwean cultural traditionswhere mothers and elders often take charge of burial decisionsagainst UK legal frameworks that prioritise spouses and children. While both perspectives deserve recognition, the reality remains: Beverly holds the legal right, and yet her authority is being undermined by conflicting family demands and, arguably, misguided legal threats.\n\n What Now?\n\nThe letter from Privatus demands that Beverly withdraw from funeral arrangements or face High Court action, including an injunction to stop the burial, a declaration of her disqualification, and 20,000 in costs. Yet, the evidence suggests the real delay stems from this very legal interference.\n\nMrs Chipadza was contacted for comment and she was still to respond at the time of writing. An emergency meeting was still in motion on Sunday afternoon called for by the Zimbabwe embassy in London to resolve the impasse.\n\nAs of now, no burial date is confirmed. And while accusations continue to fly, the real issue may be this: Is this about love for the deceased, or a power struggle over control, culture, and grief?\n\nLet us know what you think: Should a legally married widow be stopped from burying her husband based on unverified cultural claims?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "⸻ Is KC’s Widow Beverly the One Holding Up the Burial? Solicitor accused of delaying funeral despite widow’s legal rights … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/kaycie-death-corpse-war-breaks-out-as-amwene-accuses-wife-saying-you-were-not-married-at-all-his-body-his-wealth-are-mine/\">Continue reading<span class=\"screen-reader-text\"> \"KAYCIE DEATH: Corpse War Breaks Out As Amwene Accuses Muroora Saying You Were Not Married At All, His Body, His Wealth Are Mine\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "Enough Is Enough, Declares New Opposition Party Ahead Of Official Launch…",
            "url": "https://www.zimeye.net/2025/08/10/enough-is-enough-declares-new-opposition-party-ahead-of-official-launch/",
            "content": "By A Correspondent\n\nA new political movement, the Freedom Fighters for Change (FFC), has announced its official entry into Zimbabwes political arena, vowing to unite citizens across the political divide in the fight for justice, equality, and a better future.\n\nIn a statement released on Sunday, the party declared that its mission goes beyond conventional politics, describing itself as a movement of the people, by the people, and for the people.\n\nBeloved citizens, today we stand at the threshold of a new era. An era of freedom, of justice, and of equality, the statement read. The Freedom Fighters for Change party is more than just a political organization  its a movement.\n\nThe FFC leadership called on all Zimbabweans to set aside political affiliations, social status, and personal differences, urging unity in the pursuit of national renewal. Regardless of your political affiliation, your social status, or your background, we invite you to join us on this journey towards a brighter future. We believe that together, we can build a Zimbabwe that works for all.\n\nThe party will officially launch in Harare on September 13, 2025, and has invited the public to attend. Lets come together, lets stand together, and lets fight for the change we deserve. See you there! the statement concluded.\n\nThe launch is expected to mark the beginning of what FFC leaders describe as a people-driven campaign to challenge the current political status quo and address the countrys pressing socio-economic challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A new political movement, the Freedom Fighters for Change (FFC), has announced its official entry into Zimbabwe’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/enough-is-enough-declares-new-opposition-party-ahead-of-official-launch/\">Continue reading<span class=\"screen-reader-text\"> \"Enough Is Enough, Declares New Opposition Party Ahead Of Official Launch…\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "Power Play: Mnangagwa Pushes Kuda Tagwirei into Zanu PF Central Committee Against Chiwenga’s Wishes?",
            "url": "https://www.zimeye.net/2025/08/10/power-play-mnangagwa-pushes-kuda-tagwirei-into-zanu-pf-central-committee-against-chiwengas-wishes/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has reportedly forced the co-option of his ally, Kuda Tagwirei, into the ZANU PF Central Committee, bypassing Vice President Constantino Chiwenga.\n\nThis move is likely to trigger tensions within the party, as it is seen as Mnangagwa positioning Tagwirei for succession.\n\nObservers suggest that this strategic appointment could deepen divisions among top leadership as Mnangagwa consolidates his influence ahead of future power transitions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has reportedly forced the co-option of his ally, Kuda Tagwirei, into the ZANU PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/power-play-mnangagwa-pushes-kuda-tagwirei-into-zanu-pf-central-committee-against-chiwengas-wishes/\">Continue reading<span class=\"screen-reader-text\"> \"Power Play: Mnangagwa Pushes Kuda Tagwirei into Zanu PF Central Committee Against Chiwenga’s Wishes?\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "SADC Announces Meeting Without Zambia, Others, Later Edits",
            "url": "https://www.zimeye.net/2025/08/10/sadc-announces-meeting-without-zambia-others-later-edits/",
            "content": "The regional body SADCs secretariat on Sat announced a meeting without mentioning Zambia and 4 other countries. They only corrected the post the following day. No comment was availed at the time of writing. Pictures\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The regional body SADC’s secretariat on Sat announced a meeting without mentioning Zambia and 4 other countries. They only corrected … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/sadc-announces-meeting-without-zambia-others-later-edits/\">Continue reading<span class=\"screen-reader-text\"> \"SADC Announces Meeting Without Zambia, Others, Later Edits\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "Hiding Behind Finger? Chinamasa Blames Western Forces For Causing Citizens’ Suffering",
            "url": "https://www.zimeye.net/2025/08/10/hiding-behind-finger-chinamasa-blames-western-forces-for-causing-citizens-suffering/",
            "content": "By A Correspondent\n\nZANU PFs Patrick Chinamasa has once again pointed the finger at Western governments, accusing them of orchestrating Zimbabwes economic hardships and undermining the countrys sovereignty  nearly 45 years after independence. The partys Secretary for Legal Affairs claims sanctions, electoral meddling, and support for opposition parties form part of a long-running neocolonial campaign to weaken both the state and ZANU PF.\n\nSpeaking during a Virtual Working Meeting of the Standing Committee of the International Movement Forum of Supporters of the Struggle against Modern Practices of Neocolonialism for the Freedom of Nations on 31 July 2025, Chinamasa said Western powers continue to wage what he called economic terrorism through a combination of political, economic, and technological interference.\n\nThe meeting brought together political representatives from Russia, Venezuela, Serbia, China, Cuba, Zimbabwe, and other nations. In his five-minute address, Chinamasa reaffirmed ZANU PFs commitment to resisting neocolonialism and called for new global mechanisms to oversee elections without Western influence.\n\nZANU PF should stand counted as a worthy supporter of the Forum of Supporters of the Struggle against Modern Practices of Neocolonialism for the Freedom of Nations, he declared.\n\nChinamasa alleged that:\n\nWestern proxies orchestrated unrest during Mozambique and South Africas 2024 elections as part of a wider electoral neocolonialism strategy.\n\nZimbabwes 2023 elections were targeted, with an observer mission head acting as a puppet in the service of the West to produce a damaging and unfounded report.\n\nNeocolonial tactics now include imposing foreign democratic models ill-suited to local realities, manipulating electoral technology, and attaching political conditions to foreign aid.\n\nSanctions imposed for over 25 years were intended to cripple the economy and weaken ZANU PFs electoral chances.\n\nNGOs funded by Western governments act as proxies for political interference and should be barred from lobbying or supporting opposition parties.\n\nWestern intelligence agencies attempted to hack the Zimbabwe Electoral Commissions systems during the 2023 elections.\n\nHe also accused Western governments of exploiting traditional and digital media to manipulate public opinion, and of selectively weaponizing human rights rhetoric to weaken liberation movements.\n\nChinamasa ended with a warning to skeptics: Those who have eyes, let them eye, and those who have ears, let them ear. Nokuti hatigoni kurega kutaura izvi, takoona neizvotakanzwa.\n\nAccording to him, Western interference remains the single biggest obstacle to Zimbabwes true economic progress and political independence, decades after the official end of colonial rule.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF’s Patrick Chinamasa has once again pointed the finger at Western governments, accusing them of orchestrating … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/hiding-behind-finger-chinamasa-blames-western-forces-for-causing-citizens-suffering/\">Continue reading<span class=\"screen-reader-text\"> \"Hiding Behind Finger? Chinamasa Blames Western Forces For Causing Citizens’ Suffering\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "Susan Mutami Showers Praise on Ex-Lover",
            "url": "https://www.zimeye.net/2025/08/10/susan-mutami-showers-praise-on-ex-lover/",
            "content": "By A Correspondent  Controversial Australia-based Zimbabwean activist Susan Mutami has taken to social media to heap praise on her former lover and baby father, outspoken ex-Norton MP Temba Mliswa.\n\nMutami and Mliswa, who share a child, made headlines in 2022 during a public fallout over child custody and maintenance. The pairs relationship, often played out on social media, was marked by fiery exchanges, accusations, and reconciliations.\n\nMutami has also been at the centre of high-profile dating controversies, having claimed relationships with several senior Zanu PF politicians and government ministers. Most explosively, she accused President Emmerson Mnangagwa of sexually abusing herallegations he has denied.\n\nDespite their turbulent history, Mutami struck a softer tone this weekend, suggesting on X (formerly Twitter) that Mliswa should be appointed Zimbabwe Rugby President, describing him as a passionate pioneer and icon of the sport.\n\nYou are very passionate about rugby and have been around for the longest time This is your lane, not football, she wrote.\n\nCan someone please tell me how old is@TembaMliswabecause in 1990 when this newspaper article was written I was 1yr 8months old. Ba Tino vakura guys. Amana . Ipapo ndaitoti ndabata younger stock yangu,chimu sweet late 30 something changu izvo akutopinda muzana zvake. Youpic.twitter.com/zycjDJHb26\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Controversial Australia-based Zimbabwean activist Susan Mutami has taken to social media to heap praise on her … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/susan-mutami-showers-praise-on-ex-lover/\">Continue reading<span class=\"screen-reader-text\"> \"Susan Mutami Showers Praise on Ex-Lover\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "Why Should He Leave?” – Togarepi Brushes Off Discontent Over Mnangagwa",
            "url": "https://www.zimeye.net/2025/08/10/why-should-he-leave-togarepi-brushes-off-discontent-over-mnangagwa/",
            "content": "By A Correspondent\n\nDespite growing frustration over stalled reforms and unmet promises, Zimbabwe Liberation War Collaborators Association (ZILWACO) national chairman Pupurai Togarepi is doubling down on his support for President Emmerson Mnangagwa, urging that he remain in power. Speaking at an inter-district meeting in Rusape, Togarepi painted an optimistic picture of government plans for war collaborators while dismissing calls for leadership change.\n\nTogarepi announced that a comprehensive housing scheme for war collaborators is in development as part of a broader government empowerment strategy, yet many remain sceptical about the pace and sincerity of delivery. At one point, representatives from the Government had not agreed on a way forward. They were instructed to reconcile their differences and I can assure you that they have reached an agreement. The document is now with the President, ready for gazetting, he claimed, without providing a clear timeline.\n\nHe further expressed confidence in Mnangagwas leadership, stating, If he is doing good for us, why should he leave? This staunch endorsement comes amid growing criticism of the Presidents extended rule and questions about the countrys stalled progress.\n\nHighlighting the governments efforts, Togarepi announced plans to launch housing stands for war collaborators, noting that the President has initiated this process, demonstrating his appreciation for war collaborators even before the gazetting of other benefits. He revealed a US$500,000 allocation for related projects, although critics argue this amount is insufficient given the number of beneficiaries and the scope of needs.\n\nRegarding land ownership, Togarepi said the Ministry of Lands would provide title deeds to war collaborators who received farms during the Land Reform Programme, emphasizing that they will only pay a token amount for land ownership, reflecting their struggle for land rights. However, concerns remain over the slow pace of land formalization and persistent bureaucratic obstacles.\n\nHe portrayed war collaborators as authentic ZANU PF members, claiming, You do not need to campaign to these individuals. Such statements ignore growing fractures within the party and the broader publics demand for accountability.\n\nDr Jenfan Muswere, ZANU PF Central Committee member and Minister of Information, acknowledged the long delay in addressing war collaborators grievances but attempted to reassure them. We attained independence in 1980, but it took a considerable amount of time for the Government to address many of your grievances, he said. However, under the New Dispensation, we crafted the Veterans of the Liberation Struggle Act Although the journey has been long, we are nearing its end.\n\nMuswere praised the governments infrastructural projects and food relief efforts, claiming, Fortunately, no one succumbed to hunger. Yet, many citizens continue to face food insecurity and economic hardships.\n\nHe also stressed Mnangagwas commitment: Our President possesses a fatherly heart and is a listening President He will never abandon you. Such paternalistic rhetoric does little to conceal the administrations failure to deliver timely benefits and meaningful empowerment.\n\nAdvocate Misheck Mugadza echoed the sentiment, saying Mnangagwas Vision 2030 encapsulates the aspirations of war collaborators, urging them to actively participate in the economy. But critics argue that this vision remains distant and vague for many struggling Zimbabweans.\n\nDespite the optimistic assurances, the meeting exposed deep cracks in promises made to war collaborators and the public. Togarepis call to keep Mnangagwa in power ignores growing frustrations with prolonged delays, unfulfilled commitments, and an administration increasingly seen as out of touch with the needs of its people.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent… Despite growing frustration over stalled reforms and unmet promises, Zimbabwe Liberation War Collaborators Association (ZILWACO) national chairman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/why-should-he-leave-togarepi-brushes-off-discontent-over-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Why Should He Leave?” – Togarepi Brushes Off Discontent Over Mnangagwa\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        },
        {
            "title": "Zanu PF Power Dynamics: Is Emmerson Mnangagwa Invincible?",
            "url": "https://www.zimeye.net/2025/08/10/zanu-pf-power-dynamics-is-emmerson-mnangagwa-invincible/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has reportedly orchestrated the co-option of his close ally, Kuda Tagwirei, into the ZANU PF Central Committee, sidelining Vice President Constantino Chiwenga in the process.\n\nThis controversial move is stirring tensions within the party and is widely interpreted as Mnangagwas bid to position Tagwirei as a favored successor.\n\nPolitical analysts warn that this appointment could deepen rifts among the partys top brass as Mnangagwa consolidates power ahead of anticipated leadership transitions.\n\nWatch the full discussion here:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has reportedly orchestrated the co-option of his close ally, Kuda Tagwirei, into the ZANU … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/10/zanu-pf-power-dynamics-is-emmerson-mnangagwa-invincible/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Power Dynamics: Is Emmerson Mnangagwa Invincible?\"</span></a></p>",
            "time": "21:28",
            "date": "10 Aug 2025"
        }
    ]
}