{
    "news": [
        {
            "title": "Tongai Moyo Escapes Death",
            "url": "https://www.zimeye.net/2024/12/27/tongai-moyo-escapes-death/",
            "content": "By Crime and Courts Reporter-Tongai Moyo of Triangle,Mwenezi,narrowly escaped death on Christmas day during a beer-drinking spree after a stone thrown by his friend missed him and struck another man, killing him instantly.\n\nPolice said Mastard Chauke (22) had a heated misunderstanding with Tongai Moyo after being bumped into at Machipisa Tuckshops.\n\nIn a fit of rage, Chauke hurled a stone at Moyo, but it fatally hit Ostern Mangaru (29) on the chest. Mangaru collapsed and died on the spot.\n\nThe incidentwas highlightedby police while raising alarm over the rise in murder cases during the Christmas holiday, with 47 cases recorded nationwide.\n\nPosted the Police Friday:\n\nTheZimbabwe Republic Policeis concerned with the number of murder cases which arebeing recordedthroughout the country.47cases of murderhavebeen receivedduring the period20th December 2024 to 26th December 2024.\n\nTheZimbabwe Republic Policehas established that the murder cases are emanating from disputes atbeer drinkingbinges or sporting activities, family and community disputes during gatherings, attacks by unknown suspects while walking at night, the settling of scores during Christmas Day by individuals and groups, and fighting over girlfriends, among others.\n\nIn one of the caseswhichoccurred on25th December 2024at around1900 hoursatMachipisa Tuckshops, Mwenezi, Triangle,Mastard Chauke (22)had a misunderstanding withTongai Moyo, who had bumped into him during abeer drinkingspree.MastardChaukethrew a stone towardsTongai Moyo, which hitOstern Mangaru (29)on the chest instead. The victim fellonthe ground and died on the spot.\n\nIn another murder case which occurred on25th December 2024at around2100 hours,Learnmore Mudzengi (36)stabbedSydney Mudzengi (21)with a Colombian knife onceonthe chest atMusavezi Business Centre, Shurugwi.The suspect allegedly had a misunderstanding with the victim over a tokenwhichwent missingwhilstplaying pool.After committing the offence, the\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-Tongai Moyo of Triangle, Mwenezi, narrowly escaped death on Christmas day during a beer-drinking spree after a stone … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/tongai-moyo-escapes-death/\">Continue reading<span class=\"screen-reader-text\"> \"Tongai Moyo Escapes Death\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Mondlane Exposes Frelimo’s Mnangagwa Style Of Releasing 1500 Prisoners To Falsely Accuse Opposition | FULL SPEECH",
            "url": "https://www.zimeye.net/2024/12/27/mondlane-exposes-frelimos-mnangagwa-style-of-releasing-1500-prisoners-to-falsely-accuse-opposition-full-speech/",
            "content": "Speech by Venncio Mondlane  Friday Afternoon\n\nFellow citizens, comrades, and supporters,\n\nWe are gathered at a pivotal moment in our history, where the call for justice, democracy, and accountability grows louder each day. The events unfolding in our nation reveal a deliberate plan to manipulate the masses by creating fear and chaos. These tactics aim to distract us from the reality of the election results and to undermine our collective resolve.\n\nExposing the Manipulation\n\nIt is no coincidence that over 1,500 prisoners escaped from a maximum-security prison in Maputo shortly after the Constitutional Council announced the contested election results on December 23rd. This is not an isolated event; it is a calculated effort to destabilize our communities and shift attention away from the growing evidence of electoral fraud.\n\nWe have also seen security forces facilitating looting, as evidenced by videos of armored vehicles breaking walls to allow looters into stores. How can these same forces, so quick to disperse peaceful protesters with tear gas, stand idle or even enable such acts of chaos? The answer is clear: this is part of a broader strategy to create a climate of fear.\n\nFrelimos Diplomatic Isolation\n\nBy enabling the prison break and fostering unrest, Frelimo has shot themselves in the foot. Their actions have isolated them diplomatically. Major international playersthe United States, the United Kingdom, the European Unionhave yet to recognize the legitimacy of this regime. Even Portugal, after prematurely congratulating Frelimo, is reconsidering its position. This regime has lost credibility both domestically and abroad.\n\nA Clear Plan Forward\n\nAs we look ahead to Monday, I am calling for a partial shutdown. While I urge the informal sector to continue their work to sustain livelihoods, I encourage others to join this strategic act of defiance. This phase of our movement, which I am callingPonta de Lanaor Spearhead, marks the final push.\n\nThe new president is set to be sworn in around January 15th, but we will not relent. Protests will continue as we fight for the electoral truth and a government that reflects the will of the people.\n\nA Message to the International Community\n\nTo our international partners: Mozambique needs your attention and support. The manipulations, violence, and oppression we face are symptoms of a regime desperate to cling to power. Stand with us as we seek to restore democracy and build a just and prosperous nation.\n\nUnity and Determination\n\nLet us remain steadfast, united in our resolve. We are not intimidated by their tactics. We seek changenot for ourselves, but for the future of our children and the generations to come. We will expose the lies, confront the injustices, and demand accountability.\n\nThe journey is far from over, but together, we will prevail.\n\nThank you, and may justice and democracy guide us forward.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Speech by Venâncio Mondlane – Friday Afternoon Fellow citizens, comrades, and supporters, We are gathered at a pivotal moment in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/mondlane-exposes-frelimos-mnangagwa-style-of-releasing-1500-prisoners-to-falsely-accuse-opposition-full-speech/\">Continue reading<span class=\"screen-reader-text\"> \"Mondlane Exposes Frelimo’s Mnangagwa Style Of Releasing 1500 Prisoners To Falsely Accuse Opposition | FULL SPEECH\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "ZIFA Responds to Jere Dismissal from Election Candidacy…",
            "url": "https://www.zimeye.net/2024/12/27/zifa-responds-to-jere-dismissal-from-election-candidacy/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) Normalisation Committee has issued a response to Farai Jere, who raised concerns about his exclusion from the race for ZIFA president in the upcoming January 25 elections.\n\nJere, along with other prominent figures such as Twine Phiri, Walter Magaya, Temba Mliswa, and Benjani Mwaruwari, was disqualified after failing to meet the eligibility criteria for candidacy.\n\nThe CAPS United owner contested his exclusion, arguing that he had met the necessary requirements, including the five O-Level passes, and claimed he was unjustly removed from the race.\n\nIn a letter to Jere, ZIFA Normalisation Committee chairman Lincoln Mutasa explained that Jeres certificates showed a name discrepancy, and the correction had been submitted too late. Mutasa stated:\n\nI regret to inform you that, following the integrity checks required for candidacy in the upcoming Zimbabwe Football Association (ZIFA) Executive Committee elections, it has been determined that you have not met the necessary criteria to proceed as a candidate.\n\nSpecifically, this pertains to the late submission of your name change on the O and A Level certificates.\n\nWe understand that this news may be disappointing. The integrity checks are a crucial part of our commitment to upholding the highest standards of ethical conduct within our organization. This process is essential for fostering trust and transparency in our operations and ensuring that all candidates meet the rigorous standards expected by the football community.\n\nWe encourage you to remain engaged with ZIFA and continue to contribute to the development of football in Zimbabwe. Should you have any questions regarding the integrity check process or require further information, please do not hesitate to contact us.\n\nShould you wish to appeal, please kindly note the process is outlined in Article 85(9) of the ZIFA Statutes.\n\nThank you for your understanding and continued support.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) Normalisation Committee has issued a response to Farai Jere, who raised concerns about … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/zifa-responds-to-jere-dismissal-from-election-candidacy/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Responds to Jere Dismissal from Election Candidacy…\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Makandiwa Denounces Mnangagwa’s 2030 Statement",
            "url": "https://www.zimeye.net/2024/12/27/makandiwa-denounces-mnangagwas-2030-statement/",
            "content": "By Farai D Hove | ZimEye | The controversial Pro ZANU PF preacher Emmanuel Makandiwa has dropped a bombshell statement denouncing Emmerson Mnangagwas flagship talk that is being used by the ruling party to campaign for the continuation of his presidency of ZANU PF.\n\nMakandiwa who is traditionally viewed one of the ruling ZANU PF partys false prophets, who announced his entry into presidency in 2017, could easily be announcing Mnangagwas departure from State House, if events go as they seem.\n\nHe is the one who uttered the religious prediction that prepared the country for Mnangagwas fake poisoning in 2017 a choreographed event that caused the military to rally behind the then president Robert Mugabes banished deputy.\n\nHis statement this time could as well be another script by elements in the deep state who are demanding no that Mnangagwa steps aside for his deputy, Constantino Chiwenga.\n\nMakandiwa made this piercing remark during a sermon stating in part,\n\nWhy are you paying attention to challenges that are coming in between?\n\nYou hear someone who has an eye that theyre using to see. He ignores everything that they are seeing in between and says, when we get to this futuristic year, we will be what? He says what? He says 2030, we will still be what? He says 2030 we will still be there?,he asked.\n\nThere were no further the details after this; but the thorny talk was seen as the beginning of the end for Mnangagwa as the video went viral on social media networks. Video loading below\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | The controversial Pro ZANU PF preacher Emmanuel Makandiwa has dropped a bombshell statement … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/makandiwa-denounces-mnangagwas-2030-statement/\">Continue reading<span class=\"screen-reader-text\"> \"Makandiwa Denounces Mnangagwa’s 2030 Statement\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Restless Mnangagwa Speaks On 2025 Way Forward",
            "url": "https://www.zimeye.net/2024/12/27/restless-mnangagwa-speaks-on-2025-way-forward/",
            "content": "By A Correspondent\n\nZimbabwean President Emmerson Mnangagwa has indicated that significant changes are on the horizon, with a Cabinet reshuffle expected soon.\n\nThe Zanu PF leader made these remarks during a recent interview with ZBC News at State House.\n\nSources suggest that Mnangagwa is preparing to restructure his Cabinet to reduce the influence of those perceived to be loyal to his deputy, Constantino Chiwenga.\n\nThis move is seen as part of an ongoing power struggle within the ruling party.\n\nNdiri kumirira kuti vanhu vapedze kufara ndozovaudza vanofanira kudzoka kubasa nevanofanira kugara kumba depending ne performance, Mnangagwa stated in the interview. In English, he said, I am waiting for people to finish celebrating, then I will tell them who should return to work and who should stay at home, depending on performance.\n\nThis statement has fuelled speculation that the reshuffle may be a calculated move to strengthen Mnangagwas grip on both the party and government by sidelining those whose allegiance may lie with Chiwenga.\n\nTensions have reportedly been rising within Zanu PF, with various factions vying for power and influence following the 2023 elections.\n\nAdditionally, with constitutional provisions stating that Mnangagwa is not expected to remain in office beyond 2028, these moves could also be seen as preparations for a transition of leadership.\n\nAs Zimbabweans await the reshuffle, Mnangagwas comments have set the stage for potential political shifts, with many closely monitoring the developments within the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean President Emmerson Mnangagwa has indicated that significant changes are on the horizon, with a Cabinet reshuffle … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/restless-mnangagwa-speaks-on-2025-way-forward/\">Continue reading<span class=\"screen-reader-text\"> \"Restless Mnangagwa Speaks On 2025 Way Forward\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "The Critical Importance of Seatbelts in Road Safety…",
            "url": "https://www.zimeye.net/2024/12/27/the-critical-importance-of-seatbelts-in-road-safety/",
            "content": "Seatbelts are one of the most vital safety features in any vehicle, designed to protect drivers and passengers in the event of an accident. Much like airbags, seatbelts serve as a life-saving measure, reducing the risk of injury or death during a collision.\n\nDespite the proven effectiveness of seatbelts in preventing serious injuries, many people still choose not to wear them while driving or riding in a vehicle. This reckless behavior significantly increases the risk of harm in the event of an accident.\n\nWhen a person fails to wear a seatbelt, they are at a much higher risk of being ejected from the vehicle during a crash, which can be fatal. Even at low speeds, the force of a collision can cause severe injuries to unrestrained individuals. Seatbelts keep occupants securely in their seats, preventing them from being thrown around inside the vehicle or from being ejected through the windshield.\n\nThe benefits of seatbelt use are undeniable. Studies consistently show that seatbelts reduce the risk of fatal injury by 45% for drivers and 60% for passengers.\n\nFor children, the risk is even more significant, as seatbelts, when used correctly, can prevent serious injury or death.\n\nWhile seatbelts are an essential safety feature, their effectiveness depends on consistent and correct usage.\n\nSimply having a seatbelt in the car is not enough; everyone in the vehicle, regardless of age or seat position, should always buckle up. It is crucial for drivers to set an example and encourage all passengers to wear their seatbelts.\n\nIn conclusion, the importance of seatbelts cannot be overstated. They are a simple yet effective tool that saves lives and prevents serious injuries. Those who choose not to wear them are putting themselves in great danger. Buckling up should always be a top priority for anyone behind the wheel or riding as a passenger.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Seatbelts are one of the most vital safety features in any vehicle, designed to protect drivers and passengers in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/the-critical-importance-of-seatbelts-in-road-safety/\">Continue reading<span class=\"screen-reader-text\"> \"The Critical Importance of Seatbelts in Road Safety…\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Father Kills Own Son After Accusing Him of Rape",
            "url": "https://www.zimeye.net/2024/12/27/father-kills-own-son-after-accusing-him-of-rape/",
            "content": "By A Correspondent\n\nA tragic incident has unfolded in Matemazondo Village, Nembudziya, Gokwe, where a 41-year-old father, Trymore Hora, has been arrested for the murder of his 14-year-old son, Chalton Hora.\n\nAccording to the Zimbabwe Republic Police (ZRP), the incident occurred on December 23, 2024, when Trymore Hora accused his son of raping his 2-year-old daughter.\n\nIn a fit of rage, Hora allegedly assaulted Chalton with a sjambok, striking him indiscriminately all over his body.\n\nThe victim began vomiting shortly after the assault and tragically passed away on December 24, 2024.\n\nThe ZRP has since taken Trymore Hora into custody in connection with the murder case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident has unfolded in Matemazondo Village, Nembudziya, Gokwe, where a 41-year-old father, Trymore Hora, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/father-kills-own-son-after-accusing-him-of-rape/\">Continue reading<span class=\"screen-reader-text\"> \"Father Kills Own Son After Accusing Him of Rape\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Is Emmerson Mnangagwa Not Insulting Suffering Citizens By Wishing Them Good In Raging Economic Storm?",
            "url": "https://www.zimeye.net/2024/12/27/is-emmerson-mnangagwa-not-insulting-suffering-citizens-by-wishing-them-good-in-raging-economic-storm/",
            "content": "By A Correspondent\n\nOn Thursday, President Emmerson Mnangagwa of Zimbabwe released a festive statement wishing citizens a joyful holiday season. However, his message has sparked criticism, with many observing that it may come across as out of touch with the ongoing economic hardships facing the country.\n\nIn his message, Mnangagwa stated:\n\nOn behalf of my family, the Government, and myself, I wish Merry Christmas wishes to all Zimbabweans, at home and abroad. May this season bring joy, peace, and unity, and may 2025 be a year of renewed hope and prosperity for our beloved Zimbabwe.\n\nThe presidents words, which he shared via social media, included hashtags such as #MerryChristmas and #Prosperous2025, promoting a hopeful outlook for the year ahead.\n\nHowever, many Zimbabweans have taken issue with the timing and tone of the message, given the dire economic conditions many are enduring. The country continues to face soaring inflation, widespread poverty, and severe shortages of basic goods, including food and fuel. Observers argue that such a statement may feel insensitive, as many citizens are struggling to make ends meet during the festive season.\n\nOne critic remarked, While we appreciate the festive greetings, it is difficult to celebrate when the majority of the population is grappling with poverty and inflation. A message of hope rings hollow when people are unable to afford basic necessities.\n\nThe presidents words of unity and prosperity for 2025 have also been met with skepticism, with some questioning whether the governments policies will be able to deliver on these promises. Zimbabwe has faced a long history of economic challenges, and many are wary of political statements that lack tangible results.\n\nHow can one wish prosperity when millions of Zimbabweans are unemployed and struggling to survive? The government needs to address the core issues affecting peoples lives, said a local activist.\n\nWhile Mnangagwas message sought to inspire hope and peace, the reality of widespread suffering has made it difficult for many to accept such well-wishing as sincere. As Zimbabwe enters the holiday season, the divide between the governments optimistic rhetoric and the harsh reality for ordinary citizens remains painfully evident.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent On Thursday, President Emmerson Mnangagwa of Zimbabwe released a festive statement wishing citizens a joyful holiday season. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/is-emmerson-mnangagwa-not-insulting-suffering-citizens-by-wishing-them-good-in-raging-economic-storm/\">Continue reading<span class=\"screen-reader-text\"> \"Is Emmerson Mnangagwa Not Insulting Suffering Citizens By Wishing Them Good In Raging Economic Storm?\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Mnangagwa Signals Imminent Cabinet Reshuffle Amid Power Struggles",
            "url": "https://www.zimeye.net/2024/12/27/mnangagwa-signals-imminent-cabinet-reshuffle-amid-power-struggles/",
            "content": "By A Correspondent\n\nZimbabwean President Emmerson Mnangagwa has issued a stern warning regarding an impending Cabinet reshuffle.\n\nThe Zanu PF leader made the comments during a recent interview with ZBC News at State House.\n\nSources close to the matter suggest that Mnangagwa is preparing to make changes aimed at diminishing the influence of those seen as allies of his deputy, Constantino Chiwenga.\n\nThe move is widely seen as part of a broader power struggle within the ruling party.\n\nNdiri kumirira kuti vanhu vapedze kufara ndozovaudza vanofanira kudzoka kubasa nevanofanira kugara kumba depending ne performance, Mnangagwa said in the interview.\n\nTranslated, he expressed, I am waiting for people to finish celebrating, then I will tell them who should return to work and who should stay at home, depending on performance.\n\nThe statement has fueled speculation that the reshuffle could be a tactical move to consolidate Mnangagwas control over the party and government by removing those whose loyalty may lie with Chiwenga.\n\nThis comes amid reports of growing tensions within the ruling Zanu PF party, as factions vie for power and influence in the aftermath of the 2023 elections. In addition Mnangagwa is not expected to stay in office beyond 2028 in line with the Constitutional provisions.\n\nAs Zimbabweans wait for the reshuffle to unfold, Mnangagwas remarks signal that changes are imminent, and many are closely watching the political landscape for further developments.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean President Emmerson Mnangagwa has issued a stern warning regarding an impending Cabinet reshuffle. The Zanu PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/mnangagwa-signals-imminent-cabinet-reshuffle-amid-power-struggles/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Signals Imminent Cabinet Reshuffle Amid Power Struggles\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        },
        {
            "title": "Makhadzi Bursts Stadium",
            "url": "https://www.zimeye.net/2024/12/27/makhadzi-bursts-stadium/",
            "content": "Polokwane-Music sensation Makhadzi delivered a memorable 2024 concert at the new Peter Mokaba Stadium in Polokwane, Limpopo, over the weekend.\n\nDubbed theOne Woman Show,the event showcased her immense talent and drew a massive crowd.\n\nHowever, the aftermath hasleft the venue severely damaged, forcing authorities to relocate upcoming soccer matches.\n\nThe highly anticipated Betway Premiership fixture scheduled for this weekend between two top teams hasbeen movedto the old Peter Mokaba Stadium.\n\nThipa Selala, representing the Polokwane municipality, confirmed the relocation, citing the extensive damage to the pitch duringMakhadzisconcert.\n\nNo, the pitch at the new Peter Mokaba Stadium will not be able to accommodate the game on Saturday,Selala told KickOff.We are currently in discussions with stakeholders about utilizing the old Peter Mokaba Stadium and will communicate with the clubs as soon as possible.\n\nThemunicipalitysassessment revealed significant damage to the pitch, necessitating extensive repairs.\n\nAs a result, the stadium is unlikely to host any eventsbefore January 2025.\n\nIn the meantime, refurbishment plans are underway to restore the facility to its former glory.\n\nTo ensure the continuity of these fixtures, we have initiated discussions with all relevant stakeholders to relocate the matches,Selala added.We remain committed to maintaining the highest standards for our facilities and ensuring minimal disruption to scheduled events.\n\nMakhadzi has cemented her status as one of SouthernAfricastop musical acts, known for electrifying performances and a growing portfolio of collaborations.\n\nHer work with Zimbabwean icons such as Allick Macheso and Jah Prayzah has resonated deeply withfans across the region.\n\nFrom joint performances to chart-topping tracks, these partnerships have strengthened cultural ties and showcased the richness of regional music.\n\nNotable events include Makhadzi sharing the stage with Macheso and Jah Prayzah at sold-out shows in Zimbabwe and South Africa.\n\nThese collaborations havebeen laudedfor their energy and seamless fusion ofLimpoposvibrant rhythms withZimbabwestraditional and contemporary sounds.\n\nZimEye/KickOff\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Polokwane-Music sensation Makhadzi delivered a memorable 2024 concert at the new Peter Mokaba Stadium in Polokwane, Limpopo, over the weekend. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/27/makhadzi-bursts-stadium/\">Continue reading<span class=\"screen-reader-text\"> \"Makhadzi Bursts Stadium\"</span></a></p>",
            "time": "21:46",
            "date": "27 Dec 2024"
        }
    ]
}