{
    "news": [
        {
            "title": "Biti: Ministry of Finance Now Making Direct Payments to Suppliers and Contractors By-Passing Ministries and Votes",
            "url": "https://www.zimeye.net/2025/09/05/biti-ministry-of-finance-now-making-direct-payments-to-suppliers-and-contractors-by-passing-ministries-and-votes/",
            "content": "Former Finance Minister Tendai Biti announces allegations that the portfolio has begun by passing other ministries in making payments.\n\nThe accused have not commented. Full text:\n\nThe Constitution of Zimbabwe establishes a system of checks and balances in respect of the management and disbursements of public funds. Section 298(1)(a) makes it clear that there must be TRANSPARENCY and ACCOUNTABILITY in financial matters. Section 298(1)(d) further states that public funds must be expended transparently, prudently economically and effectively.\n\nThe countrys income is kept in a basket known as the Consolidated Revenue Fund (CRF)created by section 302 of the Constitution.All taxes fees and income are paid into this giant basket.\n\nWithdrawals from the CRF can only be made through an Act of Parliament. Thus Parliament controls the CRF and public expenditure in Zimbabwe.\n\nSection 299 of the Constitution makes it clear that Parliament must monitor and oversee expenditure by the State, including Ministries, Commissions and State Enterprises.Morefully section 299 obliges Parliament to ensure that all revenue and expenditure is fully accounted for and any limits and conditions on appropriation are fully observed.\n\nWithdrawals from the CRF are made through an Appropriation Act provided for in section 304 of the Constitution.\n\nEach year the Minister of Finance presents a Budget in respect of revenue proposals for the forthcoming year are made.\n\nIn addition he proposes budget allocations for Ministries, Commisions, Provincial Councils and other State Agents.Each allocation is called a Vote.\n\nThey are presently 39 such Votes consisting of 28 Ministries including Office of the President and Cabinet (OPC), 8 Commissions and 2 National Authorities, namely the National Council of Chiefs and the National Prosecuting Authority.\n\nWhen Parliament accepts the Ministry of Finances proposals it then passes an Appropiation Act where each of the 39 Votes is allocated seperate stand alone funds. The Appropiation Act is not one consolidated basket granted to the Ministry of Finance.\n\nRather it is seperate allocations made to the separate Ministries or Votes.\n\nEach Vote has an Accounting Officer, the Permanent Secretary who must account for the particular Vote.\n\nIndividual Accountability of a Vote is created by section 308. This makes it clear that it is the duty of every person who is responsible for expenditure of public funds to ensure that they are spent ONLY ON LEGALLY AUTHORIZED PURPOSES.\n\nFurther it is the duty of that person to ensure that public funds and assets under his control are safeguarded and are not lost damaged MISAPPLIED or MISUSED.\n\nFrom the above it is thus clear that Budget Allocations are made directly to Ministries Departments Agencies (MDAs) are the 39 Votes described above . These receive funds from the Budget through an Appropriation Act. They dont have free rein over amounts allocated or received.\n\nParliament through a detailed book known as the BLUE BOOK meticulously lays out how every penny is to be spend. A Ministry or Vote does not have a blank Cheque to spend as it wishes . The BLUE BOOK is part of the Appropiation Act approved by Parliament. When the Appropiation Account has been approved the Ministry of Finance allocates resources to Votes or Ministries as directed by Parliment thorough the Appropiation Act and the Blue Book.\n\nThe Ministry of Finance through the PAYMASTER GENERAL ( the permanent secretary) and the ACCOUNTANT GENERAL play an oversight role on all disbursements to Votes. The PAYMASTER GENERAL in terms of the Public Finance Management Act (PFMA) makes the payment through the Budget Office of the Ministry.\n\nHowever no disbursement is made without the Accountant General ensuring that the same was provided for in the BLUE BOOK & that FUNDs are actually on hand for cover Further once the Funds are in a particular Ministry , no payment can be made without a WARRANT from the Accountant General authorising any spayment . The Ministry of Finance by legal & constituional design is thus the GATE KEEPER of Public Funds allocated by Parliament.\n\nEach Ministry too has internal auditors that are answerable to the Accountant General . In addition all payments must be made on a digital platform known as the PFMS. This system is aligned to the Blue Book and will only process payments consistent with the Blue Book.\n\nEvery individual Vote or Ministry will have its individual secret codes and passwords to its PFMS portal . Illegal payments outside the Blue Book and a fortiori the PFMS can only be made manually outside the PFMS. But the Accountant General, and the Auditor General will pick this up.\n\nThere is therefore an elaborate Constitutional Legal and operational framework of ensuring that Parliament approves allocations which are then disbursed by the Ministry of Finance which then plays an oversight role in ensuringtransparency and accountability.\n\nRegrettably this rigid system of ensuring transparency and public accountability has been decimated under the 2nd Republic by the extractive unconstitutional process in respect of which Ministry of Finance itself is now making direct payments to suppliers and contractors by by-passing Ministries and Votes.\n\nIn the 2024 Budget 70% of Budget allocations were in the form of direct payments made illegally by the Ministry of Finance. Annexure F of the 2024 Auditor Generals Report discloses that US$2 billion was paid directly, by passing MDAs. Of the total amount of US$1 986 391 796.94 illegally paid directly, Ministries could only verify and confirm US$1.3 billion payments.\n\nTo date no one can account for nearly US$600 million dollars ( US$597 718 082,98). In simple terms the audit is simply stating that potentially US$600 million was stolen by or under the Ministry of Finance in 2024.\n\nOf interest are details of Ministries in respect of which direct payments are alleged to have been made for and on their behalf.\n\nThe top accounts are these:\n\nOPC : US$358 887 150,33\n\nFinance : US$152 410 450.70\n\nAgriculture: US$517 468 305.62\n\nTransport: US$255 689192.52\n\nLocal Gvt : US$74 736 856.79\n\nHigher Education: US$59 840409,00\n\nWomens Af: US$204 990 88,00\n\nNational Housing : US$54 808 101.58\n\nPSC : US$394 383621.57\n\nThese figures are shocking and raise many many questions.\n\nWhat for instance were the almost US$400 million made for OPC which amount in any event is one of those never acknowledged or verified.\n\nWhat were the payments for the PSC, when everyone knows only the PSC can and runs the payroll.\n\nNo one else can?\n\nWhat were the payments made for the Womens Affairs ministry nor for the moribund Housing ministry?\n\nThe sum of US$366 611,93 was paid for and on behalf of the Zimbabwe Election Commission. 2024 was not an election year, so these amounts were paid for what and to who?\n\nTruth is this has become a criminal republic.\n\nA kleptocracy.\n\nIn future forensic audits running from 2017 should be conducted.\n\nFor now, citizens are on their own.\n\nTruth is irresponsible to remain innocent bystanders.\n\nIn a country where the majority live in poverty it is gross human right abuse to steal from public coffers.\n\nCry the beloved country.Just cry!!\n\nTendai Biti former Finance Minister.\n\n3 September 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Former Finance Minister Tendai Biti announces allegations that the portfolio has begun by passing other ministries in making payments. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/biti-ministry-of-finance-now-making-direct-payments-to-suppliers-and-contractors-by-passing-ministries-and-votes/\">Continue reading<span class=\"screen-reader-text\"> \"Biti: Ministry of Finance Now Making Direct Payments to Suppliers and Contractors By-Passing Ministries and Votes\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "Tinted Windows Debacle Exposes Mnangagwa Administration’s Incompetence",
            "url": "https://www.zimeye.net/2025/09/05/tinted-windows-debacle-exposes-mnangagwa-administrations-incompetence/",
            "content": "The Emmerson Mnangagwa government has once again plunged into chaos after officials issued contradictory statements over the alleged ban on tinted vehicle windows.\n\nGovernment spokesperson Nick Mangwana, who initially endorsed the supposed ban on Wednesday, abruptly backtracked the following day, washing his hands of the policy. In a dismissive post on X, Mangwana wrote: Tint this, tint that. Tint what? Siyanai neni.\n\nHis reversal only deepened the confusion that had already been triggered by Justice Minister Ziyambi Ziyambis remarks in Parliament. On Wednesday, Ziyambi flatly stated that at the moment, we do not have any law banning tinted windows on vehicles, directly contradicting Presidential Affairs Secretary Tafadzwa Muguti.\n\nMuguti had confidently told journalists on Tuesday that tinted windows were outlawed, presenting it as an official government directive.\n\nThe embarrassing back-and-forth has left motorists frustrated and observers questioning the administrations competence. Critics say the debacle reflects a broader pattern of poor communication, lack of coordination, and governance failures under President Mnangagwas leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Emmerson Mnangagwa government has once again plunged into chaos after officials issued contradictory statements over the alleged ban on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/tinted-windows-debacle-exposes-mnangagwa-administrations-incompetence/\">Continue reading<span class=\"screen-reader-text\"> \"Tinted Windows Debacle Exposes Mnangagwa Administration’s Incompetence\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "Emmerson Mnangagwa’s Beijing Trip Raises Questions Over Zimbabwe’s Growing Dependence on China",
            "url": "https://www.zimeye.net/2025/09/05/emmerson-mnangagwas-beijing-trip-raises-questions-over-zimbabwes-growing-dependence-on-china/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas latest meeting with Chinese leader Xi Jinping in Beijing has sparked renewed concerns that Zimbabwe is sliding deeper into Beijings grip under the guise of upgraded relations.\n\nChina has elevated Zimbabwes ties from a Comprehensive Strategic Partnership to what it calls All-Weather Relations with a Shared and Common Future, a label meant to put Harare alongside Russia in Beijings global calculations. Critics argue this status does little for ordinary Zimbabweans, who continue to suffer under economic collapse while the ruling elite tightens ties with authoritarian allies.\n\nMnangagwa last met Xi in 2024, and his latest invitation to Beijing coincides with Chinas commemoration of the 80th Anniversary of its victory over fascism. Only two other African leadersthose from Congo-Brazzaville and Egyptwere in attendance, underscoring Beijings selective courting of regimes willing to toe its line.\n\nObservers note that while Mnangagwa boasts of special relations, Zimbabwe risks trading sovereignty for dependency, as Chinese influence steadily expands across the countrys economy, infrastructure, and natural resources.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s latest meeting with Chinese leader Xi Jinping in Beijing has sparked renewed concerns that … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/emmerson-mnangagwas-beijing-trip-raises-questions-over-zimbabwes-growing-dependence-on-china/\">Continue reading<span class=\"screen-reader-text\"> \"Emmerson Mnangagwa’s Beijing Trip Raises Questions Over Zimbabwe’s Growing Dependence on China\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "Prosecutor and Lawyer in Court for Obstructing Justice in Teen Rape Case",
            "url": "https://www.zimeye.net/2025/09/05/prosecutor-and-lawyer-in-court-for-obstructing-justice-in-teen-rape-case/",
            "content": "Mutare, Zimbabwe  5 September 2025\n\nA senior public prosecutor and a prominent lawyer are facing serious charges of obstructing justice in a disturbing case involving the sexual abuse of a 13-year-old girl.\n\nThe National Prosecuting Authority (NPA) of Zimbabwe confirmed yesterday that Public Prosecutor Timothy Katsande (34) and lawyer Benjamin Basikiti (35) appeared before the Mutare Magistrates Court on charges of defeating or obstructing the course of justice.\n\nAccording to court records, the duo conspired to alter material facts in a rape case by drafting a false Statement of Agreed Facts. The document falsely portrayed the relationship between the minor and the accused rapist as consensual, despite clear contrary evidence on record.\n\n Red Bullet Highlights:\n\nThe manipulation allowed the alleged perpetrator to plead guilty to a lesser charge of sexual intercourse with a minor, rather than statutory rape or aggravated sexual assault. This led to a reduced sentence of 36 months imprisonment, with part of the sentence suspended.\n\nIn a significant ruling on 4 September 2025, the Mutare Magistrates Court dismissed an application for discharge filed by Katsande and Basikiti, declaring that there was sufficient evidence for the matter to proceed to trial.\n\nLegal analysts say the case underscores the dangers of collusion within the justice system and raises concerns about the protection of vulnerable victims.\n\nThe matter has been remanded to 12 September 2025, when the defence is expected to present its case.\n\nThe NPA says it will leave no stone unturned in restoring integrity to the prosecutorial process.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare, Zimbabwe – 5 September 2025 A senior public prosecutor and a prominent lawyer are facing serious charges of obstructing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/prosecutor-and-lawyer-in-court-for-obstructing-justice-in-teen-rape-case/\">Continue reading<span class=\"screen-reader-text\"> \"Prosecutor and Lawyer in Court for Obstructing Justice in Teen Rape Case\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "UK Kaycie Burial Shifted Again To Zimbabwe",
            "url": "https://www.zimeye.net/2025/09/05/uk-kaycie-burial-shifted-again-to-zimbabwe/",
            "content": "Next-of-kin dispute shelved, but DJs body now redirected to Zimbabwe despite family consensus and embassy involvement\n\nBy A Correspondent |\n\nFresh confusion has gripped the burial arrangements of the late UK-based Zimbabwean DJ and socialite Kudzaishe Kaycie Chipadza, as his mother is now reportedly reversing a mutual family agreementa move that threatens to reignite tensions over where and how her son should be laid to rest.\n\nSources close to the family confirm that on a Sunday earlier this month, a verbal agreement was struck between Kaycies mother and her daughter-in-law, Beverly Hanyani, to shelve the controversial next-of-kin dispute. The arrangement saw the family agree that Kaycie would be buried in the UK, with his brother Tawanda Chipadza taking responsibility for the grave and all related arrangements.\n\n Agreement Collapses, Again\n\nHowever, just days after the agreement, the fragile truce began to crumble. The previously bitter next-of-kin legal dispute was briefly set aside, and preparations were already underway at a local cemetery. The initial grave cost of 2,100 has now ballooned to 9,600, reportedly because of delays and an upgraded site selection. Tawanda Chipadza had been named as the graves legal owner under the plan.\n\nBut in an unexpected turn, Kaycies mother is alleged to have scrapped the entire UK burial plan, despite having been part of the negotiations. Family insiders say she has now made a unilateral decision to repatriate her sons body to Zimbabwe, nullifying the agreement with both her daughter-in-law and an official representative from the Zimbabwean Embassy in London.\n\n Embassy-Backed Plan Overridden\n\nA representative from the Zimbabwe Embassy in London had reportedly been involved in the arrangement, endorsing the burial in the UK as a peaceful and respectful resolution that accounted for cost, logistics, and emotional closure for all involved parties. The involvement of the embassy was meant to act as a stabilising force amid swirling tensions.\n\nBut now, those plans appear to be in jeopardy, with the mother pressing the reset button, shifting everything towards a Zimbabwe burial.\n\nAll plans have been cancelled, a family insider said. The body will now be flown to Harare.\n\n Legacy in Limbo\n\nThe back-and-forth adds another layer of emotional distress for a family still mourning the shocking loss of a beloved son, father, and friend. Kaycie, who passed away on 2 June 2025, was well known across the Zimbabwean diaspora in the UK and beyond. His death has sparked a flood of tribute messagesbut also unsubstantiated conspiracy theories, toxic WhatsApp group disputes, and now, an unfolding logistical nightmare.\n\nWhat started as a legal challenge over who had the right to bury himhis mother or his widowappeared to be resolved with Sundays agreement. But the recent reversal now suggests deep divisions remain, with grief giving way to control battles and ever-growing expenses.\n\n Whats Next?\n\nAs of now, the latest position is that Kaycie will be buried in Zimbabwe, although questions remain about: Who authorised the reversal? Whether the widow Beverly was consulted or informed? What role the embassy will play moving forward? How the family will manage the inflated burial costs now sunk into the abandoned UK plan?\n\n A Family Torn\n\nWith the UK burial plans scrapped, the family must now face new costs, new logistics, and likely, new legal hurdles. Whether Kaycies burial will finally proceed in Zimbabwe without further disputeor whether a new legal intervention may halt those plansis yet to be seen.\n\nAs one family observer put it:\n\nIts no longer about Kaycie. Its a family war now.\n\nMore updates as the story unfolds.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Next-of-kin dispute shelved, but DJ’s body now redirected to Zimbabwe despite family consensus and embassy involvement By A Correspondent | … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/05/uk-kaycie-burial-shifted-again-to-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"UK Kaycie Burial Shifted Again To Zimbabwe\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "What Lured Mzembi Out of His SA Foxhole into a Zimbabwe Prison? The Obvious Answer: His Slush Fund Was Spent, He Was Broke!",
            "url": "https://www.zimeye.net/2025/09/04/what-lured-mzembi-out-of-his-sa-foxhole-into-a-zimbabwe-prison-the-obvious-answer-his-slush-fund-was-spent-he-was-broke/",
            "content": "By Wilbert Mukori | Why did Walter Mzembi leave his exile foxhole in South Africa only to be thrown in jail back in Zimbabwe?\n\nOne plausible explanation is that Walter Mzembi returned to Zimbabwe because his slush fund was spent. Others, like Grace Mugabe, Saviour Kasukuwere and the other G40 leaders, had put aside far more cash and valuable assets for a rainy day from their wholesale looting in Zimbabwe. Poor Walter Mzembis hoard was not so well stocked and after eight yearsmost of it spent on frugal living, no doubtit was gone.\n\nMzembi did not want to take up any of the low-paying jobs many Zimbabweans in South Africa and beyond have been forced to do. His pride would not allow it. He was, after all, one of Robert Mugabes blue-eyed ministers. He could not be seen working as a shop assistant or a chauffeur, driving the boss and his family wherever they wanted to go.\n\nWe are all aware of the ill-treatment many Zimbabweans have received in South Africa. We have seen videos of foreigners hounded out of hospitals and clinicsand worse!\n\nI would bet my bottom dollar that Walter Mzembi was as keen as mustard to see Saviour Kasukuwere contest the 2023 presidential elections. He saw it as his ticket back to Zimbabwe and former glory. One can well imagine his disappointment when the attempt fizzled into nothing.\n\nWith no money in his pockets and his last throw of the dice for a comeback lost, Walter Mzembi had no choice but to eat humble pie and make peace with Mnangagwa. He had been too close to the Mugabes to be seen as anything other than a G40 leader, and so the 2017 coup caught him off guard.\n\nMnangagwa is not clever, and that has made him insecure and suspicious of everyone around him. He is paranoid and dangerous. No doubt, Walter Mzembi knew thisand hence the reason he and other G40 leaders lived in exile. But now that he is stone broke, he had no choice but to come back and hope for the best.\n\nMnangagwa allowed him to return but, before he had even settled down, brewed the traditional beer, and sprinkled snuff to thank his ancestors for his return, Mnangagwa threw him in jail. On top of his financial woes, he now has jail time. Life in a Zimbabwean prison is hell on earth, and it is reported that he also has health problems.\n\nWill Mnangagwa finally release him now that he is a broken man, or will he keep him in prison until he leaves in a box? Time will tell!\n\nWalter Mzembi is now having a taste of Zanu PFs tyrannical rule and its consequences. What goes around comes around! Aiva madziva, ava mazambuko!\n\nDo I feel sorry for Mzembi? Frankly, no! Let this be a lesson to all the Zanu PF thugs out there. You have destroyed Zimbabwe with your insatiable greed for power and wealth, thinking your position at the looting table was secure. Mzembi and other G40 leaders thought so toountil 15 November 2017, when their world was turned upside down forever.\n\nIt took 37 years before Mzembi and the other G40 leaders faced their day of reckoning. The wheels of justice turn very slowly, but they turn nonetheless! This Zanu PF dictatorship is doomed to collapseof that we can be certain!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Wilbert Mukori | Why did Walter Mzembi leave his exile foxhole in South Africa only to be thrown in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/what-lured-mzembi-out-of-his-sa-foxhole-into-a-zimbabwe-prison-the-obvious-answer-his-slush-fund-was-spent-he-was-broke/\">Continue reading<span class=\"screen-reader-text\"> \"What Lured Mzembi Out of His SA Foxhole into a Zimbabwe Prison? The Obvious Answer: His Slush Fund Was Spent, He Was Broke!\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "Prominent Masvingo War Veteran Patrick Sibanda Dies",
            "url": "https://www.zimeye.net/2025/09/04/prominent-masvingo-war-veteran-patrick-sibanda-dies/",
            "content": "By A Correspondent\n\nVeteran of Zimbabwes liberation struggle, Patrick Sibanda, has passed away in Masvingo.\n\nRelatives said Sibanda breathed his last at Masvingo Provincial Hospital on Thursday after a prolonged fight with diabetes.\n\nHis family confirmed the news later in the day, describing his death as a painful loss to both the community and those who shared in his liberation journey.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Veteran of Zimbabwe’s liberation struggle, Patrick Sibanda, has passed away in Masvingo. Relatives said Sibanda breathed his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/prominent-masvingo-war-veteran-patrick-sibanda-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Masvingo War Veteran Patrick Sibanda Dies\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "Warriors Keen To Bury Benin",
            "url": "https://www.zimeye.net/2025/09/04/warriors-keen-to-bury-benin/",
            "content": "Sports Correspondent\n\nWarriors coach Michael Nees has explained the thinking behind his squad selection headaches ahead of Zimbabwes 2026 FIFA World Cup Qualifiers, where the team will battle Benin and Rwanda.\n\nStriker Tymon Machope, who was initially overlooked despite scoring a brace for Scotland FC against Dynamos on Saturday, eventually earned a late call-up after midfielder Jonah Fabisch was ruled out through injury. Nees admitted that deciding between Machope and Thando Ngwenya was far from straightforward.\n\nThere was a tight call between Thando and Machope. Although Machope had a very good run, Thando has also been exceptional, Nees told ZIFA Media.\n\nThe German coach acknowledged that Machope forced his way back into contention with his recent form. Thando made a statement, and thats the reaction you want as a coach from a player. Tymon also made a statement  you go to the game and he scores two goals. He shows the coach that you made a mistake. Take me. And thats a fact, so I didnt hesitate.\n\nNees stressed that the technical team had to weigh both fitness and performance levels before finalising the squad. We had to wait to check all the other players. Thando has done very well, and we hope he can continue with the same work with us, he added.\n\nZimbabwe faces Benin on 5 September in Abidjan, Ivory Coast, before heading to South Africa to take on Rwanda on 9 September.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Warriors coach Michael Nees has explained the thinking behind his squad selection headaches ahead of Zimbabwe’s 2026 FIFA … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/warriors-keen-to-bury-benin/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Keen To Bury Benin\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "Do You Trust Hopewell’s Sudden Sympathy For Chamisa Using Mliswa’s Name?",
            "url": "https://www.zimeye.net/2025/09/04/do-you-trust-hopewells-sudden-sympathy-for-chamisa-using-mliswas-name/",
            "content": "Do you trust Chinonos abrupt sympathy towards Chamisa using Mliswas name, after 7years of own campaign to make Nelson dead as dodo, a reality?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:07",
            "date": "06 Sep 2025"
        },
        {
            "title": "Warriors Revelation Keen To Impress…",
            "url": "https://www.zimeye.net/2025/09/04/warriors-revelation-keen-to-impress/",
            "content": "By Sports Correspondent\n\nRising star Prosper Padera says he is relishing the chance to rub shoulders with seasoned professionals in the Warriors squad as Zimbabwe prepares for its upcoming World Cup qualifiers.\n\nThe 18-year-old midfielder, first discovered at the Marvelous Nakamba Grassroots Tournament, has secured his second call-up to the national team ahead of the crucial Group C fixtures against Benin and Rwanda.\n\nPadera, who made his Warriors debut during the 2025 COSAFA Cup in South Africa, left a strong impression on the technical team with his energetic displays. Speaking to ZIFA Media on Wednesday, the youngster could not hide his excitement.\n\nIm very excited to be called to the national team. When I was called to the COSAFA Cup, that was my first time, and I made sure I impressed so that I could be called again, he said.\n\nHe added that training alongside senior players such as Marvelous Nakamba has been a valuable learning curve. The quality in the team is good and intense. Its nice to see the big guys like Marvelous Nakamba. The way they pass the ball and move, its just something else. This gives me a good platform to learn from them.\n\nZimbabwe will open its 2026 FIFA World Cup Qualifiers campaign against Benin on 5 September in Abidjan, Ivory Coast, before travelling to South Africa to face Rwanda on 9 September.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Rising star Prosper Padera says he is relishing the chance to rub shoulders with seasoned professionals in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/04/warriors-revelation-keen-to-impress/\">Continue reading<span class=\"screen-reader-text\"> \"Warriors Revelation Keen To Impress…\"</span></a></p>",
            "time": "09:07",
            "date": "06 Sep 2025"
        }
    ]
}