{
    "news": [
        {
            "title": "Amorim Insists Manchester United Outplayed Arsenal Despite Defeat",
            "url": "https://www.zimeye.net/2025/08/18/amorim-insists-manchester-united-outplayed-arsenal-despite-defeat/",
            "content": "By Sports Correspondent\n\nManchester United manager Ruben Amorim has defended his side following their 1-0 loss to Arsenal in the Premier League opener at Old Trafford, insisting the Red Devils were the dominant team on the day.\n\nSpeaking after the match, Amorim expressed confidence in his squads performance despite the result.We proved today that we can win any game in the Premier League,he said.\n\nUnited controlled 61% of possession and created several chances but failed to convert, with poor finishing and a costly goalkeeping mistake proving decisive.\n\nAmorim maintained that, aside from the single error that gifted Arsenal the winning goal, his side had shown superiority and deserved more from the contest.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Manchester United manager Ruben Amorim has defended his side following their 1-0 loss to Arsenal in the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/amorim-insists-manchester-united-outplayed-arsenal-despite-defeat/\">Continue reading<span class=\"screen-reader-text\"> \"Amorim Insists Manchester United Outplayed Arsenal Despite Defeat\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "ZIFA Hits Referee Rusununguko Mutero With Suspension",
            "url": "https://www.zimeye.net/2025/08/18/zifa-hits-referee-rusununguko-mutero-with-suspension/",
            "content": "By Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has suspended referee Rusununguko Mutero for six Premier Soccer League (PSL) match days following concerns over his performance during a recent league fixture.\n\nIn a statement issued on Monday, ZIFA confirmed that Mutero will not be allowed to officiate from matchday 24 to matchday 29 of the 2025 season.\n\nThe Zimbabwe Football Association wishes to inform all stakeholders, media, and the football fraternity that referee Rusununguko Mutero has been suspended from officiating in the Castle Lager Premier Soccer League for a period of six match days, read part of the statement.\n\nThe disciplinary action stems from Muteros handling of the PSL clash between Green Fuel FC and FC Platinum, played on July 26 at Green Fuel Arena. According to the Match Commissioners report, his decisions fell short of the required standards, in breach of paragraph 21 of the Referees Code of Conduct.\n\nZIFA stressed that the move is part of its broader commitment to maintaining the integrity of the game. As the governing body of football in Zimbabwe, ZIFA remains committed to upholding the highest standards of refereeing, fairness, and integrity in the game. Continuous monitoring and accountability measures are in place to ensure that match officials maintain professionalism and consistency in their duties, the association said.\n\nThe suspension is expected to serve as a warning to other referees, as ZIFA pushes for improved officiating standards in the domestic league, which has faced increasing scrutiny from players, coaches, and fans over refereeing inconsistencies.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent The Zimbabwe Football Association (ZIFA) has suspended referee Rusununguko Mutero for six Premier Soccer League (PSL) match … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/zifa-hits-referee-rusununguko-mutero-with-suspension/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Hits Referee Rusununguko Mutero With Suspension\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "Zumbani Steaming Kills Toddler",
            "url": "https://www.zimeye.net/2025/08/18/zumbani-steaming-kills-toddler/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) have reported a tragic incident at Fresney Farm in Beatrice, where a two-year-old boy lost his life after sustaining severe burns from hot water.\n\nThe incident occurred on 15 August 2025 while the child and his mother were engaged in a traditional steaming session using hot water and zumbani.\n\nAccording to police reports, the toddler accidentally touched a plastic container filled with hot water, which spilled onto his right side and neck, resulting in critical burns.\n\nEmergency responders rushed the child to Beatrice Hospital, but he was pronounced dead upon arrival.\n\nAuthorities have urged caregivers to exercise extreme caution when handling hot water around young children to prevent similar accidents in the future.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) have reported a tragic incident at Fresney Farm in Beatrice, where a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/zumbani-steaming-kills-toddler/\">Continue reading<span class=\"screen-reader-text\"> \"Zumbani Steaming Kills Toddler\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "Mnangagwa Unwilling To Forgive Mugabe Relative ?",
            "url": "https://www.zimeye.net/2025/08/18/mnangagwa-unwilling-to-forgive-mugabe-relative/",
            "content": "By A Correspondent\n\nFORMER ZANU PF Central Committee member and Mines and Mining Development Minister Walter Chidhakwa has been readmitted into the party.\n\nThe announcement was made by ZANU PF Mashonaland West chairperson Mary Mliswa-Chikoka during the partys Provincial Coordinating Committee meeting held in Chinhoyi on Saturday.\n\nChidhakwa, a relative of the late President Robert Mugabe, was expelled from the party in 2017. He had not been a member for the past eight years and recently applied for readmission.\n\nWe have a confirmation from the partys headquarters that Cde Chidhakwa has been readmitted, Mliswa-Chikoka said, before inviting any objections or secondments from members.\n\nThe partys Sanyati District Coordinating Committee chairperson Langton Mabhanga welcomed the decision, saying it reflected President Mnangagwas call for unity and reconciliation.\n\nI second the readmission of Cde Chidhakwa into the party and see no reason to object to it. Our President speaks of unity and giving second chances. We will be glad to have him back into the party, Mabhanga said, drawing cheers from attendees.\n\nMliswa-Chikoka is expected to forward the provincial resolution on Chidhakwas readmission to the partys national headquarters.\n\nThe meeting also welcomed the partys new provincial administrator, Albert Mhlanga, who replaces Fanny Chikomba, retired earlier this year after years of dedicated service.\n\nMliswa-Chikoka provided updates on membership mobilisation and cell verification, emphasising the need to strengthen engagement in urban areas.\n\nWe are working diligently to address the concerning statistics reflecting our urban membership, she said. The ongoing verification exercise has made it clear that there is significant work needed in these areas.\n\nPreparations for the 2025 ZANU PF National Peoples Conference, to be held in Mutare, were also reviewed. The province has secured six cattle and is running a campaign to raise the US$50,000 required for the conference.\n\nHowever, a ZANU PF source in Mashonaland West claimed that President Mnangagwa remains reluctant to forgive Chidhakwa.\n\nThe source said, Despite the readmission, the President has made it clear that he is not fully comfortable with welcoming Chidhakwa back. There is still tension over past issues that cannot be ignored.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent FORMER ZANU PF Central Committee member and Mines and Mining Development Minister Walter Chidhakwa has been readmitted … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/mnangagwa-unwilling-to-forgive-mugabe-relative/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Unwilling To Forgive Mugabe Relative ?\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "Masvingo Urban Ward 7 Voters Rally Behind Sole Female Candidate in By-election…",
            "url": "https://www.zimeye.net/2025/08/18/masvingo-urban-ward-7-voters-rally-behind-sole-female-candidate-in-by-election/",
            "content": "By A Correspondent\n\nIn a significant moment for Masvingo Urban Ward 7, residents have expressed strong support for Tsungai Mandati, also known as Mai Masimba, the sole female candidate in the by-election scheduled for September 13, 2025.\n\nThe by- election follows the passing of Councillor Tafara Masimba in July.\n\nMandatis candidacy has sparked conversations on womens empowerment in a political environment still dominated by male chauvinism.\n\nResidents and local leaders say her campaign represents an opportunity to break barriers and give women a stronger voice in local governance.\n\nMandati has pledged to focus on community development, social welfare, and initiatives that empower women and youth. I understand the challenges faced by women in leadership, but I believe our community is ready for inclusive representation, she said.\n\nObservers note that her campaign could serve as a benchmark for female participation in politics across Masvingo province and beyond. By taking the lead in a traditionally male-dominated arena, Mandatis victory would signal a shift to greater gender equality in local governance.\n\nWith voters increasingly aware of the importance of womens voices in political decision-making, Tsungai Mandatis campaign is being closely watched as a potential milestone for womens empowerment in Zimbabwean politics.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a significant moment for Masvingo Urban Ward 7, residents have expressed strong support for Tsungai Mandati, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/masvingo-urban-ward-7-voters-rally-behind-sole-female-candidate-in-by-election/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Urban Ward 7 Voters Rally Behind Sole Female Candidate in By-election…\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "Will Auxillia Mnangagwa’s Donations Fix Health Crisis In Zimbabwe?",
            "url": "https://www.zimeye.net/2025/08/18/will-auxillia-mnangagwas-donations-fix-health-crisis-in-zimbabwe/",
            "content": "By A Correspondent\n\nWhile First Lady Dr Auxillia Mnangagwas recent nationwide donation of medical supplies and equipment to public hospitals has been widely praised, critics argue that such interventions are a temporary fix and cannot address the chronic underfunding and systemic challenges facing Zimbabwes public health system.\n\nThe donation, which included wheelchairs, resuscitators, ICU patient circuits, surgical scrubs, paediatric equipment, and other essential medical supplies, reached hospitals across all 10 provinces, including Parirenyatwa Group of Hospitals, United Bulawayo Hospitals, Mpilo Central, and Sally Mugabe Central.\n\nSister Fenny Chapman of Parirenyatwa acknowledged the support but warned, These supplies are helpful, but they dont solve the bigger issues we face daily. We still struggle with shortages of staff, medicines, and funding.\n\nSimilarly, Teclar Nyamande from Masvingo Provincial Hospital said, The First Ladys contributions are welcome, but our challenges run much deeper.\n\nOur facilities cannot function sustainably without consistent government investment.\n\nEven with the First Ladys Angel of Hope Foundation sourcing donations from international partners, health officials stressed that the aid only covers basic equipment and consumables. Lawrence Mondiwa from Mpilo Central Hospital highlighted, While donations help, they cannot replace the need for a fully funded healthcare system that supports both staff and patients consistently.\n\nSeveral hospital representatives echoed concerns over over-reliance on philanthropic support. Gladys Chiutsi of Victoria Chitepo Provincial Hospital said, We appreciate the help, but real change requires proper planning and government commitment to ensure long-term access to quality care for all Zimbabweans.\n\nThe recurring reliance on external donations underscores the persistent underfunding in government hospitals, with facilities struggling to maintain essential services, upgrade infrastructure, and adequately compensate staff.\n\nExperts warn that while donations from Dr Mnangagwa provide temporary relief, they risk masking the deeper failures of Zimbabwes healthcare system.\n\nWithout sustained government intervention, public hospitals will continue to face shortages, overstretched staff, and limited access to critical care, leaving vulnerable communities at risk.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent While First Lady Dr Auxillia Mnangagwa’s recent nationwide donation of medical supplies and equipment to public hospitals … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/will-auxillia-mnangagwas-donations-fix-health-crisis-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Will Auxillia Mnangagwa’s Donations Fix Health Crisis In Zimbabwe?\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "High Court Blocks Unifreight’s Bid to Escape US$2.9m Labour Claim",
            "url": "https://www.zimeye.net/2025/08/18/high-court-blocks-unifreights-bid-to-escape-us2-9m-labour-claim/",
            "content": "Top bus operators efforts to evade multimillion-dollar claim by ex-employer fails\n\nThe High Court of Zimbabwe has struck off the roll an application by Unifreight Africa Limited seeking to escape a multimillion-dollar damages ruling in favour of former Pioneer Coaches managing director, Nicholas Mukarati, declaring that only the Labour Court has the power to decide whether an employment relationship exists between the two parties.\n\nIn a recentjudgment, Justice Christopher Dube-Banda ruled that Unifreights attempt to secure a declaratur from the High Court was a misstep, insisting that labour disputes fall under the Labour Courts exclusive jurisdiction.\n\nThis is a labour matter. It cannot cease to be a labour matter merely because the applicant contends that it is not the employer, said the judge.\n\nThe question whether there exists an employment relationship between the applicant and the first respondent is the very issue that the Labour Court has, in the first instance, exclusive jurisdiction to determine.\n\nMukarati, who has been battling his former employers since his dismissal in 2010, is claiming more than US$2.9 million in damages and arrear salaries.\n\nHe argues that Unifreight  formerly known as Pioneer Corporation Africa Limited  was his true employer and should be held liable.\n\nUnifreight, however, insists Mukarati was employed by Pioneer Coaches (Private) Limited, a separate entity it once held shares in but later divested from.\n\nIts lawyers accused Mukarati of conflating the identity of his employer and argued that the Labour Officer wrongly burdened the applicant with an obligation that does not belong to it.\n\nBut Justice Dube-Banda dismissed the companys arguments as contradictory and opportunistic.\n\nThis is a textbook case for approbating and reprobating, the judge said. On one hand, in the appeal [before the Labour Court] it accepts that the Labour Court has jurisdiction to pronounce on the existence or otherwise of an employeremployee relationship, on the other hand in this court, it says the Labour Court does not have such jurisdiction.\n\nCiting the Supreme Courts landmark decision in TN Harlequin Luxaire Ltd v Matsvimbo, the judge emphasised that the High Court cannot usurp the role of the Labour Court: The Labour Court in its daily operations does routinely issue declaratory orders The contention that the Labour Court cannot issue a declaratur is incorrect and untenable.\n\nIn the end, the application was struck off with costs.\n\nThe first respondent is clearly entitled to his costs, ruled Justice Dube-Banda.\n\nThe Labour Court is still to determine Unifreights pending appeal against the Labour Officers 2023 award, a decision that could either cement or undo Mukaratis long-awaited payout.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Top bus operator’s efforts to evade multimillion-dollar claim by ex-employer fails The High Court of Zimbabwe has struck off the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/high-court-blocks-unifreights-bid-to-escape-us2-9m-labour-claim/\">Continue reading<span class=\"screen-reader-text\"> \"High Court Blocks Unifreight’s Bid to Escape US$2.9m Labour Claim\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "Mugabe Relative Seeks Comeback …",
            "url": "https://www.zimeye.net/2025/08/18/mugabe-relative-seeks-comeback/",
            "content": "By A Correspondent \n\nFORMER ZANU PF Central Committee member and Mines and Mining Development Minister Walter Chidhakwa has been readmitted into the party.\n\nThe announcement was made by ZANU PF Mashonaland West chairperson Mary Mliswa-Chikoka during the partys Provincial Coordinating Committee meeting held in Chinhoyi on Saturday.\n\nChidhakwa, a relative of the late President Robert Mugabe, was expelled from the party in 2017. He had not been a member for the past eight years and recently applied for readmission.\n\nWe have a confirmation from the partys headquarters that Cde Chidhakwa has been readmitted, Mliswa-Chikoka said, before inviting any objections or secondments from members.\n\nThe partys Sanyati District Coordinating Committee chairperson Langton Mabhanga welcomed the decision, saying it reflected President Mnangagwas call for unity and reconciliation.\n\nI second the readmission of Cde Chidhakwa into the party and see no reason to object to it. Our President speaks of unity and giving second chances. We will be glad to have him back into the party, Mabhanga said, drawing cheers from attendees.\n\nMliswa-Chikoka is expected to forward the provincial resolution on Chidhakwas readmission to the partys national headquarters.\n\nThe meeting also welcomed the partys new provincial administrator, Albert Mhlanga, who replaces Fanny Chikomba, retired earlier this year after years of dedicated service.\n\nMliswa-Chikoka provided updates on membership mobilisation and cell verification, emphasising the need to strengthen engagement in urban areas.\n\nWe are working diligently to address the concerning statistics reflecting our urban membership, she said. The ongoing verification exercise has made it clear that there is significant work needed in these areas.\n\nPreparations for the 2025 ZANU PF National Peoples Conference, to be held in Mutare, were also reviewed. The province has secured six cattle and is running a campaign to raise the US$50,000 required for the conference.\n\nHowever, a ZANU PF source in Mashonaland West claimed that President Mnangagwa remains reluctant to forgive Chidhakwa.\n\nThe source said, Despite the readmission, the President has made it clear that he is not fully comfortable with welcoming Chidhakwa back.\n\nThere is still tension over past issues that cannot be ignored.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent … FORMER ZANU PF Central Committee member and Mines and Mining Development Minister Walter Chidhakwa has been … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/mugabe-relative-seeks-comeback/\">Continue reading<span class=\"screen-reader-text\"> \"Mugabe Relative Seeks Comeback …\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "Zanu PF’s Tagwirei Dies",
            "url": "https://www.zimeye.net/2025/08/18/zanu-pfs-tagwirei-dies/",
            "content": "By A Correspondent\n\nZanu PF Ward 4 councillor, Philip Garirai Tagwirei of Nyazvidzi, has passed away, leaving the local community in shock.\n\nTagwirei died on Sunday night at Murambinda Hospital in Buhera.\n\nThe exact circumstances surrounding his death have not been publicly disclosed, though sources indicate he had been receiving medical attention in recent weeks.\n\nFuneral arrangements are underway, with burial scheduled to take place at the family farm in Nyazvidzi on Tuesday.\n\nZanu PF Masvingo provincial spokesperson, Pepukai Chiwewe, has not yet issued an official statement regarding Tagwireis death. Party officials and local authorities are expected to release further details in the coming days.\n\nThe sudden passing of Councillor Tagwirei has sent ripples through Nyazvidzi and the wider Gutu district, as the community awaits more information on funeral proceedings and official tributes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF Ward 4 councillor, Philip Garirai Tagwirei of Nyazvidzi, has passed away, leaving the local community … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/zanu-pfs-tagwirei-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF’s Tagwirei Dies\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        },
        {
            "title": "Borehole Levy Punishes Citizens for Local Govt Failure",
            "url": "https://www.zimeye.net/2025/08/18/borehole-levy-punishes-citizens-for-local-govt-failure/",
            "content": "By Engineer Jacob Kudzayi Mutisi\n\nIn Zimbabwe today, the simple act of turning on a tap and expecting clean, running water is no longer an everyday reality. The state of the countrys water provision has deteriorated so drastically that citizens have been forced to find alternative means of survival. For many, this has meant drilling boreholes, a solution once regarded as an emergency measure but which has now become a permanent fixture of daily life.\n\nThe government itself has tacitly admitted failure in providing reliable water services. Through the launch of the Presidential Borehole Scheme, it has resorted to drilling boreholes across the country in an attempt to cushion communities from perennial water shortages. On the surface, this appears to be a positive step. Yet, beneath the veneer lies a troubling contradiction: the same government that cannot provide its citizens with basic tap water now demands a staggering US$300 fee for households to drill their own boreholes.\n\nThis levy, imposed through statutory instruments, amounts to punishing citizens for the failures of government and local authorities. In a nation where access to clean water is enshrined as a fundamental human right under the Constitution, the imposition of such a cost is both unjust and unethical.\n\nZimbabwes water infrastructure, once envied across the region, has collapsed. In cities like Harare and Bulawayo, water rationing is no longer the exception but the norm. Residents go for days, sometimes weeks, without receiving a drop through their taps. Pipes are burst, treatment plants outdated and pumping stations crippled by years of neglect, corruption and mismanagement.\n\nLocal authorities, starved of investment and resources, have failed to maintain the systems inherited from colonial times. Harare, with a population of over two million, relies on Lake Chivero, a water body long contaminated by industrial effluent, sewage and agricultural run-off. The citys Morton Jaffray Water Treatment Plant operates well below capacity, while chronic shortages of chemicals mean even the limited water that can be treated is often unsafe.\n\nMeanwhile, Bulawayo faces an equally dire crisis. The Matabeleland regions semi-arid conditions have always posed challenges, but the lack of long-term planning has made matters worse. The much-vaunted Zambezi Water Project, first mooted in 1912, remains nothing more than a political slogan.\n\nIn rural areas, villagers have long depended on boreholes and wells, but these are often few and far between. Women and children walk kilometres daily in search of water, sometimes drawing from unsafe rivers and dams.\n\nAgainst this backdrop of systemic collapse, boreholes have become the lifeline of survival. They provide families with water for drinking, cooking, bathing and even small-scale gardening. Communities that have invested in boreholes enjoy a measure of independence from the failures of local authorities.\n\nYet instead of encouraging self-sufficiency, the government has chosen to impose a US$300 permit fee for borehole drilling. Officials argue that the charge is meant to regulate groundwater use and prevent environmental degradation. But in practice, the fee has become nothing more than a barrier to survival.\n\nFor the majority of Zimbabweans, whose incomes have been eroded by inflation and unemployment, US$300 is not merely a fee  it is a small fortune. In rural areas where poverty levels are highest, such an amount is unattainable. Even in urban centres, families struggling to put food on the table cannot be expected to pay hundreds of dollars simply for the right to access water on their own land.\n\nThe result is cruelly paradoxical: citizens who attempt to help themselves where government has failed are penalised, while those who cannot afford boreholes are left at the mercy of empty taps and unsafe rivers.\n\nA Question of Priorities\n\nThe borehole levy is not only unfair, it exposes the warped priorities of Zimbabwes policymakers. In a country where government expenditure on luxury vehicles for officials, foreign trips and endless political campaigns runs into millions of dollars, it is unconscionable to demand that ordinary families pay to secure access to a basic human necessity.\n\nThe introduction of the Presidential Borehole Scheme further underlines this contradiction. Boreholes are drilled at state expense as part of a political programme, often in selected constituencies and unveiled with great fanfare. Yet the same government insists that households and communities outside the scheme pay hefty fees to drill their own. This is not governance, it is politicisation of water.\n\nIt is worth recalling that the United Nations recognises access to safe and clean drinking water as a human right essential to the full enjoyment of life. By turning borehole drilling into a revenue-raising exercise, Zimbabwes authorities are effectively commercialising a right they have already failed to uphold.\n\nEnvironmental Concerns or Revenue Motive?\n\nThe governments stated justification for the fee rests on environmental grounds. Officials claim that unregulated borehole drilling could deplete underground aquifers, leading to long-term ecological damage. There is truth in this concern. Across the globe, over-extraction of groundwater has led to serious consequences, from land subsidence to drying aquifers.\n\nHowever, regulation does not necessitate punitive fees. Responsible governance would involve conducting geological surveys, mapping aquifers and issuing guidelines on drilling depths and spacing between boreholes. Citizens could be required to register boreholes for record-keeping purposes, but charging US$300 per household cannot be defended as a genuine environmental safeguard.\n\nIndeed, in practice, the levy has become yet another source of rent-seeking. Corruption is rife, with some citizens forced to pay bribes to secure permits. Rather than protecting the environment, the law has created yet another avenue for officials to extract money from a desperate populace.\n\nIf Zimbabwe is to rebuild its water security, the government must first recognise that punishing citizens is not the solution. These are the steps required:\n\nAbolish the Borehole Levy  The US$300 fee must be scrapped immediately. Citizens drilling boreholes to survive should not be taxed for government incompetence. Regulation, if necessary, should be administrative and affordable, not prohibitive.\n\nRehabilitate Urban Water Infrastructure  Local authorities, with central government support, must invest in repairing water treatment plants, pipelines and pumping stations. Priority should be placed on upgrading facilities such as Morton Jaffray in Harare and Nyamandlovu Aquifer supply in Bulawayo.\n\nPromote Decentralised Water Solutions  Instead of centralising water provision under failing councils, communities should be empowered to develop and manage their own water sources with government technical support but without financial punishment.\n\nTransparent Use of Resources  The millions of dollars spent on political borehole schemes should be redirected into long-term infrastructure projects. Citizens should not have to depend on campaign-season drilling to quench their thirst.\n\nEnvironmental Safeguards Without Exploitation  If groundwater depletion is a genuine concern, then transparent and scientific monitoring must be undertaken. Citizens should be educated on sustainable extraction, but never exploited through unjustified fees.\n\nThe borehole levy is a shameful indictment of governance in Zimbabwe. It symbolises the extent to which citizens are made to pay the price for state failure. Instead of delivering clean, reliable tap water, the most basic of public services  the government has shifted responsibility onto households and then had the audacity to tax them for it.\n\nZimbabweans deserve better. Access to water should not be a privilege for the wealthy or a political gift doled out through presidential schemes. It is a right, guaranteed by both international law and the national Constitution.\n\nThe US$300 borehole fee must therefore be abolished. To keep it in place is to continue punishing citizens for failures they did not cause. Water is life and in Zimbabwe, it is time the government remembered its duty to provide it, not exploit it.\n\nEngineer Jacob Kudzayi Mutisi+26377227816\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi In Zimbabwe today, the simple act of turning on a tap and expecting clean, running … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/18/borehole-levy-punishes-citizens-for-local-govt-failure/\">Continue reading<span class=\"screen-reader-text\"> \"Borehole Levy Punishes Citizens for Local Govt Failure\"</span></a></p>",
            "time": "20:33",
            "date": "18 Aug 2025"
        }
    ]
}