{
    "news": [
        {
            "title": "Mnangagwa Survived, But Who Saved Him? The Heroes He Ignored",
            "url": "https://www.zimeye.net/2025/11/05/mnangagwa-survived-but-who-saved-him-the-heroes-he-ignored/",
            "content": "By Bradshaw Muzanenhamo|Morning light seeped through the cracks of the curtains at Getti Mutandis modest home in Mutare, Dangamvura, yet inside, silence throbbed with tension. President Mnangagwa sat on a rickety chair, drenched from a failed border escape. Beside him, Emmerson Juniors small hand gripped his fathers, eyes wide, heart hammering.\n\nIn the shadows of the room, Lance Corporal Matheus Mhlana, barely nineteen, crouched low, scanning every corner, calculating every risk with the mind of a seasoned strategist. Sergeant Sango hovered near the door, rifle ready, muscles coiled like springs. Captain Stanley Musayo stood calm, observing, anchoring the young soldiers with authority. And Getti Mutandi, civilian yet fearless, quietly mapped escape routes in her mind, aware that one misstep could be fatal.\n\nMatheus leaned close to Mnangagwa. Tonight, when the city sleeps, we move. Every sound, every step counts. Follow instructions exactly.\n\nMnangagwas gaze darted nervously. I Ive failed before. What if they find us here?\n\nMusayos voice was calm, steady. They wont. We wont let that happen. Trust us.\n\nSangos eyes flicked to the windows and doors, tracing shadows. Gettis hands tightened on the doorknob, ready to guide them through alleys only she knew.\n\nHours passed in silence. Outside, Mutare carried on, oblivious: children splashed in puddles, vendors swept sidewalks, neighbours whispered about mundane concerns. Inside, Mnangagwa relived betrayal and near-death moments while Emmerson Junior clung to his father, the night of terror still fresh in memory.\n\nAs darkness fell, Matheus whispered, Move. Stay low. Eyes down. Breathe quietly.\n\nThe group slipped into the alleys, rain-slick beneath their boots. Puddles reflected shadows that might hide deadly operatives. Every drip of water, every rustle of leaves, could betray them.\n\nA flashlight beam swept dangerously close. Matheus pressed Mnangagwa and his son flat against the wall. Seconds stretched into eternities. One false movement could cost everything.\n\nFocus, Matheus breathed. One step at a time.\n\nThey dropped into a drainage channel, water swirling around their legs. Above, flashlights cut across walls. Agents prowled blindly, unaware that they were inches away from their target. Mnangagwas pulse raced. Emmerson Junior trembled.\n\nMatheuss grip tightened. Do not make a sound. Move when I say.\n\nAt Gettis bar, the ordinary walls became a command centre. Maps sprawled across the floor. Whispered instructions carried the weight of a nation. Thirty minutes to the border, Matheus said. Stay ready.\n\nRain returned heavier. Every step along hidden paths toward Mozambique was a countdown. The team froze as a flashlight passed meters away. Sangos hand was rigid on his rifle. Matheus raised a finger. Move now. Shadows swallowed them as they slipped forward.\n\nHours later, soaked and exhausted, they reached a safe house across the border. Mnangagwa sank to his knees, Emmerson Junior at his side.\n\nYou saved us tonight, he whispered, voice breaking.\n\nMatheus shook his head. We all did what was necessary. That is enough.\n\nDecades later, the story emerged. Matheus Mhlana, the youngest and most brilliant, orchestrated the escape. Sergeant Sango and Captain Musayo gave everything and were remembered posthumously. Getti Mutandi became a symbol of civilian courage.\n\nYet Mnangagwa, who owed them his life, never publicly acknowledged their heroism. They had saved him while the nation slept, facing death at every corner, and he overlooked them.\n\nInvestigative journalist Rui Dube reconstructed the tale: History is written by those who survive, but preserved by those who protect. These invisible guardians risked everything. They shaped Zimbabwes future and for decades, Mnangagwa ignored them.\n\nEvery whispered order, every careful step, every heartbeat in the rain-soaked streets had preserved a nations future. Mnangagwa survived. The guardians remained unseen for years. Some heroes never seek applause. They only ask to be remembered. And now, decades later, the world is finally listening.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Bradshaw Muzanenhamo|Morning light seeped through the cracks of the curtains at Getti Mutandi’s modest home in Mutare, Dangamvura, yet … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/mnangagwa-survived-but-who-saved-him-the-heroes-he-ignored/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Survived, But Who Saved Him? The Heroes He Ignored\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Woman Pours Hot Cooking Oil On Son-in-Law’s Face",
            "url": "https://www.zimeye.net/2025/11/05/woman-pours-hot-cooking-oil-on-son-in-laws-face/",
            "content": "By A Correspondent\n\nA Harare man suffered severe burns after his mother-in-law allegedly poured scalding cooking oil on his face, claiming he had mistreated her daughter, a magistrates court recently heard.\n\nThe incident occurred at the family home in Tafara following a domestic dispute between the man and his wife. According to the State, represented by Ms Eunice Maida, the man went to his in-laws house to discuss the matter with his mother-in-law, Winnie Gurai Chipengo.\n\nMagistrate Mr Weston Nyamwanza was told that around 1 a.m. last Friday, the man knocked on the door for several minutes before it was opened. Upon stepping inside, hot oil was allegedly poured onto his face by Chipengo.\n\nThe victim sustained serious burns and was rushed to Parirenyatwa Hospital, where his condition has been described as critical. Chipengo appeared in court and was remanded to November 17 on $300 bail, facing charges of assault with intent to cause grievous bodily harm.\n\nIn a separate case before Mr Nyamwanza, four members of a Mabvuku familyPeter, Darlington, Hector, and Philemon Chirembawere charged with assault with intent to cause grievous bodily harm after allegedly attacking their stepmother. The assault reportedly followed her complaint about electricity being cut off to her bedroom. She was dragged from her home and beaten with stones, planks, fists, and boots, sustaining injuries to her head and body. The four were each granted $300 bail and remanded to November 17, with Ms Maida representing the State.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Harare man suffered severe burns after his mother-in-law allegedly poured scalding cooking oil on his face, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/woman-pours-hot-cooking-oil-on-son-in-laws-face/\">Continue reading<span class=\"screen-reader-text\"> \"Woman Pours Hot Cooking Oil On Son-in-Law’s Face\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Fake Lecturer Owned UK-Based “Matebeleland Bereavement Fund” Exposed In Alleged £77,000 Scam Swindling Grieving Families",
            "url": "https://www.zimeye.net/2025/11/05/fake-lecturer-owned-uk-based-matebeleland-bereavement-fund-exposed-in-alleged-77000-scam-swindling-grieving-families/",
            "content": "By ZimEye Investigations | London, 30 October 2025 | A ZimEye investigation has unearthed a major financial and emotional exploitation scheme run under the name Matabeleland National Bereavement Fund (MNBF)  a UK-based association led by a fake university lecturer, that collects sympathy contributions from Zimbabwean diaspora members but allegedly denies payouts to genuine widows and bereaved families.\n\nDocuments, interviews, and audio obtained by ZimEye show a pattern of systematic manipulation of records, forged membership dates, and refusal to disburse member funds  leaving grieving families destitute while organisers control the accounts.\n\n The Widows Ordeal\n\nWidow C, whose husband Titus died on 2 September 2025, says she was denied her rightful bereavement payout despite presenting all documentation, including a death certificate.\n\nI joined the Society in good faith and contributed to four prior deaths, Widow C wrote in a grievance letter seen by ZimEye.The group told me I joined on 5 January, but I have proof showing my first communication and registration were on 21 January. They are doctoring records to deny my claim.\n\nScreenshots of her WhatsApp exchanges with MNBF coordinators confirm her joining process began on 21 January 2025  contradicting the Societys official claim that she was a member from 5 January 2025, a date they use to declare her ineligible.\n\n Internal Policy Manipulations\n\nMNBFs own policy states that new members qualify for bereavement benefits after three months of active contribution. Yet, when Widow Cs husband died eight months after she joined, she was told she had defaulted twice  without any proof.\n\nAn audio interview with MNBFs representative Mr Dlodlo, recorded during a ZimEye call, reveals deep inconsistencies:\n\nShe joined on 5 January. She defaulted twice, said Dlodlo.When pressed for evidence, he added: We dont keep a bank account. Members send money directly to the bereaveds account.\n\nThis admission effectively means MNBF operates outside UK charity and financial regulations, without central records, audits, or safeguarding of members funds.\n\n Evidence of Fraudulent Record-Keeping\n\nZimEyes investigation uncovered that: Membership dates can be altered unilaterally by administrators; Bereaved families bank details are distributed through WhatsApp groups without formal verification; The MNBF website  which displays bereavement notices and payment instructions  is controlled by individuals with the power to manipulate data and delete records.\n\nOne notice dated 22 January 2025 shows contributions directed to Mary-A D under Halifax Bank, sort code 11-06-, account number 010. This same name appears in at least three unrelated bereavement notices  a possible indicator of fictitious or recycled accounts.\n\n They Turn Grief into Business\n\nWidow C told ZimEye she felt humiliated after being told she must produce a marriage certificate despite already submitting her childs birth certificate showing both parents names.\n\nThis is emotional torture. They question widows during mourning, and when you comply, they invent new rules, she said.The group behaves like someones private company.\n\n Community Whistleblowers Speak Out\n\nFormer MNBF volunteers say theyve long suspected mismanagement. One former treasurer, speaking anonymously, confirmed that funds were handled informally, with no oversight or accountability.\n\nPeople think theyre helping each other. But behind the scenes, theres no ledger, no audit, no annual report  nothing. Once the money is sent, its gone.\n\nMNBFs chairperson, Mqondobazi Nduna Magonya, who claims to be a lecturer at Anglia Ruskin University, is now under scrutiny after verification checks revealed inconsistencies in his academic profile.When contacted, officials at Anglia Ruskin University stated they had no record of him on their staff register and referred us to two of their partner institutions for further confirmation. Both institutions also confirmed that no individual by that name appears on their academic or administrative rolls.A subsequent review of the universitys publicly available staff directory likewise produced no results for Magonya. This raises serious questions about the authenticity of his claimed professional affiliation with the university.\n\n Regulatory Breach\n\nUnder the UK Charities Act 2011 and Financial Conduct Authority (FCA) community finance rules, any organisation collecting public funds for welfare purposes must: Maintain transparent accounts, Have verifiable trustees, Register for oversight if annual turnover exceeds 5,000.\n\nNone of these requirements appear to have been met by MNBF, which continues to solicit money across WhatsApp groups and social media using bereavement notifications.\n\n Investigative Findings Summary\n\nKey Issue FindingRegistration Date Tampering Website claims Widow C joined 5 Jan; evidence shows 21 Jan registration via WhatsAppRecord Access Members cannot edit their own data; only admins can alter personal recordsFunds Trail Payments made to individual bank accounts, not a registered charity accountAudit & Oversight No financial statements, audits, or independent trustees confirmedLegal Status Not registered with UK Charity Commission or FCAAmount per Death Up to 77,000 per bereavement allegedly circulating without accountability\n\n ZimEye Calls for Audit\n\nZimEye is urging UK authorities  including the Charity Commission, FCA, and Metropolitan Police Economic Crime Unit  to immediately audit MNBFs operations, freeze active accounts, and interview its management team led by Mr Dlodlo and Mrs Agnes Dube (listed as MNBF Secretary on official notices).\n\nGrieving members like Widow C continue to wait for justice.\n\nThis fund has turned mourning into a money game, one member said.You pay when others die, but when its your turn, they find an excuse.\n\n Editors Note\n\nARE YOU ALSO A VICTIM?  If you are a Zimbabwean based in the UK who has contributed to the Matabeleland National Bereavement Fund or been denied assistance after a bereavement, contact ZimEyes Investigations Desk confidentially at editor_at_zimeye.com.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By ZimEye Investigations | London, 30 October 2025 | A ZimEye investigation has unearthed a major financial and emotional exploitation … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/fake-lecturer-owned-uk-based-matebeleland-bereavement-fund-exposed-in-alleged-77000-scam-swindling-grieving-families/\">Continue reading<span class=\"screen-reader-text\"> \"Fake Lecturer Owned UK-Based “Matebeleland Bereavement Fund” Exposed In Alleged £77,000 Scam Swindling Grieving Families\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Funeral Politics: Zanu PF Under Fire for Using the Dead to Score Political Points",
            "url": "https://www.zimeye.net/2025/11/05/funeral-politics-zanu-pf-under-fire-for-using-the-dead-to-score-political-points/",
            "content": "By A Correspondent\n\nThe ruling Zanu PF party has launched yet another affiliate group  this time targeting people with disabilities  under the banner People With Disabilities for ED, amid growing criticism that such initiatives are being used for political loyalty rather than genuine empowerment.\n\nThe programme, fronted by the Jimayi Muduvuri Foundation in partnership with Fidelity Life Assurance and Doves Funeral Services, promises free funeral cover to over 4,000 members nationwide.\n\nHowever, critics have described the move as a cynical attempt to win sympathy and votes by exploiting the hardships of people living with disabilities.\n\nThe first reported beneficiary of the scheme was Tawuya Gundani, a wheelchair-bound Kadoma resident whose family received funeral assistance following his death.\n\nWe are deeply thankful to the foundation and its partners. They have restored our dignity in difficult times, a family member said  but many questioned why support only comes after death, rather than through meaningful empowerment in life.\n\nThis is more than just funeral cover, it is a sign that we are part of national development, one member of the affiliate group said. But disability advocates have dismissed the project as political manipulation, saying Zanu PF has failed to address critical issues such as accessibility, health care, and employment opportunities for disabled citizens.\n\nPeople With Disabilities for ED national chairperson Jimayi Muduvuri defended the initiative, saying, At least 4,000 members are benefitting from this arrangement free of charge. We must always respond to the needs of our people, especially the vulnerable.\n\nDespite his claims, observers believe the scheme is nothing more than a political ploy to boost Zanu PFs image ahead of future elections.\n\nWhile the government portrays the project as part of the Second Republics inclusive development agenda, rights groups argue that true empowerment means enabling people to live with dignity  not celebrating their deaths through funeral schemes.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The ruling Zanu PF party has launched yet another affiliate group — this time targeting people with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/funeral-politics-zanu-pf-under-fire-for-using-the-dead-to-score-political-points/\">Continue reading<span class=\"screen-reader-text\"> \"Funeral Politics: Zanu PF Under Fire for Using the Dead to Score Political Points\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Critics Question Mnangagwa’s Qatar Visit Amid Concerns Over Empty Investment Promises",
            "url": "https://www.zimeye.net/2025/11/05/critics-question-mnangagwas-qatar-visit-amid-concerns-over-empty-investment-promises/",
            "content": "By A Correspondent\n\nZimbabwes Presidential visit to Qatar, hailed by government officials as a milestone for investment and economic growth, has drawn skepticism from analysts and opposition figures who question whether the trip will yield tangible benefits for ordinary Zimbabweans.\n\nDr. Paul Tungwarara, the Presidential Special Investment Advisor, praised the visit on Tuesday, saying:\n\nThe Presidents visit to Qatar marks a pivotal moment in Zimbabwes strategic efforts to unlock new avenues of investment and economic cooperation. Qatar stands as a global hub for innovation, finance, and infrastructure development, and engaging with its leadership and business community opens doors to transformative partnerships.\n\nThis mission underscores our commitment to diversifying Zimbabwes investment portfolio and attracting high-impact capital into sectors such as energy, agriculture, tourism, and technology. The Presidents presence in Doha sends a clear message: Zimbabwe is open for business, and we are ready to collaborate with visionary investors who share our ambition for inclusive and sustainable growth.\n\nI am confident that this visit will catalyze long-term opportunities that will benefit our people, strengthen bilateral ties, and position Zimbabwe as a competitive destination for global investment.\n\nHowever, critics warn that such statements are largely symbolic and may do little to address Zimbabwes ongoing economic challenges. Opposition parties have questioned whether foreign investors will commit capital in a country still grappling with high inflation, liquidity shortages, and a fragile business environment.\n\nZimbabwean officials often announce these high-profile trips as a major win, but the reality on the ground rarely changes, said one analyst. Promises of transformative investment rarely materialize, and ordinary citizens continue to face soaring prices and unemployment.\n\nConcerns have also been raised about the governments track record in managing foreign investment, with past deals criticized for benefiting political elites rather than boosting the broader economy. Observers note that while Qatar may offer opportunities, there is little evidence that the average Zimbabwean will see direct gains from these diplomatic gestures.\n\nAs the president concludes his Doha visit, skepticism persists over whether the trip will translate into concrete investment or simply serve as another showcase of government rhetoric without measurable impact on the countrys struggling economy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s Presidential visit to Qatar, hailed by government officials as a milestone for investment and economic growth, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/critics-question-mnangagwas-qatar-visit-amid-concerns-over-empty-investment-promises/\">Continue reading<span class=\"screen-reader-text\"> \"Critics Question Mnangagwa’s Qatar Visit Amid Concerns Over Empty Investment Promises\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Magaya Arrest Reignites Questions About G40 Links and Mzembi TV Scandal",
            "url": "https://www.zimeye.net/2025/11/05/magaya-arrest-reignites-questions-about-g40-links-and-mzembi-tv-scandal/",
            "content": "By James Gwati-The arrest and remand of charismatic preacher-businessmanWalter Magayahas reopened scrutiny of corruption allegations that have shadowed senior figures from Zimbabwes G40 era  most notably former tourism and foreign affairs ministerWalter Mzembi, who has been on remand for months on theft and related charges. Court papers and media reports show strands of overlap between the two mens public roles and alleged transactions, and investigators are said to be examining whether the cases intersect.\n\nMagaya was arrested in early November 2025 in a police operation described by the Zimbabwe Republic Police as responding to multiple complaints that include allegations of rape and a string of fraud counts. He was remanded in custody as prosecutors formalised charges that, among other things, allege his companies sold non-existent residential stands and solicited investor funds that were not delivered. The remand papers summarise complainants payments and allege the accused hatched a plan to defraud congregants and other members of the public between 2016 and 2018.\n\nMzembi, who returned to Zimbabwe from exile earlier in 2025, has been remanded on long-standing graft charges linked to his time as tourism minister. Prosecutors allege he improperly disposed of equipment procured for public World Cup fan parks (television sets), and converted some of that equipment to private use  including donations to churches  and that funds meant for the 2013 UNWTO event were misused. He has repeatedly denied wrongdoing; his legal defence has contested parts of the prosecutions while courts have, to date, refused certain applications to evade trial.\n\nA central factual point in the Mzembi case is the alleged disposal of large television sets procured for public viewing during the 2010 FIFA World Cup. Prosecutors papers and multiple media reports say16 large TV screens, acquired by the ministry, were donated to churches and other private recipients without Treasury authority; the alleged recipients named in reporting have included churches led by Emmanuel Makandiwa and Walter Magaya. Those reports explicitly list Magayas Prophetic Healing and Deliverance (PHD) ministry among organisations that received screens.\n\nSeveral outlets and legal summaries that have tracked Mzembis court appearances note that investigators are still tracing the chain of custody and the ultimate beneficiaries of the equipment  a line of inquiry that naturally includes the churches that received the sets. Media analysis and commentary dating back years document these specific alleged donations as part of the case files.\n\nMagaya rose to national prominence during the mid-2010s. He became notably visible at events associated with the Mugabe presidency and Grace Mugabes public profile: in July 2015 he purchased a pictorial biography of First Lady Grace Mugabe for a reportedUS$50,000at a high-profile fundraising gala  an act widely reported at the time and often cited as evidence of his closeness to the First Lady during the G40 ascendancy. Academic and journalistic accounts from that period describe Magaya as a public sympathiser of Grace Mugabe and as part of wider networks that benefited during that era.\n\nWalter Mzembi has been identified in contemporaneous and retrospective reporting as a senior figure in theGeneration 40 (G40)faction that rallied around Grace Mugabe and several allies, including Saviour Kasukuwere. The factions political prominence (and subsequent fall after November 2017) is well documented; many G40 figures were later removed from office, went into exile, or were prosecuted in follow-up investigations.\n\nMagayas remand documents allege schemes around the sale or promised allocation of residentialstands(plots) in multiple towns  a pattern that has long been present in Zimbabwean corruption reporting, where politically connected figures obtain or re-allocate urban land and residential plots. Saviour Kasukuwere, a prominent G40 leader and former minister who held the local government and housing portfolios (among others), has been a central figure in public controversies over land allocations and stand dealings dating to his ministerial tenure. Reporting and public records show Kasukuweres ministry oversaw substantial allocations and that questions about irregular land deals emerged around the same political period. Those histories are part of the context investigators examine when corruption or fraudulent land schemes are alleged.\n\nIt is important to stress the difference between documented ministerial responsibility for local government and the specific criminal allegations in Magayas remand papers: the latter concern alleged misrepresentations by Magaya and his companies to purchasers who paid for stands that were never delivered. The historical role of Kasukuweres ministry in land allocations, however, is one of the structural backdrops that journalists and investigators consider when tracing how political access, land and patronage interacted in the G40 period.\n\nCourt filings and media follow-up reporting indicate investigators are mapping financial flows, donation records and procurement files to establish whether:\n\n the television sets (procured for public fan parks) were diverted, who authorised their disposal, and who received the equipment; and funds or contracts tied to tourism events and other public procurements show a trail to private beneficiaries, intermediaries or business entities associated with G40 allies.\n\nBecause media reports have repeatedly named Magayas PHD ministry as one of the churches that received TV screens, and because Magaya is now charged on fraud counts that include alleged land/stand scams, investigators appear to be checking overlaps between the Mzembi prosecutions and Magayas commercial activities. That scrutiny helps explain why commentators and legal analysts have suggested the two men could be questioned in connection with related matters and why some media raised the prospect of coordinated or linked prosecutions  while noting that formal indictments tying Magaya to Mzembis long-standing charges have not (as of the latest filings) been made public.\n\nObservers of Zimbabwean politics caution against a simple binary: prosecutions can reflect legitimate anti-corruption work, internal faction-cleansing, or both. The G40 purge that followed 2017s political upheaval saw many allies sidelined; subsequent investigations and prosecutions have at times coincided with shifting intra-party alignments. Analysts and some political sources have framed the arrests of high-profile former allies as signalling that those once useful to the power centre may be targeted when they become politically inconvenient. At the same time, campaigners and victims demand accountability where there is evidence of financial and sexual misconduct. Reporting on both Magaya and Mzembi therefore sits at the intersection of law enforcement, factional politics and public interest.\n\nTwo careful notes of caution:\n\nMagayas arrest and Mzembis ongoing remand revive a knot of allegations that stretch back to the G40 political moment and to public procurement controversies from the early 2010s. Court papers and credible reportage show (1) Mzembi faces prosecution over the alleged improper disposal of World Cup TV equipment and related procurement sums, and (2) Magaya  long visible in G40-era social and political networks and publicly associated with Grace Mugabe through high-value purchases  now faces separate fraud and sexual-offence allegations that include asserted land/stand scams. Because media and court records list Magayas ministry among recipients of large TV screens and because Magayas companies and trustees are named in fraud remand affidavits, investigators are logically checking for overlaps; whether that translates into joint indictments depends on evidence and prosecutorial decisions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati-The arrest and remand of charismatic preacher-businessman Walter Magaya has reopened scrutiny of corruption allegations that have shadowed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/magaya-arrest-reignites-questions-about-g40-links-and-mzembi-tv-scandal/\">Continue reading<span class=\"screen-reader-text\"> \"Magaya Arrest Reignites Questions About G40 Links and Mzembi TV Scandal\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "We Are Ready To Die For Mnangagwa, Declares Tungwarara",
            "url": "https://www.zimeye.net/2025/11/05/we-are-ready-to-die-for-mnangagwa-declares-tungwarara/",
            "content": "By A Correspondent\n\nPresidential Special Investment Advisor Dr. Paul Tungwarara has sparked outrage after declaring his unwavering loyalty to President Emmerson Mnangagwa, vowing to die for the President and warning critics to shut up.\n\nAddressing Zanu PF affiliates in Mutare over the weekend, Tungwarara said his allegiance to the President was absolute and unshakable.\n\nWe are ready to die for the President, even to go to jail. We are not afraid of anyone. Those who are attacking the President, please shut up, he said.\n\nHis remarks have drawn sharp criticism from opposition figures and civic groups who say the statement reflects a dangerous culture of hero-worship and political intolerance within the ruling party.\n\nAnalysts noted that Tungwararas comments blur the line between public service and partisan loyalty, raising concerns about how state officials use their positions to advance political narratives instead of national interests.\n\nCritics argue that instead of pledging personal loyalty to political leaders, government advisors should be focused on serving citizens and addressing the countrys deepening social and economic challenges.\n\nSpecial Investment Advisor to HE President ED Mnangagwa , Dr Paul Tungwarara speaks about his loyalty to the Presidentpic.twitter.com/AYgWKc8leA\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Presidential Special Investment Advisor Dr. Paul Tungwarara has sparked outrage after declaring his unwavering loyalty to President … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/we-are-ready-to-die-for-mnangagwa-declares-tungwarara/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Ready To Die For Mnangagwa, Declares Tungwarara\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Mnangagwa Frontman Wicknell Chivayo Vows To Bring Kylian Mbappé To Scotland FC",
            "url": "https://www.zimeye.net/2025/11/05/mnangagwa-frontman-wicknell-chivayo-vows-to-bring-kylian-mbappe-to-scotland-fc/",
            "content": "By A Correspondent\n\nControversial businessman and Zanu PF loyalist Wicknell Chivayo has once again courted public outrage after claiming he will bring international football superstar Kylian Mbapp to newly crowned Premier Soccer League champions Scotland FC.\n\nChivayo, a self-proclaimed ally of President Emmerson Mnangagwa, made the remarks in a boastful social media post on Tuesday while congratulating the Mabvuku-based side, which is owned by Zanu PF legislator Scott Sakupwanya.\n\nWE ARE THE CHAMPIONS!!!! HISTORY has been made!!! Chivayo wrote, before launching into a self-congratulatory message crediting Sakupwanyas leadership and passion for the clubs success.\n\nHe went on to announce a US$250,000 cash gift to the team, saying, I invite the team captain and the team manager to come and see me personally on Saturday to collect USD250,000 as a small token of my appreciation.\n\nChivayo, who has been repeatedly accused of flaunting ill-gotten wealth and using donations for political mileage, claimed his financial backing would turn the club into the envy of African football.\n\nI reaffirm my sponsorship pledge to the club, he said. Come the 2025/2026 season, Scotland FC will remain the champions. At this rate, we will soon sign the likes of Kylian Mbapp and even Erling Haaland ku Scotland!!! Ndiri mukuru, handitaure zvekunyepa.\n\nThe statement, dripping with arrogance and political undertones, drew sharp criticism from football fans who accused Chivayo of politicising sport and using the countrys football scene as a stage for personal and partisan grandstanding.\n\nAnalysts say the businessmans theatrics reflect a broader trend in which politically connected figures dominate local football through patronage and propaganda rather than genuine development.\n\nWhile Scotland FCs victory is historic, critics warn that Chivayos involvement may tarnish the clubs reputation and deepen the perception that Zimbabwean football is now an extension of Zanu PFs political machinery.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial businessman and Zanu PF loyalist Wicknell Chivayo has once again courted public outrage after claiming he … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/mnangagwa-frontman-wicknell-chivayo-vows-to-bring-kylian-mbappe-to-scotland-fc/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Frontman Wicknell Chivayo Vows To Bring Kylian Mbappé To Scotland FC\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Walter Magaya’s Birthday Tomorrow",
            "url": "https://www.zimeye.net/2025/11/05/walter-magayas-birthday-tomorrow/",
            "content": "video loading below\n\nTomorrow m, 6 Nov is Walter Magaya's birthday.He was born on November 6, 1983.Magaya is the founder of the Prophetic Healing and Deliverance (PHD) Ministries.He is currently on trial over rape and fraud.https://t.co/CgKLrWZihb\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below…",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "MSD Warns of Heavy Rains, Lightning, and Strong Winds Across Zimbabwe",
            "url": "https://www.zimeye.net/2025/11/05/msd-warns-of-heavy-rains-lightning-and-strong-winds-across-zimbabwe/",
            "content": "By A Correspondent\n\nThe Meteorological Services Department (MSD) has issued a nationwide weather warning, cautioning that heavy rains exceeding 50 mm, accompanied by lightning and strong winds, are expected from Wednesday through Friday.\n\nIn an advisory released on Tuesday, 4 November 2025, MSD indicated that Matabeleland North and South, Bulawayo Metropolitan, Midlands, Masvingo, Manicaland, Harare Metropolitan, and all Mashonaland provinces are likely to experience significant rainfall.\n\nThe department attributed the expected downpours to a thick cloud mass moving in from Zimbabwes western borders with Botswana. MSD stated:\n\nA thick cloud is approaching the western borders of the country from Botswana. It is expected to be coupled by moisture from the south-east. This will result in heavy rainfall (exceeding 50mm) as well as strong winds in provinces such as northern parts of Matabeleland North, Matabeleland South, Bulawayo Metropolitan, Midlands, Manicaland, and Harare Metropolitan Provinces, effective from the afternoon of Wednesday 05 November till Friday.\n\nThere is a chance of flash floods in flood-prone areas and river basins. Roads may also be slippery and visibility reduced by rainfall, thus requiring a need for increased braking distance. There may also be fallen trees and powerlines. Therefore, the public is advised to take precautionary measures as advised by the Civil Protection Unit.\n\nAuthorities have urged residents to remain vigilant and take all necessary precautions to protect lives and property as the country faces potentially hazardous weather conditions over the coming days.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Meteorological Services Department (MSD) has issued a nationwide weather warning, cautioning that heavy rains exceeding 50 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/11/05/msd-warns-of-heavy-rains-lightning-and-strong-winds-across-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"MSD Warns of Heavy Rains, Lightning, and Strong Winds Across Zimbabwe\"</span></a></p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        }
    ]
}