{
    "news": [
        {
            "title": "🔴 Power Cut Disrupts Mnangagwa’s State Of The Nation Address Amid Chivayo Scandal Fallout",
            "url": "https://www.zimeye.net/2025/10/28/%f0%9f%94%b4-power-cut-disrupts-mnangagwas-state-of-the-nation-address-amid-chivayo-scandal-fallout/",
            "content": "Harare  28 October 2025By Farai D Hove | ZimEye | President Emmerson Mnangagwas State of the Nation Address (SONA) was dramatically interrupted today by a power cut inside Zimbabwes Parliament  a humiliating spectacle captured live as the Head of State was forced to read by flashlight.\n\nThe blackout has triggered national outrage, especially given that the country has spent more than USD 23 million on a now-notorious Gwanda solar project  a project that, ten years later, has zero solar panels installed and is the subject of ongoing corruption investigations linked to businessman Wicknell Chivayo.\n\nChivayo received USD 5 million in 2015 under a contract to construct a 100MW solar power plant. The payout, upgraded in recent years by another USD 18 million, has produced nothing but shadows. While the nation sinks deeper into an energy crisis, Chivayo has flaunted extreme wealth: chartering private jets, dishing out luxury cars, and building mansions  all while the country burns candles during presidential speeches.\n\n A viral image now shows Mnangagwa sitting in the dark, aided only by a portable light as he struggled to complete his speech in what critics are calling a State of the Darkness Address.\n\n Social Media EruptsThe Presidents photographer Cleopas Mukungunugwa responded with a bold Facebook post blaming the opposition, writing:\n\nThe opposition can turn off the lights, but they cant stop Resolution No. 1.\n\nThis sparked a firestorm of responses from both citizens and ZANU PF sympathisers, many of whom sarcastically or angrily rebuked the attempt to shift blame. Some highlights include:\n\n Tirimusango Wenje: Its bcz of Gwanda Solar Project. Lets tell Chivayo to deliver.\n\n Chikombedzi Chikombedzi: He [Speaker] is the administrator himself The speaker of Parliament can do better than this.\n\n Patrick Zangelo Ndlovu: Who doesnt know there is load shedding in Zimbabwe. Azakhale man!\n\n Tatenda Edwin Zhou: We need to find these political culprits.\n\n Farai Abraham: You are SABOTAGING the President from within. Why do you think ZBC or even the official ZANU PF page is not reporting this?\n\n National Humiliation, Yet AgainThis is not the first time Parliament has suffered a power blackout. What makes todays incident particularly damning is its symbolic timing  on the very day the ruling party sought to consolidate power under Resolution No. 1, which pushes for Mnangagwa to rule until 2030 or beyond.\n\nCritics argue this incident encapsulates the governments failure to deliver on infrastructure while misappropriating millions  a failure personified by the ghost project in Gwanda.\n\n What Happens Next?As public anger mounts over the incident and the unresolved solar scandal, legal observers are questioning why no arrests have been made over the Gwanda project, and why Chivayo, who admitted in court to receiving the funds without delivery, continues to operate with impunity.\n\nMeanwhile, Parliament remains without a standby generator, and the President  even in his own House  remains powerless.\n\n State of the Darkness Address has officially entered Zimbabwes political lexicon.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – 28 October 2025 By Farai D Hove | ZimEye | President Emmerson Mnangagwa’s State of the Nation Address … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/%f0%9f%94%b4-power-cut-disrupts-mnangagwas-state-of-the-nation-address-amid-chivayo-scandal-fallout/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 Power Cut Disrupts Mnangagwa’s State Of The Nation Address Amid Chivayo Scandal Fallout\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "Breaking: Mnangagwa Hit By Second Power Blackout At Parliament",
            "url": "https://www.zimeye.net/2025/10/28/breaking-mnangagwa-hit-by-second-power-blackout-at-parliament/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa was once again hit by a power outage at Parliament while delivering his State of the Nation Address on Tuesday afternoon.\n\nFor the second time, the Head of State was left momentarily in darkness as the lights went out during his speech, prompting aides to move quickly to restore power. The unexpected blackout caused a brief disruption to proceedings, with the President continuing calmly while technicians worked to fix the issue.\n\nThe incident, which mirrors a similar power failure during a previous address, has sparked outrage among government supporters.\n\nZanu PF online activist Cleopas Mukungunugwa expressed fury over the matter, calling it a calculated act of sabotage. This is pure, unadulterated sabotage. Cutting the power during the Head of States address is a deliberate act to undermine the nation, Mukungunugwa said. That this is the second time it has happened is an absolute disgrace. The culprit must be identified and held fully accountable for this intolerable act.\n\nOfficials were yet to issue an official statement regarding the cause of the blackout by the time of publication.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa was once again hit by a power outage at Parliament while delivering his State … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/breaking-mnangagwa-hit-by-second-power-blackout-at-parliament/\">Continue reading<span class=\"screen-reader-text\"> \"Breaking: Mnangagwa Hit By Second Power Blackout At Parliament\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "Schools in Masvingo Hit by Severe Windstorm, Buildings Destroyed",
            "url": "https://www.zimeye.net/2025/10/28/schools-in-masvingo-hit-by-severe-windstorm-buildings-destroyed/",
            "content": "By A Correspondent\n\nSeveral schools in Masvingo Province were left reeling after a severe windstorm ripped through the area on Monday afternoon, causing extensive damage to classrooms and teachers houses.\n\nAccording to a source in the Ministry of Primary and Secondary Education in Masvingo, multiple schools suffered significant structural damage.\n\nAt Njovho Primary School, seven out of nine classrooms had their roofs completely torn off, the source revealed. Chekai Secondary School lost the roof to one of its classroom blocks as well as a teachers house. At Matsikidze Primary, the roof of a teachers house was blown away, while at Chevanhu Secondary School, one of the classroom blocks also lost its roof.\n\nThe source added that the ministry is assessing the full extent of the damage and coordinating emergency repairs to ensure that teaching and learning can resume as quickly as possible.\n\nThis is a serious situation affecting the education of our children, and we are working with local authorities to provide temporary learning spaces and repair the damaged infrastructure, the source said.\n\nParents and school communities in the affected areas have expressed concern over safety and the disruption to the academic calendar, urging swift intervention by the government to restore the damaged facilities.\n\nThe Ministry of Primary and Secondary Education has called for vigilance as more unpredictable weather patterns continue to pose risks to schools across the province.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Several schools in Masvingo Province were left reeling after a severe windstorm ripped through the area on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/schools-in-masvingo-hit-by-severe-windstorm-buildings-destroyed/\">Continue reading<span class=\"screen-reader-text\"> \"Schools in Masvingo Hit by Severe Windstorm, Buildings Destroyed\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "Inter Milan Goalkeeper In Fatal Accident",
            "url": "https://www.zimeye.net/2025/10/28/inter-milan-goalkeeper-in-fatal-accident/",
            "content": "By Sports Correspondent\n\nInter Milans second-choice goalkeeper, Josep Martnez, was involved in a fatal road accident on Tuesday morning near Appiano Gentile, Italy.\n\nReports indicate that the 27-year-old Spaniard accidentally struck an 81-year-old man who was in a motorised wheelchair while on his way to training at around 10 a.m. Emergency services arrived promptly, but the elderly man was pronounced dead at the scene.\n\nAccording to Italian media, preliminary investigations suggest the victim may have suffered a medical emergency moments before the collision.\n\nMartnez, who joined Inter Milan earlier this year, is said to be cooperating fully with the authorities. A club source revealed that he was deeply shaken by the incident but did not sustain any physical injuries.\n\nPolice investigations into the circumstances surrounding the tragic accident are ongoing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Inter Milan’s second-choice goalkeeper, Josep Martínez, was involved in a fatal road accident on Tuesday morning near … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/inter-milan-goalkeeper-in-fatal-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Inter Milan Goalkeeper In Fatal Accident\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "Emmerson Mnangagwa’s State of The Nation Address Today…",
            "url": "https://www.zimeye.net/2025/10/28/emmerson-mnangagwas-state-of-the-nation-address-today/",
            "content": "Emmerson Mnangagwa's State of The Nation Address( SONA) in Parliament todayGovernment spokesperson Nick Mangwana said in a statement:\" His Excellency President Emmerson Mnangagwa, in accordance with Section 140 (1) and Section 140 (4) of the Constitution of Zimbabwe, willpic.twitter.com/T6VKtxagXH\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "South Africa Intensifies Deportation Of Undocumented Migrants …",
            "url": "https://www.zimeye.net/2025/10/28/south-africa-intensifies-deportation-of-undocumented-migrants/",
            "content": "By A Correspondent\n\nSouth Africa has significantly increased the deportation of undocumented migrants as the country grapples with a worsening economic situation and rising public anger over unemployment.\n\nHome Affairs Minister Leon Schreiber revealed that over 51,000 people were deported in the past year  a figure he said surpasses the combined removals by France and Germany. South Africa is a neglected part of the global migration story, said Schreiber. If we had more resources, we would be able to scale up these operations even further.\n\nSpeaking to Bloomberg, the minister warned that the struggle between locals and foreigners for limited job opportunities has become a real tinderbox, reflecting growing social tension across the country.\n\nSchreibers remarks come as unemployment hovers above 30 percent, prompting renewed calls from citizens for stricter immigration enforcement. He emphasized that the government remains committed to protecting jobs for South Africans while managing migration in a fair but firm manner.\n\nAnalysts say the sharp rise in deportations underscores the governments political balancing act  addressing public frustration without straining diplomatic relations with neighboring countries whose nationals make up the majority of undocumented migrants.\n\nAs Schreiber put it, We are dealing with one of the toughest migration environments in the world, and South Africa can no longer afford to ignore it.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent South Africa has significantly increased the deportation of undocumented migrants as the country grapples with a worsening … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/south-africa-intensifies-deportation-of-undocumented-migrants/\">Continue reading<span class=\"screen-reader-text\"> \"South Africa Intensifies Deportation Of Undocumented Migrants …\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "Rudland, Moti Accused Of Siding With Zim Number 2",
            "url": "https://www.zimeye.net/2025/10/28/rudland-moti-accused-of-siding-with-zim-number-2/",
            "content": "By A Correspondent| Prominent businessmen Simon Rudland and Zunind Moti have been dragged into the raging factional wars tearing through the ruling Zanu PF, amid claims that the two tycoons are aligned to Vice-President Constantino Chiwengas camp.\n\nThe development marks the first time the pair has been officially linked to political factions within the ruling party, signalling how business interests continue to intersect with Zimbabwes bitter power struggles.\n\nRudland, who controls Gold Leaf Tobacco, and Moti, a South African-based mining magnate, are among the countrys wealthiest businessmen with sprawling investments in agriculture, mining, and transport.\n\nRudland and Motis political association with Chiwenga was also confirmed in a leaked parliamentary document presented by Justice Minister Ziyambi Ziyambi, which sought to rebut a dossier delivered in the Zanu PF politburo by the former army commander accusing President Emmerson Mnangagwas alliesincluding Kudakwashe Tagwirei, Wicknell Chivhayo, Paul Tempter Tungwarara, Scott Sakupwanya and Dilesh Nguwayaof grand corruption and state capture.\n\nZiyambi claimed Chiwengas document had deliberately omitted some notorious alleged smugglers such as Simon Rudland and Zunind Moti, among others, who are alleged to be associates of some members of the Presidium.\n\nPolitical observers say Ziyambis statement exposes the depth of mistrust and factional hostility now gripping Zanu PF.\n\nThis is no longer just about corruption allegationsits a full-blown power struggle playing out through the language of accountability and loyalty, said one Harare-based political analyst.\n\nThe internal dispute stems from Chiwengas seven-page memorandum to the party presidium dated 17 September, in which he accused Mnangagwas allies of looting over US$3.2 billion through illicit contracts and opaque deals.\n\nZiyambi hit back, branding Chiwengas memo reckless, malicious and treasonous, and warned that any attempt to destabilise or subvert a constitutionally elected government is treasonous.\n\nNeither Rudland nor Moti could be reached for immediate comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Prominent businessmen Simon Rudland and Zunind Moti have been dragged into the raging factional wars tearing through … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/rudland-moti-accused-of-siding-with-zim-number-2/\">Continue reading<span class=\"screen-reader-text\"> \"Rudland, Moti Accused Of Siding With Zim Number 2\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mnangagwa Spooks Torch Human Rights Activist’s House Over Rejecting 2030 Agenda",
            "url": "https://www.zimeye.net/2025/10/28/mnangagwa-spooks-torch-human-rights-activists-house-over-rejecting-2030-agenda/",
            "content": "By A Correspondent\n\nMasvingo-based human rights defender Prosper Tiringindi has condemned a politically motivated arson attack targeting a fellow activist in Harare, describing it as part of a disturbing and coordinated campaign against those rejecting President Emmerson Mnangagwas 2030 political agenda.\n\nIn a statement issued on Tuesday, Tiringindi said the attack occurred in the early hours of the morning, when unknown assailants set fire to the home of Mr. Gilbert Bgwende, a member of the Constitutional Defence Forum, in Highfield.\n\nI strongly condemn the arson attack on the home of Mr. Gilbert Bgwende, which occurred around 1:30 a.m. This cowardly act of violence is a direct assault on the right to freedom of expression, association, and peaceful activism, said Tiringindi.\n\nHe linked the incident to a broader pattern of intimidation, citing last weeks burning of a seminar room at SAPES Trust, which was scheduled to host a press conference by civil society organizations critical of Mnangagwas proposed term extension.\n\nThis attack, coming so soon after the SAPES Trust incident, clearly demonstrates a disturbing and coordinated campaign of intimidation against dissenting voices, Tiringindi said. Targeting human rights defenders, activists, and organizations for exercising their constitutional rights undermines the rule of law and erodes democratic space in Zimbabwe.\n\nHe called on authorities to act swiftly and ensure accountability. I call upon the Zimbabwe Republic Police to conduct a thorough and impartial investigation into these attacks, bring the perpetrators to justice, and guarantee the safety of all individuals and organizations speaking out for democracy and constitutionalism, he said.\n\nTiringindi emphasized that fear and intimidation would not silence civic actors. Silencing critical voices through fear and violence will not stop the peoples demand for accountability and respect for the Constitution. We stand in solidarity with Mr. Bgwende, SAPES Trust, and all defenders of democracy who continue to work for a free and just Zimbabwe despite intimidation and threats.\n\nThe attacks have alarmed civil society organizations, who see them as part of a growing crackdown on activists challenging the governments alleged plan to extend Mnangagwas stay in power beyond 2028  a move critics say would violate the spirit of Zimbabwes 2013 Constitution.\n\nAs the debate over the 2030 agenda intensifies, rights groups warn that targeting activists could signal a dangerous escalation in political repression ahead of the next election cycle.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo-based human rights defender Prosper Tiringindi has condemned a politically motivated arson attack targeting a fellow activist … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/mnangagwa-spooks-torch-human-rights-activists-house-over-rejecting-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Spooks Torch Human Rights Activist’s House Over Rejecting 2030 Agenda\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "KuGeza Nyika: Anti- Mnangagwa Protesters Denied Bail",
            "url": "https://www.zimeye.net/2025/10/28/kugeza-nyika-anti-mnangagwa-protesters-denied-bail/",
            "content": "By A Correspondent\n\nTen individuals who allegedly participated in protests against President Emmerson Mnangagwa earlier this month were denied bail on Monday at the Harare Magistrates Court.\n\nThe protesters are reported to have taken part in demonstrations following calls by war veteran Blessed Runesu Geza, who personally urged citizens to stage mass protests against what he described as President Mnangagwas attempts to manipulate the constitution to extend his term of office to 2030.\n\nDuring Mondays proceedings, the state opposed bail, citing the seriousness of the charges and the possibility that the accused could participate in further demonstrations.\n\nOutside the court, a human rights activist condemned the denial of bail, describing it as an attempt to intimidate citizens who are exercising their constitutional right to protest.\n\nThese individuals were peacefully responding to calls for action by war veteran Geza, the activist said\n\n. Denying them bail is a clear signal that dissent will not be tolerated, but it will not stop Zimbabweans from standing up for their rights.\n\nHuman rights observers have expressed concern over the arrests, warning that targeting protesters could escalate tensions and undermine democratic freedoms in the country.\n\nThe court case is expected to continue in the coming weeks, with the accused remaining in custody as legal proceedings unfold.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Ten individuals who allegedly participated in protests against President Emmerson Mnangagwa earlier this month were denied bail … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/kugeza-nyika-anti-mnangagwa-protesters-denied-bail/\">Continue reading<span class=\"screen-reader-text\"> \"KuGeza Nyika: Anti- Mnangagwa Protesters Denied Bail\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        },
        {
            "title": "Chiwenga Declares War on Corruption in Mining Sector",
            "url": "https://www.zimeye.net/2025/10/28/chiwenga-declares-war-on-corruption-in-mining-sector/",
            "content": "By A Correspondent\n\nVice President Dr. Constantino Chiwenga has vowed to bring order and accountability to Zimbabwes mining industry, declaring that the days of unchecked mineral exploitation, corruption, and raw exports are numbered.\n\nSpeaking during a tour of the newly established Gwanda Lithium Mine in the Mandihongola area on Friday, Dr. Chiwenga said the government will no longer tolerate lawlessness in the mining sector, which he said must start benefiting ordinary Zimbabweans.\n\nThe era of exporting our minerals in raw form is over, declared the Vice President. From January 2026, every mineral  including lithium  must be processed right here in Zimbabwe. We must extract, process, beneficiate, and manufacture locally so that our people enjoy the full value of their resources.\n\nHe said the government was determined to ensure transparency in mining operations and clamp down on those who exploit the system for personal gain. Our mining industry must operate with honesty and integrity, he said. We cannot allow a few individuals to enrich themselves while communities live in poverty.\n\nDr. Chiwenga stressed that mining investments must empower local communities through job creation and infrastructure development. Investment must be mutually beneficial, he said. The investor brings in technology and capital, the community provides the resources, and government ensures fairness for all. That is how Zimbabwe will rise.\n\nHe also called on mining companies to take corporate social responsibility seriously. We want to see clinics, schools, and proper roads being built by these companies, he said. The heavy trucks you see passing here were never meant for these roads. The companies must fix what they use.\n\nDr. Chiwenga further underscored the importance of Zimbabwes longstanding ties with China, describing the partnership as one that has stood the test of time. The coming in of Gwanda Lithium is not by accident, he said. Its part of our continued friendship with China, which supported us during the liberation struggle. Now we are working together to develop our economies.\n\nThe Gwanda Lithium Mine, a US$54 million project under Chinese investor Tsingshan Holdings Limited, currently employs about 450 people  most of them locals. Project director Wilfred Motsi said the company was committed to improving operations. We process the lithium ore through several stages to produce concentrate for export, he said. In future, we plan to add more value by producing lithium carbonate locally.\n\nChiwengas bold remarks come at a time when public concern is growing over corruption, illegal mining, and the plundering of national resources. His declaration signals a renewed government effort to restore discipline and fairness in one of Zimbabwes most lucrative but chaotic industries.\n\nThis is about restoring sanity, transparency, and dignity in our mining sector, Chiwenga said. Zimbabwes wealth must uplift its people  not outsiders or corrupt middlemen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Vice President Dr. Constantino Chiwenga has vowed to bring order and accountability to Zimbabwe’s mining industry, declaring … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/28/chiwenga-declares-war-on-corruption-in-mining-sector/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Declares War on Corruption in Mining Sector\"</span></a></p>",
            "time": "09:10",
            "date": "29 Oct 2025"
        }
    ]
}