{
    "news": [
        {
            "title": "More Coup Tanks Seen In Domboshawa",
            "url": "https://www.zimeye.net/2025/02/21/more-coup-tanks-seen-in-domboshawa/",
            "content": "By Munacho Gwanda Military tanks and trucks were spotted in several areas of Harare on Thursday afternoon, intensifying fears of an impending coup amid deepening political divisions within the ruling party.\n\nAt around 3 PM, reports surfaced of over 15 military tanks near the Central Business District (CBD), with others stationed in Hatcliffe.\n\nTravellersheading to Domboshava werebrieflyhaltednear Glen Forest Cemetery to allow the tanks to pass.\n\nI counted over 17 of them, an eyewitness toldZimEyeon Thursday.\n\nThe Zimbabwe National Army (ZNA)hadannounced on Wednesday thatthe presence ofmilitary tanks on the streets of Harare would continue until Thursday as part of routine drills.\n\nDeputy Army spokesperson Lieutenant Colonel Tichafa Mungofa Wednesday toldVOA Studio 7that the militarys movements were part of standard exercises.\n\nIts a normal exercise that the Army usually undertakes, and this is one of them. This is an ongoing exercise, and I think it will end tomorrow (Thursday), Mungofa said.\n\nHowever, the unusual deployment of military hardware has sparked anxiety, with many recalling the events leading up to the 2017 coup that led to the ousting of Robert Mugabe.\n\nThen, tanks and military vehicles first appeared on Harares streets before key installationsincluding Parliament and police stationswere secured by soldiers.\n\nOn Thursday, Home Affairs Minister Kazembe Kazembe sought to downplay the developments, claiming thatthe sudden emergence of roadblocks across the country was meantto ensure public safety and curb road traffic offences.\n\nDespite these assurances, sightings of more than 20 military tanks in the Borrowdale area on Wednesday have fueled speculation that a power struggle between President Emmerson Mnangagwa and Vice President Constantino Chiwenga may bereaching a boiling point.\n\nThe military intervention in 2017 was spearheaded by then-Zimbabwe Defence Forces (ZDF) Commander General Constantino Chiwenga, with backing from influential military figures such as the late Air Marshal Perrence Shiri and retired General Sibusiso Moyo.\n\nThe coupwas triggeredby Mugabes decision to fire Mnangagwa as Vice President, a move widely seen as an attempt to clear the path for his wife, Grace Mugabe, to assume power.\n\nNow, history appears to be repeating itself.\n\nTensions between Mnangagwa and Chiwenga havebeen steadily escalating, with reports of internal rifts within ZANU PF over Mnangagwas alleged plans to extend his rule beyond 2028 under the controversial #ED2030 agenda.\n\nPresidential spokesperson George Charamba, Thursday posting under his pseudonymdhonzamusoro007on social media, insisted that the movement of tanks was nothing more than standard military drills.\n\nHowever, speculation persists that Chiwenga may have ordered their deployment to send a strong message to Mnangagwa.\n\nAdding to the uncertainty, war veteran and ZANU PF Central Committee member Blessing Geza recently warned that war veterans were prepared to take drastic steps to remove Mnangagwa.\n\nHis remarks have intensified speculation that a faction within the military, still loyal to Chiwenga, could be preparing to act.\n\nReports suggest that senior military officials and war veterans have held clandestine meetings to strategize ways to counter Mnangagwas grip on power.\n\nSources indicate that Chiwengas allies accuse Mnangagwa of reneging on a 2017 coup agreement that allegedly promised Chiwenga the presidency after Mnangagwas first term.\n\nUnlike Mugabe in 2017, Mnangagwa has spent years consolidating power, purging Chiwengas allies from both the military and government.\n\nHe has appointed loyalists to key positions and neutralized potential challengers within ZANU PF.\n\nAdditionally, several prominent figures from the 2017 coup, including Perrence Shiri and Paradzai Zimondi, have died under mysterious circumstances, fueling speculation that Mnangagwa has systematically weakened Chiwengas support base.\n\nDespite thesemaneuvers, Chiwenga remains a formidable force within the security sector.\n\nReports indicate that a significant faction within the military and war veterans stillconsiderhim Zimbabwes rightful leader.\n\nA recent high-level meeting in Mashonaland Centralhistorically a flashpoint for political upheavalsreportedly discussed growing dissatisfaction within the armed forces and the possibility of decisive action against Mnangagwa.\n\nOne insider remarked, When credible war veterans like Blessing Geza speak, they are not hallucinating. They are sending a clear messageone that should not be ignored.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwanda– Military tanks and trucks were spotted in several areas of Harare on Thursday afternoon, intensifying fears of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/more-coup-tanks-seen-in-domboshawa/\">Continue reading<span class=\"screen-reader-text\"> \"More Coup Tanks Seen In Domboshawa \"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "Zanu PF Cries For Removal Of “Sanctions”",
            "url": "https://www.zimeye.net/2025/02/21/zanu-pf-cries-for-removal-of-sanctions/",
            "content": "By A Correspondent\n\nDespite ongoing human rights violations, Zanu PF has appealed for the removal of sanctions\n\nEU Extends Sanctions on Zimbabwe\n\nThe European Union (EU) has extended its sanctions on Zimbabwe for another year, set to last until 20 February 2026. However, it has removed the Zimbabwe Defence Industries (ZDI) from its sanctions list. The embargo on arms and equipment that could be used for internal repression remains in effect.\n\nZanu PF has expressed disappointment, criticizing the EU for continuing to impose what it describes as unilateral and illegal sanctions on Zimbabwe. The government, along with the Southern African Development Community (SADC) and the African Union (AU), continues to demand the unconditional lifting of sanctions. They argue that the sanctions have severely damaged Zimbabwes economy and have disproportionately affected the livelihoods of ordinary citizens, making them unjust, cruel, and unfair.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Despite ongoing human rights violations, Zanu PF has appealed for the removal of sanctions… EU Extends Sanctions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/zanu-pf-cries-for-removal-of-sanctions/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Cries For Removal Of “Sanctions”\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "MBAPPE MAGIC: Real Madrid Thrash Manchester City…",
            "url": "https://www.zimeye.net/2025/02/21/mbappe-magic-real-madrid-thrash-manchester-city/",
            "content": "By A Correspondent\n\nReal Madrid secured a convincing 3-1 victory over Manchester City in the Champions League playoff second leg, with Kylian Mbapp scoring a stunning hat-trick. The win earned Real Madrid a 6-3 aggregate victory and a spot in the last 16 of the competition.\n\nMbapps impressive performance was the highlight of the match, with the French forward scoring in the 4th, 33rd, and 61st minutes. His goals were a testament to his skill and speed, leaving Manchester Citys defense struggling to keep up.\n\nReal Madrids dominance was evident throughout the match, with Manchester City failing to manage a shot on target in the first half. The absence of leading striker Erling Haaland, who suffered a knee injury, further weakened Citys attack.\n\nManchester Citys coach, Pep Guardiola, suffered a rare setback, with his team failing to reach the round of 16 for the first time in his illustrious career.\n\nReal Madrid will now face either Bayer Leverkusen or Atltico Madrid in the next round, as they seek to win a record-extending 16th Champions League title. With Mbapp in top form, Real Madrid will be a formidable opponent for any team in the competition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Real Madrid secured a convincing 3-1 victory over Manchester City in the Champions League playoff second leg, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/mbappe-magic-real-madrid-thrash-manchester-city/\">Continue reading<span class=\"screen-reader-text\"> \"MBAPPE MAGIC: Real Madrid Thrash Manchester City…\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "Is it True Passion Java Has Been Deserted by Own Wife?",
            "url": "https://www.zimeye.net/2025/02/21/is-it-true-passion-java-has-been-deserted-by-own-wife/",
            "content": "By A Correspondent | ZimEye | A story circulated claiming that preacher Passion Java has been deserted by his wife, Lily.\n\nZimEye reached out to Java to inquire about this, and he replied, saying:\n\nIts Tatelicious who started it all by saying I went to Cape Town. When I had finished my meeting, I said, Let me stay, and I have a house at the beach. So I was wearing my beachwear. I was five minutes from the house when it was said of me that I had gone mad. But the internet is the internet.\n\nJava was asked about the reported clearing of his wifes Instagram account of his pictures. He said,\n\nWe cleared our Instagram accounts and handed them to the church staff to manage.\n\nHe also added that he is now involved in building and managing his church.\n\nHow big is your church? Java was asked.\n\nI have 38 branches, he said.\n\nJava also took time to insult senior war veteran Blessed Geza, saying he will not be able to fix the country as promised.\n\nWhich are you in the cosmos of politics in Zimbabwe? he was asked. He replied,\n\nThere is a mudhara I saw who was talking too much.\n\nThere is only one side of politics in Zimbabwe, the only side of ED Mnangagwa, he said.\n\nWhen asked how he could support someone who was recently described by his own prophet as a condemned politician humbled to the point of eating grass like cattle, he said,\n\nThere is nothing like that. There is no such prophecy, he said.\n\nThe day when I announced, Pamberi naED, God had told me hes the leader of my choice, so for such a person to end up eating grass, its impossible, he said.\n\nHe added, Its impossible; its impossible. That man is Gods messenger, he said.- ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | A story circulated claiming that preacher Passion Java has been deserted by his wife, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/is-it-true-passion-java-has-been-deserted-by-own-wife/\">Continue reading<span class=\"screen-reader-text\"> \"Is it True Passion Java Has Been Deserted by Own Wife?\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "Government’s Tuition Fees Default Leaves Students In Limbo",
            "url": "https://www.zimeye.net/2025/02/21/governments-tuition-fees-default-leaves-students-in-limbo/",
            "content": "By A Correspondent\n\nA crisis is brewing at Great Zimbabwe University (GZU) in Masvingo as the governments failure to pay outstanding tuition fees for its teacher development programme beneficiaries has resulted in the withholding of certificates for numerous students.\n\nAccording to sources within the university, the governments inability to settle the arrears has left many teachers in a precarious situation.\n\nThe failure to pay the tuition fees has led to the withholding of certificates, revealed an official from the universitys main campus.\n\nThis development has come at a critical time, as the Ministry of Primary and Secondary Education has announced vacancies for school deputy heads and heads.\n\nMany of the affected teachers were eager to apply for these positions, but without their certificates, they are unable to submit their applications.\n\nThe situation has caused significant frustration among the affected teachers, who now face delays in their professional progress due to the unresolved financial issues.\n\nOne affected teacher lamented, We have completed our studies, but we cannot move forward in our careers.\n\nThe university is yet to release an official statement on the matter, but it is clear that the governments inaction has caused significant hardship for these teachers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A crisis is brewing at Great Zimbabwe University (GZU) in Masvingo as the government’s failure to pay … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/governments-tuition-fees-default-leaves-students-in-limbo/\">Continue reading<span class=\"screen-reader-text\"> \"Government’s Tuition Fees Default Leaves Students In Limbo\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "Mnangagwa Remains On Targeted Sanctions",
            "url": "https://www.zimeye.net/2025/02/21/mnangagwa-remains-on-targeted-sanctions/",
            "content": "By A Correspondent\n\nThe European Union (EU) has extended its targeted sanctions on Zimbabwes ruling Zanu PF party for another year, now lasting until 20 February 2026.\n\nThe sanctions continue to target key individuals within the party, who are seen as either directly involved in or supportive of the political establishment, as well as entities linked to the government.\n\nNotably, the EU has decided to remove the Zimbabwe Defence Industries (ZDI) from its sanctions list.\n\nHowever, the embargo on arms and equipment that could be used for internal repression remains in effect, signaling ongoing concerns over potential human rights violations within the country.\n\nIn response to the EUs renewed sanctions, Zimbabwes government, along with regional organizations such as the Southern African Development Community (SADC) and the African Union (AU), have criticized the measures.\n\nThey argue that the sanctions continue to harm Zimbabwes economy, significantly affecting the livelihoods of ordinary citizens while failing to bring about the desired political change.\n\nThese entities call for the unconditional removal of the sanctions, stressing that they are a barrier to Zimbabwes economic development and a form of external interference in the countrys sovereignty.\n\nIn essence corruption is the barrier to economic growth in Zimbabwe.\n\nThe issue of targeted sanctions remains a deeply contentious one in Zimbabwe, with calls for their removal intensifying.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The European Union (EU) has extended its targeted sanctions on Zimbabwe’s ruling Zanu PF party for another … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/mnangagwa-remains-on-targeted-sanctions/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Remains On Targeted Sanctions\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "Nakamba Club In Tight Relegation Battle",
            "url": "https://www.zimeye.net/2025/02/21/nakamba-club-in-tight-relegation-battle/",
            "content": "Sports Correspondent\n\nLuton Town, the English Championship club where Zimbabwean international Marvelous Nakamba plays, is on the brink of relegation to the third tier of English football. The Hatters have endured a dismal campaign, languishing at the bottom of the Championship log with a mere 27 points from 32 matches.\n\nThe teams struggles led to the departure of former manager Rob Edwards last month. Despite a change in leadership, Lutons fortunes have not improved, with their last victory in the Championship dating back to December, when they edged Derby County 2-1.\n\nAs the relegation battle intensifies, Luton faces a crucial encounter against fellow strugglers Plymouth Argyle at Kenilworth Road tonight. The match presents a vital opportunity for the Hatters to revive their dwindling hopes of survival in the Championship.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Luton Town, the English Championship club where Zimbabwean international Marvelous Nakamba plays, is on the brink of relegation … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/nakamba-club-in-tight-relegation-battle/\">Continue reading<span class=\"screen-reader-text\"> \"Nakamba Club In Tight Relegation Battle\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "Is Mnangagwa Sincere About Empowering War Veterans?",
            "url": "https://www.zimeye.net/2025/02/21/is-mnangagwa-sincere-about-empowering-war-veterans/",
            "content": "By A Correspondent\n\nAs Zimbabwe marks 45 years of independence, President Emmerson Mnangagwas administration has vowed to focus on empowering war veterans who played a pivotal role in the liberation struggle.\n\nIn a significant development, special presidential advisor Dr. Paul Tungwarara declared that the era of hardship for war veterans was over, emphasizing a new era of economic empowerment.\n\nSpeaking at the launch of the Mashonaland West Presidential War Veterans Fund, the Presidential War Veterans Borehole Drilling Program, and the Presidential War Veterans Rural Housing Scheme in Zvimba North, Mahiya on Tuesday, Dr. Tungwarara boldly stated, Now is the time for economic emancipation.\n\nWar veterans, I am with you. The time of being a laughing stock is over.\n\nIn line with this vision, Douglas Mahiya, the ZANU PF Secretary for War Veterans League, shared additional initiatives aimed at improving the welfare of former freedom fighters. One of the key developments includes the creation of the War Veteran Family Wealth Trust.\n\nThis trust is designed as a vehicle to empower the families of war veterans, providing them with financial stability and opportunities for growth.\n\nMahiya highlighted that the government, under the leadership of President Mnangagwa, is dedicated to doing everything it can to economically empower war veterans. President E.D. Mnangagwa is going all he can to economically empower the War Veterans, Mahiya affirmed during the launch event.\n\nHowever, there is a growing chorus of skepticism among critics who argue that these efforts are nothing more than political games designed to garner support from a key demographic ahead of the upcoming elections\n\n. Some say that Mnangagwas promises to war veterans have been made before, but the actual implementation of such programs has often been slow or insufficient.\n\nGiven the ongoing economic struggles faced by many war veterans, critics believe the governments promises are more about political posturing than genuine commitment to their welfare.\n\nDespite these concerns, the launch of these programs is seen by some as a significant step toward addressing long-standing grievances. Whether they will translate into meaningful change for war veterans remains to be seen.\n\nThe governments push for empowerment comes amid increasing demands for the recognition and better treatment of Zimbabwes former freedom fighters who have long faced economic hardships.\n\nWhile some are hopeful, others remain unconvinced, questioning whether the promises will lead to tangible outcomes or if they are simply part of a pre-election strategy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent As Zimbabwe marks 45 years of independence, President Emmerson Mnangagwa’s administration has vowed to focus on empowering … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/is-mnangagwa-sincere-about-empowering-war-veterans/\">Continue reading<span class=\"screen-reader-text\"> \"Is Mnangagwa Sincere About Empowering War Veterans?\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "EU Maintains Sanctions On Mnangagwa Regime",
            "url": "https://www.zimeye.net/2025/02/21/eu-maintains-sanctions-on-mnangagwa-regime-2/",
            "content": "By A Correspondent\n\nDespite ongoing human rights violations, Zanu PF has appealed for the removal of sanctions\n\nEU Extends Sanctions on Zimbabwe\n\nThe European Union (EU) has extended its sanctions on Zimbabwe for another year, set to last until 20 February 2026. However, it has removed the Zimbabwe Defence Industries (ZDI) from its sanctions list. The embargo on arms and equipment that could be used for internal repression remains in effect.\n\nZanu PF has expressed disappointment, criticizing the EU for continuing to impose what it describes as unilateral and illegal sanctions on Zimbabwe. The government, along with the Southern African Development Community (SADC) and the African Union (AU), continues to demand the unconditional lifting of sanctions. They argue that the sanctions have severely damaged Zimbabwes economy and have disproportionately affected the livelihoods of ordinary citizens, making them unjust, cruel, and unfair.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Despite ongoing human rights violations, Zanu PF has appealed for the removal of sanctions… EU Extends Sanctions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/eu-maintains-sanctions-on-mnangagwa-regime-2/\">Continue reading<span class=\"screen-reader-text\"> \"EU Maintains Sanctions On Mnangagwa Regime\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        },
        {
            "title": "Mbappe Makes History with 501 Career Goals",
            "url": "https://www.zimeye.net/2025/02/21/mbappe-makes-history-with-501-career-goal-contributions/",
            "content": "Kylian Mbappe achieved an incredible milestone in Real Madrids thrashing of Manchester City, scoring a hat-trick and reaching 501 career goal contributions. This impressive feat is a testament to the 26-year-olds exceptional skill and consistency on the field. Sports Correspondent\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Kylian Mbappe achieved an incredible milestone in Real Madrid’s thrashing of Manchester City, scoring a hat-trick and reaching 501 career … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/21/mbappe-makes-history-with-501-career-goal-contributions/\">Continue reading<span class=\"screen-reader-text\"> \"Mbappe Makes History with 501 Career Goals\"</span></a></p>",
            "time": "09:07",
            "date": "22 Feb 2025"
        }
    ]
}