{
    "news": [
        {
            "title": "Callous Woman Poisons Own Daughter( 7 Months ) With Pesticide",
            "url": "https://www.zimeye.net/2025/05/22/callous-woman-poisons-own-daughter-7-months-with-pesticide/",
            "content": "By A Correspondent\n\nGWERU  A 21-year-old woman, Felistas Mpofu, has been sentenced to seven years in prison by the Gweru Circuit High Court for the cold-blooded poisoning of her seven-month-old daughter with a pesticide.\n\nAccording to a statement released by the National Prosecuting Authority of Zimbabwe (NPAZ), Mpofu committed the offence in 2022 when she was 19 years old. She had travelled from Mberengwa to Mandava, carrying her baby girl.\n\nIn a shocking revelation, Mpofu admitted to mixing pesticide into milk and feeding it to her infant daughter. The baby reportedly began crying uncontrollably, prompting concerned individuals to take her to Zvishavane General Hospital. Despite medical efforts, the child tragically passed away.\n\nA post-mortem later confirmed that the baby had ingested a toxic substance, leading to her death. The case took a decisive turn when a Good Samaritan, who had temporarily taken Mpofu in, found a baby feeding bottle emitting a strong chemical odour among her belongings. This discovery led to further investigations and ultimately, Mpofus arrest and prosecution.\n\nIn court, Mpofu expressed regret but admitted to the crime, saying she felt overwhelmed by the responsibility of motherhood.I killed my child because I felt I could not take care of her properly,she told the court.\n\nThe judge, in delivering the sentence, noted the gravity of the offence but also considered Mpofus age and circumstances at the time of the crime. However, he emphasized the sanctity of human life and the need for deterrence.\n\nMpofu will serve seven years in prison for the crime that has shocked the nation and reignited conversations around mental health, poverty, and support systems for young mothers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent GWERU – A 21-year-old woman, Felistas Mpofu, has been sentenced to seven years in prison by the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/callous-woman-poisons-own-daughter-7-months-with-pesticide/\">Continue reading<span class=\"screen-reader-text\"> \"Callous Woman Poisons Own Daughter( 7 Months ) With Pesticide\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Top CIO Boss Dies In Horror Crash",
            "url": "https://www.zimeye.net/2025/05/22/top-cio-boss-dies-in-horror-crash/",
            "content": "By A Correspondent- A top Central Intelligence Organisation (CIO) officer and a senior prison official were killed in a horrific road accident in Masvingo on Tuesday evening, rekindling concerns about the alarming number of unexplained deaths involving senior security service personnel since Zimbabwes 2017 military coup.\n\nGift Nyama, the CIO head for Gutu District, andPrincipal Correctional Officer Masimba Blessing Mandimutsiraof Mutimurefu Prison died in a three-vehicle pile-up near the Mutimurefu Prison Bus Stop along the MasvingoMutare highway.\n\nNyama, who had just attended a farewell party reportedly held at 4/2 Infantry Brigade at Mpandawana Growth Point in Gutu, is said to have been driving from the event when tragedy struck. According to early reports, Nyamas vehicle rammed into a stationary tractor abandoned in the middle of the road without lights or reflectors. While prison officers, including Mandimutsira, rushed to the scene to assist, a second vehiclea Ford Ranger driven byChief Superintendent Simangaliso Dube, Officer Commanding Masvingo Central Districtapproached at speed. In an attempt to avoid the pile-up, Dube reportedly veered off the road and struck Mandimutsira.\n\nNyama is said to have died instantly after breaking his neck, while Mandimutsira succumbed to his injuries at Masvingo Provincial Hospital.\n\nSources toldThe Mirrorthat the farewell party had been attended by high-profile figures, includingWalter Manjonjo, a ZANU PF provincial youth executive member for Ward 33 in Gutu, indicating the deep political and military connections of those involved.\n\nThe crash occurred at a known black spot that has claimed the lives of two other officers in the past year. The Zimbabwe Republic Police provincial spokesperson,Inspector Kudakwashe Dhewa, was unavailable for comment, butSuperintendent Francis Makonese, Officer-in-Charge of Prisons in Masvingo, confirmed the accident in a statement.\n\nThe deaths of Nyama and Mandimutsira add to a growing list of fatal incidents involving senior security personnel in the aftermath of the 2017 military coup that ousted long-time leader Robert Mugabe and brought President Emmerson Mnangagwa to power.\n\nSince the coup, several high-ranking figures within the military, intelligence, and police sectorsmany of whom were either aligned with or seen as potential threats to shifting power dynamicshave died under unclear or suspicious circumstances. Among them:\n\nThese deathsoften reported as accidents, sudden illnesses, or COVID-relatedhave sparked persistent speculation of a silent purge within the state security infrastructure, as rival factions continue to jostle for control behind the scenes of a politically fragile regime.\n\nIn this context, the death of Gift Nyamaa high-ranking CIO officer with access to sensitive national security operationsmay raise more questions than answers.\n\nThe pattern of fatalities among security sector elites feeds into broader concerns about instability, secrecy, and unresolved tensions within Zimbabwes post-coup establishment. With elections now concluded and internal ZANU PF power battles heating up ahead of 2028, observers warn that such deaths may not be mere coincidence.\n\nZimbabwes security sector remains deeply factionalised and heavily politicised. Every death of a senior official must be scrutinised, especially when it involves those with knowledge of past or ongoing power struggles, a former intelligence officer toldThe Mirroron condition of anonymity.\n\nAs the country continues to grapple with economic hardship, contested legitimacy, and deepening repression, the shadow of the 2017 coup looms largeits consequences still unfolding, one suspicious death at a time.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent- A top Central Intelligence Organisation (CIO) officer and a senior prison official were killed in a horrific … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/top-cio-boss-dies-in-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Top CIO Boss Dies In Horror Crash\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Kembo Body Language speaks volumes",
            "url": "https://www.zimeye.net/2025/05/22/kembo-body-language-speaks-volumes/",
            "content": "Mohadi body language says it all.Vice President Kembo Mohadi body language at the launch of National Culture Month 2025 in Chiredzi, running under the theme Celebrating Indigenous Voices.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mohadi body language says it all. Vice President Kembo Mohadi body language at the launch of National Culture Month 2025 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/kembo-body-language-speaks-volumes/\">Continue reading<span class=\"screen-reader-text\"> \"Kembo Body Language speaks volumes\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Touching Tribute To Joseph Madhimba",
            "url": "https://www.zimeye.net/2025/05/22/touching-tribute-to-joseph-madhimba/",
            "content": "By Tichaona Sibanda- I became a journalist because of Joseph Madhimba.\n\nSo when I received the news today that the iconic journalistwho defined the role of anchorman for an entire generation of Zimbabwean television viewershad passed away, I was devastated.\n\nI knew he had been unwell since last year. After both of us left the Zimbabwe Broadcasting Corporation (ZBC) more than two decades ago, we remained in close contact. We would speak on the phone weekly, for hours, discussing everything from politics and current affairs to the state of our beloved Zimbabwe. He was an encyclopaedia of knowledgealways the person I turned to for guidance and wise counsel.\n\nAround September last year, I noticed I hadnt heard from him in several days. I called, but there was no answer. I sent messages, but he didnt respond. My concern grew. I reached out to an old friend,Tabby Moyo, a journalist based in Windhoek, Namibia, and asked him to check on Joseph.\n\nBefore Tabby could get back to me, I contacted one of Mukoma Joes longtime friends from their St Ignatius College daysJohn Gambanga, a distinguished journalist based in Harare. The two had been friends for over 50 years, and it turned out that John was already aware: Joseph had suffered a massive stroke and had been hospitalised.\n\nIronically, just last month, one of Zimbabwes finest news anchors,Wayne Musabayana, called me after Id informed her that her former co-presenter was unwell. Both of us were hopeful that he would recover. His passing today is a personal blowhe was the reason I decided to pursue journalism straight after high school.\n\nGrowing up in Mkoba, GweruJoseph was also from Gweruhe became a fixture in our household. Every evening at 8 p.m., we would tune in to the ZBC main news bulletin. His was the first voice I associated with the news. He inspired me, and everyone I grew up with will tell you: all I ever wanted to be was a journalist. It was because of himthis man who has now sadly left us.\n\nJoseph Madhimba stood forprofessionalism, integrity, and dignityin journalism. He was a national treasure, known for his rich, distinct baritone voice that became a hallmark of Zimbabwean radio and television.\n\nI remember once my mother shouting from the kitchen: Turn down that radio! Cant you hear Madhimbas booming voice rattling the windows? That same commanding voice echoed through our long phone callsbut now, heartbreakingly, it is silent.\n\nI hold fond memories of our time working together in the News and Current Affairs Department at Pockets Hill. He was meticulous about language and pronunciation. If you got it wrong, he would patiently sit you down and explain the correct way. His command of the Queens English left many in aweincluding me. He would often jokingly say,Babamunini, I didnt go to school for nothing.\n\nBeyond that, Joseph was a gifted linguist. He spoke fluent French, having studied journalism in France before Zimbabwes Independence in 1980.\n\nGo well, Mukoma Joe.\n\nMy deepest condolences to his family, friends, and all who knew and loved him. He touched many lives, mine included.\n\nMay his soul rest in peace.\n\nDisclaimer: This tribute was originally shared by journalist Tichaona Sibanda on his personal Facebook page. He writes here in his capacity as a journalist who worked closely with Joseph Madhimba.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tichaona Sibanda- I became a journalist because of Joseph Madhimba. So when I received the news today that the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/touching-tribute-to-joseph-madhimba/\">Continue reading<span class=\"screen-reader-text\"> \"Touching Tribute To Joseph Madhimba\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Tottenham Stun Red Devils To Clinch First Silverware Since 2008",
            "url": "https://www.zimeye.net/2025/05/22/tottenham-stun-red-devils-to-clinch-first-silverware-since-2008/",
            "content": "Sports Correspondent\n\nTottenham Hotspur ended a 17-year wait for a major trophy by edging Manchester United 1-0 in a gritty UEFA Europa League final on Wednesday night, thanks to Brennan Johnsons scrappy first-half goal.\n\nThe victory, Spurs first piece of silverware since winning the League Cup in 2008 and their first European trophy since 1984, also secured them a spot in next seasons UEFA Champions League. The win marked their fourth over Manchester United this season.\n\nThe decisive moment came in the 42nd minute. Pape Matar Sarr delivered a dangerous cross into the box, where Uniteds defense failed to react. Goalkeeper Andr Onana stayed glued to his line as Johnson and United defender Luke Shaw charged in. The ball appeared to deflect off both players before finding the back of the net, just out of Onanas reach.\n\nThe match itself was a tense, scrappy affair  perhaps unsurprising given both teams underwhelming domestic campaigns. United currently sit 16th in the Premier League, with Spurs just one place above in 17th.\n\nUnited had chances to draw level. Rasmus Hjlund rose well for a header in the second half, only to see Micky van de Ven produce a superb clearance off the line. In the dying moments, Luke Shaws header nearly rescued United, but Guglielmo Vicario pulled off a stunning save to preserve the lead.\n\nAfter the match, a jubilant Brennan Johnson expressed the teams relief and pride.\n\nThis season hasnt been good at all but I swear not one of us players right now care about that. This is what its all about, this club hasnt won a trophy for 17 years, Johnson told TNT Sports.\n\nHonestly, this is what it means. It means so much. All the fans get battered, we get battered, for not winning a trophy, for not winning anything. But we had to get the first one in a while today. Im so happy.\n\nFor Spurs and their supporters, the long-awaited moment is finally here  and it came at the expense of one of their fiercest rivals.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Tottenham Hotspur ended a 17-year wait for a major trophy by edging Manchester United 1-0 in a gritty … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/tottenham-stun-red-devils-to-clinch-first-silverware-since-2008/\">Continue reading<span class=\"screen-reader-text\"> \"Tottenham Stun Red Devils To Clinch First Silverware Since 2008\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Croco Motors Boss Implicated In Serious Fraud",
            "url": "https://www.zimeye.net/2025/05/22/croco-motors-boss-implicated-in-serious-fraud/",
            "content": "By Crime and Courts Reporter Croco Motors ownerMoses Tonderai Chingwenaand his sons have been implicated in a serious fraud case involving the alleged unlawful takeover ofKaroi Properties, a company reportedly owned by the late businessmanBrian James Rhodes.\n\nThe allegations were made byElizabeth Parerenyatwa, a Harare woman who claims to be the executor of Rhodes estate. Parerenyatwa made the disclosure while testifying in a separate case in which she accuses two Harare men of providing false information to a public official.\n\nShe told the court that Chingwena and his sons unlawfullyimposed themselves as directorsof Karoi Properties and are currently benefiting from the late Rhodes estate without any legal authority.\n\nChingwena and his sons are criminals who should be arrested for their actions, Parerenyatwa told the court during her testimony.\n\nThe matter has been postponed toMay 27, when Parerenyatwa is expected to becross-examined by the defence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter– Croco Motors owner Moses Tonderai Chingwena and his sons have been implicated in a serious fraud case … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/croco-motors-boss-implicated-in-serious-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Croco Motors Boss Implicated In Serious Fraud\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Division One Club Calls For Match Postponement Due To Financial Meltdown",
            "url": "https://www.zimeye.net/2025/05/22/division-one-club-calls-for-match-postponement-due-to-financial-meltdown/",
            "content": "By Sports Correspondent\n\nMvuma  Zimbabwe Division One outfit Dinson Mvuma FC has appealed to league authorities to postpone its upcoming fixture against Midlands State University (MSU) FC, citing a severe financial crisis that has crippled the clubs operations.\n\nIn a formal letter dated May 19, 2025, addressed to football authorities, club Secretary General Mr. D. Virima laid bare the challenges facing the team, blaming the turmoil on the failure by their main sponsor, Dinson Iron and Steel Company, to release funds since the start of the season.\n\nOur club Dinson Mvuma FC has since the season started been going through a difficult financial strain due to the fact that our sponsor Dinson Iron Steel Company has not availed funds to run the team from the first game to date, wrote Virima.\n\nThe club, which hails from Mushenjere Village in Manhize, requested the postponement of its scheduled fixture against MSU FC on Saturday, May 24, 2025, and potentially its next home game as well.\n\nThis will allow us time to engage the company as well as find other sources to run the team, Virima stated, revealing that the team has failed to adequately pay match officials for the past two home games.\n\nThe situation has now reached a tipping point, with players deserting camp due to the lack of support and payment.\n\nConsequently our players have all left camp and we are unable to raise a team for this weekends fixture, he confirmed.\n\nThe club acknowledged the disruption such a request may cause but emphasized that the decision was necessary to preserve the teams future in the league.\n\nWe are fully aware of the huge inconveniences our request will cause but we think this will allow us time to restrategise and be able to run the team through the season, said Virima.\n\nDinson Mvuma FC, nicknamed The Steel Boys, was established in 2023 and had entered the 2025 season with high hopes. However, the unexpected financial blackout has thrown their campaign into jeopardy.\n\nAs the club awaits a response from league administrators, it remains unclear whether the fixture against MSU FC will go ahead as scheduled. Football fans in the region now watch with concern as one of the areas promising teams fights for survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Mvuma – Zimbabwe Division One outfit Dinson Mvuma FC has appealed to league authorities to postpone its … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/division-one-club-calls-for-match-postponement-due-to-financial-meltdown/\">Continue reading<span class=\"screen-reader-text\"> \"Division One Club Calls For Match Postponement Due To Financial Meltdown\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "‘If Last Night Was An Election, Julius Malema Would be the New US President’",
            "url": "https://www.zimeye.net/2025/05/22/if-last-night-was-an-election-julius-malema-would-be-the-new-us-president/",
            "content": "Did Trump win his argument on Genocide ?: South Africa vs Ukraine\n\nBy Dorrothy Moyo | Analysis | A pair of viral images recently shared by the far-right End Wokeness account show U.S. President Donald Trump in the White House, speaking sternly to Ukrainian President Volodymyr Zelensky in one photo and South African President Cyril Ramaphosa in anotherthis time brandishing a printout referencing alleged attacks on white farmers in South Africa.\n\nThe images have reignited an international debate over Trumps apparent double standard on mass violence and human rights: dismissive of Russias documented atrocities in Ukraine, yet vocally alarmist over what far-right platforms call white genocide in South Africaa claim not supported by credible data.\n\nTrumps Silence on Russian Aggression\n\nWhile Russias full-scale invasion of Ukraine has been universally condemned by Western leaders, Trump has consistently refused to hold Vladimir Putin accountable. Speaking at a CNN town hall in May 2023, Trump said:\n\n..\n\nI want everybody to stop dying. Russians and Ukrainians, I want them to stop dying. And Ill have that war settled in one day, 24 hours. CNN Town Hall, 10 May 2023\n\nHe refused to say whether he wanted Ukraine to win the war and avoided directly criticizing Putin. Trumps evasiveness and past praise for Putincalling him very smart at the outset of the invasionhave drawn criticism from NATO allies and American foreign policy experts alike. Despite mounting evidence from international investigators of war crimes, mass graves, and civilian bombings, Trump has never acknowledged Russian aggression as genocide.\n\nTrump Amplified White Genocide Conspiracy\n\nContrast this with Trumps 2018 tweet:\n\nI have asked Secretary of State @SecPompeo to closely study the South Africa land and farm seizures and expropriations and the large-scale killing of farmers. Donald Trump, 22 August 2018\n\nThe tweet was inspired by a Tucker Carlson segment promoting the false claim of a racial genocide against white farmers. Multiple investigations, including one by BBC Africa Check, concluded that: Farm murders in South Africa affect both black and white farmers. There is no state-led or systematic campaign of extermination. The homicide rate in farming communities is part of broader violent crime trends.\n\nEven South Africas government condemned Trumps tweet as based on false information.\n\nJulius Malema: A Surprising Voice of Moral Consistency?\n\nWhile Julius Malema is often described as a populist and firebrand, particularly over his rhetoric on land expropriation and race, he has publicly condemned Russias invasion of Ukrainesetting him apart from Trumps equivocation.\n\nRussia is wrong for entering Ukraine militarily, but the US is equally wrong for provoking Russia. We need peace and not war. Julius Malema, EFF media briefing, 10 March 2022\n\nWe call for the immediate withdrawal of Russian troops from Ukraine. The sovereignty of Ukraine must be respected. EFF Statement, 3 March 2022\n\nMalema went further to call for a return to negotiations and respect for the territorial integrity of all nations, a stance he reiterated in multiple public addresses. While the EFF criticized NATOs expansion as a trigger for tension, they did not excuse the invasion itself.\n\nThis stands in stark contrast to Trump, who has repeatedly refused to assign blame to Russia or even acknowledge Ukraines suffering in clear terms.\n\nWho Is the Better Moral Example?\n\nThe comparison may be uncomfortable for many in the West: a South African opposition leader often vilified for radical speech showing more moral clarity on a major war crime than a sitting U.S. president.\n\nWhile Malemas rhetoric is not without controversy, his condemnation of Russias aggression is grounded in international law and human rights principles. Trump, on the other hand, has used his platform to amplify disinformation about South Africa while remaining silent on verified atrocities in Ukraine.\n\nPolitical Expediency Over Principle\n\nTrump has proven to be no moral beacon. His response to international crises is shaped not by justice or ethics but by what resonates with his political base. Malema, though deeply polarizing, has at least maintained consistency in condemning global violencewhether from NATO or Russia.\n\nVerdict: No, Trump has not communicated wisely or ethically. His selective outrage undermines his credibility, and ironically, even Julius Malemaa man Trump supporters might dismisshas stood on higher moral ground when it comes to global justice.\n\nIn the end what could have worked to stop Malemas dangerous inflammatory politics, has sadly gone sour due to Trumps failures at communication. It might take a while for someone to come up and heal the credibility wounds inflicted. The embarrassment was huge  if last night was an election, Malema would be the new US president.  ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Did Trump win his argument on Genocide ?: South Africa vs Ukraine By Dorrothy Moyo | Analysis | A pair … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/if-last-night-was-an-election-julius-malema-would-be-the-new-us-president/\">Continue reading<span class=\"screen-reader-text\"> \"‘If Last Night Was An Election, Julius Malema Would be the New US President’\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Trump Confronts Ramaphosa Over Persecution Of White Farmers",
            "url": "https://www.zimeye.net/2025/05/22/trump-confronts-ramaphosa-over-persecution-of-white-farmers/",
            "content": "By A Correspondent\n\nIn a tense and unexpected exchange at the White House,  U.S. President Donald Trump confronted South African President Cyril Ramaphosa with controversial accusations that white farmers in South Africa are being systematically targeted, attacked, and killed.\n\nThe meeting, initially intended to strengthen bilateral ties and discuss trade, was quickly derailed when Trump launched into a pointed interrogation regarding alleged violence against white South African farmersa claim that has been widely debunked by human rights organizations and South African law enforcement.\n\nDuring a live press conference, Trump cued a video montage depicting a field of white crosses, which he claimed represented the graves of murdered white farmers\n\n. The footage included a snippet of opposition leader Julius Malema chanting Shoot the Boer, a phrase that has stirred significant controversy in South Africa.\n\nThis is whats happening in your country, Trump said, gesturing toward the screen. They take their land, they kill the white farmers, and nobody is held accountable. What are you doing about this?\n\nVisibly taken aback, Ramaphosa pushed back forcefully. Thats simply not true, he replied. If we were experiencing genocide, the white South Africans in my delegationpeople like Ernie Els, Retief Goosen, and Johann Rupertwouldnt be here today.\n\nTrump appeared unconvinced, interjecting, But these people, they get their land taken, and then theyre killed. The world needs to hear this.\n\nRamaphosa reiterated that South Africas government does not support violence or racially targeted attacks. We are a constitutional democracy, he stated. What you saw in that videothose comments are from an opposition leader, not government policy.We dont govern through hate.\n\nThe video shown by Trump, according to analysts, was sourced from a 2020 protest in KwaZulu-Natal following the murder of a farming couple. The crosses were a symbolic installation, not actual grave markers. Trump admitted he didnt know the specific origins of the video, but insisted it demonstrated a pattern.\n\nThe meeting followed the controversial U.S. decision to grant asylum to 59 white South Africans, citing fears of racial persecution. Ramaphosa previously dismissed the asylum-seekers as cowards fleeing a non-existent threat.\n\nEFF leader Julius Malema, whose rhetoric featured prominently in Trumps presentation, reacted mockingly on social media: A group of old men met in Washington to gossip about me, he posted. He further clarified that land expropriation without compensation remains a policy objective, but that it does not translate to physical harm against any racial group.\n\nDespite Ramaphosas effort to charm the former U.S. president with golf-themed diplomacyincluding a massive book showcasing South African golf courses and the presence of two national sports iconsthe tone of the meeting shifted sharply after the video was played and Trump distributed printed articles of alleged attacks on white farmers.\n\nWere not here to sweep things under the rug, Trump concluded. This issue matters, and I want answers.\n\nRamaphosa maintained his position: We welcome scrutiny, but it must be grounded in truth, not myth. South Africa belongs to all who live in itblack and white.\n\nThe contentious exchange has raised questions about the influence of fringe narratives on U.S. foreign policy and whether refugee designations are being politicized. For now, it remains unclear whether the diplomatic fallout will impact trade negotiations, especially with looming tariffs on South African exports set to take effect later this year.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a tense and unexpected exchange at the White House, U.S. President Donald Trump confronted South African … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/trump-confronts-ramaphosa-over-persecution-of-white-farmers/\">Continue reading<span class=\"screen-reader-text\"> \"Trump Confronts Ramaphosa Over Persecution Of White Farmers\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        },
        {
            "title": "Julius Malema Declares Ramaphosa-Trump Media Briefing Is A “Cowardly Betrayal” of South African Sovereignty",
            "url": "https://www.zimeye.net/2025/05/22/julius-malema-declares-ramaphosa-trump-media-briefing-is-a-cowardly-betrayal-of-south-african-sovereignty/",
            "content": "By A Correspondent\n\nThe Economic Freedom Fighters (EFF) has sharply condemned the recent joint press briefing held by President Cyril Ramaphosa and  U.S. President Donald Trump, accusing both leaders of vilifying EFF Commander in Chief Julius Malema and undermining South Africas constitutional principles. The fiery statement follows a tense exchange in Washington, where Trump confronted Ramaphosa with discredited claims of a so-called white genocide and aired controversial footage featuring Malema.\n\nAccording to the EFF, what was framed as a diplomatic engagement quickly devolved into a personal attack on Malema and the partys agenda for land reform and economic justice. The EFF criticized Ramaphosa for aligning himself with white business elites and accused him of denouncing rulings from South Africas highest courts, which previously upheld the historical and cultural significance of the struggle-era chant Kill the Boer.\n\nIn a strongly worded statement, the EFF characterized the meeting as an interaction dominated by white privileged men and a clear sign of collusion between the ANC, white capital, and Trumps political machine. The party also voiced serious concern over what it calls an imperialist attempt to reverse progressive laws such as land expropriation without compensation.\n\nSee statement below:\n\nEFFECONOMIC FREEDOM FIGHTERSEFF STATEMENT ON THE JOINT PRESS BRIEFING BY CYRIL RAMAPHOSA AND DONALD TRUMP REGARDING CONDITIONS IN SOUTH AFRICA AND CIC JULIUS MALEMAWednesday, 21 May 2025\n\nThe Economic Freedom Fighters (EFF) has taken note of the press briefing held jointly by the President of South Africa Cyril Ramaphosa and the President of the United States of America (USA) Donald Trump. The meeting, which came under the pretext of discussing diplomatic, trade and economic relations, ended up being a discussion about the President and Commander in Chief of the EFF Julius Malema and his correct and principled position regarding the return of the land to African people, and the return of the means of production into the hands of the African majority.\n\nIn what comes as no surprise, Cyril Ramaphosa and his delegation which was constituted by the likes of Stellenbosch racist billionaire Johann Rupert, Donald Trumps golfing buddy Ernie Els, and Minister of Agriculture and leader of the racist Democratic Alliance (DA) John Steenhuisen, was an interaction dominated by white privileged men, who have amassed wealth at the expense of African people, who spent a majority of the time expressing their hatred of the EFF and of its leader Julius Malema.\n\nTrump proceeded to play numerous clips of the President of the EFF wherein our leader spoke correctly about the unequal distribution of land in South Africa and sang the chant Kill The Boer, Kill The Farmer, which is a song that expresses the desire to destroy the system of white minority control over the resources of South Africa. This liberation chant was considered as part of African heritage by the Equality Court, which also said the song could not be interpreted literally. The Supreme Court of Appeal and the Constitutional Court of South Africa then ratified this decision.\n\nIn an act of cowardice, Cyril Ramaphosa blatantly denounced the rulings of the courts of the country he is a President of, and this was then followed by insults from John Steenhuisen who then confirmed that they reached a pact with the African National Congress (ANC) to keep the EFF out of power. This pact was a clear collusion to prevent genuine transformation in South Africa. Additionally, this meeting between Ramaphosa and Trump has led to the inadvertent confirmation of the consolidation of the 2024 alliance between white minority capital and the neoliberal and counter-revolutionary ANC.\n\nJohann Rupert then followed, identifying the CIC Julius Malema as his enemy for over 10 years, and then citing their relationship since Julius Malemas days in the once vibrant ANC Youth League. The true intentions of the meeting were then revealed as Rupert went on to lobby for the allowing of Elon Musks Starlink to operate in South Africa.\n\nThe dominance of white male voices in the entire interaction proves and vindicates the EFF that the delegation was one that sought to make assurances to Trump that the transformation agenda of South Africa is one that can be compromised on upon negotiation. All of the utterances by Ramaphosas delegation point to a devious plot to rekindle relations with a maniacal Trump administration by sacrificing our sovereignty at the altar of convenience.\n\nThe South African delegation was at pains to explain how they have no interest in redressing the unequal patterns of land ownership in South Africa using what is now constitutionally provisioned as nil compensation through the Expropriation Act. The entire delegation failed dismally at countering the false narrative of a white genocide in South Africa, by contrasting the narrative through evidence-based statistics and data around crime in our country that affects all South Africans.\n\nSouth Africa has been embarrassed by a delegation that was contradicting itself, that abandoned judicial decisions, and at times was simply grovelling and lying.\n\nThe EFF is proud that its legislative and political agenda, led by the President and Commander in Chief Julius Malema, has shaken the corridors of imperialism in Washington. Our Commander in Chief can be considered in the lines of great revolutionaries, as Donald Trump in his illiterate rants has called for his arrest for daring to call for land expropriation without compensation. As a result, the EFF is concerned by this call that something must be done to stop the EFF President from chanting a liberation heritage song.\n\nTherefore, the EFF will continue to keenly follow the developments in Washington and reiterates that we will oppose any compromising of our laws to allow for Starlink to operate in South Africa, and we will oppose any reversal of transformative legislation including that which will allow for expropriation of land.\n\nWe will defend our constitutional democracy and never bow and succumb to imperialism. All those opposed to the dominance of the few by the many must never fear and must chant loudly against the system of oppression.\n\nDhubula iBhulu! Kill the Boer, Kill the Farmer! Victory is Certain!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Economic Freedom Fighters (EFF) has sharply condemned the recent joint press briefing held by President Cyril … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/22/julius-malema-declares-ramaphosa-trump-media-briefing-is-a-cowardly-betrayal-of-south-african-sovereignty/\">Continue reading<span class=\"screen-reader-text\"> \"Julius Malema Declares Ramaphosa-Trump Media Briefing Is A “Cowardly Betrayal” of South African Sovereignty\"</span></a></p>",
            "time": "08:45",
            "date": "23 May 2025"
        }
    ]
}