{
    "news": [
        {
            "title": "Kasukuwere Tells ED: Wanyanya Shamwari!",
            "url": "https://www.zimeye.net/2025/10/10/kasukuwere-tells-ed-wanyanya-shamwari/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "Oppah Muchinguri In Danger",
            "url": "https://www.zimeye.net/2025/10/10/oppah-muchinguri-in-danger/",
            "content": "By A Correspondent-ZANU PF national chairperson and Defence Minister Oppah Muchinguri-Kashiri has hit back at what she described as coordinated online attacks targeting her family, accusing internal party rivals and social media cyber-bullies of waging a smear campaign against her children for supporting President Emmerson Mnangagwas continued stay in power.\n\nSpeaking in an interview withNewsDay, Muchinguri-Kashiri said her family had become a target of political opponents following her remarks at a recent National Prayer Day in Mutare, where she publicly endorsed Mnangagwa as the countrys best foot forward.\n\nI have never been in the habit of responding to trivial things on social media, Muchinguri-Kashiri said. We have important things to do, including developing our country and preparing for the annual conference in Mutare. But on this one, let me respond.\n\nThe outspoken ZANU PF chairperson said her childrens privacy was being violated by those seeking to silence her political stance.\n\nWhy involve our children in ZANU PF matters? I think those people are high on drugs, she fumed. Social media is being used as a weapon by our enemies. They should attack the mother, not my daughter. They want to silence me, but they will not succeed. My daughter is well-groomed  she knows what is right and wrong.\n\nMuchinguri-Kashiri said the attacks had reached disturbing levels, prompting her to warn other ministers to protect their families from similar targeting.\n\nI have since told some of my fellow ministers that they should be on guard because people have turned evil out there, targeting our children. They can be drugged, so we have said they should limit going out, she said.\n\nDismissing her critics as lazy people, she added: President Mnangagwa has said he does not like lazy people, and these are the people we are seeing on social media  lazy and high on drugs.\n\nHer remarks come at a time when ZANU PF is deeply divided over Mnangagwas succession and a growing internal rebellion against attempts to extend his rule beyond the constitutional two-term limit.\n\nSources within the party say Muchinguri-Kashiri has become a lightning rod in the factional battles, with her perceived closeness to Mnangagwa making her a target of the camp aligned to Vice President Constantino Chiwenga.\n\nThe Chiwenga faction  reportedly angered by Mnangagwas ED2030 campaign  is said to be working to discredit key figures who openly back the Presidents extended stay in power. Online smear campaigns and social media attacks have become a common tactic in the ruling partys shadow war, often aimed at family members of senior politicians to inflict reputational damage.\n\nThe timing of the attacks is also telling. ZANU PF is set to hold its annual conference in Mutare next week, amid fears that factional rivalries could spill into open confrontation.\n\nMuchinguri-Kashiris defiant tone reflects the rising tension within the ruling party as the battle for control intensifies. Once seen as a potential compromise candidate in the Mnangagwa-Chiwenga rivalry, she now finds herself squarely in the crossfire of ZANU PFs escalating succession war.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-ZANU PF national chairperson and Defence Minister Oppah Muchinguri-Kashiri has hit back at what she described as coordinated … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/oppah-muchinguri-in-danger/\">Continue reading<span class=\"screen-reader-text\"> \"Oppah Muchinguri In Danger\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "VP Chiwenga Faction Plans To Disrupt Mutare Conference",
            "url": "https://www.zimeye.net/2025/10/10/vp-chiwenga-faction-plans-to-disrupt-mutare-conference/",
            "content": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PFs upcoming annual conference in Mutare amid reports that a faction aligned to Vice President Constantino Chiwenga is plotting to disrupt the event in protest against plans to extend Mnangagwas rule beyond the constitutional limit.\n\nZimEye can reveal that disgruntled officials sympathetic to Chiwenga are quietly mobilising to embarrass Mnangagwa at the high-profile gathering, scheduled for October 1318 at the Mutare Polytechnic Pavilion Grounds. The tension comes as divisions between Mnangagwa and his deputy widen over the future of the presidency and control of the party ahead of the 2028 elections.\n\nThe ZANU PF Womens League boss, Mabel Chinomona, appeared to confirm internal unease this week when she warned against spoilers seeking to sabotage the Mutare conference. Speaking at a Womens League empowerment programme at Chiwetu Training Centre in Makoni West Constituency, Chinomona  a politburo member  lashed out at those destroying the party from within.\n\nWe have the conference which is coming up in Mutare in Manicaland province next week. We dont want things which are not good; please, we dont want people who are destroying our party. Dont destroy your own party, she said.\n\nI am the leader of the womens league and I am ready to suspend people who are spreading falsehoods ahead of the conference. We dont want that, please.\n\nHer remarks reflected growing anxiety in the Mnangagwa camp as the party braces for what could be its most divisive gathering in years.\n\nThe latest rift centres on Mnangagwas loyalists pushing for a constitutional amendment or internal resolution that would allow him to extend his tenure until 2030. The so-called ED2030 campaign has angered Chiwengas backers, who view it as a betrayal of a long-standing power-sharing pact allegedly agreed upon after the November 2017 military-assisted transition that ousted the late Robert Mugabe.\n\nAccording to insiders, the 2017 coup that brought Mnangagwa to power was executed with the understanding that Chiwenga  then Commander of the Defence Forces  would eventually succeed him after two terms. However, as Mnangagwas second term nears its midpoint, the Presidents allies are now working to block Chiwengas path to the top, sparking bitter infighting across government and the party.\n\nThe Chiwenga faction is reportedly using the Mutare conference as a platform to demonstrate its numerical strength and embarrass Mnangagwa by undermining key resolutions, including the endorsement of his extended stay in office.\n\nIronically, Chinomona herself was part of the infamous 2004 Tsholotsho Declaration, a failed bid to alter ZANU PFs leadership hierarchy in Mnangagwas favour  a move that angered Mugabe and saw her and other provincial leaders suspended. Among those suspended was current Speaker of Parliament Jacob Mudenda, who now serves as the partys secretary-general and remains close to Mnangagwa.\n\nAt the same event in Makoni, Information Minister Jenfan Muswere and ICT Minister Tatenda Mavetera  both Mnangagwa loyalists  pledged allegiance to the President.\n\nWe have a training centre here at Chiwetu; its going to train women and youths, said Muswere, steering clear of factional politics.\n\nMavetera, who leads the Young Women for ED movement, was more direct: We are also saying that our President should rule until 2030, she declared.\n\nManicaland Provincial Affairs Minister Misheck Mugadza also tried to project unity, urging women to participate in development projects and announcing plans for a rehabilitation centre in the province.\n\nYet behind the public show of solidarity, the battle lines are clearly drawn. The Mutare conference could expose the worst of ZANU PFs internal fissures, with the Chiwenga faction reportedly planning symbolic walkouts, heckling, and boycotts of key sessions to undermine Mnangagwas authority.\n\nIf such disruptions occur, they would mark the most serious challenge to Mnangagwas grip on the ruling party since he rose to power in 2017  a moment that could define whether ZANU PF remains united or descends into open factional warfare.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PF’s upcoming annual conference in Mutare amid reports that a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/vp-chiwenga-faction-plans-to-disrupt-mutare-conference/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Faction Plans To Disrupt Mutare Conference\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "ED Faces Humiliation",
            "url": "https://www.zimeye.net/2025/10/10/ed-faces-humiliation/",
            "content": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PFs upcoming annual conference in Mutare amid reports of deepening factionalism and growing discontent within the ruling partys ranks.\n\nZimEye can reveal that a faction of disgruntled ZANU PF officials is plotting to disrupt the Mutare conference, scheduled for October 1318, in protest against the controversial bid to extend Mnangagwas presidency beyond the constitutional two-term limit.\n\nTensions boiled over this week when ZANU PF Womens League boss, Mabel Chinomona, publicly warned against spoilers seeking to sabotage the event. Speaking at a Womens League empowerment programme at Chiwetu Training Centre in Makoni West Constituency, Chinomona  a politburo member  appeared visibly agitated as she read the riot act to party members.\n\nWe have the conference which is coming up in Mutare in Manicaland province next week. We dont want things which are not good; please, we dont want people who are destroying our party. Dont destroy your own party, she said.\n\nI am the leader of the womens league and I am ready to suspend people who are spreading falsehoods ahead of the conference. We dont want that, please.\n\nHer remarks laid bare the growing sense of panic within ZANU PF as internal divisions threaten to overshadow Mnangagwas leadership ahead of the 22nd annual national peoples conference to be held at Mutare Polytechnic Pavilion Grounds.\n\nThe tensions stem largely from the ongoing campaign by Mnangagwa loyalists to push for a constitutional amendment that would allow him to remain in power until 2030  a move fiercely opposed by some senior party officials who argue it violates the spirit of the 2013 Constitution.\n\nIronically, Chinomona herself was among the architects of the 2004 Tsholotsho Declaration, a failed attempt to alter ZANU PFs leadership structure in favour of Mnangagwa. The scheme, which angered then-President Robert Mugabe, saw Chinomona and several provincial chairpersons suspended  including current Speaker of Parliament Jacob Mudenda, who now serves as the partys secretary-general.\n\nAt the same event, Information Minister Jenfan Muswere and ICT Minister Tatenda Mavetera  both staunch Mnangagwa loyalists  used their addresses to pledge allegiance to the embattled President.\n\nWe have a training centre here at Chiwetu; its going to train women and youths, said Muswere, carefully steering clear of the ongoing succession debate.\n\nMavetera, who also heads the Young Women for ED movement, was less cautious. We are also saying that our President should rule until 2030, she declared, echoing the sentiments of the Presidents inner circle.\n\nManicaland Provincial Affairs Minister Misheck Mugadza urged women to take part in empowerment projects and announced plans to build a rehabilitation centre in the province  an attempt to project unity and development amid the widening cracks.\n\nBut behind the public speeches and pledges of loyalty, the Mutare conference threatens to become a battleground for power within ZANU PF. As fears of open rebellion mount, Mnangagwa risks facing his most embarrassing show of defiance since taking power in the 2017 military-assisted transition that toppled Mugabe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PF’s upcoming annual conference in Mutare amid reports of deepening … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/ed-faces-humiliation/\">Continue reading<span class=\"screen-reader-text\"> \"ED Faces Humiliation\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "Opposition MP Dies In Motor Vehicle Accident",
            "url": "https://www.zimeye.net/2025/10/10/opposition-mp-dies-in-motor-vehicle-accident/",
            "content": "By Wezhira Munya | Change Radio10th October 2025\n\nIt is with deep sadness that we report the tragic death ofHonourable Desire Moyo, the Member of Parliament forNkulumane Constituency, who died in a car accident early this morning.\n\nThe fatal incident occurred just beforeShangani, when the vehicle carrying several opposition lawmakers Honourable Madalaboy Ndebele,Senator Rittah Ndlovu,Honourable Sethulo Ndebele,Honourable Libion Sibanda, andHonourable Desire Moyo collided with an elephant.\n\nSadly,Honourable Moyowas pronounced dead at the scene, while the other parliamentarians were rushed to hospital for urgent medical treatment.\n\nAuthorities are still investigating the accident, and more details will be shared as information becomes available.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Wezhira Munya | Change Radio10th October 2025 It is with deep sadness that we report the tragic death of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/opposition-mp-dies-in-motor-vehicle-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition MP Dies In Motor Vehicle Accident\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "Epworth Duo Jailed for Kidnapping Teen in Failed ‘Manjuzu’ Initiation Ritual",
            "url": "https://www.zimeye.net/2025/10/10/epworth-duo-jailed-for-kidnapping-teen-in-failed-manjuzu-initiation-ritual/",
            "content": "By A Correspondent\n\nTwo Epworth residents have been sentenced to nine months in prison for kidnapping a 15-year-old girl in a bizarre attempt to initiate her into a manjuzu spiritual cult.\n\nThe convicts, Fortunate Anesu Nyandoro (30) and Tadiwanashe Benjamin (25), both from the Green Valley area in Epworth, were found guilty after a full trial at the Epworth Magistrates Court on October 7, 2025.\n\nAccording to court proceedings, the minor  who had been living with her aunt  went to the duos home on September 25, 2025, claiming she had fled her aunts house because she was being forced to drink some herbs.\n\nInstead of informing her guardians or the authorities, Nyandoro and Benjamin kept the girl at their home, where they allegedly attempted to initiate her into the manjuzu cult.\n\nWhen the girls relatives began searching for her, the pair denied knowing her whereabouts. However, a police tip-off on October 3, 2025, led investigators to their house, where the teenager was found drugged and disoriented.\n\nThe court described the pairs actions as reckless and exploitative, emphasizing that they had endangered the welfare of a minor. Both Nyandoro and Benjamin were each sentenced to nine months imprisonment for the offence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two Epworth residents have been sentenced to nine months in prison for kidnapping a 15-year-old girl in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/epworth-duo-jailed-for-kidnapping-teen-in-failed-manjuzu-initiation-ritual/\">Continue reading<span class=\"screen-reader-text\"> \"Epworth Duo Jailed for Kidnapping Teen in Failed ‘Manjuzu’ Initiation Ritual\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "Mandatory Drug Testing In Schools",
            "url": "https://www.zimeye.net/2025/10/10/mandatory-drug-testing-in-schools/",
            "content": "Mutare, Zimbabwe  In a dramatic escalation of the national war against drugs, the Government of Zimbabwe is considering sweeping legal amendments to introduce mandatory drug testing across schools, workplaces, and communities  a move that could see testing centres established in nearly every educational institution and public facility in the country.\n\nDefence Minister Oppah Muchinguri-Kashiri, who also chairs the National Committee on Drug and Substance Abuse, revealed the proposal during the National Prayer Day held at Mutare Showgrounds last Friday.\n\nShe said the government is now exploring a Covid-19-style testing and inspection system, empowering authorities to conduct routine drug tests on learners, employees, and citizens suspected of drug abuse.\n\nThe testing kits will soon be available on the market, enabling parents to test their children at home and take swift action, said Minister Muchinguri-Kashiri. Government will ensure that every clinic offers testing and counselling services. Some hospitals will provide day-care treatment as we cannot turn all of them into rehabilitation centres.\n\nThe envisioned rollout could mirror the Covid-era infrastructure  complete with mobile and school-based testing units, counselling desks, and digital tracking of offenders.\n\nIf implemented, the plan would mark one of the boldest anti-drug policies in Southern Africa, pivoting from traditional policing to a health-and-rehabilitation model grounded in community participation.\n\nImagining the Reality: Drug-Testing Centres in Every School\n\nUnder the proposed framework, secondary schools and universities could soon have drug-testing desks or mobile stations where learners periodically undergo screening through saliva, blood, or hair samples.\n\nTrained nurses or school health coordinators would handle the process  similar to the Covid testing model  while random spot checks could become a norm during term openings and examinations.\n\nAt workplaces, human resources departments might be legally obligated to submit routine reports confirming employee testing compliance, while testing booths at public events could become part of national anti-drug campaigns.\n\nPublic health analysts say such a system, though controversial, could revolutionise early detection and intervention  but also raises questions on privacy, consent, and stigmatization of youth.\n\nSpecial Drug Courts and Harsher Penalties\n\nMinister Muchinguri-Kashiri also revealed that specialised courts dedicated to drug and substance abuse cases are being established, with stiffer penalties  including up to 15 years imprisonment for traffickers.\n\nThe courts will fast-track prosecutions and ensure consistency in sentencing, amid growing frustration over light penalties for foreign offenders caught smuggling drugs into Zimbabwe.\n\nThis is a war we are fighting, she said. Recently, we had foreigners fined just US$150 for drug offences, while Zimbabweans are on death row abroad for similar crimes. That imbalance must end.\n\nManicaland Under Spotlight\n\nManicaland Province has been singled out as a hotspot for drug smuggling, with porous borders turning it into both a transit and destination zone for cocaine, heroin, ecstasy, cannabis, crystal meth (mutoriro), and codeine-based cough syrups.\n\nAuthorities say the problem now extends into schools, where some students are being used as runners in local drug distribution networks.\n\nThe Root Causes\n\nThe Minister cited unemployment, poverty, peer pressure, and family drug habits as the leading triggers of addiction among youth. The Covid-19 pandemic further worsened mental health pressures, pushing many young people into substance use as a coping mechanism.\n\nExperts say the cost of drugs ranges from US$1 for entry-level substances such as cough syrups and marijuana to US$80 for high-intensity narcotics like cocaine and crystal meth.\n\nGovernments Long-Term Plan\n\nThe governments broader anti-drug framework includes:\n\nA Prayer for Peace and Recovery\n\nFridays Mutare event, attended by Vapostori, MaZion, Pastors 4ED, and the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), doubled as a national call to prayer  for peace, unity, and deliverance from the scourge of drug abuse tearing through communities.\n\nIf enacted, Zimbabwe could soon become one of the few countries in the region with nationwide drug testing infrastructure  from classroom desks to factory gates  signalling a new chapter in the countrys fight against addiction and social decay.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "Men Who Killed JailGard Sentenced To 90 Years In Prison",
            "url": "https://www.zimeye.net/2025/10/10/men-who-killed-jailgard-sentenced-to-90-years-in-prison/",
            "content": "Mutare  Tuesday, October 7, 2025  In a chilling conclusion to a case that shocked the nation, Mutare High Court Judge, Justice Isaac Muzenda, has sentenced two men to 45 years in prison each for the brutal murder of Zimbabwe Prisons and Correctional Services officer, Tapiwa Mutyasira (29), whose body was dumped on the MutareHarare railway line and subsequently crushed by a goods train.\n\nThe crime, which occurred on March 4, 2023, left the Mutare community horrified after Mutyasiras mutilated remains were discovered scattered along the tracks near Chikanga.\n\nThree suspects  Innocent Itai Chikwengo (38), Brighton Gowero (29), and Takunda Makoni (21)  were arrested in connection with the murder. After a lengthy trial, Justice Muzenda convicted Gowero and Makoni, citing overwhelming evidence that they were directly involved in the fatal assault. Their co-accused, Chikwengo, was acquitted due to lack of evidence linking him to the crime.\n\nDelivering the sentence, Justice Muzenda ruled that the State, led by Prosecutor Mr. Malvern Musarurwa, had proven its case beyond reasonable doubt. He emphasized that the two convicts were fortunate to escape a life sentence, given the callous and premeditated nature of the attack.\n\nThe court cannot ignore the cruelty inflicted on the deceased and the pain caused to his young family, Justice Muzenda said in his remarks. The sentence must reflect societys condemnation of such acts.\n\n Gruesome Details of the Crime\n\nThe court heard that between March 3 and 4, 2023, the three accused, together with another suspect still at large, ambushed and attacked Mutyasira at the 13.5km peg along the MutareHarare railway line. They used an unknown blunt object to assault him, stole his two cellphones, and dumped his lifeless body on the tracks  where it was later dismembered by a passing train.\n\nA post-mortem conducted by Dr. Mellan Chibwowa at Victoria Chitepo Provincial Hospital confirmed that Mutyasira died from polytrauma, consistent with severe blunt force injuries.\n\nThe assailants were charged under Section 47(1) of the Criminal Law (Codification and Reform) Act [Chapter 9:23], which criminalises the unlawful and intentional killing of another person.\n\n Family Finds Closure\n\nMutyasira, described by colleagues as disciplined and hardworking, was survived by his wife and two children. His father, Mr. Tirivanhu Mutyasira, who serves as the Mutare District Area Prosecutor, welcomed the ruling, saying it ends a painful chapter for the grieving family.\n\nWe have been following the trial closely, he said. Two of them were convicted and sentenced to 45 years each, while one was acquitted. At least justice has been served. There was a lot of confusion, with some even suggesting Tapiwa might have taken his own life. This conviction has set the record straight and finally brings closure to our family.\n\nThe sentencing marks a definitive close to one of Manicalands most disturbing murder cases  a reminder of the countrys ongoing struggle against violent crime and the resilience of families seeking justice for their loved ones.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Mutare – Tuesday, October 7, 2025 — In a chilling conclusion to a case that shocked the nation, Mutare High … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/men-who-killed-jailgard-sentenced-to-90-years-in-prison/\">Continue reading<span class=\"screen-reader-text\"> \"Men Who Killed JailGard Sentenced To 90 Years In Prison\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "Marry Mubaiwa Exposes People Circulating Fake Child Pics Exonerating VP Chiwenga",
            "url": "https://www.zimeye.net/2025/10/10/marry-mubaiwa-exposes-people-circulating-fake-child-pics-exonerating-vp-chiwenga/",
            "content": "By Marry Mubaiwa | In a world where everyone is quick to voice their opinions, it can be disheartening to witness how often those opinions are based on mere speculation or ignorance.\n\nMany people take it upon themselves to discuss topics they know little about, weaving narratives that can drastically distort reality and impact lives. Everyone is entitled to their thoughts, but the truth is often multifaceted, resting in the eyes of the beholder, and often buried beneath layers of misconception and bias.\n\nTake, for example, my own situation: a photograph shared online by a lady who is not my daughter, but rather the wife of my cousin, sparked a flurry of speculation and judgment. The assumptions surrounding me have multiplied, reinforced by misunderstandings that ignore the truth of my life.\n\n.\n\nWhat some may not realize is that I have faced false allegations and endured imprisonment for crimes I did not commit, while the one who caused my suffering remains hidden, unpunished, and unrepentant.\n\nI have been separated from my children for six years, a punishment of isolation inflicted by my ex-husband, Constantino Chiwenga. His influence holds the power to dictate the narrative, yet I stand firm in my conviction that God knows the truth and will ensure it is eventually revealed. I have witnessed how falsehoods can destroy reputations and overshadow the good that one has done. Despite the pain and mockery Ive faced, I maintain hope that justice will prevail.\n\nThe silence of those who know the truth, driven by fear or complicity, only adds to the weight of my burden. Power may shield one from immediate consequences, but the truth is relentless. It has a way of surfacing, no matter how deep it is buried. Those who have supported the conspiracy against me may find themselves in the crosshairs of their own deception when the light finally shines on their darkness.\n\nAs a military commander, Constantino should have conducted his due diligence; he should have sought the truth rather than accepted hearsay. He has not only tarnished my name but also brought shame upon our family. I was not the villain in this story, yet I became the scapegoat for his own misdeeds. The allegations that have been thrown against me, like accusations that I was sent to harm him, are absurd. The truth remains: not every Zimbabwean, nor the world, can be fooled by their fabrications.\n\nIn this sea of confusion and betrayal, I have held onto my faith. God sees all; He hears all. The hypocrisy of those who cast judgment upon me, believing the lies spun against me, will not escape divine scrutiny. One day, my childrenTendai, Christian, and Michaelwill learn the true nature of their father, the choices he made, and the hardship he caused their mother.\n\nAs the facade of righteousness crumbles, the question remains: will Constantino ever own up to his mistakes? Or will he continue to wear the mask of a victim while playing the perpetrator? It is astounding how love can morph into betrayal, rendering the person you trust capable of both saving and harming you. The power to manipulate perception can be intoxicating, but it cannot erase the truth.\n\nI may have endured physical suffering and emotional anguish, yet my spirit remains unbroken. I am still here, testifying to the strength of resilience and faith despite the efforts to silence me. The world is indeed watching, and as I prepare to unveil the truth, I ask for Gods guidance to help shed light on the darkness that has engulfed my life.\n\nThe time for silence is over. The hidden whispers of injustice must be brought to the forefront, and I will use my voice to ensure my children know the truth of their heritage and the reality of their fathers actions. This saga of betrayal will not be buried any longer; it must see the light of day. Justice may be delayed, but it will ultimately unveil itself, and those who orchestrated my suffering will have to face the consequences of their actions.\n\nIn the end, the truth prevails, and I will stand firm as I confront my past and the shadows that have haunted me. I am not alone; I have there\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Marry Mubaiwa | In a world where everyone is quick to voice their opinions, it can be disheartening to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/marry-mubaiwa-exposes-people-circulating-fake-child-pics-exonerating-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Marry Mubaiwa Exposes People Circulating Fake Child Pics Exonerating VP Chiwenga\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        },
        {
            "title": "Mnangagwa’s Kenya Trip Draws Criticism Amid Mounting Economic Hardships At Home",
            "url": "https://www.zimeye.net/2025/10/10/mnangagwas-kenya-trip-draws-criticism-amid-mounting-economic-hardships-at-home/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas visit to Nairobi, Kenya, for the 24th Common Market for Eastern and Southern Africa (COMESA) Summit has drawn sharp criticism from citizens who accuse the government of wasting resources while Zimbabwes economy continues to crumble.\n\nMnangagwa arrived in Nairobi on Wednesday for the Heads of State and Government Summit, which is being held under the theme Leveraging Digitalisation to Deepen Regional Value Chains for Sustainable and Inclusive Growth.\n\nIn a statement issued on Wednesday, the government said: His Excellency President Emmerson Mnangagwa @edmnangagwa has left for Nairobi, Kenya, to attend the 24th Common Market for Eastern and Southern Africa Heads of State and Government Summit (COMESA). The Summit, which convenes under the theme, Leveraging Digitalisation to Deepen Regional Value Chains for Sustainable and Inclusive Growth, is expected to chart the blocs course towards a more connected and digitally driven continental economy.\n\nThe statement added: Hon. General (Rtd) Dr. C.G.D.N. Chiwenga is the Acting President during His Excellency President @edmnangagwas working trip to Kenya.\n\nHowever, many Zimbabweans have condemned the trip, arguing that it serves little purpose when the nation faces severe economic and social challenges.\n\nThis is another expensive trip that adds no value to ordinary people, said a Harare resident. We are struggling with food shortages, poor service delivery, and unemployment, yet the President keeps globe-trotting.\n\nOthers questioned the relevance of the summit to Zimbabwes current situation. The government talks about digitalisation while schools have no computers and hospitals cant even afford electricity, said another citizen from Bulawayo. Its pure hypocrisy.\n\nPolitical analysts have also weighed in, saying the trip reflects misplaced priorities. The governments justification sounds hollow, said political commentator Tendai Moyo. What Zimbabwe needs right now is leadership focused on domestic recovery, not public relations exercises abroad.\n\nCritics argue that Mnangagwas repeated foreign visits are draining public funds at a time when the cost of living continues to skyrocket. Inflation, poor service delivery, and corruption have worsened, leaving many citizens disillusioned.\n\nThe timing of this trip is terrible, Moyo added. People are suffering, but the leadership seems more interested in international photo opportunities than in solving real problems at home.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s visit to Nairobi, Kenya, for the 24th Common Market for Eastern and Southern Africa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/mnangagwas-kenya-trip-draws-criticism-amid-mounting-economic-hardships-at-home/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Kenya Trip Draws Criticism Amid Mounting Economic Hardships At Home\"</span></a></p>",
            "time": "09:27",
            "date": "11 Oct 2025"
        }
    ]
}