{
    "news": [
        {
            "title": "🔴 UK: Zimbabwean Teen Lawyer Hopeful Found Dead in Manchester’s River Irwell",
            "url": "https://www.zimeye.net/2025/07/18/%f0%9f%94%b4-uk-zimbabwean-teen-lawyer-hopeful-found-dead-in-manchesters-river-irwell/",
            "content": "Family speaks out as police confirm recovery of body near Lowry Hotel following midnight search\n\nManchester, UK  18 July 2025\n\nBy UK Correspondent | ZimEye | A high-achieving Zimbabwean teenage girl, celebrated for earning four scholarships on her path to becoming a barrister, has been found dead in Manchesters River Irwell. Her body was recovered by specialist divers following a dramatic overnight search operation that began near the Lowry Hotel, where she was last seen.\n\nGreater Manchester Police (GMP) confirmed the tragic discovery on Thursday morning, shortly before midday, after receiving reports just after midnight that a person had entered the water close to Salfords border with Manchester.\n\nEmergency responders, including underwater search and marine units, launched a rescue mission around Blackfriars Road. A police cordon was quickly erected as divers combed the river, and a search boat was seen scouring the waters in the early hours. The girls identity has not been publicly released by authorities, but ZimEye has confirmed through family that she was a Zimbabwean national with exceptional academic credentials.\n\nSpeaking exclusively to ZimEye, her heartbroken mother shared the distressing days leading up to her daughters death.\n\nShe had just come back from Portugal and was not herself. She looked confused. At hospital, she told the nurses privately that her friends had given her cannabis.\n\nDespite being discharged, her mental state reportedly worsened. Her mother said she began to speak in the third person  saying, I saw my daughter has fled,  before wandering alone between restaurants and shops. The familys appeals for police intervention were initially unsuccessful.\n\nAt first they refused to search for her, said the mother. Then they called me and said they wanted to speak to me. Thats when they told me my daughter had been found dead.\n\nAccording to the Manchester Evening News, the police response was prompted by calls on Wednesday night about a person seen entering the River Irwell. The intense search operation that followed lasted into Thursday morning.\n\nIn a formal statement, GMP said:\n\nEmergency services are currently responding to a concern for welfare in water in the River Irwell, near Blackfriars Road. It is believed a person entered the water and emergency services are working to establish the full circumstances surrounding this incident. A scene remains in place whilst detectives are investigating.\n\nTributes have since begun pouring in from Zimbabwean and British communities alike, hailing the teenager as a brilliant mind and a young leader in the making. She had been accepted into several competitive law programmes and was being mentored for a future at the Bar.\n\nAn inquest into the cause of death is expected to be opened in the coming days.\n\nZimEye will continue to follow developments in this tragic case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Family speaks out as police confirm recovery of body near Lowry Hotel following midnight search Manchester, UK – 18 July … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/%f0%9f%94%b4-uk-zimbabwean-teen-lawyer-hopeful-found-dead-in-manchesters-river-irwell/\">Continue reading<span class=\"screen-reader-text\"> \"🔴 UK: Zimbabwean Teen Lawyer Hopeful Found Dead in Manchester’s River Irwell\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "Struggling Econet Recovers Amid Rising Starlink Threat",
            "url": "https://www.zimeye.net/2025/07/18/struggling-econet-recovers-amid-rising-starlink-threat/",
            "content": "By Business Reporter-Econet Wireless Zimbabwe, long the dominant player in the countrys telecommunications sector, has reported a surprising 44% year-on-year increase in voice call volumes for the quarter ending 31 May 2025, challenging widespread assumptions about the declining relevance of traditional voice services in the digital age.\n\nThe increase in voice traffic was accompanied by more than a twofold rise in data usage, according to the companys latest quarterly trading update released this week. The figures suggest that despite the shift towards internet-based communication, basic connectivity services remain critical in Zimbabwes telecoms landscape.\n\nWhile the growth in voice call volumes may appear encouraging on the surface, it comes at a time when Econet is facing intensifying pressure on multiple frontschief among them, deteriorating service quality and fierce competition from new market entrants such as Starlink.\n\nIn recent years, Econet has struggled with widespread customer complaints over poor network coverage, frequent call dropouts, slow internet speeds, and erratic billing systems. The company has often cited power shortages, foreign currency constraints, and high operating costs as key factors hindering its ability to provide consistent and reliable service.\n\nUrban and rural subscribers alike have taken to social media and consumer watchdog platforms to air their frustrations, particularly over delayed responses to technical faults, long queues at customer care centres, and degraded network performance during peak hours. As the economy digitises, Econets infrastructure has often buckled under the weight of growing demand.\n\nEconets challenges are further compounded by the entrance of Elon Musks Starlink, the satellite internet service that officially launched in Zimbabwe earlier this year. Starlink has quickly gained ground, especially in rural and remote areas where Econet and other traditional mobile network operators have historically struggled to provide reliable coverage.\n\nOffering high-speed internet with nationwide reach, minimal latency, and no dependence on terrestrial infrastructure, Starlink is emerging as a game-changer. Its competitive pricing and ease of installation have attracted users from various sectorshouseholds, small businesses, schools, and NGOswho are increasingly opting out of Econets unreliable services.\n\nAnalysts have warned that unless Econet significantly upgrades its infrastructure and improves customer satisfaction, it risks losing its market share to newer, more agile competitors that are capitalising on its weaknesses.\n\nIn response, Econet has taken steps to improve digital inclusion and stimulate growth in its user base. The company announced a major revamp of itsKancane Kancanesmartphone financing scheme, removing upfront deposit requirements and extending repayment terms up to 24 months. This move aims to address affordability challenges and boost smartphone penetration, which stood at just 55% according to 2024 data from the Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ).\n\nWere giving customers the chance to step into the digital world without high upfront costs, Econet said, framing the programme as a cornerstone of its national digital inclusion agenda.\n\nThe company also reported continued investment in network infrastructure, including the deployment of 10 cost-effective rural base stations, the commissioning of 20 new network sites, and the expansion of its 5G coverage to an additional 100 locations countrywide.\n\nDespite its strategic efforts, Econets long-term survival may depend on more than just incremental improvements. With satellite internet rapidly altering Zimbabwes connectivity terrain, the telecom giant must confront its legacy inefficiencies and innovate beyond traditional models if it hopes to stay relevant in an increasingly competitive and digitally driven market.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter-Econet Wireless Zimbabwe, long the dominant player in the country’s telecommunications sector, has reported a surprising 44% year-on-year … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/struggling-econet-recovers-amid-rising-starlink-threat/\">Continue reading<span class=\"screen-reader-text\"> \"Struggling Econet Recovers Amid Rising Starlink Threat\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "Govt Says $280 Teachers’ Salary Is Enough",
            "url": "https://www.zimeye.net/2025/07/18/govt-says-280-teachers-salary-is-enough/",
            "content": "By A Correspondent| Justice Minister Ziyambi Ziyambi has sparked outrage among educators after suggesting that the US$280 monthly salary earned by teachers and other civil servants is sufficientclaiming the economy is stable and prices have not risen enough to justify a salary review.\n\nResponding to questions in Parliament this week, Ziyambi dismissed the need for a cost-of-living adjustment (COLA), saying there has been no significant price increase in the country and that the new Zimbabwe Gold (ZiG) currency is holding firm.\n\nPerhaps, let me preface by saying that there has not been a general increase in prices in this country. Statistics that we have on inflation do not indicate that, said Ziyambi.\n\nEven our currency is very stable, and the prices have largely not risen to levels that we can say indicate that we need a cost-of-living adjustment, he added.\n\nHis comments have been widely interpreted as a mockery of struggling teachers and civil servants, many of whom are barely surviving on paltry wages that have not kept up with the real cost of living.\n\nLabour unions and public sector workers, including teachers and nurses, have repeatedly called on the government to urgently revise salaries, citing soaring prices of food, transport, rent, and other basic essentials.\n\nWe are being told that $280 is enough because inflation statistics say sobut we live in reality, not in government spreadsheets, said one angry teacher in Harare.\n\nZiyambi noted that salary talks are continuing under the Tripartite Negotiation Forum (TNF), which brings together government, business, and labourbut unions say they are tired of endless talks with no meaningful action.\n\nThe ministers comments have further deepened the rift between civil servants and the state, with some educators threatening industrial action if the government continues to downplay their grievances.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Justice Minister Ziyambi Ziyambi has sparked outrage among educators after suggesting that the US$280 monthly salary earned … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/govt-says-280-teachers-salary-is-enough/\">Continue reading<span class=\"screen-reader-text\"> \"Govt Says $280 Teachers’ Salary Is Enough\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "Third Suspect Nabbed in US$4 Million Bulawayo Ecobank Heist",
            "url": "https://www.zimeye.net/2025/07/18/third-suspect-nabbed-in-us4-million-bulawayo-ecobank-heist/",
            "content": "By A Correspondent| The net continues to tighten around the masterminds behind the US$4 million Bulawayo Ecobank armed robbery, with the Zimbabwe Republic Police (ZRP) confirming the arrest of a third suspect in Botswana.\n\nThe latest suspect,Bhekanai Milio (39), was arrested on14 July 2025while attempting to enter Botswana from South Africa. His arrest follows that ofAbraham Temayi VumbunuandElijah Temayi Vumbunu, who were apprehended in South Africa earlier this month in connection with the October 3, 2024 robbery that rocked Zimbabwes second-largest city.\n\nZRP spokesperson CommissionerPaul Nyathi, in a statement issued today, said Milios arrest marks a significant breakthrough in the cross-border investigation. Efforts are now underway to have him extradited to Zimbabwe where he is expected to face charges relating to the violent heist.\n\nThe due processes of the law are now taking effect for the suspects extradition to Zimbabwe, read the statement.\n\nPolice confirmed that more suspects are being pursued and investigations are ongoing.\n\nThe robbery, which took place at Ecobanks Bulawayo branch, involved the theft of a staggeringUS$4 millionand has since sparked an international manhunt across southern Africa.\n\nThe Zimbabwe Republic Police is still pursuing the arrest of the other suspects who are linked to this case, added Commissioner Nyathi, promising that more details would be released in due course.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The net continues to tighten around the masterminds behind the US$4 million Bulawayo Ecobank armed robbery, with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/third-suspect-nabbed-in-us4-million-bulawayo-ecobank-heist/\">Continue reading<span class=\"screen-reader-text\"> \"Third Suspect Nabbed in US$4 Million Bulawayo Ecobank Heist\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "Wounded Gen Rugeje Resurfaces",
            "url": "https://www.zimeye.net/2025/07/18/wounded-rugeje-resurfaces/",
            "content": "By A Correspondent-President Emmerson Mnangagwa has deployed Retired Lieutenant General Dr Engelbert Rugeje to China on a high-level agricultural investment missionbarely months after unceremoniously firing him from key ministerial boards, in a move widely interpreted as part of a broader purge targeting Vice President Constantino Chiwengas military allies.\n\nRugeje, once a prominent figure in the military-engineered 2017 coup that ousted the late Robert Mugabe and installed Mnangagwa, is leading a Zimbabwean delegation currently engaging the Jiangsu Academy of Agricultural Sciences (JAAS) in Nanjing. The Chinese expressed interest in collaborative projects with Zimbabwean universities and agricultural institutions, and a memorandum of mutual cooperation was reportedly reached.\n\nThe visit, while seemingly routine, comes under the shadow of deepening internal tensions in ZANU-PF.\n\nRecently Rugeje was among five senior retired military officers summarily removed from the boards of the Tobacco Industry and Marketing Board (TIMB) and the Agricultural Marketing Authority.\n\nSources familiar with the developments said the purged generals were suspected of resisting Mnangagwas reported bid to extend his presidency beyond 2028.\n\nThe dismissals have fuelled speculation of an intensifying cold war between Mnangagwa and Chiwenga, with the latest moves seen as part of a wider strategy to weaken the vice presidents influence ahead of a potentially explosive ZANU-PF elective congress.\n\nBoth Rugeje and Chiwenga were central to the 2017 military operation that propelled Mnangagwa to power, but relations have since deteriorated amid fierce succession battles.\n\nA source toldZimEyethat the removals were meant to test Chiwengas capacity to respond or revolt, and signaled a new phase in the political chess game within the ruling elite. Rugeje declined to comment, referring questions to the Ministry of Agriculture, which had not responded at the time of publication.\n\nDespite his demotion, Rugeje was all diplomacy in China, projecting loyalty to Mnangagwa and reiterating Zimbabwes commitment to inclusive, agriculture-led economic growth. He praised the presidents Vision 2030 agenda, which targets a US$13.75 billion agricultural economy by 2025up from an initial US$8.2 billion goal. He also outlined strategic plans under the Agriculture and Food Systems Transformation Strategy to triple agricultural output by 2030.\n\nWe see immense potential in sectors such as maize, wheat, cotton, livestock, poultry, and horticulture. These areas are ripe for investment and growth, Rugeje told Chinese officials.\n\nHis delegation extended an invitation to JAAS for joint research, student exchanges, and curriculum development to help modernise Zimbabwes agriculture sector through smart technologies and innovation.\n\nBut analysts say Rugejes reassignment to a largely technical diplomatic mission, stripped of his former policymaking influence, signals a deliberate sideliningpart of Mnangagwas broader strategy to dismantle the remaining networks loyal to Chiwenga within the state, military, and party structures.\n\nSince the 2023 elections, which Mnangagwa controversially won amid widespread allegations of rigging, political tensions within ZANU-PF have been rising. Chiwengas silence has only heightened intrigue around his political future, as key allies are gradually being removed from influential roles.\n\nWhat remains to be seen is whether Mnangagwas tactical purges will neutralise internal resistanceor provoke the same kind of backlash that once toppled Robert Mugabe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa has deployed Retired Lieutenant General Dr Engelbert Rugeje to China on a high-level agricultural investment … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/wounded-rugeje-resurfaces/\">Continue reading<span class=\"screen-reader-text\"> \"Wounded Gen Rugeje Resurfaces\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "Tragedy on the Tracks: Man Fatally Hit by Train in Chinhoyi",
            "url": "https://www.zimeye.net/2025/07/18/tragedy-on-the-tracks-man-fatally-hit-by-train-in-chinhoyi/",
            "content": "By A Correspondent\n\nCHINHOYI  A tragic accident unfolded this evening after a yet-to-be-identified man was struck and killed by a train in Chinhoyi.\n\nThe man died instantly at the scene, with authorities swiftly cordoning off the area.\n\nDetails surrounding the circumstances of the incident remain unclear, and investigations are currently underway.\n\nPolice are urging members of the public with any information that could assist in identifying the deceased to come forward.\n\nMore updates to follow as the story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent CHINHOYI – A tragic accident unfolded this evening after a yet-to-be-identified man was struck and killed by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/tragedy-on-the-tracks-man-fatally-hit-by-train-in-chinhoyi/\">Continue reading<span class=\"screen-reader-text\"> \"Tragedy on the Tracks: Man Fatally Hit by Train in Chinhoyi\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "Nick Mangwana Exposes Mnangagwa Has Never At Any Time Faced A Death Sentence",
            "url": "https://www.zimeye.net/2025/07/18/nick-mangwana-exposes-mnangagwa-has-never-at-any-faced-a-death-sentence/",
            "content": "BREAKING INVESTIGATIVE REPORT\n\nBy Dorrothy Moyo | 18 July 2025\n\nIn a remarkable twist that could reshape Zimbabwes historical narrative, the countrys government spokesperson Nick Mangwana has  perhaps unwittingly  shattered a long-standing myth surrounding President Emmerson Mnangagwas liberation war legacy.\n\nIn a tweet published Friday, Mangwana stated that President Mnangagwa was jailed at Khami Maximum Prison for 15 years beginning on 13 September 1966, and later transferred to Harare Remand Prison in January 1972 for deportation. The prison admission record does not mention any death sentence  contrary to Mnangagwas own decades-old claim that he narrowly escaped the gallows\n\nRecords at the Prison also show that His Excellency President @edmnangagwa was once jailed at Khami Maximum Prison for 15 years, Mangwana wrote. The admissions register show that the President was admitted into the D-Class at the jail on 13 September 1966 and was transferred to Harare Remand Prison on 6 January 1972 for deportation.\n\nThe tweet, accompanied by photographs of Mnangagwas prison visit, set off a firestorm of discussion online, including a sharp reaction from whistleblower and former prison officer Shepherd Yuda:\n\nI told people that ED was never sentenced to death. Records now indicate otherwise, Yuda commented.\n\nMyth Busted: Eddie Cross Confirms No Death Sentence\n\nThis public contradiction comes just a few years after Mnangagwas authorised biographer, economist Eddie Cross, revealed in his 2021 book that the president was not sentenced to death in 1965  and, crucially, that his crime was not even serious enough to warrant such punishment.\n\nCross drew directly from High Court records which stated:\n\nThis is not such a case, although it is a serious crime according to law. I do not therefore propose to sentence you to death in this case.\n\nOxford historian Dr. Miles Tendi amplified the revelation, stating Mnangagwas claim in a 2015 Sunday Mail article  that he was sentenced to death but spared because of his age  was false. According to the court transcript, the judge exercised discretion, concluding the bombing incident Mnangagwa was accused of was not severe enough for capital punishment.\n\nOnline Reaction: Deportation Sparks Citizenship Questions\n\nFacebook users also latched onto the surprising phrase in Mangwanas tweet  that Mnangagwa was transferred for deportation. This raised further questions about the presidents nationality.\n\nDeportation Is he not a Zimbabwean? asked Enias Vushe.\n\nDeported to where? Dont tell me the deportation failed! wrote another user, as others suggested Zambia  where Mnangagwa was reportedly born  was the intended destination.\n\nIn response, Yuda added an explosive allegation:\n\nIt was a prisoners exchange deal brokered by CIO to allow a decoy in ZPF.\n\nThis statement hints at the possibility of political subterfuge  suggesting that Mnangagwas release or transfer may have involved state intelligence manipulation, possibly to reframe his historical profile.\n\nConclusion: A False Legacy?\n\nThe revelations from Mangwanas tweet, Cross biography, and the historical High Court transcript together point to a consistent narrative: President Emmerson Mnangagwa was never sentenced to death. The long-standing story  that he was a heroic youth spared the noose only by age  appears to be a manufactured piece of liberation war lore.\n\nThis comes at a time when Zimbabweans are increasingly re-examining their history and leadership amid economic turmoil, political repression, and allegations of elite corruption.\n\nThe implications are profound: if Mnangagwas foundational liberation credentials are exaggerated, what else in Zimbabwes official liberation war mythology deserves scrutiny?\n\nZimEye will continue to follow this developing story.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "BREAKING INVESTIGATIVE REPORT By Dorrothy Moyo | 18 July 2025 In a remarkable twist that could reshape Zimbabwe’s historical narrative, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/nick-mangwana-exposes-mnangagwa-has-never-at-any-faced-a-death-sentence/\">Continue reading<span class=\"screen-reader-text\"> \"Nick Mangwana Exposes Mnangagwa Has Never At Any Time Faced A Death Sentence\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "MWOS FC Promotes Young Goalkeeper Takunda Manomano to First Team",
            "url": "https://www.zimeye.net/2025/07/18/mwos-fc-promotes-young-goalkeeper-takunda-manomano-to-first-team/",
            "content": "Sports Correspondent\n\nNORTON  Ambitious Premier Soccer League outfit MWOS FC has officially promoted promising shot-stopper Takunda Manomano from their Under-19 Development Squad to the senior team, marking a major milestone in the young goalkeepers career.\n\nThe club announced the move on Thursday, describing Manomanos rise as a testament to the success of their development program and a sign of their commitment to nurturing homegrown talent.\n\nTakunda has shown maturity, discipline, and consistency far beyond his years. Hes earned this promotion through hard work and resilience, said a club official.\n\nThe 19-year-old has been a standout performer in the youth setup and is now expected to compete for a place between the posts in the senior side as MWOS FC continues to build a competitive squad for the top-flight campaign.\n\nFans of the Norton-based side have welcomed the news, with many expressing excitement at seeing fresh talent being integrated into the first team.\n\nManomano becomes one of the few youth products to break into the senior ranks at MWOS FC, and his promotion signals a growing faith in the clubs grassroots structures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent NORTON – Ambitious Premier Soccer League outfit MWOS FC has officially promoted promising shot-stopper Takunda Manomano from their … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/mwos-fc-promotes-young-goalkeeper-takunda-manomano-to-first-team/\">Continue reading<span class=\"screen-reader-text\"> \"MWOS FC Promotes Young Goalkeeper Takunda Manomano to First Team\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "BREAKING: Judge Rules Mpofu Has Case To Answer",
            "url": "https://www.zimeye.net/2025/07/18/breaking-judge-rules-mpofu-has-case-to-answer/",
            "content": "A High Court judge has ruled saying Wicknell Chivayo business associate, Moses Mpofu has a case to answer. His application for discharge at the close of States case has been dismissed\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A High Court judge has ruled saying Wicknell Chivayo business associate, Moses Mpofu has a case to answer. His application … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/breaking-judge-rules-mpofu-has-case-to-answer/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: Judge Rules Mpofu Has Case To Answer\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        },
        {
            "title": "Brazil Celebrates Vinicius Jr Legacy with Statue Fit for a King",
            "url": "https://www.zimeye.net/2025/07/18/brazil-celebrates-vinicius-jr-legacy-with-statue-fit-for-a-king/",
            "content": "Sports Correspondent\n\nRIO DE JANEIRO  Brazils golden boy, Vinicius Jr, has been honoured with a life-sized statue unveiled at the iconic Sambdromo in Rio de Janeiro, in a tribute that cements his status as a national hero.\n\nThe striking sculpture captures the Real Madrid forward mid-celebration, symbolising not just his success on the pitch, but his cultural and social impact as one of Brazils most inspiring athletes.\n\nThe statue will remain on display for a few days in Rio before heading to its new home at Madame Tussauds museum in New York City.\n\nSupporters flocked to the unveiling, many hailing Vinicius as a symbol of resilience, pride, and the new face of Brazilian football.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent RIO DE JANEIRO – Brazil’s golden boy, Vinicius Jr, has been honoured with a life-sized statue unveiled at … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/18/brazil-celebrates-vinicius-jr-legacy-with-statue-fit-for-a-king/\">Continue reading<span class=\"screen-reader-text\"> \"Brazil Celebrates Vinicius Jr Legacy with Statue Fit for a King\"</span></a></p>",
            "time": "06:20",
            "date": "19 Jul 2025"
        }
    ]
}