{
    "news": [
        {
            "title": "Mnangagwa Hands Over Power",
            "url": "https://www.zimeye.net/2025/08/12/mnangagwa-hands-over-power-4/",
            "content": "By A Correspondent  Zimbabwe has handed over the Chairmanship of the Southern African Development Community (SADC) Council of Ministers to Madagascar, marking the end of its term at the helm of the regional policy-making body.\n\nThe Council is meeting from 1214 August 2025 in Antananarivo, Madagascar, to deliberate on programmes and policies aimed at deepening regional integration, strengthening peace and security, and driving economic growth.\n\nThe gathering sets the stage for the 45th SADC Summit of Heads of State and Government on 17 August, where final decisions will be endorsed. This years summit theme is:Advancing Industrialisation, Agricultural Transformation, and Energy Transition for a Resilient SADC.\n\nZimbabwes Minister of International Relations and Trade, Amon Murwira, formally passed the chairmanship to Madagascars Foreign Affairs Minister, Rafaravavitafika Rasata, during a ceremony on Tuesday.\n\nOver the three-day session, ministers are reviewing progress on the SADC Regional Indicative Strategic Development Plan (20202030), assessing institutional reports, and taking key decisions on industrialisation, infrastructure, food security, energy, and peace in the region.\n\nMurwira urged member states to accelerate the ratification and implementation of SADC protocols and agreements, warning that delays undermine the blocs shared vision.\n\nA key impediment to advancing our regional integration agenda is our slow uptake of SADC Protocols and Agreements. This delay is not just a procedural concern; it strikes at the very heart of our shared vision for a united, prosperous, and resilient region, he said.\n\nMurwira commended Rasatas appointment, pledged Zimbabwes full support, and encouraged other member states to rally behind Madagascars leadership.\n\nIn her acceptance remarks, Rasata thanked SADC members for their trust and pledged to prioritise the inclusion of island states in the regional agenda.\n\nSADC is an essential pillar of regional cooperation and solidarity, on which we can rely to jointly address our challenges and seize the opportunities before us, she said.By uniting the maritime, economic, environmental, and cultural potential of the islands with the resources, agricultural strength, and industrial capacity of our continental states, we can build the self-reliant and competitive SADC we aspire to.\n\nThe Councils resolutions will feed into the 45th SADC Summit, where regional leaders are expected to map out strategies for a stronger, more united, and prosperous Southern Africa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe has handed over the Chairmanship of the Southern African Development Community (SADC) Council of Ministers … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/mnangagwa-hands-over-power-4/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Hands Over Power\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "International Football Returns To Zim As National Sports Stadium Gets Partial CAF Approval",
            "url": "https://www.zimeye.net/2025/08/12/international-football-returns-to-zim-as-national-sports-stadium-gets-partial-caf-approval/",
            "content": "Sports Correspondent\n\nThe Confederation of African Football (CAF) has officially approved the National Sports Stadium in Harare, signaling a major step forward for the revival of international football in Zimbabwe.\n\nAfter more than four years without hosting an international fixture due to all local venues being condemned by CAF, the landmark approval brings hope for a renewed presence on the continental stage.\n\nThe National Sports Stadium has undergone extensive renovations, earning it special clearance to host Category 2 international matches. This approval permits the venue to stage preliminary round games in the CAF Champions League and CAF Confederation Cup, along with qualifiers for the U23, U20, and U17 Africa Cup of Nations (Afcon) tournaments.\n\nThis development means Simba Bhora can return to the stadium for their upcoming clash against Nsingizi Hotspurs in September. However, CAF has not yet given the green light for the senior mens and womens national teams to play at the venue.\n\nThe Warriors must continue to wait, as the stadiums renovations have yet to meet the stringent standards required for senior international fixtures. Consequently, Zimbabwes national team will play their forthcoming 2026 FIFA World Cup qualifier home matches at Orlando Stadium in Johannesburg.\n\nThe CAF approval marks a pivotal milestone, reigniting hopes that Zimbabwe will soon fully reclaim its place as a host of international football on home soil.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Confederation of African Football (CAF) has officially approved the National Sports Stadium in Harare, signaling a major … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/international-football-returns-to-zim-as-national-sports-stadium-gets-partial-caf-approval/\">Continue reading<span class=\"screen-reader-text\"> \"International Football Returns To Zim As National Sports Stadium Gets Partial CAF Approval\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Despite Deepening Economic Crisis, Mnangagwa Boasts of Rising Milk Production",
            "url": "https://www.zimeye.net/2025/08/12/despite-deepening-economic-crisis-mnangagwa-boasts-of-rising-milk-production/",
            "content": "By A Correspondent\n\nSpeaking at the Heroes Day main commemoration event at the National Heroes Acre in Harare on Monday, President Emmerson Mnangagwa highlighted what he described as significant milestones achieved by his administration despite the worsening economic turmoil facing the country.\n\nBelow is the full keynote address delivered by His Excellency, President Emmerson Dambudzo Mnangagwa on 11 August 2025:\n\nKEYNOTE ADDRESS BY HIS EXCELLENCY, PRESIDENT EMMERSON DAMBUDZO MNANGAGWA\n\nLadies and Gentlemen, Comrades and Friends,\n\nIt is my singular honour and privilege to address this 45th Commemoration of our National Heroes Day, an event our nation holds annually in tribute to the gallant sons and daughters of the soil, who paid the supreme sacrifice for the liberation of our country. Theirs was a selfless struggle for the freedom we enjoy today, that must forever remain engraved in our collective conscience.\n\nThis emboldens us to resolutely guard our sovereignty as well as fortify our resolve to build a prosperous economy encapsulated in our national Vision 2030. Today, we also honour the living heroes and heroines who continue to epitomize patriotism, loyalty, and commitment to the nation.\n\nThe historic feats of our heroes and heroines are an enduring legacy bequeathed to us, which should serve as an inspiration in our march to realise Vision 2030. To immortalise the selfless sacrifices made by our forebears in the struggle for independence, freedom, and democracy, the Second Republic is spearheading various projects across the country.\n\nSikombela, Hwahwa, Butcher Camp, Dzapasi, and Connemara are among the shrines built by government to preserve our rich liberation war heritage.\n\nDuring todays celebration, I will confer honours and awards to our living and departed heroes for their outstanding accomplishments. I shall also preside over the investiture of awards of the Highest Order, including the Royal Order of Munhumutapa, Silver Cross of Zimbabwe, and the Robert Mugabe Commendation Award for Service in Human Capital Development.\n\nIndependence medals for eligible veterans of the Liberation Struggle will also be conferred across our provinces.\n\nIn recognition of the sterling contribution to our national development and unity by members of the public sector, some civil servants will be honoured for their long service to the country.\n\nI call upon all of us to play our part to spur economic growth, employment, and wealth creation opportunities, alongside harmonious and clean communities. The duty to achieve a thriving, industrialised, and prosperous economy lies with all of us.\n\nNyika inovakwa, inotongwa, inonamatigwa nevene vayo / Ilizwe lakhiwa, libuswe, likhulelwe ngabanikazi balo.\n\nFellow Zimbabweans,\n\nThis 45th Heroes Anniversary allows us to once again take stock of the strides we are making to realise the goals for which many departed and living heroes and heroines waged the protracted struggle. Independence in 1980 brought political independence, but the struggle for economic independence continues.\n\nWe have much to be proud of as the people of this great motherland, Zimbabwe. We are masters of our own destiny, a proud independent, sovereign, and empowered African nation. Neo-colonialism will never be given a foothold in our country.\n\nThe multi-pronged reform programmes under the Second Republic have shown positive impacts on the economy and the quality of life for citizens. Despite challenges from illegal sanctions, fluctuating international mineral prices, and a volatile global trade environment, our economy is demonstrating resilience.\n\nThe national Gross Domestic Product has risen to US$45.7 billion, up from US$16 billion in 2018. Domestic demand growth is pleasing, and the projected 6% economic growth for 2025 remains achievable.\n\nThe national fiscus continues to improve its capacity to fund key areas such as agriculture, health, education, social protection, and infrastructure development.\n\nThe new land tenure system is set to revolutionise agriculture by enabling farmers to invest in increased production. Transformational impacts are expected regarding financing access, productivity, mechanisation, and infrastructure.\n\nZimbabwes successes in maize, wheat, traditional grains, record tobacco production, the recovery of the national herd, and increased milk production highlight the hard work and perseverance of our people.\n\nWe celebrate farmers and stakeholders in the agricultural sector who continue to be worthy custodians of the land paid for with the precious blood of our heroes and heroines. Our heroes would surely be proud of these strides.\n\nTinokutendai varimi, nemhuri yose yeZimbabwe, nekuchengetedza nhaka yedu yakarwirwa nemagamba edu, vatiri kuyeuka zuva ranhasi.\n\nDespite ongoing macroeconomic instability and challenges, agro-industries are showing signs of recovery.\n\nLocalisation of value chains and beneficiation efforts have led to growth in the manufacturing sector, now contributing 15% to GDP. The Zimbabwe Industrial Reconstruction and Growth Plan and the Local Content Strategy provide opportunities for value addition, job creation, and export growth.\n\nNew investments and expansions in manufacturingsuch as iron and steel, cement, and food processingbenefit from a stable business environment.\n\nMining remains vital to economic development, contributing over 13.3% of GDP and employing millions. Responsible mining, environmental compliance, and respect for cultural values remain priorities.\n\nEfforts to boost energy self-sufficiency are progressing with Independent Power Producers, especially in renewables. Industry-level solar power installations have improved generation capacity.\n\nModern transport infrastructure remains critical. Projects include upgrades and rehabilitation of national roads, airports, and border posts, such as the Harare-Masvingo-Beitbridge Highway and several key interchanges and bypasses.\n\nFellow Zimbabweans,\n\nOur heroes bequeathed a legacy of inclusive growth. Government continues to adopt modern approaches to implement high-impact, people-centered projects.\n\nDevolution and decentralisation ensure no one and no place is left behind, with additional resources allocated to local authorities.\n\nHealth delivery reforms target Non-Communicable Diseases and improved access to affordable care through better funding and equipped facilities.\n\nEducation and skills development anchor industrialisation. The Heritage-Based Curriculum develops talented youththe emerging heroes of tomorrow.\n\nLegislative reforms in education, including the Zimbabwe School Examinations Council Bill and the Teaching Profession Council Bill, are underway.\n\nVocational and entrepreneurial programmes expand beyond cities, fostering employment and rural industrialisation. Efforts to bridge rural-urban digital divides continue.\n\nFellow Citizens,\n\nClimate resilience and orderly human settlements remain fundamental. Government addresses dysfunctional settlements and issues title deeds to affected communities.\n\nTinotenda vose varikuvaka kumaruwa neku madhorobha, zvichisanganisira vana vekwedu variku Diaspora. Citizens, including those in the diaspora, contribute to a housing boom in rural and urban areas, transforming Zimbabwes built environment.\n\nGovernment will continue comprehensive rural development initiatives, scaling up projects such as borehole drilling, livestock pass-on schemes, solar energy, internet access, and village business units.\n\nYouth, women, and liberation war veterans have embraced these programmes.\n\nThe public sector is commended for patriotism, professionalism, and diligence, with a call to continue driving economic growth and quality social services.\n\nState-owned enterprises are urged to improve efficiency and profitability.\n\nLadies and Gentlemen,\n\nMy administration is preserving national historical and cultural heritage, with research on posthumously declared national heroes and updated biographies of early nationalists.\n\nZimbabwes liberation war was fought with international solidarity, which remains central to our foreign relations, guided by the United Nations Charter.\n\nZimbabwe has submitted a bid for a non-permanent seat on the UN Security Council for 20272028 and is a founding member of the International Organisation for Mediation.\n\nLater this week, Zimbabwe will hand over the chairmanship of SADC to Madagascar, following a successful term under the theme Promoting Innovation to Unlock Opportunities for Sustained Economic Growth and Development towards an Industrialised SADC.\n\nComrades and Friends,\n\nCulture, arts, and heritage are integral to a stable and growing economy. Culture centres are being built nationwide to support creative industries.\n\nYouth participation in socio-economic development is a priority, with sports facilities promoting healthy lifestyles and careers.\n\nTraditional institutions and financing initiatives support women entrepreneurs and SMEs.\n\nSustainable development principles guide resource use for current and future generations.\n\nZimbabwe hosted important environmental conferences to strengthen national environmental policies.\n\nAs climate change impacts worsen, the focus remains on resilience, mitigation, adaptation, and inclusive climate-smart development.\n\nFinally,\n\nAs we gather at National Heroes Acre and other sacred sites, let us look to the future with resolve. These commemorations rekindle the spirit of sacrifice embodied by our heroes and heroines.\n\nThe baton is now passed to usthe youth, women, and men across rural and urban Zimbabweto build a modern, industrialised nation.\n\nWe must not stop at middle-income status or Vision 2030; let us break ceilings and reach beyond horizons.\n\nAs todays heroes and heroines, let us pioneer innovations and reach new heights.\n\nThe revolutionary spirit that inspired our forebears should unite us, from Limpopo to Zambezi, Plumtree to Mutare, in pursuing unprecedented milestones.\n\nForward ever, backward never. Success and prosperity are certain.\n\nWith these remarks, I wish you all a happy 45th Heroes Day Anniversary Commemoration.\n\nEnd of Address\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Speaking at the Heroes Day main commemoration event at the National Heroes Acre in Harare on Monday, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/despite-deepening-economic-crisis-mnangagwa-boasts-of-rising-milk-production/\">Continue reading<span class=\"screen-reader-text\"> \"Despite Deepening Economic Crisis, Mnangagwa Boasts of Rising Milk Production\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Zanu PF Eyes Victory In Masvingo By-election Amid Growing Fears of Electoral Manipulation",
            "url": "https://www.zimeye.net/2025/08/12/zanu-pf-eyes-victory-in-masvingo-by-election-amid-growing-fears-of-electoral-manipulation/",
            "content": "By A Correspondent\n\nEmmerson Mnangagwas Zanu PF is determined to secure victory in the Masvingo Urban Ward 7 by-election, but observers warn the ruling party is banking heavily on voter apathy, vote buying, and patronage rather than genuine support.\n\nThe by-election, scheduled for September 13 following the passing of Councillor Tafara Masimba, has drawn criticism over the credibility of the electoral process amid widespread concerns of manipulation.\n\nCritics argue that Zanu PFs focus appears to be on exploiting public fatigue and using unfair tactics to maintain control.\n\nHowever, Zanu PF Masvingo provincial spokesperson Pepukai Chiwewe on Monday said:\n\nI am pleased to confirm that Cde Simbarashe Shonhiwa is our duly elected candidate to represent us in the upcoming Masvingo Urban Constituency Ward 7 by-elections.\n\nThe primary elections were conducted in a free, fair, and transparent manner, allowing eligible voters to exercise their right.\n\nNotably, all four participating candidates accepted the results, showcasing a commendable spirit of maturity and party discipline in our internal electoral process. Our united goal is to reclaim Ward 7 for ZANU PF, ably led by His Excellency President Emmerson D. Mnangagwa.\n\nWhile Chiwewe expressed confidence in the partys preparedness, critics remain unconvinced, pointing to a pattern of electoral malpractice. The ruling partys reliance on vote buying and patronage continues to cast doubt on the fairness of the upcoming by-election.\n\nAs the contest approaches, concerns linger over whether voters will be able to freely exercise their choice or if Zanu PFs controversial tactics will dominate once again.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Emmerson Mnangagwa’s Zanu PF is determined to secure victory in the Masvingo Urban Ward 7 by-election, but … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/zanu-pf-eyes-victory-in-masvingo-by-election-amid-growing-fears-of-electoral-manipulation/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Eyes Victory In Masvingo By-election Amid Growing Fears of Electoral Manipulation\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Picture: Sean Mnangagwa’s Watchful Eye On Parents Ignites Talk Of Power Consolidation…",
            "url": "https://www.zimeye.net/2025/08/12/picture-sean-mnangagwas-watchful-eye-on-parents-ignites-talk-of-power-consolidation/",
            "content": "Is this a sign of the Mnangagwa family consolidating power?\n\nPicture: Sean Mnangagwas Watchful Eye On  Parents Ignites Talk Of Power ConsolidationIs this a sign of the Mnangagwa family consolidating power?pic.twitter.com/YiJeUZOWwS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Is this a sign of the Mnangagwa family consolidating power?",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Chitungwiza Man In Trouble After Being Caught With Mutoriro",
            "url": "https://www.zimeye.net/2025/08/12/chitungwiza-man-in-trouble-after-being-caught-with-mutoriro/",
            "content": "By A Correspondent\n\nGilbert Matimura (35) was remanded in custody last week at the Chitungwiza Magistrates Court after being found in possession of 86 sachets of crystal methamphetamine.\n\nThe arrest occurred on 7 August 2025 at approximately 1:00 pm in Unit M, Chitungwiza, following a tip-off to police that Matimura was in possession of mutoriro.\n\nUpon arrival, detectives observed his movements before conducting a search of the premises.\n\nDuring the search, police discovered 86 sachets of crystal methamphetamine and two boxes of plastic wrappers hidden in Matimuras bedroom. The total weight of the drugs was 30 grams, with an estimated street value of USD 300.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Gilbert Matimura (35) was remanded in custody last week at the Chitungwiza Magistrates’ Court after being found … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/chitungwiza-man-in-trouble-after-being-caught-with-mutoriro/\">Continue reading<span class=\"screen-reader-text\"> \"Chitungwiza Man In Trouble After Being Caught With Mutoriro\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Opposition Leader Blasts Partisan Army on National Defence Forces Day",
            "url": "https://www.zimeye.net/2025/08/12/opposition-leader-blasts-partisan-army-on-national-defence-forces-day/",
            "content": "By A Correspondent\n\nOpposition activist Stephen Sarkozy Chuma has accused Zimbabwes military of betraying the people it is meant to protect, saying it has become a partisan force aligned with the ruling ZANU PF party.\n\nIn a statement marking Defence Forces Day, Chuma recalled the events of August 1, 2018, when soldiers opened fire on protesters in central Harare, killing several civilians.\n\nOn this Defence Forces Day, we are again reminded about how the military butchered unarmed defenseless citizens in the streets of Harare on 01 August 2018, Chuma said.\n\nHe condemned what he described as the militarisation of politics and the erosion of professionalism within the army.\n\nWe need a professional and non-partisan defence service and not one that operates like ZANU PF thugs, he added.\n\nChumas remarks come as the role of the military continues to draw scrutiny, with critics alleging that security forces are being used to stifle dissent and protect the political interests of the ruling elite rather than safeguard national security.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition activist Stephen Sarkozy Chuma has accused Zimbabwe’s military of betraying the people it is meant to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/opposition-leader-blasts-partisan-army-on-national-defence-forces-day/\">Continue reading<span class=\"screen-reader-text\"> \"Opposition Leader Blasts Partisan Army on National Defence Forces Day\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Mnangagwa Boasts Of Economic Gains, But Inflation and Poverty Continue Unabated…",
            "url": "https://www.zimeye.net/2025/08/12/mnangagwa-boasts-of-economic-gains-but-inflation-and-poverty-continue-unabated/",
            "content": "By A Correspondent\n\nDuring the 45th Heroes Day main commemoration event at the National Heroes Acre on Monday, President Emmerson Mnangagwa praised several economic milestones achieved under his leadership, including a GDP increase to US$45.7 billion and projected 6% growth for 2025.\n\nYet, despite these optimistic figures, many Zimbabweans continue to suffer from soaring inflation, persistent unemployment, and shortages of essential goods  problems the Presidents speech notably failed to address.\n\nMnangagwa hailed the remarkable resilience of the economy amid external sanctions and global trade challenges, highlighting successes in agriculture, manufacturing, and mining. Zimbabwes success stories in maize, wheat, and tobacco production, along with increased milk yields, are testament to the hard work and perseverance of our people, he said.\n\nHowever, the lived reality of many Zimbabweans tells a different story. Inflation remains stubbornly high, and the average citizen struggles with rising prices and stagnant incomes. Basic services and infrastructure are still patchy, particularly in rural areas where economic benefits have been slow to reach.\n\nWhile the President mentioned ongoing reforms and resource allocation to sectors like health and education, critics argue these efforts have yet to translate into meaningful improvements for the majority.\n\nThe speech skirted over the growing inequality and economic hardships fueling public discontent.\n\nMnangagwa called for unity and hard work to achieve Vision 2030s industrialisation goals, but many remain unconvinced. We must boldly decide now, that we will not stop at upper-middle-income status, he said. Yet without concrete plans to tackle inflation and create jobs, this ambitious target risks remaining out of reach.\n\nAs Zimbabweans marked Heroes Day reflecting on sacrifice and resilience, the economic struggles at home raise urgent questions about how inclusive and sustainable the governments progress truly is.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent During the 45th Heroes Day main commemoration event at the National Heroes Acre on Monday, President Emmerson … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/mnangagwa-boasts-of-economic-gains-but-inflation-and-poverty-continue-unabated/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Boasts Of Economic Gains, But Inflation and Poverty Continue Unabated…\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Mnangagwa Honours Jairos Jiri",
            "url": "https://www.zimeye.net/2025/08/12/mnangagwa-honours-jairos-jiri/",
            "content": "By A Correspondent President Emmerson Mnangagwa has posthumously declared four national heroes and presented national flags to their families during this years Heroes Day commemorations.\n\nThe four honoured were human rights and disability rights pioneer Jairos Jiri, Brigadier-General (Retired) Lameck Francisco Mutanda, John Mbedzi, and Elos David Malandu.\n\nJairos Jiri: A Legacy of ServiceThe late Jairos Jiri is remembered as one of Zimbabwes most selfless humanitarians. Born in 1921 in Bikita District, Masvingo Province, Jiri rose from humble beginnings to become a champion for the welfare of people with disabilities. In 1948, he founded the Jairos Jiri Association, an organisation that transformed the lives of thousands of physically challenged and disadvantaged people through vocational training, education, rehabilitation, and housing.\n\nJiris work extended far beyond charityhe was instrumental in promoting social inclusion at a time when disability was stigmatised and neglected in colonial Rhodesia. His initiatives, such as workshops, hostels, and training centres across the country, became safe havens for the marginalised. His dedication earned him both national and international recognition, cementing his place as a towering figure in Zimbabwes social development history.\n\nIn recent years, however, Jiris family has faced hardship. Earlier this year, his widow made a heartfelt public appeal for assistance, revealing that she was living in poverty despite her late husbands lifelong service to the nation. Her plight touched many Zimbabweans, sparking renewed calls for greater state and community support for the families of national heroes.\n\nHeroes Day CommemorationsHeroes Day remains one of Zimbabwes most significant national events, a time to honour both the living and departed who contributed to the liberation and development of the country.\n\nUpon arrival at the National Heroes Acre, President Mnangagwa inspected a guard of honour mounted by the Presidential Guard. He was joined by Vice President General (Retired) Dr Constantino Chiwenga and Colonel (Retired) Kembo Mohadi in laying wreaths at the Tomb of the Unknown Soldier.\n\nThis year, the families of the four newly declared national heroes received national flags in recognition of their loved ones contributions.\n\nAwards for Exceptional ServiceProfessor Vladimir Shubin, former Secretary of the Soviet Afro-Asian Solidarity Committee and Head of the Africa Section of the Communist Party of the Soviet Unions International Department, was presented with the Zimbabwe International Friendship Award for his role in supporting the countrys liberation struggle.\n\nInasem Chitutu, a teenager from Bindura who courageously rescued two children from a burning house, received the Silver Cross of Zimbabwe.\n\nDr Madeline Nyamwanzathe first female African medical doctor in Zimbabwewas honoured with the Robert Gabriel Mugabe Commendation Award for Service in Human Capital Development for her pioneering work in healthcare.\n\nThese living heroes join more than two thousand veterans of the liberation struggle and outstanding citizens recognised this year.\n\nAs the nation celebrates its heroes, President Mnangagwa reminded Zimbabweans that the responsibility to build a prosperous, upper-middle-income society by 2030 rests with every citizen.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has posthumously declared four national heroes and presented national flags to their families … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/mnangagwa-honours-jairos-jiri/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Honours Jairos Jiri\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        },
        {
            "title": "Six Church Members Die In Masvingo Horror Crash",
            "url": "https://www.zimeye.net/2025/08/12/six-church-members-die-in-masvingo-horror-crash/",
            "content": "By A Correspondent-Six members of the Zion Christian Church were killed in a road traffic accident at the 283-kilometre peg along the Mutare-Masvingo Road on Monday morning.\n\nThe accident occurred around 2 AM when a Toyota Quantum carrying the congregants veered off the road, overturned, and landed back on its wheels, leaving 16 others injured.\n\nZimbabwe Republic Police (ZRP) spokesperson Commissioner Paul Nyathi confirmed the accident in a statement issued Monday afternoon.\n\nThe victims bodies were taken to Masvingo General Hospital for postmortem, while the injured were admitted to the same facility.\n\nNyathi added that the names of the victims will be released once identification by next of kin is complete.\n\nIn a separate accident, Nyathi confirmed that one person died and 20 others were injured when a Nissan NP300 with 20 passengers veered off the road and overturned after its left rim broke.\n\nThis happened at around 5 AM on 10 August at a bridge along Four Mile Drive near Hwange Colliery Training Centre.\n\nNyathi urged motorists to avoid speeding and to observe all road safety rules to protect lives.\n\n-Online\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Six members of the Zion Christian Church were killed in a road traffic accident at the 283-kilometre peg … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/12/six-church-members-die-in-masvingo-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Six Church Members Die In Masvingo Horror Crash\"</span></a></p>",
            "time": "06:38",
            "date": "13 Aug 2025"
        }
    ]
}