{
    "news": [
        {
            "title": "Harare Old-Age-Home Manager Snoops Into Houses At Night To Coerce For Thousands Of Dollars And Do Rituals | FAIRWAYS HOMES",
            "url": "https://www.zimeye.net/2025/05/06/harare-old-age-home-manager-snoops-into-houses-at-night-to-coerce-for-thousands-of-dollars-and-do-rituals-fairways-homes/",
            "content": "WE ARE BEING ABUSED AND SILENCED  ELDERLY RESIDENTS EXPOSE FINANCIAL MISCONDUCT AND INTIMIDATION AT FAIRWAYS OLD AGE HOME\n\nBy A Correspondent | ZimEye |Harare | 5 May 2025\n\nDisturbing allegations have surfaced from Fairways Homes for the Aged Persons Trust in Eastlea, Harare, where elderly residents say they are victims of systemic financial abuse, coercion, and neglect.\n\nAccording to Harry van Biljon, a 67-year-old resident and whistleblower, the institution is being run in defiance of the Older Persons Act and the Trusts own constitution, with no proper oversight or accountability. Van Biljon accuses General Manager Denis Choto and Administrator Wendy Chimbare of extorting elderly residents and withholding funds owed to them from the sale of property rights known as Life Rights.\n\nThey are robbing the elderly under the cover of a Trust, van Biljon told this reporter. No receipts unless you beg, no AGMs, no financial recordsjust threats and intimidation when you ask questions.\n\nThe Case of Zerina Bhika\n\nOne case has galvanized concern across the community: that of 78-year-old resident Mrs. Zerina Bhika, who sold her cottage (Unit 6) for US$30,000 in January 2025. Under Fairways policy, she was due a 20% refundUS$6,000but received only US$300 after months of pressure.\n\nWhen Bhika demanded the remainder, she was told the money had already been used. Distraught and in need of medication, she filed a police report on 28 April at Highlands Police Station, assisted by van Biljon.\n\nShe was told bluntly by Mr. Choto, If you want your money, withdraw the police case, van Biljon said.\n\nFollowing her report, Bhika was allegedly summoned to the General Managers office and pressured into signing two documents she had not written herself:1. A letter falsely acknowledging receipt of US$2,740,2. A formal withdrawal of criminal charges.\n\nAccording to van Biljon, She was coerced. She signed just to get medication and pay her carer. She only got $300 in hand. The rest was a lie.\n\nIn audio recordings reviewed by this reporter, Bhika is heard saying:\n\nI am distressed. I thought they would protect us here, not take advantage. I signed the paper because I had no choice.\n\nRitual Intimidation\n\nAfter being questioned by police, Mr. Choto returned to Fairways accompanied by a man performing what residents described as spiritual rituals.\n\nHe walked behind Choto throwing water and stones, said one resident. It was frightening. They use fear to silence us.\n\nResidents also allege harassment by individuals introduced as CIO agents whenever complaints are raised about management or finances.\n\nConstitutional Breaches and Lost Oversight\n\nThe Trusts management committeeChairman Andrew West, Vice Chairman David Covell, and member Absalom Muchandionahas allegedly overstayed its term and failed to convene a legitimate Annual General Meeting since 2020.\n\nIn the last AGM, when we raised constitutional reforms, Mr. West shouted I now close the meeting! and stormed out, van Biljon recalled. Weve been in a vacuum of law and leadership ever since.\n\nThe Fairways Trust reportedly lost its registration with the Private Voluntary Organisations (PVO) Board and the Social Welfare Office due to noncompliance, but continued operations without legal standing.\n\nDespite submitting a signed petition to the Director of Social Welfare on 14 April 2025, residents say no action has been taken.\n\nA Broken Institution\n\nVan Biljon accuses the Trust of running an unaccountable cash-based scheme, accepting large USD payments from incoming residents without bank transfers, electronic tracking, or official receipts.\n\nThis is criminal. Its theft from the elderly. Its abuse. No person who treats vulnerable people this way should be allowed to run any institutionever.\n\nResidents Demand Action\n\nThe residents are calling for: An independent forensic audit of the Fairways Trust finances; Suspension and prosecution of Denis Choto and Wendy Chimbare; Immediate reconstitution of the management committee; Restoration of legal compliance with the Older Persons Act and PVO regulations.\n\nVan Biljon closed his letter with a stark warning:\n\nIf no one helps us now, what happens to those who cannot speak for themselves?\n\nDO YOU KNOW MORE?If you or someone you know has experienced elder abuse at Fairways or another care facility in Zimbabwe, contact us confidentially at ZimEye\n\n..\n\nInterview between Simba Chikanza and Denis Choto  Allegations at Fairways Homes for the Aged Persons Trust\n\nSimba Chikanza (SC):\n\nGood morning, sir.\n\nDenis Choto (DC):\n\nGood morning, sir. How are you?\n\nSC:\n\nIm well, thank you. Youre speaking to Simba Chikanza from ZimEye.\n\nDC:\n\nYes, sir.\n\nSC:\n\nThis is a quick call regarding a matter that has landed on my desk. I believe its something you may be able to address. It concerns allegations of you borrowing money from elderly residents at Fairways for your personal use. For example:\n\nThese claims suggest you visited the premises after dark to ask elderly residents for money. I wanted to hear your side before publishing anything.\n\nDC:\n\nThank you for that opportunity. Of all the issues raised, only two are relevant and have already been addressed. The matter with Colleen Beatty was settled privately. The issue with Mrs. Sampson was also a private arrangement. These were personal transactions and not threats or coercion.\n\nHowever, I believe some of these reports are coming from individuals with hidden agendas. The people raising these issues are not always acting in good faith or as responsible parties. They may be trying to tarnish my image or discredit me for personal reasons.\n\nSC:\n\nLets be cleardo you acknowledge that the concerns are valid, regardless of their source? These are elderly, vulnerable individuals. One day you and I might find ourselves in the same situation, in a care facility. How would we feel if someone in an official role came to our rooms at night asking for money?\n\nDC:\n\nYoure right. These matters should be addressed properly and respectfully. I agree its important to respect every individual. I have nothing to hide and am happy to meet in person to provide full context. But I must emphasize that some of this is being amplified to damage my professional standing.\n\nSC:\n\nSpecifically regarding Louise Smithdid you borrow money from her?\n\nDC:\n\nNo. I never borrowed from Louise Smith. Her children are alive and have raised no such issues. There was no agreement or complaint from her estate.\n\nSC:\n\nLets discuss Mrs. Bucha. Why did she receive only $300 when she was allegedly entitled to $6,000? She claims she was told the rest had been used already.\n\nDC:\n\nThere was an agreement that she would receive 20% of what was recovered. The $300 was an interim payment while waiting for further funds. She will receive the rest once funding is available. These issues are being exaggerated for effect.\n\nSC:\n\nWas a police report filed about this?\n\nDC:\n\nYes. A case was opened. I attended the police station, as well as meetings with the Department of Social Services and even the Presidents Office.\n\nSC:\n\nThe Presidents Office? That sounds extreme for a civil matter.\n\nDC:\n\nYes, they visited on July 1, 2022, during an investigation. We were surprised by the visit. It turns out it was connected to broader concerns about foreign funding and destabilization. We keep records of that visit.\n\nSC:\n\nDo you have documentationemails, minutes, or lettersto support that claim?\n\nDC:\n\nYes, and I can share names of those involved in the investigations.\n\nSC:\n\nAnother serious claim: Did you coerce Mrs. Bucha to withdraw her police case? The police were told $2,700 was paid when only $300 was handed over. Can you account for the remaining amount?\n\nDC:\n\nThere are records showing the full transaction. I can provide that documentation.\n\nSC:\n\nWhat about the man who allegedly came to Fairways and performed spiritual rituals? Who was he and who authorized his presence?\n\nDC:\n\nThats an unfolding issue. I can provide more detail later.\n\nSC:\n\nDo you have qualifications to be General Manager under the Older Persons Act?\n\nDC:\n\nYes. I hold a diploma from Awesome Training Institution, a diploma in Designatory Management from Trust Academy, and certification in Project Management from an Australian institute. I am also certified by the Zimbabwe Institute of Control Personnel.\n\nSC:\n\nWho should people complain to if they feel youve failed in your duties? Youve emphasized that people should respect youbut do you respect the vulnerability of the residents?\n\nDC:\n\nI do. There is a grievance procedure outlined in our institutions documentation. Normally, complaints should go to the Chairman of the Board of Trustees. Unfortunately, the current complainant bypassed this and went straight to government. His actions suggest hes trying to take over the institution. He never followed protocol.\n\nSC:\n\nThats a serious accusation. Can you send me evidence supporting your claim that the complainant is trying to take over Fairways?\n\nDC:\n\nYes, I can send you documentation and recordings to support this.\n\nSC:\n\nPlease also send me contact information for the Chairman of the Board, and a recorded audio of your final remarks on this matter so I can assess whether the issue has been addressed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "“WE ARE BEING ABUSED AND SILENCED” — ELDERLY RESIDENTS EXPOSE FINANCIAL MISCONDUCT AND INTIMIDATION AT FAIRWAYS OLD AGE HOME By … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/harare-old-age-home-manager-snoops-into-houses-at-night-to-coerce-for-thousands-of-dollars-and-do-rituals-fairways-homes/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Old-Age-Home Manager Snoops Into Houses At Night To Coerce For Thousands Of Dollars And Do Rituals | FAIRWAYS HOMES\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Green Machine Unveils Ian Bakala",
            "url": "https://www.zimeye.net/2025/05/06/green-machine-unveils-ian-bakala/",
            "content": "Sports Correspondent\n\nCAPS United has announced Ian Bakala as part of its new technical team. Bakala, a former player for the Green Machine, will serve as assistant coach. The club has also redeployed Lloyd Chitembwe to the role of Technical Director.\n\nA new head coach is set to be announced on Thursday, and the rest of the technical team will be unveiled before the upcoming match against Herentals. CAPS United president Farai Jere said, Ian Bakala will be our assistant head coach. Well introduce a new technical setup that will take effect this weekend.\n\nThese changes come after a poor start to the season, with CAPS United currently 15th in the league, just above the relegation zone, with eight points from ten games.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent CAPS United has announced Ian Bakala as part of its new technical team. Bakala, a former player for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/green-machine-unveils-ian-bakala/\">Continue reading<span class=\"screen-reader-text\"> \"Green Machine Unveils Ian Bakala\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Will Barcelona Conquer The San Siro?",
            "url": "https://www.zimeye.net/2025/05/06/will-barcelona-conquer-the-san-siro/",
            "content": "Sports Correspondent\n\nAll eyes turn to Milan tonight as Inter Milan and Barcelona meet in the decisive second leg of their Champions League semi-final at the iconic San Siro.\n\nWith a place in the final at stake, the tie is delicately poised following a dramatic 3-3 draw in the first leg at the Nou Campa match packed with intensity, flair, and six goals that left fans on the edge of their seats.\n\nDespite much of the pre-game attention focusing on Barcelonas attacking prowess, it was Inter who made the early statement in the opening leg, stunning the hosts with two quick goals in the first 21 minutes.\n\nTonights clash promises another epic chapter in this heavyweight battle, as both teams aim to seize their moment under the floodlights of the San Siro. Betting analysts have weighed in with predictions, but with so much at stake and momentum swinging both ways, its anyones game.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent All eyes turn to Milan tonight as Inter Milan and Barcelona meet in the decisive second leg of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/will-barcelona-conquer-the-san-siro/\">Continue reading<span class=\"screen-reader-text\"> \"Will Barcelona Conquer The San Siro?\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Watch: Chief Mapanzure Licks Mnangagwa Boots In Public",
            "url": "https://www.zimeye.net/2025/05/06/watch-chief-mapanzure-licks-mnangagwa-boots-in-public/",
            "content": "Chief Mapanzure of Zvishavane commended His Excellency President Emmerson Mnangagwa for the construction of the new smart silos at the Kwekwe Depot. He said the silos bring convenience to farmers in Zvishavane who used to take their grain to the GMB depot in Chegutu\n\nChief Mapanzure of Zvishavane commended His Excellency President Emmerson Mnangagwa for the construction of the new smart silos at the Kwekwe Depot. He said the silos bring convenience to farmers in Zvishavane who used to take their grain to the GMB depot in Chegutupic.twitter.com/79AjdViYB6\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Chief Mapanzure of Zvishavane commended His Excellency President Emmerson Mnangagwa for the construction of the new smart silos at the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/watch-chief-mapanzure-licks-mnangagwa-boots-in-public/\">Continue reading<span class=\"screen-reader-text\"> \"Watch: Chief Mapanzure Licks Mnangagwa Boots In Public\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Kandishaya Responds to Machakaire’s Criticism of Health System",
            "url": "https://www.zimeye.net/2025/05/06/kandishaya-responds-to-machakaires-criticism-of-health-system/",
            "content": "By A Correspondent\n\nZANU PF Youth League Secretary for Commissariat, Taurai Kandishaya, has weighed in on recent remarks made by Youth Affairs Minister, Tino Machakaire, who publicly condemned the deteriorating state of Zimbabwes health care system.\n\nMachakaires candid comments, made on Monday, described the countrys health infrastructure as being in a pathetic state, sparking widespread public debate and mixed reactions both within and outside the ruling party.\n\nIn what appeared to be a veiled rebuke, Kandishaya took to social media to question the intent and timing of Machakaires statement, suggesting that the concerns raised had long been known to the relevant authorities.\n\nWhat happened to this advice? Minister of Health office he knows, Secretary for Health office he knows; tinoti imhepo inongodarika (we just say its wind that passes), Kandishaya wrote, implying that the criticism was either insincere or being used for political grandstanding.\n\nKandishayas remarks suggest a growing discomfort within the party over internal criticism being aired publicly, particularly at a time when the government is already under pressure to address service delivery failures.\n\nMachakaires statement, meanwhile, resonated with many Zimbabweans who have long complained about collapsing hospitals, shortages of medical staff, and lack of basic supplies. Some have applauded him for speaking truth to power, while others view it as a political move aimed at distancing himself from responsibility.\n\nThe exchange between the two ZANU PF figures highlights growing divisions within the ruling party, especially among its younger leaders, over how to address Zimbabwes ongoing socio-economic challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF Youth League Secretary for Commissariat, Taurai Kandishaya, has weighed in on recent remarks made by … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/kandishaya-responds-to-machakaires-criticism-of-health-system/\">Continue reading<span class=\"screen-reader-text\"> \"Kandishaya Responds to Machakaire’s Criticism of Health System\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Dhara Blessed Mhlanga Granted US$500 Bail…",
            "url": "https://www.zimeye.net/2025/05/06/dhara-blessed-mhlanga-granted-us500-bail/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga bail.\n\nThis followed his successful appeal through his lawyers Advocate Thabani Mpofu and Chris Mhike.\n\nThe accused be and is hereby granted bail. He is to deposit US$500 bail with the clerk of court, said the judge.\n\nMandaza saidThere are indeed changed circumstances. Im of the view that the court aquo misdirected itself. The appellant is a permanent resident of this country.\n\nTo allay the fears the state can conditions to ensure that he does not interfere and abscond.\n\nThe judge said the fear of interference does not stand because the docket is now complete.\n\nThe appeal was his second before the High Court.\n\nMhlanga had been denied bail on three occassions already.\n\nHis lawyer Advocate Thabani Mpofu who is taking instructions from Chris Mhike urged the judge to grant the journalist freedom submitting that there have been changed circumstances.\n\nMpofu said Mpofu was locked up following calls for protests by Geza but people did not flood the streets as called for.\n\nThe lawyer also said when Geza called for a national shut down people went on with their business.\n\nWe submit that there was an obvious change in circumstances and the court aquo misdirected itself in dealing with a question that was placed before it.\n\nThere has been changes that serves to address the concerns that were there initially raised by the courts in denying the appellant bail.\n\nThe charge is transmitting material with the intention of inciting violence. It is critical to consider the importance of the charge.\n\nIt was transmission linked to an event or events and this said, the appellant is a journalist he asked questions in an interview and answers were given, so uf there is an allegation that material meant to incite violence was transmittedthe time of the protests has come and gone.\n\nMay this court take a judicial notice that the first call of protest was done and there were no people who flooded the streets.\n\nThere was a call for a national shut down but people went on with their business.\n\nWhat is alleged by the state to be the transmission of inciting messages has come and gone. What has not come and gone is the continuity of the incarceration of the appellant in jail.\n\nPart of the reasons for denying bail was that there might be disturbance of peacedisturbance in connection with the event.\n\nMpofu said there was no violence in the country adding that even the judge, being a Zimbabwean has noticed this.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Mary Taruvinga High Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga bail. This followed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/dhara-blessed-mhlanga-granted-us500-bail/\">Continue reading<span class=\"screen-reader-text\"> \"Dhara Blessed Mhlanga Granted US$500 Bail…\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "JUST IN: Blessed Mhlanga Granted Bail.",
            "url": "https://www.zimeye.net/2025/05/06/just-in-blessed-mhlanga-granted-bail/",
            "content": "By Court Reporter-High Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga US$500 bail.\n\nThis followed his successful appeal through his lawyers, Advocate Thabani Mpofu and Chris Mhike.\n\nThe accused be and is hereby granted bail. He is to deposit US$500 bail with the clerk of court, said the judge.\n\nMandaza saidThere are indeed changed circumstances. Im of the view that the court a quo misdirected itself. The appellant is a permanent resident of this country.\n\nTo allay the fears the state can conditions to ensure that he does not interfere and abscond.\n\nThe judge said the fear of interference does not stand because the docket is now complete.\n\nThe appeal was his second before the High Court.\n\nMhlanga had been denied bail on three occasions already.\n\nHis lawyer, Advocate Thabani Mpofu, who is taking instructions from Chris Mhike, urged the judge to grant the journalist freedom, submitting that there have been changed circumstances.\n\nMpofu said Mpofu was locked up following calls for protests by Geza, but people did not flood the streets as called for.\n\nThe lawyer also said that when Geza called for a national shutdown, people went on with their business.\n\nWe submit that there was an obvious change in circumstances and the court aquo misdirected itself in dealing with a question that was placed before it.\n\nThere have been changes that serve to address the concerns that were initially raised by the courts in denying the appellant bail.\n\nThe charge is transmitting material with the intention of inciting violence. It is critical to consider the importance of the charge.\n\nIt was transmission linked to an event or events, and this said, the appellant is a journalist, he asked questions in an interview, and answers were given, so if there is an allegation that material meant to incite violence was transmittedthe time of the protests has come and gone.\n\nMay this court take judicial notice that the first call of protest was made and there were no people who flooded the streets.\n\nThere was a call for a national shutdown, but people went on with their business.\n\nWhat is alleged by the state to be the transmission of inciting messages has come and gone. What has not come and gone is the continuity of the incarceration of the appellant in jail.\n\nPart of the reasons for denying bail was that there might be disturbance of peacedisturbance in connection with the event.\n\nMpofu said there was no violence in the country, adding that even the judge, being a Zimbabwean, has noticed this.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Court Reporter-High Court judge Justice Gibson Mandaza has granted Alpha Media Holdings journalist Blessed Mhlanga US$500 bail. This followed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/just-in-blessed-mhlanga-granted-bail/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: Blessed Mhlanga Granted Bail.\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Mnangagwa Minister Threatens Mayor Coltart Over Hosting Ndebele King",
            "url": "https://www.zimeye.net/2025/05/06/mnangagwa-minister-threatens-mayor-coltart-over-hosting-ndebele-king/",
            "content": "By A Correspondent\n\nBULAWAYO  Tensions have flared between central government and local leadership after Minister of Local Government and Public Works, Daniel Garwe, publicly attacked Bulawayo Mayor David Coltart for hosting self-proclaimed Ndebele King Bulelani Khumalo.\n\nGarwe demanded an explanation from Mayor Coltart regarding the citys official welcome of King Bulelani, whom the minister dismissed as an imposter and a foreign national.\n\nHis comments have sparked outrage from political and cultural groups in Matabeleland, who view the remarks as disrespectful to Ndebele heritage.\n\nIn a strong rebuttal, opposition party ZAPU threw its weight behind Coltart, accusing Garwe of political intimidation. ZAPU president Sibangilizwe Nkomo defended the mayor, warning that his party would not tolerate what he described as a targeted campaign.\n\nWe know that there are people with a hidden agenda of trying to get rid of our Bulawayo mayor because they do not like him, Nkomo said. We love our mayor, and we will defend him. We will not be intimidated by Minister Garwes bullying tactics.\n\nNkomo also condemned the ministers remarks as culturally insensitive, saying they undermined efforts to reconcile historical wounds, particularly around the unresolved legacy of the Gukurahundi massacres.\n\nGarwe is ignoring and insulting our traditions and our pain. This kind of rhetoric is dangerous and shows a lack of commitment to genuine national healing, he added.\n\nMeanwhile, Bornwell Khumalo, spokesperson for King Bulelani, dismissed Garwes criticism as uninformed and inflammatory. He cannot say our king is a fraud or defunct. That is an insult, said Khumalo. If we are practising our culture, which he does not understand, where does he come in? We are practising our culture, not politics.\n\nKing Bulelani Khumalo claims lineage from King Lobengula, the last officially recognised Ndebele monarch, who succeeded his father King Mzilikazi in the 19th century. While Zimbabwes government has never formally recognised Bulelani as king, his coronation in recent years has been symbolically important for many Ndebele people seeking cultural restoration.\n\nThe incident has once again exposed deep-rooted tensions between national authorities and Matabeleland communities over historical recognition, cultural identity, and political representation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent BULAWAYO – Tensions have flared between central government and local leadership after Minister of Local Government and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/mnangagwa-minister-threatens-mayor-coltart-over-hosting-ndebele-king/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Minister Threatens Mayor Coltart Over Hosting Ndebele King\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Bed Bugs Invade Mnangagwa Home Town",
            "url": "https://www.zimeye.net/2025/05/06/bed-bugs-invade-mnangagwa-home-town/",
            "content": "By A Correspondent\n\nKWEKWE  A wave of panic has gripped residents of Kwekwe following a surge in bed bug (tsikidzi) infestations across several suburbs, with authorities confirming the outbreak is spreading rapidly.\n\nThe infestation, initially reported in the high-density areas of Amaveni and Mbizo, has left many residents distressed as the blood-sucking pests invade homes, schools, and public buildings.\n\nWe are living in hell. These insects are everywhere  in our beds, sofas, and even in public transport. We cant sleep anymore, said Margaret Dube, a resident of Mbizo 11. We need help, and we need it now.\n\nKwekwe City Council officials have acknowledged the severity of the situation. A council source speaking on condition of anonymity said, Kwekwe is under siege from a growing bed bug infestation, with Amaveni and Mbizo being the most affected. The city is working on containment strategies, but the spread is worrying.\n\nThe outbreak mirrors a similar crisis in Harares Mbare suburb, where health authorities have struggled to eliminate the persistent pests amid limited resources and poor waste management.\n\nWere trying our best, but fumigation efforts require more chemicals and coordinated action. Community cooperation will also be critical, the council source added.\n\nLocal health experts warn that the outbreak, if left unchecked, could spread to surrounding areas, urging swift intervention from both the municipality and national government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent KWEKWE — A wave of panic has gripped residents of Kwekwe following a surge in bed bug … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/bed-bugs-invade-mnangagwa-home-town/\">Continue reading<span class=\"screen-reader-text\"> \"Bed Bugs Invade Mnangagwa Home Town\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        },
        {
            "title": "Nation Told to Expect Longer Blackouts as ZESA Blames Technical Faults",
            "url": "https://www.zimeye.net/2025/05/06/nation-told-to-expect-longer-blackouts-as-zesa-blames-technical-faults/",
            "content": "By A Correspondent\n\nZimbabweans should brace for intensified electricity outages, the Zimbabwe Electricity Supply Authority (ZESA) has warned, citing fresh breakdowns at Hwange Thermal Power Station and a fire at a critical substation in Harare.\n\nIn a statement issued Monday, the state-owned power utility announced that it is currently struggling to maintain consistent power supply due to technical challenges at Hwangeone of the countrys main sources of electricity generation.\n\nDue to a fault that occurred at Hwange Power Station, generation capacity has been significantly reduced, resulting in increased load-shedding across the country, ZESA said.\n\nThe situation was made worse after a major substation supplying Harares southwestern suburbs reportedly caught fire on Sunday night. One of our key substations was severely damaged by fire, affecting power supply in parts of the capital, a ZESA official revealed under condition of anonymity.\n\nEnergy analysts, however, argue the problem goes far deeper than technical glitches. They point to the aging infrastructure at Hwange and the wider economic crisis that has hindered long-overdue maintenance and investment in the energy sector.\n\nWeve warned for years that Hwanges machinery is outdated and operating on borrowed time. This isnt a new problemits a ticking time bomb, said an independent energy consultant based in Harare.\n\nDespite ZESAs efforts to downplay the long-term implications, many Zimbabweans are already feeling the pinch, with rolling blackouts lasting up to 12 hours in some areas.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabweans should brace for intensified electricity outages, the Zimbabwe Electricity Supply Authority (ZESA) has warned, citing fresh … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/06/nation-told-to-expect-longer-blackouts-as-zesa-blames-technical-faults/\">Continue reading<span class=\"screen-reader-text\"> \"Nation Told to Expect Longer Blackouts as ZESA Blames Technical Faults\"</span></a></p>",
            "time": "09:32",
            "date": "07 May 2025"
        }
    ]
}