{
    "news": [
        {
            "title": "Mnangagwa Plots Against Chiwenga, Replaces Him With His Son?",
            "url": "https://www.zimeye.net/2025/08/31/mnangagwa-plots-against-chiwenga-replaces-him-with-his-son/",
            "content": "By A Correspondent President Emmerson Mnangagwa has fully integrated his soldier son, Major Sean Mnangagwa, into his inner security team in what insiders say is a carefully orchestrated plan to sideline Vice President Constantino Chiwenga and prepare his son for eventual succession.\n\nMilitary intelligence sources toldZimEyethat Mnangagwa is grooming Sean, who serves in the elite Presidential Guard, to study the mechanics of power and eventually inherit the presidency. The Presidential Guard, which is responsible for protecting the Head of State and the political establishment, has historically been a critical base of power for any leader seeking to consolidate authority in Zimbabwe.\n\nWhile it is common for Presidential Guard officers to serve in the Presidents close security unit, Seans appointment is unusual and controversial. Analysts say his proximity to his father creates a glaring conflict of interest  entangling family loyalty with state security. Sources allege that Mnangagwa intends to fast-track his sons promotion to a senior rank  possibly brigadier or general  giving him command of the Guard and positioning him as a direct rival to Chiwenga, who once controlled the military establishment.\n\nSean has travelled extensively with Mnangagwa since 2023, often assuming the role of chief security officer on both domestic and international assignments. This week, he accompanied his father to the Vatican, fuelling speculation that Mnangagwa is deliberately exposing him to international diplomacy and leadership grooming.\n\nBut Seans growing political footprint is not limited to military duties. He has reportedly been involved in lucrative business dealings with Mnangagwas allies, including fuel magnate Kuda Tagwirei. Together with his twin brother Collins, Sean is said to run private offices protected by state security agents, where they vet investors before granting them access to the President  reportedly charging fees in the process. Critics say this amounts to a shadow presidency run by the Mnangagwa family.\n\nThe move to elevate Sean comes against the backdrop of intensifying factional struggles within Zanu PF. Mnangagwas uneasy relationship with Chiwenga  the former military commander who played a decisive role in the 2017 coup that ousted Robert Mugabe  has long fuelled speculation of a looming power showdown. Chiwenga is believed to harbour his own presidential ambitions, but his influence has been gradually weakened as Mnangagwa has packed key state and military positions with loyalists. By installing Sean within the heart of the security apparatus, Mnangagwa appears to be tightening his grip while undercutting his deputys military base.\n\nPolitical analysts draw parallels between Mnangagwas strategy and succession models elsewhere in Africa, where leaders have manoeuvred to entrench dynasties by placing their children in the military or key political roles. This is about neutralising Chiwenga and ensuring the familys hold on power, one analyst observed. Mnangagwa is fusing state security with his household to block any internal threats from Zanu PF or the army.\n\nCritics also argue that Mnangagwas much-publicisedVision 2030may not be just an economic blueprint but a political smokescreen. By stretching Zimbabwes development horizon to 2030, Mnangagwa could be buying time to delay a genuine electoral contest while training his son to grasp statecraft and consolidate his influence. If successful, this would allow Sean to step into power with the backing of both the military and the ruling party, bypassing traditional succession channels.\n\nWith Zanu PFs elective congress looming in the next two years, Mnangagwas manoeuvres are expected to intensify. Chiwengas camp remains wary, while growing rumours of Seans rise deepen mistrust within the ruling elite.\n\nPresidential spokesperson George Charamba was unavailable for comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has fully integrated his soldier son, Major Sean Mnangagwa, into his inner security team … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/mnangagwa-plots-against-chiwenga-replaces-him-with-his-son/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Plots Against Chiwenga, Replaces Him With His Son?\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Panic in State House: Mnangagwa’s Vatican Dash to Outrun Chiwenga",
            "url": "https://www.zimeye.net/2025/08/31/panic-in-state-house-mnangagwas-vatican-dash-to-outrun-chiwenga/",
            "content": "Why Did Mnangagwa Rush to the Vatican?\n\nThe Politics of Spiritual Power and Papal Grace in Zimbabwes Leadership.\n\nBy Lesley Cain Banda | When President Emmerson Mnangagwa suddenly set course for the Vatican, speculation immediately erupted across Harares corridors of power. Why the urgency? Why now? Was it merely diplomatic courtesy, or something deeper, perhaps even mystical, driving the Zimbabwean leaders dash to Rome?\n\nA Visit Shrouded in Urgency\n\nUnlike carefully pre-planned state visits, Mnangagwas appearance at the Vatican seemed hurried, uncharacteristically so. The urgency raised questions in political and church circles alike: what did the President hope to gain that could not wait?\n\nFor some, the explanation lies not in diplomacy but in a growing paranoia inside State House. Mnangagwas deputy, Vice President Constantino Chiwenga, recently visited Italy  and although his trip was framed around medical treatment and international engagements, whispers have it that he also brushed shoulders with the Catholic establishment.\n\nFear of Transferred Power\n\nZimbabwes political folklore has long been entwined with spiritual undertones. Power is not only about the ballot, the army, or the constitution; it is also about unseen forces, blessings, and mystical legitimacy.\n\nWithin that frame, Mnangagwas dash to the Vatican carries a symbolic reading: a fear that Chiwenga may have secured papal goodwill  and with it, a form of spiritual endorsement. In the logic of Zimbabwean statecraft, where politics, ritual, and religion intersect, no leader wants to be seen as spiritually outflanked by his deputy.\n\nThus, Mnangagwas visit may not have been about faith alone. It was a counter-move, a political insurance policy: to seek his own audience with the Pope, perhaps to equal or even surpass whatever graces Chiwenga may have received.\n\nMugabes Precedent: The Pope as a Source of Legitimacy\n\nMnangagwa is not the first Zimbabwean leader to seek Romes benediction. Robert Mugabe, despite his bitter clashes with Western governments, maintained an unusual closeness to the Vatican. He attended papal funerals and masses, cultivating ties that puzzled observers who often viewed him as isolated internationally.\n\nWhy did Mugabe keep such proximity to the Pope? For one, Catholic legitimacy carried weight at home and abroad. To his followers, Mugabe was not only politically powerful but also spiritually recognised. The symbolism of papal encounters suggested a layer of grace beyond earthly politics.\n\nMnangagwa, long in Mugabes shadow, is not blind to that history. By rushing to Rome, he is walking in Mugabes footsteps  perhaps even trying to borrow his aura of papal-tinged legitimacy.\n\nThe Battle for Mystical Capital\n\nThe Vatican trip, then, is not just about Catholic diplomacy. It is about mystical capital  the invisible assets of power that come from being seen, blessed, or acknowledged by spiritual giants. In Zimbabwes political imagination, papal recognition can fortify a leaders claim to rule, shield him from rivals, and reassure followers who still see faith and politics as inseparable.\n\nIn that sense, Mnangagwas urgency reveals more than insecurity. It unveils a deeper battle within Zimbabwes ruling elite: a race not just for political dominance, but for spiritual supremacy.\n\nThe Questions That Linger\n\nWhatever the true motives, the Vatican visit demonstrates that in Zimbabwe, power is never just political. It is also spiritual, symbolic, and often mystical. And when paranoia sets in, even the Pope can become part of the battlefield.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Why Did Mnangagwa Rush to the Vatican? The Politics of Spiritual Power and Papal Grace in Zimbabwe’s Leadership. By Lesley … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/panic-in-state-house-mnangagwas-vatican-dash-to-outrun-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Panic in State House: Mnangagwa’s Vatican Dash to Outrun Chiwenga\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "70 Doctors Are Drug Addicts",
            "url": "https://www.zimeye.net/2025/08/31/70-doctors-are-drug-addicts/",
            "content": "The horror of discovering that the very hands trusted to save lives are themselves trembling under the grip of drugs is chilling. For patients, the thought that a doctor  the symbol of healing and hope  could be battling the same addictions ravaging society is a betrayal that shakes confidence in the entire health system. In Zimbabwe, that nightmare is real: more than 70 medical professionals, from young interns to seasoned specialists, are now reported to be struggling with drug and substance abuse.\n\nOver 70 Zimbabwean Doctors Battling Drug and Substance Abuse\n\nBulawayo  More than 70 medical professionals in Zimbabwe are reported to be struggling with drug and substance abuse, a shocking revelation that underscores the depth of the crisis gripping the nation.\n\nHealth and Child Care Minister Dr. Douglas Mombeshora made the disclosure during the Zimbabwe Medical Association (ZiMA) annual Scientific Congress held in Bulawayo recently, warning that the profession cannot ignore its own growing vulnerability to addiction.\n\nOne urgent threat is drug and substance abuse, which is devastating young people and straining our health systems. Yet we cannot pretend that it is only out there; some health professionals themselves are also struggling with substance abuse. Let me say, when the healer becomes the patient, our entire system is at risk. We now have more than 70 or so health professionals who are struggling with drug and substance abuse. Let us help them, Dr Mombeshora said.\n\nHe urged fellow doctors and institutions to extend peer support, counselling, and ethical reinforcement, stressing that caregivers must first protect their own well-being:\n\nAs doctors we must remember that we cannot pour from an empty cup.\n\nZiMA President Dr. Kudzai Masinire echoed the concerns, noting the rise in incapacitation among health practitioners due to substance misuse, while Ingutsheni Central Hospital Chief Medical Officer, Dr. Nemache Mawere, confirmed that alcohol, cannabis, crystal meth, and cough mixtures remain the most commonly abused substances in Bulawayo. Among medical professionals, prescription opioids such as Pethidine are reportedly being misused.\n\nRehabilitation Capacity Strained\n\nIngutsheni Hospital, primarily a psychiatric institution, is currently bearing the burden of treating severe drug abuse cases despite not being designed as a rehabilitation centre. Plans for a specialised 20-bed rehabilitation unit at St Lukes II ward are in place, but the project has stalled due to lack of funding.\n\nDr. Mawere revealed that further step-down facilities, including a hostel in Lobengula and a halfway home in Emakhandeni, are also on the cards but remain unfunded and in need of refurbishment.\n\nNational Impact of Drug Crisis\n\nZimbabwes drug crisis has spiralled into a public health and socio-economic emergency. Among the youth, substance abuse has been linked to rising crime, poor productivity, and long-term health complications. Economically, the state is absorbing higher healthcare costs while losing critical human capital.\n\nThe government has begun implementing the Zimbabwe National Drug Master Plan, focusing on supply reduction, demand reduction, and harm reduction. Rehabilitation centres are seen as key in providing sustained recovery support.\n\nService Before Money\n\nDr. Mombeshora also reminded doctors to prioritise saving lives over profit:\n\nLets not think about money first. In any business, you provide a service and the money comes after. Even for us, lets provide the service and the money comes after, but if we think of money first and get rich, the people will run away from you.\n\nHe urged medical professionals to publicise their available services to reduce unnecessary health tourism, stressing that Zimbabwes health system could deliver more if doctors embraced service-driven ethics.- state media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The horror of discovering that the very hands trusted to save lives are themselves trembling under the grip of drugs … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/70-doctors-are-drug-addicts/\">Continue reading<span class=\"screen-reader-text\"> \"70 Doctors Are Drug Addicts\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Jah Prayzah versus Winky D, who’s pulling quality numbers?",
            "url": "https://www.zimeye.net/2025/08/31/jah-prayzah-versus-winky-d-whos-pulling-quality-numbers/",
            "content": "Jah Prayzah versus Winky D. Whos pulling quality numbers ?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Zimbabwe’s Amazing Story",
            "url": "https://www.zimeye.net/2025/08/31/zimbabwes-amazing-story/",
            "content": "By Engineer Jacob Kudzayi Mutisi | In most parts of the world, ownership of property and vehicles often comes with years of debt, mortgages, and bank loans. Yet in Zimbabwe, a unique economic reality has created a culture where citizens own their assets outright, making Zimbabweans some of the most debt-free people in the world. Whether it is a modest urban house worth US$40,000 or a luxury property valued at US$500,000, the majority of homeowners have fully paid for their properties without mortgages. The same can be said for carsmost Zimbabweans drive vehicles that are 100 percent owned, free from bank financing or leasing arrangements.\n\nThis trend is remarkable, especially when compared with developed countries, where homeowners can spend decades repaying loans. In places like the United States, the United Kingdom, and even South Africa, mortgages typically run for 20 to 30 years, while vehicle financing schemes are considered the norm. Zimbabweans, however, have learned to avoid credit dependencya lesson shaped by years of economic turbulence, hyperinflation, and mistrust in the banking sector. For many, the memory of lost savings in banks remains fresh, driving the determination to purchase assets in cash.\n\nZimbabwe is a country that struggles with high unemployment, low salaries, and a volatile currencyyet Zimbabweans remain asset-rich. Families often pool resources, relatives in the diaspora send remittances, and informal businesses play a crucial role in generating income. The result is that ownership is prioritised above everything else. Once an asset is acquired, it is not tied to any financial institution, giving its owner full security and peace of mind.\n\nDriving through Harares leafy suburbs or Binduras growing residential neighbourhoods, one is struck by the sheer scale of modern homesmany built brick by brick without borrowing a single cent. In the rural areas, villagers too proudly own their land and homesteads outright. Cars on the roads, whether luxury SUVs or small second-hand imports, belong entirely to their drivers.\n\nCritics may point out that this reflects a weakness in Zimbabwes financial systems, where banks have failed to provide affordable credit lines for citizens. Yet it also highlights an extraordinary culture of resilience. Zimbabweans have learned to live within their means, accumulate savings outside formal structures, and invest directly in assets that secure their future.\n\nIn a world drowning in debt, Zimbabweans stand out as a people who truly own what they have. In reality, they are far richer than many who appear wealthier but remain chained to loans.\n\nWe are ahead of the game.\n\nEngineer Jacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi | In most parts of the world, ownership of property and vehicles often comes with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/zimbabwes-amazing-story/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabwe’s Amazing Story\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Terrible Masvingo Crash Kills 8 People",
            "url": "https://www.zimeye.net/2025/08/31/terrible-masvingo-crash-kills-8-people/",
            "content": "By A Correspondent Eight people lost their lives in the early hours of Saturday following a horrific road traffic accident along the Mutare-Masvingo Road.\n\nThe Zimbabwe Republic Police (ZRP) confirmed that the tragedy occurred at the 246-kilometre peg near Mutendi Complex at around 2:00 AM on 30th August 2025.\n\nAccording to the police, a Dragon bus carrying 20 passengers from Beitbridge to Mutare attempted to overtake a haulage truck carrying timber while an oncoming vehicle approached.\n\nThe bus driver swerved back to his lane and sideswiped the truck, causing the timber to pierce into the bus, the ZRP said in a statement.\n\nAuthorities reported that eight people, including the bus driver, died instantly, while four others sustained injuries. The bodies of the victims were referred to Masvingo General Hospital for post-mortem examination, while the injured were referred to the same institution for treatment, the police confirmed.\n\nMeanwhile, the ZRP also revealed that the death toll from another accident that occurred two days earlier has risen. That crash, involving a Toyota Fortuner GD6 at the 46-kilometre peg along the same Mutare-Masvingo Road on 28th August 2025, has now claimed six lives.\n\nTwo more victims died while admitted at Victoria Chitepo Provincial Hospital, the police said.\n\nCommenting on the rising number of fatalities, the ZRP noted with concern the recurring cause of the accidents. It is sad to note that most of the accidents recorded between Friday and today were caused by overtaking errors on the part of drivers, the statement read.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– Eight people lost their lives in the early hours of Saturday following a horrific road traffic accident … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/terrible-masvingo-crash-kills-8-people/\">Continue reading<span class=\"screen-reader-text\"> \"Terrible Masvingo Crash Kills 8 People\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Accidents Engulf Zim at August Month-End",
            "url": "https://www.zimeye.net/2025/08/31/accidents-engulf-zim-at-august-month-end/",
            "content": "By A Correspondent Zimbabwe closed the month of August, traditionally marked as Heroes Month, under a dark cloud as multiple fatal road accidents in Harare and Mutare claimed scores of lives, leaving families and communities in mourning.\n\nOn the HarareNyamapanda Road, tragedy struck whenseven members of the same familywere killed in a horrific crash that also leftnine others injured.\n\nPolice said the accident occurred at the 49km peg when a kombi carrying 16 family members, a tombstone, and bricks overturned after the driver attempted to overtake another vehicle.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the accident, saying the overloaded kombi instantly claimed five lives, while two others died on admission to hospital.\n\nThe kombi was carrying 16 family members and goods including a tombstone and bricks. Seven people died, and nine others were injured after the driver lost control while overtaking, said Comm Nyathi.\n\nThe survivors are receiving treatment at a nearby hospital, while police have urged motorists to exercise extreme caution on the countrys highways, warning that reckless overtaking and speeding remain the biggest killers.\n\nThe names of the deceased are being withheld until their families have been notified.\n\nMeanwhile, in Mutare, the city is reeling from theloss of two prominent figuresin separate crashes within hours of each other.\n\nIn the first incident, respected war veteranAmos Chinyamutangira (63)was killed in a hit-and-run at the 9 Miles area along the MutareMasvingo Road.\n\nHis niece, Ms Rumbidzai Chinyamutangira, confirmed the tragedy, saying her uncle was waiting for transport to collect his war veterans allowance when he was struck.\n\nWe were informed this morning that he had been killed in a hit-and-run incident. His body was found lying by the roadside, but we are still awaiting a full report from the police, she said.\n\nIn a separate crash, popular Mutare transporterGodfrey Chikosiand six others died after their vehicle was involved in a fatal accident at the Himalaya Turn-Off along the MutareChimanimani Road late Friday night.\n\nFour people, including Chikosi, died on the spot, while two others succumbed to injuries at Victoria Chitepo Provincial Hospital. One survivor remains hospitalised in critical condition.\n\nAlthough police were not immediately available for comment, fellow transporterIsau Mupfumiconfirmed Chikosis death and said a team had been dispatched to the crash scene.\n\nThe twin tragedies have plunged Mutare into mourning, with residents describing both Chinyamutangira and Chikosi as community pillars who contributed significantly to the citys social and economic life.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Zimbabwe closed the month of August, traditionally marked as Heroes Month, under a dark cloud as multiple … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/accidents-engulf-zim-at-august-month-end/\">Continue reading<span class=\"screen-reader-text\"> \"Accidents Engulf Zim at August Month-End\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Business Leaders Call For Urgent Dialogue With Mnangagwa Amid Deepening Economic Crisis",
            "url": "https://www.zimeye.net/2025/08/31/business-leaders-call-for-urgent-dialogue-with-mnangagwa-amid-deepening-economic-crisis/",
            "content": "By Business Correspondent\n\nHarare  Business leaders have issued a blunt warning that Zimbabwes economic turmoil is spiraling out of control, demanding an urgent meeting with President Emmerson Mnangagwa after ministries and regulators repeatedly failed to deliver meaningful reforms.\n\nFrustrated executives say only Mnangagwas direct involvement can salvage confidence and halt the countrys economic freefall, as previous engagements with Treasury, the Ministry of Industry and Commerce, and the Reserve Bank of Zimbabwe (RBZ) have yielded little more than empty promises.\n\nConfederation of Zimbabwe Industries (CZI) chief executive Sekai Kuvarika told a governmentbusiness dialogue this week that the system was broken and needed leadership from the very top.\n\nWe really need this whole reform agenda to be driven by the Head of State, not just through a passing statement or endless committees that have achieved nothing, Kuvarika said. We want the President to be sending a consistent, strong message to the market. Right now, confidence is non-existent, and people are losing hope.\n\nShe went further, criticizing the glacial pace of reforms:We are not satisfied with how slow this agenda is moving. What we need is a Presidential clarion call. Every week we should be scrapping outdated regulations and announcing progress at Cabinet briefings. Instead, were drowning in bureaucracy while companies collapse.\n\nZimbabwe National Chamber of Commerce (ZNCC) president Tapiwa Karoro backed the demand, insisting that business leaders must have direct access to Mnangagwa because lower-level officials had failed to act.\n\nKuvarika also slammed the governments tendency to celebrate the performance of a few elite firms while ignoring struggling businesses. Lets be honest. It is the distressed companies that tell the real story of our economy. Instead of cherry-picking the success of blue-chip firms, we should be asking why so many others are on life support, she said.\n\nCEO Africa Roundtable chairman Oswell Binha was even more scathing, warning that the much-hyped stability is nothing but a faade.\n\nWe are deeply concerned about this so-called fragile stability, Binha said. The truth is we have a liquidity crunch, a manipulated exchange rate, and unsustainable domestic debt. On top of that, the Government owes exporters US$176 million. How can industry survive when the state itself is a bad debtor?\n\nHe blasted the government for decades of failure on energy reforms and accused authorities of paying lip service to regulatory and tax reform. He dismissed the de-dollarisation roadmap as toxic news for business.\n\nThe Government is crippling industry, Binha declared. Surrender requirements are expropriatory, and when the Government fails to pay the ZiG component on time, confidence collapses further. This is why we are sliding deeper into crisis. The delays are strangling liquidity and crushing operations.\n\nIndustry leaders warned that without Mnangagwas personal intervention, Zimbabwe risks plunging into a full-blown economic meltdown, with no clear recovery path in sight.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Correspondent Harare – Business leaders have issued a blunt warning that Zimbabwe’s economic turmoil is spiraling out of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/business-leaders-call-for-urgent-dialogue-with-mnangagwa-amid-deepening-economic-crisis/\">Continue reading<span class=\"screen-reader-text\"> \"Business Leaders Call For Urgent Dialogue With Mnangagwa Amid Deepening Economic Crisis\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Shock As Woman Stabs Lover",
            "url": "https://www.zimeye.net/2025/08/31/shock-as-woman-stabs-lover/",
            "content": "By A Correspondent\n\nHwange  A domestic row in Makwika Village ended in bloodshed last week after 32-year-old Eunice Ngwenya allegedly stabbed her boyfriend, Mbekezeli Sibanda (32), in a brutal attack that left him seriously injured.\n\nThe National Prosecuting Authority (NPA) said the incident occurred around 12:50 PM on 18 August 2025, as Ngwenya, Sibanda, and Ngwenyas sister walked together. The dispute reportedly started over Sibandas inner garment, which Ngwenya allegedly refused to hand back despite his repeated pleas.\n\nAccording to the NPA, Ngwenya later returned to her home in F18 Makwika Village while Sibanda waited outside on the verandah. Moments later, she came back holding the garment  but hidden inside it was a kitchen knife.\n\nWhen Sibanda reached for his clothing, Ngwenya allegedly drew the knife and stabbed him twice  once in the right arm and again in the chest.\n\nBleeding heavily, Sibanda attempted to seek assistance from a colleague but collapsed before reaching him. He eventually managed to get home, where a friend rushed him to report the case to police and seek medical treatment. A medical report confirming his injuries will be produced in court.\n\nNgwenya was arrested the same day and charged with attempted murder. She appeared before the Hwange Magistrates Court and was remanded in custody until 5 September 2025, pending further investigations.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Hwange – A domestic row in Makwika Village ended in bloodshed last week after 32-year-old Eunice Ngwenya … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/31/shock-as-woman-stabs-lover/\">Continue reading<span class=\"screen-reader-text\"> \"Shock As Woman Stabs Lover\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        },
        {
            "title": "Mnangagwa Grooming Military Son To Take Over Power",
            "url": "https://www.zimeye.net/2025/08/30/mnangagwa-grooming-military-son-to-take-over-power/",
            "content": "By A Correspondent President Emmerson Mnangagwa has fully integrated his soldier son, Major Sean Mnangagwa, into his inner security team in what insiders believe is a carefully choreographed plan to prepare him for eventual succession.\n\nSources within the military intelligence structure toldZimEyethat the President is grooming Sean, who serves in the Presidential Guard, to learn the intricacies of power and ultimately inherit the reins of state.\n\nThe Presidential Guard is a strategic battalion tasked with safeguarding the presidency and is central to both the personal security of the Head of State and the wider protection of Zimbabwes political establishment.\n\nAlthough it is not unusual for officers from the Guard to be deployed close to the President, Seans case is markedly different. Observers say his dual role as both the Head of States son and security officer creates a direct conflict of interest, blurring the lines between family loyalty and national duty.\n\nMilitary insiders allege that plans are already underway to elevate Sean to a senior rank  possibly brigadier or general  placing him in command of the Guard, which would cement his influence within the military chain of command and position him as a viable successor.\n\nSean has travelled with Mnangagwa on most official assignments since 2023, often acting as chief of security on local, regional, and international trips.\n\nThis week, he was part of the Presidents delegation to the Vatican, reinforcing perceptions that his father is deliberately exposing him to global diplomacy and high-level statecraft.\n\nBeyond his official role, Sean has reportedly been linked to business dealings with figures close to Mnangagwas administration, including controversial tycoon Kuda Tagwirei. According to sources, he and his twin brother Collins operate private offices guarded by state security where they vet investors seeking access to the President. Businesspeople are allegedly required to pay a fee before being granted an audience with Mnangagwa, raising concerns about a parallel power structure run by the First Family.\n\nPolitical analysts say these developments suggest that Mnangagwa is keen to secure dynastic continuity in much the same way other African leaders have attempted to entrench their children in politics and the military. What we are witnessing is a calculated attempt to merge state security with family interests, one analyst toldZimEye. By positioning his son in the Presidential Guard and giving him exposure to international affairs, Mnangagwa is effectively grooming him for eventual leadership.\n\nThe Presidents much-publicised Vision 2030  which aims to transform Zimbabwe into an upper middle-income economy  is also coming under scrutiny. Critics suggest that it may not only be an economic blueprint but also a political tactic designed to delay a genuine electoral contest while Mnangagwa buys time to prepare Sean for leadership. Some opposition figures argue that if elections are stalled or manipulated under the guise of pursuing long-term development, it could provide a convenient runway for Sean to grasp the concept of power before stepping into his fathers shoes.\n\nPresidential spokesperson, George Charamba, could not be reached for comment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – President Emmerson Mnangagwa has fully integrated his soldier son, Major Sean Mnangagwa, into his inner security team … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/30/mnangagwa-grooming-military-son-to-take-over-power/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Grooming Military Son To Take Over Power\"</span></a></p>",
            "time": "18:30",
            "date": "31 Aug 2025"
        }
    ]
}