{
    "news": [
        {
            "title": "Anti-Mnangagwa Group Plans to Disrupt Mutare Conference",
            "url": "https://www.zimeye.net/2025/10/12/anti-mnangagwa-group-plans-to-disrupt-mutare-conference/",
            "content": "By A Correspondent-A group opposed to President Emmerson Mnangagwas controversial 2030 agenda is reportedly planning to disrupt ZANU PFs annual national conference set to take place in Mutare this week.\n\nSources say the anti-Mnangagwa faction  made up of disgruntled senior officials and provincial delegates  intends to embarrass the President by derailing discussions at the conference, which runs from October 13 to 18 at the Mutare Polytechnic Pavilion Grounds.\n\nThe plan is reportedly part of a growing backlash against efforts by Mnangagwas loyalists to extend his rule beyond the constitutional two-term limit. Insiders toldZimEyethat some within the partys structures are mobilising quietly to resist the so-called 2030 agenda, which they view as unconstitutional and a direct threat to ZANU PFs internal democracy.\n\nTheres a serious mood of resistance building up, said one insider. The conference is no longer just a routine gathering  its a test of loyalty, and some are ready to defy orders from the top.\n\nTensions over the issue spilled into the open last week when ZANU PF Womens League boss, Mabel Chinomona, publicly warned against spoilers bent on sabotaging the event. Speaking at a Womens League empowerment programme at Chiwetu Training Centre in Makoni West Constituency, the visibly agitated politburo member read the riot act to party members.\n\nWe have the conference which is coming up in Mutare next week. We dont want people who are destroying our party. Dont destroy your own party, Chinomona said.I am ready to suspend people who are spreading falsehoods ahead of the conference. We dont want that, please.\n\nHer remarks exposed the growing panic within the ruling party as internal divisions threaten to overshadow Mnangagwas leadership ahead of the conference.\n\nThe tensions largely stem from a campaign by Mnangagwa loyalists pushing for a constitutional amendment that would allow him to stay in office until 2030. Senior party members opposed to the move argue that it violates the spirit of Zimbabwes 2013 Constitution, which restricts presidents to two five-year terms.\n\nIronically, Chinomona herself was part of the infamous 2004 Tsholotsho Declaration  a failed plot to alter ZANU PFs leadership structure in Mnangagwas favour  which led to her suspension along with several provincial chairpersons, including current Speaker of Parliament and now party secretary-general Jacob Mudenda.\n\nAt the same event in Makoni West, Information Minister Jenfan Muswere and ICT Minister Tatenda Mavetera  both known Mnangagwa loyalists  pledged allegiance to the President.\n\nWe have a training centre here at Chiwetu; its going to train women and youths, Muswere said, carefully avoiding the succession debate.Mavetera, however, was blunt: We are also saying that our President should rule until 2030.\n\nManicaland Provincial Affairs Minister Misheck Mugadza also called for unity and announced plans to build a rehabilitation centre in the province  a gesture seen as an attempt to downplay the rising tensions.\n\nHowever, behind the rhetoric of unity and development, the Mutare conference has become a battleground for power within ZANU PF. Party insiders say some provincial delegates aligned to Vice President Constantino Chiwengas faction may use procedural disruptions, walkouts, or coordinated protests to embarrass the President during the proceedings.\n\nIf the anti-Mnangagwa group succeeds, the Mutare conference could mark the most visible sign of defiance against Mnangagwas leadership since the 2017 military-assisted transition that brought him to power  exposing how deeply divided the ruling party has become over its future direction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-A group opposed to President Emmerson Mnangagwa’s controversial “2030 agenda” is reportedly planning to disrupt ZANU PF’s annual … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/12/anti-mnangagwa-group-plans-to-disrupt-mutare-conference/\">Continue reading<span class=\"screen-reader-text\"> \"Anti-Mnangagwa Group Plans to Disrupt Mutare Conference\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "VP Chiwenga Camp in New Anti-Mnangagwa Strategy",
            "url": "https://www.zimeye.net/2025/10/12/vp-chiwenga-camp-in-new-anti-mnangagwa-strategy/",
            "content": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PFs upcoming annual conference in Mutare amid reports that a faction aligned to Vice President Constantino Chiwenga is crafting a new strategy to derail Mnangagwas bid to extend his stay in power beyond 2028.\n\nZimEye can reveal that disgruntled ZANU PF officials  believed to be sympathetic to Chiwenga  are plotting to disrupt the Mutare conference, scheduled for October 1318, in protest against the controversial campaign to push Mnangagwas presidency to 2030.\n\nSources within the ruling party say the Chiwenga camp has quietly mobilised provincial delegates opposed to the 2030 Agenda, arguing that any attempt to amend the Constitution to extend Mnangagwas tenure undermines democratic principles and the partys legacy.\n\nTensions boiled oveer last week when ZANU PF Womens League boss, Mabel Chinomona, publicly warned against spoilers seeking to sabotage the conference. Speaking at a Womens League empowerment programme at Chiwetu Training Centre in Makoni West Constituency, the visibly agitated politburo member read the riot act to party members.\n\nWe have the conference which is coming up in Mutare next week. We dont want people who are destroying our party. Dont destroy your own party, she warned.I am ready to suspend anyone spreading falsehoods ahead of the conference.\n\nHer remarks exposed growing panic within ZANU PF as factional tensions threaten to overshadow Mnangagwas leadership ahead of the 22nd Annual National Peoples Conference, to be held at the Mutare Polytechnic Pavilion Grounds.\n\nThe fault lines have deepened over the push by Mnangagwa loyalists to engineer a constitutional amendment allowing him to remain in power until 2030  a move fiercely resisted by senior figures aligned to Chiwenga. The Vice Presidents allies argue that Mnangagwas insistence on extending his term violates the spirit of the 2013 Constitution and betrays the promise of leadership renewal made during the 2017 military intervention that ousted Robert Mugabe.\n\nIronically, Chinomona herself was part of the 2004 Tsholotsho Declaration  a failed bid to alter ZANU PFs leadership structure in Mnangagwas favour  which led to her suspension alongside other provincial chairpersons, including current Speaker of Parliament and now party secretary-general, Jacob Mudenda.\n\nAt the same event, Information Minister Jenfan Muswere and ICT Minister Tatenda Mavetera  both loyal to Mnangagwa  tried to project unity.\n\nWe have a training centre here at Chiwetu; its going to train women and youths, Muswere said, carefully avoiding the succession debate.Mavetera, however, was more direct, declaring: We are also saying that our President should rule until 2030.\n\nManicaland Provincial Affairs Minister Misheck Mugadza also attempted to strike a conciliatory tone, urging women to participate in empowerment projects while announcing plans to build a rehabilitation centre in the province.\n\nBut behind the scenes, the Mutare conference is shaping up to be a test of loyalty  and a potential battleground between Mnangagwas loyalists and Chiwengas camp. Party insiders say a silent rebellion is brewing, with some provincial delegates threatening a walkout should the 2030 agenda be tabled formally for endorsement.\n\nIf the Chiwenga faction succeeds in mobilising enough resistance, Mnangagwa could face his most embarrassing moment since the 2017 military-assisted transition that propelled him to power  exposing just how fractured the ruling party has become under his leadership.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PF’s upcoming annual conference in Mutare amid reports that a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/12/vp-chiwenga-camp-in-new-anti-mnangagwa-strategy/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Camp in New Anti-Mnangagwa Strategy\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "Mnangagwa Secures 2030 Endorsement",
            "url": "https://www.zimeye.net/2025/10/12/mnangagwa-secures-2030-endorsement/",
            "content": "By A Correspondent-Vice President Constantino Chiwengas hopes of succeeding President Emmerson Mnangagwa have suffered a major blow after ZANU PF announced plans to use its forthcoming annual conference to endorse Mnangagwas continued rule until 2030  effectively sidelining his deputy and cementing the presidents dominance over the ruling party.\n\nThe endorsement, to be formalized at the Mutare conference next week, marks a turning point in ZANU PFs succession politics and reinforces Mnangagwas control following months of factional tensions. It also follows last years controversial resolution to extend his leadership beyond the traditional two-term framework  a move that widened divisions between Mnangagwa loyalists and the camp aligned to Chiwenga.\n\nParty sources say infighting has intensified in recent months, spilling into heated Politburo meetings. In one such meeting last month, Chiwenga reportedly presented a dossier accusing some of Mnangagwas inner circle of grand corruption  an act interpreted by many as an open challenge to the presidents authority.\n\nBut in what analysts view as a strategic counterattack, ZANU PF spokesperson Christopher Mutsvangwa publicly reaffirmed the partys unwavering support for Mnangagwa, dismissing talk of factionalism and hinting that those harbouring presidential ambitions would be crushed by the collective will of the party.\n\nThe organs, the provinces and the party membership are quite happy with His Excellencys stewardship of the party and membership, Mutsvangwa toldThe Zimbabwe Independent.\n\nTheir dictum is: If it aint broke, why try to fix it? The delegates have expressly and vehemently resolved to continue with His Excellency till 2030. They have drowned out other noises of unbridled, undeserving and self-centred ambition.\n\nMutsvangwa said the Mutare conference would demonstrate party unity and silence critics, a statement interpreted as an indirect rebuke to Chiwengas faction.\n\nThe cacophony of social media trolling has no resonance in the closed membership of the organs, provinces and structures of ZANU PF, he added, describing dissenters as detractors, regime change practitioners and agents of political destabilisation.\n\nThe conference, to be held from next Friday to October 18 at the Mutare Polytechnic Pavilion Grounds, will bring together around 4,000 delegates under the themeAttainment of Vision 2030 Through Economic Empowerment and Value Addition.\n\nZANU PFs Director of Information and Publicity, Farai Marapira, also dismissed speculation about succession, emphasizing that the matter was not part of the conference agenda.\n\nSuccession is dealt with at congress, and we are not going to congress  we are going to a conference, Marapira said.\n\nThe issue of succession is not a concern within ZANU PF. We are simply going to check up on the mandate we received from the people in 2023.\n\nWhile Mnangagwas allies frame the 2030 agenda as a continuation of hisVision 2030economic blueprint, critics argue it is a calculated political manoeuvre to neutralize Chiwenga and tighten the presidents grip on power ahead of the 2027 elective congress.\n\nWith the Mutare conference expected to rubber-stamp the extension, Mnangagwa appears to have decisively outmanoeuvred his deputy  consolidating his hold on both the party and the state, and confirming that Chiwengas long-anticipated power bid has suffered a significant defeat.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Vice President Constantino Chiwenga’s hopes of succeeding President Emmerson Mnangagwa have suffered a major blow after ZANU PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/12/mnangagwa-secures-2030-endorsement/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Secures 2030 Endorsement\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "Zivhu Claims Recurring Dream Foretells Chiwenga Taking Over Zimbabwe",
            "url": "https://www.zimeye.net/2025/10/12/zivhu-claims-recurring-dream-foretells-chiwenga-taking-over-zimbabwe/",
            "content": "By A Correspondent\n\nControversial ZANU PF politician Killer Zivhu ignited widespread discussion on Thursday after revealing that he had a prophetic dream in which Vice President General Constantino Chiwenga ascends to Zimbabwes highest office.\n\nPosting on his official X account, Zivhu described the vision as recurring over several days, leaving him certain that Chiwenga is destined to become the countrys third president.\n\nIve had a recurring dream for days. In the dream, this man is destined to become our third president. Although I wasnt given a specific timeline, Im convinced it will happen  whether in 2035, 2040, or beyond. I saw a message in my dream indicating that its unstoppable, Zivhu wrote.\n\nThe post quickly went viral, attracting a mix of reactions online. While some social media users dismissed it as an attempt to grab attention, others viewed it as a bold prophecy hinting at potential political shifts within ZANU PF.\n\nZivhu, notorious for his outspoken views and history of stirring controversy, has once again put himself at the center of national discourse  this time by suggesting a future power change involving one of Zimbabwes most powerful political figures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial ZANU PF politician Killer Zivhu ignited widespread discussion on Thursday after revealing that he had a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/12/zivhu-claims-recurring-dream-foretells-chiwenga-taking-over-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Zivhu Claims Recurring Dream Foretells Chiwenga Taking Over Zimbabwe\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "Mnangagwa Boosts 2030 Agenda With Masowe 4ED Launch ?",
            "url": "https://www.zimeye.net/2025/10/12/mnangagwa-boosts-2030-agenda-with-masowe-4ed-launch/",
            "content": "By A Correspondent\n\nThe Masowe 4ED movement, a newly formed affiliate supporting President Emmerson Mnangagwa, is set for its official launch on November 29 in Glen Norah, Harare, signalling a fresh push for the Presidents Vision 2030 agenda.\n\nMasowe 4ED joins a growing network of 4ED affiliates that have emerged in recent years, all positioned as grassroots supporters of Mnangagwas leadership and long-term political vision.\n\nOrganisers of the launch said the movement aims to promote unity, peace, and development under the Presidents leadership. Yet some political analysts have voiced concern that such affiliates may be used to advance political agendas that stretch beyond constitutional limits.\n\nOne of the main issues with these 4ED affiliates is that they appear less about national development and more about cementing political loyalty, said an unnamed political observer. The timing and messaging clearly suggest an effort to shape public perception for extending Mnangagwas stay in power.\n\nAnother analyst added: Movements like Masowe 4ED are part of a broader strategy to manufacture grassroots legitimacy for a third-term agenda. Its political theatre dressed as citizen mobilisation.\n\nThe launch is expected to attract senior government officials, ruling party members, and religious leaders, underscoring ongoing efforts to consolidate support for Mnangagwas Vision 2030 across different sectors of society.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Masowe 4ED movement, a newly formed affiliate supporting President Emmerson Mnangagwa, is set for its official … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/12/mnangagwa-boosts-2030-agenda-with-masowe-4ed-launch/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Boosts 2030 Agenda With Masowe 4ED Launch ?\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "History Will Tell You, You Can Never Lead a People Who Reject You",
            "url": "https://www.zimeye.net/2025/10/11/history-will-tell-you-you-can-never-lead-a-people-who-reject-you/",
            "content": "By Engineer Jacob Kudzayi Mutisi |  History has always been a patient but firm teacher. It reminds us time and again that no leader, no matter how powerful, can rule over a population that does not want them. Leadership is not about coercion or control; it is about legitimacy, trust, and the consent of the governed.\n\nAcross generations and continents, the story has been the same. From monarchs who lost their thrones to presidents who fell from grace, the moment a leader loses the support of the people, their authority begins to crumble. You can silence voices, manipulate systems, and use force for a while  but you cannot extinguish the will of the masses forever.\n\nTrue leadership is earned, not imposed. It thrives on respect, service, and the ability to listen. When citizens begin to see leadership as self-serving, oppressive, or detached from their daily struggles, history starts counting down to an inevitable end.\n\nThose who ignore this lesson do so at their peril  because history will tell you, and tell the world, that you can never, and will never, lead a population that does not want you to rule.\n\nEngineer Jacob Kudzayi Mutisi\n\n +263 772 278 161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Engineer Jacob Kudzayi Mutisi | History has always been a patient but firm teacher. It reminds us time and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/history-will-tell-you-you-can-never-lead-a-people-who-reject-you/\">Continue reading<span class=\"screen-reader-text\"> \"History Will Tell You, You Can Never Lead a People Who Reject You\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "How Mnangagwa’s Getting Stopped On 17 Oct 2025’ According to Military Petitioner",
            "url": "https://www.zimeye.net/2025/10/11/how-mnangagwas-getting-stopped-on-17-oct-2025-according-to-military-petitioner/",
            "content": "17 Oct is the day ZANU PF members will be voting for Resolution 1 (to extend Mnangagwas presidency to 2030), and thats the day when people will go onto the streets, protesting against state capture and corruption, top petitioner, Gifford Gomwe tells ZimEye.\n\n17 Oct is the day ZANU PF members will be voting for Resolution 1 (to extend Mnangagwas presidency to 2030), and thats the day when people will go onto the streets, protesting against state capture and corruption, top petitioner, Gifford Gomwe tells ZimEyehttps://t.co/Hn8KhXSFAx\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "“17 Oct is the day ZANU PF members will be voting for Resolution 1 (to extend Mnangagwa’s presidency to 2030), … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/how-mnangagwas-getting-stopped-on-17-oct-2025-according-to-military-petitioner/\">Continue reading<span class=\"screen-reader-text\"> \"How Mnangagwa’s Getting Stopped On 17 Oct 2025’ According to Military Petitioner\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "Mwonzora in Embarrassing Maintenance Default Case",
            "url": "https://www.zimeye.net/2025/10/11/mwonzora-in-embarrassing-maintenance-default-case/",
            "content": "By Crime and Courts Reporter-MDC-T president Douglas Mwonzora has reportedly defaulted on child maintenance payments for five consecutive months, resulting in arrears amounting toUS$2,500.\n\nEfforts to establish from the Zimbabwe Republic Police (ZRP) why Mwonzora has not been arrested  nearly two months after a Harare magistrate issued a warrant of arrest  have so far been fruitless.\n\nNational police spokesperson, Commissioner Paul Nyathi, toldThe Masvingo Mirrorthat he would provide a response, but none had been received by the time of going to press.\n\nMwonzora confirmed the existence of a civil maintenance case but denied knowledge of any warrant of arrest.\n\nI havent received the warrant of arrest you are talking about. I dont deserve any warrant. This is a smear campaign, said Mwonzora.\n\nAccording to court records, Mwonzora was ordered in February 2024 to payUS$500monthly maintenance and school fees for his 10-year-old son withGetrude Chuma. The warrant was issued after he allegedly failed to make payments between March and July this year.\n\nThe arrears have since ballooned toUS$3,500, as Mwonzora has reportedly not paid maintenance for August and September either.\n\nChuma expressed frustration with police officers at Harare Central Police Station, accusing them of failing to serve the warrant on Mwonzora despite three attempts.\n\nThe matter is registered undercase number M389.\n\n Masvingo Mirror\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-MDC-T president Douglas Mwonzora has reportedly defaulted on child maintenance payments for five consecutive months, resulting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/mwonzora-in-embarrassing-maintenance-default-case/\">Continue reading<span class=\"screen-reader-text\"> \"Mwonzora in Embarrassing Maintenance Default Case\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "From Revelation to Manifestation: Matimbire Declares Mega 9 Will Shock the World",
            "url": "https://www.zimeye.net/2025/10/11/from-revelation-to-manifestation-matimbire-declares-mega-9-will-shock-the-world/",
            "content": "By A Correspondent\n\nHARARE  ProphetessMemory Matimbire, the  leader and founder ofDaughters of Virtue, says the success of the recently heldMega 8 All-Night Prayerat Glamis Arena was a direct result of divine wisdom  and not her own understanding.\n\nSpeaking after the event, which drew an estimated40,000 worshippers, Prophetess Matimbire said the overwhelming turnout and the miracles witnessed were evidence of Gods power at work.\n\nLet me be just with this issue  I dont want to do this with my own understanding and limit God, she said. The Bible teaches us that our faith must rest not on human wisdom, but on Gods power.\n\nQuoting from1 Corinthians 2:110, the Prophetess emphasized that true revelation comes only through the Spirit of God. There are things hidden from us that are only revealed by the Spirit, and the Bible says these are things no eye has seen or ear has heard, she added.\n\nProphetess Matimbire declared that next yearsMega 9will move from revelation to manifestation, promising an even greater outpouring of Gods glory.\n\nWhat Im promising for Mega 9, basing my faith on Christ Jesus, is that we are believing for what has never been heard or seen before. Mega 9 will reveal what no human mind has conceived, she said.\n\nThe Mega 8 event featured international guest ministersApostle Michael OrokpoandPastor Isaac Oyedepofrom Nigeria, alongside Zimbabwean preachersPastor Tom Deuschle,Bishop Never Muparutsa, andProphetess Matimbireherself.\n\nMusic ministersEbuka Songs,Minister GUC,Dorcas Moyo, andTakesure Zamaralso delivered powerful performances that kept worshippers in high praise throughout the night.\n\nReflecting on the nights impact, Prophetess Matimbire said, God moves us from one level of glory to another. What He did at Mega 8 was beyond what we dreamed of  and Mega 9 will go even higher.\n\nShe concluded with a bold proclamation: Mega 9 will shock the world, because it will not be by our might, but by the Spirit of God.\n\nTheMega All-Night Prayer, hosted annually byDaughters of Virtueunder theHebron Art of Prayer International Ministries, has grown into one of Zimbabwes largest and most anticipated faith gatherings.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Prophetess Memory Matimbire, the leader and founder of Daughters of Virtue, says the success of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/from-revelation-to-manifestation-matimbire-declares-mega-9-will-shock-the-world/\">Continue reading<span class=\"screen-reader-text\"> \"From Revelation to Manifestation: Matimbire Declares Mega 9 Will Shock the World\"</span></a></p>",
            "time": "18:33",
            "date": "12 Oct 2025"
        },
        {
            "title": "Did Benny Hinn Heal Auxillia And Grace Mugabe Relationship Or He Just Used Them?",
            "url": "https://www.zimeye.net/2025/10/11/did-benny-hinn-heal-auxillia-and-grace-mugabe-relationship-or-he-just-used-them/",
            "content": "Did Benny Hinn heal Auxillia and Grace Mugabes relationship whove been seen eating and drinking for years together?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "18:33",
            "date": "12 Oct 2025"
        }
    ]
}