{
    "news": [
        {
            "title": "Four Die In Bus, Tractor Collision",
            "url": "https://www.zimeye.net/2025/05/26/four-die-in-bus-tractor-collision/",
            "content": "By A Correspondent\n\nFour people lost their lives and more than 40 others were injured in a horrific road accident that occurred on Monday along the Masvingo-Mbalabala Highway, when a Govasberg bus collided with a tractor.\n\nThe collision happened under unclear circumstances, resulting in significant damage to the front of the bus and causing widespread injuries among passengers.\n\nEmergency services were quickly dispatched to the scene and confirmed the deaths, while the injured were transported to nearby hospitals for treatment.\n\nAuthorities have launched an investigation to determine the cause of the crash.\n\nWhile specific details are still emerging, the incident has highlighted concerns over road safety on highways shared by both fast and slow-moving vehicles such as buses and tractors.\n\nMore information, including the identities of the deceased and the condition of the injured, is expected to be released as investigations continue.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Four people lost their lives and more than 40 others were injured in a horrific road accident … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/four-die-in-bus-tractor-collision/\">Continue reading<span class=\"screen-reader-text\"> \"Four Die In Bus, Tractor Collision\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Tagwirei Bribes Junta",
            "url": "https://www.zimeye.net/2025/05/26/tagwirei-bribes-junta/",
            "content": "By James Gwati-Kudakwashe Tagwirei, the controversial oil tycoon, presidential ally, and alleged architect of grand-scale corruption in Zimbabwe, is now accused of deepening his ties with the military as part of a calculated power play to position himself for political office.\n\nLast week, Tagwirei orchestrated a high-profile event in Masvingo under the guise of a youth empowerment and land tenure programme. But behind the scenes, the gathering served as a soft launch for his political ambitions, an ambition reportedly enjoying the quiet endorsement of President Emmerson Mnangagwa, much to the chagrin of Vice President Constantino Chiwenga.\n\nIn a telling development, the wife of Presidential Guard Commander Brigadier General Fidelis Mhonda, Nyasha Mhonda, was a key figure in organising the event. Sources saidshe handled critical logistical arrangements and managed the guest list. Nyasha Mhonda was visibly present at the function, wearing a beret emblazoned with ED, Mnangagwas initials, cementing suspicions that the President is backing Tagwireis quiet power grab.\n\nFurther controversy surrounds claims by outspoken war veteran Blessed Runesu Geza, who recently alleged that Tagwirei is paying Brigadier General Mhonda a staggering US$25,000 per month for protection. The allegation suggests that Zimbabwes security apparatus is now on the payroll of an unelected businessman who is using state machinery to entrench his political interests.\n\nThe event, held under the banner of the Land Tenure Implementation Leadership Success Series Programme, was attended by senior government and ZANU PF officials, including Masvingo Minister of State Ezra Chadzamira, ZANU PF provincial chairperson Rabison Mavhenyengwa and his deputy, Trust Mugabe, as well as one of the Prisons and Correctional Services bosses, Stanley Kondongwe.\n\nThe initiativeled by Tagwireis newly formed Land Tenure Implementation Committeeis being implemented in partnership with the Ministry of Information Communication Technology, headed by youthful Minister Tatenda Mavetera. Framed as a national programme to empower youth through land, the scheme has drawn sharp criticism from war veterans, who view it as a potential reversal of the chaotic land reform programme of the 2000s.\n\nTagwirei has long been the poster child of state-capture in Zimbabwe. He rose to prominence through Sakunda Holdings, a company that was awarded multi-billion-dollar fuel importation deals and command agriculture contracts without public tender. Under the Mnangagwa administration, Tagwirei has enjoyed unchecked access to state contracts, allegedly inflating prices and receiving preferential treatment from the Reserve Bank of Zimbabwe.\n\nHis business empire spans fuel, mining, banking, and agricultureoften linked to controversial asset transfers involving the state. A 2021United States Treasuryreport sanctioned Tagwirei for corruption, accusing him of using his close ties to the government to gain exclusive access to hard currency and corruptly acquire state assets.\n\nDespite mounting evidence of his influence-peddling, Tagwirei remains untouchable in Zimbabwe, protected by his financial contributions to ZANU PF campaigns and now, it appears, by direct military backing.\n\nTagwireis growing involvement in party politics, including reported efforts to secure a seat on the ZANU PF Central Committee in Masvingo and Harare provinces, has added fuel to speculation that he is being groomed as a successor to Mnangagwa. His land tenure events are now viewed as campaign-style rallies designed to build a grassroots base and curry favour with traditional leaders and war veterans.\n\nPolitical observers say his meteoric rise could trigger internal divisions within ZANU PF, particularly from the military faction aligned to Chiwenga, who sees himself as the rightful heir to Mnangagwa.\n\nYet by bribing generals and co-opting the military elite, Tagwirei is playing a dangerous gameone that could deepen Zimbabwes political instability and entrench oligarchic rule under the veneer of populist empowerment rhetoric.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By James Gwati-Kudakwashe Tagwirei, the controversial oil tycoon, presidential ally, and alleged architect of grand-scale corruption in Zimbabwe, is now … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/tagwirei-bribes-junta/\">Continue reading<span class=\"screen-reader-text\"> \"Tagwirei Bribes Junta\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Yesteryear Musician Stranded",
            "url": "https://www.zimeye.net/2025/05/26/yesteryear-musician-stranded/",
            "content": "By Showbiz Reporter- Veteran musician and mentor to some of Zimbabwes music legends,Shepherd Chinyani, has fallen on hard times. The Vhuka Boys frontman, once a pillar of the local music scene, is now broke, battling illness, and living in ruralSekeafter selling his Harare home.\n\nIn a recent interview withZimpapers Arts and Entertainment Hub, Chinyani, 66, expressed heartbreak over what he describes as abandonment by some of the very artists he helped nurture in the early days of their careers.\n\nI feel betrayed, he said, sounding disheartened. Some of the musicians I mentored have forgotten about me.\n\nChinyani, who spent 65 years as an urban resident, recently relocated to Seke, calling it his new home. He previously lived inDzivaresekwa, Harare, where he not only built his music career but also provided for some of Zimbabwes greatest artiststhe late John Chibadura and Tinei Chikupo, as well as living legendsMadzibaba Nicholas Zakaria andAlick Macheso.\n\nI supported some of these artists even though they were older than me, he said. But misfortune struck.\n\nChinyani sold his Dzivaresekwa house in 2022 forUS$18,000, citing the rising cost of living and mounting medical expenses.\n\nI moved to Seke near Besa Primary School with my two wives, he said. City life had become unbearable, and I needed to pay medical bills and secure shelter for my family.\n\nHowever, life in the communal lands has not brought the relief he hoped for. With no steady source of income, Chinyani said he and his family now survive by Gods grace.\n\nRight now, Im confined because of an infection in my leg, and my wife is battling breast cancer, he said. Its a grim situation. We live from hand to mouth, unlike in Dzivaresekwa where I used to make a little money repairing damaged speakers and guitars.\n\nHis home in Seke is also far from complete.\n\nI have a place to stay, but one side of the house needs roofing and the floors arent finished. Unfortunately, I just dont have the money.\n\nDespite his circumstances, Chinyaniwho turns67 on June 14remains eager to return to what he knows best: music and mentoring.\n\nMusic has been my life since childhood. I have a passion for teaching young people, and I see a lot of talent in this area. But I have no equipment, he said. I sold most of my sound system to feed my family. All I have left is my guitar.\n\nChinyani reflects on his decision with mixed feelings.\n\nSometimes I regret selling the house. But I had no choiceit was about saving lives. I have 12 children and 29 grandchildren. I also dreamed of building a bigger home where we could all live together. At the time, this seemed like the only option.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter- Veteran musician and mentor to some of Zimbabwe’s music legends, Shepherd Chinyani, has fallen on hard times. The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/yesteryear-musician-stranded/\">Continue reading<span class=\"screen-reader-text\"> \"Yesteryear Musician Stranded\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Munashe Garan’anga Wins Danish Superliga Title with FC Copenhagen",
            "url": "https://www.zimeye.net/2025/05/26/munashe-garananga-wins-danish-superliga-title-with-fc-copenhagen/",
            "content": "Sports Correspondent\n\nZimbabwean defender Munashe Garananga has added another accolade to his growing career after winning the 2024/25 Danish Superliga title with FC Copenhagen.\n\nGarananga, who joined the Danish giants at the beginning of the season from Belgian side KV Mechelen, celebrated his first piece of silverware in Denmark as Copenhagen clinched the title with a commanding 3-0 victory over Nordsjlland on the final day of the season.\n\nAlthough the 24-year-old was an unused substitute in the decisive match, he played his part throughout the campaign, making eleven league appearances in his debut season.\n\nThis marks the second league title in Garanangas career, having previously lifted the Moldovan Super Liga with FC Sheriff Tiraspol.\n\nIts an incredible feeling to be part of a title-winning team again, Garananga said. Even though I didnt play in the final match, Im proud of what we achieved together as a squad this season.\n\nThe triumph adds another milestone to Garanangas journey as he continues to make strides in European football while flying the Zimbabwean flag high.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwean defender Munashe Garan’anga has added another accolade to his growing career after winning the 2024/25 Danish Superliga … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/munashe-garananga-wins-danish-superliga-title-with-fc-copenhagen/\">Continue reading<span class=\"screen-reader-text\"> \"Munashe Garan’anga Wins Danish Superliga Title with FC Copenhagen\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Mnangagwa’s New Law Forces Motorists to Pay Radio Licence Fees Before ZINARA and Insurance",
            "url": "https://www.zimeye.net/2025/05/26/mnangagwas-new-law-forces-motorists-to-pay-radio-licence-fees-before-zinara-and-insurance-2/",
            "content": "By A Correspondent\n\nA controversial amendment to the Broadcasting Services Act now requires Zimbabwean motorists to pay compulsory radio licence fees before being allowed to obtain ZINARA licences and ones motor vehicle insurance an unprecedented move that has sparked widespread criticism.\n\nThe new law, published under General Notice 1034 of 2025 and titled the Broadcasting Services Amendment Act (No. 2 of 2025), was assented to by President Emmerson Mnangagwa and announced on May 23 by Chief Secretary to the President and Cabinet, Dr. M. Rushwaya.\n\nCritics have described the amendment as detached from reality and burdensome, particularly in a fragile economy where many Zimbabweans already struggle with the cost of living.\n\nFormer Citizens Coalition for Change (CCC) youth assembly spokesperson, Stephen Sarkozy Chuma, slammed the move as repressive.\n\nThis is unacceptable, Chuma said. The regime is using force to rape citizens rights with every passing day. Those who clapped for Mr Mnangagwa are now sulking.\n\nDespite mounting outrage, the ruling Zanu PF party has backed the legislation, defending it as a necessary step to ensure the sustainability of public broadcasting services.\n\nSupporters of the law argue it will secure funding for national broadcasters. However, critics warn that the measure adds yet another financial burden on already overtaxed citizens and deepens public mistrust in the government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A controversial amendment to the Broadcasting Services Act now requires Zimbabwean motorists to pay compulsory radio licence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/mnangagwas-new-law-forces-motorists-to-pay-radio-licence-fees-before-zinara-and-insurance-2/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s New Law Forces Motorists to Pay Radio Licence Fees Before ZINARA and Insurance\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Mnangagwa’s New Law Forces Motorists to Pay Radio Licence Fees Before ZINARA and Insurance",
            "url": "https://www.zimeye.net/2025/05/26/mnangagwas-new-law-forces-motorists-to-pay-radio-licence-fees-before-zinara-and-insurance/",
            "content": "By A Correspondent\n\nA controversial amendment to the Broadcasting Services Act now requires Zimbabwean motorists to pay compulsory radio licence fees before being allowed to obtain ZINARA licences and ones motor vehicle insurance an unprecedented move that has sparked widespread criticism.\n\nThe new law, published under General Notice 1034 of 2025 and titled the Broadcasting Services Amendment Act (No. 2 of 2025), was assented to by President Emmerson Mnangagwa and announced on May 23 by Chief Secretary to the President and Cabinet, Dr. M. Rushwaya.\n\nCritics have described the amendment as detached from reality and burdensome, particularly in a fragile economy where many Zimbabweans already struggle with the cost of living.\n\nFormer Citizens Coalition for Change (CCC) youth assembly spokesperson, Stephen Sarkozy Chuma, slammed the move as repressive.\n\nThis is unacceptable, Chuma said. The regime is using force to rape citizens rights with every passing day. Those who clapped for Mr Mnangagwa are now sulking.\n\nDespite mounting outrage, the ruling Zanu PF party has backed the legislation, defending it as a necessary step to ensure the sustainability of public broadcasting services.\n\nSupporters of the law argue it will secure funding for national broadcasters. However, critics warn that the measure adds yet another financial burden on already overtaxed citizens and deepens public mistrust in the government.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A controversial amendment to the Broadcasting Services Act now requires Zimbabwean motorists to pay compulsory radio licence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/mnangagwas-new-law-forces-motorists-to-pay-radio-licence-fees-before-zinara-and-insurance/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s New Law Forces Motorists to Pay Radio Licence Fees Before ZINARA and Insurance\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Mnangagwa Praises Self For Promoting Peace In Country Despite Destroying Democracy",
            "url": "https://www.zimeye.net/2025/05/26/mnangagwa-praises-self-for-promoting-peace-in-country-despite-destroying-democracy/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has hailed himself as a promoter of peace and national development, despite mounting criticism over his administrations crackdown on democratic processes and civic freedoms.\n\nSpeaking during a tour of his Precabe Farm in Kwekwe on Sunday, where he hosted Zanu PF Central Committee members, Mnangagwa praised the prevailing peace in Zimbabwe and claimed it has laid the foundation for rapid development.\n\nI am satisfied with the peace that is prevailing in our country. It is this peace that has enabled us to achieve development at a faster pace, Mnangagwa said.\n\nHowever, critics argue that this so-called peace has come at the expense of democratic integrity. A local think tank recently described Zanu PF as anti-democracy, citing increasing repression of dissent, shrinking media freedom, and politically motivated arrests.\n\nIn his address, Mnangagwa also shifted focus to agriculture, urging party members to learn from successful farmers like himself. Each time you plant, you should aim to achieve better results than in the previous farming season, he advised.\n\nHe went on to express concern over Zimbabwes dependence on food imports. A nation should be fed by its own people, he declared. That is why here at Precabe, we are committed to producing crops all year round.\n\nDespite his self-congratulatory tone, Mnangagwas remarks have drawn backlash from civil society groups, who accuse his government of undermining democracy under the guise of stability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has hailed himself as a promoter of peace and national development, despite mounting criticism … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/mnangagwa-praises-self-for-promoting-peace-in-country-despite-destroying-democracy/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Praises Self For Promoting Peace In Country Despite Destroying Democracy\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Zim Now A Crime Scene, Nelson Chamisa  Rejects Mandatory Payment Of ZBC Licences",
            "url": "https://www.zimeye.net/2025/05/26/zim-now-a-crime-scene-nelson-chamisa-rejects-mandatory-payment-of-zbc-licences/",
            "content": "By Tinashe Sambiri\n\nOpposition leader Advocate Nelson Chamisa has strongly condemned the governments move to compel motorists to pay ZBC radio licences before they can renew their ZINARA vehicle licences and insurance.\n\nIn a statement released on Monday, Chamisa described the policy, recently signed into law under President Emmerson Mnangagwas administration, as oppressive and disconnected from the struggles of ordinary citizens.\n\nA NEW LAW requiring motorists to buy radio licence before renewing their vehicle licences that has been signed into law is too draconian, anti-citizens and outrightly heartless, said Chamisa.\n\nHe criticized the increasing financial burden placed on motorists, questioning the logic behind multiple compulsory fees.\n\nSo a person who owns a car pays Zinara, ZBC, Insurance and toll gate, how are people supposed to survive? When shall all this end? Citizens are being pauperized left, right and centre, why does the citizenry of this country deserve so uncaring & heartless a leadership? he said.\n\nChamisa also challenged the relevance of the ZBC licence fee, arguing that citizens should not be forced to fund what he called partisan content.\n\nWhat are people supposed to do with all this cruel taxation? Why must I pay for a service I dont use? Why should I pay for partisan propaganda, where I am attacked in person and demonized from dawn to dusk? he asked.\n\nHe further questioned the role of Parliament in safeguarding citizens rights and labelled the situation in Zimbabwe as a crime scene.\n\nDo we have a parliament in Zimbabwe? Which other country does this to her citizens? Is this not naked provocation? Is Zimbabwe not a crime scene? Chamisa said.\n\nThe statement comes amid growing public outcry over the increasing cost of living and what many see as excessive taxation measures.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Opposition leader Advocate Nelson Chamisa has strongly condemned the government’s move to compel motorists to pay ZBC … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/zim-now-a-crime-scene-nelson-chamisa-rejects-mandatory-payment-of-zbc-licences/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Now A Crime Scene, Nelson Chamisa  Rejects Mandatory Payment Of ZBC Licences\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Man Brutally Killed Over Braai Meat in Inyati",
            "url": "https://www.zimeye.net/2025/05/26/man-brutally-killed-over-braai-meat-in-inyati/",
            "content": "By A Correspondent\n\nA tragic incident has rocked the Inyati community after the body of 33-year-old Shepherd Mashava was discovered floating in the Mwarazi River, days after he went missing following a violent altercation.\n\nMashava was last seen on May 17 at Chinyudze Business Centre, where he was allegedly assaulted by a man identified as James George during a heated dispute over braai meat at a local sports bar. He never returned home, prompting a search that ended in the grim discovery of his body.\n\nThe Zimbabwe Republic Police confirmed the incident and said investigations are ongoing. We are treating this matter seriously and urge anyone with information to come forward and report to the nearest police station, the ZRP said in a statement.\n\nThe incident has shocked residents in the area, who are calling for justice and tighter security at public gathering spots.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident has rocked the Inyati community after the body of 33-year-old Shepherd Mashava was discovered … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/man-brutally-killed-over-braai-meat-in-inyati/\">Continue reading<span class=\"screen-reader-text\"> \"Man Brutally Killed Over Braai Meat in Inyati\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        },
        {
            "title": "Two Chinese Businessmen Up For Import Duty Fraud",
            "url": "https://www.zimeye.net/2025/05/26/two-chinese-businessmen-up-for-import-duty-fraud/",
            "content": "By Crime and Courts Reporter- The Zimbabwe Anti-Corruption Commission (ZACC) has arrested Gan Zhewen, Lin Hui, Bi Yanyan and Arnold Mlambo for import duty fraud.\n\nThe four allegedly imported 1,342 cartons of suitcase accessories and falsified import documents claiming they were importing fertiliser distributors and steel tubes in order to benefit from duty exemptions for agricultural imports.\n\nThe consignment was cleared without inspection, with the accused persons only paying USD 4,531.00 in Value Added Tax (VAT), prejudicing the State of USD 163,550.00 in import duty and VAT.\n\nZIMRA uncovered the scandal, impounded the goods, and reported the matter to ZACC, leading to the arrest of the accused persons.\n\nThey have since appeared at Harare Magistrates Court and were remanded to 23 June 2025 on USD 150.00 bail.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- The Zimbabwe Anti-Corruption Commission (ZACC) has arrested Gan Zhewen, Lin Hui, Bi Yanyan and Arnold … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/26/two-chinese-businessmen-up-for-import-duty-fraud/\">Continue reading<span class=\"screen-reader-text\"> \"Two Chinese Businessmen Up For Import Duty Fraud\"</span></a></p>",
            "time": "20:45",
            "date": "27 May 2025"
        }
    ]
}