{
    "news": [
        {
            "title": "Simba Bhora Set for $100,000 Boost Ahead of CAF Champions League Debut",
            "url": "https://www.zimeye.net/2025/08/13/simba-bhora-set-for-100000-boost-ahead-of-caf-champions-league-debut/",
            "content": "By Sports Correspondent\n\nSimba Bhora are set to receive a financial windfall of USD 100,000 from the Confederation of African Football (CAF) as they prepare for their maiden CAF Champions League campaign.\n\nThe Shamva-based side, crowned 2024 Castle Lager Premier Soccer League champions, will represent Zimbabwe in the prestigious continental competition.\n\nCAF announced after the preliminary draw held over the weekend that all teams eliminated in either of the first two rounds will each receive USD 100,000 to help cover logistical expenses.\n\nThe initiative aims to ease the financial burden on clubs and encourage greater participation in African club tournaments.\n\nSimba Bhora will kick off their journey against Eswatinis Nsingizi Hotspurs in the first preliminary round. They will host the first leg between September 19 and 22 before travelling for the return fixture the following week.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Simba Bhora are set to receive a financial windfall of USD 100,000 from the Confederation of African … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/simba-bhora-set-for-100000-boost-ahead-of-caf-champions-league-debut/\">Continue reading<span class=\"screen-reader-text\"> \"Simba Bhora Set for $100,000 Boost Ahead of CAF Champions League Debut\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "ZIFA Launches Nationwide Scouting Drive for U17 Boys National Team",
            "url": "https://www.zimeye.net/2025/08/13/zifa-launches-nationwide-scouting-drive-for-u17-boys-national-team/",
            "content": "By Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has outlined its selection strategy for the U17 Boys National Team ahead of the COSAFA U17 Boys Championship, set to take place in Zimbabwe from 11 to 20 September 2025.\n\nTo prepare for the high-profile regional tournament, ZIFA has appointed a panel of seasoned coaches  Thulani Sibanda, Norman Edward Taruvinga, Backlyfield Chivenga and Jatson Maposa  to spearhead a countrywide talent identification and assessment programme.\n\nThe coaches will embark on a nationwide tour from 18 to 20 August 2025, evaluating shortlisted players for the final squad. The selection process will place emphasis on technical skill, tactical understanding, physical fitness, and the mental strength required for top-level competition.\n\nZIFA says the initiative reflects its commitment to building competitive national teams through transparent, merit-based selection processes that give every talented young player a fair chance to represent Zimbabwe.\n\nThe association also encouraged football academies, schools, and community clubs to support the programme by releasing players for assessments and ensuring they are prepared both physically and mentally. Fans have been urged to rally behind the team as Zimbabwe prepares to host the tournament, which is expected to attract scouts and football enthusiasts from across the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent The Zimbabwe Football Association (ZIFA) has outlined its selection strategy for the U17 Boys National Team ahead … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/zifa-launches-nationwide-scouting-drive-for-u17-boys-national-team/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Launches Nationwide Scouting Drive for U17 Boys National Team\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "Preventing Cannibalism in Chickens…",
            "url": "https://www.zimeye.net/2025/08/13/preventing-cannibalism-in-chickens/",
            "content": "Preventing Cannibalism in Chickens\n\nBy Dr Trywell Muzerengi\n\nCannibalism in chickens is a serious behavioral issue that can lead to injury, disease, and reduced productivity in a flock. Understanding its causes and implementing effective management strategies is essential for healthy poultry farming.\n\nCauses of Cannibalism in Chickens\n\nConsequences of Cannibalism\n\nPrevention and Management Strategies\n\nAdditional Considerations\n\nBy addressing these factors, poultry farmers can reduce cannibalism, protect flock health, enhance welfare, and improve overall productivity.\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Preventing Cannibalism in Chickens… By Dr Trywell Muzerengi Cannibalism in chickens is a serious behavioral issue that can lead to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/preventing-cannibalism-in-chickens/\">Continue reading<span class=\"screen-reader-text\"> \"Preventing Cannibalism in Chickens…\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "Mnangagwa’s Roadmap To Disaster – Government Insists On Total Removal Of US Dollar",
            "url": "https://www.zimeye.net/2025/08/13/mnangagwas-roadmap-to-disaster-government-insists-on-total-removal-of-us-dollar/",
            "content": "By A Correspondent\n\nThe Reserve Bank of Zimbabwe (RBZ) is pushing forward with a plan to transition from a multicurrency regime to a domestic monetary system by 2030, despite concerns about potential risks and challenges.\n\nAccording to RBZ Governor Dr. John Mushayavanhu, The road map will crystalise in the National Development Strategy 2, under the stewardship of the RBZ, which chairs the NDS2 Thematic Working Group on Macroeconomic Stability and Financial Deepening (MESFIND).\n\nHe added that while the policys ultimate goal is clear, its design will undoubtedly encapsulate the need to maintain current stability, preserve foreign currency accounts and respect existing USD-denominated contracts.\n\nHowever, stakeholders have expressed concerns about the fate of their foreign-currency deposits once the multi-currency system expires in 2030.\n\nStakeholders relayed concerns about their foreign-currency deposits at the end of the multi-currency system in 2030, Dr. Mushayavanhu said, sparking demands for legally binding guarantees.\n\nRBZ Deputy Governor Dr. Innocent Matshe acknowledged the challenges posed by low liquidity, saying, This economy is affected by low liquidity, especially in US dollars, which we cannot control at all. He believes that de-dollarization is the best route to gain control over monetary policy and drive economic growth.\n\nThe plan to remove the US dollar could lead to market instability, decreased investor confidence, and increased volatility in the stock exchange. The transition could also lead to higher inflation if not managed properly, and Zimbabwe has experienced high inflation in the past.\n\nWhile the governments plan to transition to a domestic monetary system may have good intentions, it is crucial to address the concerns and challenges associated with de-dollarization to avoid potential risks and instability.\n\nThe RBZ needs to refine the timeline and implementation details, build adequate foreign exchange reserves, and ensure policy consistency to make the transition successful.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Reserve Bank of Zimbabwe (RBZ) is pushing forward with a plan to transition from a multicurrency … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/mnangagwas-roadmap-to-disaster-government-insists-on-total-removal-of-us-dollar/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Roadmap To Disaster – Government Insists On Total Removal Of US Dollar\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "Picture: Is Chivayo Capturing President William Ruto?",
            "url": "https://www.zimeye.net/2025/08/13/picture-is-chivayo-capturing-president-william-ruto/",
            "content": "By A Correspondent\n\nHARARE  A photograph of controversial Zimbabwean businessman Wicknell Chivayo with Kenyan President William Ruto has ignited debate over his visit to Nairobis State House.\n\nChivayo, who is known for securing high-value but often controversial government tenders in Zimbabwe and for his close ties to President Emmerson Mnangagwa, took to Facebook on Monday to boast about the meeting.\n\nHappy Heroes Day from my second home, Kenya, he wrote. Always a pleasure paying a courtesy call on the President and First Lady.\n\nThe post quickly went viral, with many questioning the purpose of Chivayos visit and whether it involved business, politics, or both.\n\nWhile Chivayo appeared relaxed and upbeat in the photo, the Office of the President of Kenya has not issued any statement on the matter, leaving room for speculation.\n\nPolitical analysts noted that the optics of the meeting could raise eyebrows in both Zimbabwe and Kenya, given Chivayos history of controversial dealings.\n\nFor now, the details of his courtesy call remain a mystery.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – A photograph of controversial Zimbabwean businessman Wicknell Chivayo with Kenyan President William Ruto has ignited … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/picture-is-chivayo-capturing-president-william-ruto/\">Continue reading<span class=\"screen-reader-text\"> \"Picture: Is Chivayo Capturing President William Ruto?\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "Gorimbo vs Jay Israel: MMA Star Responds to Church Leader’s Allegations",
            "url": "https://www.zimeye.net/2025/08/13/gorimbo-vs-jay-israel-mma-star-responds-to-church-leaders-allegations/",
            "content": "By A Correspondent\n\nChurch leader Jay Israel Senior has publicly condemned Zimbabwean Mixed Martial Arts fighter Themba Gorimbo, accusing him of undermining the authority of President Emmerson Mnangagwa.\n\nIn a statement posted on Facebook, Jay Israel Senior addressed Gorimbo directly:\n\nDear Themba Gorimbo, your conduct is deeply unacceptable for someone who claims to be representing Zimbabwe on the world stage, particularly in the United States of America. As a public figure and role model, your actions carry weight far beyond your personal circle. What example are you setting for the young Zimbabwean youths who look up to you? What message are you sending to a nation that takes pride in its ambassadors abroad? What image are you painting of Zimbabwe to the international community?\n\nHe continued:\n\nFurthermore, such cussing insults directed at our President are wholly unacceptable and cannot be condoned under any circumstances. The Office of the President is a symbol of our nations unity, sovereignty, and dignity. To demean it through vulgar language is to undermine the respect that every Zimbabwean should uphold, both at home and abroad. Our country deserves to be represented with honour, discipline, and unwavering patriotism at all times.\n\nJay Israel Senior added:\n\nDear Zimbabweans  never insult the highest office of the land. Themba Gorimbo is a sellout and a puppet of the colonial masters bankrolling him to insult the President and government of Zimbabwe. It is true that I told Themba Gorimbo he will never set foot in Zimbabwe or South Africa as long as he continues his open campaign of vulgar insults against the President of Zimbabwe. This is not a threat, but a stand for the dignity of our Head of State and the lawful order of our nation.\n\nHe further explained:\n\nThemba has, on numerous occasions, used obscene and degrading language to describe the President, a conduct which I have documented and forwarded in full to the relevant authorities. This matter is now in the hands of those empowered to uphold our laws. Let it be known: Zimbabwe has freedom of speech, but not freedom of insults. Section 33 of the Criminal Law (Codification and Reform) Act [Chapter 9:23] makes it a criminal offence to publicly insult, undermine, or make abusive statements about the President or the office of the President. These provisions exist not to silence political debate, but to safeguard the dignity of our highest office and the sovereignty of our state.\n\nHe continued with a caution to the public:\n\nIf this kind of behaviour is not addressed by the law, it will embolden others to believe that vulgar attacks on our leaders are acceptable. That is how nations lose respect for themselves and for the very institutions that guarantee their stability. To all Zimbabweans: criticism is your right. Insults are a crime. Patriotism means disagreeing with dignity, not dragging your own nations image into the mud for entertainment or foreign applause. The dignity of Zimbabwes President, Government, and sovereignty will be defended without fear or favour, at all costs.\n\nHowever, Gorimbo responded:\n\nThis guy threatened me and my family in and out of Zimbabwe. If anything happens to me or any of my family memberseven a distant cousinyou will be held liable. Now that your threats are received, I take them seriously. Better be informed that even if any of my relatives cough, its on you, as we will be on high alert. I spoke and represented myself, not anybody elses family members.\n\nGorimbo continued:\n\nThe President is pictured with such a human, which raises questions Wonder what kind of pastors these people are.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Church leader Jay Israel Senior has publicly condemned Zimbabwean Mixed Martial Arts fighter Themba Gorimbo, accusing him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/gorimbo-vs-jay-israel-mma-star-responds-to-church-leaders-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Gorimbo vs Jay Israel: MMA Star Responds to Church Leader’s Allegations\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "Masvingo By-Election Countdown: Nomination Papers Due Thursday",
            "url": "https://www.zimeye.net/2025/08/13/masvingo-by-election-countdown-nomination-papers-due-thursday/",
            "content": "By A Correspondent\n\nMASVINGO  Nomination papers for the Masvingo Ward 7 by-election are set to be filed on Thursday, 14 August, at the Civic Centre in Masvingo, with all prospective candidates expected to submit their documents.\n\nZanu PF will be represented by local businessman Simbarashe Shonhiwa, popularly known as Gweja, who is seeking the seat.\n\nAccording to the Zimbabwe Electoral Commission (ZEC), candidates must provide:\n\nA photocopy of Birth Certificate\n\nA photocopy of National ID\n\nPassport size photographs\n\nCorrectly completed nomination papers\n\nThe submissions will take place at the Masvingo City Council Civic Centre Hall.\n\nElection Day is scheduled for 13 September, just 31 days away, as parties and candidates prepare for a competitive contest.\n\nZEC has advised all prospective candidates to ensure their documents are complete to avoid disqualification.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO – Nomination papers for the Masvingo Ward 7 by-election are set to be filed on Thursday, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/masvingo-by-election-countdown-nomination-papers-due-thursday/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo By-Election Countdown: Nomination Papers Due Thursday\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "Church Leader Confronts Themba Gorimbo Over Insulting Mnangagwa",
            "url": "https://www.zimeye.net/2025/08/13/church-leader-confronts-themba-gorimbo-over-insulting-mnangagwa/",
            "content": "By A Correspondent\n\nChurch leader Jay Israel Senior has publicly condemned Zimbabwean Mixed Martial Arts fighter Themba Gorimbo, accusing him of undermining the authority of President Emmerson Mnangagwa.\n\nIn a statement posted on Facebook, Jay Israel Senior addressed Gorimbo directly:\n\nDear Themba Gorimbo, your conduct is deeply unacceptable for someone who claims to be representing Zimbabwe on the world stage, particularly in the United States of America. As a public figure and role model, your actions carry weight far beyond your personal circle.\n\nWhat example are you setting for the young Zimbabwean youths who look up to you? What message are you sending to a nation that takes pride in its ambassadors abroad? What image are you painting of Zimbabwe to the international community?\n\nHe continued:\n\nFurthermore, such cussing insults directed at our President are wholly unacceptable and cannot be condoned under any circumstances. The Office of the President is a symbol of our nations unity, sovereignty, and dignity. To demean it through vulgar language is to undermine the respect that every Zimbabwean should uphold, both at home and abroad. Our country deserves to be represented with honour, discipline, and unwavering patriotism at all times.\n\nJay Israel Senior added:\n\nDear Zimbabweans  never insult the highest office of the land. Themba Gorimbo is a sellout and a puppet of the colonial masters bankrolling him to insult the President and government of Zimbabwe. It is true that I told Themba Gorimbo he will never set foot in Zimbabwe or South Africa as long as he continues his open campaign of vulgar insults against the President of Zimbabwe. This is not a threat, but a stand for the dignity of our Head of State and the lawful order of our nation.\n\nHe further explained:\n\nThemba has, on numerous occasions, used obscene and degrading language to describe the President, a conduct which I have documented and forwarded in full to the relevant authorities. This matter is now in the hands of those empowered to uphold our laws. Let it be known: Zimbabwe has freedom of speech, but not freedom of insults. Section 33 of the Criminal Law (Codification and Reform) Act [Chapter 9:23] makes it a criminal offence to publicly insult, undermine, or make abusive statements about the President or the office of the President. These provisions exist not to silence political debate, but to safeguard the dignity of our highest office and the sovereignty of our state.\n\nHe continued with a caution to the public:\n\nIf this kind of behaviour is not addressed by the law, it will embolden others to believe that vulgar attacks on our leaders are acceptable. That is how nations lose respect for themselves and for the very institutions that guarantee their stability. To all Zimbabweans: criticism is your right. Insults are a crime.\n\nPatriotism means disagreeing with dignity, not dragging your own nations image into the mud for entertainment or foreign applause. The dignity of Zimbabwes President, Government, and sovereignty will be defended without fear or favour, at all costs.\n\nHowever, Gorimbo responded:\n\nThis guy threatened me and my family in and out of Zimbabwe. If anything happens to me or any of my family memberseven a distant cousinyou will be held liable. Now that your threats are received, I take them seriously. Better be informed that even if any of my relatives cough, its on you, as we will be on high alert. I spoke and represented myself, not anybody elses family members.\n\nGorimbo continued:\n\nThe President is pictured with such a human, which raises questions Wonder what kind of pastors these people are.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Church leader Jay Israel Senior has publicly condemned Zimbabwean Mixed Martial Arts fighter Themba Gorimbo, accusing him … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/church-leader-confronts-themba-gorimbo-over-insulting-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Church Leader Confronts Themba Gorimbo Over Insulting Mnangagwa\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "New Zimbabwe Is Upon Us, Declares Opposition Leader",
            "url": "https://www.zimeye.net/2025/08/13/new-zimbabwe-is-upon-us-declares-opposition-leader/",
            "content": "By A Correspondent\n\nHARARE  Freedom Fighters for Change (FFC) leader Michael Makaza has declared that a new Zimbabwe is on the horizon, urging citizens and organizations to join his partys official launch next month.\n\nSpeaking on Wednesday, Makaza announced that the launch will take place on September 13 and will serve as more than just the unveiling of a political party.\n\nJoin us on September 13th as we launch the Freedom Fighters for Change party! Makaza said. Were not just launching a party, were launching a movement for a new Zimbabwe.\n\nHe emphasized that the event will be open to a broad audience. Thats why were extending a special invitation to all civic organizations, party leaders, and international human rights groups. We believe in inclusivity and transparency, and we want you to be part of this historic moment, he added.\n\nMakaza stressed that FFCs mission is rooted in unity rather than division. Were not preaching hatred or division. Were fighting for justice, equality, and freedom for all Zimbabweans, he said. We want to build a nation where every citizen can thrive, regardless of their background or political affiliation.\n\nConcluding his remarks, Makaza urged Zimbabweans to take part in shaping the countrys future. Come and witness the birth of a new Zimbabwe with us! Lets build a brighter future together.\n\nHowever, despite his rallying call, some political analysts and citizens remain skeptical about the announcement, citing the volatility of Zimbabwes political environment and the challenges that new political movements face in the country.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE – Freedom Fighters for Change (FFC) leader Michael Makaza has declared that a “new Zimbabwe” is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/new-zimbabwe-is-upon-us-declares-opposition-leader/\">Continue reading<span class=\"screen-reader-text\"> \"New Zimbabwe Is Upon Us, Declares Opposition Leader\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        },
        {
            "title": "Mutsvangwa Snubs Tagwirei in Defence Forces Day VIP Tent",
            "url": "https://www.zimeye.net/2025/08/13/mutsvangwa-snubs-tagwirei-in-defence-forces-day-vip-tent/",
            "content": "By A Correspondent| A rare moment of apparent cold shoulders played out at the Defence Forces Day celebrations on Tuesday when ZANU PF spokesperson Christopher Mutsvangwa appeared to deliberately avoid greeting controversial businessman Kudakwashe Tagwirei, who was seated at the far end of the VIP tent.\n\nMutsvangwa, accompanied by his wife Monica, arrived at the Harare event but, unlike most senior government and party officials, did not move around to greet fellow dignitaries. Their reserved arrival stood in stark contrast to the cordial handshakes, smiles, and brief chats that marked the arrivals of other high-profile figures.\n\nFormer Defence Minister Sydney Sekeramayi, ZANU PF stalwart Patrick Chinamasa, Harare Mayor Jacob Mafume, State Security minister Lovemore Matuke, Senate President Mabel Chinomona, National Assembly Speaker Jacob Mudenda, and Zanu PF Harare provincial chairperson Goodwills Masimirembwa were among the many who made the customary rounds to acknowledge colleagues in the VIP section.\n\nTagwirei, a close ally of President Emmerson Mnangagwa and a central figure in various political and business controversies, sat quietly at the far end of the tent, receiving greetings from other officials.\n\nThe incident comes amid swirling political undercurrents within ZANU PF, where factional alignments and succession debates are intensifying ahead of the partys 2027 leadership race. Mutsvangwa is reportedly opposed to the recent elevation of fuel mogul Kudakwashe Tagwirei into the ZANU PF Central Committee  a move widely speculated to be part of President Mnangagwas calculated plan to position Tagwirei as his preferred successor in 2028.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A rare moment of apparent cold shoulders played out at the Defence Forces Day celebrations on Tuesday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/08/13/mutsvangwa-snubs-tagwirei-in-defence-forces-day-vip-tent/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Snubs Tagwirei in Defence Forces Day VIP Tent\"</span></a></p>",
            "time": "06:44",
            "date": "14 Aug 2025"
        }
    ]
}