{
    "news": [
        {
            "title": "Mnangagwa Appoints Rushwaya-In-Law To Replace Chiwenga Relative as new Mash East Minister",
            "url": "https://www.zimeye.net/2025/02/12/mnangagwa-appoints-rushwaya-in-law-to-replace-chiwenga-relative-as-new-mash-east-minister/",
            "content": "By Farai D Hove | ZimEye | Harare, Zimbabwe  February 11, 2025In a move signaling further political consolidation, President Emmerson Mnangagwa has dismissed Apollonia Munzverengwi from her position as Minister of State for Provincial Affairs and Devolution in Mashonaland East Province and replaced her with Itayi Ndudzo, a figure linked to the influential Rushwaya family.\n\nThe announcement was formalized through a press statement issued by Chief Secretary to the President and Cabinet, Dr. Martin Rushwaya, on February 11, 2025. The statement confirmed that Munzverengwi was removed in terms of Section 108(1a) of the Constitution, while Ndudzos appointment was carried out under Section 104 Subsection (1) of the Constitution of Zimbabwe.\n\nThis development has sparked speculation about internal power struggles within the ruling ZANU-PF party, particularly between Mnangagwa and Vice President Constantino Chiwenga. Munzverengwi, who is reportedly a relative of Chiwenga, is seen as a casualty of the ongoing political realignments within the party.\n\nMeanwhile, Ndudzo, the new Minister, has close ties to the Rushwaya family, known to be relatives of President Mnangagwa. This appointment further solidifies the Rushwaya influence within the government, following other high-profile appointments and controversies involving members of the family.\n\nPolitical Implications\n\nMunzverengwis dismissal comes at a time when ZANU-PF factional battles are intensifying. Mnangagwa, who is reportedly eyeing a third term despite internal opposition, appears to be strengthening his grip on power by purging Chiwenga-linked officials and replacing them with his loyalists.\n\nObservers say the move is also strategic ahead of the 2028 elections, as Mnangagwa seeks to consolidate his authority and neutralize potential challengers within ZANU-PF. Chiwenga, who led the 2017 military coup that ousted Robert Mugabe, has long been rumored to harbor presidential ambitions, and any influence he retains in key provinces could pose a threat to Mnangagwas long-term plans.\n\nMnangagwas Growing Influence in Mashonaland East\n\nMashonaland East is a key province in Zimbabwes political landscape, serving as a traditional stronghold for ZANU-PF. The replacement of Munzverengwi with Ndudzo suggests Mnangagwa wants absolute control over the region, ensuring that his allies dominate structures ahead of the next electoral cycle.\n\nWith Dr. Martin Rushwayaanother Mnangagwa loyalisthandling key administrative functions, the latest reshuffle further strengthens the presidents inner circle.\n\nMnangagwas decision to fire a Chiwenga ally and replace her with a Rushwaya-linked official is a clear indication of the ongoing political realignments within Zimbabwes ruling party. Whether this marks the beginning of a broader cabinet reshuffle or a targeted move against Chiwengas influence remains to be seen.\n\nHowever, one thing is certain: Mnangagwa is tightening his grip on power, and any oppositioninternal or externalwill likely face similar purges as Zimbabwe inches closer to the next major elections.-ZimEye\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | ZimEye | Harare, Zimbabwe – February 11, 2025 In a move signaling further political consolidation, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/mnangagwa-appoints-rushwaya-in-law-to-replace-chiwenga-relative-as-new-mash-east-minister/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Appoints Rushwaya-In-Law To Replace Chiwenga Relative as new Mash East Minister\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Chiwenga Under Siege",
            "url": "https://www.zimeye.net/2025/02/12/chiwenga-under-siege-2/",
            "content": "By Munacho Gwamanda- Vice President Constantino Chiwenga has suffered a significant setback after President Emmerson Mnangagwa dismissed his relative from government on Tuesday.\n\nMashonaland East Provincial Affairs Minister, Apollonia Munzverengwi, was fired just a day after public clashes erupted between Mnangagwa and Chiwengas supporters at the National Heroes Acre.\n\nLegal practitioner Itayi Ndudzo swiftly replaced her.\n\nMunzverengwi, a well-known ally of Chiwenga, played a crucial role in mobilizing support for the vice president, who is widely believed to be positioning himself for a challenge against Mnangagwa ahead of the next ZANU PF elective congress.\n\nGovernment insiders suggest that Munangagwas decision to axe Munzverengwi is part of a broader strategy to weaken Chiwengas influence, particularly in Mashonaland Eastan influential province in ZANU PFs power struggles.\n\nThe move mirrors previous purges that targeted military-backed figures who had helped Mnangagwa seize power from Robert Mugabe in the 2017 coup.\n\nWhile the official statement on Munzverengwis dismissal cites constitutional provisions, political analysts argue that Mnangagwa is consolidating his grip on power amid speculation that Chiwenga may challenge him before the 2028 elections.\n\nThe vice president has recently maintained a low public profile, further fueling rumours of a deepening rift between the two leaders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- Vice President Constantino Chiwenga has suffered a significant setback after President Emmerson Mnangagwa dismissed his relative from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/chiwenga-under-siege-2/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Under Siege\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Chimombe, Mpofu Trial Set For February 20",
            "url": "https://www.zimeye.net/2025/02/12/chimombe-mpofu-trial-set-for-february-20/",
            "content": "By A Correspondent\n\nThe trial of business partners Moses Mpofu and Mike Chimombe, who face fraud charges related to a US$7 million scam in the failed Presidential Goat Pass-On Scheme, has been postponed once more.\n\nScheduled to resume this Monday, the trial faced a delay due to the absence of Mpofus preferred legal counsel, Advocate Tapson Dzvetero, who is attending the funeral of his brother-in-law. As a result, the case was rescheduled for the 20th of this month, with proceedings expected to last for five days. The State plans to present three witnesses on that date.\n\nInitially set to begin in October of last year, the trial was delayed following an application by the defendants seeking to refer the case to the Constitutional Court. However, the application was dismissed for lack of merit, allowing the trial to proceed.\n\nBoth Chimombe and Mpofu remain in custody after their bail application was denied last month. The court ruled that they posed a flight risk, as they face potential sentences of at least 20 years if convicted.\n\nThe charges against the two stem from allegations that they forged documents to secure a tender for supplying goats under the Presidential Goat Scheme. In addition, they are facing another fraud charge related to a US$9.2 million contract tied to the City of Harares street lights project.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The trial of business partners Moses Mpofu and Mike Chimombe, who face fraud charges related to a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/chimombe-mpofu-trial-set-for-february-20/\">Continue reading<span class=\"screen-reader-text\"> \"Chimombe, Mpofu Trial Set For February 20\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Horror As Trailer Runs Over Truck Driver",
            "url": "https://www.zimeye.net/2025/02/12/horror-as-trailer-runs-over-truck-driver/",
            "content": "By A Correspondent\n\nA tragic incident occurred on the Bulawayo-Beitbridge highway on Sunday night, leaving a South African truck driver feared dead. According to reports, the driver lost control of the vehicle approximately five kilometers before Gwanda, resulting in him being ejected from the truck.\n\nIn a devastating turn of events, one of the trailers then ran over the driver, causing severe injuries. The incident is currently under investigation, but police are yet to confirm the details.\n\nThe truck was reportedly heading to South Africa at the time of the accident. Further information is awaited as authorities work to confirm the incident and provide more details.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident occurred on the Bulawayo-Beitbridge highway on Sunday night, leaving a South African truck driver … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/horror-as-trailer-runs-over-truck-driver/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Trailer Runs Over Truck Driver\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Horror As Teacher Stabs Elementary School Learner To Death",
            "url": "https://www.zimeye.net/2025/02/12/horror-as-teacher-stabs-elementary-school-learner-to-death/",
            "content": "By A Correspondent\n\nA devastating incident has shaken South Korea after a teacher fatally stabbed an eight-year-old girl at an elementary school in Daejeon.\n\nThe teacher, a woman in her 40s, confessed to the crime and was found with self-inflicted stab wounds beside the victim .\n\nThe incident occurred on Monday evening, with the girl being discovered on the second floor of the school building at 6 pm local time.\n\nDespite efforts to save her, she was pronounced dead at the hospital. The teacher had been experiencing depression and had requested a six-month leave of absence in December, but returned to school just 20 days later after being deemed fit to work .\n\nWhats particularly alarming is that the teacher had displayed violent behavior just days before the stabbing, including putting another teacher in a headlock. Education officials had visited the school that morning to investigate the altercation, but no action was taken to prevent the tragedy.\n\nSouth Koreas acting president, Choi Sang-mok, has ordered an investigation into the case and urged authorities to take measures to prevent such incidents in the future. The school was closed on Tuesday, with locals laying flowers and tributes at the gate.\n\nThis incident has raised concerns about school safety in South Korea, which is generally considered a safe country with strict gun control laws. However, recent years have seen a rise in high-profile crimes, including stabbings .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating incident has shaken South Korea after a teacher fatally stabbed an eight-year-old girl at an … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/horror-as-teacher-stabs-elementary-school-learner-to-death/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Teacher Stabs Elementary School Learner To Death\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Liverpool Boss Happy With Mabaya Solid Performance",
            "url": "https://www.zimeye.net/2025/02/12/liverpool-boss-happy-with-mabaya-solid-performance/",
            "content": "By A Correspondent\n\nLiverpool manager Arne Slot shared his thoughts on Isaac Mabayas senior debut in the FA Cup fourth-round match against Plymouth Argyle on Sunday.\n\nMabaya, 19, came on as a substitute for the injured Joe Gomez in the 10th minute of the game.\n\nHe played until the 58th minute, when he was substituted for striker Darwin Nunez.\n\nDespite his early introduction to the match, Mabaya delivered a solid performance but received a yellow card for kicking the ball away late in the first half.\n\nIn his post-match comments, Slot reflected on Mabayas debut and explained the reasoning behind the decision to substitute him.\n\nI think its a fantastic moment for every player to make their debut, and it was no different for him, Slot said. However, I felt it was necessary to take him off for two reasons. He was already on a yellow card, and with the intensity and physicality of the game, there were many duels.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Liverpool manager Arne Slot shared his thoughts on Isaac Mabaya’s senior debut in the FA Cup fourth-round … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/liverpool-boss-happy-with-mabaya-solid-performance/\">Continue reading<span class=\"screen-reader-text\"> \"Liverpool Boss Happy With Mabaya Solid Performance\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Government Admits ZiG Failure",
            "url": "https://www.zimeye.net/2025/02/12/government-admits-zig-failure/",
            "content": "By A Correspondent\n\nMr Emmerson Mnangagwas administration has essentially acknowledged that the current ZiG notes have lost both their value and quality.\n\nIn a statement made over the weekend, Reserve Bank of Zimbabwe (RBZ) Governor Dr. John Mushayavanhu revealed that the government plans to introduce new banknotes.\n\nDr. Mushayavanhu said, New ZiG notes with better quality will be introduced soon to replace the notes currently in circulation.\n\nThis announcement comes amid growing concerns over the deteriorating state of the current currency, which has faced significant devaluation in recent months.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mr Emmerson Mnangagwa’s administration has essentially acknowledged that the current ZiG notes have lost both their value … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/government-admits-zig-failure/\">Continue reading<span class=\"screen-reader-text\"> \"Government Admits ZiG Failure\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Hon Kademaunga Leads Tribute to Sam Nujoma, Calls for a National Day of Mourning",
            "url": "https://www.zimeye.net/2025/02/12/hon-kademaunga-leads-tribute-to-pan-african-icon-sam-nujoma-calls-for-a-national-day-of-mourning/",
            "content": "FULL TEXT: Mr. Speaker Sir, I rise on a point of national interest to draw the attention of this august house to the passing on of President Sam Nujoma, a titan of Pan-Africanism and a champion of Africas liberation, whose unwavering support for Zimbabwes liberation struggle will forever be etched in our nations history. As the last of the frontline states leaders to pass on, his demise marks the end of an era in both Namibian and African history.\n\nPresident Nujomas lifelong work embodied the principles of Pan-Africanism, seeking to promote solidarity and cooperation among African people. Through his leadership of SWAPO, he spearheaded Namibias struggle for independence, inspiring a generation of Africans to resist colonialism, apartheid, and neo-colonialism. His commitment to Pan-Africanism was shaped by his encounters with other African luminaries like Kwame Nkrumah, Patrice Lumumba, and Gamal Abdel Nasser.\n\nHere in Zimbabwe, we remember Nujomas steadfast support for our liberation struggle. We recall how he stood in solidarity with us during our independence celebrations in 1980, even as he continued to battle for Namibias freedom. In June 1981, Zimbabwe hosted a Namibia Solidarity Week, featuring mass rallies led by President Nujoma, further solidifying the bonds of Pan-African solidarity between our nations.\n\nAs we reflect on Nujomas legacy, we acknowledge his significant contributions to the development of Pan-African thought. He played a crucial role in forming the Organization of African Unity (OAU) and promoting regional integration through the Southern African Development Community (SADC). Nujomas tireless efforts earned him numerous accolades, including the Lenin Peace Prize, the Indira Gandhi Peace Prize, and the Ho Chi Minh Peace Prize.\n\nAs we mourn the passing of this African icon, we draw inspiration from his life. Nujomas dedication to African liberation, his commitment to Pan-Africanism, and his pursuit of justice and equality are a testament to his enduring legacy. As Zimbabweans, particularly the younger generation, we can learn valuable lessons from Nujomas life about solidarity, perseverance, and sacrifice in pursuit of a united, empowered, and just Africa.\n\nIn light of these immense contributions, I propose that this House impress upon the Executive to declare a day of national mourning in Zimbabwe to honor the life and legacy of Sam Nujoma.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "FULL TEXT: Mr. Speaker Sir, I rise on a point of national interest to draw the attention of this august … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/hon-kademaunga-leads-tribute-to-pan-african-icon-sam-nujoma-calls-for-a-national-day-of-mourning/\">Continue reading<span class=\"screen-reader-text\"> \"Hon Kademaunga Leads Tribute to Sam Nujoma, Calls for a National Day of Mourning\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Mnangagwa Threatens To Deal With Lazy Cabinet Ministers",
            "url": "https://www.zimeye.net/2025/02/12/mnangagwa-threatens-to-deal-with-lazy-cabinet-ministers/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa has issued a stern reminder to his cabinet ministers, urging them to step up their commitment to improving the lives of the people and accelerating the countrys development goals towards Vision 2030.\n\nSpeaking at the first cabinet meeting of the year 2025, held at the State House after the annual festive break, Mnangagwa emphasized the critical role each minister plays in fulfilling the promises made to the citizens.\n\nThe presidents message revolved around the importance of effective leadership and accountability. He reminded ministers that they are in positions of power to serve the people and that their duties extend beyond political ambition.\n\nMnangagwa made it clear that the cabinet operates on a principle of collective responsibility, with each minister expected to contribute meaningfully toward national progress. He highlighted that there is no place for complacency, urging ministers to act decisively and with urgency to tackle challenges facing the nation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa has issued a stern reminder to his cabinet ministers, urging them to step up … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/mnangagwa-threatens-to-deal-with-lazy-cabinet-ministers/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Threatens To Deal With Lazy Cabinet Ministers\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Chimombe, Mpofu Trial Postponed Again",
            "url": "https://www.zimeye.net/2025/02/12/chimombe-mpofu-trial-postponed-again/",
            "content": "By A Correspondent\n\nThe trial of business partners Moses Mpofu and Mike Chimombe, who face fraud charges related to a US$7 million scam in the failed Presidential Goat Pass-On Scheme, has been postponed once more.\n\nScheduled to resume this Monday, the trial faced a delay due to the absence of Mpofus preferred legal counsel, Advocate Tapson Dzvetero, who is attending the funeral of his brother-in-law. As a result, the case was rescheduled for the 20th of this month, with proceedings expected to last for five days. The State plans to present three witnesses on that date.\n\nInitially set to begin in October of last year, the trial was delayed following an application by the defendants seeking to refer the case to the Constitutional Court. However, the application was dismissed for lack of merit, allowing the trial to proceed.\n\nBoth Chimombe and Mpofu remain in custody after their bail application was denied last month. The court ruled that they posed a flight risk, as they face potential sentences of at least 20 years if convicted.\n\nThe charges against the two stem from allegations that they forged documents to secure a tender for supplying goats under the Presidential Goat Scheme. In addition, they are facing another fraud charge related to a US$9.2 million contract tied to the City of Harares street lights project.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The trial of business partners Moses Mpofu and Mike Chimombe, who face fraud charges related to a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/12/chimombe-mpofu-trial-postponed-again/\">Continue reading<span class=\"screen-reader-text\"> \"Chimombe, Mpofu Trial Postponed Again\"</span></a></p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        }
    ]
}