{
    "news": [
        {
            "title": "JUST IN……..Mnangagwa Youth Leader In Foiled Coup",
            "url": "https://www.zimeye.net/2024/12/18/just-in-mnangagwa-youth-leader-in-foiled-coup/",
            "content": "Political Reporter-Zanu PF has blocked the partys secretary for Youth Tino Machakaires decision to reshuffle the youth league leadership.\n\nLast week, Machakaire unilaterally announced a new structure for the youth league, sidelining figures perceived as unsupportive of President Emmerson Mnangagwa.\n\nHowever, his actions sparked immediate backlash from his deputy, John Paradza, who claimed the reshuffle violated party protocol.\n\nParadza swiftly appealed to senior party officials, accusing Machakaire of undermining internal democracy.\n\nOn Wednesday, the matter reached the attention of the partys top brass, who reportedly intervened to nullify the appointments.\n\nThis incident has exposed growing tensions within the youth league, with insiders suggesting it reflects deeper fissures in Zanu PFs factional battles.\n\nMachakaire, a known loyalist of Mnangagwa, is accused by critics of using the reshuffle to consolidate power and marginalise dissenting voices ahead of next years elective congress.\n\nNeither Machakaire nor Paradza could be reached for comment.\n\nSome senior party officials, however, have downplayed the incident, describing it as an internal matter.Observers believe this drama indicates the ongoing power struggle between factions loyal to Mnangagwa and those backing his deputy, Constantino Chiwenga, as the party gears up for its next leadership contest.\n\nZimEye is striving to reach Zanu PF Political Commissar Munyaradzi Machacha for comment\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Political Reporter-Zanu PF has blocked the party’s secretary for Youth Tino Machakaire’s decision to reshuffle the youth league leadership. Last … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/just-in-mnangagwa-youth-leader-in-foiled-coup/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN……..Mnangagwa Youth Leader In Foiled Coup\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Chiwenga Ministers Snub Mnangagwa Cabinet",
            "url": "https://www.zimeye.net/2024/12/18/chiwenga-ministers-snub-mnangagwa-cabinet/",
            "content": "ByPolitical Reporter- President Emmerson Mnangagwa has revealed that some ministers were skipping cabinet meetings.\n\nMnangagwa, who did not name the troublesome minister, told the last 2024 cabinet meeting held at State House that the absenteeism behaviour was untenable and a dereliction of duty.\n\nHowever, sources close to this development said that thesaidministersare alignedwith Vice President Constantino Chiwenga.\n\nLet me, however, hasten to emphasise that Cabinet processes are anchored on the timely submission of vital documents and regular attendance by Ministers and officials, Mnangagwa stated. The worrisome tendency by Ministers and senior officials to absent themselves from meetings is untenable. Permanent Secretaries should ensure that in their absence, only directors and above should attend working party meetings.\n\nThe presidents remarks cement the tension claims between Chiwenga and Mnangagwa.\n\nSpeculation suggests that these absences are part of a coordinated effort to challenge Mnangagwas leadership ahead of Zanu PFs next elective congress.\n\nMnangagwa directed Chief Secretary to the President and Cabinet, Martin Rushwaya, to tighten monitoring of ministerial attendance starting in 2025.\n\nHe warned that ministers and senior officials who fail to comply risk dire consequences.\n\nThe president also criticised deputy ministers, accusing them of being poorly prepared and undermining his authority by failing to participate effectively in government operations.\n\nIn cases where Deputy Ministers are assigned, they should be adequately capacitated to enable active participation in the requisite deliberations. To this end, I direct that Deputy Ministers must now sign performance contracts in 2025, Mnangagwa announced.\n\nThese measures follow Mnangagwas earlier introduction of performance contracts for senior government officials as part of his Vision 2030 agenda to foster a culture of accountability and servant leadership.\n\nMnangagwa and Chiwenga have shared a tumultuous political relationship since the military-assisted transition that brought Mnangagwa to power in 2017.\n\nChiwenga, who played a pivotal role in that transition, has grown increasingly influential, with his allies occupying key government and security positions.\n\nObservers note that Chiwengas loyalists have become emboldened, with their defiance of Mnangagwas directives interpreted as challenging his grip on power.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Political Reporter- President Emmerson Mnangagwa has revealed that some ministers were skipping cabinet meetings. Mnangagwa, who did not name the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/chiwenga-ministers-snub-mnangagwa-cabinet/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Ministers Snub Mnangagwa Cabinet\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Winky D Removal: Fulcrum Defends SDA Church",
            "url": "https://www.zimeye.net/2024/12/18/winky-d-removal-fulcrum-defends-sda-church/",
            "content": "By Showbiz Reporter |Breaking News: Winky Ds HICC Drama Sparks Debate Over SDA Churchs Role\n\nHarare, Zimbabwe  The fallout from Winky Ds reported exclusion from performing at the Harare International Conference Centre (HICC) has ignited a fierce public debate, with Advocate Thabani Mpofu and UK-based lawyer Brighton Mutebuka exchanging sharp opinions over the Seventh-day Adventist (SDA) Churchs alleged involvement.\n\nWinky D, a celebrated Zimbabwean musician known for his politically charged lyrics, was scheduled to perform at the HICC on December 31. Reports suggest the event was abruptly canceled due to pressure allegedly linked to the SDA Church, which owns the venue. Advocate Thabani Mpofu, a staunch defender of the church, has vehemently denied the allegations, branding them as completely false.\n\nThe SDA church is a reputable Christian denomination that promotes peace and harmony, not conflict or manipulation, Mpofu asserted in his statement. It is committed to spreading love, kindness, and understanding and holds these values so close to its teachings and actions. The allegation is the very antithesis of the churchs thrust, which strives to maintain a good reputation and promote positive values.\n\nMpofu, affectionately known as Advocate Fulcrum, dismissed claims linking the church to political interference, emphasizing that the SDA does not engage in fighting for turf with a secular artist.\n\nHowever, UK-based lawyer Brighton Mutebuka has challenged Mpofus defense, arguing that the political climate in Zimbabwe makes it plausible for influential figures, including business tycoon Kudakwashe Tagwirei, to exert pressure on institutions like the SDA Church.\n\nMutebuka cited Tagwireis close ties to President Emmerson Mnangagwa as a potential factor in the HICC controversy. No single sector in Zimbabwe is beyond EDs overbearing reach or tentacles. The SDA is no exception, he said.\n\nHe further elaborated: The digital and evidential footprint is highly significant. While the SDA Church is dear to you, the bright-line approach cant be sustained in this context. There are too many grey areas, and the allegation cannot be discounted. Secularism is as important as religion in objective terms. It covers atheists and is a fundamental right.\n\nMutebuka urged Mpofu to separate his personal commitment to the SDA Church from its susceptibility to external influence, particularly given the controversy surrounding Tagwireis involvement with the church.\n\nThis is a messy situation, Mutebuka concluded. Theres a lot about Tagwirei thats in the public domain. Its enough to make it plausible for him to use his power and influence to dislodge Winky Ds booking to placate ED and his regime.\n\nThe dispute has sparked widespread public debate over the intersection of religion, politics, and artistic expression in Zimbabwe. Many have called for greater transparency regarding the circumstances surrounding Winky Ds canceled performance, while others have defended the SDA Churchs integrity.\n\nFor now, Winky Ds fans are left disappointed as the artist, known for his fearless critique of social and political issues, remains at the center of this brewing controversy. As the debate rages on, the country watches closely to see whether this high-profile clash will lead to accountability or further division.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter | Breaking News: Winky D’s HICC Drama Sparks Debate Over SDA Church’s Role Harare, Zimbabwe — The … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/winky-d-removal-fulcrum-defends-sda-church/\">Continue reading<span class=\"screen-reader-text\"> \"Winky D Removal: Fulcrum Defends SDA Church\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Chelsea Star Faces Provisional Suspension After Positive Drug Test",
            "url": "https://www.zimeye.net/2024/12/18/chelsea-star-faces-provisional-suspension-after-positive-drug-test/",
            "content": "Sports Correspondent\n\nChelsea winger Mykhailo Mudryk has been handed a provisional suspension by the English Football Association after a routine urine test revealed the presence of a banned substance. The 23-year-old Ukrainian international maintains he has never knowingly used any banned substances and is cooperating fully with the investigation.\n\nAccording to Chelseas statement, the Football Association contacted Mudryk regarding the adverse finding, and both the club and player support the FAs testing program.\n\nMudryk has been absent from Chelseas squad for the last four games, with his last inclusion being as an unused substitute against Aston Villa on December 1.\n\nMudryk took to social media to express his shock, stating, This has come as a complete shock\n\nI have not done anything wrong and remain hopeful that I will be back on the pitch soon. The Chelsea forward joined the club in January 2023 from Shakhtar Donetsk in a deal worth up to $112 million .\n\nThe investigation is ongoing, with Mudryk and Chelsea working to establish the cause of the adverse finding. The club has declined further comment on the matter .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Chelsea winger Mykhailo Mudryk has been handed a provisional suspension by the English Football Association after a routine … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/chelsea-star-faces-provisional-suspension-after-positive-drug-test/\">Continue reading<span class=\"screen-reader-text\"> \"Chelsea Star Faces Provisional Suspension After Positive Drug Test\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Vinícius Júnior Named FIFA Men’s Player of the Year",
            "url": "https://www.zimeye.net/2024/12/18/vinicius-junior-named-fifa-mens-player-of-the-year/",
            "content": "Sports Correspondent\n\nReal Madrid and Brazil forward Vincius Jnior has been awarded the prestigious title of The Best FIFA Mens Player of the Year.\n\nThe 2024 FIFA Awards ceremony took place on Tuesday evening, celebrating the best in football across various categories.\n\nIn the womens category, Spain and Barcelonas Aitana Bonmat was named The Best FIFA Womens Player of the Year.\n\n2024 FIFA Award Winners:\n\nThe Best FIFA Mens Player: Vincius Jnior (Brazil and Real Madrid)\n\nThe Best FIFA Womens Player: Aitana Bonmat (Spain and Barcelona)\n\nThe Best FIFA Mens Coach: Carlo Ancelotti (Italy, Real Madrid)\n\nThe Best FIFA Womens Coach: Emma Hayes (England, Chelsea/USA)\n\nThe Best FIFA Mens Goalkeeper: Emiliano Martnez (Argentina and Aston Villa)\n\nThe Best FIFA Womens Goalkeeper: Alyssa Naeher (USA and Chicago Red Stars)\n\nThe Best FIFA Mens XI:\n\nEmiliano Martnez (Argentina and Aston Villa)\n\nDani Carvajal (Spain and Real Madrid)\n\nAntonio Rdiger (Germany and Real Madrid)\n\nRben Dias (Portugal and Manchester City)\n\nWilliam Saliba (France and Arsenal)\n\nJude Bellingham (England and Real Madrid)\n\nRodri (Spain and Manchester City)\n\nToni Kroos (Germany and Real Madrid)\n\nLamine Yamal (Spain and Barcelona)\n\nErling Haaland (Norway and Manchester City)\n\nVincius Jnior (Brazil and Real Madrid)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Real Madrid and Brazil forward Vinícius Júnior has been awarded the prestigious title of The Best FIFA Men’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/vinicius-junior-named-fifa-mens-player-of-the-year/\">Continue reading<span class=\"screen-reader-text\"> \"Vinícius Júnior Named FIFA Men’s Player of the Year\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Road Safety A Collective Responsibility",
            "url": "https://www.zimeye.net/2024/12/18/road-safety-a-collective-responsibility-3/",
            "content": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls on every individual.\n\nWhile authorities play a crucial role in setting rules, providing infrastructure, and enforcing traffic laws, the safety of our roads depends on how each of us behaves behind the wheel or as a pedestrian.\n\nIts easy to assume that road safety is solely the responsibility of lawmakers and authorities, but the reality is that every person who uses the road contributes to creating a safer or more dangerous environment. Drivers, passengers, cyclists, and even pedestrians all have a part to play in ensuring that our roads remain safe for everyone.\n\nThe Importance of Safe Driving\n\nOne of the most significant contributors to road safety is the way we drive. Speeding, distracted driving, and driving under the influence of alcohol or drugs are all actions that put not only the driver but also other road users at serious risk. Being aware of road conditions, following traffic signals, wearing seat belts, and respecting speed limits are some of the simplest yet most effective ways to avoid accidents.\n\nDriving safely involves more than just adhering to the lawit means being conscious of other drivers and pedestrians, maintaining a safe distance, and reacting calmly in emergency situations. The decision to drive responsibly can prevent countless accidents and save lives.\n\nPedestrians and Cyclists: Sharing the Road\n\nRoad safety isnt just about cars. Pedestrians and cyclists also need to be vigilant and responsible. Pedestrians should use crosswalks, avoid jaywalking, and stay alert when walking near busy streets. Similarly, cyclists must wear helmets, signal their turns, and follow traffic rules to minimize the risk of accidents.\n\nEveryone, regardless of how they travel, plays a part in maintaining road safety. Drivers must be aware of pedestrians and cyclists, while pedestrians and cyclists should respect the rules designed to protect them.\n\nA Culture of Responsibility\n\nBuilding a culture of road safety starts with individuals taking responsibility for their actions. Whether you are driving, cycling, or walking, your behavior on the road can have a direct impact on others. Everyone should recognize that safety is not just a matter of personal well-being but also the well-being of everyone else on the road.\n\nConclusion\n\nRoad safety is not only about laws and regulations; it is about creating a culture where everyone takes responsibility for their actions. To ensure that roads are safe for everyone, we must all participatedrivers, pedestrians, cyclists, and law enforcement. The message is simple: Drive safely, save lives. Lets make road safety a shared priority for all.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Road safety is not just a matter of government policy or law enforcement; it is a collective responsibility that falls … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/road-safety-a-collective-responsibility-3/\">Continue reading<span class=\"screen-reader-text\"> \"Road Safety A Collective Responsibility\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Two Die in Honda Fit, Toyota Hilux Crash",
            "url": "https://www.zimeye.net/2024/12/18/two-die-in-honda-fit-toyota-hilux-crash/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police (ZRP) has confirmed a fatal road traffic accident that occurred on December 16, 2024, at approximately 1:50 PM at the 156-kilometer peg along the Harare-Nyamapanda Road.\n\nTwo people lost their lives, and four others were injured when a Toyota Hilux, carrying one passenger, collided with a Honda Fit that had five passengers on board. The impact caused the Toyota Hilux to overturn onto its side, while the Honda Fit also flipped but landed on its wheels.\n\nThe authorities are investigating the cause of the crash.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police (ZRP) has confirmed a fatal road traffic accident that occurred on December 16, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/two-die-in-honda-fit-toyota-hilux-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Two Die in Honda Fit, Toyota Hilux Crash\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Mnangagwa Boasts of Feeding Entire Nation in 2024 As Nation Burns",
            "url": "https://www.zimeye.net/2024/12/18/mnangagwa-boasts-of-feeding-entire-nation-in-2024-as-nation-burns/",
            "content": "By A Correspondent\n\nZanu PF spokesperson Chris Mutsvangwa recently claimed that President Emmerson Mnangagwa successfully managed to feed the entire nation in 2024, despite numerous challenges.\n\nThis assertion, however, stands in stark contrast to the harsh realities faced by many Zimbabweans, who continue to grapple with economic hardship and daily struggles to meet basic needs.\n\nMutsvangwa made these remarks during a media briefing in Harare on Tuesday, where he outlined what he described as the governments successful food relief programme.\n\nHe emphasized that President Mnangagwa had overcome all odds to ensure that every citizen was fed, despite the economic challenges the country is facing.\n\nAgainst all odds, President Mnangagwa has managed to feed the entire nation in 2024. This is contrary to claims of starvation and suffering of citizens.\n\nThe food relief programme has been a huge success, Mutsvangwa said. He continued to praise the Presidents efforts, referring to the assistance provided to vulnerable groups across the country.\n\nMutsvangwas comments, however, have been met with skepticism by many, as the economic situation in Zimbabwe remains dire.\n\nRising inflation, unemployment, and food insecurity continue to affect a large portion of the population.\n\nMany citizens report that they are still struggling to access basic necessities, with food prices soaring and the cost of living escalating.\n\nIn his address, Mutsvangwa also took aim at critics of the governments relief efforts, saying, Naysayers have been put to shame. We thank the President for his resilience in the face of such challenges.\n\nHowever, opposition leaders and civil society groups have rejected Mutsvangwas claims, pointing out that while food aid may have reached some, large portions of the population remain unaddressed. These critics argue that the scale of the food crisis in Zimbabwe is far greater than the government admits, with the vast majority of citizens still experiencing food insecurity.\n\nAs the political rhetoric continues, many Zimbabweans are left wondering if the governments promises can match the lived reality of a nation still struggling to recover from years of economic decline.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF spokesperson Chris Mutsvangwa recently claimed that President Emmerson Mnangagwa successfully managed to feed the entire … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/mnangagwa-boasts-of-feeding-entire-nation-in-2024-as-nation-burns/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Boasts of Feeding Entire Nation in 2024 As Nation Burns\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "Parliament Is Hell Under Mnangagwa Regime, Opposition MP Reveals",
            "url": "https://www.zimeye.net/2024/12/18/parliament-is-hell-under-mnangagwa-regime-opposition-mp-reveals/",
            "content": "By Honourable Johnson Matambo MP Kuwadzana West\n\nThe effectiveness of Parliamentarians in Zimbabwe after the new dispensation has been a subject of debate.\n\nWhile the current administration promised a break from the past, the reality on the ground tells a different story.\n\nOne of the major challenges facing Parliamentarians is the lack of meaningful reforms.\n\nDespite promises of change, the ruling party has maintained a tight grip on power, limiting the ability of Parliamentarians to hold the executive accountable.\n\nThe delay in passing the Constitutional Amendment Bill (Number 2) is a case in point. This bill aimed to give credence to the establishment of provincial councils, a key aspect of the devolution agenda. However, its delay has stalled government efforts to implement this agenda.\n\nFurthermore, human rights abuses have continued unabated under the new dispensation. Parliamentarians have failed to effectively address these issues, with many critics arguing that they have been co-opted by the ruling party.\n\nThe Zimbabwe Human Rights NGO Forum has documented numerous cases of human rights abuses, including police brutality, forced disappearances, and restrictions on freedom of assembly and expression.\n\nDespite these challenges, Parliamentarians can still play a crucial role in promoting accountability and good governance. They can do this by:\n\nUltimately, the effectiveness of Parliamentarians in Zimbabwe will depend on their ability to assert their independence and promote the interests of their constituents. (Meta on the Effectiveness of the roles of Parliamentarians after the New Dispensation)\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Honourable Johnson Matambo MP Kuwadzana West The effectiveness of Parliamentarians in Zimbabwe after the new dispensation has been a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/parliament-is-hell-under-mnangagwa-regime-opposition-mp-reveals/\">Continue reading<span class=\"screen-reader-text\"> \"Parliament Is Hell Under Mnangagwa Regime, Opposition MP Reveals\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        },
        {
            "title": "People Want Mnangagwa to Stay Beyond 2028: Mutsvangwa",
            "url": "https://www.zimeye.net/2024/12/18/people-want-mnangagwa-to-stay-beyond-2028-mutsvangwa/",
            "content": "By A Correspondent\n\nZanu PF spokesperson Chris Mutsvangwa has claimed that the people of Zimbabwe want President Emmerson Mnangagwa to remain in office beyond 2028.\n\nSpeaking to the media in Harare on Tuesday, Mutsvangwa argued that citizens have the right to call for Mnangagwa to extend his presidency beyond the constitutionally mandated two terms.\n\nMnangagwa is currently serving his second and final term according to Zimbabwes constitution, but Mutsvangwa insisted that many Zimbabweans, particularly Zanu PF supporters, want him to continue leading beyond 2028.\n\nYes, we are aware that the President respects the constitution, Mutsvangwa said. President Mnangagwa has already stated that he will not seek a third term. However, let me make it clearthe people have the right to urge him to stay in office. We are witnessing the great work he is doing.\n\nMutsvangwa added, The fact is, citizens have already expressed their desire for the President to stay beyond 2028.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF spokesperson Chris Mutsvangwa has claimed that the people of Zimbabwe want President Emmerson Mnangagwa to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/18/people-want-mnangagwa-to-stay-beyond-2028-mutsvangwa/\">Continue reading<span class=\"screen-reader-text\"> \"People Want Mnangagwa to Stay Beyond 2028: Mutsvangwa\"</span></a></p>",
            "time": "20:27",
            "date": "18 Dec 2024"
        }
    ]
}