{
    "news": [
        {
            "title": "About Fowl Pox in Chickens…",
            "url": "https://www.zimeye.net/2025/07/29/about-fowl-pox-in-chickens/",
            "content": "By Dr Trywell Muzerengi\n\nFowl Pox is a highly contagious viral disease in poultry that causes painful, disfiguring sores on a chickens skin and, in severe cases, lesions in the mouth and respiratory tract. Also known as Avian Pox, Sorehead, Avian Diphtheria, and Chicken Pox (unrelated to the human illness), the disease poses a serious threat to backyard and commercial flocks alike.\n\nThere is no known cure for Fowl Pox, but it can be prevented and managed through proper care and vaccination.\n\nFowl Pox occurs in two forms:\n\nDry Pox: Affects non-feathered areas like the comb, wattles, face, and eyelids, forming visible lesions.\n\nWet Pox: A more severe form that targets the upper respiratory system, eyes, mouth, and throat, and can be life-threatening.\n\nThe virus is primarily spread by biting insects, especially mosquitoes, and can also be transmitted from bird to bird through contact with infected feathers, skin debris, scabs, secretions, and bloodcollectively called hot debris.\n\nThe virus survives for long periods in this debris, making coop hygiene critical. Birds become infected when this hot debris is inhaled, ingested, or comes into contact with wounds or mucous membranes.\n\nCommon signs of Fowl Pox include:\n\nAsh-colored raised lesions or blisters on the face, comb, or wattles (Dry Pox)\n\nYellowish bumps evolving into dark wart-like scabs\n\nLesions inside the mouth and throat (Wet Pox)\n\nLoss of appetite\n\nWeight loss\n\nReduced egg production\n\nSymptoms typically last weeks in an individual bird and can persist for months within a flock. While some birds may develop immunity, others may experience recurrences during times of stress.\n\nWhile there is no cure, the following supportive care steps are effective in managing the disease:\n\nControl secondary bacterial infections with antibiotics like Terramycin in drinking water for 3 days, followed by vitamin supplements.\n\nTreat scabs with dilute iodine solution.\n\nApply a soothing ointment to affected areas:(Mix 2 tablespoons of sulfur powder with  cup Vaseline and apply daily.)\n\nVaccinate unaffected birds during outbreaks.\n\nClean and disinfect coops and runs thoroughly to eliminate infectious debris.\n\nPrevention is key to controlling Fowl Pox. Measures include:\n\nBiosecurity: Avoid bringing in contaminated clothing, tools, or shoes from infected areas.\n\nQuarantine new birds before introducing them to the flock.\n\nControl mosquitoes and other biting insects.\n\nVaccinate day-old chicks and healthy adult birds. The eye-drop vaccine is easy and affordable, offering permanent immunity.\n\nDuring outbreaks, clean and sanitize water containers daily, and after the outbreak, sanitize the coop weekly for at least a month.\n\nConclusion:Fowl Pox can cause serious distress in flocks, impacting bird health and productivity. While the virus cannot be cured, early detection, proper hygiene, and routine vaccination can significantly reduce its impact. Poultry farmers must remain vigilant, especially during the warm, wet months when mosquito populations are high.\n\nEmail:[emailprotected]\n\nFacebook:https://www.facebook.com/share/18x439qwXt/\n\nWhatsApp Channel:\n\nInstagram: @lasmuzagro1LinkedIn: Lasmuz Agro\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi Fowl Pox is a highly contagious viral disease in poultry that causes painful, disfiguring sores on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/about-fowl-pox-in-chickens/\">Continue reading<span class=\"screen-reader-text\"> \"About Fowl Pox in Chickens…\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "ZRP Releases Information On Masvingo–Beitbridge Accident",
            "url": "https://www.zimeye.net/2025/07/29/zrp-releases-information-on-masvingo-beitbridge-accident/",
            "content": "By A Correspondent\n\nAt least 23 people were injured on Monday, July 28, 2025, when a Zhongtong bus overturned along the MasvingoBeitbridge Road, the Zimbabwe Republic Police (ZRP) has confirmed.\n\nAccording to a police statement, the accident occurred at the 144-kilometre peg when the driver of the bus, which was carrying 31 passengers at the time, lost control of the vehicle. The bus veered off the road and overturned, eventually landing on its side.\n\nThe ZRP reports a road traffic accident which occurred at the 144 km peg along MasvingoBeitbridge Road on 28/07/2025, when the driver of a Zhongtong bus, which had 31 passengers, lost control of the bus, veered off the road and overturned before landing on its side, read the statement.\n\nAll 23 injured passengers were rushed to Rutenga Clinic for medical attention. However, the nature and severity of the injuries sustained had not been disclosed at the time of reporting.\n\nPolice said investigations into the cause of the accident are ongoing and that additional information will be released as it becomes available.\n\nThe latest crash adds to the growing list of road traffic accidents occurring on Zimbabwes highways, raising renewed concerns about road safety, particularly on the busy MasvingoBeitbridge corridor.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent At least 23 people were injured on Monday, July 28, 2025, when a Zhongtong bus overturned along … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/zrp-releases-information-on-masvingo-beitbridge-accident/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Releases Information On Masvingo–Beitbridge Accident\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "Zim Accidents Worry 2023 Presidential Candidate Busha",
            "url": "https://www.zimeye.net/2025/07/29/zim-accidents-worry-2023-presidential-candidate-busha/",
            "content": "By A Correspondent| The recent surge in road accidents in Zimbabwe has left many families grieving and the nation in shock with President of the FreeZim Congress party, Joseph Busha stepping forward to offer his condolences and propose solutions to this growing crisis.\n\nBusha said he was hurt by the lives that continue to be lost in Zimbabwes roads.\n\nI am deeply hurt by the many lives we are losing on our roads, he said.\n\nBusha attributed the problem to the lack of control over road traffic movements, citing the chaotic mixing of trucks, buses, and minibuses on the roads.\n\nThe solution is to have good public roads and a safe transport system that serves the people. Apart from an upgraded public transport system, a functioning road accident fund, emergency services which include vehicle and helicopter ambulances, and other heavy machinery/equipment must be in place.emphasised Busha.\n\nBusha criticized the current governments approach, stating that it prioritizes consumption over capital expenditure.\n\nGovernment is not focused on capex but consumption. Zimbabwe is a consumption economy because it enriches the political government and business elite. Thats the problem. he said.\n\nHe proposed a comprehensive approach, including transport and medical insurance, to address the crisis.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The recent surge in road accidents in Zimbabwe has left many families grieving and the nation in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/zim-accidents-worry-2023-presidential-candidate-busha/\">Continue reading<span class=\"screen-reader-text\"> \"Zim Accidents Worry 2023 Presidential Candidate Busha\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "Citizens International Organiser Amos Chibaya Donates Cement To Gweru Church",
            "url": "https://www.zimeye.net/2025/07/29/citizens-international-organiser-amos-chibaya-donates-cement-to-gweru-church/",
            "content": "By A Correspondent\n\nCitizens International Organiser, Honourable Amos Chibaya, has donated 190 bags of cement to the Reformed Church in Zimbabwe (RCZ) to support the construction of a new pastors house in Mkoba North, Gweru.\n\nThe donation, made on Saturday, 26 July 2025, is part of a broader community-driven initiative aimed at ensuring decent housing for local church leaders. Speaking during the handover, Chibaya said the gesture was inspired by the important role pastors play in peoples lives.\n\nI have donated this cement in support of the RCZ Churchs vision for the construction of the pastors house, said Chibaya. Pastors are the servants of God who pray for us and encourage us in our daily lives. They deserve to have decent and beautiful accommodation.\n\nChibaya also praised the RCZ for its visible and long-standing work in uplifting communities across Zimbabwe through its various ministries and outreach programs.\n\nThe contributions made by the RCZ church in our community are invaluable, he noted. Pastors play a critical role in fostering community development and improving the quality of life for many.\n\nThe donation was welcomed with gratitude by congregants and community members. Mkoba Ward 20 resident Derrick Shumba expressed appreciation for Chibayas support.\n\nThis donation will greatly aid the church in realising their vision for a comfortable and welcoming pastors house, said Shumba.\n\nIn addition to Chibayas contribution, local businesspeople and church members have also donated building materials such as bricks and roofing supplies to help complete the project.\n\nThe ongoing construction of the pastors house stands as a symbol of unity and collaboration in Mkoba North, reflecting the shared commitment of local leaders and the church to improve lives through faith and community engagement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Citizens International Organiser, Honourable Amos Chibaya, has donated 190 bags of cement to the Reformed Church in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/citizens-international-organiser-amos-chibaya-donates-cement-to-gweru-church/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens International Organiser Amos Chibaya Donates Cement To Gweru Church\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "Remove US Dollar, Embrace ZiG, Tshabangu Declares",
            "url": "https://www.zimeye.net/2025/07/29/remove-us-dollar-embrace-zig-tshabangu-declares/",
            "content": "By Tinashe Sambiri\n\nControversial Citizens Coalition for Change (CCC) Secretary General, Senator Sengezo Tshabangu, has stirred public outrage after calling for Zimbabwe to fully adopt the newly introduced Zimbabwe Gold (ZiG) currency as the countrys sole legal tender.\n\nSpeaking over the weekend, Tshabangu declared it was time for Zimbabweans to embrace economic self-determination by moving away from foreign currencies.\n\nAs Parliament, we wish to have our own currency in Zimbabwe and as a country to have self-determination. Forward ever, backwards never, he said.\n\nTshabangus comments quickly sparked backlash, with critics accusing him of making reckless and poorly informed statements on a sensitive economic issue.\n\nFormer CCC youth assembly spokesperson Stephen Sarkozy Chuma slammed the remarks as wishful, ill-advised and baseless.\n\nTshabangu must understand that currency issues are deeply rooted in confidence and stability, not slogans, Chuma said.\n\nHis statement also drew sharp criticism on social media, where many users blasted the senator for what they described as a dangerous and populist stance at a time when trust in local currency remains fragile.\n\nThis is how economies collapsethrough careless political posturing, one user posted on X (formerly Twitter), while another commented, ZiG cant buy bread, and Tshabangu wants us to ditch the dollar?\n\nThe ZiG, introduced by the Reserve Bank of Zimbabwe in April 2024 to replace the inflation-wracked Zimbabwe dollar, has so far struggled to gain traction in everyday transactions, with most Zimbabweans preferring the US dollar due to stability and broader acceptance.\n\nDespite Tshabangus bold call, analysts say full de-dollarisation will require more than patriotic rhetoricit needs sound economic fundamentals, trust, and real value backing the local currency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Controversial Citizens Coalition for Change (CCC) Secretary General, Senator Sengezo Tshabangu, has stirred public outrage after calling … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/remove-us-dollar-embrace-zig-tshabangu-declares/\">Continue reading<span class=\"screen-reader-text\"> \"Remove US Dollar, Embrace ZiG, Tshabangu Declares\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "Another Horrific Crash Near Manyame: Sprinter Veers Off Road, Several Injured Near Chinhamo Bridge",
            "url": "https://www.zimeye.net/2025/07/29/another-horrific-crash-near-manyame-sprinter-veers-off-road-several-injured-near-chinhamo-bridge/",
            "content": "By A Correspondent\n\nJust a few kilometres from the site of last weeks deadly Manyame Bridge accident that claimed 17 lives, another horrific road traffic incident has occurred  this time near Chinhamo Bridge.\n\nAccording toZBC News, several passengers were seriously injured when a Mercedes Benz Sprinter commuter omnibus, travelling from Chitungwiza to Harare, burst a tyre and veered off the road on Tuesday.\n\nEmergency services rushed to the scene, and the injured were ferried to Chitungwiza Hospital for urgent medical attention.\n\nThe Zimbabwe Republic Police (ZRP) is yet to release an official statement on the incident.\n\nThe crash comes barely a week after the nation was plunged into mourning following a high-impact collision involving a Honda Fit and a truck at nearby Manyame Bridge  a tragic reminder of the worsening road safety crisis along this busy corridor.\n\nRoad safety advocates are once again calling for immediate interventions, including routine vehicle inspections, driver education, and stricter enforcement of traffic laws.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Just a few kilometres from the site of last week’s deadly Manyame Bridge accident that claimed 17 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/another-horrific-crash-near-manyame-sprinter-veers-off-road-several-injured-near-chinhamo-bridge/\">Continue reading<span class=\"screen-reader-text\"> \"Another Horrific Crash Near Manyame: Sprinter Veers Off Road, Several Injured Near Chinhamo Bridge\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "Chivayo Buys 11 Cars in One Day As Questions Swirl Over Source of Funds…",
            "url": "https://www.zimeye.net/2025/07/29/chivayo-buys-11-cars-in-one-day-as-questions-swirl-over-source-of-funds/",
            "content": "By A CorrespondentControversial businessman and ZANU PF benefactor Wicknell Chivayo has raised eyebrows once again after revealing that he spent US$500,000 in a single day to buy 11 brand-new vehicles  including luxury SUVs  for church leaders and a party-linked media officer.\n\nThe self-styled philanthropist, whose close links to President Emmerson Mnangagwa and alleged involvement in shady state tenders have made him a household name, announced the donations via a lengthy Facebook post on Tuesday.\n\nHaving woken up in a good mood yesterday, I decided to spend US$500,000 on cars for my fellow church members, Chivayo wrote.\n\nHe said the recipients were all senior leaders in the Johanne Masowe Chishanu apostolic sect, praising their spiritual leadership and commitment to service.\n\nAmong those rewarded were Madzibaba Gibson Nyanhi from Chiweshe and the late Madzibaba Mathias Mandaza from Domboshava, whose 2025 Toyota Fortuner will go to his son. Another Fortuner was given to Madzibaba Boniface Muteze of Domboshava.\n\nChivayo directed the leaders to collect their fully paid 2025 Toyota Fortuner 2.8 GD6 SUVs, all white in colour, from Exquisite Car Dealership.\n\nThe spree didnt end there.\n\nChivayo also said seven Toyota Hilux single cab vehicles were ready for collection at Faramatsi Motors. The beneficiaries include:\n\nMadzibaba Jefreyson Shonhayi (Marondera)\n\nMadzibaba Kennedy Chitekuteku (Marondera)\n\nMadzibaba Tungamirai Musemwa (Coca-Cola)\n\nMadzibaba Shepherd Nyakudya (Domboshava)\n\nMadzibaba Anesu Chizarura (Domboshava)\n\nMadzibaba Caleb Nyakudya (Domboshava)\n\nMadzibaba Ezibon Mandaza (Domboshava)\n\nA final vehicle went to Moore Samson Muzira of the ZANU PF Midlands News Desk.\n\nEnjoy your new cars, Madzibaba, and may your footsteps continue to be inspired, anointed and led by the Spirit, Chivayo concluded.\n\nWhile some have praised the gesture, critics have blasted the move as a glaring display of elite excess in a country where millions struggle with poverty, inflation, and collapsing public services.\n\nWhere is all this money coming from, and why is it being thrown at cars for church and party cronies while hospitals are falling apart? asked one political analyst.\n\nChivayo, who has been linked to multi-million-dollar government tenders  including controversial energy deals  has never been held to account despite public outcry. His repeated high-value donations continue to fuel speculation over impunity and unchecked corruption at the highest levels.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A CorrespondentControversial businessman and ZANU PF benefactor Wicknell Chivayo has raised eyebrows once again after revealing that he spent … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/chivayo-buys-11-cars-in-one-day-as-questions-swirl-over-source-of-funds/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Buys 11 Cars in One Day As Questions Swirl Over Source of Funds…\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "Another Serious Accident Along Seke Road",
            "url": "https://www.zimeye.net/2025/07/29/another-serious-accident-along-seke-road/",
            "content": "A minibus carrying passengers burst its tyre before rolling, injuring about 13 people moments ago, close to PaChinhamo along Seke Road in Harare.\n\nThis happened exactly a week after 17 people died in a horror crash along Seke Road.\n\nOn Sunday and Monday, two pedestrians were killed along Seke Road, in separate accidents.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A minibus carrying passengers burst its tyre before rolling, injuring about 13 people moments ago, close to PaChinhamo along Seke … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/another-serious-accident-along-seke-road/\">Continue reading<span class=\"screen-reader-text\"> \"Another Serious Accident Along Seke Road\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "We Are Invincible, Boasts Zanu PF Murakashi…",
            "url": "https://www.zimeye.net/2025/07/29/we-are-invincible-boasts-zanu-pf-murakashi/",
            "content": "By A Correspondent\n\nZANU PF activist and vocal online campaigner Mairosi Watungwa has declared the ruling party invincible following a clean sweep in the weekends by-elections, where the party won all six contested wards across various districts.\n\nSpeaking after the results were announced, Watungwa said: The recent by-elections have once again confirmed ZANU PFs unshakable position as the peoples party and the cornerstone of Zimbabwes political identity.\n\nWatungwa hailed the results as proof of continued trust from the electorate. With a commanding 85% of the votes cast, ZANU PF has reaffirmed its stature as the only political formation in which citizens continue to place their hopes, she said.\n\nZANU PF clinched three of the key wards with wide margins. In Chikomba Ward 10, candidate Tafadzwa Mukandi polled 477 votes against the oppositions 290. In Chiredzi Ward 4, Austin Phikelele dominated with 1,577 votes, while the opposition lagged far behind with just 265.\n\nThe most dramatic result came from Marondera Ward 6, where ZANU PFs Fiona Tongawashe won an overwhelming 928 votes, while the opposition managed only 22 votes.\n\nThese statistics speak volumes, not only about the peoples loyalty to ZANU PF but also about their growing disillusionment with alternative political actors, Watungwa added.\n\nThe outcome has further emboldened ruling party supporters online, many of whom took to social media platforms to celebrate what they see as a reaffirmation of the partys political dominance. Using hashtags like #Chakabatwa, ZANU PF sympathisers declared the opposition defeated and irrelevant.\n\nWhile the by-elections were held in wards traditionally viewed as strongholds for ZANU PF, the scale of the victories is being touted by party loyalists as a broader reflection of national sentiment.\n\nOpposition figures are yet to issue a formal response to the results.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF activist and vocal online campaigner Mairosi Watungwa has declared the ruling party “invincible” following a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/we-are-invincible-boasts-zanu-pf-murakashi/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Invincible, Boasts Zanu PF Murakashi…\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        },
        {
            "title": "ZIMFEST 2025 UNDER FIRE: Organisers Respond After Claims of Public Sex and Urination Erupt Online",
            "url": "https://www.zimeye.net/2025/07/29/zimfest-2025-under-fire-organisers-respond-after-claims-of-public-sex-and-urination-erupt-online/",
            "content": "By A Correspondent | ZimEye | Herefordshire, UK  29 July 2025 | Zimfest 2025, the flagship Zimbabwean cultural festival held in Herefordshire last Saturday, is facing a wave of criticism after attendees alleged disturbing public behaviour including urination in open spaces and outdoor sex acts. While the event organisers have publicly denied any wrongdoing or official fines, social media platforms have been flooded with complaints, raising questions about safety and event management.\n\nThe backlash was triggered after festivalgoer Janet Manuel C, a self-described Top Fan, posted a string of viral Facebook comments slamming attendee conduct and festival oversight.\n\nIts a family event, munhu know your body. Some were dressed like going to touchline, she wrote.\n\nMatoilets aipepo wani, why kuitira panze?\n\nHakuna makids akadaro, she added, highlighting how unsuitable the environment was for children.\n\nMost shockingly, she alleged: Nekutoiita sex panze, used condoms were found outside.\n\nThe allegations sparked alarm across the diaspora community, with many calling for accountability and stricter controls at future editions of the festival.\n\n Organisers Respond: No Fine Was Issued\n\nIn response to the mounting criticism, the official Zimfest Live Facebook page issued a statement Monday evening:\n\nJust to clarify; no fine was issued to the organisers and were proud of how well everyone represented the community. Were listening to your feedback as we work to improve and grow.\n\nThe post thanked attendees for making the event unforgettable and encouraged positive vibes only with hashtags like #Zimfest2025, #ZimfestFamily, and #SeeYouIn2026.\n\n Legal Context and Potential Risks\n\nWhile Zimfest organisers have denied being fined, the described behaviourparticularly public sex and urinationcould constitute violations under UK law, including:\n\nThere is no evidence yet that Herefordshire Council has launched a formal investigation, but the presence of children and the scale of the allegations could prompt future licensing scrutiny.\n\n Community Divided\n\nWhile some applauded Zimfests cultural unity and musical talent, others are calling for reforms.\n\nWe cant ignore this. It was advertised as family-friendly but some of what happened was disgraceful, said one parent who attended with her children.\n\nOthers defended the event and blamed a small number of individuals for spoiling an otherwise well-organised celebration.\n\n Whats Next?\n\nAs Zimfest begins planning for its 2026 edition, organisers now face pressure to enhance crowd management, increase security presence, and enforce decency standards. Meanwhile, critics continue to question whether enough has been done to protect public safety.\n\nFor now, the organisers maintain their position: no fine, no failurejust lessons to grow from.\n\nBACKGROUND.\n\nIn the UK, there are no specific fines that attach to function hosts solely because an attendee urinates in an open space. However, individuals caught urinating in public can face legal consequences, and event organisers may face penalties or enforcement action in certain circumstances. Heres a breakdown:\n\n For the Individual:\n\nPublic urination is typically treated as a summary offence under local bylaws or public order laws:\n\n For the Host or Event Organiser:\n\nIf you are hosting a private event (e.g. a wedding, house party, or festival), you arent automatically fined if someone urinates in public. However:\n\n Summary:\n\nIf youre hosting a large event in the UK, its best practice to:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Herefordshire, UK – 29 July 2025 | Zimfest 2025, the flagship Zimbabwean cultural festival … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/29/zimfest-2025-under-fire-organisers-respond-after-claims-of-public-sex-and-urination-erupt-online/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMFEST 2025 UNDER FIRE: Organisers Respond After Claims of Public Sex and Urination Erupt Online\"</span></a></p>",
            "time": "21:34",
            "date": "29 Jul 2025"
        }
    ]
}