{
    "news": [
        {
            "title": "Mliswa Unleashes Explosive Allegations Against VP Chiwenga Barely a Day After Threatening Him",
            "url": "https://www.zimeye.net/2025/09/29/mliswa-unleashes-explosive-allegations-against-vp-chiwenga-barely-a-day-after-threatening-him/",
            "content": "By A Correspondent | Barely 24 hours after publicly threatening Vice President Constantino Chiwenga with exposure, former Norton MP Temba Mliswa has unleashed a barrage of corruption allegations against President Emmerson Mnangagwas automatic successor, alleging multi-million dollar kickbacks and wedding indulgences.\n\nOn Sunday night, Mliswa announced what he called four explosive episodes designed to hold Chiwenga to account, adding that if the Vice President failed to respond he must resign.\n\nThe nation must brace itself for four episodes that require Chiwenga to respond if he is clean, Mliswa declared.\n\nIn a string of posts on Monday morning, Mliswa accused Chiwenga of soliciting lavish gifts, including six Rolls Royces for his wedding, US$250,000 for wedding preparations, another US$250,000 during the wedding itself, US$250,000 for a Seychelles honeymoon at the Four Seasons, and R2 million in shopping money in South Africa. He further alleged that Chiwenga demanded US$450,000 from Wicknell Chivayo to purchase three apartments for his children, claiming the scandal began when Chivayo allegedly failed to deliver one of the promises.\n\nMliswas revelations come amid intensifying manoeuvres to push Chiwenga out of office. According to sources close to the ruling party, an internal drive to force the Vice President to step aside has been launched, positioning Mnangagwa loyalists to consolidate power.\n\nThis marks a dramatic turn for Mliswa, whos a long time vocal campaigner for Emmerson Mnangagwa. He, Chiwenga, and activist Blessed Geza were among the earliest backers of Mnangagwas rise during the 2017 military coup that toppled Robert Mugabe, and later during the 1 August 2018 violent overthrow of Nelson Chamisas electoral win and the chaotic 2023 elections condemned by SADC. For years, the trio maintained public silence over abuses, including the use of impostor, Sengezo Tshabangu in Parliament  denounced by the Inter-Parliamentary Union  and caught on camera by ZimEyes Simba Chikanza at Harares Crowne Plaza in December 2023.\n\nNow, however, the alliance has splintered as Mnangagwa attempts to amend ZANU PFs constitution to extend his presidency to 2030. Mliswas latest allegations  if substantiated  represent the most direct challenge yet to Chiwengas credibility as Mnangagwas heir apparent.\n\nCritics of Mliswa, including activist Kerina Mujati, accuse him of hypocrisy and of benefiting from the same corruption he now condemns. But with the stakes so high, Zimbabwes political class is bracing for a public showdown.\n\nVP Chiwenga did not respond to the allegations. His supporters who include Mujati fired back with counter accusations against Mliswa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | Barely 24 hours after publicly threatening Vice President Constantino Chiwenga with exposure, former Norton MP Temba … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/29/mliswa-unleashes-explosive-allegations-against-vp-chiwenga-barely-a-day-after-threatening-him/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa Unleashes Explosive Allegations Against VP Chiwenga Barely a Day After Threatening Him\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "13 Die in Minibus, Truck Crash…",
            "url": "https://www.zimeye.net/2025/09/29/13-die-in-minibus-truck-crash/",
            "content": "By A Correspondent\n\nAuthorities have confirmed that 13 people, including a seven-year-old girl, died in a tragic minibus taxi crash on the R81 near Ga-Sekgopo, South Africa. The earlier reports that cited six fatalities have now been corrected.\n\nThe victims were passengers of a minibus taxi travelling from a church service in Solomondale to Magoro village when the accident occurred. Authorities said the crash scene was devastating, with first responders working to recover the deceased and assist survivors.\n\nIn a statement on Monday, a South African transport official said, We regret the earlier error in reporting and have updated our figures to reflect the accurate number of lives lost. Our condolences go to the families and communities affected by this tragedy.\n\nFurther details, including the circumstances surrounding the crash and the condition of survivors, are being provided in official updates and comments from authorities.\n\nThe incident serves as a stark reminder of road safety concerns on rural routes in the region, particularly for vehicles transporting large numbers of passengers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Authorities have confirmed that 13 people, including a seven-year-old girl, died in a tragic minibus taxi crash … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/29/13-die-in-minibus-truck-crash/\">Continue reading<span class=\"screen-reader-text\"> \"13 Die in Minibus, Truck Crash…\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Tsvangirai Could Be Turning in His Grave as Harvest House Faces Closure",
            "url": "https://www.zimeye.net/2025/09/29/tsvangirai-could-be-turning-in-his-grave-as-harvest-house-faces-closure/",
            "content": "By a Correspondent  Douglas Mwonzora is staring at a crushing symbolic defeat as the Harare City Council moves to shut down Harvest House, the iconic headquarters of the Movement for Democratic Change (MDC), over more than US$50,000 in unpaid rent and municipal charges.\n\nFor two decades, Harvest House  located in the heart of Harares central business district  stood as a towering emblem of opposition politics in Zimbabwe. Under the late Morgan Tsvangirai, it became a sanctuary of democratic resistance and a rallying point for millions who dreamed of political change.\n\nBut today, the building that once embodied hope risks descending into ruin.\n\nMwonzora seized control of Harvest House in 2020 after a bruising leadership battle that ended with a controversial Supreme Court ruling nullifying Nelson Chamisas presidency of the MDC. His takeover, widely seen as state-assisted, was marred by violent clashes between rival factions as he fought to secure control of the partys assets.\n\nSince then, however, Mwonzoras faction has struggled to keep the party afloat. Insiders admit that no meaningful rentals or municipal dues have been paid for years, with debts ballooning as donor support evaporated and disillusioned supporters defected in droves. Poor financial management and dwindling political relevance have left the party broke and rudderless.\n\nCity of Harare officials confirmed that unless the arrears are settled immediately, Harvest House will be shut down and possibly auctioned to recover the debt.\n\nPolitical analysts say the looming closure symbolizes the dramatic collapse of the MDC, once Zimbabwes most formidable opposition movement. What was once a hub of democratic struggle is now at risk of becoming a derelict relic on Harares skyline  a stark reflection of the partys deep fractures and Mwonzoras much-criticized leadership.\n\nFor Mwonzora, losing Harvest House would not just be a financial disaster. It would be a humiliating political setback, stripping him of the very symbol that lent his contested leadership a measure of legitimacy.\n\nAnd for many, the potential closure is a haunting reminder of how far the party has fallen since the days of Tsvangirai  a man whose vision and courage once inspired a nation, and who, as some critics bitterly note, must be turning in his grave.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By a Correspondent – Douglas Mwonzora is staring at a crushing symbolic defeat as the Harare City Council moves to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/29/tsvangirai-could-be-turning-in-his-grave-as-harvest-house-faces-closure/\">Continue reading<span class=\"screen-reader-text\"> \"Tsvangirai Could Be Turning in His Grave as Harvest House Faces Closure\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Mnangagwa Splashes Funds on Teachers 4ED as Classrooms Crumble",
            "url": "https://www.zimeye.net/2025/09/29/mnangagwa-splashes-funds-on-teachers-4ed-as-classrooms-crumble/",
            "content": "By A Correspondent\n\nWhile schools across Zimbabwe face shortages of textbooks, congested classrooms, and demoralised staff, President Emmerson Mnangagwa has chosen to channel US$500 000 into the partisan Teachers for Economic Development (Teachers 4ED) grouping.\n\nCritics say the move is yet another example of misplaced priorities and political patronage.\n\nThe revolving fund, launched at the Teachers for ED Economic Empowerment Conference in Harare on Saturday, allocates US$50 000 to each of the countrys ten provinces for income-generating projects.\n\nPresidential Investment Advisor Dr Paul Tungwarara praised the initiative, claiming: Today we are here to celebrate and empower teachers. The Presidential Empowerment Programme is an initiative to empower teachers. All of us were taught by teachers and it is that same teacher that opened our minds to the world of wonders.\n\nYet for the vast majority of teachers outside the Teachers 4ED structure, the reality remains bleaksalaries that barely cover basic living costs and working conditions that continue to deteriorate.\n\nZANU PF Political Commissar Munyaradzi Machacha told the gathering: You must put this fund to good use and ensure everyone benefits. We have set up a monitoring and evaluation committee to ensure the funds are disbursed to the right beneficiaries and used for their intended purposes.\n\nTeachers for ED National Chairperson Ropafadzo Matemavi revealed the partisan nature of the group, saying: Our teachers under Teachers for ED have been attending lectures at the Chitepo School of Ideology. That is where we are taught about the need to decolonise the mind and empower ourselves. So, this fund will go a long way in sustaining our projects.\n\nOn top of the cash injection, Teachers for Economic Development also received 12 new vehicles for organisational mobility and coordination.\n\nObservers argue that such selective empowerment schemes reveal the governments prioritiesrewarding loyalty instead of addressing the deepening crisis in Zimbabwes education system.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent While schools across Zimbabwe face shortages of textbooks, congested classrooms, and demoralised staff, President Emmerson Mnangagwa has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/29/mnangagwa-splashes-funds-on-teachers-4ed-as-classrooms-crumble/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Splashes Funds on Teachers 4ED as Classrooms Crumble\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Black Market ‘Shrinking’? Traders Say Reality Tells a Different Story",
            "url": "https://www.zimeye.net/2025/09/29/black-market-shrinking-traders-say-reality-tells-a-different-story/",
            "content": "By A Correspondent\n\nThe Reserve Bank of Zimbabwe (RBZ) has claimed that the black market is shrinking due to economic stability and rising foreign currency reserves.\n\nHowever, critics warn that the reported progress may be overstated, with informal currency trading continuing to affect ordinary Zimbabweans.\n\nRBZ Governor Dr. John Mushayavanhu told The Sunday Mail that the year-long stabilization of the Zimbabwe Gold (ZiG) currency had helped align retail and parallel market rates. The sustained stability in the exchange rate and inflation has supported robust economic activity and greater growth momentum in the economy, he said.\n\nMushayavanhu highlighted the role of foreign currency inflows, which reached US$10.4 billion between January and August, and reserves that have grown to about US$900 million. The low and stable month-on-month inflation is supporting the disinflation trajectory, which will result in annual ZiG inflation undershooting the initial target of 30 percent to levels around 20 percent by the end of 2025, he added.\n\nDespite these assurances, many economists and business owners remain skeptical about the central banks claims. While official rates and ZiG stability may look good on paper, the black market continues to flourish, said an independent analyst. Access to foreign currency remains limited, and many transactions are still taking place outside official channels.\n\nMushayavanhu insisted that fiscal restraint and prudent monetary policy had bolstered confidence in the financial system. Moreover, the Reserve Banks commitment to staying the course boosted confidence in monetary and financial affairs, thus eliminating the credibility premium on the exchange rate and inflation fronts, he said.\n\nYet traders report persistent challenges. Its nearly impossible to get enough US dollars at the official rate, so we are forced to use parallel market rates, which are often higher, said a Harare shop owner. The black market is far from disappearing.\n\nThe ZiG currency, introduced in April 2024 to replace the Zimbabwe dollar, was intended to restore public confidence, but experts warn that its stability is largely dependent on foreign inflows rather than a resilient domestic economy.\n\nAs Zimbabweans continue to face high prices and limited access to foreign currency, the so-called shrinking black market may prove to be more of a political claim than a reflection of reality.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Reserve Bank of Zimbabwe (RBZ) has claimed that the black market is shrinking due to economic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/29/black-market-shrinking-traders-say-reality-tells-a-different-story/\">Continue reading<span class=\"screen-reader-text\"> \"Black Market ‘Shrinking’? Traders Say Reality Tells a Different Story\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Herald Publicises BioDiesel Rise Claim",
            "url": "https://www.zimeye.net/2025/09/29/herald-publicises-biodiesel-rise-claim/",
            "content": "Grand Claims of 75 000 L/Day Biodiesel Output Under Scrutiny\n\nBy Daniel Staines | Analysis | Harare, 29 September 2025  A sweeping new claim that Finealt Engineering has upgraded its plant to push daily biodiesel production from 3 000 L to 75 000 L has drawn intense scepticism from energy analysts, environmental scientists, and independent data sources. The hyperbole in the Heralds coverage is now provoking questions over realism, feasibility, and the credibility of rural industrialisation narratives.\n\nWhy the 75 000 L/day Claim Is Highly Doubtful\n\n1.\n\nMismatch with National and International Production Data\n\n2.\n\nFeedstock, Logistics, and Land Constraints\n\n3.\n\nEnergy, Infrastructure & Operational Realities\n\n4.\n\nGlobal Trends Show Slower Growth and Retrenchments\n\n5.\n\nPolitical Messaging Over Technical Transparency\n\nWhat a Credible Path Forward Would Look Like\n\nA realistic rollout should start modestly and transparently, with the following steps:\n\nOnly with that kind of measured, empirical transparency can such a project move from rhetorical promise to technical credibility.\n\nBottom Line\n\nThe leap from 3 000 L to 75 000 L per day is, by any standard, extraordinaryand so far unsupported by empirical measurements, national statistics, or industry precedent. Instead of hyperbolic declarations, what is needed is disciplined demonstration, careful scaling, and transparent verification. Until then, the public and stakeholders should view the heralded biodiesel revolution with considerable scepticism.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Grand Claims of “75 000 L/Day” Biodiesel Output Under Scrutiny By Daniel Staines | Analysis | Harare, 29 September 2025 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/29/herald-publicises-biodiesel-rise-claim/\">Continue reading<span class=\"screen-reader-text\"> \"Herald Publicises BioDiesel Rise Claim\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Chiwenga Champions Youth and Culture with Launch of Mwana Anokosha Organisation",
            "url": "https://www.zimeye.net/2025/09/29/chiwenga-champions-youth-and-culture-with-launch-of-mwana-anokosha-organisation/",
            "content": "By Shelton Muchena |  Vice President General (Rtd) Dr. Constantino Chiwenga today emerged as a true champion of Zimbabwes youth, culture, and community development as he officially launched the Mwana Anokosha Private Voluntary Organisation and its accompanying Visual Arts Gallery at the organisations new headquarters in Hwedza.\n\nThe colourful event drew a host of senior government officials, including Youth Affairs Minister Tino Machakaire, underscoring the national importance of the initiative.\n\nIn his keynote address, Dr. Chiwenga spoke passionately about nurturing young talent and safeguarding Zimbabwes cultural heritage through art, innovation, and social support systems. Every child is precious, every talent must be nurtured, and every community deserves a chance to thrive. That is the spirit of Mwana Anokosha, he declared to thunderous applause.\n\nThe Visual Arts Gallery, the first of its kind in Hwedza, is set to become a hub of creativity, offering young Zimbabweans a platform to showcase their artistry, preserve traditional expressions, and build sustainable livelihoods through cultural enterprise.\n\nMinister Machakaire hailed the launch as a turning point for Zimbabwean youth, praising Dr. Chiwengas vision and commitment. The Vice President has once again demonstrated that he is a true father figure to our young people. This initiative is about giving our children hope, dignity, and a future. It is about making sure that no talent is wasted, and no dream is left behind, said Machakaire.\n\nCommunity leaders, local artists, and residents echoed the ministers sentiments, describing the Vice Presidents efforts as transformative. Among the attendees was 19-year-old visual artist Tendai Mupakati, who expressed gratitude for the opportunity the gallery presents. For us as young artists, this is life-changing. Before today, many of us had no place to showcase our work. Now we have a home, a stage, and the recognition we have been praying for. The Vice President has given us a voice, said Mupakati.\n\nDr. Chiwengas growing connection with communities across the nation has positioned him as a unifying figure, admired for his dedication to people-centred development. Despite recent attempts by detractors to tarnish his image with baseless allegations, the overwhelming support from citizens reflects a leader whose actions speak louder than political noise.\n\nThe launch of Mwana Anokosha marks a significant milestone in Zimbabwes efforts to strengthen social cohesion, promote youth empowerment, and protect vulnerable groups  values that resonate with families across the country.\n\nWith this initiative, Dr. Chiwenga has not only placed Hwedza on the cultural map but also reaffirmed his role as a national leader determined to uplift Zimbabwe through vision, action, and an unshakable belief in its people.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Shelton Muchena | — Vice President General (Rtd) Dr. Constantino Chiwenga today emerged as a true champion of Zimbabwe’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/29/chiwenga-champions-youth-and-culture-with-launch-of-mwana-anokosha-organisation/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Champions Youth and Culture with Launch of Mwana Anokosha Organisation\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Should VP Chiwenga listen to Mliswa’s call to resign?",
            "url": "https://www.zimeye.net/2025/09/28/should-vp-chiwenga-listen-to-mliswas-call-to-resign/",
            "content": "video loading below\n\nShould VP Chiwenga listen to Mliswas call to resign?\n\nThe move to push VP Constantino Chiwenga out of employment has been launched, with former Norton MP@TembaMliswaannouncing four episodes geared to pressure him into alleged accountability. If he fails the test he must resign, says Mliswa.Speaking in his Sunday program onhttps://t.co/Hn8KhXTdq5pic.twitter.com/WClxQKNgiM\n\nBy A Correspondent | ZimEye | The move to push VP Constantino Chiwenga out of employment has been launched, with former Norton MP @TembaMliswa announcing four episodes geared to pressure him into alleged accountability. If he fails the test he must resign, says Mliswa.\n\nSpeaking in his Sunday program on ZimEye, Sabhuku Mliswa said, the nation must brace for four episodes that require Chiwenga to respond if he is clean.\n\nThe development comes as other critics like @kerinamujati opposed Mliswa accusing him of the corruption he talks against.\n\nMliswa has been a campaigner for the ZANU PF dictator Emmerson Mnangagwa for 9 years since 2016 when him, Chiwenga and the activist @BlessedGeza began routing for Mnangagwa to take over the presidency in a violent military coup in 2017. They continued to support Mnangagwa in the 2nd military coup which was the violent overthrow of Nelson Chamisas 2018 win on 1 Aug 2018. They worked together even during the violent 2023 elections of which @SADC_News condemned Mnangagwas win.\n\nThe three did not say anything when the worlds most authoritative parliamentary institution the @IPUparliament denounced Mnangagwas fake opposition Sengezo Tshabangu calling him an imposter who was later caught on camera by @schikanza at Crowne Plaza Hotel Harare on 4 Dec 2023.\n\nThey have however just recently parted political ways after Mnangagwa began to change the constitution of ZANU PF so to extend his presidency to 2030.\n\nVP Chiwenga did not respond to the allegations raised by Mliswa.\n\n| WHAT DO YOU THINK MLISWA IS GOING TO SAY?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below By A Correspondent | ZimEye | The move to push VP Constantino Chiwenga out of employment has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/should-vp-chiwenga-listen-to-mliswas-call-to-resign/\">Continue reading<span class=\"screen-reader-text\"> \"Should VP Chiwenga listen to Mliswa’s call to resign?\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Indigenous Churches Hail VP Chiwenga as a God-Given Leader",
            "url": "https://www.zimeye.net/2025/09/28/indigenous-churches-hail-vp-chiwenga-as-a-god-given-leader/",
            "content": "By A Correspondent\n\nChurch leaders from different denominations have expressed their admiration for Vice President Constantino Chiwenga, describing him as a God-given leader dedicated to guiding Zimbabwe through difficult times.\n\nThe praise comes after his recent participation in the launch ofMwana Anokosha, a private voluntary organization (PVO) focused on supporting children with disabilities across the country.\n\nPastor Isaac Makomichi of Masvingo applauded the Vice President, saying: Vice President Chiwenga is a leader from God. While his critics try to tarnish his name, he is busy safeguarding children with disabilities. That is what makes him stand out.\n\nHe further described Chiwenga as a caring figure deserving  protection and gratitude- also thanking President Emmerson Mnangagwa for appointing him to serve as one of the Vice Presidents.\n\nA prominent prophet, who requested anonymity out of fear of persecution, also commended the Vice Presidents leadership. Chiwenga is a true example of a Christian, the prophet said, pointing to his efforts to uplift vulnerable groups, especially children with disabilities.\n\nMwana Anokoshaseeks to promote inclusivity by bridging the gap between children with disabilities and their peers. Its mission is to guarantee equal access to basic needs, opportunities, and dignity for children living with disabilities.\n\nThe organization operates in line with Zimbabwes Childrens Act and international conventions such as the UN Convention on the Rights of Persons with Disabilities (CRPD). It collaborates with families, communities, local authorities, and development partners to achieve its goals.\n\nBy backing initiatives likeMwana Anokosha, Vice President Chiwenga continues to demonstrate his commitment to uplifting disadvantaged communities and improving the lives of children living with disabilities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Church leaders from different denominations have expressed their admiration for Vice President Constantino Chiwenga, describing him as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/indigenous-churches-hail-vp-chiwenga-as-a-god-given-leader/\">Continue reading<span class=\"screen-reader-text\"> \"Indigenous Churches Hail VP Chiwenga as a God-Given Leader\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "BREAKING: VP Chiwenga Told To Resign Tonight Over Corruption Allegations",
            "url": "https://www.zimeye.net/2025/09/28/breaking-vp-chiwenga-told-to-resign-tonight-over-corruption-allegations/",
            "content": "video loading below\n\nShould VP Chiwenga listen to Mliswas call to resign?\n\nThe move to push VP Constantino Chiwenga out of employment has been launched, with former Norton MP@TembaMliswaannouncing four episodes geared to pressure him into alleged accountability. If he fails the test he must resign, says Mliswa.Speaking in his Sunday program onhttps://t.co/Hn8KhXTdq5pic.twitter.com/WClxQKNgiM\n\nBy A Correspondent | ZimEye | The move to push VP Constantino Chiwenga out of employment has been launched, with former Norton MP @TembaMliswa announcing four episodes geared to pressure him into alleged accountability. If he fails the test he must resign, says Mliswa, whos an alleged spokesman of the zvigananda (gluttons) group who are running the country on President Emmerson Mnangagwas behalf.\n\nSpeaking in his Sunday program on ZimEye, Sabhuku Mliswa said, the nation must brace for four episodes that require Chiwenga to respond if he is clean.\n\nThe development comes as other critics like @kerinamujati opposed Mliswa accusing him of the corruption he talks against.\n\nMliswa has been a campaigner for the ZANU PF dictator Emmerson Mnangagwa for 9 years since 2016 when him, Chiwenga and the activist @BlessedGeza began routing for Mnangagwa to take over the presidency in a violent military coup in 2017. They continued to support Mnangagwa in the 2nd military coup which was the violent overthrow of Nelson Chamisas 2018 win on 1 Aug 2018. They worked together even during the violent 2023 elections of which @SADC_News condemned Mnangagwas win.\n\nThe three did not say anything when the worlds most authoritative parliamentary institution the @IPUparliament denounced Mnangagwas fake opposition Sengezo Tshabangu calling him an imposter who was later caught on camera by @schikanza at Crowne Plaza Hotel Harare on 4 Dec 2023.\n\nThey have however just recently parted political ways after Mnangagwa began to change the constitution of ZANU PF so to extend his presidency to 2030.\n\nVP Chiwenga did not respond to the allegations raised by Mliswa.\n\n| WHAT DO YOU THINK MLISWA IS GOING TO SAY?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "video loading below By A Correspondent | ZimEye | The move to push VP Constantino Chiwenga out of employment has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/28/breaking-vp-chiwenga-told-to-resign-tonight-over-corruption-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"BREAKING: VP Chiwenga Told To Resign Tonight Over Corruption Allegations\"</span></a></p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        }
    ]
}