{
    "news": [
        {
            "title": "‘O’ & ‘A’ Level Registration Dates Out",
            "url": "https://www.zimeye.net/2025/02/17/o-a-level-registration-dates-out/",
            "content": "Harare-The Zimbabwe School Examinations Council (ZIMSEC) has opened registration for the June and November 2025 Ordinary and Advanced Level examinations.\n\nZIMSEC has urged candidates to visit their nearest school or examination centre to complete the process before deadlines close.\n\nIn a statement, ZIMSEC said examination fees have been pegged in US dollars, with a Government subsidy available for candidates in public schools, local authority schools and non-profit mission schools. Private candidates, those attending private schools and those retaking subjects will be required to pay the full amount.The examinations body said O Level candidates will pay US$24 per subject, with the Government covering US$13 for eligible candidates leaving them to pay US$11.ALevel candidates will be required to pay US$48 per subject, with a Government subsidy of US$26 bringing the cost down to US$22 for qualifying students.Payments can be made in US dollars, South African Rand or the Zimbabwe Gold at the prevailing interbank rate as of March 10, 2024, for the June session and March 24, 2024, for the November session.ZIMSEC said the Government will subsidise a maximum of seven subjects at the OLevel and four subjects at ALevel including Communication Skills.The Council said the subsidy will not apply to candidates retaking any subjects and the Basic Education Assistance Module (BEAM) will not cover repeat exams.Parents and guardians have been advised to check with their respective schools or examination centres for specific registration deadlines.Stakeholders are encouraged to contact their respective centres for registration closing dates to avoid any inconvenience, ZIMSEC said.With the exam season fast approaching, students are being urged to register early and take advantage of the available Government subsidies.For further details, candidates have been urged to visit their nearest school, examination centre or the official ZIMSEC website.-State media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare-The Zimbabwe School Examinations Council (ZIMSEC) has opened registration for the June and November 2025 Ordinary and Advanced Level examinations. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/o-a-level-registration-dates-out/\">Continue reading<span class=\"screen-reader-text\"> \"‘O’ & ‘A’ Level Registration Dates Out\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "Suspect on the Run as Corpse Dumped at His House",
            "url": "https://www.zimeye.net/2025/02/17/suspect-on-the-run-as-corpse-dumped-at-his-house/",
            "content": "By A Correspondent | A chilling and symbolic act of protest has sent shockwaves through Kwekwes Mbizo suburb, as the body of Ms. Anna Matambobrutally axed to deathwas temporarily dumped at the residence of her fugitive boyfriend, the prime suspect in her murder.\n\nThe grisly murder, which took place at their Mbizo 13 lodgings on February 10, has sparked outrage, with Ms. Matambos relatives taking matters into their own hands. Last Thursday, they transported her remains to the suspects Mbizo 15 home, leaving the corpse on his verandah in a bold and ominous move before later taking it for burial in Gutu.\n\nAccording to the deceaseds uncle, Mr. Phillip Chidhakwa, the act was rooted in traditional beliefs, meant to ensure her spirit would seek vengeance on the alleged killer.\n\nAnna was my niece, my sisters daughter. She was murdered by her boyfriend. I received a call on Sunday evening informing me of her death, he said.\n\nDisturbingly, Ms. Matambos three childrenaged 13, 11, and 9witnessed the entire murder, watching in horror as their mother was struck three times on the head with an axe before she died on the spot.\n\nDespite the gravity of the case, Midlands Provincial police spokesperson Inspector Emmanuel Mahoko claimed they were unaware of the murder, raising serious questions about law enforcements response and the suspects apparent ease in escaping justice.\n\nWith the alleged killer still on the run, residents are left fearing for their safety as calls grow louder for authorities to act swiftly and bring the fugitive to justice.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | A chilling and symbolic act of protest has sent shockwaves through Kwekwe’s Mbizo suburb, as the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/suspect-on-the-run-as-corpse-dumped-at-his-house/\">Continue reading<span class=\"screen-reader-text\"> \"Suspect on the Run as Corpse Dumped at His House\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "Lavish Getaways for Harare Bosses",
            "url": "https://www.zimeye.net/2025/02/17/lavish-getaways-for-harare-bosses/",
            "content": "Harare City Councils housing director, Mr. Addmore Nhekairo, splurged US$8,000 on a luxurious family vacation to Zanzibar, while residents endure years without potable running water and the city struggles to procure basic necessities like toilet paper.\n\nTestifying before the Retired Justice Maphios Cheda-led commission, Mr. Nhekairo admitted to taking the trip in December last year, covering himself, his wife, and three children, using arrears from his US$2,500 annual holiday allowance, which was later reduced to US$2,000. Despite the citys financial crisis, he revealed that he is still owed another US$8,000 in unpaid holiday perks.\n\nThe revelations come as Harares top officials continue to enjoy hefty perks, with directors earning up to US$12,000 per month while junior employees face delayed salaries. The commission also exposed that the citys eight directors are entitled to fully paid holiday trips, covering spouses and up to three children at the expense of ratepayers, with destinations including Victoria Falls (local), Mauritius (regional), and Dubai (international).\n\nFurther bombshells emerged when assistant director to the town clerk, Matthew Marara, disclosed he received US$27,000 in holiday allowances while on suspension for 30 monthsincluding US$9,000 for local trips and US$18,000 for regional getaways.\n\nHarare residents, grappling with crippling service delivery failures, are left to question how a cash-strapped council can justify luxury vacations for executives while the citys basic infrastructure crumbles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare City Council’s housing director, Mr. Addmore Nhekairo, splurged US$8,000 on a luxurious family vacation to Zanzibar, while residents endure … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/lavish-getaways-for-harare-bosses/\">Continue reading<span class=\"screen-reader-text\"> \"Lavish Getaways for Harare Bosses\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "President Chamisa Dismisses Mnangagwa’s Third Term Agenda",
            "url": "https://www.zimeye.net/2025/02/17/president-chamisa-dismisses-mnangagwas-third-term-agenda/",
            "content": "By A Correspondent\n\nIn a bold move, citizens leaders Gift Ostallos Siziba and Amos Chibaya led a consultation programme on Sunday to resist President Emmerson Mnangagwas third term agenda. This comes as Mnangagwas supporters push for the extension of his term of office beyond constitutional limits, sparking widespread concern among citizens .\n\nAccording to Siziba, citizens have a crucial role to play in defending the constitution and upholding democratic principles.\n\nHe emphasized the importance of galvanizing the political base for the Democratic alternative, led by President Chamisa, and expressed gratitude to the people of Manicaland for their unwavering commitment to democracy.\n\nThe resistance to Mnangagwas 2030 agenda is gaining momentum, with many Zimbabweans taking a stand against the proposed constitutional amendments. Former Zanu PF political commissar and minister Saviour Kasukuwere has also joined the chorus, urging citizens to unite against Mnangagwas alleged plan to extend his presidency beyond the constitutional limit of 2028 .\n\nKasukuwere described the plan as a clear attempt at state capture and power consolidation for self-serving ends, warning that amending the constitution to extend Mnangagwas tenure represents a calculated assault on governance principles.\n\nAs the debate rages on, it is clear that Zimbabweans are determined to defend their constitution and uphold democratic principles. The resistance to the 2030 agenda is a testament to the power of citizen activism and the importance of holding leaders accountable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold move, citizens leaders Gift Ostallos Siziba and Amos Chibaya led a consultation programme on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/president-chamisa-dismisses-mnangagwas-third-term-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"President Chamisa Dismisses Mnangagwa’s Third Term Agenda\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "Chamisa Unpacks Meaning Of God Is In It Maxim",
            "url": "https://www.zimeye.net/2025/02/17/chamisa-unpacks-meaning-of-god-is-in-it-maxim/",
            "content": "By A Correspondent\n\nZimbabwes former opposition leader, Nelson Chamisa, has expressed optimism that change is imminent in the country. In a statement, Chamisa assured citizens that its only a matter of time before they fully understand the significance of his rallying cry: GOD IS IN IT .\n\nFellow citizens; Its a matter of time. You will soon fully know and wholly understand the true meaning, essence, substance, and significance of the words GOD IS IN IT #Godisinit, Chamisa said. And we shall all be happy again. Blessed Sunday family!\n\nChamisa, who left the Citizens Coalition for Change (CCC) party in January 2024, citing infiltration by the ruling ZANU PF party, remains a prominent figure in Zimbabwean politics . His resignation from the CCC was met with widespread support from millions of Zimbabweans who admire his leadership.\n\nAfter his departure from the CCC, Chamisa announced plans to establish a new political party, which would prioritize transparency, accountability, and progress for the betterment of the nation . Through this new party, Chamisa aims to introduce a fresh and innovative approach to politics, free from the influence of ZANU PF and its affiliated proxies.\n\nChamisas commitment to democratic values and his determination to bring about positive change in Zimbabwe have inspired countless citizens to join him in his quest for a better future. As he once said, If we stay united, we will soon prevail against the forces of evil and dictatorship. Ours is a righteous struggle to save our country .\n\nWith his latest statement, Chamisa is reaffirming his faith in the Zimbabwean people and his confidence that together, they can overcome even the most daunting challenges. As the country looks to the future, Chamisas message of hope and resilience is a powerful reminder that change is indeed possible, and that a brighter tomorrow is within reach.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s former opposition leader, Nelson Chamisa, has expressed optimism that change is imminent in the country. In … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/chamisa-unpacks-meaning-of-god-is-in-it-maxim/\">Continue reading<span class=\"screen-reader-text\"> \"Chamisa Unpacks Meaning Of God Is In It Maxim\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "It’s A Matter Of Time, Change Is Coming: Nelson Chamisa",
            "url": "https://www.zimeye.net/2025/02/17/its-a-matter-of-time-change-is-coming-nelson-chamisa/",
            "content": "By A Correspondent\n\nZimbabwes opposition leader, Nelson Chamisa, has expressed optimism that change is imminent in the country.\n\nIn a statement, Chamisa assured citizens that its only a matter of time before they fully understand the significance of his rallying cry: GOD IS IN IT .\n\nFellow citizens; Its a matter of time. You will soon fully know and wholly understand the true meaning, essence, substance, and significance of the words GOD IS IN IT #Godisinit, Chamisa said. And we shall all be happy again. Blessed Sunday family!\n\nChamisa, who left the Citizens Coalition for Change (CCC) party in January 2024, citing infiltration by the ruling ZANU PF party, remains a prominent figure in Zimbabwean politics . His resignation from the CCC was met with widespread support from millions of Zimbabweans who admire his leadership.\n\nAfter his departure from the CCC, Chamisa announced plans to establish a new political party, which would prioritize transparency, accountability, and progress for the betterment of the nation . Through this new party, Chamisa aims to introduce a fresh and innovative approach to politics, free from the influence of ZANU PF and its affiliated proxies.\n\nChamisas commitment to democratic values and his determination to bring about positive change in Zimbabwe have inspired countless citizens to join him in his quest for a better future. As he once said, If we stay united, we will soon prevail against the forces of evil and dictatorship. Ours is a righteous struggle to save our country .\n\nWith his latest statement, Chamisa is reaffirming his faith in the Zimbabwean people and his confidence that together, they can overcome even the most daunting challenges. As the country looks to the future, Chamisas message of hope and resilience is a powerful reminder that change is indeed possible, and that a brighter tomorrow is within reach.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s opposition leader, Nelson Chamisa, has expressed optimism that change is imminent in the country. In a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/its-a-matter-of-time-change-is-coming-nelson-chamisa/\">Continue reading<span class=\"screen-reader-text\"> \"It’s A Matter Of Time, Change Is Coming: Nelson Chamisa\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "Terror At Mnangagwa War Veterans Rally",
            "url": "https://www.zimeye.net/2025/02/17/terror-at-mnangagwa-war-veterans-rally/",
            "content": "By A Correspondent\n\nIn a dramatic turn of events, a podium collapsed during the launch of the War Veterans Support Programme on Saturday in Manicaland Province, casting a shadow over the occasion.\n\nThe launch, part of President Emmerson Mnangagwas ongoing political initiatives, was marred by this unfortunate incident, drawing attention to growing discontent among some party members.\n\nA Zanu PF source opposed to President Mnangagwas third-term agenda shared their frustration, stating:\n\nPodium yadonha ku Warvet Launch on Saturday in Manicaland Province  referring to the unexpected collapse of the podium during the event.\n\nThe source further expressed discontent with the conditions surrounding the event, emphasizing:\n\nDzorerai mweya wemagamba mundima, maswedera pedo neku Chimoio apa muchiziva kuti pa Chimoio hapana kana toilet zvayo apa vanopachengeta havana kana allowance  calling attention to the lack of basic amenities at Chimoio, and how those tasked with safeguarding the area receive no allowances.\n\nIn a powerful statement, the source concluded:Midzimu yenyika inotsamwa varume, suggesting that the spirits of the land are angered by the neglect of the veterans and their struggles.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a dramatic turn of events, a podium collapsed during the launch of the War Veterans Support … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/terror-at-mnangagwa-war-veterans-rally/\">Continue reading<span class=\"screen-reader-text\"> \"Terror At Mnangagwa War Veterans Rally\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "Citizens Resist 2030 Agenda",
            "url": "https://www.zimeye.net/2025/02/17/citizens-resist-2030-agenda/",
            "content": "By A Correspondent\n\nIn a bold move, citizens leaders Gift Ostallos Siziba and Amos Chibaya led a consultation programme on Sunday to resist President Emmerson Mnangagwas third term agenda. This comes as Mnangagwas supporters push for the extension of his term of office beyond constitutional limits, sparking widespread concern among citizens .\n\nAccording to Siziba, citizens have a crucial role to play in defending the constitution and upholding democratic principles. He emphasized the importance of galvanizing the political base for the Democratic alternative, led by President Chamisa, and expressed gratitude to the people of Manicaland for their unwavering commitment to democracy.\n\nThe resistance to Mnangagwas 2030 agenda is gaining momentum, with many Zimbabweans taking a stand against the proposed constitutional amendments. Former Zanu PF political commissar and minister Saviour Kasukuwere has also joined the chorus, urging citizens to unite against Mnangagwas alleged plan to extend his presidency beyond the constitutional limit of 2028 .\n\nKasukuwere described the plan as a clear attempt at state capture and power consolidation for self-serving ends, warning that amending the constitution to extend Mnangagwas tenure represents a calculated assault on governance principles.\n\nAs the debate rages on, it is clear that Zimbabweans are determined to defend their constitution and uphold democratic principles. The resistance to the 2030 agenda is a testament to the power of citizen activism and the importance of holding leaders accountable.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold move, citizens leaders Gift Ostallos Siziba and Amos Chibaya led a consultation programme on … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/17/citizens-resist-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"Citizens Resist 2030 Agenda\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "Tawanda Nyambirai Lands Top Troubled EcoCash Job",
            "url": "https://www.zimeye.net/2025/02/16/tawanda-nyambirai-lands-top-troubled-ecocash-job/",
            "content": "By Business Reporter  Renowned commercial lawyer and businessman Tawanda Nyambirai has been appointed the new Chief Executive of the troubled EcoCash Holdings Zimbabwe Limited (EHZL).\n\nNyambirai takes over from Eddie Chibi, who was, together with seven top executives, fired amid mounting dissatisfaction over the companys declining service quality.\n\nChibi, who has served as CEO since 2018\n\nNyambirai, who played a crucial role in the early days of Econet in the 1990s as a legal advisor and entrepreneur, has also been involved with Steward Bank, a subsidiary of EcoCash, since acquiring it in 2013.\n\nAnother high-profile departure is Darlington Mandivenga, a key figure in the rapid growth of EcoCash, who also stepped down.\n\nMandivenga was instrumental in establishing EcoCash as Zimbabwes leading mobile money service.\n\nEight directors have resigned, including Board Chairperson Sherree Gladys Shereni, while ten new directors havebeen appointedin a sweeping restructuring of EHZLs leadership.\n\nIn a notice to shareholders dated14 February2025 and signed by Group Company Secretary C.R. Daniels, EcoCash Holdings announced that Shereni had stepped down. Other directors who have resigned include:\n\nEcoCash expressed gratitude for the contributions of the outgoing board members and announced that Dominic Musengi and Elizabeth T. Masiyiwa will remain on the board.\n\nThe newly appointed directors include:\n\nThe leadership overhaul comesat a timewhen Econet Wireless, Zimbabwes largest telecommunications provider, faces intense scrutiny over declining service quality, exorbitant costs, and frequent system failuresparticularly with EcoCash, the countrys most widely used mobile money platform.\n\nOnFebruary 5, 2025, thousands of Econet subscriberswereleftstranded after EcoCash crashed, disrupting financial transactions for individuals and businesses.\n\nThe outage, lasting from 2:00 PM to 3:30 PM, was the latest in a series of system failures that have frustrated customers.\n\nEconet acknowledged the failure in a statement but insistedthe issue had been resolved:\n\nWe experienced some issues on the platforms that enable our subscribers to make calls, use data, or carry out EcoCash transactions, resulting in some of our customers being unable to use the services for about an hour and a half. We sincerely apologise for the inconvenience.\n\nHowever, many Zimbabweans remain unconvinced, as EcoCash has longbeen plaguedby persistent downtime, failed transactions, and delays in processing payments.\n\nThe services unreliability is especially concerning given that mobile money plays a crucial role in Zimbabwes cash-strapped economy.\n\nBeyond EcoCashs operational failures, Econets mobile network has alsobeen criticisedfor slow internet speeds, dropped calls, and high tariffs.\n\nZimbabweans pay some of the highest mobile data and voice call ratesin the region, yet they continue to endure subpar service.\n\nFrequent power cuts and inadequate investment in infrastructure have exacerbated the problem, while the company continues to hike prices under the guise of inflationary adjustments.\n\nThe timing of these service failures is particularly damaging for Econet, as competition in Zimbabwes telecom sector is heating up with the anticipated arrival of Starlink, Elon Musks satellite internet provider.\n\nStarlinkis expectedto revolutionise Zimbabwes digital landscape by offering high-speed, reliable internet access, especially in remote areas where traditional network providers struggle.\n\nUnlike Econets reliance on terrestrial towers, Starlinks satellite-based service provides a more stable connection and could offer an affordable alternative to Econets expensive and unreliable internet services.\n\nThe growing frustration with Econet has fueled anticipation for Starlinks launch, with many consumers eager for an alternative to Zimbabwes telecom monopoly.\n\nThe pressure is now on Econet to improve its services, lower costs, and enhance reliabilityor risk losing customers to a new, more efficient competitor.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – Renowned commercial lawyer and businessman Tawanda Nyambirai has been appointed the new Chief Executive of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/16/tawanda-nyambirai-lands-top-troubled-ecocash-job/\">Continue reading<span class=\"screen-reader-text\"> \"Tawanda Nyambirai Lands Top Troubled EcoCash Job\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        },
        {
            "title": "Chamuka slams ZRP for targeting Geza, says police must resist political manipulation",
            "url": "https://www.zimeye.net/2025/02/16/chamuka-slams-zrp-for-targeting-geza-says-police-must-resist-political-manipulation/",
            "content": "By A Correspondent| Peoples Unity Party (PUP) leader Herbert Chamuka has strongly condemned the Zimbabwe Republic Police (ZRP) for launching a manhunt for war veteran and Zanu PF Central Committee member, Blessed Geza, over four criminal charges, including undermining the authority of the President.\n\nChamuka accused the police of being used as a political weapon by the ruling Zanu PF, stating that the allegations against Geza only resurfaced after his recent press conference, where he openly criticised President Emmerson Mnangagwas alleged bid for a third term in office, calling it unconstitutional.\n\nThe timing of these charges is highly suspicious. Where were these allegations all along? They are only being brought up now because Geza has spoken out against the unconstitutional extension of Mnangagwas rule.\n\nThe police should refuse to be used to fight political disputes within Zanu PF, Chamuka said.\n\nNational police spokesperson Commissioner Paul Nyathi recently released a statement, saying the police were searching for Geza, also known as Bombshell, and warned that anyone assisting him in evading arrest would also face prosecution.\n\nThe Zimbabwe Republic Police is seeking information on the location and subsequent questioning of a suspect, Blessed Geza Runesu, alias Bombshell.\n\nThe suspect is facing four counts of criminal charges as outlined; theft allegations as defined in Section 113 of the Criminal Law Codification and Reform Act, Chapter 9 23, said Comm Nyathi.\n\nChamuka, however, argued that Geza and Mnangagwa, both veterans of the liberation struggle, should resolve their differences in a dignified manner rather than resorting to punitive legal action.\n\nMnangagwa and Geza know each other from the liberation struggle.\n\nInstead of humiliating an old comrade, the President should initiate a respectful counselling process.\n\nGeza is elderly, and throwing him into Zimbabwes inhumane jails will only jeopardise his health. They should counsel him, not jail him, Chamuka stated.\n\nThe PUP leader called for an end to the weaponisation of state institutions against political opponents and urged the police to maintain professionalism.\n\nThe ZRP should serve the people, not political interests. They must refuse to be used as enforcers of internal Zanu PF conflicts, Chamuka said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| People’s Unity Party (PUP) leader Herbert Chamuka has strongly condemned the Zimbabwe Republic Police (ZRP) for launching … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/16/chamuka-slams-zrp-for-targeting-geza-says-police-must-resist-political-manipulation/\">Continue reading<span class=\"screen-reader-text\"> \"Chamuka slams ZRP for targeting Geza, says police must resist political manipulation\"</span></a></p>",
            "time": "21:06",
            "date": "17 Feb 2025"
        }
    ]
}