{
    "news": [
        {
            "title": "Top Junta Invades Mugabe Minister’s Farm",
            "url": "https://www.zimeye.net/2025/06/28/top-junta-invades-mugabe-ministers-farm/",
            "content": "By A Correspondent-A senior military official has allegedly invaded Elvington Farm in Beatrice, Mashonaland East, a private property belonging to the late national hero and former Information Minister, Tichaona Jokonya.\n\nJokonya, who died on June 24, 2006, had purchased the 424-hectare farm in 1992. The property, popularly known as KwaJokonya, is registered under title deeds and has remained under family stewardship since his passing. The farm is currently used for cattle ranching and horticulture.\n\nAccording to the Jokonya family, a group of men claiming to be acting under instructions from a military officer began fencing off part of the farm without the familys consent on June 6.\n\nWe woke up to see some men erecting a fence on a section of the farm. It was shocking, said family spokesperson Bester Jokonya in an interview withNewsDay Weekender.\n\nWhen we confronted them, they said they had been sent by an army officer named Colonel Kennedy Makavanga. We contacted him, and he claimed the Lands ministry had allocated him the farm.\n\nThe family said they immediately inquired with the Lands ministry in Mashonaland East, only to be informed that no such offer or allocation had been made to Makavanga or anyone else.\n\nThis is a private property with title deeds, Bester added. We are living in fear because those who are supposed to protect us are invading our space. Our mother, the widow of the late Jokonya, is traumatised.\n\nThe family reported the matter to police, resulting in the arrest of eight individuals who had been erecting the fence. They have been charged with criminal trespassing.\n\nThe suspects  Cephas Ndiripo (47), Newton Mafoti (46), Honest Tarugarira (30), Ashley Chimbare (22), Dean Nyagona (26), Naison Mbara (23), Panashe Weju (23), and Aaron Mushamu (30)  appeared before a magistrate in Beatrice on Thursday. They were remanded in custody until Monday for a bail hearing.\n\nAccording to court documents, police first responded to the farm invasion on June 6, but the suspects fled the scene. However, on June 25, they returned and resumed fencing activities. The farm manager alerted the police again, leading to the arrests.\n\nThe accused told the court they had been contracted to erect the barbed wire fence by a man named Shadrack Chimbare of Chivhu, who they claimed was working under the direction of Colonel Makavanga.\n\nMakavanga could not be reached for comment, as calls to his mobile phone went unanswered. Efforts to obtain a response from the Mashonaland East provincial lands office were also unsuccessful.\n\nThe incident has sparked renewed concerns about the abuse of power by military officials and the erosion of property rights in Zimbabwe. The Jokonya family is now calling for the immediate withdrawal of all individuals from the farm and for the government to uphold the rule of law.\n\nTichaona Jokonya, a former ambassador to the United Nations and a seasoned diplomat, was appointed Minister of Information in 2005 by the late President Robert Mugabe. He died a year later in a Harare hotel and was declared a national hero. He was laid to rest at the National Heroes Acre.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-A senior military official has allegedly invaded Elvington Farm in Beatrice, Mashonaland East, a private property belonging to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/top-junta-invades-mugabe-ministers-farm/\">Continue reading<span class=\"screen-reader-text\"> \"Top Junta Invades Mugabe Minister’s Farm\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "ZIFA Unveils Final Candidates for July 2025 PSL and ZWSL Elections",
            "url": "https://www.zimeye.net/2025/06/28/zifa-unveils-final-candidates-for-july-2025-psl-and-zwsl-elections/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Football Association (ZIFA) has released the final list of candidates contesting in the upcoming Premier Soccer League (PSL) and Zimbabwe Womens Soccer League (ZWSL) elections, set to take place on 25 July 2025.\n\nAccording to ZIFA, the electoral process will strictly follow the provisions of the ZIFA Statutes and the ZIFA Electoral Code (2024), ensuring transparency and compliance throughout the elections.\n\nThe PSL vote will determine a new board comprising a chairperson, vice-chairperson, and three executive committee members. Meanwhile, the ZWSL elections will see the selection of a chairperson, vice-chairperson, and five board members.\n\nFour candidates are vying for the PSL chairmanship: former Dynamos boss Isaiah Mupfurutsa, now with Simba Bhora; Masimba Chihowa of Manica Diamonds; Dumisani Siwale of FC Platinum; and Leonard Musariri of Ngezi Platinum.\n\nIn a notable development, Highlanders chairman Kenneth Mhlophe is running unopposed and will assume the role of vice-chairperson of the Premier Soccer League.\n\nThe elections are expected to shape the future leadership of Zimbabwean football, both in the mens and womens leagues, as stakeholders look for stability and progressive governance in the sport.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Football Association (ZIFA) has released the final list of candidates contesting in the upcoming Premier Soccer … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/zifa-unveils-final-candidates-for-july-2025-psl-and-zwsl-elections/\">Continue reading<span class=\"screen-reader-text\"> \"ZIFA Unveils Final Candidates for July 2025 PSL and ZWSL Elections\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Rhythms for Resilience: Dhidza Doctor Harnesses Dancehall to Champion Health and Safety …",
            "url": "https://www.zimeye.net/2025/06/28/rhythms-for-resilience-dhidza-doctor-harnesses-dancehall-to-champion-health-and-safety/",
            "content": "By A Correspondent\n\nZimbabwean dancehall sensation Dhidza Doctorborn I Do Mhondiwais turning up the volume not just on beats, but on vital public health messages. Renowned for his infectious rhythms, the artist says he feels a responsibility to use my platform for more than entertainment.\n\nMusic speaks when words alone cannot, Dhidza Doctor explains. If a catchy chorus can save just one life or encourage someone to get screened, then every beat, every lyric is worth it.\n\nTackling HPV-Related Cancers through Catchy Jingles\n\nAt the heart of his new campaign is a suite of jingles aimed at increasing awareness of human papillomavirus (HPV) and its link to cervical and other cancers. Collaborating with local health NGOs, Dhidza Doctor has penned lyrics that underscore the importance of vaccination and regular screenings.\n\nWeve got to break the silence around womens health, he says. By weaving facts into melodies, we can reach young people where they liveon the radio, at clubs, on their phones.\n\nOne jingle, titled Screen and Sing, features a call-and-response hook that urges listeners to dance to the clinic and beat HPV before it beats you. Early testing of the song in Harare community health centers reportedly increased screening inquiries by 25%.\n\nConfronting Drug Abuse with the Power of Verse\n\nBeyond cancer awareness, Dhidza Doctor is turning his spotlight on the growing scourge of substance abuse. His upcoming single, Clear Mind, Bright Future, pairs a heavy bassline with stark verses about the dangers of narcotics.\n\nIve seen too many talented youths lose themselves to drugs, he notes. When I rap about real storiesfriends Ive lost, families torn apartthats a message that hits home.\n\nPublic service announcements featuring snippets of the track will air on national radio and television, accompanied by testimonials from recovering addicts.\n\nRoad Safety: A Dancehall Detour from Disaster\n\nRoad accidents remain a leading cause of death in Zimbabwe. In response, Dhidza Doctor is collaborating with the National Road Safety Council to produce an upbeat anthem, Slow Down, Show Love, reminding drivers to respect speed limits and avoid drunk driving.\n\nEvery life is precious, he stresses. If a chorus can make someone tap the brakes instead of the accelerator, weve done our job.\n\nPromoting Workplace Safety through Community Concerts\n\nRounding out his health-and-safety initiative, Dhidza Doctor plans a series of outdoor concerts at factories, mines, and industrial parks. Between musical sets, safety officers will deliver brief talks on protective gear, hazard awareness, and emergency procedures.\n\nMusic brings people together, says corporate partner and safety engineer Tendai Manhando. When Dhidza performs, workers listenand then they listen to us about hard hats and eye protection.\n\nLooking Ahead: A Legacy Beyond the Stage\n\nAs he fine-tunes his forthcoming EP, Dhidza Doctor envisions a future where artists and activists collaborate seamlessly.\n\nI want to see every concert double as a classroom, he declares. If we can keep our nation healthier and safer one beat at a time, thats the ultimate encore.\n\nWith jingles on the airwaves and community campaigns on the ground, Zimbabwes rising dancehall doctor is prescribing a potent remedy: the universal language of music.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean dancehall sensation Dhidza Doctor—born I Do Mhondiwa—is turning up the volume not just on beats, but … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/rhythms-for-resilience-dhidza-doctor-harnesses-dancehall-to-champion-health-and-safety/\">Continue reading<span class=\"screen-reader-text\"> \"Rhythms for Resilience: Dhidza Doctor Harnesses Dancehall to Champion Health and Safety …\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Minister Mavetera Distributes Computers To Schools Without Tables, Benches, Electricity…",
            "url": "https://www.zimeye.net/2025/06/28/minister-mavetera-distributes-computers-to-schools-without-tables-benches-electricity/",
            "content": "By A Correspondent\n\nThe governments latest push to bridge the digital divide has come under scrutiny after ICT, Postal and Courier Services Minister Tatenda Mavetera donated computers to a rural school that lacks even the most basic infrastructuresuch as electricity, tables, and benches.\n\nThe donation, made during a ceremony at St Georges Muchena Primary School in Mutasa District, included 15 laptops, a projector, a whiteboard, and a Starlink internet device. While the gesture was intended to promote digital inclusion in underserved communities, it has sparked questions about the governments priorities and implementation strategy.\n\nWe are committed to ensuring that marginalised communities are not left out of the digital economy, said Minister Mavetera during the handover. This is why we have taken this expo across the nation from Mashonaland to Matabeleland and now we are in Manicaland.\n\nThe donation was part of the Manicaland ICT Expo, with Manicaland becoming the third province to host the event as the government continues its nationwide ICT drive.\n\nHowever, critics and community members were quick to point out the glaring gap between digital empowerment ambitions and on-the-ground realities. St Georges Muchena Primary School reportedly lacks electricity, making it nearly impossible to operate the donated computers without immediate additional infrastructure support.\n\nIts a good thing that the government is thinking about ICT, but its putting the cart before the horse, said a local parent. How do you run a laptop with no power? Where will learners sit if there are no benches? We need classrooms and electricity first.\n\nAnother teacher at the school echoed similar concerns:\n\nWe welcome the technology, but we also need the basics. These children are learning under trees and in makeshift classrooms. Before we talk about Starlink, lets talk about desks and roofs.\n\nWhile the initiative rightly recognizes the importance of digital skills in todays economy, it raises broader concerns about the sequencing of development priorities. Experts argue that foundational infrastructuresuch as electricity, furniture, and functional classroomsshould precede or accompany such donations to ensure they are actually usable and effective.\n\nThe government must ensure schools are equipped with the minimum requirements to benefit from ICT tools, said a development analyst. Otherwise, these laptops will simply gather dust.\n\nDespite the criticism, Minister Mavetera remains optimistic about the long-term vision.\n\nThis ensures that every citizen, regardless of where they live, can participate in Zimbabwes digital transformation, she said. We are laying the foundation for a digitally empowered generation.\n\nBut for the learners at St Georges Muchena Primary School, that foundation might still require more concrete supportquite literallybefore the laptops can do more than symbolise hope.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The government’s latest push to bridge the digital divide has come under scrutiny after ICT, Postal and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/minister-mavetera-distributes-computers-to-schools-without-tables-benches-electricity/\">Continue reading<span class=\"screen-reader-text\"> \"Minister Mavetera Distributes Computers To Schools Without Tables, Benches, Electricity…\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Masvingo Residents Walk Tall As High Court Orders City Council To Close Perilous Dumpsite",
            "url": "https://www.zimeye.net/2025/06/28/masvingo-residents-walk-tall-as-high-court-orders-city-council-to-close-perilous-dumpsite/",
            "content": "By A Correspondent\n\nIn a significant win for the people of Masvingo, the High Court has ordered the Masvingo City Council (MCC) to halt all waste dumping at the controversial open space betweenRunyararo South WestandVictoria RanchbyDecember 2025.\n\nThis long-awaited ruling comes after years of outcry from residents who have endured the harmful effects of living near the unofficial dumpsiteincluding persistent foul smells, clouds of smoke, and an infestation of flies threatening both their health and well-being.\n\nThe case was brought forward by theMasvingo Residents and Ratepayers Alliance (MURRA), which accused the council of neglecting its duty by allowing continued dumping at the site, causing serious environmental damage and health hazards.\n\nLast week, a High Court judge ruled in favor of the residents, compelling the City Council to relocate its waste disposal operations to thedesignated Cambria Farm landfill.\n\nThis is a turning point for the residents of Runyararo West, said a MURRA representative. The courts decision acknowledges the suffering people have endured for too long and sends a clear message: enough is enough.\n\nThe judgment, delivered by consent, marks a major step toward restoring environmental integrity and improving public health in the city. Residents are hailing the outcome as a victory for community activism and a testament to the power of civic engagement.\n\nIts a reminder that united voices can bring real change, said one local resident. When we speak out together, the authorities have no choice but to listen.\n\nNotably, the City Council did not oppose the legal application, a move that many view as a sign of willingness to engage constructively and improve public service delivery.\n\nThis shows a level of maturity, one MURRA official commented. It suggests the council is ready to act in the best interest of its residents and acknowledge their concerns.\n\nThe relocation of waste operations toCambria landfillis expected to significantly enhance the quality of life in Runyararo South West, Victoria Ranch, and surrounding neighborhoods. Residents will finally be free from the toxic smoke and health threats that have plagued the area for years.\n\nThis court ruling is more than just a legal outcomeits a blueprint for environmental justice and civic responsibility. It sets a precedent for how communities can demand accountability and push for sustainable urban management.\n\nAs Masvingo begins its transition to a cleaner future, this victory serves as a reminder that persistent advocacy, community solidarity, and legal action remain powerful tools in the fight for safe and livable cities.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a significant win for the people of Masvingo, the High Court has ordered the Masvingo City … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/masvingo-residents-walk-tall-as-high-court-orders-city-council-to-close-perilous-dumpsite/\">Continue reading<span class=\"screen-reader-text\"> \"Masvingo Residents Walk Tall As High Court Orders City Council To Close Perilous Dumpsite\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Just In: Fire Breaks  Out At Harare Hospital Nurses’ Residence",
            "url": "https://www.zimeye.net/2025/06/28/just-in-fire-breaks-out-at-harare-hospital-nurses-residence/",
            "content": "By A Correspondent\n\nA fire broke out on Friday at the nurses residence at Harare Hospital, sending plumes of smoke into the sky and prompting an emergency response from the City of Harare Fire Brigade.\n\nAuthorities confirmed the incident in a brief statement posted to Facebook, stating: Happening right now A massive fire has engulfed sections of the nurses residence at Harare Hospital. Our Fire Brigade teams are en route. We will provide updates as the situation unfolds.\n\nDetails surrounding the cause of the fire and the extent of the damage remain unclear at this stage. No injuries have been reported so far.\n\nSource: Crime Watch Zimbabwe\n\nWATCH | Fire Breaks Out at Harare HospitalA fire has broken out at the nurses residence at Harare Hospital.In a statement released on Facebook, the City of Harare said: Happening right now There is a huge fire which has engulfed parts of the nurses residence at Hararepic.twitter.com/rlKaXeUQ6C\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A fire broke out on Friday at the nurses’ residence at Harare Hospital, sending plumes of smoke … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/just-in-fire-breaks-out-at-harare-hospital-nurses-residence/\">Continue reading<span class=\"screen-reader-text\"> \"Just In: Fire Breaks  Out At Harare Hospital Nurses’ Residence\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Zanu PF Nullifies Manicaland Women’s League Polls In Bid To Clip Chiwenga’s Wings",
            "url": "https://www.zimeye.net/2025/06/28/zanu-pf-nullifies-manicaland-womens-league-polls-in-bid-to-clip-chiwengas-wings/",
            "content": "By A Correspondent\n\nZANU PF has nullified the recent Manicaland Provincial Womens League co-option election, citing procedural irregularitiesa move insiders say is aimed at curbing the influence of Vice President Constantino Chiwenga within the party structures.\n\nIn an official statement, ZANU PF Political Commissar Munyaradzi Machacha announced the decision, confirming that the election held on 06 April 2025 in Mutare has been declared void.\n\nThe results of the ZANU PF Provincial Womens League co-option for the position of Chairlady conducted in Mutare on 06 April 2025 have been nullified by the Commissariat, said Machacha.\n\nThe announcement comes amid growing tensions within the ruling party, with multiple sources suggesting that the move is part of a broader strategy to sideline allies of Vice President Chiwenga ahead of internal restructuring and succession battles.\n\nThe Commissariat has ordered a fresh co-option process to be conducted this Sunday, 29 June 2025, at the ZANU PF Manicaland provincial offices.\n\nAs a result, the Province is required to repeat the exercise. The new exercise of the co-option will take place at the ZANU PF Manicaland offices on Sunday, 29 June 2025, at 10:00 hrs, and will be overseen by the National Political Commissar, Machacha added.\n\nThough the party maintains that the nullification was due to internal electoral procedure issues, party insiders suggest otherwise.\n\nThis is about power consolidation, a senior ZANU PF official, speaking on condition of anonymity, said. The first vote didnt go their way, so they hit the reset button to block anyone seen as loyal to Chiwenga.\n\nThis development further fuels speculation of a deepening rift between factions aligned to President Emmerson Mnangagwa and those believed to support Vice President Chiwenga, especially as the party gears up for its next Congress.\n\nPolitical analysts say the nullification signals the partys internal power play rather than a simple administrative correction.\n\nEvery position in the Womens League is strategic. Whoever controls the provincial structures controls the grassroots narrative, noted a political commentator.\n\nAs ZANU PF prepares for the re-run, eyes will be firmly on Manicaland to see whether the outcome will shift the internal balance of poweror simply reinforce the grip of the dominant faction.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF has nullified the recent Manicaland Provincial Women’s League co-option election, citing procedural irregularities—a move insiders … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/zanu-pf-nullifies-manicaland-womens-league-polls-in-bid-to-clip-chiwengas-wings/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Nullifies Manicaland Women’s League Polls In Bid To Clip Chiwenga’s Wings\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Let’s Unite To Remove Zanu PF, Declares Tshabangu But Is He Sincere At All ?",
            "url": "https://www.zimeye.net/2025/06/28/lets-unite-to-remove-zanu-pf-declares-tshabangu-but-is-he-sincere-at-all/",
            "content": "By A Correspondent\n\nSelf-declared Citizens Coalition for Change (CCC) Secretary GeneralSengezo Tshabanguhas urged Zimbabwes opposition forces to form a united front against the rulingZANU PF, calling for strategic renewal and internal reform.\n\nIn a statement issued on Friday, Tshabangu emphasized the need for opposition parties to set aside differences and build a cohesive political force capable of challenging ZANU PFs long-standing grip on power.\n\nAs the opposition, we need to revamp our political strategy and employ all tactics that will enable us to succeed against ZANU PF, with unity being our primary objective, said Tshabangu. Additionally, we must eliminate corruption within our ranks to regain the trust and confidence of the masses.\n\nTshabangus call comes at a time when Zimbabwes opposition landscape remains fragmented, plagued by infighting, and weakened by state-sponsored crackdowns. However, his appeal for unity has been met with skepticism from several political observers and activists who question his sincerity and independence.\n\nMany critics view Tshabangu as a politically compromised figure, allegedly aligned with ZANU PF interests.\n\nTshabangus track record suggests he is more of a destabilizing agent than a unifier, said one political analyst. Its difficult to take a call for opposition unity seriously when it comes from someone widely perceived as a ZANU PF sympathiser.\n\nTshabangu rose to prominence controversially in 2023 after engineering the recall of several CCC Members of Parliament, a move widely condemned as aiding ZANU PFs parliamentary dominance.\n\nDespite the doubts, his latest remarks have reignited the debate about the need for strategic cooperation among Zimbabwes fragmented opposition movements. With economic hardship worsening and political repression continuing, many Zimbabweans remain eager to see a credible, united alternative to the current administration.\n\nWhether Tshabangus statement signals a genuine shift toward opposition cohesion or is another political maneuver remains to be seen. What is clear, however, is that the call for unityregardless of its messengercontinues to resonate with an electorate hungry for change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Self-declared Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu has urged Zimbabwe’s opposition forces to form … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/lets-unite-to-remove-zanu-pf-declares-tshabangu-but-is-he-sincere-at-all/\">Continue reading<span class=\"screen-reader-text\"> \"Let’s Unite To Remove Zanu PF, Declares Tshabangu But Is He Sincere At All ?\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Willard Zireva Gets OK Zimbabwe Top Job",
            "url": "https://www.zimeye.net/2025/06/28/willard-zireva-gets-ok-zimbabwe-top-job/",
            "content": "By Business ReporterOK Zimbabwes long-serving executive and industry stalwart,Mr Willard Zireva, has been appointedexecutive chairmanof the supermarket chain as part of a stabilisation strategy following the resignation of chairmanMr Herbert Nkala.\n\nAccording to sources close to the company, Mr Nkala, along with board membersMs Rose Mavima,Mr Tawanda Gumbo, andMr Wonder Nyabereka, will formally step down at the upcoming annual general meeting, paving the way for a new leadership phase at the retail giant.\n\nMr Zirevas appointment is a vote of confidence in his deep institutional knowledge and proven leadership, having successfully led OK Zimbabwe as chief executive for over two decades. His return, initially in an interim capacity, is seen as a strategic move to restore stability and guide the company through a critical turnaround period.\n\nIt is an interim arrangement in which he (Zireva) is expected to be the executive chairman for the next three years to achieve stability, a source familiar with the matter said.\n\nThe leadership reshuffle follows an urgent restructuring effort by shareholders, which saw the exit offormer chief executive Mr Maxen Karombo,chief financial officer Mr Phillimon Mushosho, andsupply chain director Knox Mupaya, all through voluntary separation agreements.\n\nIn a bid to reinforce the executive team,Mr Alex Siyavorahas returned as chief financial officer, whileMr Muzvidzwa Chingairahas taken over the reins as supply chain director.\n\nOK Zimbabwe said the current executive managementcomprising seasoned professionals brought back to stabilise the companywill remain in place until the end of the current financial year, after which a substantive leadership team will be appointed. This incoming team will be tasked with executing a new strategy anchored in operational rigour and strategic foresight.\n\nIn a circular outlining its new direction, the company said the reconstituted board will strengthen oversight and enhance governance as part of a broader transformation initiative.\n\nAs part of its recovery and growth strategy, OK Zimbabwe is seeking to raiseUS$30.5 millionthrough a combination of arenounceable rights offerand thedisposal of selected immovable properties.\n\nThe company aims to use the capital to settle legacy obligations, boost working capital, finance capital expenditure, and restore supplier confidence. Of the targeted amount,US$20 millionis expected to come from the rights offer.\n\nThe rights offer will allow shareholders to subscribe for1.37 new ordinary shares for every one share heldon the record date ofJuly 21, 2025, at a subscription price ofUS$0.0109per sharerepresenting a15 percent discounton the 30-day volume-weighted average traded price as of May 23, 2025.\n\nShareholders holding73 percentof issued share capital have already committed to supporting the rights offer through irrevocable commitments and underwriting agreements. Key institutional shareholdersthe National Social Security Authority,Datvest Nominees, andOld Mutualhave collectively pledgedUS$16.54 millionand provided bank guarantee letters.\n\nTo prevent any single shareholder from surpassing the 35 percent threshold that would trigger a mandatory offer under listing regulations, the underwriting arrangement has been carefully structured.\n\nThe rights offer will open onJuly 21, 2025, and close onAugust 4, 2025. In parallel, the company is targeting an additionalUS$10.5 millionthrough the disposal of selected properties, subject to lease-back arrangements where applicable.\n\nOK Zimbabwe said the asset sales would focus on properties offering optimal saleability and value, given prevailing market conditions.\n\nThe companys restructuring is a response to a combination of internal missteps and external economic pressures. Internally, OK cited poor capital allocation, delayed creditor engagement, and slow market responsiveness. Externally, informal retail competition, rising input costs, weakened consumer spending, and declining foot traffic have taken a toll.\n\nAs ofFebruary 28, 2025, OK Zimbabwes overdue creditor obligations stood at overUS$30 million, includingUS$24 million to suppliers,US$5.12 million in other payables, andUS$880,000 in statutory obligations.\n\nThe appointment of Mr Zireva, described by many as a steady and respected hand, signals a renewed effort to return the supermarket chain to operational health and long-term sustainability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – OK Zimbabwe’s long-serving executive and industry stalwart, Mr Willard Zireva, has been appointed executive chairman of the supermarket chain as … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/willard-zireva-gets-ok-zimbabwe-top-job/\">Continue reading<span class=\"screen-reader-text\"> \"Willard Zireva Gets OK Zimbabwe Top Job\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        },
        {
            "title": "Chitungwiza Aquatic Complex Now A White Elephant",
            "url": "https://www.zimeye.net/2025/06/28/chitungwiza-aquatic-complex-now-a-white-elephant/",
            "content": "By Parliamentary Reporter-Parliament has expressed deep concern and dismay over the dilapidated state of the Chitungwiza Aquatic Complex, a once-iconic sports facility that proudly hosted the 1995 All Africa Games and numerous other international events.\n\nOnce a symbol of sporting excellence in Zimbabwe, the Olympic-standard complex is now a shadow of its former self. Its main swimming pool, practice pool, and childrens pool have fallen into disrepair, while key infrastructure such as the electronic timing system and boiler house has long been abandoned and remains non-functional.\n\nThe collapse of the complex has not only affected its aesthetics but also severely impacted local and national swimming development, with athletes and recreational swimmers now forced to seek alternative facilities. Safety concerns and a lack of basic maintenance have rendered the complex unusable.\n\nThe extent of the neglect was brought to light during a recent inspection by the Parliamentary Portfolio Committee on Sport, Recreation, Arts and Culture, chaired by legislator Farai Jere. Following the visit, Jere expressed outrage at the state of the facility:\n\nWe are appalled by the state of the Chitungwiza Aquatic Complex. We will take this matter to Parliament to push for the restoration of this facility to its former glory so that it can once again host international swimming events, Jere said.\n\nIt is unacceptable that we are spending millions of dollars to send athletes abroad when we have a world-class Olympic facility right here at home that has been left to rot.\n\nThe committees visit was part of a broader oversight mission to assess the implementation of government policies on sports infrastructure and to identify urgent interventions needed to revitalize the sector.\n\nThe current state of the Chitungwiza Aquatic Complex stands as a stark reminder of the countrys failure to preserve legacy infrastructure, and Parliament is now under pressure to act decisively to rescue what was once one of Zimbabwes proudest sporting landmarks.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Parliamentary Reporter-Parliament has expressed deep concern and dismay over the dilapidated state of the Chitungwiza Aquatic Complex, a once-iconic … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/06/28/chitungwiza-aquatic-complex-now-a-white-elephant/\">Continue reading<span class=\"screen-reader-text\"> \"Chitungwiza Aquatic Complex Now A White Elephant\"</span></a></p>",
            "time": "06:53",
            "date": "29 Jun 2025"
        }
    ]
}