{
    "news": [
        {
            "title": "Another CUT Student Dies in Car Crash",
            "url": "https://www.zimeye.net/2025/09/02/another-cut-student-dies-in-car-crash/",
            "content": "By A Correspondent Tragedy has struck Chinhoyi University of Technology (CUT) once again after another student died in a road accident in Chiredzi, just days after fellow student Panashe Mwinga lost her life in a separate crash.\n\nThe latest victim,Mclarian Chando, affectionately known asDJ Killers, was a Level 3:1 Information Technology student. He succumbed to injuries at Parirenyatwa Hospital after being transferred there for critical care.\n\nFriends and fellow students described him as a larger-than-life character whose love for music made him a popular figure on campus.\n\nCUT Student Representative Council (SRC) Minister of External Affairs, Information and Publicity, Malvin Saint Madanda, paid tribute to Chando, describing him as a bright young man with a remarkable spirit, a passion for music and a future full of promise.\n\nHis presence was felt not just in classrooms but in the hearts of those he shared conversations, laughter and dreams with. His passing is a devastating loss, not only to his family and close friends, but to all of us who had the privilege of knowing him, Madanda said.\n\nThe SRC declaredMonday, September 1, 2025, as Black Mondayin Chandos honour, urging students to wear black as a symbol of mourning and solidarity.\n\nA fellow student described him as humble and inspiring:\n\nHe was a cheerful person who loved his music. His smile was infectious, and he inspired us with his positivity.\n\nChando is thefifth CUT student to die in the past nine months, three of them in accidents and two from suicide.\n\nJust last week,Panashe Mwinga, who had graduated with a Bachelors Degree in Visual and Communication Multimedia, died in a car accident near the Gwebi River while travelling to Harare with her family. Her father, an engineer, was seriously injured.\n\nIn November last year,Tanatswa Chinyama, a Level 2:1 student in the School of Hospitality and Tourism, died after being hit by a car near the ChinhoyiChegutu Highway railway crossing.\n\nMore recently, two students Abraham Chabata(Agricultural Engineering) andTakudzwa Alex Mapurisa died by suicide within a week of each other, shocking the university community.\n\nMadanda said the tragedies had left the institution shaken.\n\nThis loss has sent ripples of grief across our university. We urge students to seek help, speak out about their struggles, and support one another. No one should face their battles alone.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Tragedy has struck Chinhoyi University of Technology (CUT) once again after another student died in a road … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/02/another-cut-student-dies-in-car-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Another CUT Student Dies in Car Crash\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Prominent Bulawayo Businessman Shoots Self",
            "url": "https://www.zimeye.net/2025/09/02/prominent-bulawayo-businessman-shoots-self/",
            "content": "By A Correspondent-A prominent Bulawayo businessman allegedly shot himself in the head at an outdoor entertainment venue on Sunday afternoon.\n\nThe deceased has been identified by police as Khumbulani Nsingo, who owned several bottle stores in the city and reportedly had business interests in Matabeleland South. Police are investigating the death, which they are treating as a suspected suicide.\n\nNational police spokesperson, Commissioner Paul Nyathi, confirmed the businessmans death and said investigations into the circumstances surrounding the fatal shooting are ongoing. It is reported that Nsingo took his own life by fatally shooting himself in the head with a pistol.\n\nPolice are still investigating the circumstances behind the suicide of the late Khumbulani Nsingo, a businessman in Bulawayo and Matabeleland South Province. The incident occurred on Sunday, and his body has been transferred to a local hospital for post-mortem, said Commissioner Nyathi.\n\nCommissioner Nyathi also dismissed earlier reports suggesting that the late Nsingo was a member of the Criminal Investigations Department (CID) stationed at Bulawayo Central Police Station.\n\nHe was not a member of the Zimbabwe Republic Police (ZRP), said Commissioner Nyathi.\n\nFamily spokesperson Mr Nhlanhla Nsingo appealed for privacy during their time of mourning.\n\nWe have just lost our brother and we ask for our familys privacy to be respected, he said, without elaborating.\n\nAccording to friends close to the late businessman, he had made references to suicide in the days leading up to his death  remarks they had dismissed as unpleasant jokes.\n\nLast Friday, he kept saying we should take away his firearm as he was worried he might do something harmful to himself. We thought he was just stressed and needed time to cool off and figure out what was bothering him, said one close friend, who preferred to remain anonymous.\n\nOn Sunday afternoon, just after midday, we received a call that Khumbu had shot himself in the head and his body was lying at (location withheld), and that police had been called to the scene. He was a jovial guy, and in hindsight, maybe we should have taken away his pistol and encouraged him to speak to someone about the problems he was facing. Chronicle\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-A prominent Bulawayo businessman allegedly shot himself in the head at an outdoor entertainment venue on Sunday afternoon. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/02/prominent-bulawayo-businessman-shoots-self/\">Continue reading<span class=\"screen-reader-text\"> \"Prominent Bulawayo Businessman Shoots Self\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Selmor Holds Tuku Legacy Shows",
            "url": "https://www.zimeye.net/2025/09/02/selmor-holds-tuku-legacy-shows/",
            "content": "By Showbiz Reporter  When Oliver Tuku Mtukudzi died in January 2019, Zimbabwe mourned more than a father, a husband, or a musician. The nation and the continent grieved the loss of an icon whose music told the story of a people. Six years on, his daughter Selmor Mtukudzi is ensuring that his voice continues to echo across stages and generations.\n\nThis September, Selmor is headlining a series of shows in Zimbabwe and South Africa in honour of her father. On Saturday, 13 September 2025, she takes centre stage at the Hard Rock Caf in Johannesburg forSaturday Nights Live: A Celebration of Dr Oliver Mtukudzis Life. The concert begins at 6 PM, featuring DJs Mr V, ScoreBeatz, and Irie Dread.\n\nA week later, on 21 September, the celebrations shift to the shores of Lake Chivero with theTozeza Tuku Trail Runat Wingate Boat Club. Blending music, sport, and family fun, the event features 5km, 10km, and 21.1km obstacle races. According to organisers, Eves Event Management, the day will culminate in a musical performance by Selmor, cementing the connection between Tukus music and the communities that adored him.\n\nFor Selmor, these shows are not just performances  they are personal. My fathers music is more than entertainment. Its wisdom, its comfort, its life lessons, she once said in an interview. I feel a responsibility to make sure that the world never forgets his message.\n\nThat responsibility has shaped her career trajectory. While she began her journey as a young singer in the early 2000s, Selmor has matured into one of Zimbabwes most formidable female voices. She has shared stages with international stars, released acclaimed albums such asNguva YanguandI Am Woman, and become an outspoken advocate for women in music.\n\nHer marriage to fellow musician Tendai Manatsa  son of the late Zexie Manatsa  has also anchored her career. Together, they are a powerhouse couple, blending two musical dynasties and often collaborating on stage to celebrate the legacies they inherited.\n\nYet, Selmors role as custodian of Tukus legacy did not come easily. After Tukus death, his estate and the stewardship of his vast musical brand became sources of contention within the family. Tukus widow, Daisy, initially fronted the Tuku Music brand, but Selmor and her siblings felt a deep personal and artistic calling to keep their fathers music alive through performance.\n\nThe relationship between Selmor and her stepmother Daisy was strained during those early years. It wasnt easy, Selmor admitted in a past interview. We were all grieving, and everyone had their own idea of how best to honour him. Over time, however, the two women found a level of understanding, with Daisy focusing on preserving Tukus legacy through the family home and foundation, while Selmor carried his voice forward on the stage.\n\nWhile comparisons with her father have followed her throughout her career, Selmor has deliberately crafted her own sound and identity. Songs likeZvinoita MurudoandNguva Yangushowcase her unique artistry while drawing inspiration from the socially conscious themes Tuku was known for.\n\nStill, she embraces the inheritance of being Tukus daughter. At concerts, fans often request her to perform her fathers timeless classics such asNeria,Todii, orHear Me Lord. She obliges, not as imitation, but as continuity. I dont want people to just remember Tuku as someone from the past. I want them to feel like hes still here with us, through the music, she has said.\n\nThe upcoming September concerts represent more than shows  they are living memorials. They symbolise Selmors growth from being the daughter of a legend into becoming a legend-in-the-making herself. They also reflect the healing of a family once divided, now united in ensuring that Oliver Mtukudzis music remains an unending conversation between generations.\n\nAs the lights dim at the Hard Rock Caf and the first chords ring out across Lake Chivero later this month, one thing will be clear: the voice of Oliver Mtukudzi may be gone, but through Selmor, it continues to sing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – When Oliver “Tuku” Mtukudzi died in January 2019, Zimbabwe mourned more than a father, a husband, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/02/selmor-holds-tuku-legacy-shows/\">Continue reading<span class=\"screen-reader-text\"> \"Selmor Holds Tuku Legacy Shows\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Mzembi’s Health Deteriorates in Jail",
            "url": "https://www.zimeye.net/2025/09/02/mzembis-health-deteriorates-in-jail/",
            "content": "By A Correspondent  Former Foreign Affairs Minister and G40 kingpin, Walter Mzembi, has reportedly fallen gravely ill while in detention at Harare Remand Prison.\n\nA senior Zimbabwe Prisons and Correctional Service (ZPCS) official confirmed that Mzembis condition has raised concern among officers. Sources say he appears weak, with pale eyes and a visibly darkened complexion, and now spends most of his time sleeping. Prison officials fear he may be suffering from a serious illness.\n\nThe development has sparked speculation that his long-standing battle with colon cancer may have resurfaced. While in exile, Mzembi underwent treatment for the disease, but without medical tests, the exact nature of his present condition remains uncertain.\n\nMzembi is being held for allegedly violating bail conditions dating back seven years. Both the magistrates court and the High Court of Zimbabwe have denied him fresh bail applications.\n\nMzembis Political Career and ExileWalter Mzembi rose to prominence in Zanu PF during the Robert Mugabe era. A close ally of the late president, he was appointed Tourism and Hospitality Industry Minister in 2009 before rising to Foreign Affairs Minister in 2017, a post he held at the height of the G40 factions bitter succession battles with the military-backed Lacoste camp led by Emmerson Mnangagwa.\n\nAs one of the most visible faces of the G40, Mzembi campaigned vigorously for Grace Mugabes ascendancy in Zanu PF, a move that put him at odds with Mnangagwas allies in the military. When Mugabe was toppled in the November 2017 coup, Mzembi was dismissed from government and later charged with corruption.\n\nHe fled the country soon after, seeking medical treatment in South Africa, where he remained in political exile. During his years abroad, Mzembi maintained that the charges against him were politically motivated, linked to his opposition to Mnangagwas rise.\n\nReturn and ArrestMzembis recent return to Zimbabwe shocked many observers, given the fate of other G40 leaders who either remain in exile or have retreated from active politics. Upon his return, he was arrested and remanded in custody for breaching earlier bail conditions tied to his pending corruption cases.\n\nHis current health scare inside Harare Remand Prison is now raising questions about whether the government will allow him access to urgent medical care. Critics argue that denying him treatment would amount to persecution, while his detractors insist he must face justice like any other accused person.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – Former Foreign Affairs Minister and G40 kingpin, Walter Mzembi, has reportedly fallen gravely ill while in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/02/mzembis-health-deteriorates-in-jail/\">Continue reading<span class=\"screen-reader-text\"> \"Mzembi’s Health Deteriorates in Jail\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Police Warn Public Over Rising Sophistication of Cybercrime in Zimbabwe",
            "url": "https://www.zimeye.net/2025/09/02/police-warn-public-over-rising-sophistication-of-cybercrime-in-zimbabwe/",
            "content": "By A Correspondent\n\nHarare  The Zimbabwe Republic Police (ZRP) has issued a stern warning to the public over a surge in cybercrime, highlighting that criminals are employing increasingly sophisticated tactics to target internet users.\n\nNational Police spokesperson, Commissioner Paul Nyathi, said cybercriminals are using advanced technological tools to carry out fraud and scams, with elderly and less tech-savvy individuals being the most vulnerable.\n\nWe are seeing an unprecedented level of technological manipulation. Scammers are becoming more sophisticated, using complex techniques that can easily deceive even cautious internet users, said Comm Nyathi. We have received several reports about people being scammed out of their money.\n\nHe explained that cybercriminals are targeting individuals through phishing schemes, fake online identities, social engineering tactics, and fraudulent websites and communications.\n\nThe public must verify the authenticity of online communications and use strong, unique passwords that cannot be easily hacked. People must be cautious of unsolicited messages or requests from suspicious numbers or emails and pop-up adverts, he said. Companies and individuals must also update digital security software regularly.\n\nComm Nyathi emphasised the importance of educating vulnerable family members about online risks, warning that cybercrime causes not only financial losses but also emotional and psychological harm.\n\nEvery citizen must become their own first line of defence in the digital world, he said. As police, we are ramping up efforts to combat these digital threats, including enhanced cybercrime investigation units, public awareness campaigns, and collaboration with technology companies.\n\nHe encouraged the public to report suspicious online activities immediately. By staying informed and vigilant, communities can work together to combat the growing menace of cybercrime. For more information or to report suspicious activities, contact the police for help, said Comm Nyathi.\n\nHighlighting recent trends, he noted that mobile money fraud, card fraud, and identity theft are on the rise. This is a prevalent form of cybercrime, alongside other types of fraud targeting users of electronic payment systems. The misuse of electronic cards and the theft of personal identification information are significant concerns for law enforcement, he said.\n\nComm Nyathi also pointed to international collaboration, saying the ZRP has participated in operations such as Interpols Africa Cyber Surge. The enactment of the Cyber and Data Protection Act 2021 demonstrates the Governments awareness of cybersecurity risks and its efforts to establish frameworks for managing them. Public awareness and education are crucial to help people protect themselves from cyber threats, he added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – The Zimbabwe Republic Police (ZRP) has issued a stern warning to the public over a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/02/police-warn-public-over-rising-sophistication-of-cybercrime-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Police Warn Public Over Rising Sophistication of Cybercrime in Zimbabwe\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": ".\t“Worthless Papers: Zimbabweans Return Home to Find Their Foreign Degrees Rejected”",
            "url": "https://www.zimeye.net/2025/09/02/worthless-papers-zimbabweans-return-home-to-find-their-foreign-degrees-rejected/",
            "content": "Heres a breaking news article draft based on your brief:\n\nAre Foreign Degrees Improving People? ZIMCHE Issues Caution.\n\nYou come back from overseas expecting doors to openbut instead, you are told your degree is invalid. No job. No recognition. No future. For many Zimbabwean graduates, the bitter truth is dawning only after thousands of dollars and years of study: their foreign qualifications are worthless on home soil.\n\nHarare  The Zimbabwe Council for Higher Education (ZIMCHE) has sounded the alarm over a growing number of Zimbabwean students returning home with expensive foreign degrees that turn out to be worthless.\n\nParents and guardians are being urged to consult ZIMCHE before sending children abroad, as many institutions outside the country are not accredited, leaving graduates stranded with qualifications that cannot be recognised locally.\n\nZIMCHE chief executive, Professor Kuzvinetsa Peter Dzvimbo, said the trend is leaving families financially and emotionally devastated.\n\nIts a traumatic exercise for both the child and the parent as they spend a lot of money, only to discover that the institution they went to is not even recognised in its own country. You cannot have credit for that particular degree programme, he warned.\n\nZIMCHE insists Zimbabwes own 21 universities provide degrees that meet global standards, backed by rigorous quality assurance systems. Every new programme undergoes deep evaluationincluding checks on laboratories, libraries, and accommodationto safeguard the value of local qualifications.\n\nThe regulator is now rolling out a nationwide awareness campaign through radio, television, and print media to educate the public about the risks of unrecognised foreign degrees.\n\nProf Dzvimbo reminded parents that checking with ZIMCHE is free and could prevent heartbreak.\n\nWhether that institution is in Europe, Africa, Asia or Latin America, please check with us. You can send us an email and we will be more than happy to explain to you, and we do not charge for that service, he said.\n\nHe also defended the credibility of Zimbabwes universities, saying local degrees are globally comparable and aligned with the countrys development goals.\n\nThe message is clear: before investing thousands in foreign education, Zimbabwean families are better off seeking verification at homewhere quality is assured, and recognition guaranteed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Here’s a breaking news article draft based on your brief: Are Foreign Degrees Improving People? ZIMCHE Issues Caution. You come … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/02/worthless-papers-zimbabweans-return-home-to-find-their-foreign-degrees-rejected/\">Continue reading<span class=\"screen-reader-text\"> \".\t“Worthless Papers: Zimbabweans Return Home to Find Their Foreign Degrees Rejected”\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Road Tragedy Strikes Mutare, Juru, and Masvingo – Victims Named",
            "url": "https://www.zimeye.net/2025/09/02/road-tragedy-strikes-mutare-juru-and-masvingo-victims-named/",
            "content": "By A Correspondent\n\nHarare  The Zimbabwe Republic Police (ZRP) has released the names of victims who died in three separate fatal road traffic accidents that occurred in Mutare, Juru, and Masvingo between 28 and 30 August 2025.\n\nIn a statement, police said: The Zimbabwe Republic Police releases the names of victims who died in three fatal road accidents which occurred at the 46-kilometre peg along Mutare-Masvingo Road in Mutare, the 49-kilometre peg along the Harare-Nyamapanda Road in Juru, and the 246-kilometre peg along the Mutare-Masvingo Road in Masvingo.\n\nMutare (28 August 2025)\n\nThe accident near the 46-kilometre peg along the MutareMasvingo Road claimed the lives of:\n\nGodfrey Chikosi (45), Rowa East, Zimunya, Mutare\n\nVincent Museza (32), Rowa East, Zimunya, Mutare\n\nPatience Musabayana (30), Mafuke Village, Zimunya, Mutare\n\nMelissa Chigonde (22), Zindi, Honde Valley\n\nAnna Mudzingwa, Rowa East, Zimunya, Mutare\n\nMaybe Mundondo, Rowa East, Zimunya, Mutare\n\nJuru (29 August 2025)\n\nAt the 49-kilometre peg along the HarareNyamapanda Road in Juru, the victims were identified as:\n\nSunday Stenlodge (23), Binga Village, Domboshava\n\nFadzai Kamurai (25), Parirewa Village, Domboshava\n\nLin Nyamhunga, female infant (4), Parirewa Village, Domboshava\n\nNyasha Nyamhunga, male infant (6 months), Parirewa Village, Domboshava\n\nMatilda Dzangu (28), Parirewa Village, Domboshava\n\nKersely Matangaidza, female infant (2), Kuwadzana 5, Harare\n\nTariro Matangaidza, female juvenile (15), Kuwadzana 5, Harare\n\nMasvingo (30 August 2025)\n\nAt the 246-kilometre peg along the MutareMasvingo Road in Masvingo, the deceased were listed as:\n\nMoses Nyazika (47), Mutare\n\nTamari Nyakabau (39), Link Road, Mutare\n\nJuliet Mabika (33), Nyanyadzi\n\nHappymore Mhuka (37), Chikanga, Mutare\n\nEverson Chazvino (24), ZIMTA, Mutare\n\nTafadzwa Jacopo (27), ZIMTA, Mutare\n\nMaybe Mazuwa (44), Pangholin, Masvingo\n\nClever Murwei (46), Chikanga, Mutare\n\nThe police extended sympathies to the bereaved families. The Zimbabwe Republic Police extends deepest condolences to the families of the victims. We appeal to drivers to seriously consider road safety while moving on the countrys roads, the statement read.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare – The Zimbabwe Republic Police (ZRP) has released the names of victims who died in three … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/02/road-tragedy-strikes-mutare-juru-and-masvingo-victims-named/\">Continue reading<span class=\"screen-reader-text\"> \"Road Tragedy Strikes Mutare, Juru, and Masvingo – Victims Named\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Couple Narrowly Escapes Death as Lodge Above Bata Shop Catches Fire",
            "url": "https://www.zimeye.net/2025/09/01/couple-narrowly-escapes-death-as-lodge-above-bata-shop-catches-fire/",
            "content": "By Dorrothy Moyo | A dramatic scene unfolded in an undated viral video showing a said couple making a desperate escape from a burning lodge located above a Bata shoe shop.\n\nThe footage, widely circulated online, captures the terrifying moments as thick smoke billowed from the building while frantic occupants tried to save themselves. A ladder was hastily set up to rescue those trapped inside.\n\nIn the video, a woman is seen being assisted down first, clutching her handbag tightly as onlookers cheer her safe exit. But the real tension builds when her male companion, visibly struggling and appearing disoriented, takes much longer to emerge.\n\nAt one point, the crowd gasps as he hesitates at the window, his large frame making it difficult to navigate the narrow exit. Onlookers anxiously shout encouragement, with some even celebrating prematurely as he appears to falter.\n\nFinally, in a moment of triumph, the man breaks free, climbing down the ladder to safety. The crowd erupts in relief and jubilation, cheering his dramatic escape from what could have been a deadly blaze.\n\nThe cause of the fire has not been confirmed, but witnesses say the quick thinking of bystanders and the availability of the ladder prevented what could easily have turned into tragedy.\n\nThe video has since sparked wide debate onlinesome highlighting the bravery of rescuers and the resilience of the couple, while others point to safety concerns over lodges situated in crowded commercial buildings with limited fire exits.\n\nFor this couple, however, it was truly an escape by the skin of their teetha story that might have ended in tragedy but instead became a viral tale of survival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | A dramatic scene unfolded in an undated viral video showing a said ‘couple’ making a desperate … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/couple-narrowly-escapes-death-as-lodge-above-bata-shop-catches-fire/\">Continue reading<span class=\"screen-reader-text\"> \"Couple Narrowly Escapes Death as Lodge Above Bata Shop Catches Fire\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Confusion Rocks Masvingo Over ZBC Licence Exemptions",
            "url": "https://www.zimeye.net/2025/09/01/confusion-rocks-masvingo-over-zbc-licence-exemptions/",
            "content": "By A Correspondent\n\nMASVINGO  Motorists in Masvingo endured a day of chaos on Monday, being tossed from one government office to another as they sought exemption from the controversial Zimbabwe Broadcasting Corporation (ZBC) radio licence requirement.\n\nThe law, recently gazetted, requires all motorists to purchase ZBC radio licences before they can insure their vehicles or obtain motor vehicle licences.\n\nExemptions apply only to vehicle owners whose cars do not have radios installed  but many complained that even qualifying for this exemption was made unnecessarily difficult.\n\nA motorist from Nemamwa Growth Point, visibly agitated, said the new policy is unfair. This is daylight robbery. I do not even have a car radio, but they are making it almost impossible to get the exemption letter.\n\nAnother motorist from Bhuka said the new rules were punishing ordinary people who are already struggling. We are barely managing to fuel our vehicles, and now they want us to pay for radio licences we dont even use. Government is completely out of touch with the suffering of citizens.\n\nIn Mashava, a motorist expressed anger over the perceived insensitivity of authorities. This whole process is just another way of squeezing us. Why should car insurance and motor vehicle licences be tied to ZBC licences? It makes no sense at all.\n\nThe discontent reflects growing resistance among drivers, many of whom accuse government of prioritising revenue collection over public welfare.\n\nDespite the uproar, officials insisted that the law would be enforced nationwide, a move likely to inflame tensions as motorists grapple with rising costs of living.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MASVINGO – Motorists in Masvingo endured a day of chaos on Monday, being tossed from one government … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/confusion-rocks-masvingo-over-zbc-licence-exemptions/\">Continue reading<span class=\"screen-reader-text\"> \"Confusion Rocks Masvingo Over ZBC Licence Exemptions\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        },
        {
            "title": "Selmor Revives Tuku Legacy",
            "url": "https://www.zimeye.net/2025/09/01/selmor-revives-tuku-legacy/",
            "content": "By Showbiz Reporter  Selmor Mtukudzi, the daughter of the late Zimbabwean music legend Dr Oliver Tuku Mtukudzi, is keeping her fathers memory alive through a series of regional shows in his honour.\n\nSelmor, who has carved her own successful path in music, is set to headline three major events this September dedicated to celebrating Tukus life and enduring influence. On Saturday, 13 September 2025, she will leadSaturday Nights Live: A Celebration of Dr Oliver Mtukudzis Lifeat the Hard Rock Caf in Johannesburg. The show, which starts at 6 PM, will feature supporting acts from DJs Mr V, ScoreBeatz, and Irie Dread.\n\nA week later, on 21 September, Selmor will perform at theTozeza Tuku Trail Runat Wingate Boat Club, Lake Chivero. The event blends sport and music with 5km, 10km, and 21.1km obstacle challenges, bringing back the original Tuku trail experience. Eves Event Management, the organisers, said the run will also serve as a family-friendly celebration of Tukus legacy.\n\nSelmors efforts to honour her father come against the backdrop of her own dynamic musical journey. A seasoned Afro-jazz and contemporary singer, she began her career in the early 2000s and has since grown into one of Zimbabwes most recognised female artists. Together with her husband, Tendai Manatsa  son of the late legendary musician Zexie Manatsa  she has performed on both local and international stages, blending soulful vocals with social commentary.\n\nDespite early comparisons to her father, Selmor has worked hard to assert her own artistic identity. Yet, she has also embraced her inheritance of Tukus rich musical tradition, often performing his classics while also pushing her own catalogue that includes hits such asNguva YanguandZvinoita Murudo.\n\nHer journey to preserving Tukus legacy has not been without challenges. After Tukus passing in January 2019, questions over his estate and the control of his musical heritage led to tension within the family. Selmor, the daughter of Tuku and his first wife Melody, was at times at odds with her stepmother Daisy, who was Tukus widow. While Daisy initially took the helm of the Tuku Music brand, Selmor eventually emerged as a torchbearer, fronting concerts and initiatives that celebrated her fathers artistry, much to the admiration of fans who felt she best embodied his spirit on stage.\n\nThrough these upcoming September shows, Selmor not only reaffirms her role as custodian of Tukus legacy but also bridges generations  ensuring that her fathers timeless music continues to inspire both Zimbabweans and audiences across the region.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Selmor Mtukudzi, the daughter of the late Zimbabwean music legend Dr Oliver “Tuku” Mtukudzi, is keeping … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/09/01/selmor-revives-tuku-legacy/\">Continue reading<span class=\"screen-reader-text\"> \"Selmor Revives Tuku Legacy\"</span></a></p>",
            "time": "18:33",
            "date": "02 Sep 2025"
        }
    ]
}