{
    "news": [
        {
            "title": "Mnangagwa To Address Nation As Political Pressure Rises In Country",
            "url": "https://www.zimeye.net/2025/10/24/mnangagwa-to-address-nation-as-political-pressure-rises-in-country/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa is set to address the nation next Tuesday during a joint sitting of Parliament, where he will outline the governments legislative agenda for the Third Session of the 10th Parliament.\n\nThe President will also deliver the much-anticipated State of the Nation Address (SONA) at a time when Zimbabwe is facing mounting social, economic, and political tensions.\n\nAccording to a public notice issued by Parliament on Thursday under General Notice 2162 of 2025, His Excellency, the President of the Republic of Zimbabwe, Honourable Emmerson Dambudzo Mnangagwa will, in terms of section 140(1) of the Constitution, address a joint sitting of the Senate and the National Assembly on Tuesday, the 28th of October, 2025, at 1200 hours, during which he will set out the Governments legislative agenda for the Third Session of the Tenth Parliament.\n\nThe notice further stated that in terms of section 140(4) of the Constitution, the President will deliver the State of the Nation Address.\n\nThe announcement was signed by the Deputy Speaker of the National Assembly, Hon. T. Gezi.\n\nMnangagwas address is expected to focus on economic recovery, governance reforms, and national stability amid growing frustration over inflation, unemployment, and declining public confidence.\n\nPolitical observers say the President is under increasing internal and external pressure  both within the ruling Zanu PF party and from the opposition. Critics argue that the administrations Vision 2030 agenda is being used as a political tool to justify extending Mnangagwas stay in power beyond constitutional limits.\n\nWith rising discontent across the country, all eyes will be on next weeks address to see whether the President will offer tangible solutions to the crises facing Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa is set to address the nation next Tuesday during a joint sitting of Parliament, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/mnangagwa-to-address-nation-as-political-pressure-rises-in-country/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa To Address Nation As Political Pressure Rises In Country\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "Horror As Man Kills Rival Over Snooker Tokens",
            "url": "https://www.zimeye.net/2025/10/24/horror-as-man-kills-rival-over-snooker-tokens/",
            "content": "By A Correspondent\n\nA man from Harare appeared in court on Thursday facing murder charges after allegedly fatally stabbing his rival during a snooker game over missing tokens.\n\nBlessed Muchenje of Epworth appeared before Harare magistrate Mr Artwell Sanyatwe.\n\nHe was remanded in custody and advised to apply to the High Court for bail.\n\nAccording to the State, the incident occurred on August 13 at around midnight at Tobela Night Club, Overspill in Epworth. Muchenje and the now deceased were reportedly drinking beer while playing snooker when a disagreement arose over missing tokens.\n\nThe argument escalated into a fist fight, after which Muchenje allegedly forced the victim outside the night club. He is accused of stabbing the man twice in the shoulder and once in the back with an Okapi knife before fleeing the scene.\n\nThe victim was later transported to Domboramwari Clinic, where he was pronounced dead on arrival.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A man from Harare appeared in court on Thursday facing murder charges after allegedly fatally stabbing his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/horror-as-man-kills-rival-over-snooker-tokens/\">Continue reading<span class=\"screen-reader-text\"> \"Horror As Man Kills Rival Over Snooker Tokens\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "Mnangagwa To Address Nation As Political Pressure Rises In Country",
            "url": "https://www.zimeye.net/2025/10/24/mnangagwa-to-address-nation-as-political-pressure-rises-in-country-2/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa is set to address the nation next Tuesday during a joint sitting of Parliament, where he will outline the governments legislative agenda for the Third Session of the 10th Parliament.\n\nThe President will also deliver the much-anticipated State of the Nation Address (SONA) at a time when Zimbabwe is facing mounting social, economic, and political tensions.\n\nAccording to a public notice issued by Parliament on Thursday under General Notice 2162 of 2025, His Excellency, the President of the Republic of Zimbabwe, Honourable Emmerson Dambudzo Mnangagwa will, in terms of section 140(1) of the Constitution, address a joint sitting of the Senate and the National Assembly on Tuesday, the 28th of October, 2025, at 1200 hours, during which he will set out the Governments legislative agenda for the Third Session of the Tenth Parliament.\n\nThe notice further stated that in terms of section 140(4) of the Constitution, the President will deliver the State of the Nation Address.\n\nThe announcement was signed by the Deputy Speaker of the National Assembly, Hon. T. Gezi.\n\nMnangagwas address is expected to focus on economic recovery, governance reforms, and national stability amid growing frustration over inflation, unemployment, and declining public confidence.\n\nPolitical observers say the President is under increasing internal and external pressure  both within the ruling Zanu PF party and from the opposition. Critics argue that the administrations Vision 2030 agenda is being used as a political tool to justify extending Mnangagwas stay in power beyond constitutional limits.\n\nWith rising discontent across the country, all eyes will be on next weeks address to see whether the President will offer tangible solutions to the crises facing Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa is set to address the nation next Tuesday during a joint sitting of Parliament, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/mnangagwa-to-address-nation-as-political-pressure-rises-in-country-2/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa To Address Nation As Political Pressure Rises In Country\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "Mnangagwa Relegates General Chiwenga To Low Key Events As Tussle For Power Continues",
            "url": "https://www.zimeye.net/2025/10/24/mnangagwa-relegates-general-chiwenga-to-low-key-events-as-tussle-for-power-continues/",
            "content": "By A Correspondent\n\nVice President Constantino Chiwenga has been increasingly confined to low-profile engagements as President Emmerson Mnangagwa consolidates his grip on power.\n\nThis week, Chiwenga toured the US$30 million Orange Ville juicing plant in Beitbridge, describing the facility as a significant step towards rural industrialisation and empowering our local communities. Since opening in July 2025, the plant has processed over 25,000 tonnes of oranges and currently provides employment for 290 people, with potential to expand to 3,000 jobs.\n\nHowever, a government source indicated that the visit underscored Chiwengas diminishing political clout. The Vice President is being progressively assigned ceremonial duties, effectively sidelining him from meaningful decision-making, the source remarked.\n\nObservers suggest that while Chiwenga continues to champion initiatives such as Orange Ville, his political role is increasingly symbolic.\n\nHe is slowly being reduced to a figurehead, with his influence carefully curtailed, the source added.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Vice President Constantino Chiwenga has been increasingly confined to low-profile engagements as President Emmerson Mnangagwa consolidates his … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/mnangagwa-relegates-general-chiwenga-to-low-key-events-as-tussle-for-power-continues/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Relegates General Chiwenga To Low Key Events As Tussle For Power Continues\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "Chivayo Rewards Fire Hero Sirizani Butau With Car, Cash — Is He Pacifying Calls to Probe Zvigananda’s Looted Wealth?",
            "url": "https://www.zimeye.net/2025/10/24/chivayo-rewards-fire-hero-sirizani-butau-with-car-cash-is-he-pacifying-calls-to-probe-zviganandas-looted-wealth/",
            "content": "By A Correspondent\n\nHarare, Zimbabwe  Controversial Zanu PF businessman Wicknell Chivayo has donated a motor vehicle and a cash reward to Fire Hero Sirizani Butau in what he described as a gesture of appreciation for Butaus bravery during a deadly accident in 2021.\n\nIn a social media post on Friday, Chivayo praised Butau for risking his life to save passengers from a fuel tanker accident along the Harare-Mutare highway.\n\nToday I woke up in a good mood and remembered a TRUE HERO, who lives amongst us. A man whose courage and bravery showed the goodness of humanity. This man is none other than Sirizani Butau, Chivayo wrote.\n\nThe businessman recounted the dramatic events, saying: In 2021, Sirizani fearlessly risked his own life to save others from a deadly inferno following a tragic accident involving a fuel tanker carrying over 50,000 litres of petrol. The accident ignited massive flames and the real threat of an explosion. Sirizani did not run away like most of us would. Instead, he ran towards the fire and pulled out trapped passengers from the burning wreckage, risking his own life so that others could live.\n\nButau, who sustained severe burns and permanent scars from the incident, later received the Gold Cross of Zimbabwe Award, the nations highest honour for bravery, presented by President Emmerson Mnangagwa.\n\nAs a personal gesture of recognition, Chivayo announced that Butau would receive a brand-new Toyota Fortuner and USD 50,000 in cash. As a small token of my appreciation for your unprecedented heroic sacrifice, I want to personally celebrate you in your lifetime. You may even consider starting your own trucking business as you have indeed proven yourself to be a man of steel and courage, Chivayo said.\n\nChivayo concluded his message with a call for humanity and compassion: May God bless you abundantly for your sacrifice. Your scars are medals of honour tattooed on your skin and are a permanent reminder that love still lives among us. Chidzidziso kwatiri tese, to love one another and to always act with compassion as we are all children of God.\n\nThe donation comes amid rising public scrutiny of Chivayos business dealings, with some calling for investigations into his activities, raising questions about whether the gesture is purely altruistic or partly aimed at managing public pressure.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Harare, Zimbabwe – Controversial Zanu PF businessman Wicknell Chivayo has donated a motor vehicle and a cash … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/chivayo-rewards-fire-hero-sirizani-butau-with-car-cash-is-he-pacifying-calls-to-probe-zviganandas-looted-wealth/\">Continue reading<span class=\"screen-reader-text\"> \"Chivayo Rewards Fire Hero Sirizani Butau With Car, Cash — Is He Pacifying Calls to Probe Zvigananda’s Looted Wealth?\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "Mnangagwa Regime Sweats Over Soaring Malaria Cases",
            "url": "https://www.zimeye.net/2025/10/24/mnangagwa-regime-sweats-over-soaring-malaria-cases/",
            "content": "By A Correspondent  The Emmerson Mnangagwa administration is facing mounting criticism as malaria continues to claim lives across Zimbabwe, with Mashonaland West province reporting 78 deaths since January this year.\n\nObservers say the spike highlights systemic failures in the governments health response and raises questions about preparedness in malaria-prone areas.\n\nGovernment sources said on Thursday that they are intensifying efforts through community awareness programs, vaccination campaigns, and larva scoping in stagnant water bodies. Community-based health workers are at the forefront, bringing services directly to households.\n\nNyakasikana Village health worker Mr Friday Kavhinga told the Zimbabwe Broadcasting Corporation : We test people right at their homes and refer serious cases to the clinic. Before, people would travel long distances, but now help is at their doorstep.\n\nDespite these interventions, Hurungwe district alone has recorded 28 deaths, marking it as one of the hardest-hit areas in Mashonaland West. Health officials attribute the surge to irregular rainfall patterns and inadequate preventive infrastructure.\n\nHurungwe remains one of the hardest districts hit by malaria in Mashonaland West. We have recorded 28 deaths, and our teams are working tirelessly to reduce this number as we head into the rainy season. We are installing new diagnostic machines, Chemistry Analyser, ensuring adequate drug supplies, and intensifying spraying and awareness programs. The goal is to curb new infections and prevent avoidable deaths, said a source in the Ministry of Health and Child Care last week.\n\nThe International Federation of Red Cross and Red Crescent Societies is also involved, providing testing kits and training for village health workers. PMER Officer Mrs Tariro Kamangira told State media : As the International Federation of Red Cross and Red Crescent Societies, we believe fighting malaria requires a collective effort. The government is doing a tremendous job in prevention and response, but communities also need strong support systems. Thats why we are complementing these efforts through training village health workers, providing testing kits, and ensuring that critical health services reach even the most remote areas. Our focus is to save lives by strengthening community resilience.\n\nCritics argue, however, that these measures are long overdue and fail to address deeper systemic weaknesses in Zimbabwes health sector. Observers point out that despite repeated warnings and previous malaria outbreaks, the governments reactive strategies have left communities vulnerable, resulting in preventable deaths.\n\nAt the national level, a source in the Ministry of Health and Child Care said last week that indoor residual spraying has been scaled up, insecticide-treated nets distributed, and awareness campaigns intensified. The Ministry aims to reduce malaria incidence by 90 percent by 2030.\n\nBut for many Zimbabweans watching loved ones fall victim to a disease that is largely preventable, such targets offer little consolation. The unfolding crisis underscores a harsh reality: under the Mnangagwa regime, public health emergencies continue to expose gaps in governance and preparedness.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent – The Emmerson Mnangagwa administration is facing mounting criticism as malaria continues to claim lives across Zimbabwe, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/mnangagwa-regime-sweats-over-soaring-malaria-cases/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Regime Sweats Over Soaring Malaria Cases\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "Police Defend Rising Number of Roadblocks Amid Public Outcry Over Extortion",
            "url": "https://www.zimeye.net/2025/10/24/police-defend-rising-number-of-roadblocks-amid-public-outcry-over-extortion/",
            "content": "By Crime and Courts Reporter  The Zimbabwe Republic Police (ZRP) has defended the growing number of roadblocks across the country, particularly in major cities, amid mounting public anger over alleged harassment, extortion, and corruption by officers manning them.\n\nMotorists say the roadblocks  often within short distances of each other  have turned routine travel into a daily nightmare. In Harare, for instance, a frustrated Southerton resident said police sometimes mount as many as four separate checkpoints within a five-kilometre stretch.\n\nThere are usually three or four at once  one on Willowvale Road, another along Harare Drive, one on Highfield Road, and another at the corner of Highfield and Manchester Roads, the motorist complained. At each stop, officers demand spot fines for petty or unclear offences.\n\nThis sentiment echoes widespread frustration across the country, where police roadblocks have long been accused of serving as fundraising tools rather than genuine traffic-safety or crime-prevention measures.\n\nDuring the height of Zimbabwes economic crisis between 2016 and 2017, roadblocks became so notorious that transport operators and civil society groups described them as tollgates of corruption. Long-distance bus drivers complained of being forced to pay bribes at nearly every checkpoint to avoid fabricated charges, while the Zimbabwe National Chamber of Commerce (ZNCC) once warned that police harassment on the roads was discouraging business activity and tourism.\n\nDespite repeated pledges to reform, the problem appears to have resurfaced. In recent months, motorists have reported a sharp increase in police presence on major roads, with officers allegedly extorting small amounts ranging from US$2 to US$20 for minor offences such as cracked windscreens, missing reflectors, or failure to display vehicle licences  even when receipts are up to date.\n\nHowever, in a statement on Thursday, ZRP spokespersonCommissioner Paul Nyathiinsisted that all roadblock deployments follow strict procedures and are approved through proper command channels.\n\nThe Zimbabwe Republic Police has taken note of the publics concerns regarding the sighting and manning of police roadblocks in the country, said Comm. Nyathi.\n\nAll police roadblock schedules are submitted by Station, District and Provincial Commanders to the Police General Headquarters Operations Department for guidance and clearance.\n\nThe policy of the Zimbabwe Republic Police is that no roadblocks are manned within a 30 to 50 kilometre radius of each policing area, whether in urban or rural setups.\n\nHe said officers conducting roadblock duties are supervised by their commanders to prevent indiscipline or corruption and ensure quality service to the public.\n\nComm. Nyathi added that roadblocks may be temporarily increased during public order operations, national events, or special deployments in response to crime incidents  but must revert to normal levels afterward.\n\nHe encouraged the public to report any suspicious or excessive roadblock activity directly to the Police General Headquarters.\n\nDisciplinary action will be taken against any police officer who conducts roadblock duties in a manner not in conformity with police set standards, he said, providing the National Complaints Desk number (0242 703631) and a WhatsApp hotline (0712 800 197).\n\nCivil society organisations have urged the ZRP to back its promises with transparency and accountability. The Zimbabwe Lawyers for Human Rights (ZLHR) recently said that while road safety is important, the continued abuse of motorists through arbitrary fines and intimidation undermines public trust in law enforcement.\n\nWith public transport operators and private motorists already struggling under fuel price hikes and vehicle licensing costs, the return of dense police roadblocks has reignited debate over whether law enforcement in Zimbabwe is being used for public safety or as a desperate revenue stream for a cash-strapped state.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – The Zimbabwe Republic Police (ZRP) has defended the growing number of roadblocks across the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/police-defend-rising-number-of-roadblocks-amid-public-outcry-over-extortion/\">Continue reading<span class=\"screen-reader-text\"> \"Police Defend Rising Number of Roadblocks Amid Public Outcry Over Extortion\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "Honorary Doctorates in Zimbabwe: Prestige or Patronage?",
            "url": "https://www.zimeye.net/2025/10/24/honorary-doctorates-in-zimbabwe-prestige-or-patronage/",
            "content": "By A Correspondent-Across Zimbabwes universities, the conferment of honorary doctoral degrees is intended to recognise individuals who have made exceptional contributions to society, academia, or public life.\n\nHowever, a mounting body of commentary and evidence suggests that this practice is increasingly being used as a tool of political patronage, status enhancement, and institutional self-promotion, rather than as a genuine marker of academic or civic merit.\n\nSeveral recent cases illustrate the problem. For example, in July 2025, the Nigerian institution Babcock University awarded an honorary doctorate in Business and Strategic Management to Zimbabwean businessman Kudakwashe Tagwirei, a close associate of the ruling party.\n\nThis move sparked public outcry when Presidential spokesperson George Charamba  writing under his pseudonym on social media- condemned the routine use of the title Doctor as if izita remadunhurirwa (a title of worship), linking such practices to fraud.\n\nAnother case involved the awarding of an honorary doctoral degree to the First Lady, Auxilia Mnangagwa, by the University of Zimbabwe (UZ) in 2023.\n\nThe latest was the conferment of the same yesterday, on Vice President Kembo Mohadi at the Great Zimbabwe University by President Mnangagwa.\n\nCritics argued that the process lacked transparency and raised questions about whether the criteria for the award had been met.\n\nCommentators have pointed out that the misuse of honorary titles reflects deeper structural problems in Zimbabwes academic and political culture. As one piece argues:\n\nOver the years, the title Doctor has been diluted by a flood of dubious degrees from unaccredited institutions and cheaply acquired honorary awards. These titles are flaunted in public life to command respect, gain influence, or enhance political campaigns.ZimEye\n\nBeyond Zimbabwe, the issue of honorary degrees and their appropriation is recognised internationally. A Good Practice Guide from South Africas Council on Higher Education (CHE) warns that honorary degrees are not academic qualifications, should be awarded sparingly, and that recipients must not treat them as earned academic titles (e.g., using the Dr prefix) outside the context of the awarding institution.\n\nIn the Zimbabwean context, three core problems emerge:\n\nThe implications are serious. For students, the value of academic degrees and titles may diminish when the signal of excellence becomes diluted.\n\nFor universities, reputational risk arises: their credibility depends on rigour, impartiality, and respect for academic standards.\n\nFor the public sector, when political actors flaunt unearned Doctor titles, the boundaries between expertise, merit, and privilege are blurred  impairing accountability, reinforcing elite capture, and diminishing the place of genuine scholarship in public life.\n\nIf Zimbabwe is to preserve integrity in its higher-education system, a number of reforms merit consideration: universities should publish clear criteria and processes for honorary awards; recipients should be explicitly prohibited from using the title Dr (or similar) outside ceremonial contexts; independent oversight bodies (such as the Zimbabwe Council for Higher Education or relevant parliamentary committees) should review honorary-award practices; and higher-education policy should emphasise the difference between earned and honorary titles in public communications and institutional marketing.\n\nIn short: honorary doctorates can play a legitimate role in recognising exceptional contribution  but when they are routinely awarded to politically connected individuals, and when the use of the title becomes commonplace and unregulated, they risk becoming part of the problem rather than the solution.\n\nZimbabwes universities and regulators must act to safeguard the symbolism and value of the Doctor title before it is irrevocably compromised.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Across Zimbabwe’s universities, the conferment of honorary doctoral degrees is intended to recognise individuals who have made exceptional … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/honorary-doctorates-in-zimbabwe-prestige-or-patronage/\">Continue reading<span class=\"screen-reader-text\"> \"Honorary Doctorates in Zimbabwe: Prestige or Patronage?\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "CIO Boss Never Kidnapped Scammers- Mavaza",
            "url": "https://www.zimeye.net/2025/10/24/cio-boss-never-kidnapped-scammers-mavaza/",
            "content": "By Dr Masimba Mavaza | The recent article published by Zimeye alleging that Fulton Mangwanya, Director-General of Zimbabwes Central Intelligence Organisation (CIO), lost ZAR1.5 million to a scam is inaccurate and misleading. The article falsely claims that Mangwanya worked with Scott Sakupwanya, which is not true.\n\nThe articles allegations that Mangwanyas daughter carried out a transfer as instructed by scammers and that Mangwanya sent his militia to track down and kidnap two of the scammers are unfounded and lack proof.\n\nAccording to clarification on the incident, the individuals involved in the scam are Blessing Vava, Desmond Mangena, Prince James, and Solomon Jokonya, who are facing charges related to theft. The matter has been referred to the police, and the accounts involved have been frozen.\n\nThe scammers are known fraudsters who target high-profile figures. As journalists, its crucial to verify facts, especially when reporting on senior officials, to ensure accurate information is presented.\n\nTheres no evidence that Mangwanya used CIO officers to track the criminals. The matter was referred to the police, and the criminals have been accounted for. Having a suspect in custody doesnt constitute kidnapping.\n\nThe CIO is a professional organisation that follows due process. Zimeyes article appears to victimise the victim and glorify the criminals, rather than exposing the scam. The article seems to be an effort to demonise Mangwanya and glorify the perpetrators.Making an effort to bring in criminals can never be referred to as abuse of office or rule of law.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Masimba Mavaza | The recent article published by Zimeye alleging that Fulton Mangwanya, Director-General of Zimbabwe’s Central Intelligence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/cio-boss-never-kidnapped-scammers-mavaza/\">Continue reading<span class=\"screen-reader-text\"> \"CIO Boss Never Kidnapped Scammers- Mavaza\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        },
        {
            "title": "How Zimbabwe’s Top Intelligence Boss Including British Officers Keep Getting Scammed Under the Hopewell Chin’ono ID Name Change Stupor | EXPERT COMMENT",
            "url": "https://www.zimeye.net/2025/10/24/how-zimbabwes-top-intelligence-boss-including-british-officers-keep-getting-scammed-under-the-hopewell-chinono-id-name-change-stupor-expert-comment/",
            "content": "By Simba Chikanza | Analysis |\n\nMany who are ignorant have expressed shock over how the head of Zimbabwes intelligence was scammed by some youths; not knowing anyone inspired by dodgy (triple ID holders) characters like Hopewell Chinono, in a world that clumsily labels him an investigative journalist, will likely do worse than rob an intel officer, they will destroy whole countries. They are doing it right now, making the world more unsafe than it was in 2001, when Chinono swapped IDs 3 times, in that period when some of us were stuck in the financial services industry developing software to close up the loopholes, with which he now falsely claims money he illegally moved out of UK, to purchase his first home obtained a police clearance by the UK embassy through a 2011 political allegations letter he albeit got written for him using someone elses documentary footage. UK embassy staff members were tricked by Chinono whos spent 14 years falsifying that the consulate declared in writing that Hopewell Chinono is not a fugitive from justice in Britain. If the UK Govts top intel officers are duped, what more those of smaller countries like Zimbabwe, where Chinono even successfully deleted investigative journalist, Geoff Nyarotas voice from his bosss own 2009 documentary while contracted as a mere cameraman?\n\nWhen I became the youngest British Insurance Software developer and the youngest senior-bookkeeper aged 22, we had no clue 24 years later, British intelligence officers would be fooled over well known DNA systems loopholes, and be misled by people who keep changing their names using professions like journalism and some who are medical doctors (like Dr Sandra Ndirika) who have been caught in 2025 cloning ID cards of patients in British surgeries. The world has really become a dangerous place where Chinono colleagues like Jennifer Banyure using his name are daring to the point of moving to hack Gatwick Airport database to delete names they used in the year Chinono changed his (watch the full documentary on ZimEye).\n\nAs someone heavily involved in software development, and a British Insurance industry publisher 25 years ago, I am appalled that things have only become worse, a quarter of a century later, where you can no longer feel safe when you enter a hospital theatre. This explains the emergency with which I train police officers around the world, to expose the Hopewell Chinono scammers, who are daring to eat into many govts and the entirety of human civilisation. Things are really worse scary than a single intel officer getting scammed. Its World War 3!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Simba Chikanza | Analysis | Many who are ignorant have expressed shock over how the head of Zimbabwe’s intelligence … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/24/how-zimbabwes-top-intelligence-boss-including-british-officers-keep-getting-scammed-under-the-hopewell-chinono-id-name-change-stupor-expert-comment/\">Continue reading<span class=\"screen-reader-text\"> \"How Zimbabwe’s Top Intelligence Boss Including British Officers Keep Getting Scammed Under the Hopewell Chin’ono ID Name Change Stupor | EXPERT COMMENT\"</span></a></p>",
            "time": "21:07",
            "date": "24 Oct 2025"
        }
    ]
}