{
    "news": [
        {
            "title": "Message to Zandile Dabula of Operation Dudula",
            "url": "https://www.zimeye.net/2025/10/20/message-to-zandile-dabula-of-operation-dudula/",
            "content": "Dear Zandile,\n\nMy African sister, I write to share some important historical context that may help guide your movements perspective on regional unity and African solidarity. During the 1970s and 1980s, a group of Southern African nations known as the Frontline States Tanzania, Zambia, Botswana, Angola, and Mozambique, later joined by Zimbabwe played a vital role in supporting liberation struggles against colonialism and apartheid.\n\nThese countries risked their own security and economies to provide refuge, training and support to South African liberation movements such as the ANC and PAC, as well as SWAPO in Namibia and ZANU/ZAPU in Zimbabwe. Despite suffering from cross-border attacks and economic blockades by apartheid forces, they never turned their backs on the fight for South Africas freedom.\n\nThe unity and sacrifice of the Frontline States laid the foundation for todays Southern African Development Community (SADC). Their legacy is a reminder that the freedom of one African nation is tied to the freedom and dignity of all.\n\nTrue patriotism and progress come not from division, but from solidarity and understanding among African people. We must remember that the same hands that sheltered South Africans in exile deserve our respect today.\n\nAmandla\n\nJacob Kudzayi Mutisi+263772278161\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Dear Zandile, My African sister, I write to share some important historical context that may help guide your movement’s perspective … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/message-to-zandile-dabula-of-operation-dudula/\">Continue reading<span class=\"screen-reader-text\"> \"Message to Zandile Dabula of Operation Dudula\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "Ziyambi Moves To Bury VP Chiwenga",
            "url": "https://www.zimeye.net/2025/10/20/ziyambi-moves-to-bury-vp-chiwenga/",
            "content": "By A Correspondent President Emmerson Mnangagwas trusted ally and head of theVision 2030 Agenda Pushers, Justice Minister Ziyambi Ziyambi, has moved to cement Mnangagwas political dominance by initiating constitutional amendments that could extend the Presidents rule to 2030.\n\nIf successful, the proposed extension would politically bury Vice President Constantino Chiwengas presidential ambitions, effectively ending his long-anticipated succession bid set for 2028.\n\nAt ZANU PFs National Peoples Conference in Mutare on Saturday, Mnangagwas loyalists erupted into song, chants, and applause, hailing the President while booing and denouncing Chiwenga a rare and symbolic moment thatunderscored the shifting power dynamics within the ruling party.\n\nZiyambi, who read out the resolution on behalf of the conference, received thunderous cheers as delegates chanted2030 ndeya Emmerson!(2030 belongs to Emmerson!). The resolution reaffirmed a similar motion adopted at the 2024 Bulawayo Conference, directing the Justice Ministry, Parliament, and key ZANU PF organs to begin legal processes to amend the Constitution and allow Mnangagwa to remain in power for two more years beyond his current term.\n\nItis resolvedthat His Excellencys term of office as President of the Republic of Zimbabwebe extendedbeyond 2028 to 2030, declared Ziyambi to deafening cheers. The party and government are therefore directed to initiate the requisite legislative amendments before the next National Peoples Conference.\n\nDelegates from all ten provinces rose in unison, waving flags and singing praises of Mnangagwas visionary leadership. Ziyambi lauded the President for tangible development milestones and credited him with driving Zimbabwe towardVision 2030, the governments roadmap to an upper-middle-income economy.\n\nThe ZANU PF Youth League, led by Secretary Tino Machakaire, quickly endorsed the resolution.\n\nIn order for our revered President to see through Vision 2030, we reaffirm that His Excellency must continue in office until 2030, Machakaire declared.\n\nMnangagwas second and final term is constitutionally due to end in 2028, but the latest developments reveal a coordinated campaign within ZANU PF to entrench his rule. Although Mnangagwa has repeatedly described himself as a constitutionalist who would not overstay his mandate, his allies now appear to be testing both legal and political limits to extend his tenure.\n\nThe Mutare conference also signalled a new phase in the long-running cold war between Mnangagwa and his deputy. The two mens uneasy alliance dates back to the November 2017 coup that toppled Robert Mugabe. Chiwenga, then Commander of the Zimbabwe Defence Forces, led the military operation that installed Mnangagwa as President  positioning himself as both kingmaker and presumed successor.\n\nHowever, once in power, Mnangagwa swiftly consolidated control, sidelining Chiwenga and purging key military loyalists from the party and government. By 2019, the alliance had fractured amid accusations of corruption, betrayal, and mutual distrust.\n\nMnangagwas systematic reshuffling of the army, intelligence services, and provincial party structures further weakened Chiwengas influence, gradually stripping him of his once-formidable power base.\n\nThe open booing of Chiwenga by party delegates in Mutare  an unthinkable gesture a few years ago  demonstrated just how thoroughly his political capital has eroded. Most of his allies have been reassigned, retired, or absorbed into Mnangagwas patronage networks, leaving the Vice President increasingly isolated.\n\nWhen asked byZiFM Stereo Newswhether Mnangagwa could face a challenge at the 2026 elective congress, party spokesperson Christopher Mutsvangwa maintained thatZANU PFremains a democratic organisation.\n\nIf people want to contest, they are free to do so  its a democratic party, Mutsvangwa said. But if you lose, you must comply with the wishes of the majority.\n\nWith the Mutare conference now formally directing the government to enact legislation for Mnangagwas term extension, the message from the party faithful was unmistakable  Mnangagwas presidency is not ending in 2028.\n\nAs chants of2030 ndeya Emmerson!echoed through the conference hall, one thing became clear: Ziyambi Ziyambi has set in motion a political process designed not just to extend Mnangagwas rule, but to decisively bury any hopes Vice President Chiwenga had of ever succeeding him.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — President Emmerson Mnangagwa’s trusted ally and head of the Vision 2030 Agenda Pushers, Justice Minister Ziyambi Ziyambi, has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/ziyambi-moves-to-bury-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Ziyambi Moves To Bury VP Chiwenga\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "Mliswa: VP Chiwenga Abandoned Soldiers And Today He’s Dug His Own Grave By Trying To Embarrass Own Boss",
            "url": "https://www.zimeye.net/2025/10/20/mliswa-vp-chiwenga-abandoned-soldiers-and-today-hes-dug-his-own-grave-by-trying-to-embarrass-own-boss/",
            "content": "MLISWA: CHIWENGA HAS DUG HIS OWN GRAVE\n\nBy Simba Chikanza | ZimEye Exclusive Interview.\n\nVice President Constantino Chiwenga has dug his own political grave and destroyed any remaining credibility he once held within ZANU PF, outspoken independent legislator Hon. Temba Mliswa has said in a hard-hitting interview with Simba Chikanza of ZimEye.\n\nSpeaking with rare candour, Mliswa said Chiwenga had overplayed his hand, lost the trust of the military and party structures that once protected him, and now stood isolated after trying to humiliate President Emmerson Mnangagwa in the Politburo.\n\nHe dug his own grave, Mliswa declared. He spoke about corruption, but how clean is he? Ive challenged him to declare his assets. You cant accuse others without first proving your own hands are clean.\n\nNo One Will Go Against the Incumbent\n\nMliswa dismissed the notion that Chiwenga was owed political loyalty for his role in the 2017 transition, insisting that the Vice President was in China when the whole thing happened and has no political capital of his own.\n\nHe did not assist ED. He was not the architect of the Second Republic. The President was, Mliswa said.\n\nIf he had been patient, the incumbent would have extended political capital to him  but he didnt wait. Now he has none. No one will go against the incumbent.\n\nThe outspoken legislator described the Vice Presidents recent political manoeuvres as showmanship rather than genuine reform, accusing him of using the anti-corruption narrative to humiliate the President and the party.\n\nHe wanted to appear as Mr. Clean, the perfect man  yet hes not. Thats childish politics, Mliswa added.\n\nA General Who Failed His Troops\n\nIn a blistering critique of Chiwengas military record, Mliswa said the former army commander had failed to look after the welfare of soldiers who served under him.\n\nA true commander looks after his troops, he said.\n\nThe welfare of soldiers, police officers, and prison officers has been neglected. Those at the top live lavishly while the rank-and-file suffer. That failure lies squarely with the commanders.\n\nHe warned that neglecting security sector welfare could one day trigger dissent within the ranks:\n\nOne day, those neglected soldiers may unite and say, We dont want you  youve failed us. Thats the danger of leadership without empathy.\n\nMisled and Misguided\n\nMliswa accused presidential spokesperson George Charamba and other bureaucrats of misleading the Vice President into believing he had more power than he does.\n\nHes been misled and misinformed by certain bureaucrats  people like George Charamba, who constantly defend him, thinking theyre serving the system but are actually serving the Vice Presidents personal agenda, he said.\n\nHe further criticised the continued involvement of Chiwengas wife in government intelligence structures, saying it intimidates officials and creates conflict of interest.\n\nNo woman wants her husband not to be President. But once that ambition clouds national interest, it becomes dangerous, he warned.\n\nThe President Played the Long Game\n\nAccording to Mliswa, Mnangagwa demonstrated greater strategic depth by allowing Chiwenga to expose his own immaturity before the Politburo.\n\nThe President didnt stop him from speaking. He played the long game. At that age, his patience and composure are unmatched. He let the VP talk himself into a corner, Mliswa observed.\n\nHe Wanted Power for Himself\n\nIn closing, Mliswa said the Vice Presidents political end was now inevitable.\n\nHe wanted power for himself, not to serve the people, he said.\n\nLeadership is not about entitlement or military rank. Its about humility, accountability, and respect for the Constitution.\n\nHe urged Chiwenga to come clean on his assets, step back from confrontational politics, and respect the authority of the President.\n\nYou cannot humiliate and expose your own leader  your father figure  and expect loyalty from others, Mliswa concluded. He has dug his own grave.\n\nZimEye View:\n\nMliswas remarks crystallise a growing sentiment within ZANU PF that the Vice Presidents recent outbursts have backfired spectacularly. Once seen as the possible heir to Mnangagwa, Chiwenga now faces political isolation, party distrust, and an internal reckoning that could spell the end of his vice-presidential career.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "MLISWA: CHIWENGA HAS DUG HIS OWN GRAVE By Simba Chikanza | ZimEye Exclusive Interview. Vice President Constantino Chiwenga has “dug … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/mliswa-vp-chiwenga-abandoned-soldiers-and-today-hes-dug-his-own-grave-by-trying-to-embarrass-own-boss/\">Continue reading<span class=\"screen-reader-text\"> \"Mliswa: VP Chiwenga Abandoned Soldiers And Today He’s Dug His Own Grave By Trying To Embarrass Own Boss\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "No More Load Shedding In South Africa",
            "url": "https://www.zimeye.net/2025/10/20/no-more-load-shedding-in-south-africa/",
            "content": "South Africa  Electricity Minister Kgosientsho Ramokgopa has announced that the country will no longer experience load shedding.\n\nRamokgopa made the announcement during a media briefing in Pretoria on Sunday, 19 October 2025, unveiling the governments new Integrated Resource Plan (IRP), which he said is designed to end the long-standing power cuts permanently.\n\nHe emphasised that a stable and reliable electricity supply was essential to reviving South Africas economy, which has for years been crippled by frequent outages. The new plan, he added, replaces the 2019 version and aligns with the countrys current and future energy needs.\n\nAccording to Ramokgopa, the IRP could unlock R2.2 trillion in investments and contribute up to 30% to GDP growth.\n\nOur main goal is to get the economy growing and create jobs. We have set ourselves a target of growing the South African economy by over 3% by 2030. There is no economy that grows if the lights are offno industry will locate in South Africa if we cannot guarantee reliable, quality, and affordable electricity, said Ramokgopa.\n\nThe announcement marks a major milestone in South Africas decades-long battle with power shortages, signalling renewed hope for economic growth and energy stability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "South Africa— Electricity Minister Kgosientsho Ramokgopa has announced that the country will no longer experience load shedding. Ramokgopa made the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/no-more-load-shedding-in-south-africa/\">Continue reading<span class=\"screen-reader-text\"> \"No More Load Shedding In South Africa\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "Mnangagwa Bootlickers Dress Down VP Chiwenga",
            "url": "https://www.zimeye.net/2025/10/20/mnangagwa-bootlickers-dress-down-vp-chiwenga/",
            "content": "By A Correspondent-President Emmerson Mnangagwas loyalists in Mutare on Saturday erupted into song, applause, and thunderous chants of support for their leader, while booing and denouncing Vice President Constantino Chiwenga after his 2028 presidential ambitions were effectively crushed.\n\nThe incident occurred at the closing session of ZANU PFs National Conference, where Justice Minister and party Secretary for Legal Affairs, Ziyambi Ziyambione of Mnangagwas fiercest backersannounced a resolution to extend the Presidents term to 2030.\n\nZiyambi, who is reportedly part of a faction pushing for Chiwengas political isolation and possible arrest, read the resolution to roaring cheers from delegates, who broke into chants of 2030 ndeya Emmerson! (2030 belongs to Emmerson!).\n\nThe resolution reaffirmed a similar motion first passed at the 2024 Bulawayo conference and now directs the Justice Ministry, Parliament, and the partys key organs to begin legal processes for amending the Constitution to allow Mnangagwa two additional years in office.\n\nIt is resolved that his term of office as President of the Republic of Zimbabwe will be extended beyond 2028 to 2030, declared Ziyambi, as the hall exploded into song and ululation. The party and government are therefore directed to initiate the requisite legislative amendments to give full effect to this resolution before the 23rd National Peoples Conference, he added.\n\nDelegates from all ten provinces rose in unison, waving party flags as they sang praises of Mnangagwas visionary leadership. Ziyambi hailed the Presidents tangible development milestones, crediting him with driving Zimbabwe toward Vision 2030, the governments plan for an upper-middle-income economy.\n\nThe ZANU PF Youth League, led by Secretary Tino Machakaire, also backed the resolution, saying Mnangagwa should be allowed to finish the journey he started.\n\nIn order for our revered President to see through the successful implementation of Vision 2030, we reaffirm that His Excellency continues being in office until 2030, Machakaire declared to thunderous cheers.\n\nMnangagwas second and final term is constitutionally set to end in 2028, but his supporters have now turned a long-murmured desire for an extension into an official directive.\n\nThough the President has previously described himself as a constitutionalist who would not overstay his mandate, the latest developments suggest a well-coordinated campaign within the ruling party to entrench his rule.\n\nThe Mutare conference also signalled an escalation in the long-simmering power struggle between Mnangagwa and Chiwenga, a rivalry that dates back to the November 2017 coup that ousted Robert Mugabe.\n\nChiwenga, then Commander of the Zimbabwe Defence Forces, led the military intervention that paved the way for Mnangagwas rise to power, positioning himself as the kingmaker and presumptive successor.\n\nHowever, once in power, Mnangagwa quickly consolidated control, sidelining Chiwenga and purging military loyalists from key government and party posts.\n\nBy 2019, the once-tight alliance had visibly fractured. Mnangagwas camp began accusing Chiwenga of harbouring presidential ambitions, while the Vice President reportedly complained about corruption and political marginalisation.\n\nThe rivalry deepened as both men built parallel support structures within ZANU PF and the security establishment.\n\nMnangagwas reshuffles of the army, intelligence services, and provincial party leadership further weakened Chiwengas influence, prompting speculation of an internal cold war within the ruling elite.\n\nThe latest conference in Mutare appears to have decisively tilted the balance in Mnangagwas favour.\n\nThe open booing of Chiwenga by delegatesonce unthinkable given his military credentialsreflects how thoroughly he has been politically neutralised.\n\nHis allies in the party and armed forces have either been reassigned, retired, or co-opted into Mnangagwas patronage network.\n\nWhen asked byZiFM Stereo Newsin Mutare whether the President could face a challenge at the 2026 elective congress, party spokesperson Christopher Mutsvangwa insisted that ZANU PF remains a democratic organisation. If people want to contest for the presidency, they will be free to do so because its a democratic party, Mutsvangwa said. But it also means that if you lose, you must comply with the wishes of the majority.\n\nWith the Mutare gathering now on record directing the government to make the extension law, one message rang loud and clear through the applause and songs  Mnangagwas presidency is far from over, and the march to 2030 has officially begun.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa’s loyalists in Mutare on Saturday erupted into song, applause, and thunderous chants of support for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/mnangagwa-bootlickers-dress-down-vp-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Bootlickers Dress Down VP Chiwenga\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "Madzibaba Veshanduko Under Siege",
            "url": "https://www.zimeye.net/2025/10/20/madzibaba-veshanduko-under-siege/",
            "content": "By Crime and Courts Reporter  The Zimbabwe Republic Police (ZRP) has launched a manhunt for prominent opposition activist Godfrey Karembera, popularly known as Madzibaba Veshanduko, over allegations of distributing political flyers in Harares high-density suburbs.\n\nIn a statement released Sunday, the police announced they were seeking public assistance in locating Karembera and Kudzai Weston Saruwaka, both accused of violatingSection 187, as read withSection 36of theCriminal Law (Codification and Reform) Act, Chapter 9:23. According to police sources, the two allegedly fled during a high-speed chase after being spotted distributing political material in Machipisa, Glen View, and Budiriro.\n\nThe manhunt comes amid rising political tensions following last Fridays Cde Bombshellled national shutdown, which called for President Mnangagwas removal. The protests, dubbed#Geza, have gained traction on social media but have not received formal endorsement from opposition leaderNelson Chamisa,who has maintained a cautious distance.\n\nMadzibaba Veshanduko, a well-known street preacher and social media activist, rose to prominence in the years following the coup for his bold criticism of Mnangagwas leadership. Blending religious symbolism with political activism, he became a vocal figure in pro-democracy protests, calling for justice, accountability, and an end to corruption. He has been arrested and assaulted several times for leading demonstrations in Harare, often seen wearing his trademark white apostolic robe while chanting Shanduko! (Change!).\n\nHis activism has made him both a symbol of resistance and a thorn in the side of the ruling establishment. In 2022, Karembera was violently arrested and tortured by state security agents after holding a one-man protest in Harare demanding political reforms. Despite these experiences, he continued to mobilise young people online, urging them to resist captured institutions and fake liberation narratives.\n\nAnalysts say the current pursuit of Karembera marks a new phase in Mnangagwas strategy to neutralise popular opposition figures ahead of the 2028 elections. By targeting grassroots organisers like Madzibaba Veshanduko, authorities appear intent on dismantling informal activist networks that have previously driven\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter – The Zimbabwe Republic Police (ZRP) has launched a manhunt for prominent opposition activist Godfrey … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/madzibaba-veshanduko-under-siege/\">Continue reading<span class=\"screen-reader-text\"> \"Madzibaba Veshanduko Under Siege\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "Power Grab in Plain Sight: ZANU PF Defends Mnangagwa Term Of Office Extension to 2030",
            "url": "https://www.zimeye.net/2025/10/20/power-grab-in-plain-sight-zanu-pf-defends-mnangagwa-term-of-office-extension-to-2030/",
            "content": "By A Correspondent\n\nZANU PF has defended its controversial resolution to extend President Emmerson Mnangagwas term of office to 2030, with party officials claiming the move reflects the will of the people. Critics, however, see the decision as a blatant power grab that undermines Zimbabwes democratic framework.\n\nSpeaking on Saturday, ZANU PF Information Director Farai Marapira asserted, The people have spoken. The will of the people is clear and will be implemented.\n\nMarapira added that those opposing the resolution now have no choice but to fall in line, a statement analysts say reflects the partys increasingly authoritarian approach.\n\nObservers warn that the resolution effectively overrides the constitutional two-term limit for the presidency, originally set to end in 2028, raising serious questions about the legitimacy of the extension.\n\nPolitical analyst Tendai Chikomo said: This is a blatant attempt to manipulate constitutional provisions to cling to power. Claiming it as the will of the people is disingenuous and dismissive of genuine public opinion.\n\nCritics argue that the move signals a growing disregard for democratic norms and could further polarize the political landscape in Zimbabwe. By framing the extension as a mandate from citizens, ZANU PF risks masking what many see as an orchestrated consolidation of power.\n\nThe message is clear: the ruling party is putting its interests above the law and democratic principles, said Chikomo. Opposition voices are being silenced under the guise of popular will, and Zimbabweans are left with little recourse.\n\nWith the resolution now in place, Mnangagwas presidency could continue until 2030, sparking concern that the country may see further erosion of constitutional checks and balances, as well as increased political tension leading up to the next scheduled elections.\n\nFor many, the development underscores the growing tension between ZANU PFs leadership ambitions and the principles of constitutional governance, raising alarms about the future of democracy in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF has defended its controversial resolution to extend President Emmerson Mnangagwa’s term of office to 2030, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/power-grab-in-plain-sight-zanu-pf-defends-mnangagwa-term-of-office-extension-to-2030/\">Continue reading<span class=\"screen-reader-text\"> \"Power Grab in Plain Sight: ZANU PF Defends Mnangagwa Term Of Office Extension to 2030\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "Food Hampers For Delegates, Empty Plates For Citizens: Analysts Slam Auxillia Mnangagwa’s Publicity Stunt At ZANU PF Conference",
            "url": "https://www.zimeye.net/2025/10/20/food-hampers-for-delegates-empty-plates-for-citizens-analysts-slam-auxillia-mnangagwas-publicity-stunt-at-zanu-pf-conference/",
            "content": "By A Correspondent\n\nFirst Lady Dr Auxillia Mnangagwa came under fire after distributing food hampers to delegates at the ZANU PF 22nd National Peoples Conference in Mutare, with critics dismissing the act as a cynical publicity stunt rather than genuine compassion.\n\nThe event, held on Thursday on the sidelines of the party conference, saw roughly 3,000 delegates receive assorted food parcels  a gesture that analysts say was designed to curry favor with loyalists while ignoring the nations growing food insecurity and economic collapse.\n\nShe is trying to polish her image, said one political analyst. Handing out hampers to party delegates while millions of ordinary Zimbabweans go hungry is nothing but political theatre.\n\nSpeaking to the delegates, Mrs Mnangagwa attempted to frame herself as a moral guide: A person is defined by their character. To be human is to possess good character. Our nation is God-fearing, which shapes us into a disciplined people. We must always respect one another. Critics, however, scoffed at the remarks, calling them empty rhetoric meant to distract from real issues facing citizens.\n\nThe First Lady also used the platform to tout domestic tourism and environmental campaigns. Let us promote domestic tourism. Forbes has recognised Zimbabwe as a top tourist destination because of our safety and hospitality. Tourism is now a strong pillar supporting our economy, alongside agriculture and mining, she said. Observers dismissed this as tone-deaf, noting that most Zimbabweans are struggling just to meet basic needs.\n\nMnangagwa further presented herself as an expert farmer, urging delegates to plant drought-resistant crops. The rainy season is approaching. Those in dry areas should prioritise drought-resistant crops. Let us understand and utilise the strengths of our land, she said  a comment analysts say ignores the reality that most citizens lack access to land, seeds, or resources.\n\nShe also lectured on traditional values and national unity, sharing her Dare initiative and praise for chiefs. Critics argue this was little more than a performance aimed at appearing morally upright, while failing to address corruption, mismanagement, and widespread poverty.\n\nThis was a carefully staged display of generosity for political optics, said another observer. Delegates received hampers and smiles, but the vast majority of Zimbabweans remain hungry and ignored. The First Ladys so-called goodwill is nothing more than a sham.\n\nFor many, the event highlighted the growing disconnect between the ruling elite and ordinary citizens  a stark reminder that gestures like these are designed more to build image than to solve real problems.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent First Lady Dr Auxillia Mnangagwa came under fire after distributing food hampers to delegates at the ZANU … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/20/food-hampers-for-delegates-empty-plates-for-citizens-analysts-slam-auxillia-mnangagwas-publicity-stunt-at-zanu-pf-conference/\">Continue reading<span class=\"screen-reader-text\"> \"Food Hampers For Delegates, Empty Plates For Citizens: Analysts Slam Auxillia Mnangagwa’s Publicity Stunt At ZANU PF Conference\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "ZAOGA Leader (57) Caught Forcing Minor To Strip For Him",
            "url": "https://www.zimeye.net/2025/10/19/zaoga-leader-caught-forcing-minor-to-strip-for-him/",
            "content": "By ZimEye Investigations | The ZAOGA @FIFMI leader caught in the act forcing a minor to strip, has been identified.\n\nHe is the 57 year old, Godfrey Mutara, who is based in Leicester, UK.\n\nIn the up to 16 min-total audio recordings, he later pleads with the childs mother asking to meet her so to make up for the mess.\n\nThe ZAOGA@FIFMIleader caught in the act forcing a minor to strip, has been identified.He is the 57 year old, Godfrey Mutara, who is based in Leicester, UK.In the up to 16 min-total audio recordings, he later pleads with the childs mother asking to meet her so to make uppic.twitter.com/CBzj92dxmJ\n\nHe even titles her mum in law-ambuya.\n\nMutara runs a care company called Victory Care, and some his staff members tell ZimEye many have been subjected to the same alleged molestation, as the 16 year old heard in the audio.\n\nAnother victim is a 15 year old girl, whose family speak to ZimEye. She fought her way out of his car while he was driving, after he had started caressing her, a relative says.\n\nIn the audio, he arranges to meet his victim when she is due to up for church meetings at the weekend, where he leads as a pastoral authority.\n\nSoon after that, he orders her to open her phone camera and specifies that she must expose her body parts for his eyes. After she obeys, he voices back thanking her for doing this.\n\nMutara was reached for comment.\n\nHis practice is not new. His ZAOGA church leader Ezekiel Gutis brother, Nelson was convicted for raping two minor girls in 2004.\n\nHe was later smuggled out of Zimbabwe by Ezekiel Guti to Canada on a false identity and only returned to Zimbabwe after his sentence had been spent. Today, he continues to lead church as a senior Bishop in Zimbabwe where the Guti family enjoys political protection by the convicted Wicknell Chivayos benefactor President Emmerson Mnangagwa.\n\nZAOGA was reached to comment.\n\nThe church has not issued any safeguarding statements to report and protect minors over the last 21 years since the first conviction of a senior leader.\n\nZimEye follows up on the institution this week.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By ZimEye Investigations | The ZAOGA @FIFMI leader caught in the act forcing a minor to strip, has been identified. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/19/zaoga-leader-caught-forcing-minor-to-strip-for-him/\">Continue reading<span class=\"screen-reader-text\"> \"ZAOGA Leader (57) Caught Forcing Minor To Strip For Him\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        },
        {
            "title": "South Africa Ends Load Shedding",
            "url": "https://www.zimeye.net/2025/10/19/south-africa-ends-load-shedding/",
            "content": "By A Correspondent  In what marks a historic turning point for South Africas energy sector, Electricity Minister Kgosientsho Ramokgopa has announced that the country will no longer experience load shedding.\n\nRamokgopa made the announcement during a media briefing in Pretoria on Sunday, 19 October 2025, unveiling the governments new Integrated Resource Plan (IRP), which he said is designed to end the long-standing power cuts permanently.\n\nHe emphasised that a stable and reliable electricity supply was essential to reviving South Africas economy, which has for years been crippled by frequent outages. The new plan, he added, replaces the 2019 version and aligns with the countrys current and future energy needs.\n\nAccording to Ramokgopa, the IRP could unlock R2.2 trillion in investments and contribute up to 30% to GDP growth.\n\nOur main goal is to get the economy growing and create jobs. We have set ourselves a target of growing the South African economy by over 3% by 2030. There is no economy that grows if the lights are offno industry will locate in South Africa if we cannot guarantee reliable, quality, and affordable electricity, said Ramokgopa.\n\nThe announcement marks a major milestone in South Africas decades-long battle with power shortages, signalling renewed hope for economic growth and energy stability.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — In what marks a historic turning point for South Africa’s energy sector, Electricity Minister Kgosientsho Ramokgopa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/19/south-africa-ends-load-shedding/\">Continue reading<span class=\"screen-reader-text\"> \"South Africa Ends Load Shedding\"</span></a></p>",
            "time": "08:42",
            "date": "21 Oct 2025"
        }
    ]
}