{
    "news": [
        {
            "title": "Supreme Court Frees Top Harare Lawyer Admire Rubaya in Gold Theft Case",
            "url": "https://www.zimeye.net/2025/03/19/supreme-court-frees-top-harare-lawyer-admire-rubaya-in-gold-theft-case/",
            "content": "By A Correspondent | ZimEye| TOP Harare lawyer Admire Rubaya is now a free man after the Supreme Court cleared him from a criminal charge of gold theft, a case that also involved a Plumtree Magistrate, a prosecutor, and a police officer in charge.\n\nRubaya had represented one Jefat Chaganda before Plumtree regional magistrate Timeon Makunde, and Chaganda was acquitted of gold smuggling. Following this, the court ordered the return of the gold to Chaganda.\n\nThe State then charged everyone involved in the case, including Rubaya, the magistrate, and the prosecutor, with theft or alternatively, obstruction of justice.\n\nRubayas legal team, comprising Advocate Thabani Mpofu, Oliver Marwa, and Tymon Tabana excepted to the charges but did not find favourt with the High Court.\n\nThrough his lawyers Rubaya argued that this was an instance of victimizlsation within the legal profession, violating the attorney-client privilege.\n\nLegal professional privilege is an established principle of our law that goes to the root of a fair trial as entrenched by section 69 of the Constitution, said the lawyers.\n\nAfter the High Courts decision, Rubaya filed the present appeal whichnwas heard by Supreme Court bench, including Justices George Chiweshe, Chinembiri Bhunu, and Hlekani Mwayera, accepting their arguments and exonerating Rubaya of any wrongdoing.\n\nThe Supreme Court also acquitted Magistrate Makunde.\n\nIn their appeal before the Supreme Court, Rubayas lawyers pointed out that the High Court had conceded that the charge against Rubaya was defective but still allowed the case to move forward, which they deemed a misdirection.\n\nMpofu contended that the acquittal of Chaganda had no bearing on Rubayas actions and insisted that whether the magistrates decision was correct was not something to be attributed to his client, especially since the decision still stands.\n\nIn the instant case what is revealed is that appellant (Rubaya) represented an accused person who was acquitted, and that the court acquitting the appellants client also ordered the release of the gold.\n\nWhether or not it was competent for the Learned Magistrate to make such an order is irrelevant, as the conduct of the Magistrate is not imputable to the appellant and no basis has been alleged for taking that position, the lawyer argued.\n\nHe further accused the State of attempting to unfairly prosecute his client and co-accused, ignoring legal principles.\n\nMpofu descrined the state as clumsy for trying to reason backwards in order to conclude that an offence or offences were committed.\n\nIn other words, because the appellant made certain telephone calls or was seen with some of the accused persons after the acquittal of his client and after the Magistrate had ordered the release of gold then he must have connived to steal the gold or to defeat or obstruct the course of justice!\n\nWith the greatest respect, the essential facts constituting the offence must be present at the time that the offence is committed and cannot be inferred from conduct post the event giving rise to the charge, he said.\n\nMpofu added, If anything, what seems to be alleged is that merely because the person accused of smuggling gold was acquitted and the Magistrate ordered the release of the gold, then everyone who interacted with the trial proceedings must be found to be guilty of the offences charged.\n\nThe lawyers contended that the judge erred by not recognizing that no offense was disclosed by the charges.\n\nThe court a quo also erred in failing to decide the issue before it, namely, whether it was competent at law for the appellant to be required to account in criminal proceedings for a defense he had prosecuted on behalf of a client who still stood by the same defense and not renounced it.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye| TOP Harare lawyer Admire Rubaya is now a free man after the Supreme Court cleared … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/supreme-court-frees-top-harare-lawyer-admire-rubaya-in-gold-theft-case/\">Continue reading<span class=\"screen-reader-text\"> \"Supreme Court Frees Top Harare Lawyer Admire Rubaya in Gold Theft Case\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Bill Antonio Steals the Show with Game-Changing Assist",
            "url": "https://www.zimeye.net/2025/03/19/bill-antonio-steals-the-show-with-game-changing-assist/",
            "content": "Sports Correspondent\n\nKV Mechelen secured a thrilling 2-1 victory over Dender in the Jupiler Pro League, thanks in large part to the heroics of substitute Bill Antonio.\n\nThe dynamic player made an instant impact off the bench, providing a crucial assist just seconds into his appearance on the pitch.\n\nAntonios decisive contribution proved to be the turning point in the match, as KV Mechelen rallied to claim the win. Despite playing only 25 minutes, Antonios influence on the game was undeniable, showcasing his exceptional skill and ability to make a difference in high-pressure situations.\n\nThe victory marks a significant boost for KV Mechelen, and Antonios impressive performance will undoubtedly be a major talking point in the aftermath of the match.\n\nAs the season unfolds, fans will be eagerly anticipating Antonios next move, hoping to see more of the same magic that won the day against Dender.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent KV Mechelen secured a thrilling 2-1 victory over Dender in the Jupiler Pro League, thanks in large part … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/bill-antonio-steals-the-show-with-game-changing-assist/\">Continue reading<span class=\"screen-reader-text\"> \"Bill Antonio Steals the Show with Game-Changing Assist\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Knowledge Musona Speaks On World Cup Qualifiers",
            "url": "https://www.zimeye.net/2025/03/19/knowledge-musona-speaks-on-world-cup-qualifiers/",
            "content": "Sports Correspondent\n\nZimbabwes former captain Knowledge Musona has expressed his excitement to be back on the national team, stating I am happy to be back and everything is possible . This comes after Musona came out of retirement ahead of the World Cup qualifiers against Benin and Nigeria.\n\nMusonas return to the team has been welcomed by his teammates, including Khama Billiat, who believes Musonas experience will be a great motivation for the team . Billiat praised Musona, saying Having Knowledge, with his experience, is a great motivation We have worked with him in the past, and it feels great.\n\nThe Warriors will face Benin and Nigeria in their upcoming World Cup qualifiers, and Musonas experience will be crucial in these matches.\n\nWith his return, Zimbabwes chances of qualifying for the World Cup have received a significant boost.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Zimbabwe’s former captain Knowledge Musona has expressed his excitement to be back on the national team, stating “I … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/knowledge-musona-speaks-on-world-cup-qualifiers/\">Continue reading<span class=\"screen-reader-text\"> \"Knowledge Musona Speaks On World Cup Qualifiers\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Be Warned : Speeding Kills",
            "url": "https://www.zimeye.net/2025/03/19/be-warned-speeding-kills/",
            "content": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in an instant. Each time you choose to drive above the speed limit, you are not only endangering yourself but also putting others at risk. Speeding kills, disables, and causes heartache, leaving behind broken families and shattered lives. Its essential to understand the profound impact of your actions on the road and the ripple effect they can have on others.\n\nOne of the most tragic consequences of speeding is the loss of life. Car accidents are a leading cause of death worldwide, and speed is often a contributing factor. When drivers exceed the speed limit, they decrease their ability to react to sudden changes in road conditions, such as pedestrians crossing, animals running into the road, or other vehicles making unexpected movements. At higher speeds, the impact of a collision is much more severe, increasing the chances of fatalities or life-altering injuries.\n\nThe consequences extend far beyond the driver. A fatal or serious crash caused by speeding can leave children without parents, spouses without partners, and entire families grieving. Imagine the pain and suffering that your loved ones would endure if you were taken from them because of your reckless decision behind the wheel. Your family loves you and wants you to come home safely at the end of each day. They depend on you, and speeding compromises that promise.\n\nMoreover, speeding can lead to long-term disabilities for both drivers and other road users. Survivors of high-speed crashes often face permanent injuries, which can affect their ability to work, care for their families, or live independently. These injuries are not just physical; they can also have a psychological toll, leading to trauma, depression, and a diminished quality of life. The emotional and financial burden of recovery falls not only on the individual but also on their family and community.\n\nRespecting road laws and driving responsibly isnt just about following rules; its about ensuring the safety of everyone on the road. There are countless other drivers, pedestrians, cyclists, and motorcyclists sharing the same roads as you, and their lives are just as important. Your behavior behind the wheel affects them directly. Driving carefully and within speed limits is a basic way of showing respect for the lives and safety of others. By choosing to drive responsibly, youre helping to create a safer, more considerate driving environment for everyone.\n\nWe all have a responsibility to ensure that our actions on the road do not harm others. Every life is precious, and the impact of speeding is far-reaching. It can change your life forever and leave scars on those around you. So, before you accelerate, take a moment to think about the consequences. Your loved ones, the people around you, and even strangers on the road depend on you making the right choice. Drive safely, follow the speed limits, and remember that speeding kills. Its not just a statistic  its a reality we can all prevent.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Speeding is more than just a violation of traffic laws; it is a deadly risk that can change lives in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/be-warned-speeding-kills/\">Continue reading<span class=\"screen-reader-text\"> \"Be Warned : Speeding Kills\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Time For Action Is Now : Geza",
            "url": "https://www.zimeye.net/2025/03/19/time-for-action-is-now-geza/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza has issued a stark warning to President Emmerson Mnangagwa, urging him to leave the country before its too late.\n\nGeza, who made a public appearance in full military gear on Tuesday night, accused Mnangagwa of using his cronies to plunder the nations resources.\n\nGezas statement, delivered with intense conviction, was as follows:\n\nI am your comrade, Blessed Geza. I am alive, I am safe, and I am in good health. Mnangagwa knows where I am, but it is he who is afraid to approach me. I am among the people, protected by the people because I act on their behalf. My wife was harassed, but as the wife of a soldier, she can handle it.\n\nFellow Zimbabweans, despite the growing alarm among war veterans and others about the corruption plaguing our politics and economy, Mnangagwa and his cronies remain unapologetic. They continue to plunder the country while the majority of Zimbabweans suffer in poverty. Just last month, Comrade Jealousy Mawarire exposed the POSB scandal on television. Yet, last week, his girlfriend, Virginia Mabhiza, was also implicated in the same saga.\n\nWe are deeply concerned about the arrest of journalist Blessed Mhlanga, as it seems an attempt to silence voices calling for democracy. We demand his immediate and unconditional release. Arresting journalists is a violation of the values we fought for during the liberation struggle.\n\nGeza continued his call for accountability, specifically addressing the judiciary, urging them to resist being used as tools by Mnangagwas regime.\n\nHe stressed, Dont be manipulated. You are oppressing the people. We fought for free speech, free assembly, and free association. You have jailed people like Timbas, Chibaya, and Sikhala. Justice Malaba, put your house in order, because we will come after you.\n\nTurning to issues of corruption, Geza highlighted the dire situation within the military, particularly regarding the AgriFora company, which he claimed is responsible for providing substandard food to Zimbabwes soldiers.\n\nOur soldiers are starving. They are being fed with food meant for pets, while millions are being funneled away by corrupt individuals like Chief Secretary Rushwaya and Willard Manungo. Mnangagwas cronies, like Kudakwashe Tagwirei, are taking over companies like ZIMASCO and POSB. We wont stand by and let this happen.\n\nGeza did not hold back in his condemnation of Mnangagwas actions, adding, Mnangagwa is using people like Tagwirei, Wicknell Chivayo, Scott Sakupwanya, and Tungwarara to further his corrupt agenda. We also know that Mnangagwa has given Scott Sakupwanya a contract to export gold, charging other companies 7% of the proceedsdepriving the government of much-needed revenue. Is this what we fought for? This is absolute nonsense.\n\nGeza also criticized figures like George Guvamatanga, accusing them of being complicit in the regimes corrupt practices.\n\nHe added, Ive read articles where Patrick Chinamasa says Ive been fired from Zanu PF. Thats a lie. Zanu PF is a product of both ZIPRA and ZANLA forces, and its a party thats built on blood.\n\nInstead, I am the one who fired Mnangagwa and his cronies from Zanu PF. They cannot fire me from an organization I dont belong to.\n\nHe issued an ominous warning to the people of Zimbabwe, saying, If we dont take action now, future generations will never forgive us. Mnangagwas reign will leave Zimbabwe a shell of its former self.\n\nThe war veteran then shifted to discussing Zimbabwes military leadership, particularly Vice President Constantino Chiwenga, whom he praised as a living hero. Geza sharply criticized those attacking Chiwenga and his wife, Marry, and accused Mnangagwa of attempting to poison Chiwenga. Mnangagwa was behind attempts to kill Chiwenga.\n\nI have evidence from his own brother, Joseph Rera. Mnangagwa even told Rera that Chiwenga would return as a coffin.\n\nGeza also condemned individuals like Chris Mutsvangwa for their behavior and failure to defend Chiwengas honor. He noted, Chris, you were arrested in 1976 for being accused of being a Muzorewa sympathizer, but now youre attacking Chiwenga. This is a disgrace.\n\nIn his final remarks, Geza addressed the Zimbabwean public, saying, The time for action is now. We are planning a demonstration on March 31, and we call on all Zimbabweans to rise up. It is not just a demonstrationit is an uprising. We want Mnangagwa and his cronies out.\n\nWe will deal with the law enforcement agencies who try to stop us. Let everyone know that this is our right, as enshrined in the constitution.\n\nGeza concluded with a final plea: Mnangagwa must go. He must leave now before its too late. Zimbabwe is on the verge of a major change, and its coming soon.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza has issued a stark warning to President Emmerson Mnangagwa, urging him to leave … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/time-for-action-is-now-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Time For Action Is Now : Geza\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Zanu PF Hardliners Maintain Mnangagwa To Rule Beyond 2028",
            "url": "https://www.zimeye.net/2025/03/19/zanu-pf-hardliners-maintain-mnangagwa-to-rule-beyond-2028/",
            "content": "By A Correspondent\n\nTensions are escalating within the ruling Zanu PF party as hardliners assert that President Emmerson Mnangagwa will remain in power beyond 2028, despite growing opposition.\n\nThe latest developments come amid calls from war veteran Blessed Geza for protests against Mnangagwas alleged attempts to bypass constitutional provisions.\n\nGeza, who made a dramatic return to the public eye on Tuesday night dressed in full military gear, openly demanded the immediate resignation of President Mnangagwa.\n\nThe calls for Mnangagwa to step down have been met with resistance from party hardliners, who argue that the President is crucial to the countrys stability.\n\nHowever, Zanu PFs legal supremo, Patrick Chinamasa, is among those defending Mnangagwas extended tenure.\n\nChinamasa emphasized that the party will do everything in its power to ensure Mnangagwa remains in office for as long as possible.\n\nWe will do all in our power to coax Mnangagwa to bow to the peoples demands, a party source party said on Tuesday.\n\nDespite the growing opposition, party officials have indicated that the movement to keep Mnangagwa in power is gaining momentum, especially among hardline factions within Zanu PF. These factions are reportedly using all available political and legal means to extend Mnangagwas rule, well beyond the current constitutional limits set for 2028.\n\nAs protests and internal party friction continue to escalate, the country is now at a crossroads, with calls for constitutional adherence being pitted against the ambitions of those seeking to secure Mnangagwas rule for another decade.\n\nThe political landscape remains tense, and it is unclear how these developments will play out in the coming months.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Tensions are escalating within the ruling Zanu PF party as hardliners assert that President Emmerson Mnangagwa will … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/zanu-pf-hardliners-maintain-mnangagwa-to-rule-beyond-2028/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Hardliners Maintain Mnangagwa To Rule Beyond 2028\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Editor Threatened Over Residents’ Leaders Story",
            "url": "https://www.zimeye.net/2025/03/19/editor-threatened-over-residents-leaders-story/",
            "content": "By A Correspondent\n\nMasvingo-Centre News Editor, Godfrey Mtimba, has been receiving threats from anonymous callers accusing his paper of reporting on a story involving local residents leaders. The leaders had taken legal action against illegal gold panners mining near Masvingo citys water tanks, seeking an interdict to halt their activities.\n\nThe anonymous callers allegedly warned Mtimba to stop reporting on the issue, claiming it could endanger his life, as well as the safety of his reporters and family.\n\nYes, I have been receiving calls from hidden numbers warning me to stop reporting on the water tank issue, or something very bad will happen, Mtimba said. He added that his safety and security were now at risk, and he suspected that unidentified individuals might be following him.\n\nThe report highlighted concerns over potential human rights violations, particularly the right to life. It revealed that the miners are using dangerous chemicals such as cyanide, which could contaminate the water tanks and endanger human life.\n\nThe tanks supply water to about 100,000 residents in Masvingo city. There are also fears that the tanks could collapse and cause floods due to cracks that have developed from the miners use of explosives. The miners, who are allegedly backed by local and national political figures from the ruling government, are also accused of degrading the environment by leaving open pits and destroying vegetation.\n\nThe Masvingo Media Centre (MMC), a media rights advocacy group, has expressed concern over the threats, condemning the violations of press freedom and media rights.\n\nWe are appalled by the continued threats against the editor of The Centre News. This is a direct attack on the free press and a violation of press freedom and media rights. We strongly condemn these cowardly acts and call for a thorough investigation, MMC said in a statement.\n\nCentre News has since engaged its legal team to file a formal police report, seeking an investigation into the callers. The same individuals have also been threatening the Masvingo United Residents and Rate Payers Alliance over the issue, after the residents group took the matter to the High Court.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Masvingo-Centre News Editor, Godfrey Mtimba, has been receiving threats from anonymous callers accusing his paper of reporting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/editor-threatened-over-residents-leaders-story/\">Continue reading<span class=\"screen-reader-text\"> \"Editor Threatened Over Residents’ Leaders Story\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Revealed: How ZRP Cop Shot Detective Cassandra Hove",
            "url": "https://www.zimeye.net/2025/03/19/revealed-how-zrp-cop-shot-detective-cassandra-hove/",
            "content": "By A Correspondent\n\nZRP Constable Nomore Muradzikwa, 37, appeared before Bulawayo Magistrate Maxwell Ncube on Tuesday, facing a murder charge for fatally shooting Detective Constable Cassandra Hove during a police operation in Bulawayos Pumula Suburb.\n\nMuradzikwa was part of a team pursuing armed robbery suspects on March 6, 2025.\n\nArmed with a CZ pistol, he fired a shot at Fikile Ncube, 26, a robbery suspect, hitting him on the left elbow.\n\nTragically, the bullet ricocheted and struck Hove in the chest, killing her.\n\nInitially, police reported that Hove was shot by armed robbers. However, in a shocking twist, Muradzikwa confessed to firing the fatal shot .\n\nThe reasons behind Muradzikwas involvement with the CID homicide team, particularly with the elite all-female Team Lozikeyi, remain unclear.\n\nMuradzikwa was represented by Tinashe Tashaya of Sengweni Legal Services and was remanded in custody until April 1.\n\nHe was advised to apply for bail at the High Court .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZRP Constable Nomore Muradzikwa, 37, appeared before Bulawayo Magistrate Maxwell Ncube on Tuesday, facing a murder charge … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/revealed-how-zrp-cop-shot-detective-cassandra-hove/\">Continue reading<span class=\"screen-reader-text\"> \"Revealed: How ZRP Cop Shot Detective Cassandra Hove\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Leave Country Before It’s Too Late: Geza Warns Mnangagwa",
            "url": "https://www.zimeye.net/2025/03/19/leave-country-before-its-too-late-geza-warns-mnangagwa/",
            "content": "By A Correspondent\n\nWar veteran Blessed Geza has issued a stark warning to President Emmerson Mnangagwa, urging him to leave the country before its too late.\n\nGeza, who made a public appearance in full military gear on Tuesday night, accused Mnangagwa of using his cronies to plunder the nations resources.\n\nGezas statement, delivered with intense conviction, was as follows:\n\nI am your comrade, Blessed Geza. I am alive, I am safe, and I am in good health. Mnangagwa knows where I am, but it is he who is afraid to approach me. I am among the people, protected by the people because I act on their behalf. My wife was harassed, but as the wife of a soldier, she can handle it.\n\nFellow Zimbabweans, despite the growing alarm among war veterans and others about the corruption plaguing our politics and economy, Mnangagwa and his cronies remain unapologetic. They continue to plunder the country while the majority of Zimbabweans suffer in poverty. Just last month, Comrade Jealousy Mawarire exposed the POSB scandal on television. Yet, last week, his girlfriend, Virginia Mabhiza, was also implicated in the same saga.\n\nWe are deeply concerned about the arrest of journalist Blessed Mhlanga, as it seems an attempt to silence voices calling for democracy. We demand his immediate and unconditional release. Arresting journalists is a violation of the values we fought for during the liberation struggle.\n\nGeza continued his call for accountability, specifically addressing the judiciary, urging them to resist being used as tools by Mnangagwas regime.\n\nHe stressed, Dont be manipulated. You are oppressing the people. We fought for free speech, free assembly, and free association. You have jailed people like Timbas, Chibaya, and Sikhala. Justice Malaba, put your house in order, because we will come after you.\n\nTurning to issues of corruption, Geza highlighted the dire situation within the military, particularly regarding the AgriFora company, which he claimed is responsible for providing substandard food to Zimbabwes soldiers.\n\nOur soldiers are starving. They are being fed with food meant for pets, while millions are being funneled away by corrupt individuals like Chief Secretary Rushwaya and Willard Manungo. Mnangagwas cronies, like Kudakwashe Tagwirei, are taking over companies like ZIMASCO and POSB. We wont stand by and let this happen.\n\nGeza did not hold back in his condemnation of Mnangagwas actions, adding, Mnangagwa is using people like Tagwirei, Wicknell Chivayo, Scott Sakupwanya, and Tungwarara to further his corrupt agenda. We also know that Mnangagwa has given Scott Sakupwanya a contract to export gold, charging other companies 7% of the proceedsdepriving the government of much-needed revenue. Is this what we fought for? This is absolute nonsense.\n\nGeza also criticized figures like George Guvamatanga, accusing them of being complicit in the regimes corrupt practices.\n\nHe added, Ive read articles where Patrick Chinamasa says Ive been fired from Zanu PF. Thats a lie. Zanu PF is a product of both ZIPRA and ZANLA forces, and its a party thats built on blood.\n\nInstead, I am the one who fired Mnangagwa and his cronies from Zanu PF. They cannot fire me from an organization I dont belong to.\n\nHe issued an ominous warning to the people of Zimbabwe, saying, If we dont take action now, future generations will never forgive us. Mnangagwas reign will leave Zimbabwe a shell of its former self.\n\nThe war veteran then shifted to discussing Zimbabwes military leadership, particularly Vice President Constantino Chiwenga, whom he praised as a living hero. Geza sharply criticized those attacking Chiwenga and his wife, Marry, and accused Mnangagwa of attempting to poison Chiwenga. Mnangagwa was behind attempts to kill Chiwenga.\n\nI have evidence from his own brother, Joseph Rera. Mnangagwa even told Rera that Chiwenga would return as a coffin.\n\nGeza also condemned individuals like Chris Mutsvangwa for their behavior and failure to defend Chiwengas honor. He noted, Chris, you were arrested in 1976 for being accused of being a Muzorewa sympathizer, but now youre attacking Chiwenga. This is a disgrace.\n\nIn his final remarks, Geza addressed the Zimbabwean public, saying, The time for action is now. We are planning a demonstration on March 31, and we call on all Zimbabweans to rise up. It is not just a demonstrationit is an uprising. We want Mnangagwa and his cronies out.\n\nWe will deal with the law enforcement agencies who try to stop us. Let everyone know that this is our right, as enshrined in the constitution.\n\nGeza concluded with a final plea: Mnangagwa must go. He must leave now before its too late. Zimbabwe is on the verge of a major change, and its coming soon.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent War veteran Blessed Geza has issued a stark warning to President Emmerson Mnangagwa, urging him to leave … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/leave-country-before-its-too-late-geza-warns-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"Leave Country Before It’s Too Late: Geza Warns Mnangagwa\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        },
        {
            "title": "Women’s Rights Group Condemns Harassment of Women During Vendor Crackdown",
            "url": "https://www.zimeye.net/2025/03/19/womens-rights-group-condemns-harassment-of-women-during-vendor-crackdown/",
            "content": "By A Correspondent\n\nThe Masvingo Women Rights Advocacy Group (MWRAG) has strongly condemned the intimidation, harassment, and sexual abuse of women by Masvingo City Municipal Police Officers and the Zimbabwe Republic Police (ZRP) during the recent crackdown on vendors in Masvingo City. The wave of rights violations against women vendors has surged following a 48-hour ultimatum issued last week by Local Government and Public Works Minister Daniel Garwe, ordering all local councils to clear vendors from the streets across Zimbabwe.\n\nSince last Wednesday, MWRAG has recorded 16 cases of intimidation, harassment, and sexual assault against women vendors at various locations, including Croco Motors, N-Richards Hurudza, Downtown, Mucheke Rank, Sisks Chesvingo Drive, and other busy pick-up points. These incidents have been perpetrated by Municipal Police and law enforcement agents working together to remove vendors from the streets. Many women vendors have reported that their wares were taken violently and without warning.\n\nWomen, who are more vulnerable to violence in such situations, have borne the brunt of the crackdown. In contrast, male vendors often manage to resist arrest or flee with their goods, while women are more likely to be targeted.\n\nMWRAG has called on the Masvingo City Council and law enforcement authorities to uphold the rights of vendors, particularly women, during this and future operations. The group also urged the council and government to prioritize women when allocating market stalls, ensuring that they are not forced to trade in undesignated and unsafe areas that expose them to further risks of intimidation, harassment, and violence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Masvingo Women Rights Advocacy Group (MWRAG) has strongly condemned the intimidation, harassment, and sexual abuse of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/19/womens-rights-group-condemns-harassment-of-women-during-vendor-crackdown/\">Continue reading<span class=\"screen-reader-text\"> \"Women’s Rights Group Condemns Harassment of Women During Vendor Crackdown\"</span></a></p>",
            "time": "08:42",
            "date": "20 Mar 2025"
        }
    ]
}