{
    "news": [
        {
            "title": "VP Chiwenga Loses Power Battle",
            "url": "https://www.zimeye.net/2025/10/11/vp-chiwenga-loses-power-battle/",
            "content": "By A Correspondent-Vice President Constantino Chiwengas hopes of succeeding President Emmerson Mnangagwa have suffered a major blow after ZANU PF announced plans to use its forthcoming annual conference to endorse Mnangagwas continued rule until 2030  effectively sidelining his deputy and cementing the presidents dominance over the ruling party.\n\nThe endorsement, to be formalized at the Mutare conference next week, marks a turning point in ZANU PFs succession politics and reinforces Mnangagwas control following months of factional tensions. It also follows last years controversial resolution to extend his leadership beyond the traditional two-term framework  a move that widened divisions between Mnangagwa loyalists and the camp aligned to Chiwenga.\n\nParty sources say infighting has intensified in recent months, spilling into heated Politburo meetings. In one such meeting last month, Chiwenga reportedly presented a dossier accusing some of Mnangagwas inner circle of grand corruption  an act interpreted by many as an open challenge to the presidents authority.\n\nBut in what analysts view as a strategic counterattack, ZANU PF spokesperson Christopher Mutsvangwa publicly reaffirmed the partys unwavering support for Mnangagwa, dismissing talk of factionalism and hinting that those harbouring presidential ambitions would be crushed by the collective will of the party.\n\nThe organs, the provinces and the party membership are quite happy with His Excellencys stewardship of the party and membership, Mutsvangwa toldThe Zimbabwe Independent.\n\nTheir dictum is: If it aint broke, why try to fix it? The delegates have expressly and vehemently resolved to continue with His Excellency till 2030. They have drowned out other noises of unbridled, undeserving and self-centred ambition.\n\nMutsvangwa said the Mutare conference would demonstrate party unity and silence critics, a statement interpreted as an indirect rebuke to Chiwengas faction.\n\nThe cacophony of social media trolling has no resonance in the closed membership of the organs, provinces and structures of ZANU PF, he added, describing dissenters as detractors, regime change practitioners and agents of political destabilisation.\n\nThe conference, to be held from next Friday to October 18 at the Mutare Polytechnic Pavilion Grounds, will bring together around 4,000 delegates under the themeAttainment of Vision 2030 Through Economic Empowerment and Value Addition.\n\nZANU PFs Director of Information and Publicity, Farai Marapira, also dismissed speculation about succession, emphasizing that the matter was not part of the conference agenda.\n\nSuccession is dealt with at congress, and we are not going to congress  we are going to a conference, Marapira said.\n\nThe issue of succession is not a concern within ZANU PF. We are simply going to check up on the mandate we received from the people in 2023.\n\nWhile Mnangagwas allies frame the 2030 agenda as a continuation of hisVision 2030economic blueprint, critics argue it is a calculated political manoeuvre to neutralize Chiwenga and tighten the presidents grip on power ahead of the 2027 elective congress.\n\nWith the Mutare conference expected to rubber-stamp the extension, Mnangagwa appears to have decisively outmanoeuvred his deputy  consolidating his hold on both the party and the state, and confirming that Chiwengas long-anticipated power bid has suffered a significant defeat.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-Vice President Constantino Chiwenga’s hopes of succeeding President Emmerson Mnangagwa have suffered a major blow after ZANU PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/vp-chiwenga-loses-power-battle/\">Continue reading<span class=\"screen-reader-text\"> \"VP Chiwenga Loses Power Battle\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "Warrant Of Arrest For Douglas Togarasei Mwonzora",
            "url": "https://www.zimeye.net/2025/10/11/warrant-of-arrest-for-douglas-togarasei-mwonzora/",
            "content": "By A Correspondent\n\nMDC T president Douglas Mwonzora has reportedly been issued with a warrant of arrest after allegedly defaulting on his child maintenance payments for five months, resulting in arrears of US$2,500, according toMasvingo Mirror.\n\nSpeaking toMasvingo Mirror, Mwonzora said he was unaware of the warrant \n\nI havent received the warrant of arrest you are talking about. I dont deserve any warrant. This is a sniff campaign, he said.\n\nThe courts had ordered Mwonzora in February 2024 to pay US$500 monthly maintenance for his 10-year-old son with Getrude Chuma, in addition to covering school fees. The current warrant reportedly covers unpaid maintenance from March to July this year.\n\nThe total arrears have reportedly risen to US$3,500, as Mwonzora has also not paid for August and September.\n\nChuma expressed frustration with the police at Harare Central, saying they had failed to serve the warrant on Mwonzora for the third time.\n\nAccording to ZRP sources, the matter is registered under case number M389. Police sources added that the MDC T leader would soon be summoned in connection with the case.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent MDC T president Douglas Mwonzora has reportedly been issued with a warrant of arrest after allegedly defaulting … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/warrant-of-arrest-for-douglas-togarasei-mwonzora/\">Continue reading<span class=\"screen-reader-text\"> \"Warrant Of Arrest For Douglas Togarasei Mwonzora\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "Mutsvangwa Escalates Fight With Chiwenga",
            "url": "https://www.zimeye.net/2025/10/11/mutsvangwa-escalates-fight-with-chiwenga/",
            "content": "By A Correspondent-ZANU PF spokesperson Christopher Mutsvangwa has stoked tensions within the ruling party after openly taking aim at what he described as self-centred ambition  remarks widely seen as a veiled attack on Vice President Constantino Chiwenga, amid intensifying factional battles over President Emmerson Mnangagwas bid to extend his rule to 2030.\n\nThe party is set to use its forthcoming annual conference in Mutare next week to officially endorse Mnangagwas continued leadership, effectively shutting out Chiwengas succession ambitions and consolidating the presidents control over both the party and the state.\n\nThe endorsement marks a pivotal moment in ZANU PFs internal politics and follows last years controversial resolution to extend Mnangagwas rule beyond the constitutionally implied two-term limit  a decision that has deepened divisions between the two power centres in the party.\n\nParty insiders say factional hostilities have reached new levels, with tempers flaring during recent Politburo meetings. In one meeting last month, Chiwenga reportedly presented a dossier accusing Mnangagwas close allies of grand corruption  a move that further exposed the widening rift between the former coup allies.\n\nBut in a pointed response, Mutsvangwa  a staunch Mnangagwa loyalist  dismissed suggestions of disunity, insisting that ZANU PF structures were united behind the president.\n\nThe organs, the provinces and the party membership are quite happy with His Excellencys stewardship of the party and membership, Mutsvangwa toldThe Zimbabwe Independent.\n\nTheir dictum is: If it aint broke, why try to fix it? The delegates have expressly and vehemently resolved to continue with His Excellency till 2030. They have drowned out other noises of unbridled, undeserving and self-centred ambition.\n\nObservers say Mutsvangwas comments were a thinly veiled jab at Chiwengas camp, which has been quietly mobilizing support ahead of the 2027 elective congress.\n\nMutsvangwa said next weeks Mutare conference would demonstrate ZANU PFs unity and silence what he called factional noise amplified by social media and opposition voices.\n\nThe cacophony of social media trolling has no resonance in the closed membership of the organs, provinces and structures of ZANU PF, he added, describing critics as detractors, regime change practitioners and agents of political destabilisation.\n\nThe conference, running from next Friday to October 18 at Mutare Polytechnic Pavilion Grounds, will bring together about 4,000 delegates under the themeAttainment of Vision 2030 Through Economic Empowerment and Value Addition.\n\nZANU PF Director of Information Farai Marapira also downplayed speculation over succession, emphasizing that the issue was not on the agenda.\n\nSuccession is dealt with at congress, and we are not going to congress  we are going to a conference, Marapira said.\n\nThe issue of succession is not a concern within ZANU PF. We are simply going to check up on the mandate we received from the people in 2023.\n\nWhile Mnangagwas allies portray the 2030 agenda as part of the presidents Vision 2030 economic strategy, critics view it as a political manoeuvre to sideline Chiwenga and entrench Mnangagwas long-term dominance.\n\nAs the Mutare conference approaches, Mutsvangwas combative tone has reignited speculation of a widening rift at the top  signalling that the Mnangagwa-Chiwenga power struggle is far from over, even as ZANU PF moves to publicly project unity behind its leaders 2030 ambition.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-ZANU PF spokesperson Christopher Mutsvangwa has stoked tensions within the ruling party after openly taking aim at what … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/mutsvangwa-escalates-fight-with-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Mutsvangwa Escalates Fight With Chiwenga\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "ED Wins 2030 Agenda",
            "url": "https://www.zimeye.net/2025/10/11/ed-wins-2030-agenda/",
            "content": "By A Correspondent-ZANU PF has effectively sealed President Emmerson Mnangagwas continued rule after the party announced plans to use its forthcoming annual conference to endorse his extension of office to 2030  a move that sidelines Vice President Constantino Chiwenga and consolidates Mnangagwas grip on power.\n\nThe endorsement, to be formalized at the partys conference scheduled for next week in Mutare, marks a decisive moment in Zanu PFs internal power dynamics. It follows last years controversial resolution to extend Mnangagwas rule beyond the constitutionally implied two-term limit  a decision that has deepened divisions within the ruling party and sparked growing resentment among factions aligned to Chiwenga.\n\nParty insiders say factional battles have intensified in recent months, with tensions spilling into heated Politburo meetings. During one such meeting last month, Chiwenga reportedly presented a dossier implicating some of Mnangagwas allies in grand corruption, further straining relations between the two leaders.\n\nHowever, Zanu PF spokesperson Christopher Mutsvangwa dismissed talk of disunity, insisting the party remains solidly behind Mnangagwa.\n\nThe organs, the provinces and the party membership are quite happy with His Excellencys stewardship of the party and membership, Mutsvangwa toldThe Zimbabwe Independent.\n\nTheir dictum is: If it aint broke, why try to fix it? The delegates have expressly and vehemently resolved to continue with His Excellency till 2030. They have drowned out other noises of unbridled, undeserving and self-centred ambition.\n\nMutsvangwa said the Mutare conference would serve as a show of unity, silencing critics and reaffirming Mnangagwas dominance ahead of the 2027 elective congress.\n\nThe cacophony of social media trolling has no resonance in the closed membership of the organs, provinces and structures of Zanu PF, he added, dismissing dissenting voices as the work of detractors, regime change practitioners and agents of political destabilisation.\n\nThe conference, to be held from next Friday to October 18 at Mutare Polytechnic Pavilion Grounds, will draw about 4,000 delegates, down from nearly 7,000 in previous years. It will run under the themeAttainment of Vision 2030 Through Economic Empowerment and Value Addition.\n\nZanu PF Director of Information and Publicity, Farai Marapira, also sought to quash speculation over succession debates, stressing that the issue was not on the agenda.\n\nSuccession is dealt with at congress, and we are not going to congress  we are going to a conference, Marapira said.\n\nThe issue of succession is not a concern within Zanu PF. We will not allow a conversation to be imported into the party. We are simply going to check up on the mandate we received from the people in 2023.\n\nWhile Mnangagwas allies tout the 2030 agenda as a continuity plan for Vision 2030  the presidents economic blueprint  critics view it as a calculated political manoeuvre to neutralize rivals and entrench his rule.\n\nWith the conference expected to rubber-stamp the extension, Mnangagwa appears to have won the latest round in Zanu PFs long-running succession battle  tightening his hold over the party and the state as the road to 2030 becomes clearer.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-ZANU PF has effectively sealed President Emmerson Mnangagwa’s continued rule after the party announced plans to use its … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/ed-wins-2030-agenda/\">Continue reading<span class=\"screen-reader-text\"> \"ED Wins 2030 Agenda\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "ZRP Warns Public Against Mushrooming Online Scams …",
            "url": "https://www.zimeye.net/2025/10/11/zrp-warns-public-against-mushrooming-online-scams/",
            "content": "By A Correspondent\n\nHARARE  The Zimbabwe Republic Police (ZRP) has issued a stern warning to members of the public to be cautious when engaging in online transactions, particularly those involving the purchase of goods and services such as tractors from neighbouring countries.\n\nIn a statement released this week, the police said they are aware of criminal syndicates using the names of prominent individuals and government officials to deceive unsuspecting citizens into making fake transactions, often involving large sums of money in South African Rands.\n\nThe ZRP warns the public against responding to online scams or purported transactions to acquire goods and services, which include tractors from neighbouring countries, the statement reads.\n\nThe police further advised the public to exercise due diligence and verify all business transactions with the Reserve Bank of Zimbabwe (RBZ), the Police, and other relevant authorities before making any financial commitments.\n\nThe public should verify with RBZ, Police and relevant authorities before engaging in purported online business transactions, ZRP emphasized.\n\nAuthorities say they are intensifying investigations to identify and bring to justice the perpetrators behind these fraudulent schemes. Citizens have been urged to report any suspicious online dealings to the nearest police station.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent HARARE — The Zimbabwe Republic Police (ZRP) has issued a stern warning to members of the public … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/zrp-warns-public-against-mushrooming-online-scams/\">Continue reading<span class=\"screen-reader-text\"> \"ZRP Warns Public Against Mushrooming Online Scams …\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "Mnangagwa Celebrates COMESA Post While Zimbabweans Endure Economic Misery",
            "url": "https://www.zimeye.net/2025/10/11/mnangagwa-celebrates-comesa-post-while-zimbabweans-endure-economic-misery/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwas election as the incoming Chairperson of the Common Market for Eastern and Southern Africa (COMESA) has sparked widespread criticism, with many Zimbabweans questioning the relevance of his new regional title while citizens continue to suffer under worsening economic conditions.\n\nAlthough state media hailed the appointment as a diplomatic achievement, critics argue that it does little to address the harsh realities facing ordinary people  including rampant inflation, crippling unemployment, and the steady decline in basic public services.\n\nThe COMESA Summit, held in Nairobi, Kenya, on Wednesday,focused on removing trade barriers and improving regional cooperation.\n\nHowever, analysts say Zimbabwes government has repeatedly failed to manage its own economy, making Mnangagwas leadership in a regional trade bloc appear hollow and symbolic.\n\nThe President is busy celebrating international recognition while people at home cant afford bread or transport, said one economist. Its a case of misplaced priorities.\n\nMnangagwa was received with pomp and ceremony at Robert Gabriel Mugabe International Airport by his deputies, senior government officials, and security chiefs  a display critics described as extravagant and out of touch with the hardships faced by the majority of citizens.\n\nDespite the grand welcome, the mood on the ground remains grim, as many Zimbabweans struggle to see how Mnangagwas new COMESA role will bring any meaningful change to their lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa’s election as the incoming Chairperson of the Common Market for Eastern and Southern Africa … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/mnangagwa-celebrates-comesa-post-while-zimbabweans-endure-economic-misery/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Celebrates COMESA Post While Zimbabweans Endure Economic Misery\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "Hwange “Fake Change” Trickster Jailed After Daring US$100 Scam Run",
            "url": "https://www.zimeye.net/2025/10/11/hwange-fake-change-trickster-jailed-after-daring-us100-scam-run/",
            "content": "A smooth-talking Hwange man who made a living out of chasing imaginary US$100 notes has been thrown behind bars after a string of audacious frauds that left Victoria Falls residents counting their losses.\n\nJames Phiri (40) of P3 Lwendulu Village was sentenced to 35 months in prison by Victoria Falls magistrate Linda Dzvene after being convicted on four counts of fraud. The court heard that Phiri had perfected a fast-talking hustle  walking into shops, pretending to have a US$100 note in the car, pocketing change, and vanishing before anyone caught on.\n\nBut his run came to a dramatic end when furious residents cornered him during his fourth attempt at Mkhosana Shopping Centre, finally exposing the conmans act.\n\nAccording to prosecutor Daphine Ntini, Phiri preyed mostly on female shopkeepers and vendors between September and October 2025, recycling the same charming but deceptive routine.\n\nIn one incident, he walked into Calvary Collection, picked scissors worth US$20, and claimed his US$100 note was with a taxi driver outside. The shopkeeper handed him US$80 change  and he disappeared, Ntini told the court.\n\nThe next day, Phiri struck again  this time at Victoria Falls Pharmacy, convincing a worker to hand him US$80 change for supposed court fees, pointing to a nearby parked car as proof of his story.\n\nAt Comesa Market, he duped a shoe vendor out of US$75, before pulling the same trick at Soppers Shop, buying a US$5 item and pocketing US$95 in change  a vanishing act that had become his signature.\n\nBy the time the con unraveled, Phiri had swindled a total of US$330, none of which was recovered.\n\nIn delivering sentence, Magistrate Dzvene branded Phiri a serial trickster whose antics had eroded public trust and targeted innocent livelihoods.\n\nSuch behaviour must be punished to protect honest citizens, she ruled, sending him straight to jail for nearly three years, with five months suspended for good behaviour.\n\nPhiris saga has since become a cautionary tale in Victoria Falls  a smooth talkers hustle that finally met its match in the hands of angry locals and a no-nonsense magistrate.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A smooth-talking Hwange man who made a living out of chasing imaginary US$100 notes has been thrown behind bars after … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/11/hwange-fake-change-trickster-jailed-after-daring-us100-scam-run/\">Continue reading<span class=\"screen-reader-text\"> \"Hwange “Fake Change” Trickster Jailed After Daring US$100 Scam Run\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "Five MPs in Horror Crash",
            "url": "https://www.zimeye.net/2025/10/10/five-mps-in-horror-crash/",
            "content": "By A Correspondent  Tragedy struck Zimbabwes Parliament on Friday morning afterfive legislators from Matabeleland provinceswere involved in ahorror road crashalong the BulawayoGweru Highway, killing one MP on the spot and leaving four others injured.\n\nThe deceased has been identified asNkulumane legislator, Honourable Desire Moyo, who reportedlydied instantly after his vehicle collided with an elephantin the early hours of Friday.\n\nAccording to preliminary reports, the lawmakers were travelling together when the accident occurred near Shangani. The impact left the vehicle extensively damaged.\n\nThe injured legislators have been named asMatobo MP Honourable Madalaboy Ndebele,Bulawayo Senator Rittah Ndlovu,Tsholotsho North MP Honourable Libion Sibanda, andMatabeleland North Proportional Representative MP Honourable Sethulo Ncube. They were all rushed to a local hospital for treatment.\n\nNkayi South legislator Honourable Jabulani Hadebeconfirmed the tragic incident toZBC News, describing it as a dark day for Parliament and the Matabeleland region.\n\nWe are devastated. Honourable Moyo was a dedicated public servant, and his passing is a huge loss to Parliament and to the people of Nkulumane, Hadebe said.\n\nPolice are yet to release an official statement, but sources say investigations are underway.\n\nThe accident has reignited concerns overroad safety on the BulawayoGweru Highway, which has recorded several fatal crashes in recent years, as well as thegrowing danger posed by stray wildlifealong major highways in the Matabeleland region.\n\nMoyos death adds to the growing list of MPs who have perished in road accidents in recent years, highlighting the need for improved road infrastructure and animal control measures in wildlife-prone areas.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent — Tragedy struck Zimbabwe’s Parliament on Friday morning after five legislators from Matabeleland provinces were involved in a horror road … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/five-mps-in-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Five MPs in Horror Crash\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "PUP’s Chamuka Worried Madagascar Unrest Could Stall Zimbabwe Reform Agenda at SADC",
            "url": "https://www.zimeye.net/2025/10/10/pups-chamuka-worried-madagascar-unrest-could-stall-zimbabwe-reform-agenda-at-sadc/",
            "content": "By A Correspondent| Herbert Chamuka, leader of Zimbabwes opposition People Unity Party (PUP), has expressed concern that ongoing demonstrations in Madagascar could delay his partys efforts to present proposals for an inclusive government to the Southern African Development Community.\n\nChamuka said his party is preparing papers to present to Madagascars President Andry Rajoelina, who took over as SADC chairman in August 2025.\n\nHowever, the opposition leader worries that the current instability in Rajoelinas own country will affect his time and ability to consider what the PUP wants to present.\n\nMadagascar has been dealing with violent protests since September 2025, mainly in the capital Antananarivo.\n\nThe demonstrations were triggered by frequent water and power outages.\n\nAccording to United Nations reports, at least 22 people have been killed and more than 100 injured in the unrest.\n\nPresident Rajoelina dissolved his government following the deadly protests and appointed a new prime minister.\n\nChamuka, who is currently pushing for an Inclusive Government Agenda, believes that taking the issue of inclusive governance to SADC could have a major impact on what PUP wants to achieve.\n\nHe said Zimbabwe has been struggling for too long with little change.\n\nZANU-PF is still focusing on winning the next election, Chamuka said, adding that the political atmosphere must shift so that ordinary Zimbabweans can benefit from their countrys wealth.\n\nThe PUP leader argued that Zimbabwes political situation calls for unity rather than confrontation, stating that there is currently no strong opposition that can remove ZANU-PF from power on its own.\n\nHe believes it would be wiser for all political players to unite with ZANU-PF in an inclusive government for the sake of the countrys future.\n\nZimbabwe has been troubled by political and economic crises for decades.\n\nThe country has faced hyperinflation, lack of jobs, and poor government performance, pushing many citizens into poverty.\n\nChamuka has been stepping up his campaign to promote an Inclusive Government Agenda, holding rallies across the country to drum up support.\n\nThere have been claims by some ZANU-PF officials that President Emmerson Mnangagwa could seek to extend his rule beyond the constitutional limit when his second term ends in 2028, though the government has not officially confirmed this.\n\nChamuka has cautioned that if the inclusive government approach fails, the opposition should form a strong alliance ahead of the 2028 elections.\n\nHowever, he maintains that unity, not division, is what will take Zimbabwe forward.\n\nThe PUP leaders efforts to engage SADC reflect a belief that regional intervention could help create a government that serves all citizens.\n\nWith President Rajoelina now dealing with serious domestic problems in Madagascar, including the deadly protests and government reshuffling, Chamukas concerns about delayed consideration of his proposals appear well founded.\n\nFor now, the PUP remains committed to its agenda, and we are hoping that regional diplomacy can help break Zimbabwes long standing political deadlock and improve the lives of ordinary citizens, Chamuka said.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Herbert Chamuka, leader of Zimbabwe’s opposition People Unity Party (PUP), has expressed concern that ongoing demonstrations in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/pups-chamuka-worried-madagascar-unrest-could-stall-zimbabwe-reform-agenda-at-sadc/\">Continue reading<span class=\"screen-reader-text\"> \"PUP’s Chamuka Worried Madagascar Unrest Could Stall Zimbabwe Reform Agenda at SADC\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        },
        {
            "title": "Chiwenga Camp Flexes Muscles",
            "url": "https://www.zimeye.net/2025/10/10/chiwenga-camp-flexes-muscles/",
            "content": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PFs upcoming annual conference in Mutare amid reports of deepening factionalism and growing discontent within the ruling partys ranks.\n\nZimEye can reveal that a faction of disgruntled ZANU PF officials is plotting to disrupt the Mutare conference, scheduled for October 1318, in protest against the controversial bid to extend Mnangagwas presidency beyond the constitutional two-term limit.\n\nTensions boiled over this week when ZANU PF Womens League boss, Mabel Chinomona, publicly warned against spoilers seeking to sabotage the event. Speaking at a Womens League empowerment programme at Chiwetu Training Centre in Makoni West Constituency, Chinomona  a politburo member  appeared visibly agitated as she read the riot act to party members.\n\nWe have the conference which is coming up in Mutare in Manicaland province next week. We dont want things which are not good; please, we dont want people who are destroying our party. Dont destroy your own party, she said.\n\nI am the leader of the womens league and I am ready to suspend people who are spreading falsehoods ahead of the conference. We dont want that, please.\n\nHer remarks laid bare the growing sense of panic within ZANU PF as internal divisions threaten to overshadow Mnangagwas leadership ahead of the 22nd annual national peoples conference to be held at Mutare Polytechnic Pavilion Grounds.\n\nThe tensions stem largely from the ongoing campaign by Mnangagwa loyalists to push for a constitutional amendment that would allow him to remain in power until 2030  a move fiercely opposed by some senior party officials who argue it violates the spirit of the 2013 Constitution.\n\nIronically, Chinomona herself was among the architects of the 2004 Tsholotsho Declaration, a failed attempt to alter ZANU PFs leadership structure in favour of Mnangagwa. The scheme, which angered then-President Robert Mugabe, saw Chinomona and several provincial chairpersons suspended  including current Speaker of Parliament Jacob Mudenda, who now serves as the partys secretary-general.\n\nAt the same event, Information Minister Jenfan Muswere and ICT Minister Tatenda Mavetera  both staunch Mnangagwa loyalists  used their addresses to pledge allegiance to the embattled President.\n\nWe have a training centre here at Chiwetu; its going to train women and youths, said Muswere, carefully steering clear of the ongoing succession debate.\n\nMavetera, who also heads the Young Women for ED movement, was less cautious. We are also saying that our President should rule until 2030, she declared, echoing the sentiments of the Presidents inner circle.\n\nManicaland Provincial Affairs Minister Misheck Mugadza urged women to take part in empowerment projects and announced plans to build a rehabilitation centre in the province  an attempt to project unity and development amid the widening cracks.\n\nBut behind the public speeches and pledges of loyalty, the Mutare conference threatens to become a battleground for power within ZANU PF. As fears of open rebellion mount, Mnangagwa risks facing his most embarrassing show of defiance since taking power in the 2017 military-assisted transition that toppled Mugabe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent-President Emmerson Mnangagwa faces possible humiliation at ZANU PF’s upcoming annual conference in Mutare amid reports of deepening … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/10/10/chiwenga-camp-flexes-muscles/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Camp Flexes Muscles\"</span></a></p>",
            "time": "21:46",
            "date": "11 Oct 2025"
        }
    ]
}