{
    "news": [
        {
            "title": "Venâncio Mondlane Calls Povo To Discourage Vandalism, Violence",
            "url": "https://www.zimeye.net/2024/12/26/venancio-mondlane-calls-povo-to-discourage-vandalism-violence/",
            "content": "By Farai D Hove |Mozambique is at a crossroads, as escalating violence, mass prison breaks, and civil unrest continue to grip the nation following disputed elections. Amid this chaos, Venncio Mondlane, the opposition leader and self-declared president-elect, has made a heartfelt appeal to his supporters: stop the vandalism and focus on the true fight for freedom.\n\nMondlanes Urgent Plea for Unity\n\nSpeaking on Thursday, Mondlane condemned the destruction of private property and urged protesters to channel their efforts toward solidarity rather than destruction. How do you want me to take office on January 15, 2025, if you are vandalizing private propertybusinesses owned by people who are victims of this system, just like you? he asked.\n\nMondlane made it clear that the fight for freedom must not be overshadowed by acts of violence and destruction. The president elected by the people does not condone this behavior. Do what you did in the 1st, 2nd, 3rd, and 4th stagesdo not allow vandalism! Help our brothers who are suffering from this destruction, he implored.\n\nIn a message emphasizing unity and purpose, Mondlane reminded his supporters that the movements success hinges on collective action. The fight for freedom must be guided by solidarity, not by destruction. Let us stand together and show that we are different from the oppressors we seek to remove, he added.\n\nThe Breaking Point: Unrest and Prison Breaks\n\nMozambique has been thrown into turmoil following the announcement of contested election results in October, which extended the Frelimo partys decades-long rule. The unrest has led to widespread protests, violent clashes, and the ransacking of major prisons.\n\nIn the most dramatic developments, over 2,500 inmates, including hardened criminals and insurgents from Cabo Delgado, have escaped from high-security facilities. Fires engulfed Cambumo Prison, the countrys second-largest, forcing mass evacuations. At Maputo Central Prison, over 1,500 detainees fled, although 150 were later recaptured. These jailbreaks underscore the deteriorating state of security and governance in the country.\n\nEconomic Fallout and Regional Implications\n\nThe unrest has also triggered significant economic consequences. Border closures, particularly with South Africa, are expected to disrupt supply chains, leading to severe food shortages. South Africa, already dealing with economic challenges and significant migration pressures, faces the potential for a humanitarian crisis at its border. The influx of refugees and the risk of cross-border criminal activity could escalate xenophobic tensions and strain resources in the region.\n\nMondlane warned of the broader implications of these actions, stating, We cannot let our fight for freedom bring suffering to others in the region. Unity and discipline must guide us, or we risk losing the very cause we are fighting for.\n\nGovernance Failures and the Role of Business Interests\n\nAt the heart of the crisis lies the systemic failure of Mozambiques governance. The ruling Frelimo party has been widely criticized for corruption and authoritarianism, fueling public anger and protests. However, the opposition remains fragmented, raising concerns about the ability to provide effective leadership if the ruling party is displaced.\n\nAdding to the complexity are the vested interests of multinational corporations, particularly in the resource-rich Cabo Delgado region. These companies, often more concerned with protecting profits than fostering stability, have been accused of hiring foreign mercenaries to safeguard their operations. This privatization of security further complicates the situation, as it shifts the focus away from resolving the root causes of the unrest.\n\nMedia Suppression and the Fight for Transparency\n\nJournalists and activists have faced significant risks in reporting on the unfolding crisis. With media suppression and threats of arrest, the flow of reliable information has been severely curtailed. This lack of transparency not only hinders accountability but also fuels mistrust among the populace.\n\nMondlanes Vision: A Path Forward\n\nMondlanes call for unity and discipline among protesters is a critical step toward addressing the chaos. His vision for the fight against oppression is rooted in solidarity and mutual support, rather than destruction and division. If we allow ourselves to be consumed by destruction, we are no better than the oppressors. Let us build, not destroy, he said.\n\nHe also emphasized the importance of maintaining the moral high ground. The world is watching us. Let us show them that the people of Mozambique are fighting for justice, freedom, and a better futurenot for chaos.\n\nConclusion\n\nMozambique stands at a critical juncture. The mass prison breaks, escalating unrest, and governance failures have created a volatile situation with implications far beyond its borders. Mondlanes appeal for unity offers a glimmer of hope, but the path to stability will require concerted efforts from all stakeholdersboth within Mozambique and across the region.\n\nThe world will be watching as Mozambique navigates this turbulent period. Whether the nation can rise from the ashes of its current crisis will depend on its ability to heed Mondlanes call for solidarity and channel its struggle into constructive change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Farai D Hove | Mozambique is at a crossroads, as escalating violence, mass prison breaks, and civil unrest continue … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/26/venancio-mondlane-calls-povo-to-discourage-vandalism-violence/\">Continue reading<span class=\"screen-reader-text\"> \"Venâncio Mondlane Calls Povo To Discourage Vandalism, Violence\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Mozambique: Massive Prison Break and Deadly Riots Amid Escalating Unrest",
            "url": "https://www.zimeye.net/2024/12/26/mozambique-massive-prison-break-and-deadly-riots-amid-escalating-unrest/",
            "content": "By Dorrothy Moyo | ZimEye |In a dramatic turn of events, over 2,500 prisoners have escaped from high-security prisons across Mozambique, including Cambumo Prison and Maputo Central Prison, following violent riots that have left at least 33 people dead and 15 injured. The incidents come as the country grapples with escalating civil unrest linked to Octobers disputed elections.\n\nCambumo Prison, Mozambiques second-largest correctional facility, was engulfed in flames as rioters stormed the premises, forcing mass evacuations and the destruction of property. Video footage screen prints from the scene show thick plumes of smoke rising from a gutted building as dozens of people mill around outside with personal belongings, seemingly in a state of chaos. Some individuals appear to be scavenging or attempting to salvage items, while others look on in confusion and distress amid the charred remains of the prison. The destruction paints a stark picture of the escalating crisis gripping the nation.\n\nThe chaos follows another jailbreak at the Maputo Central Prison, where approximately 1,530 inmates escaped on Christmas Day, though 150 have since been recaptured, according to authorities.\n\nProtests have swept the country after the constitutional court upheld the ruling Frelimo partys controversial election victory. Civic leaders and opposition groups have decried the elections as fraudulent, sparking nationwide demonstrations and violent confrontations with law enforcement. At least 130 people have been killed in clashes since the courts announcement earlier this week.\n\nProfessor Adriano Nuvunga, a leading activist, has expressed grave concern over the developments, stating, This shocking incident raises urgent questions about the state of security and the justice system in Mozambique. Immediate collaboration between authorities, civil society, and international partners is essential to restore order and address systemic challenges.\n\nThe riots have drawn international attention, with reports of widespread violence and police crackdowns across major cities. Eyewitness accounts and footage from the scene reveal the extent of destruction, as fires rage and protesters flood the streets.\n\nAs Mozambique descends into deeper turmoil, the risk of further instability looms. Authorities have deployed military forces to contain the unrest, but the situation remains volatile.\n\nAnalysis: The Ripple Effects of Mozambiques Unrest and Prison Breaks\n\nThe situation in Mozambique, marked by mass prison breaks, civil unrest, and violent clashes, represents both a domestic crisis and a looming regional and international challenge. Over 2,500 prisoners, including insurgents linked to Cabo Delgado, have escaped, raising fears of escalated violence and instability. Cabo Delgado, already a hotbed of extremist violence, now faces the potential influx of experienced combatants, further exacerbating security challenges for Mozambique and neighboring countries.\n\nThe unrest is also expected to trigger economic fallout. Border closures, particularly with South Africa, are likely to disrupt supply chains, leading to food shortages and further tensions. South Africa, sharing a porous border with Mozambique, is bracing for the influx of refugees and spillover effects. This situation threatens regional stability, as the economic interdependence of Southern African nations could unravel under the pressure of prolonged unrest.\n\nMozambiques crisis reflects a broader governance failure. Decades of mismanagement and corruption by the ruling Frelimo party have created a volatile environment. While public anger grows, the opposition remains fragmented and struggles to present a viable alternative. This systemic failure has fueled distrust in leadership, leaving citizens with little faith in political solutions.\n\nJournalists and activists face significant risks as they attempt to report on the unfolding crisis. Media suppression, arrests, and violence against reporters have created a dangerous environment, limiting accountability and obstructing the flow of reliable information. These challenges further entrench the crisis, as transparency is essential to addressing the root causes of unrest.\n\nSouth Africa, already burdened by economic pressures and significant migration, is likely to feel the brunt of the crisis. The arrival of Mozambican refugees and the potential for cross-border criminal activity could strain resources and escalate xenophobic tensions. Such animosity has been evident in the past and is expected to intensify as the crisis deepens.\n\nAdding to the complexity is the role of multinational corporations and foreign mercenaries in Mozambique, particularly in the resource-rich region of Cabo Delgado. These players, often focused on safeguarding their economic interests, contribute to the militarization of the crisis. The use of foreign mercenaries underscores how private security forces have become a significant factor in conflict zones, complicating efforts to achieve lasting peace.\n\nThe current chaos may eventually lead to a reckoning among Mozambiques populace, especially if food shortages become widespread and public anger turns against political leaders. However, this is an uncertain and precarious trajectory. To avoid a full collapse, the Mozambican government must act decisively by seeking support from regional organizations like the African Union and Southern African Development Community (SADC), as well as international partners. Open dialogue with opposition groups and civil society is critical to rebuilding trust and addressing systemic grievances.\n\nMozambiques unrest is a stark reminder of how governance failures, economic disparities, and political unrest can converge into a devastating crisis, with consequences that extend far beyond its borders. Collaborative action at both the national and regional levels is essential to chart a path toward stability.\n\nStay tuned for updates as this story develops.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dorrothy Moyo | ZimEye | In a dramatic turn of events, over 2,500 prisoners have escaped from high-security prisons … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/26/mozambique-massive-prison-break-and-deadly-riots-amid-escalating-unrest/\">Continue reading<span class=\"screen-reader-text\"> \"Mozambique: Massive Prison Break and Deadly Riots Amid Escalating Unrest\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Mnangagwa Threatens To Invade Mozambique And Impose Chapo On The Povo",
            "url": "https://www.zimeye.net/2024/12/25/mnangagwa-threatens-to-invade-mozambique-and-impose-chapo-on-the-povo/",
            "content": ".Emmerson Mnangagwa is directly implicated in systemic vote rigging, money laundering, and terrorism financing at multiple levels, with evidence establishing his central role in these unlawful activitiesRead on-\n\nBy A Correspondent | ZimEye |Zimbabwean President Emmerson Mnangagwa, has issued a controversial statement endorsing Mozambiques heavily disputed election results.\n\nHis remarks have been widely condemned as a direct threat to abuse SADCs influence to legitimize Daniel Chapos victorya result mired in allegations of electoral tampering, with Mnangagwas government itself accused of playing a key role in the irregularities.\n\nMnangagwas statement, which hails the Mozambican Constitutional Councils decision to uphold Chapos win as sacrosanct, has drawn backlash from political analysts and opposition leaders across the region. Critics argue that Mnangagwa is exploiting SADC to suppress the will of the Mozambican people and entrench an illegitimate government.\n\nAllegations of Zimbabwean Interference in Mozambican Elections\n\nInvestigations have implicated Mnangagwa in a scheme to manipulate the election in favor of Chapo and the ruling FRELIMO party. Factors include the illegal establishment of polling stations and the use of Zimbabwes state-run ZUPCO buses to ferry individuals who were instructed to vote for Chapo. These actions filmed in repeat operations to assist Frelimo have been described as a blatant violation of Mozambiques electoral sovereignty and a deliberate subversion of democracy.\n\nBy throwing SADCs weight behind Chapo, Mnangagwa has faced accusations of complicity in the very electoral fraud that has disenfranchised the Mozambican electorate. This interference has led to growing unrest in Mozambique, with citizens expressing outrage over what they perceive as foreign-backed exploitation of their democratic rights.\n\nMnangagwas Threatening Statement\n\nMnangagwas endorsement of the Constitutional Councils ruling came with an implied warning to those challenging the results. He declared SADCs readiness to assist Chapos government in consolidating power, a move many see as a direct threat to deploy SADCs resources and political influence to suppress dissent in Mozambique.\n\nThe statement also called on the international community to respect the sovereign will of Mozambiquea phrase that critics argue masks Mnangagwas intent to silence opposition voices and ensure that Chapo remains in power, irrespective of the allegations of electoral malpractice.\n\nFormer Zimbabwean Home Affairs Minister Saviour Kasukuwere sharply criticized Mnangagwas remarks, describing them as inflammatory and lacking tact. Kasukuwere accused Mnangagwa of arrogance and warned that his approach would only exacerbate an already volatile situation in Mozambique. A volatile situation requires a measure of diplomacy and still achieve your objectives, Kasukuwere stated, emphasizing the need for constructive engagement rather than coercion.\n\nWeaponizing SADC Against Mozambicans\n\nMnangagwas controversial stance has sparked fears that SADC is being transformed into a tool for authoritarianism rather than a guardian of democratic principles. Regional observers have expressed concerns that Mnangagwa is leveraging his position as SADC Chair to shield Chapos government from accountability, effectively enabling further violations of the Mozambican peoples rights.\n\nThe Southern African region has seen its fair share of disputed elections in recent years, but Mnangagwas explicit involvement in this case has set a dangerous precedent. His attempt to use SADC as a vehicle for legitimizing Chapos contested victory undermines the very foundation of the regional bloc, which is supposed to promote peace, stability, and democracy.\n\nGrowing Unrest in Mozambique\n\nThe fallout from Mnangagwas actions is already being felt in Mozambique, where public anger over the election has escalated into mass protests. Demonstrators recently occupied a key natural gas facility in Temane, disrupting supplies to South Africa and highlighting the broader economic implications of the crisis. Protesters have called for justice and accountability, rejecting both Chapos government and SADCs perceived complicity.\n\nPolitical analysts warn that Mnangagwas threats to enforce SADCs recognition of Chapos victory could further inflame tensions, potentially leading to violence and prolonged instability in Mozambique.\n\nRegional Implications\n\nMnangagwas heavy-handed approach has cast a shadow over SADCs credibility, raising questions about the blocs commitment to upholding democratic norms. By aligning SADC with a discredited regime, Mnangagwa risks isolating the organization from both its member states and the international community.\n\nThis crisis has also put a spotlight on Zimbabwes internal political dynamics, with opposition figures like Kasukuwere using the moment to criticize Mnangagwas leadership and authoritarian tendencies. Kasukuweres remarks underscore growing discontent within Zimbabwe over Mnangagwas willingness to prioritize personal and regional power over democratic principles.\n\nAs unrest continues to grow in Mozambique, Mnangagwas threat to use SADC to enforce an illegitimate election result stands as a stark warning of how regional institutions can be weaponized against the very people they are meant to protect. With his actions, Mnangagwa has not only jeopardized the stability of Mozambique but also the integrity of SADC as a democratic institution.\n\nEmmerson Mnangagwa is directly implicated in systemic vote rigging, money laundering, and terrorism financing at multiple levels, with evidence establishing his central role in these unlawful activities. He is the owner and principal beneficiary of an enterprise that has been sanctioned under the UK and US Magnitsky Acts for its involvement in extensive money laundering and gold smuggling operations across Southern Africa. These criminal enterprises have directly influenced Mozambiques elections, enabling outcomes that favor his political allies, FRELIMO, and subverting the democratic will of the Mozambican people.\n\nIrrefutable video evidence shows that Mnangagwa has commandeered Zimbabwean government resources to interfere in Mozambiques elections. State-owned ZUPCO buses were deployed under his directive to transport individuals to illegal and fraudulent polling stations, manufacturing votes for FRELIMO in both the 2019 and 2024 elections. These actions were executed with the full backing of Zimbabwes state apparatus, constituting not only a gross abuse of public resources but also a deliberate assault on the sovereignty of Mozambiques electoral process.\n\nThe enterprise linked to Mnangagwa, already sanctioned for laundering illicit funds and facilitating gold smuggling, has been proven to serve as a vehicle for financing political manipulation and destabilizing Southern Africa. These operations violate international anti-corruption and anti-money laundering statutes, including the provisions of the UK and US Magnitsky frameworks, as well as regional agreements under the Southern African Development Community (SADC) Charter and the African Unions Charter on Democracy, Elections, and Governance.\n\nMnangagwas actions represent a blatant breach of Mozambiques electoral sovereignty, involving calculated, state-sponsored fraud designed to entrench political allies in power. This constitutes not only a violation of international norms but also an egregious attack on the democratic principles that underpin the governance of the region. His conduct undermines the integrity of electoral processes and facilitates the growth of transnational criminal networks, threatening the stability of Southern Africa as a whole.\n\nGiven the overwhelming evidence of his role in these violations, Mnangagwas actions demand immediate and decisive action by international and regional institutions. The proven abuses of state machinery, electoral interference, and financial crimes tied to his regime call for comprehensive judicial accountability and sanctions enforcement. These crimes are not only a betrayal of the Mozambican people but also an affront to the rule of law and the democratic foundations of the region.\n\nThe Mozambican people, who have already been disenfranchised, now face the prospect of further oppression, with SADC seemingly endorsing their subjugation. As calls for justice and accountability grow louder, the spotlight remains firmly on Mnangagwas leadership and his role in one of the regions most contentious political crises.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "….Emmerson Mnangagwa is directly implicated in systemic vote rigging, money laundering, and terrorism financing at multiple levels, with evidence establishing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/mnangagwa-threatens-to-invade-mozambique-and-impose-chapo-on-the-povo/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Threatens To Invade Mozambique And Impose Chapo On The Povo\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zanu PF Buries Chiwenga",
            "url": "https://www.zimeye.net/2024/12/25/zanu-pf-buries-chiwenga/",
            "content": "Harare Zanu PF has insisted that President Emmerson Mnangagwa would not be replaced in 2028, sidelining Vice President Constantino Chiwenga from succeeding him.\n\nInformation Minister and Zanu PF Central Committee member Jenfan Muswere made the announcement, putting to rest speculations that Chiwenga would become the Zanu PF Presidential candidate in 2028.\n\nMuswere revealed that the decision was ratified at the Zanu PF Annual Peoples Conference held in October in Bulawayo. The delegates to the Zanu PF 21st National Peoples Conference resolve as follows: the President and First Secretary of Zanu PF Party, His Excellency, Cde. Dr. E. D. Mnangagwas term of office as President of the Republic of Zimbabwe and First Secretary of Zanu PF be extended beyond 2028 to 2030, reads the resolution.\n\nThe resolution also directed the party and government to amend the national constitution to give effect to this extension.\n\nThe move seemingly ends years of speculation over Chiwengas potential succession, a debate that has persisted since the 2017 coup that ousted Robert Mugabe and brought Mnangagwa to power.\n\nInitially seen as Mnangagwas key ally, Chiwengas influence has appeared to wane amid growing internal factionalism and Mnangagwas consolidation of power.\n\nMusweres remarks underscore the binding nature of the resolutions passed at the conference, which he described as unanimously adopted with no opposition from the delegates.\n\nHe dismissed dissenting voices outside party structures as noise makers with no relevance to Zanu PFs internal processes.\n\nMuswere explained that extending Mnangagwas leadership is critical to ensuring the successful implementation of Vision 2030the governments ambitious development agenda aimed at transforming Zimbabwe into an upper-middle-income economy by the end of the decade.\n\nStability and consistency in leadership, he argued, are essential for achieving these long-term goals.\n\nAddressing questions from party members, including newly elected war veterans association member Gilbert Zowa, Muswere reiterated that the ED2030 slogan and the push for Mnangagwas continued leadership were in line with Zanu PFs constitution.\n\nHe noted that the resolutions were legally binding, as the conference met all procedural and quorum requirements.\n\nZowa had sought clarification on the ED2030 slogan, pointing out that Mnangagwa himself had previously expressed disinterest in extending his term beyond 2028.\n\nHowever, Muswere emphasized that the partys collective decision takes precedence. The Presidents personal statements notwithstanding, our guiding principle is the Zanu PF constitution and the resolutions adopted at the Annual Peoples Conference, he said.\n\nThe endorsement of Mnangagwas extended leadership signals a tightening grip on power by the incumbent, further marginalizing Chiwenga and his allies.\n\nThe power struggle between the two has been a defining feature of Zanu PFs internal politics since 2017, with Chiwengas faction increasingly on the back foot. By securing unanimous support for the extension, Mnangagwa has not only fortified his position but also reaffirmed his dominance over the partys succession narrative.\n\nMusweres statements also highlight the partys efforts to present a unified front amid growing calls for clarity on the leadership issue.\n\nThe resolutions passed in Bulawayo, chaired by Zanu PF national chairperson Oppah Muchinguri-Kashiri, underscore the partys determination to maintain Mnangagwas leadership for the foreseeable future.\n\n-State media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – Zanu PF has insisted that President Emmerson Mnangagwa would not be replaced in 2028, sidelining Vice President Constantino Chiwenga … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/zanu-pf-buries-chiwenga/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Buries Chiwenga\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Mnangagwa Calls Mozambique Opposition To Order",
            "url": "https://www.zimeye.net/2024/12/25/mnangagwa-calls-mozambique-opposition-to-order/",
            "content": "Harare-Thechairman of SADC and Zimbabwean President Emmerson Mnangagwa has urged parties in Mozambique to respect the rule of law.\n\nChaos escalated Monday in Maputo after the Constitutional Court upheld the controversial October election results.\n\nThe ruling reaffirmed the ruling FRELIMO party presidential candidate DanielChaposvictory, albeit with a revised margin, acknowledging significant electoral irregularities.\n\nThe court reducedChaposvictory from 71% to 65%, increasing his rival VenncioMondlanesshare to 24% from the previous 20%.\n\nThe opposition has rejected the results and called all citizens to storm the streets.\n\nIn a statement Wednesday, Mnangagwa saidthedecision oftheconstitutional courtshould be respected.\n\nBelow isMnangagwasfullstatement:\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE\n\nThe Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election Results held in the Republic of Mozambique on 9th October this year.The ruling by thatcountrystop electoral court, which upheldFRELIMOPartysvictory, completes and thus exhausts all lawful processesondetermining electionresults,in line with thatcountrysnationallaws,and in keeping withSADCsElection Guidelines and expectations.\n\nSADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council whichshould provide a constitutional way forward for the country,and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nSADC stands ready to assist the incomingGovernment,and People ofMozambique,in consolidating their electoral democracyon the basis ofthe aforesaid Court decisionwhichshould be held sacrosanct by all.Indeed, this is what the rule of law is all about.\n\nFurther, SADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law, and orderwhichthe country and people sorely need and deserve.\n\nOur Region witnessed a record number of national elections in the last two years, itself a loud testimony that democracy continues to find deeper roots andtoflourish in our SADC Region.\n\nED MnangagwaPresident of Zimbabwe and Chairman of SADC\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE.The Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December, 2024, by the Constitutional\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare-The chairman of SADC and Zimbabwean President Emmerson Mnangagwa has urged parties in Mozambique to respect the rule of law. Chaos … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/mnangagwa-calls-mozambique-opposition-to-order/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Calls Mozambique Opposition To Order\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Mnangagwa Speaks On Mozambique Electoral Controversy",
            "url": "https://www.zimeye.net/2024/12/25/mnangagwa-speaks-on-mozambique-electoral-controversy/",
            "content": "Harare SADC Chairman and the President of Zimbabwe Emmerson Mnangagwa said the opposition in Mozambique should adhere to the rule of law.\n\nIn a statement Wednesday after the recent ruling byMozambiqueshighest court upholding theOctober 9election results, which declared the FRELIMO Party victorious, Mnangagwa said everyone in Mozambique should respect thecourtsdecision.\n\nMozambique has beenembroiled in controversysince the October elections, with opposition parties and some international observers raising concerns about alleged irregularities.\n\nThe announcement by the Constitutional Council affirmingFRELIMOsvictory comes amidst accusations of voter suppression and fraud, leading to widespread protests and unrest across the country.\n\nMnangagwascall for calm and adherence to constitutional processesis a reflection ofSADCsbroader commitment to regional stability.\n\nHowever, critics argue thatSADCsapproach often prioritizes the status quo over addressing legitimate grievances.\n\nThis stance has drawn both praise for promoting order and criticism for perceived bias towards ruling parties in theregion.\n\nMnangagwasfullstatement reads as follows:\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE\n\nThe Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday,23rd December2024, by the Constitutional Council of Election Results held in the Republic of Mozambique on9th Octoberthis year.The ruling by thatcountrystop electoral court, which upheldFRELIMOPartysvictory, completes and thus exhausts all lawful processesondetermining electionresults,in line with thatcountrysnationallaws,and in keeping withSADCsElection Guidelines and expectations.\n\nSADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nSADC stands ready to assist the incoming Government, and People of Mozambique, in consolidating their electoral democracy on the basis of the aforesaid Court decision which should be held sacrosanct by all. Indeed, this is what the rule of law is all about.\n\nFurther, SADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law, and orderwhichthe country and people sorely need and deserve.\n\nOurRegionwitnessed a record number of national elections in the last two years, itself a loud testimony that democracy continues to find deeper roots and to flourish in our SADC Region.\n\nED MnangagwaPresidentof Zimbabwe and Chairman of SADC\n\nSTATEMENT BY THE CHAIRMAN OF SADC, DR EMMERSON DAMBUDZO MNANGAGWA, ON ELECTION RESULTS IN THE REPUBLIC OF MOZAMBIQUE.The Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December, 2024, by the Constitutional\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – SADC Chairman and the President of Zimbabwe Emmerson Mnangagwa said the opposition in Mozambique should adhere to the rule … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/mnangagwa-speaks-on-mozambique-electoral-controversy/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Speaks On Mozambique Electoral Controversy\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Chiwenga Thrown-Out Of Succession Race",
            "url": "https://www.zimeye.net/2024/12/25/chiwenga-thrown-out-of-succession-race/",
            "content": "Harare Zanu PF has officially endorsed President Emmerson Mnangagwas leadership beyond 2028, effectively sidelining Vice President Constantino Chiwenga from succeeding him.\n\nInformation Minister and Zanu PF Central Committee member Jenfan Muswere, made the announcement putting to rest speculations that Chiwenga would become the Zanu PF Presidential candidate in 2028.\n\nMuswere revealed that the decision was ratified at the Zanu PF Annual Peoples Conference held in October in Bulawayo. The delegates to the Zanu PF 21st National Peoples Conference resolve as follows: the President and First Secretary of Zanu PF Party, His Excellency, Cde. Dr. E. D. Mnangagwas term of office as President of the Republic of Zimbabwe and First Secretary of Zanu PF be extended beyond 2028 to 2030, reads the resolution.\n\nThe resolution also directed the party and government to amend the national constitution to give effect to this extension.\n\nThe move seemingly ends years of speculation over Chiwengas potential succession, a debate that has persisted since the 2017 coup that ousted Robert Mugabe and brought Mnangagwa to power.\n\nInitially seen as Mnangagwas key ally, Chiwengas influence has appeared to wane amid growing internal factionalism and Mnangagwas consolidation of power.\n\nMusweres remarks underscore the binding nature of the resolutions passed at the conference, which he described as unanimously adopted with no opposition from the delegates.\n\nHe dismissed dissenting voices outside party structures as noise makers with no relevance to Zanu PFs internal processes.\n\nMuswere explained that extending Mnangagwas leadership is critical to ensuring the successful implementation of Vision 2030the governments ambitious development agenda aimed at transforming Zimbabwe into an upper-middle-income economy by the end of the decade.\n\nStability and consistency in leadership, he argued, are essential for achieving these long-term goals.\n\nAddressing questions from party members, including newly elected war veterans association member Gilbert Zowa, Muswere reiterated that the ED2030 slogan and the push for Mnangagwas continued leadership were in line with Zanu PFs constitution.\n\nHe noted that the resolutions were legally binding, as the conference met all procedural and quorum requirements.\n\nZowa had sought clarification on the ED2030 slogan, pointing out that Mnangagwa himself had previously expressed disinterest in extending his term beyond 2028.\n\nHowever, Muswere emphasized that the partys collective decision takes precedence. The Presidents personal statements notwithstanding, our guiding principle is the Zanu PF constitution and the resolutions adopted at the Annual Peoples Conference, he said.\n\nThe endorsement of Mnangagwas extended leadership signals a tightening grip on power by the incumbent, further marginalizing Chiwenga and his allies.\n\nThe power struggle between the two has been a defining feature of Zanu PFs internal politics since 2017, with Chiwengas faction increasingly on the back foot. By securing unanimous support for the extension, Mnangagwa has not only fortified his position but also reaffirmed his dominance over the partys succession narrative.\n\nMusweres statements also highlight the partys efforts to present a unified front amid growing calls for clarity on the leadership issue.\n\nThe resolutions passed in Bulawayo, chaired by Zanu PF national chairperson Oppah Muchinguri-Kashiri, underscore the partys determination to maintain Mnangagwas leadership for the foreseeable future.\n\n-State Media\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare – Zanu PF has officially endorsed President Emmerson Mnangagwa’s leadership beyond 2028, effectively sidelining Vice President Constantino Chiwenga from succeeding … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/chiwenga-thrown-out-of-succession-race/\">Continue reading<span class=\"screen-reader-text\"> \"Chiwenga Thrown-Out Of Succession Race\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "ZANU PF Says It’s Entering Mozambique for Chapo Inauguration; Should We Alert Citizens?",
            "url": "https://www.zimeye.net/2024/12/25/zanu-pf-says-its-entering-mozambique-for-chapo-inauguration-should-we-alert-citizens/",
            "content": "ZANU PF has announced it is soon entering Mozambique for Daniel Chapos inauguration. Should we inform the citizens or keep quiet ?@wilkerDias13@podemos@Cidiachissungo\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Talent Rusere- Fact Check",
            "url": "https://www.zimeye.net/2024/12/25/talent-rusere-fact-check/",
            "content": "A ZANU PF activist, who  claims he exposed election rigging in Mozambique, has recently gone on to accuse the Botswana Government for arresting him in Plumtree.\n\nMr Talent Rusere who calls self a professor, also alleges he is a lawyer and or an advocate such that he leads a group of lawyers called the SAHRF: Southern African Human Rights Forum\n\nSAHRF FACT CHECKS-\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "A ZANU PF activist, who claims he exposed election rigging in Mozambique, has recently gone on to accuse the Botswana … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/25/talent-rusere-fact-check/\">Continue reading<span class=\"screen-reader-text\"> \"Talent Rusere- Fact Check\"</span></a></p>",
            "time": "06:09",
            "date": "26 Dec 2024"
        },
        {
            "title": "Mapfumo to Mozambicans: You’re More Than Soldiers, Come Out",
            "url": "https://www.zimeye.net/2024/12/25/mapfumo-to-mozambicans-youre-more-than-soldiers-come-out/",
            "content": "Youre more than the soldiers, come out and protest against misrule, legendary singer Thomas Mapfumo tells Mozambicans as he connects to events being reported by@AllexandreMZ@wilkerDias13@Cidiachissungo.https://t.co/hSOzlbDTvx\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "06:09",
            "date": "26 Dec 2024"
        }
    ]
}