{
    "news": [
        {
            "title": "A Tribute To Veteran SA Singer",
            "url": "https://www.zimeye.net/2025/01/09/a-tribute-to-veteran-sa-singer/",
            "content": "By A Correspondent\n\nSouth African Afropop musician and actress Winnie Khumalo has passed away at the age of 51. According to sources, Khumalo died on Tuesday at her home after a short illness.\n\nMedia personality Sabelo Ntombeningi Sithole was one of the first people contacted by Khumalos daughter, Rethabile, who informed him of her mothers condition. Sithole rushed to Khumalos home, but unfortunately, it was too late.\n\nKhumalo had a series of health scares in recent years, including being diagnosed with diabetes and asthma. In 2017, she was wheelchair-bound for several weeks following a back operation.\n\nKhumalo rose to fame as a teenager, introduced to the music industry by the late Brenda Fassie. She worked as a backing singer for Fassie and released her debut album, Hey Laitie, Tshina Tshina, at just 15 years old.\n\nThroughout her career, Khumalo collaborated with notable artists, including Pure Magic, Sipho Mbele, and Bongo Maffin. She also acted in TV series such as Muvhango and Mponeng.\n\nKhumalos daughter, Rethabile, followed in her mothers footsteps, composing a hit song with Sello Chicco Twala. Khumalos legacy will be remembered through her contributions to the South African music industry.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent South African Afropop musician and actress Winnie Khumalo has passed away at the age of 51. According … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/a-tribute-to-veteran-sa-singer/\">Continue reading<span class=\"screen-reader-text\"> \"A Tribute To Veteran SA Singer\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "ZACC Targets Corrupt Cops",
            "url": "https://www.zimeye.net/2025/01/09/zacc-targets-corrupt-cops/",
            "content": "By A Correspondent\n\nTwo Zimbabwe Republic Police (ZRP) officers, Sergeant Chiponda Dudzai Jennifer and Constable Mutsago Glynislynn from Mutare, have been arrested for allegedly soliciting and accepting a bribe from a motorist.\n\nThe officers had initially demanded a bribe of $90 to release the motorists vehicle.\n\nAfter the motorist reported the incident to the Zimbabwe Anti-Corruption Commission (ZACC), a trap was set, and the officers were caught accepting $20.\n\nThey will face charges of bribery as defined in the Criminal Law (Codification and Reform) Act, Chapter 9:23, at the Mutare Magistrate Court.\n\nThis arrest comes as the ZACC continues to crack down on corruption within the police force.\n\nIn a similar incident, two police officers, Sergeant James Chifamba and Constable Trymore Gunzva, were arrested for allegedly accepting bribes from motorists along the Harare-Mutare Road .\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Two Zimbabwe Republic Police (ZRP) officers, Sergeant Chiponda Dudzai Jennifer and Constable Mutsago Glynislynn from Mutare, have … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/zacc-targets-corrupt-cops/\">Continue reading<span class=\"screen-reader-text\"> \"ZACC Targets Corrupt Cops\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "The Return Of Allan Chimbetu",
            "url": "https://www.zimeye.net/2025/01/09/the-return-of-allan-chimbetu/",
            "content": "By A Correspondent\n\nAllan Chimbetu, the renowned Dendera maestro and one of the last-standing pioneers of the Sungura sub-genre, is gearing up to launch his first project of 2025.\n\nThe upcoming release will emphasize the significance of mutual support, a theme close to his heart.\n\nAs one of the founding members of the Dendera music genre, Allan, along with his brothers Simon and Naison Chimbetu, helped shape the sound that became iconic in the 1980s. Their contributions solidified their place as one of the most influential musical groups of that era.\n\nBefore his rise to stardom, Allan began his career by working as a bouncer at his brother Simons shows, often serving as the doorman.\n\nThis role, he recalls, played a significant part in his development: That experience helped me a lot. I even earned a black belt in karate!\n\nAllans musical journey took a turn when he was eventually invited to join the band, where his skills as a lead and rhythm guitarist quickly became evident.\n\nHis guitar work became a defining feature of their sound, with hits like Usaende pa Barika, Ndaremerwa, Newspaper, Pane Asipo, Window, and Tenda highlighting his talent.\n\nFollowing the untimely death of his brother Simon, Allan assumed leadership of the Dendera Kings band.\n\nFor a time, he successfully led the group, but tensions arose when an altercation occurred between him and Suluman Chimbetu, Simons son. As a result, Allan was ousted from the band.\n\nUndeterred, Allan decided to forge his own path and formed his own band, Orchestra Dendera Kings Central Committee. He continued to release music, with notable albums such as Sony, Professor, and Simukai.\n\nAs he prepares to debut his new project in 2025, Allan Chimbetu is determined to leave a lasting impact with his message of unity and support.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Allan Chimbetu, the renowned Dendera maestro and one of the last-standing pioneers of the Sungura sub-genre, is … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/the-return-of-allan-chimbetu/\">Continue reading<span class=\"screen-reader-text\"> \"The Return Of Allan Chimbetu\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "Brendan Galloway Shines",
            "url": "https://www.zimeye.net/2025/01/09/brendan-galloway-shines/",
            "content": "Sports Correspondent\n\nPlymouth Argyle defender Brendan Galloway has been celebrated for his exceptional performance in the English Championship, securing a place in the Team of the Week for Matchday 18.\n\nGalloway was instrumental in his sides 0-0 draw against Stoke City, playing as a left central defender in a 3-4-2-1 formation and completing the full 90 minutes.\n\nHis standout statistics from the match include:\n\n8 clearances\n\n2 blocked shots\n\n1 interception\n\n6 out of 8 successful ground duels\n\n4 out of 5 won aerial duels\n\nWith this impressive defensive display, Galloway rightfully earns his spot in the Championship Team of the Week.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Plymouth Argyle defender Brendan Galloway has been celebrated for his exceptional performance in the English Championship, securing a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/brendan-galloway-shines/\">Continue reading<span class=\"screen-reader-text\"> \"Brendan Galloway Shines\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "Nakamba Wins Over Coach With Impressive Return",
            "url": "https://www.zimeye.net/2025/01/09/nakamba-wins-over-coach-with-impressive-return/",
            "content": "By A Correspondent\n\nLuton Town coach Rob Edwards has expressed his satisfaction with Marvelous Nakambas recent performances, following the midfielders return from a long-term knee injury.\n\nNakamba made his comeback in November after a 10-month layoff, but initially looked rusty in his early games back. However, after regaining his fitness, the Zimbabwean international has started in Luton Towns last two matches, catching the attention of his coach.\n\nCoach Edwards revealed that he had a productive conversation with Nakamba, which seems to have paid off. I was really pleased with him. We had a good conversation, Edwards said, praising Nakambas progress. With his fitness levels now improved, Nakamba will be looking to maintain his starting spot and continue impressing his coach.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Luton Town coach Rob Edwards has expressed his satisfaction with Marvelous Nakamba’s recent performances, following the midfielder’s … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/nakamba-wins-over-coach-with-impressive-return/\">Continue reading<span class=\"screen-reader-text\"> \"Nakamba Wins Over Coach With Impressive Return\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "New Respiratory Virus Hits China",
            "url": "https://www.zimeye.net/2025/01/09/new-respiratory-virus-hits-china/",
            "content": "By A Correspondent\n\nChina is facing a significant rise in cases of a respiratory virus, causing overcrowded hospitals, the introduction of new monitoring protocols, and growing public anxiety about a potential outbreak.\n\nThe virus, known as human metapneumovirus (HMPV), has seen a sharp increase in infections across northern provinces, with children being particularly affected this winter.\n\nThis new wave comes five years after the global alert about the coronavirus outbreak in Wuhan, which ultimately triggered a pandemic, resulting in seven million deaths worldwide.\n\nSocial media has been flooded with images and videos showing people wearing masks in Chinese hospitals, with local reports drawing parallels to the early days of the COVID-19 pandemic.\n\nIn response, health authorities have implemented new measures to track and manage pneumonia cases of unknown origin.\n\nHowever, Beijing has sought to downplay the situation, suggesting it is part of the usual winter pattern.\n\nOn Friday, Chinas foreign ministry spokesperson Mao Ning stated, Respiratory infections generally peak during the winter months. The diseases appear to be less severe and spread on a smaller scale than last year.\n\nWhat is HMPV?\n\nHuman metapneumovirus (HMPV) is a respiratory infection that resembles the symptoms of a cold or flu. While most cases are mild, the virus can lead to serious complications like pneumonia, especially in young children, the elderly, and those with weakened immune systems.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent China is facing a significant rise in cases of a respiratory virus, causing overcrowded hospitals, the introduction … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/new-respiratory-virus-hits-china/\">Continue reading<span class=\"screen-reader-text\"> \"New Respiratory Virus Hits China\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "Veteran Mzansi Musician Dies",
            "url": "https://www.zimeye.net/2025/01/09/veteran-mzansi-musician-dies/",
            "content": "By A Correspondent\n\nSouth African Afropop musician and actress Winnie Khumalo has passed away at the age of 51. According to sources, Khumalo died on Tuesday at her home after a short illness.\n\nMedia personality Sabelo Ntombeningi Sithole was one of the first people contacted by Khumalos daughter, Rethabile, who informed him of her mothers condition. Sithole rushed to Khumalos home, but unfortunately, it was too late.\n\nKhumalo had a series of health scares in recent years, including being diagnosed with diabetes and asthma. In 2017, she was wheelchair-bound for several weeks following a back operation.\n\nKhumalo rose to fame as a teenager, introduced to the music industry by the late Brenda Fassie. She worked as a backing singer for Fassie and released her debut album, Hey Laitie, Tshina Tshina, at just 15 years old.\n\nThroughout her career, Khumalo collaborated with notable artists, including Pure Magic, Sipho Mbele, and Bongo Maffin. She also acted in TV series such as Muvhango and Mponeng.\n\nKhumalos daughter, Rethabile, followed in her mothers footsteps, composing a hit song with Sello Chicco Twala. Khumalos legacy will be remembered through her contributions to the South African music industry.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent South African Afropop musician and actress Winnie Khumalo has passed away at the age of 51. According … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/09/veteran-mzansi-musician-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Veteran Mzansi Musician Dies\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "Church Leader Steals US$21K Tithes",
            "url": "https://www.zimeye.net/2025/01/08/church-leader-steals-us21k-tithes/",
            "content": "By Religion Reporter- An administrator with SHALOM Churchs Westlea Assembly has been arrested for allegedly stealing US$21,904 in tithes and offerings.\n\nChipo Molly Machokonera, employed as an administration secretary, appeared before Harare magistrate Isheanesu Matova on Monday, facing theft charges.\n\nShe was not asked to plead.\n\nThe court heard that between January 2023 and December 10, 2024, Machokonera was responsible for receiving, receipting, and depositing money collected from congregants.\n\nInstead, she allegedly diverted the funds for personal use and submitted fake deposit slips to the churchs pastor, claiming she had banked the money at Steward Banks Joina City branch.\n\nThe alleged fraud was uncovered on December 10 when the pastor requested a bank statement and discovered the deposits were missing.\n\nAn internal audit confirmed the theft, prompting a report to the police.\n\nMachokonera was arrested, but the stolen funds remain unrecovered.\n\nRufaro Chonzi represented the State.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Religion Reporter- An administrator with SHALOM Church’s Westlea Assembly has been arrested for allegedly stealing US$21,904 in tithes and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/church-leader-steals-us21k-tithes/\">Continue reading<span class=\"screen-reader-text\"> \"Church Leader Steals US$21K Tithes\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "ZEC Chief Buyer In Mysterious Death",
            "url": "https://www.zimeye.net/2025/01/08/zec-chief-buyer-in-mysterious-death/",
            "content": "By Munacho Gwamanda- A top official with the Zimbabwe Electoral Commission (ZEC) has died.\n\nOn Wednesday, the Commission announced the death of its Acting Chief Procurement Officer, Simbisai Mutimba, but did not disclose the cause.\n\nMutimba, who joined ZEC in 2018, died on January 2, 2025.\n\nHer career trajectory within ZEC saw her rise swiftlythrough the ranksfrom Administration Officer for Bindura District to Acting Chief Procurement Officer at theCommissionsHead Office.\n\nZEC issued a statement mourning her death, saying:\n\nThe Honourable Chairperson Mrs. Justice Priscilla Makanyara Chigumba, the Deputy Chairperson Ambassador Rodney Simukai Kiwa, Commissioners, the Acting Chief Elections Officer Mr. Simbarashe Tongayi, and the entire Commission staff would like to express their sincere condolences to the Mutimba family on the untimely demise of Ms. Simbisai Mutimba. May her soul rest in eternal peace.\n\nMutimbasdeath comes as ZEC remains under intense public scrutiny over its history of controversial election management, allegations of voter suppression, and accusations of facilitating election rigging.\n\nSince its formation, the Commission has faced repeated claims of biasin favour ofthe ruling Zanu PF party.\n\nCritics argue thatZECsopaque processes, including its procurement systems for election materials, are key instruments of electoral manipulation.\n\nIn the lead-up to the 2024 general election, ZEC faced backlash for alleged irregularities in the delimitation of electoral boundaries, discrepancies in thevotersroll, and opaque procurement of ballot papersareas reportedly overseen by the procurement department Mutimba led.\n\nThese controversies further eroded public trust in the bodytasked withupholdingZimbabwesdemocracy.\n\nWhile tributes pour in for Mutimba, questions linger about the operational integrity of ZEC, with many wondering if the Commission will ever shake off its reputation as a partisan tool of the state.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- A top official with the Zimbabwe Electoral Commission (ZEC) has died.  On Wednesday, the Commission announced the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/zec-chief-buyer-in-mysterious-death/\">Continue reading<span class=\"screen-reader-text\"> \"ZEC Chief Buyer In Mysterious Death\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        },
        {
            "title": "Nakamba Impresses Luton Town Boss",
            "url": "https://www.zimeye.net/2025/01/08/nakamba-impresses-luton-town-boss/",
            "content": "Sports Correspondent\n\nLuton Town coach Rob Edwards has expressed his satisfaction with Marvelous Nakambas recent performances, following the midfielders return from a long-term knee injury.\n\nNakamba made his comeback in November after a 10-month layoff, but initially looked rusty in his early games back. However, after regaining his fitness, the Zimbabwean international has started in Luton Towns last two matches, catching the attention of his coach.\n\nCoach Edwards revealed that he had a productive conversation with Nakamba, which seems to have paid off. I was really pleased with him. We had a good conversation,\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Luton Town coach Rob Edwards has expressed his satisfaction with Marvelous Nakamba’s recent performances, following the midfielder’s return … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/08/nakamba-impresses-luton-town-boss/\">Continue reading<span class=\"screen-reader-text\"> \"Nakamba Impresses Luton Town Boss\"</span></a></p>",
            "time": "18:31",
            "date": "09 Jan 2025"
        }
    ]
}