{
    "news": [
        {
            "title": "Bhasera Returns To SuperSport United",
            "url": "https://www.zimeye.net/2025/03/27/bhasera-returns-to-supersport-united/",
            "content": "Sports Correspondent\n\nIn a significant development,former Zimbabwe Warriors defender Onismor Bhasera has made a return to SuperSport United, marking a new chapter in his career. This time around, Bhasera will be joining the clubs technical team, bringing his expertise and experience to the table.\n\nBhasera will be working alongside esteemed colleagues Andre Arendo and Grant Johnson, forming a formidable trio that is expected to drive the teams success. As part of the technical team, Bhaseras responsibilities will include providing strategic guidance, analyzing team performance, and contributing to the development of the squad.\n\nThe return of Bhasera to SuperSport United is a positive move for the club, and fans will be eager to see the impact of his involvement.\n\nWith his wealth of knowledge and experience, Bhasera is well-equipped to make a meaningful contribution to the teams technical staff.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a significant development,former Zimbabwe Warriors defender Onismor Bhasera has made a return to SuperSport United, marking a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/bhasera-returns-to-supersport-united/\">Continue reading<span class=\"screen-reader-text\"> \"Bhasera Returns To SuperSport United\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "DeMbare Date Simba Bhora",
            "url": "https://www.zimeye.net/2025/03/27/dembare-date-simba-bhora/",
            "content": "By A Correspondent\n\nDynamos FC, struggling in recent times, will face off against Simba Bhora in what promises to be a thrilling Castle Lager Premier Soccer League match at Rufaro Stadium this Sunday.\n\nHere are the upcoming fixtures for the weekend:\n\nCastle Lager Premier Soccer League Weekend Fixtures\n\nSaturday 29 March\n\nTelOne vs CAPS United, 15:00  Ascot Stadium\n\nNgezi Platinum vs Triangle, 15:00  Baobab Stadium\n\nBikita Minerals vs Green Fuel, 15:00  Sakubva Stadium\n\nYadah vs Kwekwe United, 15:00  The Heart Stadium\n\nFC Platinum vs MWOS, 15:00  Mandava Stadium\n\nZPC Kariba vs Chicken Inn, 15:00  Nyamhunga Stadium\n\nHerentals vs Manica Diamonds, 15:00  Rufaro Stadium\n\nSunday 30 March\n\nHighlanders vs Scottland, 15:00  Barbourfields Stadium\n\nDynamos vs Simba Bhora, 15:00  Rufaro Stadium\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Dynamos FC, struggling in recent times, will face off against Simba Bhora in what promises to be … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/dembare-date-simba-bhora/\">Continue reading<span class=\"screen-reader-text\"> \"DeMbare Date Simba Bhora\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "Alexandra Park Primary School Corruption Scandal Under ZACC Investigation",
            "url": "https://www.zimeye.net/2025/03/27/alexandra-park-primary-school-corruption-scandal-under-zacc-investigation/",
            "content": "ByA Correspondent| The Zimbabwe Anti-Corruption Commission (ZACC) is investigating Alexandra Park Primary Schools deputy headmistress, Mai Kundishora, and headmaster Mr. Kwari over alleged nepotism and financial mismanagement, in the promotion of unqualified staff Ella Samanga and Nyembesi Matsengauswa to boarding school-specific roles despite the institution lacking such facilities.\n\nIrregular contracts disguised as offer lettersuncovered by the School Development Committee chairpersonexpose how Kundishora funneled resources into redundant, high-paying positions while critical student programs like sports faced funding shortages.\n\nWith ZACC summoning Kundishora for questioning, the probe intensifies scrutiny on administrative malpractice, risking severe repercussions for the duo amid outcry over corruption eroding educational integrity.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| The Zimbabwe Anti-Corruption Commission (ZACC) is investigating Alexandra Park Primary School’s deputy headmistress, Mai Kundishora, and headmaster … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/alexandra-park-primary-school-corruption-scandal-under-zacc-investigation/\">Continue reading<span class=\"screen-reader-text\"> \"Alexandra Park Primary School Corruption Scandal Under ZACC Investigation\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "Tips For Pedestrians …",
            "url": "https://www.zimeye.net/2025/03/27/tips-for-pedestrians/",
            "content": "When walking along the road, it is crucial to prioritize your safety by always walking facing oncoming vehicles. By doing so, you enhance your ability to see approaching traffic and stay aware of your surroundings, relying on both your sight and hearing to assess potential dangers. This simple precaution allows you to step aside or into a safe area, such as a ditch, if a vehicle unexpectedly loses control.\n\nWalking with your back to traffic, on the other hand, puts you in a vulnerable position. In such a scenario, you would have to rely only on your ears to detect a vehicle approaching from behind, which can be risky. A driver may unintentionally hit you without you being aware of their presence, especially if they are speeding or driving too close to the edge of the road.\n\nAdditionally, to avoid the dangers of distracted walking, always keep your focus on the road ahead rather than on your mobile phone. While listening to music or podcasts can make your walk more enjoyable, it can be risky if it prevents you from hearing nearby vehicles. A simple solution is to keep one earphone out, ensuring you can still listen for approaching cars while enjoying your walk.\n\nWhile walking facing oncoming traffic is generally the safest option, its important to note that some areas, such as hills or sharp curves, may make this practice dangerous. In such areas, visibility is limited, and both you and oncoming vehicles may not see each other until its too late. In these situations, walking on the opposite side of the road might be the safer choice.\n\nBy staying alert, walking facing traffic, and avoiding distractions, you can significantly reduce the risk of accidents and ensure a safer walking experience.\n\nProduced bySafety and Victims Advocacy Foundation (The Gambia)\n\nIn collaboration with The Traffic Pulse Newsletter\n\nThe Traffic Pulse Newsletter\n\nInstagram : traff.icpulse\n\nX: @TPulsezim\n\nLinkedIn : Traffic Pulse Zim\n\nemail :[emailprotected]\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "When walking along the road, it is crucial to prioritize your safety by always walking facing oncoming vehicles. By doing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/tips-for-pedestrians/\">Continue reading<span class=\"screen-reader-text\"> \"Tips For Pedestrians …\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "Mwenezi Horror: Police Open Fire On Vehicle, Killing 21- Year Old",
            "url": "https://www.zimeye.net/2025/03/27/mwenezi-horror-police-open-fire-on-vehicle-killing-21-year-old/",
            "content": "By A Correspondent\n\nA tragic incident unfolded in Mwenezi, Zimbabwe, when police officers opened fire on a vehicle, resulting in the death of a 21-year-old passenger, Shadreck Madzore.\n\nThe incident occurred near Rutenga along the Masvingo-Beitbridge Highway, an area notorious for robberies and carjackings.\n\nAccording to eyewitnesses, the vehicle, a pick-up truck, was flagged down by an unmarked Toyota Probox car, which was later revealed to be a police vehicle.\n\nFearing for their safety, the driver sped off, leading to a high-speed chase.\n\nThe police officers pursued the vehicle, ultimately opening fire and striking Madzore twice.\n\nThe relatives of the deceased have expressed outrage over the incident, accusing the police of overreacting and misusing their firearms.\n\nSamson Madzore, the deceaseds uncle, stated that the driver had replaced a punctured tire and proceeded with caution, only to be flagged down by the suspicious vehicle.\n\nFearing robbery, the driver fled, leading to the tragic consequences.\n\nThe incident has raised concerns about police brutality and the use of excessive force. The Zimbabwe Republic Police have yet to comment on the matter, leaving many questions unanswered.\n\nIn a region plagued by crime, the incident highlights the need for increased transparency and accountability within law enforcement agencies.\n\nAs the investigation unfolds, the family and community of Shadreck Madzore await justice and answers.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A tragic incident unfolded in Mwenezi, Zimbabwe, when police officers opened fire on a vehicle, resulting in … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/mwenezi-horror-police-open-fire-on-vehicle-killing-21-year-old/\">Continue reading<span class=\"screen-reader-text\"> \"Mwenezi Horror: Police Open Fire On Vehicle, Killing 21- Year Old\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "No Going Back On Anti-Mnangagwa Protests, Geza Declares",
            "url": "https://www.zimeye.net/2025/03/27/no-going-back-on-anti-mnangagwa-protests-geza-declares/",
            "content": "Tinashe Sambiri\n\nIn a powerful address to the nation on Wednesday night, war veteran Blessed Geza vowed to take action against those he referred to as Zvigananda surrounding President Emmerson Mnangagwa.\n\nGeza also reaffirmed that the planned protests on March 31 would proceed as scheduled.\n\nBelow is the full statement from Geza:\n\nI am Blessed Geza, Cde Bombshell. I have returned. Our March 31st protests are going ahead as planned. We see that certain individuals around President Mnangagwa are causing trouble for the people, particularly farmers, who are struggling to get paid. These problems are being created by them, and Im here to name them.\n\nFirst, we start with Kudakwashe Tagwirei. He wants to become president after Auxillia Mnangagwas turn. He is the one taking all the government contracts, controlling many companies.\n\nNext, theres Wicknell Chivayo. This man has no proper business credentials but calls himself Sir Wicknell Chivayo. He secures tenders and gets paid in advance. President Mnangagwa says he has his own money, but the Gwanda project remains a mysterythe funds just disappeared, and Chivayo is protected by ED.\n\nThen there is Pedzai Scott Sakupwanya, who charges 7% to share the loot with ED.\n\nGeorge Guvamatanga is another one. He takes 10% of deals and has bought properties all over the worldSouth Africa, the UK, Canadaall funded by your money.\n\nAnother name is Julius Charumbira, located in Newlands.\n\nJohn Panonetsa Mangudya, former Reserve Bank Governor, is my young man.\n\nThen theres Mthuli Ncube, the Minister of Finance.\n\nObey Chimuka is another person in this circle.\n\nTheres a thief called Tungwarara, who I despise. He disrespects those who fought for the country. Cant you see he has no respect for the blood that was shed for this country?\n\nDouglas Kwande, a close friend of ED, is yet another Zvigananda, taking peoples money.\n\nLets talk about political criminals. The first on the list is Daniel Garwe, a former Selous Scout, who will soon be exposed. He is the one who called comrades dogs or bokki.\n\nOwen Mudha Ncube is another criminal. He doesnt even have a Grade 7 education and is responsible for the killings of generals. Hes at the forefront of terrorizing children and taking peoples money. One of his other tasks is to target young girls at MSU.\n\nThen there is Tatenda Mavetera, the Minister of ICT. Her history with ED is well-known. And Mabel Chinonona, a disaster of a war veteran, who despises fellow war veterans. Some say she was sent by the Special Branch, and we question whether she is truly a comrade.\n\nJacob Mudenda wants to be made Vice President and is behind Tshabangus agenda. He is the one who approached the peoples choice MPs to align with the 2030 agenda.\n\nTino Machakaire, Minister of Youth, is also part of this corrupt circle.\n\nChristopher Mutsvangwa, the ZANU PF spokesperson and my friend, needs to reconsider his role. Chris, we see you placing ED above your comrades, but what has ED done for the war veterans?\n\nThen there is John Paradza, the young boy with no education, and Lovemore Matuke, whose father betrayed many people in Gutu. Matukes association with ED is suspicious, given EDs past as a spy for the Rhodesia Front.\n\nEzra Chadzamira is another name to note. You can see the kinds of people ED surrounds himself with.\n\nGoodwills Masimirembwa, a lawyer turned land baron, continues to hold onto the 2030 agenda.\n\nPolite Kambamura, Ziyambi Ziyambi, and Edson Chiherende, the Midlands ZANU PF chairman, are further examples of the rot within.\n\nThere are other criminals too, like Munyaradzi Machacha, whose actions have embarrassed us. Hes my nephew, but in matters of national importance, theres no favoritism.\n\nDouglas Mahiya has a war veterans league project but was involved in plans to remove war veterans along Shamva Road.\n\nWe also have fake prophets such as Uebert Angel, who is involved in the Gold Mafia, Ed Branson, and Winston Chitando, who started well but has since fallen.\n\nJenfan Muswere is a complete failure; his rise to minister is a mystery. Anxious Masuka is involved in shady land deals. And July Moyo? Well, we wont waste time with him, as he is known to be a CIA agent.\n\nKazembe Kazembe is another unworthy figure, one Ive spoken about before. If you look closely, youll see that ED is anti-comrades, and the people around himsuch as the Kazembesare questionable.\n\nRichard Moyo, who loves ED so much, is playing a dangerous role in destroying Matebeleland.\n\nThese are the people who are plundering Zimbabwe.\n\nWe are not just talking; we are taking action. We will hold these criminals accountable. Buy data, and you will see what we do. We will not be intimidated by this group. There are 16 million of us, and we will show them the power of the people.\n\nIm just saying a few words today, but wait for our actions. Youll see us in action soon enough. It hurts us as comrades to see this betrayal.\n\nTo you, Mnangagwa: we are dealing with you on March 31. But these others, we are dealing with them from today. They will regret their actions. They will be the ones demanding your removal.\n\nAs war veterans, weve come to a painful realization. Weve let you down, and we allowed these nationalists to damage you. They made sure real war veterans were reduced to poverty. We apologize for failing you, but today we see the truth. We cannot stand by and let the criminals take control of this country. We will continue the fight started by those who died at Nyadzonya, Chimoio, and other places. What did they die for if we let this country be handed over to criminals?\n\nIts been 40 years, and the time has come for us to take back our country. We want to leave it in a better place. The task of removing Mnangagwa has already begun.\n\nOn March 31, from Plumtree to Mutare, from Zambezi to Limpopo, we call on everyone to take to the streets and remove Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri In a powerful address to the nation on Wednesday night, war veteran Blessed Geza vowed to take action … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/no-going-back-on-anti-mnangagwa-protests-geza-declares/\">Continue reading<span class=\"screen-reader-text\"> \"No Going Back On Anti-Mnangagwa Protests, Geza Declares\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "Bombshell Geza Accuses Mnangagwa Of Preying On Young Girls At Midlands State University",
            "url": "https://www.zimeye.net/2025/03/27/bombshell-geza-accuses-mnangagwa-of-preying-on-young-girls-at-midlands-state-university/",
            "content": "Tinashe Sambiri\n\nIn a shocking revelation, war veteran Blessed Geza, known as Bombshell, accused President Emmerson Mnangagwa of exploiting young girls at Midlands State University (MSU), with the help of his associate Owen Mudha Ncube.\n\nIn a direct and powerful address to the nation on Wednesday night, Geza vowed to take action against the individuals surrounding Mnangagwa, whom he labeled as Zvigananda, while reiterating that the protests scheduled for March 31 would proceed as planned.\n\nGezas full statement follows:\n\nI am Blessed Geza, Cde Bombshell, and I have returned. The protests on March 31 will take place as scheduled. We are witnessing a group of people surrounding Mnangagwa who are causing severe hardships for our citizens, particularly farmers who struggle to get paid. These issues are being created by these individuals, and I am here to expose them.\n\nFirst, let me name Kudakwashe Tagwirei, who harbors ambitions to become president after Auxillia Mnangagwas turn. He is monopolizing government contracts and controlling numerous companies.\n\nNext, theres Wicknell Chivayo, who calls himself Sir Wicknell but lacks any legitimate business credentials. He secures tenders and demands upfront payments. While President Mnangagwa claims to have his own funds, the Gwanda project remains a mysterythe money disappeared, and Chivayo is being protected by ED.\n\nAnother name to mention is Pedzai Scott Sakupwanya, who reportedly takes a 7% cut to share illicit profits with ED.\n\nWe also have George Guvamatanga, who pockets 10% of deals and has invested in properties globallySouth Africa, the UK, Canadaall funded by the peoples money.\n\nAnd then theres Julius Charumbira, currently based in Newlands, and John Panonetsa Mangudya, the former Reserve Bank Governor, who I consider my young man.\n\nMthuli Ncube, the Finance Minister, is part of this corrupt group, along with Obey Chimuka.\n\nOne individual I truly despise is Tungwarara, a thief who has no regard for the sacrifices made by those who fought for our country. His actions show he cares nothing for the blood shed in the liberation struggle.\n\nDouglas Kwande, a close friend of ED, is another opportunist in this group of Zviganandas, siphoning off the peoples resources.\n\nNow, lets talk about political criminals. Daniel Garwe, a former Selous Scout, will soon be exposed for his crimes. Hes the same person who insulted comrades by calling them dogs or bokki.\n\nOwen Mudha Ncube is another criminal I want to expose. He lacks even a Grade 7 education and is linked to the killings of generals. Hes involved in terrorizing children and stealing from the people. More disturbingly, hes reportedly responsible for bringing young girls to Mnangagwa. We know that Mnangagwa has impregnated young girls at MSU through Ncubes actions.\n\nTatenda Mavetera, the Minister of ICT, has a questionable past linked to ED. Mabel Chinonona, a so-called war veteran, harbors hatred for fellow comrades. Some suspect she was sent by the Special Branch, and we wonder if she is truly a comrade.\n\nJacob Mudenda, who seeks the position of Vice President, is behind the Tshabangu agenda. Hes the one who approached MPs who were chosen by the people to align with the 2030 vision.\n\nTino Machakaire, the Minister of Youth, is also entangled in this corrupt network.\n\nChristopher Mutsvangwa, the ZANU PF spokesperson and a former comrade of mine, needs to reflect on his actions. Chris, we see you placing Mnangagwa above your fellow comrades, but we ask: what has Mnangagwa done for war veterans?\n\nThen theres John Paradza, a young man without an education, and Lovemore Matuke, whose father betrayed people in Gutu. Matukes ties with ED are suspicious given EDs past as a spy for the Rhodesia Front.\n\nEzra Chadzamira is another individual who is part of this corrupt system. You can see who is behind Mnangagwas administration.\n\nGoodwills Masimirembwa, a disbarred lawyer turned land baron, clings to the 2030 agenda, while Polite Kambamura, Ziyambi Ziyambi, and Edson Chiherende, the Midlands ZANU PF chairman, are other prime examples of corruption.\n\nThere are other criminals too, such as Munyaradzi Machacha, whose actions have embarrassed me. Though hes my nephew, I will not show favoritism when it comes to matters of national importance.\n\nDouglas Mahiya, with his war veterans league project, was involved in attempts to remove war veterans along Shamva Road.\n\nWe also see fraudulent prophets like Uebert Angel, involved in the Gold Mafia, Ed Branson, and Winston Chitando, who has lost his way.\n\nJenfan Musweres rise to minister is a mystery, and Anxious Masuka is implicated in shady land deals. As for July Moyo, I wont waste time on himhes known to be a CIA agent.\n\nKazembe Kazembe is another one of these individuals. If you observe closely, youll see that Mnangagwa is anti-comrade. The people around him, including Kazembe, are part of the problem.\n\nRichard Moyo, who is blindly loyal to ED, is playing a dangerous role in destroying Matebeleland.\n\nThese are the people who are looting Zimbabwe.\n\nWere not just talkingwe are taking action. We will hold these criminals accountable. If you buy data, you will see our next steps. We are not afraid of this group. There are 16 million of us, and we will show them the power of the people.\n\nI am speaking today, but wait for whats coming next. Youll see us in action soon enough. It pains us as comrades to witness this betrayal.\n\nTo you, Mnangagwa: we will deal with you on March 31. But as for the others, were starting with them today. They will regret their actions. They will be the ones asking you to step down.\n\nAs war veterans, weve come to a painful realization: we let you down, and we allowed these nationalists to damage you. Theyve reduced real war veterans to poverty. We apologize for that failure, but today we see the truth. We cannot allow criminals to continue destroying our country. We will honor the memory of those who fought and died at places like Nyadzonya and Chimoio. What did they die for if we let this country fall into the hands of criminals?\n\nIts been 40 years, and now its time to reclaim our country. We want to leave it in a better place. The task of removing Mnangagwa has already begun.\n\nOn March 31, from Plumtree to Mutare, from Zambezi to Limpopo, we call on every Zimbabwean to hit the streets and demand the removal of Mnangagwa.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri In a shocking revelation, war veteran Blessed Geza, known as “Bombshell,” accused President Emmerson Mnangagwa of exploiting young … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/bombshell-geza-accuses-mnangagwa-of-preying-on-young-girls-at-midlands-state-university/\">Continue reading<span class=\"screen-reader-text\"> \"Bombshell Geza Accuses Mnangagwa Of Preying On Young Girls At Midlands State University\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "Controversial Preacher Passion Java Mocks Zimbabweans, Says Mnangagwa Here To Stay",
            "url": "https://www.zimeye.net/2025/03/27/controversial-preacher-passion-java-mocks-zimbabweans-says-mnangagwa-here-to-stay/",
            "content": "By A Correspondent\n\nControversial preacher Panganai Java, widely known as Prophet Passion, has caused an uproar after mocking Zimbabweans and dismissing the current opposition to President Emmerson Mnangagwas administration.\n\nJava, known for his bold and often divisive statements, insisted that Mnangagwa is here to stay while taking jabs at war veteran Blessed Geza, who is leading protests against the governments handling of the countrys socio-economic issues.\n\nIn a statement shared on social media, Java ridiculed Geza and the opposition to Mnangagwas rule, which has been escalating ahead of a planned protest on March 31.\n\nGeza, who has become a symbol of resistance, is pushing for an uprising against what he perceives as an oppressive regime, particularly focusing on Mnangagwas third-term ambitions.\n\nJavas remarks were particularly harsh. 31 March Musakanganwe kubvisa rent .    Pamberi Na E.D, he said, which loosely translates to Dont forget to pay rent on March 31 Pamberi Na E.D  a phrase suggesting that nothing will come of the protests and mocking the demonstrators efforts. His comment was followed by a mocking reference to Geza, stating: Geza anoda kubvisa hurumende ne Data, meaning Geza wants to overthrow the government with data  referring to the use of social media and online platforms in organizing protests.\n\nJavas statement has stirred a backlash, with many Zimbabweans criticizing him for being out of touch with the hardships faced by ordinary citizens. His comments were perceived as minimizing the struggles of people who have been vocal about the economic challenges, inflation, and human rights abuses under the Mnangagwa administration.\n\nOn the other hand, some supporters of the preacher rallied behind his statements, claiming that Mnangagwas leadership is stable and that opposition efforts are futile. Despite the backlash, Java remains steadfast in his support for Mnangagwa, further fueling the division between the preachers followers and his critics.\n\nAs Zimbabwe approaches the end of the month, all eyes will be on the March 31 protests led by Geza, and the broader national response to calls for change. However, with figures like Java vocally dismissing these efforts, it remains unclear how the situation will evolve as the tension continues to build.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Controversial preacher Panganai Java, widely known as Prophet Passion, has caused an uproar after mocking Zimbabweans and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/controversial-preacher-passion-java-mocks-zimbabweans-says-mnangagwa-here-to-stay/\">Continue reading<span class=\"screen-reader-text\"> \"Controversial Preacher Passion Java Mocks Zimbabweans, Says Mnangagwa Here To Stay\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "We Are Not Afraid Of Vanovukura, Says Mnangagwa",
            "url": "https://www.zimeye.net/2025/03/27/we-are-not-afraid-of-vanovukura-says-mnangagwa/",
            "content": "By A Correspondent\n\nMr Emmerson Mnangagwa on Wednesday addressed members of the Zanu PF party at the partys headquarters, where he chaired a Politburo meeting.\n\nIn his remarks, Mnangagwa emphasized the importance of focusing on the well-being and development of the people of Zimbabwe, urging party members to be responsive to the needs of the nation.\n\nWe must walk alongside the people, understand their challenges, and work towards uplifting their livelihoods, said Mnangagwa.\n\nThe needs and aspirations of the people should always be at the core of our priorities.\n\nMnangagwa also stressed Zimbabwes commitment to remaining a constitutional democracy, affirming the nations sovereignty and peace. Zimbabwe will forever be a constitutional democracy and sovereign nation, he stated.\n\nMnangagwa added, With all of us living in peace and harmony. Vanowukura ngava wukure havo nyika ichienda mberi, which loosely translates to, Those who seek to disturb us will be left behind as the country moves forward.\n\nHis comments appeared to be directed at war veteran Blessed Geza\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Mr Emmerson Mnangagwa on Wednesday addressed members of the Zanu PF party at the party’s headquarters, where … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/we-are-not-afraid-of-vanovukura-says-mnangagwa/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Not Afraid Of Vanovukura, Says Mnangagwa\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        },
        {
            "title": "Mnangagwa Discredits His Presidency with Unlawful Military Transfer of Sanyatwe, Violates Constitution",
            "url": "https://www.zimeye.net/2025/03/27/mnangagwa-discredits-his-presidency-with-unlawful-military-transfer-of-sanyatwe-violates-constitution/",
            "content": "27 March 2025 | Harare\n\nBy A Correspondent | In a stunning affront to constitutional governance, President Emmerson Mnangagwa has discredited his own presidency by unlawfully transferring the Commander of the Zimbabwe National Army, Lieutenant General Anselem Nhamo Sanyatwe, to a ministerial post  in clear violation of the Constitution of Zimbabwe and established military protocol.\n\nOn 25 March 2025, the Office of the President announced that Sanyatwe had been retired from the Zimbabwe Defence Forces and simultaneously appointed Minister of Sport, Recreation, Arts and Culture. However, legal analysts and senior military insiders have decried the move as not only premature but outright illegal.\n\nConstitutional Breach\n\nAccording to Section 216 of the Constitution, the Presidents command over the Defence Forces must be exercised in accordance with this Constitution and the law. The law referred to here includes the Defence Act [Chapter 11:02], which provides the legal framework for retiring or transferring military officers. Crucially, it mandates a formal process, including notification of Parliament and the confirmation of a handover, neither of which occurred.\n\nThe command of the Defence Forces must be exercised in accordance with this Constitution and the law.  Section 216, Constitution of Zimbabwe\n\nSources in Parliament confirmed that no notice of Sanyatwes retirement had been received by either the Speaker of the National Assembly or the Clerk of Parliament by 27 March 2025. In addition, no successor has been named, meaning that by operation of law, Sanyatwe remains the lawful Commander of the Zimbabwe National Army.\n\nThis makes his appointment to a Cabinet post a direct contravention of Section 208(2)(a), which explicitly prohibits active members of the security services from engaging in partisan activities or holding political office:\n\nNeither the security services nor any of their members may, in the exercise of their functions (a) act in a partisan manner  Section 208(2), Constitution of Zimbabwe\n\nBy placing a serving army general into a civilian ministerial post, Mnangagwa has fused military and political authority in a manner reminiscent of unconstitutional regimes and coups. Zimbabwes post-liberation constitutional order was built precisely to prevent such abuses.\n\nIllegitimate Cabinet Appointment\n\nFurthermore, Section 104(3) of the Constitution stipulates that ministers may only be appointed from Parliament or from among civilians chosen for their professional skills. Appointing a currently serving army officer  who has not been formally retired, nor whose position has been legally vacated  blatantly undermines this provision:\n\nMinisters and Deputy Ministers are appointed from among Senators or Members of the National Assembly, but up to five may be appointed from outside Parliament.  Section 104(3), Constitution of Zimbabwe\n\nThe legal principle here is clear: one cannot serve in the military while holding political office. To do so is not only a breach of democratic separation of powers, but an offense against constitutionalism and civilian supremacy over the armed forces.\n\nPresidency in Crisis\n\nMnangagwas unlawful manoeuvre has set a dangerous precedent and raises serious doubts about the legal credibility of his administration. By subverting the Constitution, the President has discredited the legitimacy of his Cabinet, his commitment to the rule of law, and the integrity of the Office of the President.\n\nLegal experts argue that the actions are ultra vires  beyond the powers legally afforded to the President  and thus null and void.\n\nThis isnt just an error of judgment, said one senior constitutional lawyer. Its a reckless constitutional breach that may trigger judicial review or even impeachment proceedings if Parliament acts on its oversight obligations.\n\nThe Stakes Ahead\n\nThe gravity of the moment cannot be overstated. Zimbabwe is facing growing public unrest ahead of planned nationwide protests on 31 March. With this reckless act, Mnangagwa may have not only weakened his command over the military, but also undermined the fragile constitutional order that has kept civilian government intact.\n\nThe people of Zimbabwe, the courts, and Parliament must now decide whether this presidency  stained by illegality  can still claim the moral and constitutional authority to lead.\n\nENDS\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "27 March 2025 | Harare By A Correspondent | In a stunning affront to constitutional governance, President Emmerson Mnangagwa has … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/03/27/mnangagwa-discredits-his-presidency-with-unlawful-military-transfer-of-sanyatwe-violates-constitution/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Discredits His Presidency with Unlawful Military Transfer of Sanyatwe, Violates Constitution\"</span></a></p>",
            "time": "18:32",
            "date": "28 Mar 2025"
        }
    ]
}