{
    "news": [
        {
            "title": "Zanu PF Convenes Politburo Meeting As Factional Fights Continue",
            "url": "https://www.zimeye.net/2025/04/30/zanu-pf-convenes-politburo-meeting-as-factional-fights-continue/",
            "content": "Tinashe Sambiri\n\nZANU PF is set to convene a Politburo meeting on Friday, May 2, 2025, as internal party conflicts continue to intensify behind the scenes.\n\nThe announcement was made by the partys Secretary for Information and Publicity, Ambassador Christopher Mutsvangwa, who relayed the notice from Secretary-General Dr. Obert Mpofu.\n\nThe secretary-general of ZANU PF Dr. Obert Mpofu hereby advises all Politburo members that there will be a Politburo meeting on Friday, 2 May 2025 at 1000hrs. The meeting will be held at the permanent home of the revolution, ZANU PF headquarters, Mutsvangwa stated.\n\nMembers are expected to be seated by 9:45 AM. While the official agenda is to address general party business, the meeting comes at a time when factional divisions within the ruling party are reportedly growing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri ZANU PF is set to convene a Politburo meeting on Friday, May 2, 2025, as internal party conflicts … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/zanu-pf-convenes-politburo-meeting-as-factional-fights-continue/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Convenes Politburo Meeting As Factional Fights Continue\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "Mnangagwa Goes For Trevor Ncube",
            "url": "https://www.zimeye.net/2025/04/30/mnangagwa-goes-for-trevor-ncube/",
            "content": "By Crime andCourtsReporter-President Emmerson Mnangagwas administration is escalating its crackdown on dissenting media voices by targeting prominent media mogul and former presidential advisor Trevor Ncube.\n\nAuthorities have indicated they will charge Ncubes online broadcaster,Heart and Soul TV(HSTV), alongside journalist Blessed Mhlanga, who has been detained for over two months.\n\nThe move signals a deepening fallout between Ncube and the Mnangagwa regime, years after the media entrepreneurthrew his weight behindthe 2017 military coup that ousted the late Robert Mugabe and brought Mnangagwa to power.\n\nOn Wednesday, Chris Mhike, one of Mhlangas lawyers, told reporters that the state had officially notified them of its intention to include HSTVan Alpha Media Holdings (AMH) subsidiaryin the charges Mhlanga is facing.\n\nThe charges relate to a series ofbroadcastinterviews where Mhlanga hosted war veteran Blessed Geza, who openly called for Mnangagwas resignation and rejected suggestions that the president should remain in power until 2030.\n\nThe state has pronounced that HSTV, theorganisationthat employs Blessed Mhlanga, will be a co-accused, Mhike said. Charges are going to belevelledagainst this media house in respect of the same allegations Mhlanga is facing.\n\nMhlangas trial is now scheduled to begin on May 14.\n\nHis legal team had objected to further delays, but prosecutors abruptly announced they were ready for trial following a lunch adjournment.\n\nMhikealso noted that the trial date was set despite prior notice that his preferred counsel would be unavailableat that time.\n\nThe charges against HSTV come amid growing tensions between Mnangagwa and Ncube, who publicly disavowed the regime he once supported.\n\nNcube resigned from the Presidential Advisory Council (PAC) in 2019, saying his advice was consistently ignored.\n\nSpeaking recently at the BizNews Conference in Drakensberg, South Africa, Ncube admitted regret over backing the 2017 coup. I was one of those people who said give Emmerson Mnangagwa a chanceand how wrong I was, he said. I thought maybe, having witnessed Mugabes failures up close, he [Mnangagwa] would turn things around. Again, I was disappointed.\n\nNcube owns several media outlets under AMH, includingThe StandardandNewsDay.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter-President Emmerson Mnangagwa’s administration is escalating its crackdown on dissenting media voices by targeting prominent media mogul and … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/mnangagwa-goes-for-trevor-ncube/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Goes For Trevor Ncube\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "Chitungwiza Man Gruesomely Murdered In Suspected Satanism Rituals",
            "url": "https://www.zimeye.net/2025/04/30/chitungwiza-man-gruesomely-murdered-in-sspected-satanism-rituals/",
            "content": "By A Correspondent| A 44-year-old Chitungwiza man, Kudzanai Nyambuya was abducted, callously and brutally murdered on Thursday 24 April 2025 along Masvingo road by unknown assailants who were driving a white commuter omnibus.\n\nWhat has set tongues wagging is the nature of the murder that resembled primitive ritualism.\n\nCircumstances are that on the fateful day, as was his routine, Nyambuya, who worked for Nattie group of colleges as a chef, set out for work around 5 am from Southlea Park suburb where he was staying at the time.\n\nUnbeknown to him, Nyambuya boarded a commuter omnibus to Harare Central business district.\n\nAs soon as he boarded the kombi, the driver reportedly turned and headed towards Masvingo.\n\nThe yet to be identified assailants immediately tied up Nyambuya, sodomised, and injected him with an unknown substance.\n\nWhen Nyambuya fell unconscious, the assailants proceeded to drain his blood using unknown instruments.\n\nAccording to reports recorded through the victims own statement to the police, the assailants turned towards Harare.\n\nIt is said that when the victim regained consciousness, the ritualists told him, mudhara zvadhakwa( this is the end).\n\nThey then forced him to drink rat poison mixed with another chemical before dumping him at St Peters Highfield old cemetery.\n\nNyambuya was discovered by a good Samaritan in a conscious state and was taken to Highfield police station.\n\nHe was taken to Harare hospital where he died while still in the emergency room.\n\nThe medical personell at the hospital say they couldn`t find a single vein since most of the blood had been drained.\n\nWhat makes the whole story weird is the fact that the assailants took nothing from him including his mobile phone and money leading eyewitnesses to suspect ritualism.\n\nCases of this nature are on the rise in Zimbabwe as armed robbers and ritualists go for easy money.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| A 44-year-old Chitungwiza man, Kudzanai Nyambuya was abducted, callously and brutally murdered on Thursday 24 April 2025 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/chitungwiza-man-gruesomely-murdered-in-sspected-satanism-rituals/\">Continue reading<span class=\"screen-reader-text\"> \"Chitungwiza Man Gruesomely Murdered In Suspected Satanism Rituals\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "Arsenal Close In on Zubimendi as Real Madrid Shift Focus to Mac Allister",
            "url": "https://www.zimeye.net/2025/04/30/arsenal-close-in-on-zubimendi-as-real-madrid-shift-focus-to-mac-allister/",
            "content": "Sports Correspondent\n\nReal Madrids hopes of signing Real Sociedad midfielder Martn Zubimendi appear to be slipping away, with the Spanish international reportedly agreeing to join Arsenal, according to MARCA.\n\nZubimendi, known for his calm presence and tactical discipline, had been identified by Madrid as a potential heir to veteran Luka Modri. However, Arsenal, under Mikel Artetas leadership, have moved swiftly and decisively in their pursuit of the 25-year-old.\n\nThe Gunners are reportedly ready to activate Zubimendis 60 million release clause, viewing him as a long-term successor to Jorginho, who is expected to depart the Emirates soon.\n\nWith Zubimendi now likely heading to North London, Real Madrid are turning their attention to Liverpool midfielder Alexis Mac Allister. However, any potential deal could prove difficult, as the Argentine is under contract until 2028 and Liverpool are expected to demand a high fee.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Real Madrid’s hopes of signing Real Sociedad midfielder Martín Zubimendi appear to be slipping away, with the Spanish … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/arsenal-close-in-on-zubimendi-as-real-madrid-shift-focus-to-mac-allister/\">Continue reading<span class=\"screen-reader-text\"> \"Arsenal Close In on Zubimendi as Real Madrid Shift Focus to Mac Allister\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "AMH’s HSTV to be charged alongside incarcerated journalist Blessed Mhlanga",
            "url": "https://www.zimeye.net/2025/04/30/amhs-hstv-to-be-charged-alongside-incarcerated-journalist-blessed-mhlanga/",
            "content": "By A Correspondent | ZimEye | In a twist of events the state has confirmed its intention to take action against Alpha Media Holdings (AMH)s subsidiary, Heart and Soul TV (HSTV).\n\nThe television station will face joint charges alongside journalist Blessed Mhlanga for allegedly disseminating messages that incite public violence.\n\nMhlanga is accused of publishing a press conference held by Zanu PF member and war veteran Blessed Geza, who is currently fleeing law enforcement.\n\nDuring this press conference, Geza called for President Emmerson Mnangagwa to resign and contested suggestions for him to remain in power until 2030.\n\nOn Wednesday the state said Mhlangas trial will start on May 14 adding that HSTV will also be charged.\n\nThe state was supposed to give a trial date and allocate the matter to a trial court.\n\nInitially the state had indicated that they needed one more postponement, but the state has now decided to rope in HSTV.\n\nThe state has pronounced that HSTV, the organisation that employs Blessed Mhlanga, will be a co-accused.\n\nCharges are going to be leveled against this media house called HSTV in respect of the charges that Blessed is facing, Mhike told reporters at the court on Wednesday.\n\nMhlangas lawyer had challenged the postponement of the proceedings, as they were assured that a trial date would be established on Wednesday.\n\nHowever, following a lunch break, the state revealed that it was prepared for trial.\n\nThey suddenly changed their position to say they are suddenly ready to go to trial and allocated May 14 as the trial date, Mhike stated.\n\nHe added that despite the indication that his preferred attorney would be out of the country, prosecutors insisted on maintaining the 14th as the date.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | In a twist of events the state has confirmed its intention to take action … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/amhs-hstv-to-be-charged-alongside-incarcerated-journalist-blessed-mhlanga/\">Continue reading<span class=\"screen-reader-text\"> \"AMH’s HSTV to be charged alongside incarcerated journalist Blessed Mhlanga\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "Gunners Fall At Home",
            "url": "https://www.zimeye.net/2025/04/30/gunners-fall-at-home/",
            "content": "Sports Correspondent\n\nParis Saint-Germain claimed a narrow but vital 1-0 victory over Arsenal in the first leg of their UEFA Champions League semi-final on Tuesday, with Ousmane Dembls early strike proving decisive at the Emirates Stadium.\n\nDembl gave PSG the perfect start just four minutes in, smashing a shot off the post and into the net after a dominant opening spell from the French champions. Luis Enriques side maintained control early on and showed resilience late in the match to preserve their lead.\n\nArsenal, appearing in their first Champions League semi-final since 2009, struggled to find rhythm in the opening half but grew into the contest. Mikel Merino thought he had pulled the hosts level in the second half, only for his goal to be ruled out. PSG goalkeeper Gianluigi Donnarumma was also key, producing several crucial saves to deny the Gunners an equaliser.\n\nDespite surviving a period of intense Arsenal pressure, PSG missed chances to extend their advantage. Bradley Barcola and Gonalo Ramos both failed to convert clear opportunities late in the match, leaving the tie finely balanced ahead of the return leg in Paris.\n\nIf PSG can hold onto their lead in next Wednesdays second leg, they will book a spot in the final in Munich, where either Inter Milan or Barcelona awaits. With momentum on their side, the Parisians are daring to dream of their first Champions League crown.\n\nIt was a great night for the group, PSG midfielder Vitinha said after the match. We had the ball for most of the game. We had to adapt to the different circumstances of the match and we did, defending and attacking well.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Paris Saint-Germain claimed a narrow but vital 1-0 victory over Arsenal in the first leg of their UEFA … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/gunners-fall-at-home/\">Continue reading<span class=\"screen-reader-text\"> \"Gunners Fall At Home\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "As Regime Continues To Terrorize Citizens, Mutsvangwa Claims Zim A Safe Investment Destination",
            "url": "https://www.zimeye.net/2025/04/30/as-regime-continues-to-terrorize-citizens-mutsvangwa-claims-zim-a-safe-investment-destination/",
            "content": "By A Correspondent\n\nDespite ongoing reports of political repression and economic instability, ZANU PFs Secretary for Information and Publicity, Ambassador Christopher Mutsvangwa, boldly declared Zimbabwe a secure and promising destination for international investors.\n\nSpeaking during the closing ceremony of the 65th edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo last week, Mutsvangwa praised President Emmerson Mnangagwas leadership, attributing the events perceived global success to what he described as the Presidents forward-looking vision.\n\nThe 65th Edition of ZITF has been a globally successful event because of the visionary leadership of His Excellency President E.D. Mnangagwa, Mutsvangwa stated.\n\nHe claimed Zimbabwes appeal to investors lies in its natural endowments and a skilled labour force. Zimbabwe is a safe destination hub for economic development. Behind our highly productive workforce is a vast stock of natural resources, he said.\n\nMutsvangwa also highlighted current partnerships with international firms, singling out U.S.-based Starlink as a symbol of confidence in Zimbabwes business environment. Starlink is operating successfully in the country, providing internet as a product and bridging digital access gaps in both rural and urban areas, he said.\n\nHis remarks, however, come amid widespread criticism of the governments crackdown on dissent, continued political arrests, and a deteriorating economyfactors many believe undermine the very investment climate Mutsvangwa seeks to promote.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Despite ongoing reports of political repression and economic instability, ZANU PF’s Secretary for Information and Publicity, Ambassador … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/as-regime-continues-to-terrorize-citizens-mutsvangwa-claims-zim-a-safe-investment-destination/\">Continue reading<span class=\"screen-reader-text\"> \"As Regime Continues To Terrorize Citizens, Mutsvangwa Claims Zim A Safe Investment Destination\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "We Are Taking Decisive Action, Declares Blessed Geza",
            "url": "https://www.zimeye.net/2025/04/30/we-are-taking-decisive-action-declares-blessed-geza/",
            "content": "By A Correspondent\n\nPolitical activist and whistleblower Blessed Geza has launched a stinging attack on Zimbabwes ruling elite, accusing businessman Kudakwashe Tagwirei of leading a grand-scale looting operation under the protection of President Emmerson Mnangagwa.\n\nIn a no-holds-barred address following the Zimbabwe International Trade Fair (ZITF), Geza alleged that Tagwireis meteoric rise to wealth was not the result of enterprise but of state-sanctioned plunder. People must understand where Tagwireis riches came from. He began with one fuel station called Takunda, Geza said. Then came Command Agriculture. Turns out, that was public money he never gave back.\n\nGeza painted a picture of a corruption empire built on the backs of ordinary citizens, with military-linked companies and national assets allegedly handed over to Tagwirei. Among the state resources named were Sandawana Mine, shares in Great Dyke Investments, and firms in financial distresstransferred, according to Geza, with government approval and no accountability.\n\nHe came back later saying he was selling off Kuvimba, Geza recounted. Then his own outfit, CBZ Capital, steps in and revalues it at 5.4 billion U.S. dollars. And from that cooked-up figure, he and Mnangagwa walked away with 1.9 billion dollarscorrupt money, no lessthrough the Mutapa Investment Fund.\n\nGeza also claimed that Tagwirei was trying to manipulate religious institutions, alleging that the tycoon was now targeting the Seventh-Day Adventist Church for influence through financial donations. He contrasted this with Zimbabwes failing education and healthcare systems. Civil servants are surviving on crumbs, he said. Yet someone who never passed Grade Seven walks off with 540 million dollars just for standing next to Mnangagwa. What kind of system is that?\n\nThe outspoken activist called for nationwide mobilization, urging citizens to back striking lecturers and students. People of Zimbabwe, its time to rise, he declared. Shutdown the country so Mnangagwa is removed. Lets stand together and rebuild our nation.\n\nGeza assured listeners that plans are already in motion to hold corrupt elites accountable. Make no mistakeaction is happening, he insisted. Were moving carefully to avoid unnecessary bloodshed. Our progressive forces are already active on the ground.\n\nAt the time of writing, neither President Mnangagwa nor Tagwirei has issued any response to the damning claims.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Political activist and whistleblower Blessed Geza has launched a stinging attack on Zimbabwe’s ruling elite, accusing businessman … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/we-are-taking-decisive-action-declares-blessed-geza/\">Continue reading<span class=\"screen-reader-text\"> \"We Are Taking Decisive Action, Declares Blessed Geza\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "Mnangagwa Spooks Infiltrate Teachers’ Union Meeting…",
            "url": "https://www.zimeye.net/2025/04/30/mnangagwa-spooks-infiltrate-teachers-union-meeting/",
            "content": "By A Correspondent\n\nA congress convened by the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) was abruptly disrupted earlier this week after government agents stormed the gathering in a bid to intimidate participants and derail proceedings.\n\nHeld at St Martin Mission in Jotsholo, Lupane district, the meeting drew delegates from across the country to discuss the dire state of education and teachers welfare.\n\nHowever, ARTUZ President Obert Masaraure revealed that plainclothes state security operatives attempted to infiltrate and block the event.\n\nOur congress was almost shut down by state security agents, Masaraure told Southern Eye. They insisted on being part of the meeting, and seven of them forced their way in.\n\nThe situation was salvaged thanks to swift legal intervention. ARTUZs lawyer, Doug Coltart, filed for an urgent interdict and notified the police, allowing the congress to proceed under tight scrutiny. Despite the heavy presence of state operatives, Masaraure said the delegates remained resolute.\n\nDelegates were not deterred, and we hope the State agents delivered our unfiltered demands to President Emmerson Mnangagwa in real time, he said defiantly.\n\nDuring the congress, teachers from rural areas vowed to escalate their campaign for fair wages. Masaraure confirmed that educators nationwide are preparing to launch protests when schools reopen. Rural-based teachers will picket at every school in the country on the opening day. We are demanding salaries that reflect our value, he stated.\n\nThe attempted interference by government operatives underscores growing tensions between the state and labour unions, as frustrations mount over poor working conditions and declining education standards in Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A congress convened by the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) was abruptly disrupted earlier this … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/mnangagwa-spooks-infiltrate-teachers-union-meeting/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Spooks Infiltrate Teachers’ Union Meeting…\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        },
        {
            "title": "Zanu PF Official In Masvingo Denied Bail Over Reflecting Allegiance To Geza",
            "url": "https://www.zimeye.net/2025/04/30/zanu-pf-official-in-masvingo-denied-bail-over-reflecting-allegiance-to-geza/",
            "content": "By A Correspondent\n\nFormer Chiredzi Ward 3 councillor and ZANU PF activist Tarusenga Makamba remains behind bars after being denied bail last Wednesday, facing charges of inciting public unrest.\n\nMagistrate Tendai Mutamba ruled against releasing Makamba, who has now spent nearly two weeks in remand prison. He is scheduled to return to court next Wednesday.\n\nThe charges stem from a voice note Makamba allegedly circulated in a ZANU PF WhatsApp group namedNhakayedu, in which he is said to have urged members to brace for changejust days before activist Blessed Bombshell Geza had called for nationwide demonstrations.\n\nAuthorities claim the message, which included the phraseChikomo che Wedza chopfungaira, carried subversive undertones and was meant to stoke political unrest. Prosecutors argue the timing and content of the voice note linked Makamba to the protest plans.\n\nMakamba is being represented by human rights lawyer Ross Chavi from Zimbabwe Human Rights Lawyers, who has yet to comment publicly on the courts decision.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Former Chiredzi Ward 3 councillor and ZANU PF activist Tarusenga Makamba remains behind bars after being denied … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/04/30/zanu-pf-official-in-masvingo-denied-bail-over-reflecting-allegiance-to-geza/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Official In Masvingo Denied Bail Over Reflecting Allegiance To Geza\"</span></a></p>",
            "time": "08:44",
            "date": "01 May 2025"
        }
    ]
}