{
    "news": [
        {
            "title": "Cucsman Announces: I’ve Got So Much Influence Over ZANU PF To Get A Car, Mining Claim, More Than Enzo Ishall, Jah Prayzah",
            "url": "https://www.zimeye.net/2025/07/14/cucsman-announces-ive-got-so-much-influence-over-zanu-pf-to-get-a-car-mining-claim-than-enzo-ishall-jah-prayz/",
            "content": "Activist, Cucsman says Ive got so much influence [in@ZANUPF_Officialto walk away with a car and a mining claim] more than@EnzoIshal@jahprayzah all those other guys@jahprayzahthat have been seen being propped up by@ZANUPF_Official. He is speaking to@TitusTaffyonpic.twitter.com/qxhlZZNYpl\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "GoFundMe Campaigns for Zimbabwean Students Killed En Route to Jah Prayzah Canada Show",
            "url": "https://www.zimeye.net/2025/07/14/gofundme-campaigns-for-zimbabwean-students-killed-en-route-to-jah-prayzah-canada-show/",
            "content": "By Showbiz Reporter Families of the two Zimbabwean students who tragically died in a car crash while on their way to attend Jah Prayzahs concert in Edmonton, Canada, have launched GoFundMe campaigns to raise funds for the repatriation of their bodies.\n\nAnotida Kimberly Maziriri and Eddmore Mafuwe lost their lives in the fatal crash on Saturday night, just hours before the first show of Jah PrayzahsNdini Mukudzeyi World Tourin Canada. The second performance was scheduled for Toronto the following day.\n\nThe heartbreaking news sent shockwaves through the Zimbabwean community, with a swift outpouring of support from the diaspora and well-wishers around the globe. By 5pm Zimbabwean time on Sunday, 201 donors had raised CAD $5,99340% of the CAD $15,000 targetfor Anotida, through a campaign organised by Aisher Magomo. For Eddmore, 83 contributors had donated CAD $3,24322% of the targetin a campaign managed by Tinashe Mazibiye.\n\nJah Prayzah, born Mukudzeyi Mukombe, expressed deep sorrow over the tragedy. In a statement released on Sunday, he said:\n\nNdarwadziwa zvikuru neshoko randafumira kugamuchira. I have learnt of the passing of two young fans of mine To think they never made it to that moment hurts in a way I cannot explain.\n\nHe added that upon returning home, he would visit the families in person to pay his respects.\n\nThe families of the deceased are reeling from the loss. In a tribute titledIn Loving Memory of Anotida,the Maziriri family described her as a bright light kind, loving, and deeply cherished. They said her sudden death had left a permanent void.\n\nEddmore Mafuwe, originally from Arlington Estate in Harare, had moved to Canada in 2022 to study Engineering at Thompson Rivers University in Kamloops, British Columbia. His family, in a statement titledHelp Bring Eddmore Mafuwe Home to Zimbabwe,said:\n\nWe are raising funds to return his body to Zimbabwe so his family can lay him to rest with dignity.\n\nThe tragic accident has cast a somber cloud over what was intended to be a celebration of Zimbabwean music and culture abroad. Social media platforms have since been flooded with tributes and condolence messages, mourning the loss of two promising young lives.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Families of the two Zimbabwean students who tragically died in a car crash while on their way … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/14/gofundme-campaigns-for-zimbabwean-students-killed-en-route-to-jah-prayzah-canada-show/\">Continue reading<span class=\"screen-reader-text\"> \"GoFundMe Campaigns for Zimbabwean Students Killed En Route to Jah Prayzah Canada Show\"</span></a></p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Smart Zimbabwe 2025 Set to Spotlight Digital Innovation and Inclusive Transformation",
            "url": "https://www.zimeye.net/2025/07/14/smart-zimbabwe-2025-set-to-spotlight-digital-innovation-and-inclusive-transformation/",
            "content": "By Tech Correspondent| The Smart Zimbabwe Conference & Expo 2025 is set to take place from 17 to 18 July at the Golden Conifer Functions Venue in Harare, bringing together a dynamic mix of stakeholders committed to building a digitally empowered economy.\n\nRunning under the theme, Smart Solutions, Smarter Economy: Integrating Global ICT Trends for Zimbabwes Future, the two-day event promises to be a milestone in Zimbabwes technology and innovation calendar.\n\nSpeaking ahead of the event, Rufaro Nyadembera, CEO of Zimshop.net and the conference organiser, emphasised the importance of the gathering:The purpose of this conference is to create a national platform where Zimbabweans can exchange ideas, showcase innovations, and align across sectors on the future we want. Smart Zimbabwe 2025 is not just about technology its about practical solutions that improve lives, drive economic growth, and ensure no one is left behind in the digital age.\n\nThe conference will feature keynote speeches from Honourable Daniel Garwe, Minister of Local Government and Public Works, and Honourable Tatenda Mavetera, Minister of Information Communication Technology, Postal and Courier Services, underscoring the governments commitment to harnessing technology for national development.\n\nOther prominent tech experts to grace the event include Tofara Chokera, CEO and founder of Tofara Online,Willard Nyagwande, managing director of Powertel and Tawanda Chihambakwe, CEO of Precision Aerial Group.\n\nKey highlights of the conference will see delegates witness a broad range of innovative digital solutions both locally developed and international that address challenges in agriculture, governance, education, commerce and health.\n\nThere will also be high-impact panel discussions on The Future of Work, smart payments, infrastructure, and digital skills.Interestingly,the conference will also honour individuals, start-ups, and organisations leading the charge in digital transformation through the Smart Zimbabwe Annual Awards.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tech Correspondent| The Smart Zimbabwe Conference & Expo 2025 is set to take place from 17 to 18 July … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/14/smart-zimbabwe-2025-set-to-spotlight-digital-innovation-and-inclusive-transformation/\">Continue reading<span class=\"screen-reader-text\"> \"Smart Zimbabwe 2025 Set to Spotlight Digital Innovation and Inclusive Transformation\"</span></a></p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "ED Regime Pockets US$879 Million in Diaspora Cash",
            "url": "https://www.zimeye.net/2025/07/14/ed-regime-pockets-us879-million-in-diaspora-cash/",
            "content": "By Business Reporter The Mnangagwa administration has raked inUS$879 millionin diaspora remittances in just five monthsyet continues to hide behind the rhetoric of sanctions while looting national resources with zero accountability.\n\nAccording to new data from the Reserve Bank of Zimbabwe (RBZ), the remittances reflect an8 percent increasefor the five months to May 2025 compared to the same period last year. Remittances now account for16.1 percent of total foreign currency inflows, making the Zimbabwean Diaspora the countrys second-largest source of hard currency after mineral exports.\n\nThis sharp rise in remittances, despite worsening economic conditions at home, highlights the resilience and commitment of Zimbabweans abroad who continue to support their families and communities amid a collapsed local economy.\n\nHowever, while Zimbabweans in the Diaspora sacrifice to keep their families afloat, the Mnangagwa government continues tomismanage public funds,loot national resources, anddivert foreign inflowsto enrich a politically connected elite.\n\nBillions in mineral revenues, particularly from gold, lithium, and platinum, have reportedly disappeared under Mnangagwas watch withno transparent accounting systems in place.\n\nInstead of fixing the broken governance and accountability systems, the regime blames economic hardships on sanctionsa narrative increasingly rejected by economists and civil society who point togrand corruption, policy inconsistency, and crony capitalismas the real culprits.\n\nWith remittances rising and public service delivery collapsing, critics say the Mnangagwa government isrelying on Diaspora money as a lifeline while offering no structural reforms or transparency in return.\n\nThe situation has sparked renewed calls for anational audit of foreign inflows, a crackdown on illicit financial flows, andconstitutional reformsto curb executive abuse of power in managing public funds.\n\nAs long as remittances prop up a corrupt and unaccountable system, analysts warn thatZimbabweans abroad may unwittingly be funding the very regime responsible for their families suffering at home.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Business Reporter – The Mnangagwa administration has raked in US$879 million in diaspora remittances in just five months—yet continues to hide behind … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/14/ed-regime-pockets-us879-million-in-diaspora-cash/\">Continue reading<span class=\"screen-reader-text\"> \"ED Regime Pockets US$879 Million in Diaspora Cash\"</span></a></p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Wicknell Tells Cucsman Grow Up First Then Join Chitepo Before You’re Given A Car | Cartoon",
            "url": "https://www.zimeye.net/2025/07/14/wicknell-tells-cucsman-grow-up-first-then-join-chitepo-before-youre-given-a-car-cartoon/",
            "content": "\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Luis Enrique Regrets Post-Match Scuffle With Joao Pedro After Chelsea’s Stunning Club World Cup Final Win",
            "url": "https://www.zimeye.net/2025/07/14/luis-enrique-regrets-post-match-scuffle-with-joao-pedro-after-chelseas-stunning-club-world-cup-final-win/",
            "content": "Sports Correspondent\n\nParis Saint-Germain head coach Luis Enrique has admitted he regrets his involvement in a heated post-match scuffle with Chelsea forward Joao Pedro following a dramatic 3-0 defeat in the Club World Cup final.\n\nChelsea stunned European champions PSG at the MetLife Stadium with a dominant performance led by Cole Palmer, who scored twice and assisted the third goal, becoming only the second Blues player since 2013-14 to directly contribute to three goals in a major final. He now joins the ranks of Eden Hazard (2019 Europa League final) and Didier Drogba (2007 EFL Cup final) as the only Chelsea players to score twice in a major final this century.\n\nThe game, however, ended in chaos. Tensions flared at the final whistle as PSG stars Gianluigi Donnarumma and Achraf Hakimi got into a heated exchange with Chelsea duo Joao Pedro and Andrey Santos. The confrontation escalated when Luis Enrique stepped in and was seen raising his hands to Joao Pedros face, prompting the Brazilian to drop to the ground.\n\nSpeaking at the post-match press conference, Enrique expressed regret over the incident, calling it unnecessary and avoidable.\n\nAt the end of the match, there was a situation that I believe could have been avoided by everyone, he said. My objective and my intention, as always, is to try to win over the players so that there are no more problems. Internally, there is a lot of tension, a lot of pressure.\n\nAnd from there, there is a series of shoves from a lot of people, which I think we should all avoid and which should not happen again.\n\nThe match itself was a showcase of Chelseas rising talent. Palmers brace came within an eight-minute spell in the first half, and he capped his performance with a slick assist for Joao Pedros goal just before halftimesealing Chelseas unexpected but emphatic triumph over the French giants.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Paris Saint-Germain head coach Luis Enrique has admitted he regrets his involvement in a heated post-match scuffle with … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/14/luis-enrique-regrets-post-match-scuffle-with-joao-pedro-after-chelseas-stunning-club-world-cup-final-win/\">Continue reading<span class=\"screen-reader-text\"> \"Luis Enrique Regrets Post-Match Scuffle With Joao Pedro After Chelsea’s Stunning Club World Cup Final Win\"</span></a></p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Passson Java Publishes Trabablas Video With Worse Than Dust Roads",
            "url": "https://www.zimeye.net/2025/07/14/passson-java-publishes-trabablas-video-with-worse-than-dust-roads/",
            "content": "Passion Java produces an AI clip promoting Trabablas Interchange. Your views?pic.twitter.com/ifjIYOzuWT\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Chelsea Make History: Blues Become First Club to Win ALL Major Trophies After FIFA Club World Cup Triumph",
            "url": "https://www.zimeye.net/2025/07/14/chelsea-make-history-blues-become-first-club-to-win-all-major-trophies-after-fifa-club-world-cup-triumph/",
            "content": "Sports Correspondent\n\nIn a stunning display, Chelsea have etched their name in the footballing record books by becoming the first club to win all major trophies available. The Blues delivered a convincing 3-0 victory over PSG in the FIFA Club World Cup final, capping an incredible achievement.\n\nCole Palmer was the star of the show, scoring two first-half goals and assisting Joao Pedros strike, which sealed the win before halftime. Enzo Marescas side dominated the match, capitalizing on defensive lapses and controlling the game both physically and tactically.\n\nThe win completes Chelseas unprecedented trophy haul, which now includes:\n\nPSG captain Marquinhos praised Chelseas game plan, acknowledging the gap in execution. They knew how to exploit the spaces and mistakes we made, he said in the post-game press conference.\n\nThis historic achievement cements Chelseas status as one of the greatest clubs in football history.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent In a stunning display, Chelsea have etched their name in the footballing record books by becoming the first … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/14/chelsea-make-history-blues-become-first-club-to-win-all-major-trophies-after-fifa-club-world-cup-triumph/\">Continue reading<span class=\"screen-reader-text\"> \"Chelsea Make History: Blues Become First Club to Win ALL Major Trophies After FIFA Club World Cup Triumph\"</span></a></p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Another FC Platinum Player In Terrible Road Accident",
            "url": "https://www.zimeye.net/2025/07/14/another-fc-platinum-player-in-terrible-road-accident/",
            "content": "FC Platinum winger Oscar Bhebhe has been involved in a road traffic accident, the club has confirmed.\n\nBhebhe reportedly sustained a broken hand and is currently receiving treatment at Mater Dei Hospital in Bulawayo.\n\nThis unfortunate incident occurs just under two weeks after the tragic death of teammate Brian Banda, who lost his life in a car crash on the Zvishavane-Bulawayo highway.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "FC Platinum winger Oscar Bhebhe has been involved in a road traffic accident, the club has confirmed. Bhebhe reportedly sustained … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/14/another-fc-platinum-player-in-terrible-road-accident/\">Continue reading<span class=\"screen-reader-text\"> \"Another FC Platinum Player In Terrible Road Accident\"</span></a></p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "How to Make Homemade Colostrum Substitute for Calves and Kids",
            "url": "https://www.zimeye.net/2025/07/14/how-to-make-homemade-colostrum-substitute-for-calves-and-kids/",
            "content": "By Dr Trywell Muzerengi\n\nIn situations where a newborn calf or kid is not receiving enough milk from its motheror if there is no foster animal availablehomemade colostrum can be a lifesaver. This simple mixture provides essential nutrients and antibodies crucial for the survival and early development of young livestock.\n\nHeres a quick and effective method to prepare a basic colostrum substitute using readily available ingredients:\n\nIngredients:\n\nFresh Milk  Use whole cows milk, preferably unpasteurised for maximum nutritional value.\n\nEgg Yolks  2 yolks per litre of milk (these provide extra protein, fat, and immune-boosting nutrients).\n\nInstructions:\n\nThis colostrum substitute is meant for emergency use when natural colostrum is unavailable. While it does not fully replicate the complex immunity profile of natural colostrum from the mother, it provides vital proteins, fats, and nutrients to help the newborn build strength in the critical first hours of life.\n\nNote: It is always best to use natural colostrum when available, as it contains species-specific antibodies necessary for early immunity.\n\nHowever, this homemade recipe is a practical and accessible option for small-scale farmers in resource-limited settings.\n\nInstagram: lasmuzagro1\n\nLinkedIn: Lasmuz Agro\n\nlasmuzagrosolutions@gmail.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Dr Trywell Muzerengi In situations where a newborn calf or kid is not receiving enough milk from its mother—or … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/07/14/how-to-make-homemade-colostrum-substitute-for-calves-and-kids/\">Continue reading<span class=\"screen-reader-text\"> \"How to Make Homemade Colostrum Substitute for Calves and Kids\"</span></a></p>",
            "time": "08:46",
            "date": "15 Jul 2025"
        }
    ]
}