{
    "news": [
        {
            "title": "Army Speaks On Coup",
            "url": "https://www.zimeye.net/2025/02/13/army-speaks-on-coup/",
            "content": "Munacho Gwamanda-The Zimbabwe National Army (ZNA) has dismissed a statement purportedly issued by individuals claiming to be soldiers planning a coup against President Emmerson Mnangagwa.\n\nThiscomes amid growing internal rifts within the ruling ZANU PF party and escalating tensions between Mnangagwa and his deputy, Vice President Constantino Chiwenga.\n\nZNA spokesperson Alphios Makotore told ZimEye that he was unaware of any officers involved in the alleged coup attempt.\n\nWhich officer and on what subject issues?hequestioned,beforeadding,Idontcomment on such issues since I am no longer in that office.Kindly contact Defence Headquarters.\n\nHis response follows a statement released by an anonymous group claiming to represent sections of the Zimbabwe Defence Forces.\n\nThe group, speaking in a military-style declaration, accused President Mnangagwa of orchestrating the assassinations of high-ranking army generals and warned of impending action toprotect the Constitution from counter-revolutionary gangsters.\n\nThe coup threats comein the wake ofcontroversial statements by Blessing Geza, a war veteran and Zanu PF central committee member with strong ties to security forces.\n\nGeza has repeatedly alleged that Mnangagwahisfamilyandthiercloseallies,were corrupt andaredistroyingthe country.\n\nHis outbursts have fueled speculation that discontent within the security sector is reaching a breaking point.\n\nGeza has also been vocal about the ongoing power struggle between Mnangagwa and Chiwenga.\n\nThe vice president, who played a pivotal role in the 2017 military coup that ousted Robert Mugabe, is believed to be losing patience withMnangagwasconsolidation of power.\n\nReports suggest that Chiwenga, backed by senior military officials, isgrowingincreasingly frustrated withMnangagwasgovernance, patronage networks, and the marginalization of key military figures in government affairs.\n\nThe rift between Mnangagwa and Chiwenga has been a defining feature of Zimbabwean politics since 2017.\n\nWhile Mnangagwa initially relied on military support to ascend to power, his subsequent moves to sideline key army figures have deepened divisions.\n\nChiwenga, a former army general with strong ties to the security establishment, has maintained a strategic silence in recent months, leading to speculation that he may be preparing to challengeMnangagwasrule.\n\nThe recentalledgedmilitary statement directly referencedMnangagwasalleged role in a series of political assassinations, naming prominent figures such as:\n\nThe statement also accusedMnangagwasadministration of widespread corruption, economic mismanagement, and the systematic oppression of war veterans and junior security officers.\n\nThe statement issued by the anonymous military group outlined a plan totake actionagainstMnangagwasgovernment if conditions did not improve. It called on junior officers in the army, police, and intelligence services to prepare for aconstitutional intervention.\n\nThe majority of you are living in abject poverty while the ruling elite loots national resources,the statement read.We urge you to defend the Constitution from kleptocratic rulers who treat the national treasury as their personal bank account.\n\nAdditionally, the statement warned key Mnangagwa loyalists, including:\n\nThe group accused them of insulting war veterans and manipulating the security sector for political gain.\n\nDespite the coup threats, the Mnangagwa administration has maintained a firm grip on the state security apparatus.\n\nThe government has ramped up surveillance, and there are reports of increased deployments of intelligence operatives within the armed forces.\n\nAnalysts warn that while the statement may not signal an immediate coup, it reflects growing discontent within the security establishment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Munacho Gwamanda- The Zimbabwe National Army (ZNA) has dismissed a statement purportedly issued by individuals claiming to be soldiers planning a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/army-speaks-on-coup/\">Continue reading<span class=\"screen-reader-text\"> \"Army Speaks On Coup \"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "Kirsty Coventry Stirs Controversy With Comments On Transgender Athletes",
            "url": "https://www.zimeye.net/2025/02/13/kirsty-coventry-stirs-controversy-with-comments-on-transgender-athletes/",
            "content": "Sports Correspondent\n\nKirsty Coventry, a leading candidate to become the next president of the International Olympic Committee (IOC), has sparked controversy with her strong stance on transgender athletes. Coventry has expressed support for a blanket ban on transgender athletes competing against individuals of the opposite sex, which could significantly impact those aiming to participate in such events and pursue Olympic gold.\n\nIn addition to her Olympic achievements, Coventry serves as Zimbabwes Sports Minister.\n\nThe former Olympic swimmer, who has been a member of the IOC executive board since 2018, is now campaigning for the IOC presidency. Coventry has voiced her belief in a blanket ban on transgender athletes in Olympic events, as reported by the UKsThe Telegraph.\n\nProtecting womens sports and maintaining fairness in female categories is crucial, Coventry said. Its a priority for us all to come together on this issue.\n\nShe pointed to increasing scientific research, stating, We arent discussing how this issue affects mens sports, which highlights the need to protect womens sports.\n\nCoventry, who has earned seven Olympic medals in swimming, including two golds, also argued that transgender women possess physical advantages in female categories, which could deny women equal opportunities. Drawing from her experience, she emphasized the challenges of allowing men to compete against women, especially in contact sports.\n\nCoventry also reflected on her role overseeing the Paris Olympics, where athletes Lin Yuting and Imane Khelif won gold in boxing, despite having been previously excluded from competing in womens events by the International Boxing Association. We will always learn from such experiences, Coventry noted, adding that the Paris Olympics were an important moment for such lessons.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kirsty Coventry, a leading candidate to become the next president of the International Olympic Committee (IOC), has sparked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/kirsty-coventry-stirs-controversy-with-comments-on-transgender-athletes/\">Continue reading<span class=\"screen-reader-text\"> \"Kirsty Coventry Stirs Controversy With Comments On Transgender Athletes\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "Defence Minister Muchinguri-Kashiri In India For Secret Assignment?",
            "url": "https://www.zimeye.net/2025/02/13/defence-minister-muchinguri-kashiri-in-india-for-secret-assignment/",
            "content": "By A Correspondent\n\nThe timing of Defence Minister Cde Oppah Muchinguri-Kashiris trip to India raises suspicions, especially amid the ongoing Zanu PF power struggles. As the party faces a deep internal divide, one faction aligns with President Mnangagwas bid for a third term, while another vehemently opposes it, creating an atmosphere of political tension.\n\nMuchinguri-Kashiris trip, officially to attend the Defence Ministers Conclave in India, appears to serve as more than just a diplomatic mission. The Conclave, running until February 15, is expected to discuss global defence and security issues of mutual interest. While these topics are crucial, the timing suggests there might be a hidden agenda behind her visit.\n\nHer bilateral meetings with Indian officials, including her Indian counterpart, could provide a cover for behind-the-scenes political maneuvering. Could she be securing support for Mnangagwas third term ambitions? Or is this a move to strengthen her own position in the party as factions vie for influence? Given the high stakes within Zanu PF, her presence in India could signal more than just a routine diplomatic engagement.\n\nAs Muchinguri-Kashiri attends the conclave, her actions and the outcomes of her meetings will undoubtedly be scrutinized in the context of Zimbabwes ongoing political turbulence.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The timing of Defence Minister Cde Oppah Muchinguri-Kashiri’s trip to India raises suspicions, especially amid the ongoing … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/defence-minister-muchinguri-kashiri-in-india-for-secret-assignment/\">Continue reading<span class=\"screen-reader-text\"> \"Defence Minister Muchinguri-Kashiri In India For Secret Assignment?\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "ED Life President-Mahiya",
            "url": "https://www.zimeye.net/2025/02/13/ed-life-president-mahiya/",
            "content": "Harare, Zimbabwe  President Emmerson Mnangagwa suffered a major embarrassment at the National Heroes Acre, as his small group of supporters was overpowered by the voices of a massive crowd singing in opposition, exposing deep divisions within the ruling Zanu PF party.\n\nThe chaotic scenes, which unfolded two days ago, sent shockwaves across Zimbabwe, further highlighting the growing discontent with Mnangagwas leadership. This comes at a time when his handful of backers remain unhinged, pushing for an indefinite extension of his presidency beyond constitutional limits.\n\nMnangagwas Backers Demand Eternal Rule Amidst Growing Resistance\n\nLeading the call for Mnangagwas continued rule is Zanu PF Secretary for War Veterans, Douglas Mahiya, who issued threats against fellow war veterans who oppose extending Mnangagwas presidency. Mahiya directly warned those challenging the Zanu PF leaders rule, stating that they could be stopped from speaking indefinitely.\n\nHis comments were seemingly directed at Blessed Runesu Geza and his faction of war veterans, who have been vocal in their opposition to Mnangagwas leadership, citing corruption, nepotism, and economic collapse as reasons why the president should step down.\n\nA Party in Crisis: Mnangagwas Supporters Threaten Opponents\n\nSpeaking at a war veterans gathering in Bulawayo, Mahiya shockingly suggested that, under different leadership, Zanu PF could have declared a state of emergency and suspended elections indefinitely, effectively turning Zimbabwe into a dictatorship.\n\nWe were sanctioned by the West. Thats a sign that we are in a war. When a country has sanctions, when people are in a war, they can stop going for elections and declare a state of emergency, Mahiya stated, arguing that Mnangagwa had been too lenient by allowing elections to continue.\n\nMahiya justified extending Mnangagwas term, arguing that Western sanctions constituted a war situation, which, under a different leader, could have led to the suspension of democracy.\n\nHad Mnangagwa not been a principled leader, the ruling party could have declared a state of emergency, suspended elections, and ensured his indefinite rule, he said, implying that only death could remove Mnangagwa from power.\n\nMnangagwas Supporters Face Backlash\n\nWhile a small faction within Zanu PF continues to push for Mnangagwas rule beyond 2030, his presence at the National Heroes Acre painted a completely different picture. His supporters were overwhelmed and drowned out by the voices of the majority in attendance, who sang in a manner that embarrassed the Zanu PF leader.\n\nThe incident underscores the deepening fractures within the ruling party, as tensions escalate between those supporting Mnangagwas indefinite rule and those demanding change.\n\nMahiya Issues More Threats: We Will Stop You\n\nIn a chilling statement, Mahiya openly threatened war veterans who refuse to back Mnangagwa, warning that they would face consequences for speaking out.\n\nIf you refuse, we have the right, although forbidden by the law, to act otherwise to stop you indefinitely from saying such things, Mahiya declared, suggesting that dissent would not be tolerated.\n\nHe also dismissed the idea that war veterans had independent political agency, saying:\n\nGoing to Zambia (for training during the liberation struggle) does not give you the power to refuse what the majority want. If you do not follow what people want, your war veteran status is useless.\n\nA Desperate Push for Mnangagwas Extended Rule\n\nMahiya insisted that Mnangagwas leadership should be extended indefinitely, invoking Resolution Number One from the Zanu PF National Peoples Conference in Bulawayo, which endorsed Mnangagwas rule until at least 2030.\n\nThe president will not say what I am saying, but if we take the principle of the revolution that the minority is subordinate to the majority, it means the president has to accept as well what has been said by the people, Mahiya said, implying that Mnangagwa himself must accept an extension to his term.\n\nFactionalism Threatens Zanu PFs Future\n\nMahiya also accused opposing war veterans of working with the opposition to create instability within Zanu PF, warning that the party could lose the next election if internal divisions continue.\n\nThere are different war veteran associations coming up so that during the next elections, Zanu PF loses. They want to divide you so that you disagree with your party and government, he claimed.\n\nHowever, the reality at Heroes Acre two days ago suggests that Mnangagwa is quickly losing control, as the masses no longer align with his leadership, despite the desperate attempts of his inner circle to keep him in power.\n\nWhat Happens Next?\n\nThe embarrassing scenes at Heroes Acre serve as a clear warning that Mnangagwas grip on power is slipping. While a few die-hard supporters continue to push for his indefinite rule, the public display of resistance signals that his presidency is facing growing rejection, even within Zanu PF.\n\nThe ruling party is now at a crossroadswill they force through an unconstitutional extension of Mnangagwas rule, or will the rising tide of dissent lead to internal collapse and potential leadership change?\n\nWith elections looming and factionalism deepening, one thing is certain: Mnangagwas rule is no longer as secure as it once seemed.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Harare, Zimbabwe – President Emmerson Mnangagwa suffered a major embarrassment at the National Heroes Acre, as his small group of … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/ed-life-president-mahiya/\">Continue reading<span class=\"screen-reader-text\"> \"ED Life President-Mahiya\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "Govt Says Only Wicknell Chivayo’s Allowed To Carry Money Vendors Must Open Bank Accounts",
            "url": "https://www.zimeye.net/2025/02/13/govt-says-only-wicknell-chivayos-allowed-to-carry-money-vendors-must-open-bank-accounts/",
            "content": "EXPOSED: Government Forces Vendors to Open Bank Accounts While Million-Dollar Looters Remain Untouched\n\nDouble Standards in Zimbabwes Financial Crackdown?\n\nHarare, Zimbabwe  In a move that has sparked widespread outrage, the Zimbabwean government has issued a directive forcing informal vendors to open bank accounts and adopt Point of Sale (POS) machines for all transactions. This mandate, supposedly aimed at boosting tax compliance and financial transparency, raises critical questions: Why are small-scale traders being aggressively targeted while politically connected individuals implicated in massive corruption scandals remain untouched?\n\nThe hypocrisy is glaring. While vendorswho earn a living selling fruits, vegetables, and second-hand clothesare now required to submit to strict financial regulations, individuals like Wicknell Chivayo, known for flaunting stacks of US dollars and securing multi-million-dollar government contracts without accountability, continue to operate with impunity.\n\nA New Burden on Vendors, A Free Pass for the Elite\n\nAnnounced by Information Minister Dr. Jenfan Muswere, the new policy dictates that all informal traders must open bank accounts upon registration and adopt electronic transactions as part of the formal economy. The government argues that this will improve tax collection, but critics see it as another way to target the struggling poor while the politically connected rich remain untouchable.\n\nCurrently, local authorities are responsible for licensing vendors, but under the new system, the Zimbabwe Revenue Authority (ZIMRA) will play a central role in ensuring compliance with tax laws. A Domestic Inter-agency Team is also being established to crack down on non-compliant vendors, raising fears of harassment and arbitrary arrests.\n\nYet, while vendors are being policed, no such enforcement exists for high-profile figures accused of looting millions from state coffers.\n\nSelective Law Enforcement: Why No Scrutiny for Chivayo and Other Elites?\n\nZimbabweans are still reeling from revelations of high-profile corruption cases, where individuals like Wicknell Chivayo have been linked to controversial multi-million-dollar deals. Chivayo, a known ZANU-PF associate, has publicly flaunted massive wads of cash in a country where ordinary citizens are required to justify deposits as low as US$1,000.\n\nKey Questions the Government Must Answer:1. Why are vendors being forced into formal banking systems while individuals caught on camera counting millions in cash face no financial scrutiny?2. Why are looters of public funds not being investigated under the same financial transparency rules?3. How does forcing vendors to open bank accounts address the real economic crisis caused by corruption and mismanagement?\n\nThe silence from authorities is deafening. Despite past scandals and public outrage, Chivayo and other politically connected elites continue to operate without any requirement to disclose the sources of their massive wealth. Meanwhile, street vendors struggling to make ends meet are being hounded by financial regulations that seem designed to oppress rather than empower.\n\nA War on the Poor?\n\nThis latest move fits into a broader pattern of the Zimbabwean government targeting the most vulnerable members of society while shielding those in power. Instead of addressing real economic issues such as inflation, corruption, and unemployment, authorities have opted to police the informal sector, which provides livelihoods for millions.\n\nExperts warn that forcing vendors into the banking system without addressing the root causes of economic decaycorruption, policy inconsistency, and lack of investor confidencewill only push more people into extreme poverty.\n\nWhat Happens Next?\n\nWith vendors now required to comply with electronic payment systems and formal banking, enforcement measures will likely lead to increased harassment from police and municipal authorities, who have a long history of cracking down on informal traders.\n\nThe real question is: Will the same energy be applied to investigating and prosecuting those responsible for looting the countrys wealth? If history is any indicator, the answer is a resounding no.\n\nFor now, Zimbabwean vendors must brace for yet another government policy that punishes the poor while protecting the powerful. The fight for justice continues.\n\nHave Your Say:\n\nDo you think the governments policy is fair? Should high-profile individuals like Wicknell Chivayo also be forced to open bank accounts and declare their financial dealings? Share your thoughts!\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "EXPOSED: Government Forces Vendors to Open Bank Accounts While Million-Dollar Looters Remain Untouched Double Standards in Zimbabwe’s Financial Crackdown? Harare, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/govt-says-only-wicknell-chivayos-allowed-to-carry-money-vendors-must-open-bank-accounts/\">Continue reading<span class=\"screen-reader-text\"> \"Govt Says Only Wicknell Chivayo’s Allowed To Carry Money Vendors Must Open Bank Accounts\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "City’s Champions League Hopes In Jeopardy",
            "url": "https://www.zimeye.net/2025/02/13/citys-champions-league-hopes-in-jeopardy/",
            "content": "Sports Correspondent\n\nManchester Citys Champions League ambitions are hanging in the balance after a dramatic 3-2 defeat to Real Madrid in the first leg of their play-off tie.\n\nDespite Erling Haalands double, including a late penalty, Citys collapse in the final moments allowed Madrid to snatch victory.\n\nKylian Mbappe had equalized for Madrid on the hour, before Haaland restored Citys lead from the spot. However, Brahim Diaz scored against his former club with a rebound effort, and Jude Bellingham sealed the win with a stoppage-time strike.\n\nMadrids victory was largely due to Citys self-inflicted errors, as they surrendered possession and failed to see out the game. Edersons inability to parry the ball away from goal and Rico Lewiss failure to hold off Vinicius Junior proved costly.\n\nThe defeat leaves City facing an uphill task to progress, with the second leg still to come.\n\nWhile there is still hope, Citys susceptibility to conceding goals in quick succession will be a major concern for manager Pep Guardiola.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Manchester City’s Champions League ambitions are hanging in the balance after a dramatic 3-2 defeat to Real Madrid … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/citys-champions-league-hopes-in-jeopardy/\">Continue reading<span class=\"screen-reader-text\"> \"City’s Champions League Hopes In Jeopardy\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "Kasukuwere Throws Weight Behind Chiwenga’s Anti-Corruption Crusade",
            "url": "https://www.zimeye.net/2025/02/13/kasukuwere-throws-weight-behind-chiwengas-anti-corruption-crusade-2/",
            "content": "By A Correspondent\n\nIn a bold move, Wabathu Economic Empowerment Revolutionaries (WEERS), a group aligned with former Zanu PF official Savior Kasukuwere, has publicly backed Vice President General Constantino Chiwengas efforts to combat corruption. This show of support comes amid intense infighting within Zanu PF, with various factions rallying behind different leaders.\n\nWEERS, led by Xavier Kazizi, issued a strong statement outlining their stance. They emphasized their commitment to upholding Constitutionalism in Zimbabwe, opposing the extension of term limits, and rejecting plans to postpone the 2028 elections. The group also reiterated their support for Chiwenga, praising his stance against corruption and mismanagement of state resources.\n\nChiwenga has been vocal about his anti-corruption efforts, calling for greater participation from businesses in anti-corruption initiatives and emphasizing the need for a robust legislative framework to combat graft . WEERS endorsement of Chiwengas efforts is a significant development in the ongoing power struggle within Zanu PF. As tensions continue to rise, it remains to be seen how this will play out in the coming months.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a bold move, Wabathu Economic Empowerment Revolutionaries (WEERS), a group aligned with former Zanu PF official … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/kasukuwere-throws-weight-behind-chiwengas-anti-corruption-crusade-2/\">Continue reading<span class=\"screen-reader-text\"> \"Kasukuwere Throws Weight Behind Chiwenga’s Anti-Corruption Crusade\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "Top ZRP Cop Rapes Own Daughter",
            "url": "https://www.zimeye.net/2025/02/13/top-zrp-cop-rapes-own-daughter/",
            "content": "By A Correspondent\n\nA Zimbabwe Republic Police (ZRP) Inspector has been taken into custody for allegedly committing heinous crimes against his own flesh and blood  his grade seven daughter.\n\nThe accused, whose name has not been disclosed, is stationed at Headquarters Troop, Support Union, and faces two counts of indecent assault.\n\nAccording to court records, the minor lives with her stepmother. The court heard that in August 2024, the Inspector returned home intoxicated and brutally assaulted his daughter in his bedroom. In a second, disturbing incident, the officer allegedly fondled his daughters breasts and private parts when he found her alone at home in January 2025, making disturbing comments about her physical development.\n\nMagistrate Sengster Tavengwa has remanded the Inspector in custody, pending further investigation and trial.\n\nThe case has sent shockwaves through the community, highlighting the need for increased vigilance and protection for vulnerable individuals, especially within their own families.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A Zimbabwe Republic Police (ZRP) Inspector has been taken into custody for allegedly committing heinous crimes against … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/top-zrp-cop-rapes-own-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Top ZRP Cop Rapes Own Daughter\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "Mnangagwa Can Rule Beyond 2030, Says Zanu PF Youth League Leader",
            "url": "https://www.zimeye.net/2025/02/13/mnangagwa-can-rule-beyond-2030-says-zanu-pf-youth-league-leader/",
            "content": "By A Correspondent\n\nTaurai Kandishaya, a prominent official in Zanu PFs youth league, has claimed that President Emmerson Mnangagwa could continue in office beyond 2030.\n\nIn a statement issued on Tuesday, Kandishaya expressed confidence in Mnangagwas leadership, emphasizing his strong bond with his deputy, Vice President Constantino Chiwenga.\n\nHe remarked, Our President, Cde ED Mnangagwa, has a sound relationship with his lieutenants, specifically Vice President Chiwenga, who is described as his young brother.\n\nKandishaya also warned that any efforts to undermine President Mnangagwa would face resistance from Vice President Chiwenga. Attempts to undermine President ED will meet resistance from VP Chiwenga, he stated, adding, If you continue criticizing President ED, our dear VP will defend his brother by ensuring his term is extended.\n\nHe further asserted that the extension could last beyond 2030, declaring, The extension will go beyond 2030 to a period referred to as Amen. #Idyaisadzarenyumakanyarara.\n\nWhile President Mnangagwas current term is set to end in 2028, factions within Zanu PF are actively advocating for an extension of his presidency.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Taurai Kandishaya, a prominent official in Zanu PF’s youth league, has claimed that President Emmerson Mnangagwa could … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/mnangagwa-can-rule-beyond-2030-says-zanu-pf-youth-league-leader/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Can Rule Beyond 2030, Says Zanu PF Youth League Leader\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        },
        {
            "title": "Kirsty Coventry Endorses Blanket Ban On Transgender Athletes",
            "url": "https://www.zimeye.net/2025/02/13/kirsty-coventry-endorses-blanket-ban-on-transgender-athletes/",
            "content": "Sports Correspondent\n\nKirsty Coventry, a leading candidate to become the next president of the International Olympic Committee (IOC), has sparked controversy with her strong stance on transgender athletes.\n\nCoventry has expressed support for a blanket ban on transgender athletes competing against individuals of the opposite sex, which could significantly impact those aiming to participate in such events and pursue Olympic gold.\n\nIn addition to her Olympic achievements, Coventry serves as Zimbabwes Sports Minister.\n\nThe former Olympic swimmer, who has been a member of the IOC executive board since 2018, is now campaigning for the IOC presidency. Coventry has voiced her belief in a blanket ban on transgender athletes in Olympic events, as reported by the UKsThe Telegraph.\n\nProtecting womens sports and maintaining fairness in female categories is crucial, Coventry said. Its a priority for us all to come together on this issue.\n\nShe pointed to increasing scientific research, stating, We arent discussing how this issue affects mens sports, which highlights the need to protect womens sports.\n\nCoventry, who has earned seven Olympic medals in swimming, including two golds, also argued that transgender women possess physical advantages in female categories, which could deny women equal opportunities. Drawing from her experience, she emphasized the challenges of allowing men to compete against women, especially in contact sports.\n\nCoventry also reflected on her role overseeing the Paris Olympics, where athletes Lin Yuting and Imane Khelif won gold in boxing, despite having been previously excluded from competing in womens events by the International Boxing Association. We will always learn from such experiences, Coventry noted, adding that the Paris Olympics were an important moment for such lessons.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Kirsty Coventry, a leading candidate to become the next president of the International Olympic Committee (IOC), has sparked … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/02/13/kirsty-coventry-endorses-blanket-ban-on-transgender-athletes/\">Continue reading<span class=\"screen-reader-text\"> \"Kirsty Coventry Endorses Blanket Ban On Transgender Athletes\"</span></a></p>",
            "time": "18:36",
            "date": "13 Feb 2025"
        }
    ]
}