{
    "news": [
        {
            "title": "Popular Musician Jailed",
            "url": "https://www.zimeye.net/2025/05/02/popular-musician-jailed/",
            "content": "By Showbiz Reporter  Upcoming musician, Chillmaster, has been convicted and sentenced to two years imprisonment on culpable homicide charges.\n\nChillmaster, real name Gift Hombarume, has been convicted of culpable homicide and driving without a licence following a fatal road accident that claimed the life of a pedestrian on April 9, 2025.\n\nWhile the court handed Hombarume a two-year sentence for culpable homicide, Mbare magistrate Tatenda Mukurunge suspended the full sentence under strict conditions.\n\nTwelve months were suspended on the condition of good behaviour, while the remaining year was set aside on the condition that he completes 420 hours of community service at Stoneridge Primary School.\n\nIn addition, the musician was fined US$200 for driving without a valid drivers licence.\n\nMagistrate Mukurunge noted that although the offence was serious, a custodial sentence would be excessively harsh given the steps the musician had taken to make amends.\n\nThese included pledging to support the deceaseds family by providing monthly groceries and covering school fees for the victims children until they complete their education.\n\nA fine alone would trivialize the offence, but a prison sentence would be too severe in the circumstances, Mukurunge ruled.\n\nIn a victim impact statement, family representative Lucia Charumbira told the court they had forgiven Hombarume and appreciated his presence and support during the funeral.\n\nShe added that he had also pledged to pay compensation in the form of cattle to appease avenging spirits, in line with cultural traditions.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter – Upcoming musician, Chillmaster, has been convicted and sentenced to two years imprisonment on culpable homicide charges. … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/popular-musician-jailed/\">Continue reading<span class=\"screen-reader-text\"> \"Popular Musician Jailed\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Musician Chillmaster Sentenced …",
            "url": "https://www.zimeye.net/2025/05/02/musician-chillmaster-sentenced/",
            "content": "Tinashe Sambiri\n\nPopular musician Gift Hombarume aka Chillmaster has been jailed two years and fined US$200 following his conviction for fatally hitting a pedestrian on April 9 2025.\n\nThe musician was convicted of culpable homicide and driving without a drivers license.\n\nHe however escaped a custodial sentence after Mbare magistrate Tatenda Mukurunge fined him US$200 for driving without a license.\n\nThe magistrate also suspended 1w months of his two years sentence for culpable homicide on condition of good behaviour.\n\nShe also suspended the remaining 12 monthd on condition that he performs 420 hours of community service at Stoneridge Primary School.\n\nThe magistrate also took into consideration that he undertook to take care of the deceaseds family by buying monthly groceries and sending his children to school until they finish.\n\nThe magistrate said given this, a custodial sentence will be too harsh for the musician.\n\nMukurunge also said a fine alone will trivialize the offence.\n\nLucia Charumbira a family representative told court in her victim impact statement that they have forgiven Hombarume.\n\nShe also said Hombarume stood with them during the funeral.\n\nLucia urged the court not to give the musician a custodial sentence noting that he has promised to pay cows to avoid avenging spirits on top of what he has already done for the family.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Tinashe Sambiri Popular musician Gift Hombarume aka Chillmaster has been jailed two years and fined US$200 following his conviction for … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/musician-chillmaster-sentenced/\">Continue reading<span class=\"screen-reader-text\"> \"Musician Chillmaster Sentenced …\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Chillmaster jailed two years, fined US$200 for Killing a Pedestrian",
            "url": "https://www.zimeye.net/2025/05/02/chillmaster-jailed-two-years-fined-us200-for-killing-a-pedestrian/",
            "content": "By Showbiz Reporter | ZimEye | Popular musician Gift Hombarume aka Chillmaster has been jailed two years and fined  US$200 following his conviction for fatally hitting a pedestrian on April 9 2025.\n\nThe musician was convicted of culpable homicide and driving without a drivers license.\n\nHe however escaped a custodial sentence after Mbare magistrate Tatenda Mukurunge fined him US$200 for driving without a license.\n\nThe magistrate also suspended 1w months of his two years sentence for culpable homicide on condition of good behaviour.\n\nShe also suspended the remaining 12 monthd on condition that he performs 420 hours of community service at Stoneridge Primary School.\n\nThe magistrate also took into consideration that he undertook to take care of the deceaseds family by buying monthly groceries and sending his children to school until they finish.\n\nThe magistrate said given this, a custodial sentence will be too harsh for the musician.\n\nMukurunge also said a fine alone will trivialize the offence.\n\nLucia Charumbira a family representative told court in her victim impact statement that they have forgiven Hombarume.\n\nShe also said Hombarume stood with them during the funeral.\n\nLucia urged the court not to give the musician a custodial sentence noting that he has promised to pay cows to avoid avenging spirits on top of what he has already done for the family.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Showbiz Reporter | ZimEye | Popular musician Gift Hombarume aka Chillmaster has been jailed two years and fined US$200 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/chillmaster-jailed-two-years-fined-us200-for-killing-a-pedestrian/\">Continue reading<span class=\"screen-reader-text\"> \"Chillmaster jailed two years, fined US$200 for Killing a Pedestrian\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Top Zanu PF Election Rigging Strategist ‘Fired’",
            "url": "https://www.zimeye.net/2025/05/02/top-zanu-pf-election-rigging-strategist-fired/",
            "content": "By Munacho Gwamanda-Zanu PFs long-serving Director for Commissariat, Dr. DavisonGomo,hasbeenretiredfrom his positionamid mounting scrutiny over his role inthe establishment ofcontroversial party affiliates accused of aiding electoral manipulation.\n\nGomo, who worked under four different Zanu PF national political commissars during his tenure, washonouredat a retirement ceremony in Harare this week.\n\nDespite his resignation, Gomo reaffirmed his commitment to the ruling party, declaring he remained a Zanu PF cadre for life.\n\nI am retiring from my position, but I will never retire from politics, Gomo said. We must continue to protect our hard-won independence. We cannot allow Western-sponsored elements like Nelson Chamisa to reverse the gains of the liberation struggle.\n\nZanu PF Political Commissar Munyaradzi Machacha praised Gomos legacy, singling him out as the architect behind the partys network of affiliates that played a key role in votermobilisationduring the disputed August 2023 general elections.\n\nWhen I came into the commissariat, I was introduced to these affiliates and quicklyrealisedthatDrGomo had meticulouslymouldedthem into powerful extensions of the partysmobilisationmachinery, Machacha said. He gave the commissariat strategic depth. I urge all affiliates to create updated membership registers, just as Dr Gomo had championed.\n\nAmong the most prominent of these affiliates istheForeverAssociates Zimbabwe (FAZ), a shadowyorganisationalignedtothe Central Intelligence Organisation (CIO).\n\nFAZcame to prominencein 2022 and was accused of running parallel electoral structures during the 2023 elections.\n\nThe group deployed operatives across the countrys 10 provinces, gathering intelligence on voters, intimidating opposition supporters, and manipulating community-based structures to influence electoral outcomesinfavourofZanu PF.\n\nAnother entity that emerged under Gomos watch was theVarakashi social media brigade, a loose coalition of online activists and trolls tasked with defending Zanu PF narratives, discrediting opposition leaders, and controlling the digital information space.\n\nThe Varakashi, reportedly linked to state security, aggressively attacked dissenting voices online andwere instrumentalin drowning out criticism of the government during key political moments.\n\nUnder Gomos coordination, these affiliatesalong with dozens of others such as Teachers for ED, Pastors for ED, Young Women for ED, and Diaspora 4EDformed an ecosystem of loyalty networks that blurred the lines between civil society and the ruling partys political objectives.\n\nBy 2023, Zanu PF claimed more than 60 affiliate groups had registered under its umbrella.\n\nAt the farewell event, affiliate leaders and party officials hailed Gomos strategic foresight.\n\nWe want to thank you for the journey you have walked, said ZANU PF UK branch political commissar, Gwatidzo. We will carry forward your legacy bymobilisingdiasporans to return and contribute to rebuilding Zimbabwe under Zanu PF.\n\nBornface Mutize, another party loyalist and affiliateorganiser, added: As we move forward, we must remain resolute in defending the party for future generations.\n\nWhile Gomos retirement marks the end of an era in the commissariat, critics argue that his influence will continue to loom large, particularly through the affiliate structures he helpedinstitutionalise.\n\nCivil societyorganisationsand opposition parties continue to accuse Zanu PF of using these affiliates to entrench authoritarianism, control rural communities, and undermine democratic processes under the guise of grassrootsmobilisation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda-Zanu PF’s long-serving Director for Commissariat, Dr. Davison Gomo, has been retired from his position amid mounting scrutiny over his role in the establishment of controversial … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/top-zanu-pf-election-rigging-strategist-fired/\">Continue reading<span class=\"screen-reader-text\"> \"Top Zanu PF Election Rigging Strategist ‘Fired’\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Zanu PF Applauds Its Own Role in Weakening Opposition",
            "url": "https://www.zimeye.net/2025/05/02/zanu-pf-applauds-its-own-role-in-weakening-opposition/",
            "content": "By A Correspondent\n\nZanu PFs National Political Commissar, Munyaradzi Machacha, has praised Dr. Davison Gomo for his efforts in undermining Zimbabwes political opposition.\n\nSpeaking at Gomos retirement ceremony on Friday, Machacha commended the outgoing Zanu PF Director for Commissariat for his strategic work in mobilizing support ahead of the 2023 general elections.\n\nIn an official statement, Zanu PF highlighted Gomos contribution to strengthening the partys affiliate structures:\n\nZANU PF National Political Commissar, Munyaradzi Machacha, has paid tribute to ruling party strategists for establishing vibrant affiliates that played a crucial role in mobilising the electorate during the August 2023 general elections.\n\nSpeaking at the retirement ceremony for ZANU PF Director for Commissariat, Dr. Davison Gomo, Machacha acknowledged Dr. Gomos efforts in shaping these affiliates into a vital extension of the party. Having served under four political commissars, Dr. Gomo urged party members to reject divisive tendencies and continue defending the ruling party.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zanu PF’s National Political Commissar, Munyaradzi Machacha, has praised Dr. Davison Gomo for his efforts in undermining … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/zanu-pf-applauds-its-own-role-in-weakening-opposition/\">Continue reading<span class=\"screen-reader-text\"> \"Zanu PF Applauds Its Own Role in Weakening Opposition\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Be Patient, DeMbare Appeals To Fans",
            "url": "https://www.zimeye.net/2025/05/02/be-patient-dembare-appeals-to-fans/",
            "content": "By Sports Correspondent\n\nStruggling Harare giants Dynamos FC have called for patience from their supporters following a mixed start to the 2025 Castle Lager Premier Soccer League campaign.\n\nIn a media statement released on Thursday, the club acknowledged the growing frustration among its fan base over the teams underwhelming performances but urged unity and calm as the season progresses.\n\nSee statement below:\n\n01/05/2025CLUB UPDATE\n\nDynamos Football Club acknowledges the concerns and frustrations expressed by our loyal supporters over the teams recent league results.\n\nThis season has brought several new players into the squad, and they need time, support, and patience to fully integrate into a club known for its high expectations and demanding standards.\n\nWe appeal to all our fans to remain calm and supportive during this transitional period. Every component of the club  from coaches and players to the supporters  must work together as we strive to turn things around.\n\nWhile the teams current position on the league table is unfamiliar and concerning, this phase of rebuilding is necessary. We are committed to finding solutions and improving our performance.\n\nThe club is sincerely grateful for the continued backing from our fans and their leadership, even during these challenging times.\n\nAs we prepare for match day 10 against Scotland FC, we urge our supporters to come out in full force and rally behind the team.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Sports Correspondent Struggling Harare giants Dynamos FC have called for patience from their supporters following a mixed start to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/be-patient-dembare-appeals-to-fans/\">Continue reading<span class=\"screen-reader-text\"> \"Be Patient, DeMbare Appeals To Fans\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Football Fans Slam Mapeza’s Outburst During Media Briefing",
            "url": "https://www.zimeye.net/2025/05/02/football-fans-slam-mapezas-outburst-during-media-briefing/",
            "content": "Sports Correspondent\n\nOnce again, Norman Mapeza has found himself at the centre of controversy.After overseeing a dominant FC Platinum performance that saw them comfortably dispatch a struggling CAPS United side at Rufaro Stadium on Wednesday, the coach made headlines not for the football, but for a fiery exchange with the media.\n\nA brace from Thandolwenkosi Ngwenya, scored on either side of halftime, sealed a well-earned second victory of the season for the Zvishavane-based outfit in the 2025 Castle Lager Premier Soccer League. While the match itself was a showcase of fluid football and tactical discipline, what followed overshadowed the on-field display.\n\nDuring the post-match press conference, a journalist posed a seemingly routine question regarding FC Platinums previously inconsistent scoring form. The inquiry touched on whether Mapeza still had concerns about his teams conversion rate, given their improved showing in recent games. That was the spark.\n\nMapeza, visibly agitated, launched into a tirade, pointing a finger and accusing the reporter of misrepresenting him.You have got a problem my friend, you are a very young man, dont ever make the mistake of putting words in my mouth. If he (the journalist) comes to press conferences next time, I wont speak to the press, Mapeza snapped, before abruptly exiting the room.\n\nHe then took his grievance a step further, claiming the journalists approach could result in restricted access for other members of the media  a threat that raised eyebrows and suggested an inflated sense of self-importance.\n\nThis isnt the first time Mapeza has leaned on his past achievements  including his UEFA Champions League experience with Galatasaray  to position himself as above criticism. Yet, such behavior runs contrary to the professional standards seen in European football, where difficult questions are part of the job, and decorum is expected in response.\n\nIronically, Mapezas frustration stemmed from a question rooted in reality. Despite denying any previous expression of concern over his sides lack of goals, the coach had in fact voiced such worries. Ahead of a goalless draw with MWOS on March 27, he remarked: Goals are not coming, I dont think Im the only coach who is worried about lack of goals. Other coaches are worried too because goals are just not coming.\n\nHis outburst, therefore, not only reflected poorly on his temperament but also contradicted his own public statements.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Once again, Norman Mapeza has found himself at the centre of controversy.After overseeing a dominant FC Platinum performance … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/football-fans-slam-mapezas-outburst-during-media-briefing/\">Continue reading<span class=\"screen-reader-text\"> \"Football Fans Slam Mapeza’s Outburst During Media Briefing\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Evidence Of Mnangagwa Administration’s Dismal Failure",
            "url": "https://www.zimeye.net/2025/05/02/evidence-of-mnangagwa-administrations-dismal-failure/",
            "content": "This picture bluntly reflects how Mr Emmerson Mnangagwa's administration has dismally failed to govern the country.The picture was shared by Advocate Nelson Chamisa on Facebook last week.pic.twitter.com/ItBNuNs5DJ\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Chris Mutsvangwa Blames Coltart For Lack Of Development In Bulawayo",
            "url": "https://www.zimeye.net/2025/05/02/chris-mutsvangwa-blames-coltart-for-lack-of-development-in-bulawayo/",
            "content": "By A Correspondent\n\nZANU PF spokesperson Christopher Mutsvangwa has placed the blame for Bulawayos stalled development squarely on the shoulders of the citys mayor, David Coltart, accusing him of prioritizing political agendas over economic progress.\n\nSpeaking during a press briefing held on May 1, Mutsvangwa took aim at Coltart, saying the mayor was failing to recognize the national efforts being made to drive industrial growthparticularly those led by President Emmerson Mnangagwa.\n\nHis Excellency President Dr. E.D. Mnangagwa is committed to providing working capital for the people of Zimbabwe, Mutsvangwa declared, before criticizing Coltart for being oblivious to the developments taking place under the presidents leadership.\n\nMutsvangwa pointed to the launch of a new steel plant as a major success story, saying it marked Zimbabwes emergence as a key player in the regional steel industry. Zimbabwe leads Sub-Saharan Africa in this sector, with only Egypt and Morocco as our closest competitors, he said.\n\nHe argued that steel was critical to any countrys urbanization process and stressed that the presidents efforts were laying a foundation for a modern and industrialized Zimbabwe.\n\nTurning to the state of Bulawayo, Mutsvangwa lamented what he described as a lack of initiative from the citys leadership. Bulawayo should not only be celebrated as the City of Kings and Queens but must also reclaim its status as a thriving industrial hub, he said. He urged residents to hold their mayor accountable: We encourage citizens to ask Mayor Coltart what tangible steps he has taken to restore Bulawayos industrial legacy.\n\nThe ZANU PF official further accused Coltart of being more concerned with tribal disputes and politicking than with attracting investment or driving the citys economic recovery. He recalled a conversation in which he claims Coltart dismissed engaging with a local steel company due to its Chinese ownership.\n\nI posed a question to Mr. Coltart about how he plans to leverage the presence of a modern steel company, but his response was that, since its a Chinese-owned enterprise, he prefers not to be involved, said Mutsvangwa. He has an attitude against the Chinese.\n\nThe remarks are part of a broader pattern in which Mutsvangwa has consistently shifted responsibility for local governance challenges to opposition-led councils, often portraying ZANU PFs initiatives as being obstructed by what he frames as uncooperative or politically motivated local leaders.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent ZANU PF spokesperson Christopher Mutsvangwa has placed the blame for Bulawayo’s stalled development squarely on the shoulders … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/chris-mutsvangwa-blames-coltart-for-lack-of-development-in-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Chris Mutsvangwa Blames Coltart For Lack Of Development In Bulawayo\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Human Rights Defender In Key Meeting With Masvingo City Mayor",
            "url": "https://www.zimeye.net/2025/05/02/human-rights-defender-in-key-meeting-with-masvingo-city-mayor/",
            "content": "Prominent human rights advocate and community activist Prosper Tiringindi met with Masvingo Mayor Councillor Aleck Tabe on Thursday in what is being described as a significant step toward addressing the concerns of local residents.\n\nThe meeting, which took place at the Masvingo Civic Centre, also included Masvingo Town Clerk Edward Mukaratirwa. Tiringindi, known for his relentless activism and repeated arrests in the course of defending human rights, welcomed the engagement as a breakthrough in fostering dialogue between local government and the community.\n\nIt was a great experience meeting and engaging in discussion with Masvingo Town Clerk Edward Mukaratirwa and Mayor Aleck Tabe at the Masvingo Civic Centre  truly a memorable moment, Tiringindi said.\n\nWhile details of the discussions remain private, sources close to the meeting indicated that issues raised included service delivery challenges, housing concerns, and citizen participation in municipal affairs.\n\nTiringindis involvement in community issues has often placed him at odds with authorities, but the recent meeting suggests a possible shift toward more collaborative engagement.\n\nLocal observers say the meeting reflects growing pressure on municipal leaders to be more responsive to public concerns amid mounting economic and infrastructure challenges in Masvingo.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Prominent human rights advocate and community activist Prosper Tiringindi met with Masvingo Mayor Councillor Aleck Tabe on Thursday in what … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/02/human-rights-defender-in-key-meeting-with-masvingo-city-mayor/\">Continue reading<span class=\"screen-reader-text\"> \"Human Rights Defender In Key Meeting With Masvingo City Mayor\"</span></a></p>",
            "time": "20:26",
            "date": "03 May 2025"
        }
    ]
}