{
    "news": [
        {
            "title": "Citizen Heroine Gogo Chihera Dies",
            "url": "https://www.zimeye.net/2025/01/29/citizen-heroine-gogo-chihera-dies/",
            "content": "By Munacho Gwamanda- A devoted supporter of Zimbabwes most charismatic opposition leader, Nelson ChamisaMbuya Idah Hanyani, , has died.\n\nAffectionately known as Gogo Chihera, she was celebrated as a Citizen Heroine and golden girl for her unwavering commitment to the fight for change.\n\nChamisa, who enjoys overwhelming grassroots support despite stepping away from the Citizens Coalition for Change (CCC) last year, paid tribute to Hanyani in a heartfelt post on Wednesday on X (formerly Twitter).\n\nA SAD LOSS Just received the tragic news of the passing of a Citizen Heroine, the golden girl, Idah Hanyani AKA Gogo Chiheraadmired by many for her courage, determination, and sacrifice fueled by her unbridled passion for change in Zimbabwe. Rest In Power, Gogo!\n\nHanyani was a steadfast pillar of the opposition movement, embodying the resilience and hope of ordinary Zimbabweans seeking a better future.\n\nChamisa remains the countrys most influential opposition figure despite Zanu PFs infiltration of the CCC, which led him to disown the party after Sengezo Tshabangu hijacked it.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Munacho Gwamanda- A devoted supporter of Zimbabwe’s most charismatic opposition leader, Nelson ChamisaMbuya Idah Hanyani, , has died.  Affectionately … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/citizen-heroine-gogo-chihera-dies/\">Continue reading<span class=\"screen-reader-text\"> \"Citizen Heroine Gogo Chihera Dies\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Nelson Chamisa Announces Death Of  Citizens’ Struggle Veteran",
            "url": "https://www.zimeye.net/2025/01/29/nelson-chamisa-announces-death-of-citizens-struggle-veteran/",
            "content": "By A Correspondent\n\nOpposition leader Advocate Nelson Chamisa has expressed deep sorrow following the death of Idah Hanyani, better known as Gogo Chihera, a beloved veteran of Zimbabwes citizens struggle.\n\nGogo Chihera, admired for her unwavering commitment to the cause of change, was remembered by many for her courage, determination, and the sacrifices she made in her fight for a better Zimbabwe.\n\nIn a heartfelt statement on Wednesday, Advocate Chamisa conveyed his condolences, saying, A SAD LOSS Just received the tragic news of the passing of a Citizen heroine, the golden girl, Idah Hanyani AKA GOGO CHIHERA  admired by many for her courage, determination and sacrifice fueled by her unbridled passion for change in Zimbabwe  Rest In Power Gogo!\n\nGogo Chihera, often referred to as a symbol of resilience, played an influential role in the fight for social and political transformation. Her commitment to her beliefs made her a cherished figure in Zimbabwe, earning her the admiration of people from all walks of life.\n\nAdvocate Chamisas tribute highlights not only her contributions to the struggle but also the profound impact she had on those who fought alongside her. He emphasized her enduring legacy, saying that Gogo Chiheras life was a testament to unbridled passion for change.\n\nHer passing marks a significant loss to the opposition movement and the citizens struggle for justice in Zimbabwe. As Zimbabweans continue to mourn her death, many will reflect on her legacy, honoring her contributions to the fight for a free and fair nation.\n\nRest In Power, Gogo is a sentiment that echoes across social media platforms and among many in the opposition who hold her memory dear. Her death is a reminder of the sacrifices made by those who fought tirelessly for the rights and freedoms of the people of Zimbabwe.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Opposition leader Advocate Nelson Chamisa has expressed deep sorrow following the death of Idah Hanyani, better known … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/nelson-chamisa-announces-death-of-citizens-struggle-veteran/\">Continue reading<span class=\"screen-reader-text\"> \"Nelson Chamisa Announces Death Of  Citizens’ Struggle Veteran\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Condom Shortage Looms As Trump Withdraws Funding",
            "url": "https://www.zimeye.net/2025/01/29/condoms-shortage-looms-as-trump-withdraws-funding/",
            "content": "Washington, DC- A severe shortage of HIV treatment supplies is looming after US President Donald Trump imposed a 90-day freeze on all foreign aid spending, including funding for HIV programs, in a move that threatens to unravel decades of US-led global health initiatives.\n\nThe State Department confirmed in a memo that the freeze affects current foreign assistance programs, including thePresidentsEmergency Plan for AIDS Relief (PEPFAR), which has been instrumental in fighting HIV/AIDS worldwide.\n\nThe suspension extends to the United States Agency for International Development (USAID), further jeopardizing efforts to combat tuberculosis (TB)globally.\n\nThe decision has drawn sharp criticism from global health organizations, warning that even short disruptions can have devastating consequences.\n\nPEPFAR, launched in 2003 by then-President George W. Bush, has been one of the most significant global health programs in history.\n\nWith a total of $100 billion spent, itstands asthelargestpublic health commitment by anysinglecountry to fight a specific disease.\n\nThe program operates in over 50 countries and is credited with savingupwards of26 million lives.\n\nPEPFAR provides antiretroviral treatment for millions, conducts crucial HIV testing, and supports maternal and child health initiatives, particularly in Africa, which remains theepicenterof the epidemic.\n\nDespite political shifts in Washington, PEPFAR has enjoyed bipartisan support across four presidential administrations.\n\nHowever,Trumpsfreeze signals a departure from this long-standing consensus, injecting uncertainty into global HIV/AIDS relief efforts.\n\nThe consequences of the funding halt could be catastrophic.\n\nThe Foundation for AIDS Research (amFAR) warns that the abrupt cessation of PEPFAR-supported programs will result in unnecessary suffering and increased transmission rates.\n\nMore than 190,000 clinicians and healthcare workers worldwide rely on PEPFAR support, and the sudden halt could disrupt essential HIV treatment services, testing, and prevention efforts.\n\nAccording to amFAR, PEPFAR funds:\n\nUSAID, another pillar of US global health assistance, has invested $4.7 billion in TB programs since 2000.\n\nWith its funding now suspended, progress against TBone of theworldsdeadliest infectious diseasesmay be severely hindered.\n\nGlobal health experts are sounding the alarm over the repercussions ofTrumpsdecision. Dr. Madhukar Pai, a professor at McGill University and associate director of the McGill International TB Centre, called this acrisis momentfor global health and development.\n\nThe US government has played a critical role in fighting HIV and TB globally, and this freeze could undo years of progress,Pai said.I hope the global health community rallies to advocate for continued US support.\n\nHowever, Pai also sees an opportunity for other nations to step up in response to the US withdrawal.\n\nThis could be a wake-up call for global health to be less dependent on any single donor,he noted.African nations, for instance, could use this moment to increase local manufacturing of essential medicines and vaccines, reducing reliance on foreign aid. Likewise, G7 and G20 nations should consider filling the funding gap left by the US.\n\nAs of last week, all US foreign assistance remains frozen for at least 90 days pending a review, thoughthe period could be extended. IfTrumpsfunding pause continues, millions of lives could be at risk, and the US risks losing its position as a leader in global health diplomacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Washington, DC- A severe shortage of HIV treatment supplies is looming after US President Donald Trump imposed a 90-day freeze … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/condoms-shortage-looms-as-trump-withdraws-funding/\">Continue reading<span class=\"screen-reader-text\"> \"Condom Shortage Looms As Trump Withdraws Funding \"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Trump Halts HIV Funding For Africa",
            "url": "https://www.zimeye.net/2025/01/29/trump-halts-hiv-funding-for-africa/",
            "content": "Washington, DC- President Donald Trump has imposed a 90-day freeze on all foreign aid spending, including funding for HIV programs, in a move that threatens to unravel decades of US-led global health initiatives.\n\nThe State Department confirmed in a memo that the freeze affects current foreign assistance programs, including thePresidentsEmergency Plan for AIDS Relief (PEPFAR), which has been instrumental in fighting HIV/AIDS worldwide.\n\nThe suspension extends to the United States Agency for International Development (USAID), further jeopardizing efforts to combat tuberculosis (TB)globally.\n\nThe decision has drawn sharp criticism from global health organizations, warning that even short disruptions can have devastating consequences.\n\nPEPFAR, launched in 2003 by then-President George W. Bush, has been one of the most significant global health programs in history.\n\nWith a total of $100 billion spent, itstands asthelargestpublic health commitment by anysinglecountry to fight a specific disease.\n\nThe program operates in over 50 countries andis creditedwith savingupwards of26 million lives.\n\nPEPFAR provides antiretroviral treatment for millions, conducts crucial HIV testing, and supports maternal and child health initiatives, particularly in Africa, which remains theepicenterof the epidemic.\n\nDespite political shifts in Washington, PEPFAR has enjoyed bipartisan support across four presidential administrations.\n\nHowever,Trumpsfreeze signals a departure from this long-standing consensus, injecting uncertainty into global HIV/AIDS relief efforts.\n\nThe consequences of the funding halt could be catastrophic.\n\nThe Foundation for AIDS Research (amFAR) warns that the abrupt cessation of PEPFAR-supported programs will result in unnecessary suffering and increased transmission rates.\n\nMore than 190,000 clinicians and healthcare workers worldwide rely on PEPFAR support, and the sudden halt could disrupt essential HIV treatment services, testing, and prevention efforts.\n\nAccording to amFAR, PEPFAR funds:\n\nUSAID, another pillar of US global health assistance, has invested $4.7 billion in TB programs since 2000.\n\nWith its funding now suspended, progress against TBone of theworldsdeadliest infectious diseasesmay be severely hindered.\n\nGlobal health experts are sounding the alarm over the repercussions ofTrumpsdecision. Dr. Madhukar Pai, a professor at McGill University and associate director of the McGill International TB Centre, called this acrisis momentfor global health and development.\n\nThe US government has played a critical role in fighting HIV and TB globally, and this freeze could undo years of progress,Pai said.I hope the global health community rallies to advocate for continued US support.\n\nHowever, Pai also sees an opportunity for other nations to step up in response to the US withdrawal.\n\nThis could be a wake-up call for global health to be less dependent on any single donor,he noted.African nations, for instance, could use this moment to increase local manufacturing of essential medicines and vaccines, reducing reliance on foreign aid. Likewise, G7 and G20 nations should consider filling the funding gap left by the US.\n\nAs of last week, all US foreign assistance remains frozen for at least 90 days pending a review, thoughthe period could be extended. IfTrumpsfunding pause continues, millions of lives could be at risk, and the US risks losing its position as a leader in global health diplomacy.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Washington, DC- President Donald Trump has imposed a 90-day freeze on all foreign aid spending, including funding for HIV programs, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/trump-halts-hiv-funding-for-africa/\">Continue reading<span class=\"screen-reader-text\"> \"Trump Halts HIV Funding For Africa\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Man Jailed For Killing Daughter",
            "url": "https://www.zimeye.net/2025/01/29/man-jailed-for-killing-daughter/",
            "content": "By A Correspondent\n\nA devastating incident in Phola, near Witbank, has led to a 60-year-old father, Fanie Petros Mtshali, being sentenced to 15 years in prison for murdering his daughter. The Witbank Regional Court delivered the verdict on January 21, 2025.\n\nThe tragic events unfolded on September 10, 2022, when the victim arrived home around 11 pm, prompting a confrontation with her father. A heated argument ensued, with the father reprimanding his daughter for her late arrival.\n\nIn a moment of uncontrolled anger, the father slapped his daughter, causing her to fall onto a television set. Sadly, she suffered fatal injuries and passed away at the scene.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent A devastating incident in Phola, near Witbank, has led to a 60-year-old father, Fanie Petros Mtshali, being … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/man-jailed-for-killing-daughter/\">Continue reading<span class=\"screen-reader-text\"> \"Man Jailed For Killing Daughter\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "AFCON 2025 : Warriors Face Mighty Pharaohs, Bafana Bafana",
            "url": "https://www.zimeye.net/2025/01/29/afcon-2025-warriors-face-mighty-pharaohs-bafana-bafana/",
            "content": "Sports Correspondent\n\nThe Zimbabwe mens football team, the Warriors, have been placed in Group B for the 2025 Africa Cup of Nations (AFCON), alongside football powerhouses Egypt, regional rivals South Africa, and Southern Africa neighbours Angola.\n\nThe draw, which took place in Rabat, Morocco on Monday, sets up a challenging path for the Warriors as they face some of the continents top teams. Egypt, with their rich footballing history, is expected to be a particularly tough opponent, while South Africa and Angola will also provide stiff competition.\n\nThe AFCON 2025 tournament is set to be held in Morocco from December 21, 2025, to January 18, 2026.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe men’s football team, the Warriors, have been placed in Group B for the 2025 Africa Cup … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/afcon-2025-warriors-face-mighty-pharaohs-bafana-bafana/\">Continue reading<span class=\"screen-reader-text\"> \"AFCON 2025 : Warriors Face Mighty Pharaohs, Bafana Bafana\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "ZIMRA To Introduce Tax For Sheep And Goats",
            "url": "https://www.zimeye.net/2025/01/29/zimra-to-introduce-tax-for-sheep-and-goats/",
            "content": "By A Correspondent\n\nThe Zimbabwe Revenue Authority (ZIMRA) has intensified its efforts to boost its revenue collection, announcing new tax measures targeting livestock this week. This move has raised concerns among already struggling citizens, particularly farmers, who are now being asked to include the value of their livestocksuch as goats, sheep, and other animalsas part of their gross income for tax purposes.\n\nZIMRAs latest initiative is in line with Section 8 (1) (h) of the Income Tax Act, which mandates farmers to include the closing stock value of livestock in their income reports. According to the law, livestock includes not only cattle, sheep, and goats, but also pigs, crocodiles, poultry, ostriches, zebras, and horses. These animals are further classified into stud livestock, which are kept for breeding, and ordinary livestock, which are either born on the farm or purchased for purposes other than breeding.\n\nFarmers must report the value of their livestock at the close of the year, which is incorporated into their gross income for tax calculations. To determine this closing value, farmers can choose from various valuation methods, but these methods must be approved by the ZIMRA Commissioner.\n\nAs ZIMRA stated, The reviewed values must be approved by the Commissioner, emphasizing the need for approval for any adjustments.\n\nThis new move comes at a time when many Zimbabweans are already facing severe economic hardships, and farmers are expressing concerns that these measures could add further strain.\n\nOne farmer, who wished to remain anonymous, shared their frustrations: Were struggling to feed our families, let alone deal with more government regulations- that will only add to our financial burden.\n\nCritics argue that this latest tax imposition will only exacerbate the economic challenges faced by smallholder farmers, particularly those who rely heavily on livestock for their livelihoods.\n\nDespite the concerns, ZIMRA maintains that the new measures are necessary to increase government revenue. A spokesperson for the authority stated, As a country, we need to ensure that every taxable item, including livestock, is properly accounted for in order to sustain public services.\n\nFarmers, however, remain skeptical, wondering whether this new tax system will further push them into deeper financial trouble. The pressure is mounting for both the government and citizens to find a balance between revenue generation and economic survival in a nation already grappling with inflation and unemployment.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Revenue Authority (ZIMRA) has intensified its efforts to boost its revenue collection, announcing new tax … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/zimra-to-introduce-tax-for-sheep-and-goats/\">Continue reading<span class=\"screen-reader-text\"> \"ZIMRA To Introduce Tax For Sheep And Goats\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Time For Change Is Now: Chamisa’s Message To Zimbabweans",
            "url": "https://www.zimeye.net/2025/01/29/time-for-change-is-now-chamisas-message-to-zimbabweans/",
            "content": "By A Correspondent\n\nZimbabwes prominent opposition leader, Advocate Nelson Chamisa, has declared that the time has come to address the nations ongoing political crisis, which he argues is hindering the countrys progress and development. In a statement released on Tuesday, Chamisa emphasized the critical need to restore trust between the government and the people in order to foster national unity and success.\n\nThere is no government that can ever prosper, succeed, or be functionally effective when the majority of the citizens are not in agreement with it, Chamisa stated. He went on to stress that the deep-rooted mistrust between the government and the citizens has been a major obstacle to the countrys advancement. We must and will fix this problem, he added, showing his resolve to address the issue head-on.\n\nChamisa, who leads the opposition party Citizens Coalition for Change (CCC), has been vocal about the need for political reforms and greater accountability from the government. His comments come at a time when many Zimbabweans are struggling with economic challenges and feel increasingly alienated from their leadership.\n\nThe lack of faith in the government, according to Chamisa, is not only a political issue but a barrier to economic recovery and national development. The people must have trust in their leaders, and without that trust, the entire nation suffers, Chamisa remarked.\n\nThe opposition leaders call to action highlights the urgency for dialogue and political reconciliation, as Zimbabwe faces a crossroads in its path to stability and prosperity. His comments resonate with many citizens who have long expressed frustration with the current political climate and are eager for change.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwe’s prominent opposition leader, Advocate Nelson Chamisa, has declared that the time has come to address the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/time-for-change-is-now-chamisas-message-to-zimbabweans/\">Continue reading<span class=\"screen-reader-text\"> \"Time For Change Is Now: Chamisa’s Message To Zimbabweans\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Harare Province Junior Football League In Turmoil",
            "url": "https://www.zimeye.net/2025/01/29/harare-province-junior-football-league-in-turmoil/",
            "content": "Sports Correspondent\n\nThe Harare Province Juniors Football Development League (HPJFDL) is facing an uncertain future due to a prolonged leadership crisis. The leagues Annual General Meeting (AGM) and elections, which were expected to usher in new leadership, have been inexplicably delayed.\n\nRumors are rife that the current leadership is deliberately stalling the electoral process, fearing that they will lose their positions if elections are held. This apprehension is fueled by the leagues dismal performance in 2024, which was marred by allegations of financial mismanagement, poorly organized tournaments, and questionable appointments.\n\nThe 2024 season was widely regarded as a disaster, with many clubs and academies expressing frustration with the leagues leadership. As a result, there is a growing consensus among stakeholders to install a new, competent executive to revitalize the HPJFDL.\n\nWith the leagues future hanging in the balance, it remains to be seen when the AGM and elections will be held, and whether the current leadership will relinquish power to make way for a new, more effective administration.\n\nOne thing is certain, however: the status quo is unsustainable, and drastic changes are needed to restore the HPJFDL to its former glory.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Harare Province Juniors Football Development League (HPJFDL) is facing an uncertain future due to a prolonged leadership … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/harare-province-junior-football-league-in-turmoil/\">Continue reading<span class=\"screen-reader-text\"> \"Harare Province Junior Football League In Turmoil\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Bafana Bafana Assistant Coach Speaks On AFCON Draw",
            "url": "https://www.zimeye.net/2025/01/29/bafana-bafana-assistant-coach-speaks-on-afcon-draw/",
            "content": "By A Correspondent\n\nSouth Africas assistant coach, Helman Mkhalele, admitted that his team was hoping to avoid being drawn into the same group as Zimbabwe for the 2025 Africa Cup of Nations (AFCON).\n\nBafana Bafana were placed in Group B alongside Zimbabwe, Angola, and Egypt during the draw, which took place in Rabat, Morocco, on Monday evening.\n\nAhead of the draw, Mkhalele spoke to SABC Sport, expressing his preference: If I had to choose, I wouldnt want South Africa to be in the same group as Zimbabwe, and possibly Nigeria or Benin, as were already facing them in the World Cup qualifiers.\n\nAfter the draw paired South Africa with Zimbabwe in Group B, Mkhalele remarked, Its not a huge surprise that we were drawn with Zimbabwe. We know each other well, and its a tough group. All the teams in the group have improved, so it will be a challenge. We aim to build on the momentum from the last edition.\n\nSouth Africa finished as second runners-up in the 2023 AFCON, after claiming victory in the third-place playoff.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent South Africa’s assistant coach, Helman Mkhalele, admitted that his team was hoping to avoid being drawn into … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/01/29/bafana-bafana-assistant-coach-speaks-on-afcon-draw/\">Continue reading<span class=\"screen-reader-text\"> \"Bafana Bafana Assistant Coach Speaks On AFCON Draw\"</span></a></p>",
            "time": "18:30",
            "date": "29 Jan 2025"
        }
    ]
}