{
    "news": [
        {
            "title": "45 Years After Independence, We Still Failing",
            "url": "https://www.zimeye.net/2025/05/08/45-years-after-independence-we-still-failing/",
            "content": "45 years after independence in this day and age, we still failing to hold free and fair elections\n\nBy Wilbert Mukori | And we are failing to cross the street! remarked President Julius Nyerere of Tanzania was told about the Americans landing on the Moon in 1969.\n\nI have always admired President Nyerere for that quotation. It represents an honest admission of Africas shortcomings and, more significantly, a concerted effort to answer why Africa has lagged behind.\n\nZimbabwe is a failed state. The evidence we are a failed state is there for all to see. I will go straight to the why we are a failed state, and not what time restating the evidence or rebutting the denials.\n\nOne of the reasons why Zimbabwe is a failed state is our failure to hold free, fair and credible elections. The nation has been stuck with this corrupt, incompetent and murderous Zanu PF dictatorship for 45 years and counting. The party has rigged elections to stay in power and, up to now at least, the nation has all but failed to stop Zanu PF rigging elections.\n\nIt is no secret that Zanu PF has an inbuilt electoral majority from the rural vote. Zanu PF withdraw many of its freedom fighters to Assembly Points as agreed in the Lancaster House Agreement during the 1980 elections. The operatives remained in the field and their election campaign message was that if Zanu PF did not win the elections, the bush war would continue. Many of the rural areas with these Zanu PF operatives were no go areas for other contesting parties.\n\nThe rural voters, at least, voted to end the bush. One does not argue looking up the business end of an AK47 rifle!\n\nRural areas have remained, to this day, Zanu PF strongholds and no go areas for all the other parties. Zanu PF kept the rural folk poor by deliberately denying title deeds to even a few square metres of land on which their mud huts stand. This is the one right that would mean everything to these people and would set them for meaningful economic and political empowerment.\n\nIt is no surprise that Ian Smiths white colonial regime realised this and it too denied rural blacks title deeds for the same selfish political reasons.\n\nIndeed, when blacks was the war of independence was fought over the land issue, that is exactly what they are talking about. Why were the whites allowed to own vast tracks of land and yet the blacks were denied the right to own even a postage stamp size yard!\n\nThe seizure of white owned farms, often accompanied by the gratuitous violence, was supposedly to give the land back to the landless peasants. In practice, the seized farms were given to the Zanu PF ruling elite and their cronies.\n\nMnangagwa has announced the recipients of the former white owned farms will now get title deeds to the farms and with it the full legal ownership rights. The Regime continues to demolish houses in Ruwa and other rural areas where Land Barons had given away land underlining the regimes policy that rural folk must not be given title deeds to any land.\n\nThe bottomline is Zimbabwes rural folk, constituting 60% of the electorate, are nothing more than medieval serfs beholden to the Zanu PF ruling elite and the proxies, the village heads, chiefs, war veterans, Zanu PF militia, etc. It is no secret that party operatives have repeatedly frog-marched rural folk to attend party rallies and to vote for the party. How could Zanu PF lose an election with such a built-in majority?\n\nThe one occasion in the March 2008 election when Zanu PF, under pressure from SADC, was forced to loosen its electoral control, the nearest the country ever got to holding free and fair elections; the party lost the vote. The party intervened to stop the results being announced. The party ordered a recount of 5 million votes which was to last six weeks. The presidential vote count was last to be announced; Tsvangirais 73%, according to Mugabes own Freudian slip, had been whittled down to 47%. Enough to force a run-off.\n\nDuring the run-off Zanu PF launched Operation Mavhotera Papi (Whom did you vote for) desired to punish the voters for having dared to reject the party in the early vote. If anyone had thought Zanu PFs threat to use violence to win elections was a bluff, Operation Mavhotera Papi left no one in any doubt this is not an empty threat.\n\nBoth SADC and AU refused to accept Zanu PFs political legitimacy and forced the party to agree to the formation of GNU. The primary purpose of the GNU was to implement the democratic reforms to end Zanu PFs political struggle hold especially on the rural voters to ensure free, fair and credible elections.\n\nAlas! Morgan Tsvangirai and his MDC friends who were entrusted the task of implementing the democratic reforms during the GNU, failed to implement even one token reform in 5 years. Mugabe bribed them with the trappings of high office, the E-Class Mercedes Benz, the generous salaries and allowances, a US$4 million mansion for Save himself, etc., etc. And in return MDC leaders kick the reforms into the Cactus thicket!\n\nZanu PF emerged out of the GNU with all its carte blanche dictatorial powers including its heavy boot on the throat of the rural voters.\n\nEven now, with the benefit of hindsight, many Zimbabweans have no clue the primary purpose of the GNU was to implement the democratic reforms much less that MDC leaders sold out.\n\nLast month, Zimbabweans observed the countrys 45th year of independence, 45 years of rigged elections and there is nothing to suggest the penny has finally dropped. The nation will be going into its next elections with the same skewed electoral system in which Zanu PF thugs retain their heavy boot on the throat of the rural voters to guarantee the partys in-built majority.\n\n45 years after independence and we are still failing to cure ourselves of the curse of rigged elections and bad governance. We are failing to cross the street when others are landing on the Moon.\n\nAnd the LORD said unto Cain, Where is Abel thy brother? And he said, I know not: Am I my brothers keeper? And he said, What hast thou done? the voice of thy brothers blood crieth unto me from the ground. And now art thou cursed from the earth, which hath opened her mouth to receive thy brothers blood from thy hand. Genesis 4: 9  11.\n\nForget being our brothers keep; by turning a blind eye to Zanu PF thugs keeping their heavy boots on the neck of the rural people we denied ourselves the blessing of good governance. 45 years after independence in this day and age and we still failing to cross the street of free and fair elections.Of course we deserve to suffer the curse of rigged elections.-SOURCE: zimbabwelight.blogspot.com\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "45 years after independence in this day and age, we still failing to hold free and fair elections By Wilbert … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/45-years-after-independence-we-still-failing/\">Continue reading<span class=\"screen-reader-text\"> \"45 Years After Independence, We Still Failing\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "Three Die In Mashava Horror Crash, Hours After Six Killed In Gweru Bus Disaster",
            "url": "https://www.zimeye.net/2025/05/08/three-die-in-mashava-horror-crash-hours-after-six-killed-in-gweru-bus-disaster/",
            "content": "By A CorrespondentTragedy struck again on Zimbabwes roads on Wednesday asthree people were killed in a horrific head-on collisioninvolving a BMW and a haulage truck betweenMhandamabwe and Mashava, just hours after a separate accident claimed six lives inGweru.\n\nAccording to police and eyewitness accounts, the BMW sedan, carrying the now-deceased, wasreduced to wreckage following a violent crash with an oncoming haulage truck. All occupants of the BMW died on the spot. Images from the scene show mangled metal and shattered glass strewn across the highway, as emergency responders worked to clear the wreckage.\n\nThe Mashava crash occurred the same morning as another fatal road accident involving aHarare-bound Hungwe Coaches bus, which overturned near theFairmile Hotel roundabout in Gweru, killingsix people instantly.\n\nThe Gweru accident has shocked the Midlands province, with survivors and witnesses attributing the tragedy tobrake failure. The bus, which was travelling from Bulawayo, reportedlyfailed to negotiate a roundaboutand overturned with dozens of passengers on board.\n\nI was sitting at the front, close to the driver, when the accident occurred, said one survivor. As we approached the roundabout, the driver said he was losing the brakes. The bus suddenly picked up speed and overturned. I was lucky to escape. Within five minutes, ambulances began arriving to assist the injured.\n\nGweru City Council CEO,Mr Felix Muguti, confirmed that emergency services responded swiftly after receiving a distress call around 7 a.m. We immediately activated our network of ambulance services and engaged military personnel. So far, we have retrievedsix bodies, including that of a minor, he said.\n\nSeveral passengers were rescued and rushed toGweru General Hospital, where they are receiving treatment for various injuries.\n\nThe two fatal accidents in a single day have once again raisedconcerns over road safetyin Zimbabwe, particularly involving long-distance buses and haulage trucks. Authorities are expected to issue formal statements and possibly launch investigations into the causes of both crashes.\n\nAs families mourn and victims fight for their lives in hospital, the nation is reminded of theurgent need for stricter enforcement of roadworthiness checks and improved driver trainingacross the countrys highways.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent– Tragedy struck again on Zimbabwe’s roads on Wednesday as three people were killed in a horrific head-on collision involving a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/three-die-in-mashava-horror-crash-hours-after-six-killed-in-gweru-bus-disaster/\">Continue reading<span class=\"screen-reader-text\"> \"Three Die In Mashava Horror Crash, Hours After Six Killed In Gweru Bus Disaster\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "JUST IN: American Cardinal Robert Prevost Elected New Pope",
            "url": "https://www.zimeye.net/2025/05/08/just-in-american-cardinal-robert-prevost-elected-new-pope/",
            "content": "VATICAN CITY  The Roman Catholic Church has elected its first-ever American pope. Cardinal Robert Prevost, a 69-year-old prelate from Chicago, Illinois, has been chosen as the 267th pontiff, assuming the papal namePope Leo XIV.\n\nHis election comes in the wake of the death ofPope Francis, who passed away last week at the age of 88 after a period of declining health. Francis, born Jorge Mario Bergoglio of Argentina, made history in 2013 when he became the first Jesuit pope, the first from the Global South, and the first non-European pontiff in over 1,200 years. His decade-long papacy was marked by bold reforms aimed at decentralizing church authority, addressing sexual abuse scandals, and promoting a more inclusive and socially engaged church.\n\nFollowing Francis death, the College of Cardinals convened a conclave inside the Sistine Chapel  a centuries-old tradition  to elect a successor. After two days of voting, white smoke billowed from the chimney above the chapel, signaling that a new pope had been chosen.\n\nWho is Pope Leo XIV?\n\nBorn in 1955, the new pope has a background deeply rooted in both pastoral care and church governance. Cardinal Prevost began his ecclesiastical career as a missionary in Peru, where he served for years in impoverished communities. He was later appointed bishop in the country and became known for his advocacy for indigenous rights and social justice.\n\nMore recently, he served as the prefect of theDicastery for Bishops, one of the most powerful positions in the Vatican, overseeing the appointment of bishops around the world  a role that earned him respect among conservatives and reformists alike.\n\nA polyglot fluent in Spanish, Italian, and English, Prevost is widely regarded as a bridge-builder with a pragmatic approach to leadership. Analysts expect him to continue Pope Francis path of reform while possibly restoring a more traditional tone in liturgical matters.\n\nThe Election Process\n\nThe conclave was composed of 133 cardinal-electors, all of whom were sequestered from the outside world during the voting process in accordance with Vatican protocol. A two-thirds majority  at least 89 votes  was required to elect the new pope.\n\nWhile the full details of the voting remain secret, insiders suggest Prevost emerged as a consensus candidate capable of uniting a divided College of Cardinals, many of whom were appointed by Pope Francis but who also harboured concerns about the churchs future direction.\n\nWhat Comes Next\n\nPope Leo XIV is expected to address the faithful from the balcony of St. Peters Basilica later today. His choice of the name Leo may signal an intention to emulatePope Leo XIII, known for his social teachings and defense of workers rights in the 19th century.\n\nThe global Catholic community now looks ahead with cautious optimism as a new chapter begins, balancing tradition and transformation under the stewardship of its first American pontiff.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "VATICAN CITY – The Roman Catholic Church has elected its first-ever American pope. Cardinal Robert Prevost, a 69-year-old prelate from … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/just-in-american-cardinal-robert-prevost-elected-new-pope/\">Continue reading<span class=\"screen-reader-text\"> \"JUST IN: American Cardinal Robert Prevost Elected New Pope\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "Caps United Keen to Punish Students",
            "url": "https://www.zimeye.net/2025/05/08/caps-united-keen-to-punish-students/",
            "content": "Sports Correspondent\n\nCaps United are set to face Herentals in a Castle Lager Premier Soccer League match at Rufaro Stadium this coming weekend. The Harare giants have expressed their intent to secure a decisive victory, referring to the upcoming match as setting the May examination for The Students.\n\nIn their recent statement, Caps United declared:\n\nWe are setting the May examination for The Students!!!!!\n\nThe Green Machine will be looking to avenge their narrow 1-0 loss to Herentals in the previous encounter at Rufaro Stadium on July 21, 2024. In that match, Herentals secured a victory with a goal in the 62nd minute, capitalizing on a defensive error by Caps Uniteds goalkeeper, Tonderai Mateyaunga.\n\nCaps United will be aiming to perform better, especially after a series of challenging results.\n\nThe Harare giants have been working on refining their strategies and improving their finishing to ensure they capitalize on scoring opportunities.\n\nHerentals, on the other hand, will be looking to continue their strong performances and pose a challenge to Caps Uniteds aspirations. The Students have shown resilience and will be eager to maintain their competitive edge.\n\nAs the match approaches, both teams are gearing up for what promises to be an exciting encounter at Rufaro Stadium. Caps United will be hoping to turn the tables and secure a crucial win to boost their position in the league standings.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Caps United are set to face Herentals in a Castle Lager Premier Soccer League match at Rufaro Stadium … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/caps-united-keen-to-punish-students/\">Continue reading<span class=\"screen-reader-text\"> \"Caps United Keen to Punish Students\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "Zanu PF MP In Terrible Road Accident",
            "url": "https://www.zimeye.net/2025/05/08/zanu-pf-mp-in-terrible-road-accident/",
            "content": "ZANU PF MP Involved in Traffic AccidentTractor and ZANU PF Vehicle Collide in TriangleZANU PF Member of Parliament for Chiredzi East Constituency, Siyaki Mundungehama, was involved in a traffic accident this afternoon at Section 13 in Triangle.His vehicle reportedlypic.twitter.com/zNJ1PD16Gd\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "D-day for Fraud accused businessman Michael Gordon Smith",
            "url": "https://www.zimeye.net/2025/05/08/d-day-for-fraud-accused-businessman-michael-gordon-smith/",
            "content": "By A Correspondent| Fraud accused businessman Michael Gordon Smith through his lawyer, Takudzwa Nyambira has advised the court his intentions to file an application for discharge at the close of the state case in which hes facing a plethora of charges.\n\nThe application was made after prosecutor, Anesu Chirenje closed his case before Harare magistrate Ethel Chichera.\n\nSmith stand accused of swindling MA Auto Suppliers out of at over US$38,000 and R124,000, took a dramatic turn as a key witness in the matter detailed financial irregularities before the court.\n\nBusinessman, Mike Asher representing MA Auto Suppliers, narrated how his former trusted Lieutenant masterminded a plan with his accomplice in South Africa to defraud his company.\n\nSeveral email conversations and whatsapp audios retrieved by Police Cyber Unit were heard in court revealed that Smith was the masterminded fraudulent activities against the company.\n\nSometime in October 2019, Michael Scot Asher left for Australia and failed to return due to deadly Covid-19 induced lockdowns world over.\n\nUpon his return, Asher discovered that the company was paying its South African suppliers through a third party called Mant Procurement [Pvt) Ltd.\n\nMant Procurement is incorporated in South Africa and involved, Tony Oatley, his accomplice currently at large.\n\nSmith had not disclosed this arrangement to Asher or the Finance Manager whom he was supposed to work hand in hand with.\n\nHowever, MA Auto Supplies later discovered that Mant Procurement was overcharging the company and as a result, they suffered prejudice in excess of R100 000.\n\nSometime in February 2021, Smith allegedly imported two tents using MA Auto Suppliers (Pvt) Ltds resources. He allegedly sold the tents to one Ms Horsley for US$1 800 and arranged for the pmnt to be made into his personal offshore account in the Isle of Man. No monies were recovered from the accused.\n\nIn October, Smith allegedly used the same modus operandi to import a Station Wagon Rear Bumper and RHS carrier and the customer paid R77112.00 directly into Mant Procurement (Pvt) Ltds FNB account.\n\nOn a separate date, Smith sold, on behalf of MA Auto, a Toyota Land Cruiser 78 series for US$13 000, only US$5500 was recorded in company accounts, with Smith diverting US$7500 to personal use.\n\nAnother Toyota Landcruiser belonging to MA Auto was allegedly sold to his Son Trevor Smith. Despite $5500 being outstanding on the vehicle Smith later sold the Landcruiser privatelyfor $7500 but never remitted any money to the company.\n\nOther evidence tendered by Asher allegedly revealed that pmnt for work done on Smiths other Son Russells vehicles were not paid to MA Auto but amounts offset against a personal loan Smith had with his Son.\n\nMike Asher further tendered evidence revealing Smith did batter trade type of deals with various customers whereby, instead of receiving payments from the customers Smith allegedly arranged free nights at fancy bush camps for him and his wife.\n\nChristine Vellah, the Finance Manager at MA Auto Suppliers testified that she had torrid time to maintain accurate financial records which were obstructed by incomplete information submitted by Smith.\n\nUnder cross-examination by defense attorney Takudzwa Nyambira, Vellah revealed troubling financial activities linked to a South African-based company Mant Procurement, in which Smith held a 50% stake.\n\nVellah also revealed that Mant Procurement funneled company funds without rendering legitimate or tangible services.\n\nShe told the court that police officers from the Cyber Unit department retrieved email and WhatsApp communications indicating that Smith had been in the process of regularising the companys status.\n\nVellah further told the court that an independent contractor charged only 15% for transportation while Smith inflated costs and concealed invoices leading to losses exceeding R100,000.\n\nShe outlined several instances where Smith allegedly misappropriated company funds and assets.\n\nIn one instance, Smith obtained a US$10,000 loan from Cruiser Bond (Pvt) Ltd in November 2020 without informing company officials forcing the firm to cover the full repayment without any documented use of the funds.\n\nAdditionally, in the sale of a Toyota Land Cruiser 78 series for US$13,000, only US$5,500 was accounted for in company records while US$7,500 was allegedly diverted for Smiths personal use.\n\nThe prosecution also claims Smith unlawfully took company property including chairs that he claims to still be in possession of and has been waiting for MA Auto Suppliers to go and retreive from his home and are valued at over R5000 and a 95-liter fridge without making any payment.\n\nIn another case, Smith allegedly instructed Vellah to pay ZW$295,200 in fees for a jointly operated boat despite the company being liable for only ZW$88,250.\n\nSmith never repaid the excess amount.\n\nThe total amount of money that he defrauded the company is estimated to be over US$60 000.State Prosecutor Anesu Chirenje presented documentary evidence, including cash records, invoices, emails, bank statements WhatsApp audios before the court.\n\nAnother witness Takudzwa Honye an IT expert submitted that he downloaded data from their clients Microsoft account.\n\nOn 15 September 2023 our client requested Frampol to print some specific emails from the emails downloaded on 07 November 2023.\n\nAnd then printed the emails as per clients request in the presents of Christine Vellah and Michael Scot Asher of MA Auto Suppliers [Pvt] Ltd and the Investigating Officer Detective Assistant Inspector Samaneka of CID Commercial Crimes Division. I went on to validate the printed emails by stamping and signing all the printed emails.\n\nAnthony Norman Bown also submitted that he approached Michael Gordon Smith as an official from MA Auto Suppliers [Pvt] Ltd after referred as he wanted to purchase a Toyota Land Cruiser rear bumper and a spare wheel carrier from Gobi-X a South African based company.\n\nI approached Gob-X and they referred me to MA Auto as their Zimbabwean agent. I then approached MA Auto and talked to the accused.\n\nThe accused gave me the price and I request to pay using my South Africa ABSA Bank account. The accused then gave me Mant Procurement [Pty) Ltd FNB account 62940151559 and asked me to deposit the money into that account. I then deposited ZAR77 122.00 on 14 October 2022.\n\nThen few weeks later I was contacted by the accused who informed me that they have received the order from Gobi-X and I can come and collect. I then proceeded to MA Auto and collected the items, Bown submitted.\n\nSmith faces multiple charges including two counts of theft of trust property, 12 counts of fraud and 25 counts of corruptly concealing transactions from his principal.\n\nThe case has been remanded to June 2, 2025 were the magistrate will deliver her judgment on the discharge application.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent| Fraud accused businessman Michael Gordon Smith through his lawyer, Takudzwa Nyambira has advised the court his intentions … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/d-day-for-fraud-accused-businessman-michael-gordon-smith/\">Continue reading<span class=\"screen-reader-text\"> \"D-day for Fraud accused businessman Michael Gordon Smith\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "Arsenal Bite Dust",
            "url": "https://www.zimeye.net/2025/05/08/arsenal-bite-dust/",
            "content": "Sports Correspondent\n\nArsenals UEFA Champions League campaign came to an end after Paris Saint-Germain (PSG) secured a 2-1 win (3-1 aggregate) at the Parc des Princes on May 7, 2025. Bukayo Sakas goal wasnt enough to turn the tie around for the Gunners, as Fabian Ruizs stunning shot and Achraf Hakimis clinical finish sealed the victory for PSG.\n\nThe match saw PSG dominate possession, with Arsenal creating several chances but unable to capitalize. Gianluigi Donnarummas exceptional goalkeeping also played a crucial role in PSGs win. With this victory, PSG has booked their spot in the Champions League final against Inter Milan on May 31.\n\nKey Moments:\n\nArsenal now shifts focus to securing a top-four finish in the Premier League.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Arsenal’s UEFA Champions League campaign came to an end after Paris Saint-Germain (PSG) secured a 2-1 win (3-1 … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/arsenal-bite-dust/\">Continue reading<span class=\"screen-reader-text\"> \"Arsenal Bite Dust\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "Forward With Tino Machakaire: Exposing Imploding Health Crisis In Zimbabwe",
            "url": "https://www.zimeye.net/2025/05/08/forward-with-tino-machakaire-exposing-imploding-health-crisis-in-zimbabwe/",
            "content": "Im surprised to see the Minister of Youth Machakaire being vilified for asking the President to check for himself the state of our public hospitals.\n\nAs a ZANU PF member, I stand in support of the Minister. I believe he spoke the truth, and speaking truth to power doesnt mean blind loyalty.\n\nSome of us are not just mindless supporters who sing praises to our superiors; our eyes are open. We need our leaders to deliver.\n\nWe need to see tangible changes in the services provided to the public by our institutions, managed by party appointees.\n\nIts not just the health department thats been neglected. Our school infrastructure is in a sorry state, and the government has failed to provide support grants to schools.\n\nThe Basic Education Assistance Module (BEAM) is insufficient, as the government isnt releasing funds to schools. Teachers are underpaid, and schools are understaffed. Our rural roads have been turned into gullies, yet Zinara collects money from road users every day. Our pensioners have been neglected, despite paying into the National Social Security Authority (NSSA) during their working years. NSSA has failed to keep its promises.\n\nWe cant just keep quiet. We have to speak out. Gone are the days when we waited for opposition parties and civil society to be our voice. With the passing of Morgan Tsvangirai, the opposition has lost its prominent voice. ZANU PF is now both the ruling and opposition party. We call upon the President to visit our hospitals, clinics, schools, universities, rural communities, the elderly, and the disabled to see for himself how people are suffering. If ZANU PF cant solve the peoples problems, then what is it here for? Pamberi nemi Cde Machakaire!\n\nEtiwel Mutero[emailprotected]+263773614293\n\n100M Followers @highlight @followers\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "I’m surprised to see the Minister of Youth Machakaire being vilified for asking the President to check for himself the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/forward-with-tino-machakaire-exposing-imploding-health-crisis-in-zimbabwe/\">Continue reading<span class=\"screen-reader-text\"> \"Forward With Tino Machakaire: Exposing Imploding Health Crisis In Zimbabwe\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "Geza Effect: Mnangagwa Intensifies Search For Social Media Ghosts",
            "url": "https://www.zimeye.net/2025/05/08/geza-effect-mnangagwa-intensifies-search-for-social-media-ghosts/",
            "content": "By A Correspondent\n\nThe Zimbabwe Republic Police is ramping up efforts to silence online dissent, amid concerns of potential social unrest.\n\nCommissioner-General of Police, Stephen Mutamba, revealed that 63 detectives completed a 45-day training course on tracking, response, and investigation, including cybercrime.\n\nWe have intensified the capacitation and skills development of CID Crack teams in the fight against cybercrime, among other high-profile cases, Mutamba said.\n\nThe police forces increased focus on technology suggests a calculated move to thwart online dissent. Mutamba emphasized the importance of improving protocols and tactical preparedness.\n\nThe move has raised concerns about the governments commitment to freedom of expression and assembly.\n\nCitizens may face increased scrutiny and potential repercussions for expressing dissenting views online.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The Zimbabwe Republic Police is ramping up efforts to silence online dissent, amid concerns of potential social … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/geza-effect-mnangagwa-intensifies-search-for-social-media-ghosts/\">Continue reading<span class=\"screen-reader-text\"> \"Geza Effect: Mnangagwa Intensifies Search For Social Media Ghosts\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        },
        {
            "title": "Six Die in Gweru Horror Crash",
            "url": "https://www.zimeye.net/2025/05/08/six-die-in-gweru-horror-crash/",
            "content": "By Crime and Courts Reporter- At least six people were killed and several others injured on Wednesday morning when a Harare-bound Hungwe Coaches bus overturned at a roundabout near the Fairmile Hotel in Gweru.\n\nThe bus, which was travelling from Bulawayo, reportedly failed to negotiate the roundabout and overturned, killing six passengers on the spot.\n\nAccording to an eyewitness who survived the crash, the driver had complained of brake failure moments before the accident.\n\nI was sitting at the front near the driver when it happened. As we approached the roundabout, the driver said he was losing the brakes, and the bus suddenly picked up speed. It then overturned. I managed to escape, and ambulances started arriving within five minutes to assist the injured, the witness said.\n\nRescue authorities confirmed the retrieval of six bodies from the wreckage.\n\nWe received a distress call around 7am and immediately contacted our emergency stakeholders, including ambulance services and the military. We managed to rescue several victims, while the injured were rushed to Gweru General Hospital for treatment. So far, six bodies have been recovered, including that of a minor, said Gweru City Council CEO, Mr Felix Muguti.\n\nEmergency services were praised for their swift response.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- At least six people were killed and several others injured on Wednesday morning when a … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/08/six-die-in-gweru-horror-crash/\">Continue reading<span class=\"screen-reader-text\"> \"Six Die in Gweru Horror Crash\"</span></a></p>",
            "time": "20:38",
            "date": "09 May 2025"
        }
    ]
}