{
    "news": [
        {
            "title": "Gems In Narrow Defeat",
            "url": "https://www.zimeye.net/2024/12/14/gems-in-narrow-defeat/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Netball team, known as the Gems, were narrowly defeated 42-41 by hosts Namibia in their final pool match at the ongoing Africa Netball Cup in Swakopmund. Despite the loss, the Gems secured the top spot in Pool B, earning a place in the tournaments semifinals.\n\nKey Highlights:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Netball team, known as the Gems, were narrowly defeated 42-41 by hosts Namibia in their final … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/gems-in-narrow-defeat/\">Continue reading<span class=\"screen-reader-text\"> \"Gems In Narrow Defeat\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Mai Dhuterere Faces Fraud Charges Over Botched Car Deal",
            "url": "https://www.zimeye.net/2024/12/14/mai-dhuterere-faces-fraud-charges-over-botched-car-deal/",
            "content": "By A Correspondent\n\nDorcas Vambe, wife of musician Mambo Dhuterere, has been arraigned before a Harare Magistrate on fraud charges for allegedly duping a local politician of $16,000 in a botched car deal .\n\nThe Alleged Fraud Scheme\n\nVambe, 36, allegedly connived with her brother Kudakwashe Vambe, who is still at large, to defraud the complainant. The duo claimed they could purchase a Toyota Hilux GD6 in Botswana and import two cars duty-free, using a waiver allegedly granted to Vambe by President Emmerson Mnangagwa as a token of appreciation for her music.\n\nThe Complainants Loss\n\nThe complainant, interested in the deal, handed over $16,000 to Vambe, who acknowledged receipt and committed to delivering two Toyota Hilux GD6 vehicles within two weeks. However, Vambe failed to fulfill her obligation, leading to her arrest.\n\nBail and Court Appearance\n\nVambe was released on $100 bail and is expected to appear in court on January 15, 2025.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Dorcas Vambe, wife of musician Mambo Dhuterere, has been arraigned before a Harare Magistrate on fraud charges … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/mai-dhuterere-faces-fraud-charges-over-botched-car-deal/\">Continue reading<span class=\"screen-reader-text\"> \"Mai Dhuterere Faces Fraud Charges Over Botched Car Deal\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Mnangagwa’s Taxman Targets Churches",
            "url": "https://www.zimeye.net/2024/12/14/mnangagwas-taxman-targets-churches/",
            "content": "By A Correspondent\n\nIn a surprising move, President Emmerson Mnangagwas administration, grappling with financial strain, is now targeting churches to bolster its dwindling revenues.\n\nThis decision has been viewed as a desperate attempt by the government to shore up its ailing coffers.\n\nOn Thursday, the Zimbabwe Revenue Authority (ZIMRA) issued a public notice addressing churches across the country, outlining tax guidelines and inviting them to an upcoming stakeholder engagement. The statement read:\n\nPUBLIC NOTICE:NOTICE TO ALL CHURCHES\n\nThe Zimbabwe Revenue Authority (ZIMRA) wishes to inform all churches about an upcoming Stakeholder Engagement. This forum aims to address tax compliance across all applicable tax categories, as part of ZIMRAs commitment to transparency and compliance support. The date and venue for the engagement will be communicated in due course.\n\nThe notice also provided important tax guidelines for churches, detailing both exempt and taxable income. According to ZIMRA:\n\nExempt IncomeThe following types of income are exempt from income tax:  Donations, Tithes, Offerings, and Contributions: Income received or accrued from donations, tithes, offerings, or contributions made by members or benefactors of the church or its institutions.\n\nHowever, the notice clarified that income generated from trading activities would be subject to taxation. Examples include (but are not limited to):\n\nThis move has raised concerns about the potential financial strain it could place on churches, already grappling with economic challenges.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent In a surprising move, President Emmerson Mnangagwa’s administration, grappling with financial strain, is now targeting churches to … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/mnangagwas-taxman-targets-churches/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa’s Taxman Targets Churches\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Coltart Blasts Peter Ndlovu Over Chivayo Car",
            "url": "https://www.zimeye.net/2024/12/14/coltart-blasts-peter-ndlovu-over-chivayo-car/",
            "content": "By A Correspondent\n\nThe legendary South African publication Kick-Off has strongly criticized former Warriors captain and ex-Highlanders forward Peter Ndlovu for accepting a luxurious vehicle from the controversial Zanu PF businessman Wicknell Chivayo.\n\nNdlovu, who once played for Coventry City, was gifted a brand-new 2024 BMW X6 valued at R2.6 million by Chivayo, known for his involvement in various scandals.\n\nThis act has sparked backlash, with several political figures condemning the former Mamelodi Sundowns star for tarnishing his illustrious reputation.\n\nBulawayo Mayor David Coltart was particularly vocal in his disapproval. He described Ndlovus decision to accept the car as a mockery of his otherwise stellar reputation.\n\nIts sad to note that Peter accepted Chivayos gift.\n\nThe question is, where did the money come from? Coltart questioned, implying that Chivayos financial dealings might not be above board.\n\nThe controversy has cast a shadow over Ndlovus legacy, as critics argue that associating with such a figure could damage his public image.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The legendary South African publication Kick-Off has strongly criticized former Warriors captain and ex-Highlanders forward Peter Ndlovu … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/coltart-blasts-peter-ndlovu-over-chivayo-car/\">Continue reading<span class=\"screen-reader-text\"> \"Coltart Blasts Peter Ndlovu Over Chivayo Car\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Mheuka Chelsea Debut : A Dream Come True",
            "url": "https://www.zimeye.net/2024/12/14/mheuka-chelsea-debut-a-dream-come-true/",
            "content": "By A Correspondent\n\nZimbabwean talent Shim Mheuka has made his senior debut for Chelsea in a 3-1 victory over Astana in the Europa Conference League on Thursday evening.\n\nThe 17-year-old forward was brought on in the 78th minute, replacing Marc Guiu, and played the remainder of the match.\n\nMheuka, who joined Chelseas academy in 2022, has been playing for the U21 team. Born to Zimbabwean parents, he is eligible to represent both England and Zimbabwe at international level.\n\nHis father, Malcolm Mheuka, previously played in Zimbabwes top-flight for teams such as Zimbabwe Saints and Circle Cement.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabwean talent Shim Mheuka has made his senior debut for Chelsea in a 3-1 victory over Astana … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/mheuka-chelsea-debut-a-dream-come-true/\">Continue reading<span class=\"screen-reader-text\"> \"Mheuka Chelsea Debut : A Dream Come True\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Mphoko’s Body Airlifted to Bulawayo",
            "url": "https://www.zimeye.net/2024/12/14/mphokos-body-airlifted-to-bulawayo/",
            "content": "By A Correspondent\n\nThe body of the late former Vice President, Cde Phlekezela Mphoko, was airlifted to Bulawayo on Friday afternoon, according to government sources.\n\nAs of now, the date for Mphokos burial is yet to be announced.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent The body of the late former Vice President, Cde Phlekezela Mphoko, was airlifted to Bulawayo on Friday … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/mphokos-body-airlifted-to-bulawayo/\">Continue reading<span class=\"screen-reader-text\"> \"Mphoko’s Body Airlifted to Bulawayo\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Mnangagwa Assumes Ministerial Duties Again…",
            "url": "https://www.zimeye.net/2024/12/14/mnangagwa-assumes-ministerial-duties-again/",
            "content": "By A Correspondent\n\nPresident Emmerson Mnangagwa once again found himself taking over ministerial duties typically performed by other officials. On Thursday, the President traveled from Harare to Shurugwi to officiate at the commissioning of the newly upgraded Shurugwi-Mhandamabwe Road. Ordinarily, such a task would fall under the purview of the Minister of Transport and Infrastructural Development, but Mnangagwas involvement raises questions about the role of the Minister in overseeing infrastructure projects.\n\nAt the event, President Mnangagwa spoke about the importance of infrastructure development, stating that the country will continue to score major milestones in infrastructure development, by harnessing deliberate policies enunciated by the Second Republic. He emphasized that such projects are central to the vision of the current administration, which has focused heavily on improving Zimbabwes national road network.\n\nThe Shurugwi-Mhandamabwe Road, which had been in poor condition for years, has been transformed into a modern, multi-million dollar road. The project, which involved widening the road and other extensive upgrades, is expected to alleviate traffic congestion and improve connectivity. Notably, this road links the Beitbridge Border Post with towns like Gweru and Kwekwe, offering a new route that avoids the previously winding path through Masvingo.\n\nMnangagwa was pleased to highlight the significance of the roads completion for the Midlands province, commenting, Look at the development which is there now, in the 40s we would say there is one secondary school in one district. Im very happy that this development was registered under the Second Republic. He further noted his pride in the ongoing progress, emphasizing the trajectory of the countrys infrastructure under his administration.\n\nAs Mnangagwa continues to step into roles beyond his presidential duties, one might wonder about the specific responsibilities of the Minister of Transport and Infrastructural Development. Why is the President personally handling tasks traditionally managed by other cabinet members, such as the commissioning of a key infrastructure project?\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent President Emmerson Mnangagwa once again found himself taking over ministerial duties typically performed by other officials. On … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/mnangagwa-assumes-ministerial-duties-again/\">Continue reading<span class=\"screen-reader-text\"> \"Mnangagwa Assumes Ministerial Duties Again…\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Gems Reach Semifinals Despite Narrow Defeat",
            "url": "https://www.zimeye.net/2024/12/14/gems-reach-semifinals-despite-narrow-defeat/",
            "content": "Sports Correspondent\n\nThe Zimbabwe Netball team, known as the Gems, were narrowly defeated 42-41 by hosts Namibia in their final pool match at the ongoing Africa Netball Cup in Swakopmund. Despite the loss, the Gems secured the top spot in Pool B, earning a place in the tournaments semifinals.\n\nKey Highlights:\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent The Zimbabwe Netball team, known as the Gems, were narrowly defeated 42-41 by hosts Namibia in their final … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/14/gems-reach-semifinals-despite-narrow-defeat/\">Continue reading<span class=\"screen-reader-text\"> \"Gems Reach Semifinals Despite Narrow Defeat\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Ex-Minister Loses Car At Gun Point",
            "url": "https://www.zimeye.net/2024/12/13/ex-minister-loses-car-at-gun-point/",
            "content": "By Crime and Courts Reporter- Former cabinet minister and Zanu PF Mashonaland West senator Prisca Mupfumira has become the latest victim of Zimbabwes escalating gun-related crime.\n\nArmed robbers seized her royal blue Isuzu double cab, valued at US$70,000, in Harares Avondale West on the morning of December 11.\n\nThe incident happened when Mupfumiras driver, Edmore Mashasha, went to collect church uniforms from a tailor on Ascot Road at around 7 AM.\n\nWhile waiting for the gate to be opened, two armed men approached the vehicle, pointed a pistol at Mashashas head, and ordered him to move from the drivers seat.\n\nOne of the robbers commandeered the vehicle while the other blindfolded and tied Mashasha, pushing him into the back seat.\n\nThe carjackers sped off before dumping him at an undisclosed location along Mutoko Road.\n\nMashasha managed to free himself and flagged down a passerby who lent him a phone to alert Mupfumira. Police were subsequently notified.\n\nThe Criminal Investigations Department (CID) Vehicle Theft Squad is investigating the case, adding it to the growing list of gun-related crimes plaguing the country.\n\nSince the 2017 military-led coup that ousted long-time ruler Robert Mugabe, Zimbabwe has witnessed a concerning proliferation of firearms.\n\nAnalysts point to political instability, weakened law enforcement, and porous borders as key contributors to the surge in illegal guns.\n\nThis has fueled an alarming rise in violent crimes, including armed robberies, cash heists, carjackings, and home invasions.\n\nThe brazen attack on a high-profile political figures vehicle highlights how gun violence is spiralling out of control, posing a significant threat to public safety.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Crime and Courts Reporter- Former cabinet minister and Zanu PF Mashonaland West senator Prisca Mupfumira has become the latest … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/ex-minister-loses-car-at-gun-point/\">Continue reading<span class=\"screen-reader-text\"> \"Ex-Minister Loses Car At Gun Point\"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        },
        {
            "title": "Welshman, Biti Lose Party Control To Tshabangu",
            "url": "https://www.zimeye.net/2024/12/13/welshman-biti-lose-party-control-to-tshabangu/",
            "content": "Political Reporter- Welshman Ncube and Tendai Biti have lost control of the divided CCC after the Parliament approved parliament purges by the CCCs controversial secretary-general Sengezo Tshabangu.\n\nThishas raised tensions within the CCC, led by Welshman Ncube, promptingthem to approach the High Court in Bulawayo to contest the reshuffle, arguing that Tshabangu lacks the authority to make such changes without party approval.\n\nHowever, despite the legal challenge, Parliament announced the changes, appointing Maureen Kademaunga as the new Leader of the Opposition, replacing Lynnette Karenyi Kore, whileNonhlahla Mlotshwawas appointedas the overall Chief Whip of the opposition.\n\nCCC spokesperson Willias Madzimure condemned Parliaments decision to implement the changes.\n\nHe said :\n\nThe matter is before the courtandaccording to theCourtsthe matter willbe heardon Fridayandit is alarming.\n\nIt is shocking that afterthe speaker had been servedwith the court papers, hewent on to makethe arrangement.\n\nAs a party, weare operatingina normaldemocracy where the rule of law is respected when we have such a situation, we approach the courts.\n\nTshabangu assumed control of the party in October 2023 and began recalling dozens of elected representatives, leveraging support from both Parliament and the Judiciary.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Political Reporter- Welshman Ncube and Tendai Biti have lost control of the divided CCC after the Parliament approved parliament purges … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2024/12/13/welshman-biti-lose-party-control-to-tshabangu/\">Continue reading<span class=\"screen-reader-text\"> \"Welshman, Biti Lose Party Control To Tshabangu \"</span></a></p>",
            "time": "2024-12-14 06:43:52"
        }
    ]
}