{
    "news": [
        {
            "title": "White City Crater grass not growing",
            "url": "https://www.zimeye.net/2025/05/20/white-city-crater-grass-not-growing/",
            "content": "On 23 June 2018, a grenade exploded at White City Stadium in Bulawayo, Zimbabwe. The blast occurred at a ZANUPF campaign rally, just after President Emmerson Mnangagwa had finished giving a speech. It was described as an assassination attempt against Mnangagwa, who was unharmed.\n\nGrass not properly growing.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "On 23 June 2018, a grenade exploded at White City Stadium in Bulawayo, Zimbabwe. The blast occurred at a ZANU–PF … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/white-city-crater-grass-not-growing/\">Continue reading<span class=\"screen-reader-text\"> \"White City Crater grass not growing\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Bulawayo Residents living in fear",
            "url": "https://www.zimeye.net/2025/05/20/bulawayo-residents-living-in-fear/",
            "content": "20MAY 2025\n\nMEDIA STATEMENT:MDP\n\nPoliceconfirms receiving acaseof MDPwhich occurred inCowdryparkBulawayo.\n\nOn the 19thof May 2025, at around 1530 hours, the complainanta female adult aged 39 years of Cowdray Park, Bulawayowas alone at her place of residence whenan accused person only known assaHappycame with 07 more male accusedpersonsarmed with machetestoher house. They were driving ablue Nissan UD lorry with no registration plates.The accused personstoldthe complainant that they were looking forSaHappys wife, and the complainant, being allegedly a friend ofNaHappy, was asked to reveal her whereabouts.\n\nThe complainant stated that she did not know her whereabouts and this angered the accused persons who accused her of lying. Theywent on to damage the complainants 200-watt solar panel which was in the yard using stones and also broke four window panels.The complainant immediately phoned ZRP Cowdray Park and reported the matter.Police swiftly reacted to this matterand found the accused persons stillat the scenea scuffle ensued leading to the fleeing of the accused persons.The accused persons were carrying stones threatening to stone the police\n\nWe appeal to members of the publicto desist frommoving around carrying dangerous weapons in public places. Anyone with information that may lead to the arrest of the accused persons to come forward.\n\n.\n\nNOMALANGA MSEBELE (INSPECTOR)\n\nPRESS AND PUBLICRELATIONS OFFICER\n\nBULAWAYO PROVINCE\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "​ 20 MAY 2025 MEDIA STATEMENT: MDP Police confirms receiving a case of MDP which occurred inCowdrypark Bulawayo. On the 19th of May 2025, at around 1530 hours, … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/bulawayo-residents-living-in-fear/\">Continue reading<span class=\"screen-reader-text\"> \"Bulawayo Residents living in fear\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Ngwere  Fights Back: Zimdancehall Star Dismisses $122K UK Lawsuit Over No-Show Allegations",
            "url": "https://www.zimeye.net/2025/05/20/ngwere-fights-back-zimdancehall-star-dismisses-122k-uk-lawsuit-over-no-show-allegations/",
            "content": "By A Correspondent\n\nZimdancehall sensation Jimmy Mudereri, widely known as Silent Killer, has hit back at a US$122,170 lawsuit filed by UK-based promoter Y2K Entertainment Music and Arts, following accusations that he failed to perform at a major international festival.\n\nThe legal action stems from Silent Killers alleged no-show at the SAMA Festival in Leicester on April 19, 2025. According to Y2K Entertainment, the artist was expected to perform alongside a lineup of top Zimbabwean acts, but he allegedly refused to board his flight despite checking in at Robert Gabriel Mugabe International Airport on April 18.\n\nOrganisers say they were forced to make costly last-minute arrangements to replace the artist, leading to significant financial losses and major disruptions to the event.\n\nIn response, Silent Killer has dismissed the lawsuit and expressed his readiness to defend himself in court, maintaining that he will address the matter through proper legal channels.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimdancehall sensation Jimmy Mudereri, widely known as Silent Killer, has hit back at a US$122,170 lawsuit filed … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/ngwere-fights-back-zimdancehall-star-dismisses-122k-uk-lawsuit-over-no-show-allegations/\">Continue reading<span class=\"screen-reader-text\"> \"Ngwere  Fights Back: Zimdancehall Star Dismisses $122K UK Lawsuit Over No-Show Allegations\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Chidziva Acquitted of Rape",
            "url": "https://www.zimeye.net/2025/05/20/chidziva-acquitted-of-rape/",
            "content": "By A Correspondent | ZimEye | Citizens Coalition for Change Member of Parliament, Happymore Chidziva who was accused of raping a minor girl three times last year has been cleared of wrongdoing by a Harare magistrate.\n\nChidziva was found not guilty by magistrate Letwin Rwodzi after a full trial during which he denied the allegations.\n\nIn acquitting him, the court ruled prosecution had insufficient evidence warranting a conviction.\n\nProsecutors were alleging that Chodziva raped the minor after promising her employment and a better life.\n\nThe court heard the first incident allegedly took place at a hotel in Harare in April last year.\n\nChidziva was accused of having given the girl US$25 after the abuse.\n\nIt was also alleged that he instructed her to buy morning after pill using the money to avoid pregnancy.\n\nThe court was further told that Chidziva allegedly abused the girl in July last year.\n\nIt was alleged that she told her that he had found a job for but took her a lodge in Waterfalls where he allegedly raped her again.\n\nIt was also alleged that Chidziva raped the girl in August last year at a hotel in Harare.\n\nAt that time the girl was staying with her friend and her family in Ushewekunze.\n\nHer family had also made a report for a issuing person because the girl did not return home when Chidziva allegedly called her in July 2023.\n\nThe magistrate said there was no evidence linking him to the alleged crime.\n\nRwodzi also said the state failed to prove that Chidziva had promised the minor a job.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent | ZimEye | Citizens Coalition for Change Member of Parliament, Happymore Chidziva who was accused of raping … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/chidziva-acquitted-of-rape/\">Continue reading<span class=\"screen-reader-text\"> \"Chidziva Acquitted of Rape\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Zemura Returns To Action After Lengthy Absence",
            "url": "https://www.zimeye.net/2025/05/20/zemura-returns-to-action-after-lengthy-absence/",
            "content": "Sports Correspondent\n\nJordan Zemura made his much-anticipated comeback on Sunday, stepping onto the field after being sidelined for two months with a calf injury.\n\nThe Zimbabwean international came on as a substitute during Udineses 2-0 Serie A loss to Juventus.\n\nZemura replaced Hassane Kamara, who had to leave the game in the 30th minute due to an injury.\n\nSharing his excitement about returning to competitive play, Zemura posted on social media, I missed that feeling.\n\nAs the team awaits news on Kamaras condition, Zemura is expected to be in contention for a starting spot in Udineses final league match of the season against Fiorentina at the Bluenergy Stadium.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "Sports Correspondent Jordan Zemura made his much-anticipated comeback on Sunday, stepping onto the field after being sidelined for two months … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/zemura-returns-to-action-after-lengthy-absence/\">Continue reading<span class=\"screen-reader-text\"> \"Zemura Returns To Action After Lengthy Absence\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Monya for Hire Slams Bernard Marriott Lusengo",
            "url": "https://www.zimeye.net/2025/05/20/monya-for-hire-slams-bernard-marriott-lusengo/",
            "content": "By Murape Murape\n\nBy A Correspondent\n\nFormer Dynamos player, popularly known as Monya for Hire, has delivered a scathing critique of Bernard Marriott Lusengos leadership, accusing him of running down the once-revered football club.\n\nWe stand with genuine and loyal Dynamos supporters, he declared. Im not speaking out because Im bitter about no longer being at the clubI have a good job that provides for my family. What Im bitter about is how the team has been mismanaged under the current leadership.\n\nMonya emphasized that his passion for Dynamos runs deep and that his criticism stems from love for the club. Serving Dynamos came with sacrifices. Some of us are now living with disabilities because of our time on the pitch, and we are still owed money which we havent even demanded backout of respect for the badge.\n\nHe accused Marriott of ignoring warnings and surrounding himself with unsuitable personnel. During my time at the club, I consistently raised concerns about his leadership. I told him that appointing the wrong people for the wrong reasons would destroy the team. Instead of addressing the issues, I was framed and pushed out.\n\nThe former player also took issue with Marriotts alleged hostility towards club legends. The way he mistreats former players makes you question whether he ever truly played for Dynamos. Just look at how he treated Richard Chihoro (MHDSRIP), a man who stood by him for over 40 years. That speaks volumes about his character.\n\nCalling for a new era of openness, he concluded, We want accountability and transparency, not empty promises. Our concerns are legitimate, and we wont be silenced.\n\nDynamos is more than just a teamits family. All we want is to see it evolve, grow, and thrive, not remain trapped in stagnation.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Murape Murape By A Correspondent Former Dynamos player, popularly known as Monya for Hire, has delivered a scathing critique … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/monya-for-hire-slams-bernard-marriott-lusengo/\">Continue reading<span class=\"screen-reader-text\"> \"Monya for Hire Slams Bernard Marriott Lusengo\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Nyokayemabhunu Case Postponed To May 29",
            "url": "https://www.zimeye.net/2025/05/20/nyokayemabhunu-case-postponed-to-may-29/",
            "content": "Nyokayemabhunu Case Postponed To May 29Source: Yebolady Ipapo Sisonke on Facebook:Court Update: Nyokayemabhunu Case Postponed to May 29, 2025The court appearance for Nyokayemabhunu has been postponed to the 29th of May 2025.To all those who support Cde Snake  \"Rambaipic.twitter.com/AI8InSVTin\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Zimbabweans In Diaspora Vow To Block Auxillia Mnangagwa Trip To UKBy A Correspondent",
            "url": "https://www.zimeye.net/2025/05/20/zimbabweans-in-diaspora-vow-to-block-auxillia-mnangagwa-trip-to-ukby-a-correspondent/",
            "content": "By A Correspondent\n\nZimbabweans based in the United Kingdom have launched a campaign to block First Lady Auxillia Mnangagwas upcoming visit to the UK in June, accusing her of being complicit in human rights abuses and the continued suffering of Zimbabweans under the ZANU-PF regime.\n\nThe First Lady is reportedly expected to attend the FLAIR Summit, where she is slated to speak on womens empowermenta move that has sparked outrage among the Zimbabwean diaspora, who say she has no credibility to speak on such matters.\n\nSpeaking on behalf of the protesters, activist Shamiso Moyo took to Twitter over the weekend, rallying Zimbabweans in the diaspora to unite and act.\n\nTogether we can stop this enabler from coming to the UK. Time to mobilise and say noshe is a cruel woman who enjoys the suffering of fellow women, said Moyo.\n\nMoyo, like many in the diaspora, is accusing Auxillia Mnangagwa of being part of a regime that has overseen economic collapse, political repression, and gender-based violence in Zimbabwe.\n\nZimbabweans, we can stop this tyranny@edmnangagwaif we come together. ED and family must be pushed back. Auxillia needs to be pushed back. She is a mafia and she knows nothing about empowerment of women, she added.\n\nIn one of the more controversial calls, she said, Please gather rotten eggs and bless her with the eggs.\n\nCritics say Mnangagwas appearance at an international womens summit is a stark contradiction to her record back home.\n\nAuxillia Mnangagwa cannot be allowed to come to the FLAIR Summit to speak about women empowerment which she has no clue about. For 45 years she has been part of ZANU-PF which has championed the downfall of Zimbabwe. For the past 8 years she has been a useless First Lady, read another widely circulated post from Moyo.\n\nThe campaign to block her visit comes amid growing frustration among Zimbabweans abroad, many of whom fled the country due to political persecution and economic hardship.\n\nOrganisers are reportedly planning protests and are lobbying UK authorities to deny her entry or at least bar her from participating in the event.\n\nAs of now, there has been no official response from the First Ladys office regarding the planned UK visit or the protests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By A Correspondent Zimbabweans based in the United Kingdom have launched a campaign to block First Lady Auxillia Mnangagwa’s upcoming … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/zimbabweans-in-diaspora-vow-to-block-auxillia-mnangagwa-trip-to-ukby-a-correspondent/\">Continue reading<span class=\"screen-reader-text\"> \"Zimbabweans In Diaspora Vow To Block Auxillia Mnangagwa Trip To UKBy A Correspondent\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "ZLHR challenges the infamous PVO Act at the High Court",
            "url": "https://www.zimeye.net/2025/05/20/zlhr-challenges-the-infamous-pvo-act-at-the-high-court/",
            "content": "The Zimbabwe Lawyers for Human Rights (ZLHR) has approached the High Court seeking an order declaring some provisions of the Private Voluntary Organisations (PVO) Amendment Act unconstitutional and to have them annulled.\n\nAccording to ZLHR, some of these provisions arbitrarily criminalize legitimate and critical development and human rights activities, while imposing excessive regulations on PVOs.\n\nIn an application filed on May 16, ZLHR contended that the PVO Amendment Act, which was enacted and published in the Government Gazette on April 11, 2025, represents a significant infringement on the rights of its members, as the organization is an independent entity established by law.\n\nZLHR opines that the impugned amendments contained in the PVO Amendment Act constitute unconstitutional over-regulation, over legislation and criminalisation of innocent important charitable, developmental and human rights work.\n\nThe organisation further argues that the PVO Amendment Act violates various constitutional rights, including the freedom of assembly and association outlined in section 58(1), freedom of expression under section 61, the right to administrative justice guaranteed by sections 68(1) and (2), the right to a fair hearing protected by section 69(1), (2), and (3), and section 71, which safeguards property rights. ZLHR also claims that the problematic provisions of the PVO Amendment Act are vague, poorly drafted, and grant arbitrary powers, resulting in over-regulation of PVOs.\n\nThe PVO Amendment Act centralises arbitrary power in the hands of the Minister of Public Service, Labour and Social Welfare and the Registrars office, leading to excessive executive interference in the internal operations of PVOs, the organisation said in its application.\n\nIt said these provisions effectively empower the Executive to control PVOs and deregister those deemed undesirable on unclear grounds.\n\nIn light of these concerns, ZLHR seeks a High Court order of constitutional invalidity for sections 4, 5 as read with section 9(5), sections 6, 13A, 14, and 21 of the Private Voluntary Organisations Act (as amended by the PVO Amendment Act) to be declared ultra vires the Constitution and subsequently set aside.\n\nThe order will be subject to confirmation by the Constitutional Court in accordance with section 175(1) of the Constitution, and that any constitutional invalidity ruling issued will be suspended for 12 months following confirmation by the Constitutional Court to allow the respondents time to amend the contested legislation for constitutional compliance.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "The Zimbabwe Lawyers for Human Rights (ZLHR) has approached the High Court seeking an order declaring some provisions of the … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/zlhr-challenges-the-infamous-pvo-act-at-the-high-court/\">Continue reading<span class=\"screen-reader-text\"> \"ZLHR challenges the infamous PVO Act at the High Court\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Calls To Bar Auxillia Mnangagwa From UK Summit Intensify",
            "url": "https://www.zimeye.net/2025/05/20/calls-to-bar-auxillia-mnangagwa-from-uk-summit-intensify/",
            "content": "By Tinashe Sambiri\n\nZimbabweans based in the United Kingdom have launched a campaign to block First Lady Auxillia Mnangagwas upcoming visit to the UK in June, accusing her of being complicit in human rights abuses and the continued suffering of Zimbabweans under the ZANU-PF regime.\n\nThe First Lady is reportedly expected to attend the FLAIR Summit, where she is slated to speak on womens empowermenta move that has sparked outrage among the Zimbabwean diaspora, who say she has no credibility to speak on such matters.\n\nSpeaking on behalf of the protesters, activist Shamiso Moyo took to Twitter over the weekend, rallying Zimbabweans in the diaspora to unite and act.\n\nTogether we can stop this enabler from coming to the UK. Time to mobilise and say noshe is a cruel woman who enjoys the suffering of fellow women, said Moyo.\n\nMoyo, like many in the diaspora, is accusing Auxillia Mnangagwa of being part of a regime that has overseen economic collapse, political repression, and gender-based violence in Zimbabwe.\n\nZimbabweans, we can stop this tyranny@edmnangagwaif we come together. ED and family must be pushed back. Auxillia needs to be pushed back. She is a mafia and she knows nothing about empowerment of women, she added.\n\nIn one of the more controversial calls, she said, Please gather rotten eggs and bless her with the eggs.\n\nCritics say Mnangagwas appearance at an international womens summit is a stark contradiction to her record back home.\n\nAuxillia Mnangagwa cannot be allowed to come to the FLAIR Summit to speak about women empowerment which she has no clue about. For 45 years she has been part of ZANU-PF which has championed the downfall of Zimbabwe. For the past 8 years she has been a useless First Lady, read another widely circulated post from Moyo.\n\nThe campaign to block her visit comes amid growing frustration among Zimbabweans abroad, many of whom fled the country due to political persecution and economic hardship.\n\nOrganisers are reportedly planning protests and are lobbying UK authorities to deny her entry or at least bar her from participating in the event.\n\nAs of now, there has been no official response from the First Ladys office regarding the planned UK visit or the protests.\n\n",
            "image_url": "https://example.com/default-image.jpg",
            "description": "By Tinashe Sambiri Zimbabweans based in the United Kingdom have launched a campaign to block First Lady Auxillia Mnangagwa’s upcoming … <p class=\"link-more\"><a class=\"more-link\" href=\"https://www.zimeye.net/2025/05/20/calls-to-bar-auxillia-mnangagwa-from-uk-summit-intensify/\">Continue reading<span class=\"screen-reader-text\"> \"Calls To Bar Auxillia Mnangagwa From UK Summit Intensify\"</span></a></p>",
            "time": "08:42",
            "date": "21 May 2025"
        }
    ]
}